{"tree_id": "apoc_seed2", "context": "Long ago the bombs fell and the world ended. You are one of the few who is still alive. You are trying to survive by scavenging among the ruins of what is left behind. ", "first_story_block": "You find a car with the keys in the ignition and try to start it. Nothing happens. You keep looking and find another car that looks like it might work. You manage to get the engine started. ", "action_results": [{"action": "drive around looking for any people or stores that might have supplies.", "result": "You drive around the town and see many boarded up buildings, but no people. Eventually you find a store that you think might have supplies.", "action_results": [{"action": "go inside the store and see if there are any supplies.", "result": "It looks like the store has been ransacked and all the shelves are empty. You manage to find a package of granola bars and a flashlight behind the counter.", "action_results": [{"action": "eat a granola bar.", "result": "It tastes just like a granola bar you enjoyed when you were younger. In an instant, you are transported to a school hiking trip. Your mind is awash by the mountain air and the bundles of sticks and leaves that formed the trail. Those days seem so long ago now...", "action_results": [{"action": "Look for other doors inside the store.", "result": "You find the store manager's door, with a set of keys hanging off the lock. The door, though, seems to be blocked from the inside.", "action_results": [{"action": "Push the door to uncover what is blocking it from the inside", "result": null, "action_results": []}, {"action": "Knock on the door, while being prepared for what is inside.", "result": null, "action_results": []}, {"action": "Attempt to break down the door with something heavy.", "result": null, "action_results": []}, {"action": "Use the keys to try to unlock a different door.", "result": null, "action_results": []}]}, {"action": "Check to see if there are any batteries in the flashlight.", "result": "There are batteries in the flashlight but they are dead.", "action_results": [{"action": "Shake the flashlight and see if the batteries might begin to work.", "result": null, "action_results": []}, {"action": "Look through the rubble and see if you can find any new batteries for the flashlight.", "result": null, "action_results": []}, {"action": "Tuck the flashlight into your pocket.", "result": null, "action_results": []}, {"action": "Look around for fresh batteries.", "result": null, "action_results": []}]}, {"action": "Check to see if the flashlight works.", "result": "You push the soft, mushy rubber button and a faint light emerges. You are familiar with this brand of torch and consider keeping it in case you find a better battery.", "action_results": [{"action": "put in jacket pocket", "result": null, "action_results": []}, {"action": "look for dry twigs and kindling", "result": null, "action_results": []}, {"action": "Turn off the light to conserve what battery it has.", "result": null, "action_results": []}, {"action": "Search for more batteries and flashlights.", "result": null, "action_results": []}]}, {"action": "Check the storage rooms for tools and supplies.", "result": "It's clear that whoever ransacked the store, was someone really organized and with a means of transport: even the storage rooms are completely empty.", "action_results": [{"action": "Look in every corner for any possible tools and supplies.", "result": null, "action_results": []}, {"action": "Look underneath all large items for tools and supplies.", "result": null, "action_results": []}, {"action": "Keep travelling to find a different storage room.", "result": null, "action_results": []}, {"action": "Look for the person who cleaned out the storage room.", "result": null, "action_results": []}]}]}]}]}]}