{"tree_id": "apoc_seed1", "context": "Long ago the bombs fell and the world ended. You are one of the few who is still alive. You are trying to survive by scavenging among the ruins of what is left behind. ", "first_story_block": "You are standing outside an old rundown gas station at the edge of town. There are old broken cars surrounding the gas station and on the road. You are extremely hungry and haven't eaten in a few days. ", "action_results": [{"action": "look in the gas station for food. ", "result": "You search the gas station for food, but find nothing you can eat.", "action_results": [{"action": "search the cars for food.", "result": "You search the cars for food, you search three without success, but in the glove compartment of the fourth you find a box of crackers.", "action_results": [{"action": "eat the crackers.", "result": "They remind you of when you needed to eat a bland diet after your operation. You pat yourself on where you remember the incision was made. The scar healed long ago, but the brain remembers. The crackers weren't very nutritious, but some fuel in the tank is better than none.", "action_results": [{"action": "Continue to look for food in the building up ahead.", "result": "You find a moldy sandwich and some peppered beef jerky in an old lunchbox.", "action_results": [{"action": "Snack on the jerky while searching for more food.", "result": null, "action_results": []}, {"action": "Scrape the mold from the sandwich, taste a bite to see if it is edible.", "result": null, "action_results": []}, {"action": "Eat the peppered beef and throw the sandwich to the side", "result": null, "action_results": []}, {"action": "Continue to search for food", "result": null, "action_results": []}]}, {"action": "Look for water for hydration and to fool the stomach until ore food can be found.", "result": "No water can be found in the cars, and suddenly you regret eating salted crackers: you can feel your tongue swelling up, begging for some hydration.", "action_results": [{"action": "Look for a different water source in the vicinity.", "result": null, "action_results": []}, {"action": "Keep walking to see if you can find a supermarket anywhere.", "result": null, "action_results": []}, {"action": "Calm the mind to extend search for hydration.", "result": null, "action_results": []}, {"action": "Look for puddles of water around the area.", "result": null, "action_results": []}]}, {"action": "Search the cars for clothing.", "result": "There is no clothing in the car.", "action_results": [{"action": "Search the car for water.", "result": null, "action_results": []}, {"action": "Look for a store that has clothing.", "result": null, "action_results": []}, {"action": "See if the car runs for temporary transportation and shelter.", "result": null, "action_results": []}, {"action": "Cut the fabric cloth from the seats to create clothing or blankets.", "result": null, "action_results": []}]}, {"action": "Begin to walk towards the nearest town.", "result": "You arrive and, despite the state of things, many store lights seem to be functioning. The first store you encounter is a gun shop. You decide to step inside.", "action_results": [{"action": "Take a gun and some ammo.", "result": null, "action_results": []}, {"action": "Go into a different store to look for food.", "result": null, "action_results": []}, {"action": "Look for a weapon to hunt any animals with.", "result": null, "action_results": []}, {"action": "See if theres any extra food anywhere stored in the shop.", "result": null, "action_results": []}]}]}]}]}]}