{"tree_id": "apoc_seed4", "context": "Long ago the bombs fell and the world ended. You are one of the few who is still alive. You are trying to survive by scavenging among the ruins of what is left behind. ", "first_story_block": "You walk for two hours and take a break. You've left the town you were in and are now in a more rural area. There's a farmhouse to your right and a forest on your left. ", "action_results": [{"action": "go in the farmhouse and look for food.", "result": "You try to open the farmhouse front door, but it's locked. There's a broken window on the right and a shed behind the house.", "action_results": [{"action": "go through the window into the farmhouse. ", "result": "You break the rest of the glass in the window and try to carefully crawl through. You cut yourself on the edges as you're climbing in, but you make it inside. ", "action_results": [{"action": "search the farmhouse for food. ", "result": "You find meat in the fridge that looks like it's gone bad. You also find a can of peas in the bottom of the pantry.", "action_results": [{"action": "Search the farmhouse for tools and utencils.", "result": "You find a broom in the closet and a wooden spoon in the cupboard.", "action_results": [{"action": "Open the van of peas and use the wooden spoon to eat.", "result": "You get the can of peas open and use the wooden spoon to take a bite of them.  They taste horrible, but you are so hungry that you hardly notice.", "action_results": [{"action": "Keep eating the peas.", "result": "As you finish the peas, you feel your stomach begin to turn, and know you are in trouble.  You quickly look around for medicine.", "action_results": [{"action": "Force yourself to vomit out the peas.", "result": "You turn to the nearest bush and release the contents of your stomach, the pain subsides but the hunger returns.", "action_results": []}, {"action": "Try to find a place to lie down.", "result": "You lie down in a chair in the corner.  It's uncomfortable, but you still fall asleep.", "action_results": []}]}, {"action": "Spit the peas onto the ground and stop eating them.", "result": "You begin to feel nauseous and vomit.", "action_results": [{"action": "realize this is from eating after a long time of not eating and force down the peas", "result": "You fight through the nausea and keep the food down.", "action_results": []}, {"action": "throw the can and it bounces off a case of  vegetables you hurriedly  rush over to.", "result": "Looking over the vegetables you feel they are by far uneatable.", "action_results": []}]}]}, {"action": "Sharpen the broom handle into a weapon for protection and use the broom head as a fire starter.", "result": "You put the broom into your bag and carry it around in case you need to protect yourself.", "action_results": [{"action": "Move to bedroom to find more stuff", "result": "As you enter the bedroom, you lead with the sharpened broom handle.  Luckily it is empty, and you quickly pack up a blanket and jacket you find in the closet.", "action_results": [{"action": "there are thermals to wear in the drawers", "result": "It's warm.  You are glad that you found the jacket.", "action_results": []}, {"action": "there are arrows to pick up on the ground", "result": "You walk outside.  There is a deadly silence in the air.", "action_results": []}, {"action": "Try to fit some shoes in your bag that is quickly filling up.", "result": "You open the bag. find some shoe which is Ok for the time being. You wear it", "action_results": []}, {"action": "Turn around to pick up your broom.", "result": "You then hear a loud crashing sound coming from nearbye.", "action_results": []}]}, {"action": "Check that doors are locked", "result": "You find one door is unlocked, leading you to a dark staircase.", "action_results": [{"action": "go down the stairs", "result": "You walk down the dark staircase, cobwebs choking you as you struggle to see.", "action_results": []}, {"action": "close the door without going through the doorway", "result": "You continue walking through the building. You hear a noise and pull out your broom.", "action_results": []}]}]}, {"action": "take the spoon and the broom", "result": "A man appears from another room in the house.", "action_results": [{"action": "Confront him - maybe he has things you can steal.", "result": "You pull out your gun and ask the man what he is doing there.  You notice his bag, and tell him to empty it.", "action_results": [{"action": "Knock the man unconscious.", "result": "You tie the man up to a chair and wait for him to awaken.  You ask him questions about supplies and other information that may be valuable.", "action_results": []}, {"action": "Browse through the stuff the man pulled out of the bag.", "result": "You find nothing of particular value, just the essentials to survive in this wasteland. You notice the man seems almost afraid.", "action_results": []}]}, {"action": "Run away.", "result": "You burst through the front door of the house, knowing the man won't take kindly to you stealing the few things he had left.", "action_results": [{"action": "Look behind  yourself to see if he's chasing you.", "result": "You check behind you, but no one is there.  You are able to slow down.", "action_results": []}, {"action": "Run as fast as you can towards the nearest suitable hiding place.", "result": "You come across another home some distance away.  You hope you can stay for at least awhile as from the looks of it no one else has been here.", "action_results": []}]}]}, {"action": "examine the spoon", "result": "There's a name carved in the wood: Paolo.", "action_results": [{"action": "Take the broom as a weapon", "result": "As I round the corner there is a man standing there. I can only assume it is Paolo.", "action_results": [{"action": "Ask Paolo to join you in your quest for survival.", "result": "Paolo asks what his reward will be.", "action_results": []}, {"action": "Hit Paolo in the head with the broom, knocking him unconscious, then leave a note thanking him for the gift.", "result": "As you leave the feeling of guilt hits you like a bullet. It also passes as quickly as it came along. Fuck Paolo.", "action_results": []}]}, {"action": "Try to find Paolo to be not alone anymore", "result": "Seeing signs of another person gives you hope someone may be out there, even if it is just a sign they were there in the past.  You call out for Paolo, and listen in anticipation.", "action_results": [{"action": "Check another building.", "result": "There are no signs of Paolo, or anyone else in the building.", "action_results": []}, {"action": "Give up as Paolo probably died a long time ago.", "result": "You start to get despondent, but quickly realize that you need to continue.", "action_results": []}]}]}]}, {"action": "Search the farmhouse for other usable supplies.", "result": "You find a medikit, and a flashlight with no batteries.", "action_results": [{"action": "Examine medikit.", "result": "The medikit is very basic.  Still it can come in handy.  You decide to take it with you.", "action_results": [{"action": "Put the medikit into your bag and move on", "result": "You come across a girl lying on the ground. You walk over to her.", "action_results": [{"action": "Check if she is sleeping.", "result": "As you approach you see she is indeed sleeping.", "action_results": []}, {"action": "Yell out \"Hey get up!\"", "result": "You stand over the girl and pour water on her.", "action_results": []}]}, {"action": "Examine flashlight", "result": "It's a large flashlight, if it had batteries it would probably light up a whole room.", "action_results": [{"action": "use the flashlight to look for other supplies", "result": "You search the other rooms using your flashlight.  You come across some bottles of water and put them in your bag.", "action_results": []}, {"action": "use the flashlight to make signals to find other people", "result": "You blink the flashlight off and on.  Eventually, someone calls out to you.  \"Who's there?\" you ask.", "action_results": []}]}]}, {"action": "Take flashlight.", "result": "You go back outside, and you notice the sun is setting: it's a bit darker already.", "action_results": [{"action": "Look in bag for batteries", "result": "You find some batteries and put them into the flashlight and switch in on.", "action_results": [{"action": "Search for shelter for the night.", "result": "You notice a pile of rubble with some large boards, a coutch and a fallen tree. You are able to move some of the debris and create a crevis inside the wrekage. This looks like it could be a safe place for you to sleep tonight.", "action_results": []}, {"action": "Use flashlight to look around for anything you might have missed due to darkness.", "result": "You find an old doll with one missing eye.", "action_results": []}]}, {"action": "Return inside for the night", "result": "It is dark in here so you switch the flashlight on and scan your surroundings looking for a good spot to lie down and sleep.", "action_results": [{"action": "Go to a corner and sleep on the floor.", "result": "You try sleeping, but the floor is too hard.  You look around to see if there is a better place to sleep.", "action_results": []}, {"action": "Look for something comfortable to lay on.", "result": "You don't find anything right away, so you lie down in the corner.", "action_results": []}]}]}, {"action": "Take the medkit.", "result": "You put the medkit in your bag.  You know you will probably need it.", "action_results": [{"action": "Keep walking.", "result": "with things in the backpack is getting prepared for the unusual situations", "action_results": [{"action": "Search for any signs of other survivors.", "result": "You see footprints leading off to the west.", "action_results": []}, {"action": "Look for a vehicle that still has fuel.", "result": "You find a collection of rusted vehicles, none of which look too promising.", "action_results": []}]}, {"action": "Take a break to get more energy.", "result": "needs rest because things can complicate", "action_results": [{"action": "Get back on the road.", "result": "A pack of wild crows decends upson you tearing at your flesh. They are hungry, ravenous for blood.", "action_results": []}, {"action": "Try and get some sleep.", "result": "will become energertic", "action_results": []}]}]}, {"action": "Take the flashlight and keep looking for batteries.", "result": "You find batteries in an old rusty box, but they are the wrong size.", "action_results": [{"action": "Look for more batteries.", "result": "While you are looking for more batteries, a voice behind you says \"Looking for something?\"", "action_results": [{"action": "Raise your hands slowly.", "result": "The voice tells you to lower your hands.  \"I'm friendly. . It's alright,\" he says.", "action_results": []}, {"action": "Turn around in shock.", "result": "You see a pretty, though terrified, woman with her gun drawn and pointed at you.", "action_results": []}]}, {"action": "Take these batteries and plan to barter them later.", "result": "You store the batteries in your bag next to the still useless flashlight.  Maybe someone will need them and have the size you're looking for.", "action_results": [{"action": "Look for further useful things.", "result": "You dig around in the area and find a map and a canteen.  You put these in your bag.", "action_results": []}, {"action": "Make an inventory of what you have in the bag.", "result": "After collecting inventory, you make your way back outside.", "action_results": []}]}]}]}, {"action": "eat meat", "result": "Nausea sets in immediately.", "action_results": [{"action": "Try shoving fingers down throat to force vomiting.", "result": "You throw up the rotten meat on the floor. You feel awful and are more dehydrated and hungry than before.", "action_results": [{"action": "start searching for some liquid to drink", "result": "You spy a flash of red beneath a collapsed wall. It is a precious can of Coca-Cola. It is worth a good bit in trade, but you guzzle it down nonetheless.", "action_results": [{"action": "Continue to search through the rubble of the collapsed wall.", "result": "You find a plethora of boxes of macaroni and cheese. It's the kind of macaroni and cheese that you only need to add water to.", "action_results": []}, {"action": "Put the empty can in your backpack.", "result": "You intend on using the empty can for scrap metal later on.", "action_results": []}]}, {"action": "try calling out for help", "result": "No one answers from the darkness.", "action_results": [{"action": "there are potions everywhere that are not marked", "result": "You open the largest bottle to see what is inside, sniffing cautiously.", "action_results": []}, {"action": "there is a response from far away", "result": "You shout again, hoping to hear more.", "action_results": []}, {"action": "Set the meat outside as bait.", "result": "You here someone Call out to you", "action_results": []}, {"action": "Scream out in agony and defeat.", "result": "You pass out.  The pain is too much to bear.", "action_results": []}]}]}, {"action": "Find a good place to rest until the nausea passes, or sickness worsens.", "result": "You lay down on the floor and fall asleep", "action_results": [{"action": "Rest until I feel better", "result": "When you awaken the sun is bright. It is morning.", "action_results": [{"action": "Head for the forest and find something to forage.", "result": "While hunting for berries and fruit you stumble upon a pond.  You decide to make a fishing rod.", "action_results": []}, {"action": "Head towards the decaying city to scavenge for the last scraps of food and supplies.", "result": "You discover some canned goods below some rubble.", "action_results": []}]}, {"action": "Panic and look for people", "result": "There is no one to be found. You take a few deep breaths and try to calm yourself.", "action_results": [{"action": "Yell out as loud as you can \"Anybody out there??\"", "result": "You don't hear anyone right away.", "action_results": []}, {"action": "Come to terms with your loneliness.", "result": "You realize that if you are to live on your own, you need to find a way to survive and gather the necessities of life.", "action_results": []}]}]}, {"action": "Expel the rotten meat from your body.", "result": "You put the can of peas in your backpack, right now you're feeling too sick to eat them.", "action_results": [{"action": "pretend death by starving, eat the rotten meat", "result": "The rotten meat sets off another wave of nausea, but you keep it down this time. The apocalypse has done wonders for fortifying your guts.", "action_results": [{"action": "Walk out of the room.", "result": "You leave the room and head outside.  There is a cool breeze and it feels much better there.", "action_results": []}, {"action": "Burp loudly.", "result": "You begin to vomit uncontrollably", "action_results": []}]}, {"action": "Eat the peas later", "result": "You wait until the nausea subsides and for your hunger to return before prying open your can of peas to eat them as you continue to look for supplies.", "action_results": [{"action": "Throw up because you hate peas.", "result": "You wipe the vomit away from your mouth and begin to feel dizzy.", "action_results": []}, {"action": "Use the can to store your powerstones you find.", "result": "You find gauze and bandages in a medicine cabinet along with some acetaminophen. It's expired, but you put it in your pack anyways.", "action_results": []}]}]}, {"action": "Try to eat the peas to alleviate the nausea.", "result": "You take a bite of the peas, but your stomach turns.  You look away as you empty your stomach out on the ground.", "action_results": [{"action": "Find more food.", "result": "You quickly rush to the other side of the store to see if anything else remained.  You see a box of crackers under a shelf, and eat them, now hungrier than ever, despite the nausea.", "action_results": [{"action": "Check the store storage room to see if there are any items.", "result": "You feel a little stronger and walk over to the storage room to search for essentials, including medicine.", "action_results": []}, {"action": "Walk to the next store and search it.", "result": "You look over all the shelves at the next store.  You manage to find a ton of food there.  You laugh, knowing that you found the jackpot.", "action_results": []}]}, {"action": "Go to sleep.", "result": "When you wake up, your stomach still hurts, but you feel more energetic.", "action_results": [{"action": "Lick the food off of the ground.", "result": "After eating, you feel nauseous.", "action_results": []}, {"action": "Use the can as a hat.", "result": "The can makes a poor hat, but you re-use it to collect some berries growing along the side of the road.", "action_results": []}]}]}]}, {"action": "eat peas", "result": "The peas were delicious.", "action_results": [{"action": "Consider eating the meat too.", "result": "You do not eat the meat because you don't want to get sick and not be able to scavenge.", "action_results": [{"action": "Use the meat as bait to catch prey.", "result": "You figure animals might have stronger stomachs, and with your bow and arrow in hand, you leave the meat near the edge of the woods, and hide behind the nearest shed.", "action_results": [{"action": "a friendly dog comes to sniff the meat and becomes a companion", "result": "You realize that there is a apple tree right there.", "action_results": []}, {"action": "a mean and growling dog  sniffs at the meat", "result": "You back away from the dog.  He might need the meat more than you do.", "action_results": []}, {"action": "Fire at the first animal that comes, no matter what.", "result": "You hear a rustle.  You shoot at the shadowy figure.  A person yells out.  What have you done?", "action_results": []}, {"action": "Take a nap while you wait.", "result": "You are awoken by the sounds of broken twigs close by.", "action_results": []}]}, {"action": "Look for something else to eat.", "result": "You find a can of peaches in a abandoned building. You open it.", "action_results": [{"action": "Eat one slice of peach to see if it's still good.", "result": "You wait 10 minutes. You feel fine. You eat the rest of the peaches like they are candy from heaven.", "action_results": []}, {"action": "Smell the peaches.", "result": "The peaches smell okay.  You look around for a utinsil to eat them with.", "action_results": []}]}]}, {"action": "Leave the meat and look for food elsewhere.", "result": "You know the meat was probably bad, but your stomach still rumbles.  You hope that you can find some more food elsewhere.", "action_results": [{"action": "Search for fire making material", "result": "Inside a partially collapsed building, you find furniture, lots of it. It must have been a furniture store. To think, people paid good money for this stuff. Now money no longer matters, and all this fancy furniture is good for is burning.", "action_results": [{"action": "Note the location of the furniture store in your notebook, it's a good place to sleep.", "result": "You continue down the abandoned street, looking for signs of life.", "action_results": []}, {"action": "Find dining chairs to break into firewood.", "result": "The chairs break easily and you find yourself highly ammused for the first time in days smashing the chairs into pieces.", "action_results": []}]}, {"action": "Wrap meat and put in knapsack for future cooking", "result": "as a result of not finding any other food i done it and it was prepared nice", "action_results": [{"action": "Try to cook the meat over a fire.", "result": "You cook the meat thouroughly and enjoy your meal.", "action_results": []}, {"action": "Smell the meat to see how bad it is.", "result": "The meat smells sulfur, like rotten eggs.", "action_results": []}]}]}, {"action": "Examine meat.", "result": "The meat is smelling bad, but you decide not to throw it away: it may be useful as bait, or for something else.", "action_results": [{"action": "put the meat in your backpack", "result": "The scent of the meat attracts insects and they swarm around your head.", "action_results": [{"action": "decide to cook it and light a fire", "result": "The fire is lit.  You put the meat on a twig and cook it over the fire.  You take a bite and spit it out.  It's horrible.", "action_results": []}, {"action": "throw it down disgusted.", "result": "You abandon the meat, it isn't worth the risk.", "action_results": []}]}, {"action": "cook the meat immediately so it doesnt spoil anymore", "result": "You store the meat away and venture to the nearest trader. You exchange part of the meat for the new universal currency, 5.56 rounds, of which you receive 10. That's 10 more than you had for your battered AR rifle.", "action_results": [{"action": "Ask the trader what they have for sale.", "result": "The trader shows you what they have.  You look over the items.", "action_results": []}, {"action": "Try to start a business deal with the trader where you provide goods in exchange for food.", "result": "Trader wants to see more food before agreeing to trade.", "action_results": []}]}]}, {"action": "Look behind fridge.", "result": "You look behind the fridge and find several other cans.  You wonder if the cans may have fallen behind the fridge.  You stuff them into your bag.", "action_results": [{"action": "continue searching for more food", "result": "You dare to open the fridge, but only encounter a horrible smell.  You close the door and continue the search.", "action_results": [{"action": "try to move the fridge", "result": "It's too heavy.  You begin to look around for a dolly to move it with.", "action_results": []}, {"action": "The fridge door pops open and rotten food falls out.", "result": "You can hear the quick approach of wild animals who have been drawn by the smell of rotting food.", "action_results": []}]}, {"action": "go outside and open a can of peas", "result": "You know you should ration, but the peas were so delicious, you decide to have another can.  With enough food in your bag, now, you head outside to enjoy some sun as you continue your lunch.  Luckily, these peas look as appetizing as the last can.", "action_results": [{"action": "Look for water.", "result": "Take a moment to reflect upon life.", "action_results": []}, {"action": "Take some time to enjoy the moment.", "result": "It's a nice day.  Too bad you have work to do.", "action_results": []}]}]}]}]}]}]}]}