{"tree_id": "apoc_seed2", "context": "Long ago the bombs fell and the world ended. You are one of the few who is still alive. You are trying to survive by scavenging among the ruins of what is left behind. ", "first_story_block": "You find a car with the keys in the ignition and try to start it. Nothing happens. You keep looking and find another car that looks like it might work. You manage to get the engine started. ", "action_results": [{"action": "drive around looking for any people or stores that might have supplies.", "result": "You drive around the town and see many boarded up buildings, but no people. Eventually you find a store that you think might have supplies.", "action_results": [{"action": "go inside the store and see if there are any supplies.", "result": "It looks like the store has been ransacked and all the shelves are empty. You manage to find a package of granola bars and a flashlight behind the counter.", "action_results": [{"action": "eat a granola bar.", "result": "It tastes just like a granola bar you enjoyed when you were younger. In an instant, you are transported to a school hiking trip. Your mind is awash by the mountain air and the bundles of sticks and leaves that formed the trail. Those days seem so long ago now...", "action_results": [{"action": "Look for other doors inside the store.", "result": "You find the store manager's door, with a set of keys hanging off the lock. The door, though, seems to be blocked from the inside.", "action_results": [{"action": "Push the door to uncover what is blocking it from the inside", "result": "You hear a scream from the inside: \"Go away! I have a gun!\"", "action_results": [{"action": "Continue to push the door.", "result": "You yell: \"So do I!\"  and feel the door give a bit more.", "action_results": [{"action": "kick the door", "result": "You try to scape jumping off the window.", "action_results": []}, {"action": "continue to push the door", "result": "The door doesn't give.  You look around to find something to ram against the door.", "action_results": []}]}, {"action": "Try to talk down the person behind the door.", "result": "explains that he is a good person, and tries to approach slowly", "action_results": [{"action": "Put your hands up to show you are not armed.", "result": "You put your hands up, but your tattered, duct-taped Remington 870 shotgun is still within reach. Good thing too, as the man reaches behind his back and pulls out a rusty, long blade. You side step, grabbing the shotgun, as the man thrusts out with the knife.", "action_results": []}, {"action": "Take your crossbow out and keep moving forward.", "result": "You arm yourself with the crossbow.  You cannot be too cautious.", "action_results": []}]}]}, {"action": "Knock on the door, while being prepared for what is inside.", "result": "You swing the door open and find nothing there.  You let out an audible sigh of relief.  The door was only jammed.", "action_results": [{"action": "Search the manager's desk.", "result": "You find a note that was written by the last owner. You open up the note.", "action_results": [{"action": "the note is worthless so you throw it away", "result": "You notice that the managers desk has two drawers. One is empty, however the other is locked.", "action_results": []}, {"action": "the note has a cryptic message on it, but you keep it in case someone else can decode it", "result": "You move on from room to room looking for useful supplies.", "action_results": []}]}, {"action": "Look at the coat rack by the door.", "result": "You find a hat, which will help a little when it gets cold at night, but not the warm coat you were hoping for.", "action_results": [{"action": "start looking for more things", "result": "There is no coat here but there is a worn rucksack hung over a chair.", "action_results": []}, {"action": "go out to look for more places", "result": "You find two suitable places that may have clothing to scavenge.", "action_results": []}]}]}, {"action": "Attempt to break down the door with something heavy.", "result": "You look around and find a piece of wood.  You take the wood and ram it against the door.  Eventually, it starts to give.", "action_results": [{"action": "Keep ramming.", "result": "need to enter that room", "action_results": [{"action": "Hit the hinges and see if you can knock them loose.", "result": "Suddenly the door falls over, and you can now enter the room.", "action_results": []}, {"action": "Take a running start and ram the door as hard as you can.", "result": "The door opens, and you can't believe what you see inside.", "action_results": []}]}, {"action": "Take a break.", "result": "Sitting in the quiet, suddenly you hear a scratching noise coming from the other side of the manager's office door.", "action_results": [{"action": "Listen and try to identify if there is an animal.", "result": "The scratching intensifies. You notice the door begin to shake against the weight of the creature behind it.", "action_results": []}, {"action": "Run away into the woods to find weapons.", "result": "You find a sharp rock and a stick.  You begin to fasten a weapon.", "action_results": []}]}]}, {"action": "Use the keys to try to unlock a different door.", "result": "The storage room door opens up, and it's filled with shelves stacked with canned food.", "action_results": [{"action": "Find can opener", "result": "You open a can of tuna and notice it has a rancid smell.", "action_results": [{"action": "Open another can.", "result": "The next can you opened smells less foul but makes you gag as you think of eating it.", "action_results": []}, {"action": "Throw the opened can of tuna against the wall.", "result": "The tuna falls over the ground and the air is consumed with the rancid odor.", "action_results": []}]}, {"action": "Move food to other area to prevent others from taking it", "result": "This is a huge treasure trove. You have enough to eat and plenty to trade as well. But you have to get it out of here first, and that means finding a vehicle. Just then, you hear the engines approaching. Raiders!", "action_results": [{"action": "Grab what you can carry and run.", "result": "You load up your hands and take off running.  You hear footsteps behind you and pick up the pace.", "action_results": []}, {"action": "Convince the raiders to let you join them.", "result": "The raiders are uncertain whether or not they should let you in, and begin to discuss amongst themselves.", "action_results": []}]}]}]}, {"action": "Check to see if there are any batteries in the flashlight.", "result": "There are batteries in the flashlight but they are dead.", "action_results": [{"action": "Shake the flashlight and see if the batteries might begin to work.", "result": "The flashlight flickers for a second, but then it dies again. At least you know it's working, you only need fresh batteries...", "action_results": [{"action": "Look for batteries.", "result": "batteries or batteries here is a new purpose now the night will come soon and we need light", "action_results": [{"action": "Try another building.", "result": "You find the ruins of a hardware store and dig frantically through the rubble.", "action_results": []}, {"action": "Head all the way back to camp to see if you can barter for some.", "result": "You get back to camp and look for someone to trade with.  However, you can't find a soul.  Where is everyone?", "action_results": []}]}, {"action": "Throw it away - it's dead weight.", "result": "But you realize, fresh batteries will be a hard thing to come across.  You hide the flashlight under a shelf for now.  If you do happen upon batteries, you can come back for it when it's worth carrying.", "action_results": [{"action": "search in the ruins for batteries", "result": "You find one battery.", "action_results": []}, {"action": "continue on looking for food or other people who survived", "result": "You run your hand over a mountain of candy bar wrappers, but find them empty. Someone got to them before you.", "action_results": []}]}]}, {"action": "Look through the rubble and see if you can find any new batteries for the flashlight.", "result": "You look through the rubble, but there is nothing but papers and trash.  You trudge on, disappointed.", "action_results": [{"action": "Bend down when you see something glinting in the rubble ahead.", "result": "It is a large knife. You take it with you because you are sure it will come in handy.", "action_results": [{"action": "keep on walking", "result": "You walk for a mile or so and you need to take a break.  You are sitting down to rest when you hear a noise.", "action_results": []}, {"action": "use the knife to open the can that was next to it.", "result": "Push down as hard as you can to penetrate the can.", "action_results": []}]}, {"action": "Take a right turn.", "result": "There's a dim light at the end of the corridor.", "action_results": [{"action": "the light gives way to a city in ruins with buildings crumbling in dismay. Search for a stable path.", "result": "You find a worn footpath that leads toward the city.", "action_results": []}, {"action": "The sound of voices echo through corridor, hide before the source of light arrives.", "result": "There is pulsating and rumbling bellowing through the corridor, run before it is too late.", "action_results": []}]}]}, {"action": "Tuck the flashlight into your pocket.", "result": "The flashlight some how turns on by itself. You take it out of your pocket", "action_results": [{"action": "Explore the surroundings with the flashlight.", "result": "You come across a book. You open the book.", "action_results": [{"action": "Skim the book for anything useful.", "result": "You find in the book a description of events that lead to the war. You also find some handwritten notes in the margins of the book.", "action_results": []}, {"action": "Throw the book in your bag to use for kindling later.", "result": "Your bag is getting heavier.  You wonder if you might have to unload it at some point.", "action_results": []}]}, {"action": "Turn off the flashlight immediately.", "result": "Instead of shutting off, the flashlight begins to vibrate, and projects an image onto the ground.", "action_results": [{"action": "Watch in amazement as the image starts moving by itself.", "result": "You stand mesmerized, and feel yourself go into a trance.", "action_results": []}, {"action": "Drop the flashlight by mistake.", "result": "It shatters into pieces, and you somehow feel you've made a big mistake as a sense of dread creeps over you.", "action_results": []}]}]}, {"action": "Look around for fresh batteries.", "result": "You can't find any more batteries, but you find a box of matches in a drawer.", "action_results": [{"action": "Light a match", "result": "who has no dog hunting with cat, but little by little I see the environment", "action_results": [{"action": "Give up on hunting for now.", "result": "You decide to eat from your rations rather than expend energy on hunting", "action_results": []}, {"action": "Store the matches in your bunker.", "result": "You feel hungry and notice you haven't eaten in a while", "action_results": []}]}, {"action": "Look around for something to use as a torch", "result": "Matches will only last so long, so you break off some wood and from a nearby chair to use as a torch.", "action_results": [{"action": "Look for oil or other fire accelerant.", "result": "You notice that there a propane tank that looks dented.", "action_results": []}, {"action": "Wrap some cloth around the wood.", "result": "The wood is now protected around the dampness of the air, as you start to look for other supplies.", "action_results": []}]}]}]}, {"action": "Check to see if the flashlight works.", "result": "You push the soft, mushy rubber button and a faint light emerges. You are familiar with this brand of torch and consider keeping it in case you find a better battery.", "action_results": [{"action": "put in jacket pocket", "result": "The battery doesn't fit in your pocket.  You have to carry it around.  You wish you had some kind of bag to carry it in.", "action_results": [{"action": "Take off jacket and wrap it around you like a sling and put the battery in it.", "result": "The battery is leaking, and acid soaks into your skin.", "action_results": [{"action": "Run as fast as you can to the nearest source of water.", "result": "You wash off the battery acid and try to get it off your jacket, but it has already eaten holes into its fabric. Another wasted effort, damn.", "action_results": []}, {"action": "Find the first aid kit in your bag as quickly as possible.", "result": "By the time you remove the acid, you now have an open wound on your right hand.", "action_results": []}, {"action": "clean skin", "result": "Your skin is stinging and you have nothing to soothe it with.", "action_results": []}, {"action": "a slight burn remains where the acid landed", "result": "The battery is heavy and cold against your skin", "action_results": []}]}, {"action": "Put the battery to your arm or leg and wrap your jacket around it to hold it in place.", "result": "The battery slips out of your improvised bag fashioned out of a jacket and falls to the ground.", "action_results": [{"action": "Leave it there, it's too big.", "result": "You decide that there might be a better solution to haul the battery around. A little while later you find an old grocery cart, perfect. You return to the battery and put it into the old cart.", "action_results": []}, {"action": "Put your jacket back on and take off your pants to try using them instead.", "result": "You place the battery in one of the pants legs, and wrap the pants around your waist.", "action_results": []}]}]}, {"action": "look for dry twigs and kindling", "result": "Gather the kindling into a pile and light it up for a cozy fire", "action_results": [{"action": "Search for blanket material", "result": "You are able to find a old table cloth", "action_results": [{"action": "Sit close to the fire to warm up.", "result": "You feed the fire throughout the night and think about the day ahead.", "action_results": []}, {"action": "Look for some meat to cook on the fire.", "result": "There is no meat available. You find some old cans of food.", "action_results": []}]}, {"action": "Take off boots and dry out feet", "result": "You notice when you remove your boots that your feet are blistered and the heat of the fire makes the blisters more painful.", "action_results": [{"action": "put boots back on.", "result": "The boots hurt as you slide them on your feet.  You wince in pain and try not to cry.", "action_results": []}, {"action": "wrap feet in bandages.", "result": "Your feet, now bandaged, feel more comfortable. However you are concerned about tomorrow, with your feet injured you won't make it very far.", "action_results": []}]}]}, {"action": "Turn off the light to conserve what battery it has.", "result": "You walk out of the store and back to the car.  Looking around in the low light there is a column of smoke to the west.  No sound but the wind playing with some leaves.", "action_results": [{"action": "Head towards the smoke.", "result": "You come across a campfire. You see a woman around the fire.", "action_results": [{"action": "Ask someone about the cause of the smoke.", "result": "You find out from the woman that there is a small settlement of nomads who are taking refuge", "action_results": []}, {"action": "Drive far away from the smoke.", "result": "As you drive away, the woman starts running towards your direction.", "action_results": []}]}, {"action": "Go in the opposite direction.", "result": "You begin to wonder whether you made the right decision. It is lonely out here and the smoke indicated a sign of life. You stop in your tracks and consider turning back around.", "action_results": [{"action": "Turn back and go towards the smoke.", "result": "You walk, following the smoke.  You get to a large fire.  You yell out for help.", "action_results": []}, {"action": "Keep moving farther from the smoke.", "result": "As you move closer to the smoke you see the faint glow of a burning fire, it is unclear if their is anyone nearby the fire.", "action_results": []}]}]}, {"action": "Search for more batteries and flashlights.", "result": "You find 2 more flashlights in a drawer in a back room, there is also another pack of batteries there.", "action_results": [{"action": "Check operation of new flashlights", "result": "The first flashlight is dead, but the second flickers, then projects an eerie greenish glow onto the floor.", "action_results": [{"action": "Stow the flashlight in your backpack and continue to search.", "result": "You find some more water and canned food.  You decide to start a fire.", "action_results": []}, {"action": "Use the flashlight to look closer around the room.", "result": "With the additional light from the flashlight you see that this room was once an office. Spreadsheets of forgotten financial information lay on the floor.", "action_results": []}]}, {"action": "Take batteries and put them in pocket", "result": "Look for anything else to aid in your survival and find a first aid kit.", "action_results": [{"action": "Open all of the cabinets in the next room.", "result": "The cabinet doors are all open.  Unfortunately, there is nothing to be seen in them.", "action_results": []}, {"action": "Make signs advertising your items for sale.", "result": "The signs draw attention of travelers on the path.  They come to see you.", "action_results": []}]}]}]}, {"action": "Check the storage rooms for tools and supplies.", "result": "It's clear that whoever ransacked the store, was someone really organized and with a means of transport: even the storage rooms are completely empty.", "action_results": [{"action": "Look in every corner for any possible tools and supplies.", "result": "There is nothing left: the only use for the storage room is as a safe place to sleep in.", "action_results": [{"action": "Leave the storage room.", "result": "You continue on and head outside. Down the road you see another building and decide to check it out.", "action_results": [{"action": "Find materials to build a bed to sleep on.", "result": "You find some soft hay and a few wooden planks.", "action_results": []}, {"action": "Climb up the side of the building.", "result": "You see a ladder on the side of the building and begin to walk up to a window.", "action_results": []}]}, {"action": "Lay down for a nap.", "result": "just as your about to fall a sleep you hear a sound of voices in the background. You know you need to get out before the men find you. You frantically look around for another exit, but there isn't one except for a narrow ventilation shaft. You hear the men begin to enter the store and rummage around. you pop open the shaft even and begin your tight escape to the unknown", "action_results": [{"action": "Turn on your flashlight and begin to crawl, knowing you'll make noise.", "result": "You slowly crawl across the floor.  Thankfully, the men don't hear you.  When you get close enough, you stop to listen to what they are saying.", "action_results": []}, {"action": "Close the shaft behind you and sit and wait in the darkness.", "result": "You narrowly escape being caught.", "action_results": []}]}]}, {"action": "Look underneath all large items for tools and supplies.", "result": "Hidden away under a shelf you find a hammer, screw driver, and a first aid kit.", "action_results": [{"action": "take the tools and hide them in your bag", "result": "You tend to your cuts and bruises with the first aid kit and using the hammer, screwdriver and scraps from the ruins begin to construct a shelter.", "action_results": [{"action": "Go back in the building to see if there are any supplies you missed.", "result": "You go back into the building and look around.  You see a saw and nails under the shelf.", "action_results": []}, {"action": "Push on your shelter to see if it is sturdy.", "result": "The shelter holds firm and seems very secure.", "action_results": []}]}, {"action": "leave the tools incase someone else needs them more", "result": "The tools are heavy, and you don't have any use for them right now, so you grab a few bandaids from the first aid kit and move on.", "action_results": [{"action": "Go left down the hallway to find a locked door.", "result": "You look for the key to the door. You do not have the key.", "action_results": []}, {"action": "Go right down the hallway to keep searching.", "result": "You walk down the hallway.  It is dark and lonely here.", "action_results": []}]}]}, {"action": "Keep travelling to find a different storage room.", "result": "You walk to a different door and try to get in but it is locked.  You look around to see if you can find the key.", "action_results": [{"action": "Check the under the mat for key", "result": "There is a key there. You use it to open the door and the room is fill with supplies.", "action_results": [{"action": "Find something to load supplies into.", "result": "You find a cart, and start to throw supplies into it.", "action_results": []}, {"action": "Choose which supplies are most valuable and leave the rest.", "result": "You take the canned food and leave the rest.  Then you head out the door.", "action_results": []}]}, {"action": "Make noises to see if someone is inside", "result": "Just in case, you bang on the door loudly before listening for any rustling behind it, to see if someone might be waiting for you.", "action_results": [{"action": "Get out your knife and bust down the door.", "result": "The door splinters and falls into the room with a loud bang. As your eyes adjust to the darkness you hear the sound of footsteps approaching rapidly.", "action_results": []}, {"action": "Pick the lock.", "result": "The lock won't give, and you get a large cut on your hand in the process.", "action_results": []}]}]}, {"action": "Look for the person who cleaned out the storage room.", "result": "You look around, but see no one.  You try calling out, but no one responds.", "action_results": [{"action": "Leave the store, see if you can spot tire tracks", "result": "You see tire tracks leading over the hill, towards the ruins where you've seen strange lights at night.", "action_results": [{"action": "go to the light at night", "result": "You approach and hear two voices one male another female.", "action_results": []}, {"action": "I decide to stay still", "result": "You start a fire and prepare your last can of food.", "action_results": []}]}, {"action": "Make as much noise as possible", "result": "A person comes running out. She scares you to death.", "action_results": [{"action": "Tell her that you mean her no harm.", "result": "She gives you a bewildered look and starts to shriek", "action_results": []}, {"action": "Put your hands up to signify that you're harmless.", "result": "She understands your gesture, but slowly starts to back away from you.", "action_results": []}]}]}]}]}]}]}]}