{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=8129", "context": "", "first_story_block": "Your name is Miyuki Takeda.  Otherwise known as \"Mayumi's sister.\"\n\nSince the day you were born, it seems you have been in her shadow.  Twins, but not equal.  Never equal.\n\nMayumi has always been the pretty one, the clever one.  Everybody's favorite. \n\nI know what you're thinking.  This is one of those petty revenge dramas.  Neglected Miyuki takes vengeance on her sister for being loved more than she is.  But you're better than that.\n\nYou've never been jealous of Mayumi.  Not once.  You love your sister.\n\nBut she doesn't love you.  Strangely enough, she's the jealous one.  It's almost as if she fears that someday, everyone will realize that she really isn't smarter or better than you.  And then she won't be the favorite any more.\n\nIt started slowly.  Little unkind things she'd say, little acts of cruelty.  You tried to pretend it wasn't happening.  You still do.", "action_results": [{"action": "Playing in the Park", "result": "\"Everyone!  I've got a great new idea for a game!\"\n\nIt's Saturday afternoon, and you and your sister are with your friends, playing in the park.\n\nAs usual, Mayumi has taken charge.  She always come up with the best games.  Everyone has so much fun!  Well, almost everyone.  You didn't really like last week's game.  But you didn't want to spoil everyone else's fun.\n\n\"This game is called 'Outlaw.'  One of us will be the outlaw, and the others will form a posse to hunt them down and capture them.\"\n\nThis doesn't sound too bad.  Not like 'Safari Hunter' last week, where you were the lion, and everyone threw water balloons at you.\n\n\"Who should be the outlaw first?  Hmmm. . . Miyuki!  Why don't you go first?\"\n\n\"I don't know, Mayumi.  Why don't you pick someone else?\"\n\n\"Isn't that just like my selfish sister?  I'm nice enough to let her go first, and she acts like that.  If it's too much trouble, Miyuki, you don't have to play with us!\"\n\n\"No, no, Mayumi.  I want to play, I just. . .\"\n\n\"Good.  Then you're the Outlaw.  You have ten seconds to run.\"", "action_results": [{"action": "Hiding", "result": "So you run.\n\nYou find a tiny shallow beneath a stone sculpture where you can cower.  It's cramped and dirty, but you feel fairly sure Mayumi can't find you here.\n\nAs you crouch in the damp crater, you can hear two women chatting on a nearby park bench.\n\n\"Have you heard about the Hell Correspondence?\"\n\n\"Is that the cursed website?\"\n\n\"Yeah, they say if you log on at midnight, you can summon the Hell Girl to take vengeance for you!\"\n\nHell Correspondence. . . sounds scary.", "action_results": [{"action": "Found you!", "result": "With a triumphant shout, Mayumi grabs you by the hair and drags you out from under the statue.\n\n\"Ow!  Mayumi, you're pulling too hard!\"\n\n\"Quiet, Outlaw!  I'm taking you in!\"\n\nShe drags you over to the rest of the group.\n\n\"Good job, Mayumi!  Way to go!\"  They applaud her success.\n\n\"So now does somebody else get to be the Outlaw?\"  you ask hopefully.\n\n\"No, dummy.  Now we bring you to justice, Texas style!\"\n\n\"Um, what does that mean?\"\n\n\"Quiet, bandit.  You don't get to talk till it's time for your last words!  Rei, hand me that jump rope.  Good.  Sho, you and Takeshi can use this to tie Miyuki to that tree over there.\"\n\n\"I don't wanna. . .\"\n\n\"Come on Miyuki, it's just a game.\"\n\"Yeah, Miyuki, just play along.\"", "action_results": [{"action": "Go along with the game", "result": "You let Sho and Takeshi tie you to the tree. \n\n\"Rei, you can hide next.\"\n\nEveryone runs off and leaves you tied to the tree.  Everyone but Mayumi.  She stands there, watching you intently, as if she's expecting something to happen soon.\n\nThen you spot them.\n\n\"Mayumi, there are ants all over this tree!\"\n\n\"I know.  That's Texas style justice.  We tie you up and let the ants get you.\"\n\n\"Mayumi!  No!\"\n\n\"Don't be such a little crybaby, Miyuki.\" \n\nYou struggle and shriek as the ants crawl all over you, but you are tightly fastened to the tree.  Mayumi just watches, smiling slightly. \n\nOf course, when the other children come to see why you're making such a racket, Mayumi claims to have only just arrived, and scolds Sho and Takeshi for not noticing the ants before they tied you up.\n\nYou consider telling the other kids what really happened, but you know they won't believe you.\n\nYou are rapidly reaching the conclusion that your life cannot continue this way.", "action_results": [{"action": "Hell Correspondence", "result": "Late that night, when your parents are sleeping, you sneak into the computer room and log onto the website.\n\n\n\"We will take revenge on your behalf\"\n\nThat's all it says.  And below that, a box to enter. . .\n\nMayumi's name?", "action_results": [{"action": "Typing", "result": "Hands shaking, you type into the box:\n\n\"Hell Girl, please kill Mayumi Takeda.\"\n\nThe screen goes black, and you cower, awaiting confirmation of your dark deed.\n\nBut nothing happens. \n\nDisappointed, you try again, but you can't seem to access the site.  A 404 file not found error is the only thing that comes up.", "action_results": [{"action": "Next Day", "result": "Nothing has changed at all.\n\nYou try to avoid her, but Mayumi corners you in the upstairs hallway.\n\n\"Come on, Miyuki, let's go outside and play together!\"", "action_results": [{"action": "Push past her", "result": "Mayumi drops to the ground as you push past.  She pauses, then deliberately thumps her head against the wall, loud enough to attract your mother's attention, and begins crying.\n\nYou get spanked for being a bully, and are forced to apologize to Mayumi.  She smiles sweetly and says she is sure it was an accident, and you didn't mean for her to fall.  Your mother beams proudly at her sweet, forgiving daughter before ordering you into your room for the rest of the day.", "action_results": [{"action": "In your room", "result": "You lie on your bed and cry, muffling your tears with your pillow.\n\nWhen you open your eyes, everything is different. \n\nYou are outside, the sun is setting.\n\nA young girl with dark hair and red eyes is standing before you.", "action_results": [{"action": "\"My name is Ai\"", "result": "\"Where am I?  What is this place?\"\n\n\"My name is Ai.  You've summoned me.\"", "action_results": [{"action": "\"This is for you\"", "result": "\"This is for you.\"\n\n\nShe hands you a straw doll.", "action_results": [null]}]}]}]}, {"action": "Go outside and play", "result": "Once outside, Mayumi shoves you into a mud puddle and runs back into the house crying \"Mother, come quick, Miyuki fell down!\"\n\nYour mother pulls you into the house.  \"Why on earth were you playing in the mud, Miyuki?\"\n\n\"I. . . I wasn't. . .\" you stammer.  \"Mayumi pushed me.\"\n\nMayumi's lower lip trembles.  Tears well in her eyes.  \"Why would you say those horrible things about me, Miyuki?\"\n\nYour mother angrily orders you to your room.\n\nAs you head up the stairs, you can hear Mayumi's voice.  \"Why does Miyuki hate me, Mother?\"", "action_results": [null]}]}]}]}]}, {"action": "Refuse to play", "result": "Everyone calls you a crybaby and a spoilsport.  You're unhappy,  but at least you are away from Mayumi for the rest of the afternoon.\n\nYou decide to go to the library and read for a while.  It's peaceful and quiet, and you start to think maybe you were wrong about Mayumi.\n\nWhen you get home, your mother is waiting.\n\n\"I'm very disappointed in you, Miyuki!\"\n\n\"What?  What's the matter?\"\n\n\"Don't play dumb with me, little missy!  Upstairs, now!\"\n\nApparently, Mayumi went home crying, telling your mother that you pushed her off the swings and she fell.  She even has a fresh scrape on her knee to prove it.\n\nYou get spanked for being a bully, and are forced to apologize to Mayumi.  She smiles sweetly and says she is sure it was an accident, and you didn't mean for her to fall.  Your mother beams proudly at her sweet, forgiving daughter before ordering you into your room for the rest of the night.\n\nYou are rapidly reaching the conclusion that your life cannot continue this way.", "action_results": [null]}]}]}]}]}