{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=7426", "context": "", "first_story_block": "Gunship Iron Eagle Two roared through sector 205 on the rim of the Mesarius star system. The sleek aerospace vehicle, similar in form to the hi-tech attack copters of the 21st Century, was designed with a swappable engine section, allowing it to be equipped with a spacedrive for stellar travel, or a jet-boost assisted rotor section for duties planetside. Turrets swivelled slowly on either side of the Gunship's hull, mounting missile launchers and an energy cannon, while the small chin-turret at the front, below the cockpit, housed twin-plasmabolt machine guns used in anti-infantry duties while planetside.\n\nKreiger 'Wildcat' Jones sat at the front of the two-man cockpit, one hand on the pilot's joystick, the other tapping occassionally at the keys on the console in front of him. \"I'm telling you, those frontier raiders make no sense at all. I mean, all they have to do is sign up with the Federation and all their supply and maintenance problems are solved! Makes no sense they would fight for political control of a few hundred rocks in space, and waste their lives trying to steal the equipment and supplies they need. I mean, sign on the dotted line, and they get everything for free without a fight, and the planets are still theirs to do with as they please, just with a Fed governor helping make sure things are run right.\"\n\nSusa 'Spitball' Henderson sat in the gunner's seat, behind him, with a complex console that controlled targeting and weapons systems. \"I guess for some people, the 'idea' of independance is more powerful than whatever the facts of the situation might be.\"\n\nJones shook his head in frustration. \"I just don't get it, that's all. We're better armed than they are. We've got better skills, better funding. We're going to defeat them in battle pretty much every time, but raiders keep a'coming. They should all - hey, wait a moment, I got something on the scan.\"\n\nHe tapped a few keys on his console, and zoomed in on one of his displays, where small flashes of light flickered in a section of the grid. \"Hey, we've got Space Folds in the next sector. Better report it in.\"\n\nHenderson turned on a Comm channel back to their carrier. \"Carrier Opal, this is gunship Iron Eagle Two, out in Sector Two-Oh-Five. We've just scanned incoming starships in Sector Two-Oh-Six. Requesting permission to check it out?\"\n\n\"This is carrier Opal, that is affirmitive. Watch your tails,\" the reply came back over the Comm.\n\n\"How many are you reading?\" Henderson asked Jones.\n\n\"Looks like four Space Folds detected. If it's a typical raider force, what, two transports, two of their rickety old gunships, we should be able to take 'em out or send 'em packing,\" Jones said confidently. Leaning softly on the joystick, he arced the gunship toward the sensor readings, and kicked on the afterburners. The Iron Eagle gunship rocketed forward and into the next sector.\n\n\"There they are,\" he said, seeing starship blips appearing on his radar. \"Hang on... these readings can't be right. Can you get some info on your tac console?\"\n\n\"Just a moment,\" Henderson said, tapping away on her console. \"What the - that can't be right at all. I think our scanner's gone screwy. The scale's all gone wrong.\"\n\n\"What do you mean?\" Jones asked hesitantly.\n\n\"This says those ships are huge... I mean, the smallest one is five times the size of our carrier!\" she replied.\n\n\"That can't be right, we've got no ships that big, and the raiders certainly don't have anything like that... Let's get a bit closer, try to get a visual.\" Jones increased the thrust, closing toward the four unknown starships. \"Coming into Optical range... now,\" he said, and zoomed in on the target location on one of his displays. What he saw was like nothing he had ever seen before. He took a few screen capture images.\n\n\"I've taken some shots, send these images back to the Opal, right now!\" he ordered.\n\n\"Transmitting data,\" she said, reaching for a button on her console. Something streamed out from one of the unidentified starships, like a beam of concentrated sunlight. The beam engulfed the Iron Eagle. It left nothing behind.", "action_results": [{"action": "On Patrol", "result": "It is a typical sunny Mesarian day, a soft breeze rustling leaves and causing the branches of the trees surrounding Fort Dale to sway softly. You walk from the barracks toward the large three-story high mecha hanger by the east walls of the complex, wondering why frontiersman would live on the desolate outer star systems, when they could live on the core worlds and enjoy weather like this. Well, I guess it takes all sorts to make the galaxy go round, you think to yourself.\n\nEntering the hanger, you pause to look up at the twelve Mechanised Assault Units, standing in bays on each side of the hanger. They are standard Fire Hawk and Gatling chassis, the first a multi-role fighting machine, the latter often used for anti-infantry, or anti-gunship purposes. At the rear of the hanger is a thirteenth bay, where the company commander's large M.A.U., a Nova, is parked. Bearing two large energy cannons, and standing almost to the roof of the hanger, it is the toughest M.A.U. fielded by Sol Federation. Of course, it takes the skill and experience of a company commander to pilot such a mecha. At least, that's what your C.O. tells you all.\n\n'Tomcat' and 'Wolfman' walk into the hanger, waving your way as they head for their machines. As the Squad Leader, you are in charge of the fort's M.A.U. Squad Beta, and as your two squadmates, they are under your command. Of course, being about the same age as you are, and having served for about the same amount of time as you have, they don't exactly obey your every whim. At least they obey you when it counts though, when raiders land ground forces on the planet, and you find yourself in the heat of battle.\n\nTurning to your left, you head for a small lift, and slap the 'up' button. It rises upward, taking you behind the torso section of your Gatling M.A.U. The war machine stands like a 7 metre (23 foot) high metal man, with rectangular armour plating panels slapped around joints and further protecting the chest section. Pressing some buttons on the back of the machine, a two-foot thick section of metal slides aside, letting you step into the chest of the machine.\n\nYou're already wearing your Pilot Suit, so you close the door behind you, and connect sensor cables to the sockets in your suit, and attach the control pads to the wrists of your suit. The control pads extend out below your hand, allowing you to move your hands about, and always be able to touch the buttons on the control pad that control every facet of the war machine, from targeting and firing weapons, to powering the machine up or down. The suit itself is harnessed to the inside of the machine, locking you into place. After powering up, any time you try to move a part of your body, the limbs of the towering war machine will echo the move. In this way, trying to walk will cause the machine to walk instead of you. Moving your body just the right amount to get the machine to move exactly where and when you want it to is a difficult art, and one that took years of boot-camp training to accomplish, but for a low-level Squad Leader, you think you do pretty good.\n\nBefore locking your suit into place, you attach your head equipment, and then you lock the suit, and power up. Instantly your vision goes blank, as your headset pulses into your skull, and interrupts the signals your optic nerves send to your brain. Then it begins to send signals of its own into your brain, as it reads optical information from the camera systems in the head of your war machine.\n\nA moment later, you suddenly feel very big, as you 'look' through the 'eyes' of your Gatling M.A.U., seven meters above the floor of the hanger. You try to turn your head from side to side, and the Gatling's head turns instead, allowing you to look around. Flexing your limbs a bit, you crouch the machine, stand back up, and wave the arms about a little. Everything seems to be in working order. Time to move out.\n\nYou step forwards, and the machine steps into the middle of the hanger bay. Tomcat and Wolfman walk their Fire Hawks out beside you, and together the three of you stomp out of the hanger.\n\n\"So, Squad Leader, where are we going to patrol today?\" Wolfman's voice comes over your headset.", "action_results": [{"action": "\"Let's go for a walk in the forests around the Fort,\" you order.", "result": "You lead the squad to the towering gates of the Fort. \"This is Squad Beta, requesting Gate Clearance,\" you say to the fort's traffic control tower.\n\n\"We read you, Squad Beta. You're good to go,\" someone replies. The massive gates slide into the Fort's surrounding wall, and you lead your squad out. A large clearing lies between the Fort's walls and the forest that surrounds it, so that any approaching vehicles can always be seen. You lead your men down the main road and into the forest, among the equally towering trees. It's a funny thing, being at eye-level with the tops of many of the trees, and it always takes you a moment to get your balance right, and for the feeling of being a giant to become natural.\n\nMany of the trees are toppled over throughout the forest, from people having stomped out among the trees. Being a three-story high metal man means that you often have to push trees out of the way. While conservationists might have a problem with such actions in some areas of the planet, no one complains when soldiers do it around a fort, as they depend on the forts scattered across the planet for protection, and you never knew if a raider force had secretly touched down, and enemy M.A.U.s were hiding among the trees, waiting for an opportunity to strike.\n\nWell, actually, that sort of thing was pretty rare. The Orbital sensor network always detected incoming ships, and could pinpoint the exact landing location of any military transports on the planet. Anyway, you stomp off among the trees, shoving them out of the way whenever you need to make room for your machine. Wolfman and Tomcat stomp along, off to either side of you.\n\n\"One of these days, we're gonna find a raider mecha waiting for us out here, and patrol is going to actually be interesting,\" Tomcat laughs.\n\n\"Hey, anything beats sitting around the barracks, losing at cards to Thunder,\" Wolfman replies.\n\nSuddenly a ComTech from the Fort speaks over the Fort's military channel. \"This is Fort Dale to all units on patrol. Be advised, the planetary sensor network has detected unidentified incoming starships. We haven't been able to establish contact with the carrier scout network... This could be a raider force. Stand By for possible interception coordinates.\"\n\n\"I hope they land in our sector... haven't seen any action in months now,\" Tomcat says.\n\n\"Hang on, did they say they couldn't establish communcations with the carrier scout network? What does that mean? A raider force couldn't take out all the carriers and gunships out there. I haven't heard of them being able to jam our communications either,\" Wolfman says worriedly.\n\n\"Nah, probably just a technical glitch at our Fort. The other Fort's probably heard all about it from the scout network,\" Tomcat says dismissively.\n\nThe ComTech at Fort Dale speaks over the military channel again. \"All units on patrol, be advised the planet has been taken to High Alert. We don't know what those ships are up there, but they're huge! Dozens of smaller ships, we assume they're military transports, have come out of the mothers, and are coming down all across the planet. We've got a couple of these transports inbound toward our location. Keep an eye on the skies, people, and if you get in over your head, get back here, and take up defensive positions inside the Fort! The other pilots at Fort Dale are mounting up, and should be ready for action soon.\"\n\n\"What the hell? Multiple transports heading our way? What exactly are we up against?\" Wolfman asks anxiously.\n\n\"Hey, frontier raiders aren't well armed. They're probably just small transports, full of infantry. We'll mow them down, and be back to the Fort for dinner in no time,\" Tomcat says confidently.", "action_results": [{"action": "\"No, I think Wolfman's right to be worried. Let's head back to the Fort, and take up a defensive position with the rest of our M.A.U. company,\" you order.", "result": "You lead the way back to the Fort. Seeing you coming across the clearing around Fort Dale, Traffic Control opens the doors for you, and you stomp your way into the walled complex. Only a few minutes later, you pick up approaching blips on the scanner hud display which is 'projected' into your mind by your headset, in the corner of your 'vision'. Four large unidentified transports are heading toward the Fort.\n\nYou listen to the roaring of flying machines on your M.A.U.'s audio sensors, approaching from the east. The other ten M.A.U.'s of Fort Dale's company have marched out of the Hanger, and begin taking up positions around the perimeter, their outstretched weapon-bearing arms just above the walls of the Fort, pointing in every direction. You quickly take up a position with your squad, along the east wall.\n\nMoments later, you can see the four massive transports. They are about the size of a squad-carrying M.A.U. transport, but they are a bit bulkier and boxier than any M.A.U. transports you've seen before.\n\nIn the Fort's courtyard, the infantry division assemble, about a hundred soldiers. Most of them were standard infantry bearing plasmabolt rifles and shocksticks, but a dozen or so were fitted up in battlesuits - three meter tall armoured exoskeltons with clawed robotic hands, and small energy cannons attached to each shoulder.\n\nAt the rear of the Fort, another hanger houses a Gunship squad. The six flying machines had just finished powering up and begin to lift up into the air to intercept the enemy transports. Suddenly a thick bolt of lightening blasts out from the nose of the leading enemy transport ship. The lightning crackles loudly as it arcs through the air toward Fort Dale, to explode in the midst of the Gunships! The lightning bolt narrowly misses the Gunships, their pilots scattering the ships away from each other, but two pilots panic, and you watch in horror as their ships crash together in the air, then tumble in a wreck of twisted metal and fire, to crash onto the tarmac.\n\nSome of the other M.A.U. soldiers open fire with their weapons. Your company commander, Captain Jefferson, yells out over the local military channel, \"Hold your fire! They're out of range! Save your ammo and power cells! Everyone, get down!\"\n\nYou join with your company as everyone kneels their M.A.U. war machines behind the Fort's wall. The remaining four Gunships fold down their rotors, and kick on their afterburners, rocketing through the air toward the enemy transports. You watch them fly overhead, then lose sight of them due to the Fort's walls. You hear the roar of the afterburners kick off again as the Gunships draw near to the flying transports, and listen to energy cannons and missiles firing away. A while later, you hear the loud crack of another lightning strikes, and some explosions. Then there is a tremendous crashing sound, and the ground shakes.\n\n\"Looks like it takes them a while to recharge that lightning cannon. Someone get a look at what's happening out there!\" Captain Jefferson orders.", "action_results": [{"action": "\"I'll do it,\" you say bravely, and stand your M.A.U. up to look over the Fort's walls.", "result": "You quickly stand up and look out over the walls of Fort Dale through the eyes of your Gatling war machine.\n\n\"Sir, the Gunships are all down, but it looks like they took out one of the enemy transports!\" you report, looking at the smoke and flames rising from the distant fields beyond the forest. Three of the large transports are hovering in the air near the wreckage. Then you see some sort of flickering light at the front of one of the transports.", "action_results": [{"action": "Curious, you decide to keep watching, and see what it does next.", "result": "Seconds later, you remember about it's strange energy weapon, and then you watch as the weapon finishes charging up, and a massive bolt of lightning surges through the air with a loud crack. It is the last sound you ever hear, as the lightning bolt blasts the top half of your M.A.U. to scrap, taking most of your body with it.\n\nThis is the end, for you...", "action_results": []}, {"action": "You decide not to take any risks, and crouch back down behind the wall.", "result": "As you crouch back down, you hear a loud cracking sound, as the weapon that had been charging up finished charging, and launches one of the massive lightning bolts through the air. The searing electrical beam blasts through the air where you were standing moments ago, and smashes into one of the armoured buildings in the middle of the Fort. A large fiery hole is blown through the side of the building, as debris scatters into the courtyard, among screaming infantry. The rest of the infantry and battlesuit wearing soldiers run for cover.\n\n\"Damn it! How can they shoot so far! Who the hell are they?\" Captain Jefferson growls over the Comm. Then the ground shakes again - the familiar shaking of massive spaceships landing on the ground in the distance.\n\n\"Okay, they've touched down in the fields out past the forest... That means there's lines of trees between us and whatever ground forces they've brought down. We won't know what's coming until they reach the clearing around Fort Dale,\" the Captain says. He cautiously raises his Nova M.A.U. so that its head can peek above the wall.\n\n\"Those transports are so big, more than half of their hull rises above the tree line. I suspect they'll keep barraging the Fort with that lightning cannon of theirs, while their troops advance. Intel has it they are coming down all across the planet, so we've got to hold Fort Dale, because there aint going to be reinforcements coming our way any time soon. So, I'm gonna need two squads to volunteer. I want a squad to take turns looking over the wall for incoming enemies, and I need a squad for scout duty, to try and get a closer look at what we're dealing with before they reach us.\"", "action_results": [{"action": "\"Sir! Squad Beta will scout out the enemy,\" you volunteer.", "result": "\"Oh, great!\" Wolfman says, and you smile as his mecha shakes its head.\n\n\"Good job, Squad Leader,\" Captain Jefferson says. \"Head east into the trees, and try to get us some optics on the enemy. I want you three to patch an optic channel back here to Fort Dale, so myself and the other officers can see what you see.\"\n\n\"Will do, Captain,\" you reply, and flick a switch on one of your control pads. A blinking light in the corner of your vision tells you that your mecha is transmitting everything you see to the commanders of the Fort.\n\n\"Okay Squad Beta, form on me!\" you order, and Wolfman and Tomcat take a position on either side of you. The large gate in the south wall slowly slides open.\n\n\"Good luck, men,\" the Captain says.", "action_results": [{"action": "\"Okay, on my mark, make a dash for the trees... Mark!\" you order, and race for the trees.", "result": "The three of you stomp past the gate at full speed, racing across the clearing that lies around Fort Dale. As you dash, you glance to the east, where the top half of the three transports rise above the treeline in the distance. With a curse, you notice power building up at the front of one of the transports.\n\n\"Get into the trees, they're going to fire again!\" you shout. You rush into the trees just as you hear the loud cracking sound of a lightning bolt cannon firing, then suddenly the force of an explosion sends you falling forwards among the trees. You grab onto a tree and stumble down on one knee, but manage to stay relatively upright. Turning, you see Tomcat crouching beside you, but metres behind you, still in the clearing, is the half melted wreck of what was once Wolfman - obliterated by the enemy weapon.\n\n\"Dammit! Man down, I repeat, man down!\" you say over the military channel.\n\n\"We see it,\" the Captain replies, watching everything through your mecha's 'eyes' from within Fort Dale. \"You're in the forest now though, you should be out of sight of the transports' weapon.\"\n\n ", "action_results": [{"action": "\"I understand. We'll do the best we can, and get those visuals you're after,\" you promise, thinking a quick prayer for Wolfman.", "result": "You head deeper into the forest, angling toward the east, as you work your way into a position between the grounded enemy transports and the walls of Fort Dale. You glance at the radar sensor readings every few seconds to make sure no enemy contacts have come within range. Of course, your sensors only pick up energy sources - they were designed to pick up vehicles and war machines similar to your own. If the transports were carrying an army of infantry soldiers, and they weren't wearing any form of powered armour, you'll only notice them when you actually see them... Anyhow, transports the size of those ones had to be carrying something pretty big inside of them, so the enemy must be inside some sort of war machines.\n\n\"This aint good,\" Tomcat says softly over your squad channel.\n\n\"I know,\" you reply anxiously, stomping through the forest towards the other side.\n\n\"I mean, this really aint good,\" Tomcat says.\n\n\"Keep your mind on the job. We have to get some visuals on enemy units, so the Fort knows what they're up against,\" you tell him.\n\n\"What if they're bigger and tougher than we are?\" he asks.\n\n\"Then we get a look at them for the Captain, and get the hell out of here,\" you say grimly. It's a strange feeling. You've never had to think about retreat before.\n\nSuddenly you pick up a small blip on your sensors, then a couple other small ones. The blips are moving toward you at a high speed, shifting about slightly. Probably dodging trees. Some sort of small hover vehicle, you wonder?\n\n\"Incoming hostiles,\" you say over the squad channel.\n\n\"I see them,\" he replies.", "action_results": [{"action": "\"Okay, let's brace to fire. Take 'em out on sight,\" you order.", "result": "\"Roger,\" he replies. The two of you plant your war machines' feet slightly apart, and firmly on the ground, having turned to face the incoming targets. You tap a button on one of your suit's control pads, and the twin-firing plasmabolt machine guns attached to your M.A.U.'s left arm begin spinning rapidly, ready to fire.\n\nSeconds later, the fast moving machines zip into sight through the trees, and you both open fire. Superheated bolts of energy blast out from your arm, tracing a line of destruction through the trees. You see a couple explosions, and fiery fragments of hover machines go flying through the air, but two of the small machines go flying between you and Tomcat, and in a second, disappear into the trees behind you.\n\n\"What the hell were they?\" Tomcat asks.\n\nYou wait to make sure the hover machines aren't heading back in your direction. On your sensor display you see them continuing on toward the Fort. \"Must be scouts of some kind. We've got a moment - bring up visual playback and let's check them out,\" you order.\n\nYou bring up a small window in the corner of your vision, and rewind the optical recordings of what your M.A.U. has seen recently. Just before the explosions took place, you press pause, and see a blurry image of what you blew up. It looked like a civilian a-grav hoverbike, but of a more angular design than those you had seen. A blurry figure sat on top of it, but you can't make out any good details. They appeared to be wearing some sort of green uniform that covered their whole body, like a jumpsuit, with oval shaped goggles or something on their faces.\n\n\"You got this, Captain?\" you ask over the military channel.\n\n\"We see it. Good work, Squad Leader. Must be some sort of scouts. Get closer, and try to get something on their main forces. We'll try to clear up your visual image, and get a better look at what you blew up. We'll deal with the other scouts when they get here,\" Captain Jefferson tells you.\n\nSuddenly there's a loud crack, and a massive bolt of lightning flies over the top of the forest. Explosions tell you that they struck at the Fort again, and you wonder how much damage they did.\n\nYou wait a moment, and then wave your Gatling's hand. Tomcat moves back into position beside you. You head off at a fast pace, continuing through the forest toward the landing site. Ten minutes later, numerous sensor blips begin appearing all over your sensors in the distance, close together so it is hard to tell what was a large enemy unit, or what was just a group of them close together. At the edge of your sensors, three massive blips mark the location of the enemy transports.", "action_results": [{"action": "\"Okay, let's run to the edge of the forest, get a good look, then get back to the Fort in one piece,\" you order.", "result": "You head for the edge of the forest, noticing that some of the enemy forces are moving away from the transports, toward the forest as well. Minutes later, the trees begin to thin before you, and you get your first glimpses of the enemy.\n\nThe three massive metal transports rise high above the ground in the fields beyond the forest, and massive hatches in their sides have opened. Hundreds, if not thousands, of infantry soldiers had already poured out of the transports to assemble in large formations in the fields. What is more disturbing are their mechanised assault units. These M.A.U.s are like nothing you have ever seen.\n\n\nInstead of being shaped like a big metal man, they are on four legs, with a large body pod-section in the middle, bristling with weapons. What is worse, if your estimates are correct, is that the enemy M.A.U.s must be sixteen metres (52 feet) high! They tower above the ground like five or six-story buildings! That's more than twice the height of your own war machine - and you thought your Gatling was big!\n\nThe body section of these behemoth sized war machines have three rotating cylinder shapes coming out of them, with sparkling, glowing spheres moving along the rims. They must be weapons of some sort, able to move about to fire in any direction!\n\n\"Squad Leader,\" the Captain's voice comes over the military channel. \"Zoom your optics in on those soldiers, let's try to identify who we're dealing with.\"\n\nYou press a button and zoom your view in on a large group of soldiers. What the - you gasp. You hear the Captain and Tomcat swear in unison, as they both get a better look as well. From the blurry image of the hoverbike rider you saw earlier, you had thought the soldiers were wearing some sort of green body suit. Now you realise it's their skin! Their unhelmeted heads reveal the enemy to be some sort of lizard men! You're dealing with an alien invasion fleet! No wonder the scout ships in this star system hadn't reported in - they had been destroyed by aliens with completely different weapon technology to your own! Thinking further, you realise that there haven't been any frontier raiders attacking in a long time. Perhaps the frontier star systems had already been conquered by the alien force?\n\nEven more chilling, you notice that many of the lizardman soldiers have long swords hanging from their belts, in addition to the rifles they carried. Swords? Talk about close combat. You feel glad that you aren't in the infantry, but have many sheets of metal between you and whatever comes your way.\n\n\"All right, Squad Leader, get back here pronto! We'll need all the help we can get!\" Captain Jefferson orders you.\n\n\"This aint good man... this aint good!\" Tomcat says over the squad channel, as one of the massive transports sends another crackling lightning bolt over the forest, and into the Fort compound.\n\nSome legions of infantry, and two of the massive behemoth war machines, have begun marching toward where you and Tomcat are hiding among the trees. Have they seen you on their sensors? Most probably, you think.", "action_results": [{"action": "\"Okay, Tomcat, let's get back to Fort Dale!\" you order, turning your war machine around.", "result": "You rush off into the forest, heading west toward the Fort. Behind you, too close for comfort, you hear cracking sounds like that of the alien transports' lightning cannon, but on a smaller scale, followed by explosions along the treeline. If you had remained near the edge of the forest, than whatever just fired would probably have blown you away! You feel a chill run down your spine as you race through the forest toward the walls of the Fort, and temporary safety.\n\nAround fifteen minutes later, having edged around to the southern side of the Fort, and having waited for the alien transports to fire their massive cannons at the Fort again, you race into the clearing and for the Fort gate.\n\n\"Squad Beta to Fort Dale, open up, we're coming in!\" you shout over the military channel. Thankfully, the gates slide open as you approach, and the two of you quickly move over to one of the walls, and crouch down behind it.\n\n\"Good to see you two,\" the Captain says. \"Shame about Wolfman, he was a good soldier.\"\n\n\"Thank you Captain,\" you reply, feeling a moment of guilt that all you had thought of was how happy you were to make it back to the Fort in one piece.\n\nThe Captain addresses the M.A.U. pilots of Dale Company. \"Okay, people, I want a defensive line along the east wall. Infantry will stand prepared to deal with any of those lizard men who manage to breach the walls. We're to focus on those big...\"\n\n\"I called them Behemoths, sir,\" you prompt him.\n\n\"Hmm. Behemoth it is. All pilots to focus fire on the enemy Behemoths. Gatling pilots, feel free to use your machine guns on the infantry forces as well. We recently got word that the Carriers Rogerson and Toyama are still up there in space. The Toyama will be bringing their squadrons of Gunships to provide us some support here at Fort Dale, so we just have to hold out until they arrive. If you believe in God or something, now's the time to say a prayer.\"\n\n ", "action_results": [{"action": "\"Sir - has anyone sent a message Out System to try and reach Sol Federation Command, and let them know we're under attack by aliens?\" you ask.", "result": "\"Of course we've tried that, Squad Leader. It seems something is jamming the Fort's interstellar communications. The enemy is blocking the Greyson Transmitter somehow, so we're stuck with local communications. I don't know if they're only jamming the Fort, or if the whole planet has been jammed somehow, but there's nothing we can do here,\" he tells you.", "action_results": [{"action": "\"What about civilian transmitters? If they're only jamming the Forts, they might not know about the Civilian Comm Centres!\" you suggest.", "result": "\"It's possible,\" Captain Jefferson agrees. \"If they aren't jamming the whole planet, but just the military, there might be a way to get a message through... Okay, here's the plan. You and Tomcat are to make for Drysdon City, and see if the C.C.C. there has been jammed. If not, transmit the visual data you recorded on you scouting mission. It might not work, but it's worth a try.\"\n\n\"It's got to work,\" Tomcat says. \"We saw how many of them there were out there. If it's like that at the other Forts, this planet is going to fall, and fast. We've got to get reinforcements!\"\n\n\"Get out of here, before the main force arrives,\" the Captain orders, as another explosive blast from the enemy transport cannons strikes one of the Fort's buildings. The gate slides open, and you and Tomcat race across the clearing and back into the forest.\n\nDrysdon City is located to the west, luckily for you, as the enemy landed in the east. It should take you a few hours running to get there. Thankfully, you don't have to physically run with your body, but only make slight movements for your war machine to respond to, so you should be able to run the whole way without tiring out. That is, assuming more alien forces haven't landed between the Fort and the city... or even in the city itself!\n\nForest turns into fields, and farmland, on either side of the road to Drysdon City. Soon more houses and buildings spread out in all directions, as you both stomp along the wide nature strip between opposite road lanes, designed so that M.A.U.'s can move through populated areas without stepping on hovercars or pedestrians. As the buildings grow up around you, and you approach the city, traffic lights at intersections automatically detect your approach, and turn red, so you can race across roads without squashing anyone.\n\nSkyscrapers rise before too long, and you are in the city. People scream and point in astonishment, as the two war machines run through the city. You wonder that everyone is still going about their business, and then realise that they might not even be aware that an alien invasion force has attacked the planet.", "action_results": [{"action": "\"Hey Tomcat, we better warn these people of the danger they're in from the alien invasion!\" you say.", "result": "\"I hear you,\" Tomcat replies. Together, you turn on your loudspeakers, and start warning people to find shelter, or some place safe, as an enemy force has invaded the planet and has a chance of overwhelming the Forts.\n\nYou quickly realise it was a mistake. As word spreads, and people hear your message while you run through the city, people begin to panic. Hovercars start speeding off in every direction. People race about recklessly, ignoring traffic rules. You soon find that you and Tomcat are standing in the middle of a traffic jam of panicking people!\n\n\"Get out of the way! We've got to get a message out over the C.C.C.!\" you cry over the loudspeakers. You realise your second mistake, as dozens of people start running toward the Civilian Communications Centre to get their own messages out.\n\n\"We've got to get there!\" Tomcat growls over the squad channel, then yells over the loudspeaker, \"We're coming through, get out of our way!\" He steps forward, crushing the front of a hovercar beneath one of his Fire Hawk M.A.U.'s  massive feet. People scream and start running away from the two war machines.\n\n\"Come on!\" he tells you over the squad channel, as he sets off, people and cars hurrying to make way. You sigh. There's no other way, you realise, and you stomp off after him, occassionally crushing parts of hovercars, and hoping no one gets injured as you race for the C.C.C.\n\nYou finally arrive at a large building with a massive dish on the roof, and the letters \"C.C.C.\" on a big sign. Pressing a button on your control pad, you shut down your Gatling. The pilot suit loosens up in it's harness, and you unbuckle yourself and pull free. Detaching the cables and control pads from your suit, you quickly find a small portable data stick, and insert it into a slot in the cockpit. Pulling a small switch, you wait as the visual data of your machine is downloaded onto the data stick, and then you pull the stick out and pocket it.\n\nPressing some buttons at the rear of the cockpit, the thick rear hatch slides open. Another button causes a rope ladder to pop out, and unfurl, unrolling down to the street far below you. You always feel uneasy climbing down, but you were trained for it, and you quickly descend to the street below. By now crowds have begun closing in on your parked M.A.U.s, calling out questions, and asking what is going on.\n\n\"Come on!\" Tomcat calls to you from nearby, and you both push your way through the crowd and into the C.C.C. building. People are everywhere inside, trying to get the attention of the clerks.\n\n\"Over here!\" One of the clerks calls out to you, seeing your military uniforms. You push your way through the crowd to the desk.\n\n\"This data has to be transmitted to Sol Federation Command, on Earth!\" you cry out over all the noise, and hand the data stick to the clerk. They nod their head, and plug the stick into their computer console. You pray that they haven't been jammed by the alien fleet. Moments later, the clerk gives you a thumbs' up. It worked!\n\nTomcat shares a laugh with you. Your mission succeeded! Now, it would take a few days for the transmission to reach the Earth, but there was hope! Someone would surely come and rescue the people of Mesarius V!\n\n\"Now what do we do? Our two mecha alone can't defend this city!\" Tomcat says.", "action_results": [{"action": "\"Let's get back into our M.A.U.s, and radio Fort Dale, and see what happened back there,\" you suggest.", "result": "You push your way back through the crowds, and climb the ladders up into your war machines. After suiting up and reactivating the machine, you turn on the Fort Dale military channel.\n\n\"This is Squad Beta, in Drysdon City. Captain Jefferson, do you read me?\" you ask. There is no reply, just static. Either the local military channels are also jammed now, or the Fort no longer exists...\n\n\"What do we do?\" you wonder out loud.\n\n\"Squad Leader,\" Tomcat says, having heard you over the squad channel, \"They didn't attack the cities, they focused only on military targets. Perhaps they aren't here to wipe us all out, but just to take control? Maybe they won't obliterate the cities?\"\n\n\"You could be right,\" you agree. \"If that's the case, then walking around in these war machines could make us and anyone near us targets for the enemy. How about... we'll hide our M.A.U.s in a warhouse somewhere, and try to blend in with the crowd. If the enemy comes in firing, then we mount up, and go out in a blaze of glory. What do you say?\"\n\n\"I'm with you, Squad Leader,\" he replies.\n\nYou stomp your way through the city, to the warehouse district. People scatter as the two M.A.U.'s stomp across the yards around a large warehouse that looks big enough to park your machines inside. Some workers come out, waving angry fists in the air.\n\n\"We're requisitioning this building for the military,\" Tomcat says over the loudspeakers, and you grin. They rush away, and you head inside and power down.", "action_results": []}]}, {"action": "\"Come on, let's get to the C.C.C.!\" you order Tomcat.", "result": "You finally arrive at a large building with a massive dish on the roof, and the letters \"C.C.C.\" on a big sign. Pressing a button on your control pad, you shut down your Gatling. The pilot suit loosens up in it's harness, and you unbuckle yourself and pull free. Detaching the cables and control pads from your suit, you quickly find a small portable data stick, and insert it into a slot in the cockpit. Pulling a small switch, you wait as the visual data of your machine is downloaded onto the data stick, and then you pull the stick out and pocket it.\n\nPressing some buttons at the rear of the cockpit, the thick rear hatch slides open. Another button causes a rope ladder to pop out, and unfurl, unrolling down to the street far below you. You always feel uneasy climbing down, but you were trained for it, and you quickly descend to the street below.\n\nA small crowd gathers, watching the two pilots come out of their war machines, obviously wondering what is going on. It is not unusual for M.A.U.s to walk through the city, but the two of you had ran in quite a hurry.\n\n\"Come on!\" Tomcat calls to you from nearby, and you both push your way past the crowd and into the C.C.C. building.\n\n\"Over here!\" One of the clerks calls out to you, seeing your military uniforms.\n\n\"This data has to be transmitted to Sol Federation Command, on Earth!\" you say, and hand the data stick to the clerk. She nods her head, and plugs the stick into her computer console. You pray that the C.C.C. hasn't been jammed by the alien fleet. Moments later, the clerk gives you a thumbs' up. It worked!\n\nTomcat shares a laugh with you. Your mission succeeded! Now, it would take a few days for the transmission to reach the Earth, but there was hope! Someone would surely come and rescue the people of Mesarius V!\n\n\"Now what do we do? Our two mecha alone can't defend this city!\" Tomcat says.", "action_results": [{"action": "\"Let's get back in our machines, and try to see how the Fort is faring,\" you say.", "result": "You go back outside into the street, and climb the ladders up into your war machines. After suiting up and reactivating the machine, you turn on the Fort Dale military channel.\n\n\"This is Squad Beta, in Drysdon City. Captain Jefferson, do you read me?\" you ask. There is no reply, just static. Either the local military channels are also jammed now, or the Fort no longer exists...\n\n\"What do we do?\" you wonder out loud.\n\n\"Squad Leader,\" Tomcat says, having heard you over the squad channel, \"They didn't attack the cities, they focused only on military targets. Perhaps they aren't here to wipe us all out, but just to take control? Maybe they won't obliterate the cities?\"\n\n\"You could be right,\" you agree. \"If that's the case, then walking around in these war machines could make us and anyone near us targets for the enemy. How about... we'll hide our M.A.U.s in a warhouse somewhere, and try to blend in with the crowd. If the enemy comes in firing, then we mount up, and go out in a blaze of glory. What do you say?\"\n\n\"I'm with you, Squad Leader,\" he replies.\n\nYou stomp your way through the city, to the warehouse district. People scatter as the two M.A.U.'s stomp across the yards around a large warehouse that looks big enough to park your machines inside. Some workers come out, waving angry fists in the air.\n\n\"We're requisitioning this building for the military,\" Tomcat says over the loudspeakers, and you grin. They rush away, and you head inside and power down.", "action_results": []}]}]}, {"action": "'I guess they're probably jamming the whole planet,' you think. Better focus on defending this fort!", "result": "Everyone readies themselves for the coming battle, and another two of the massive blasts from the transports fire upon the Fort before enemy blips begin massing on your sensors. Squad Alpha is on 'wall duty', their M.A.U.'s leaning up to peek over the wall every now and then.\n\nSuddenly one of them ducks his head back down, as smaller versions of the lightning cannon blast through the air.\n\n\"The enemy is here!\" the pilot tinforms everyone. \"Looks like those Behemoth's have three lightning weapons on them, smaller than the transports, but deadly all the same!\"\n\n\"Okay people, time to make a stand! Aim and fire, but keep an eye out for the transports. If you see them charging their big cannons up, duck down behind the wall until after they fire, then get back up again. We're here until it's just them or us. Go! Go! Go!\" the Captain shouts.\n\nEveryone leaps up and opens fire with everything they have. Looking out over the wall, you see two of the massive Behemoth machines stomping out of the forest, trees collapsing all around them. In front of and around the Behemoths are swarms of lizardman infantry. Many of them running at the wall, others leaping and bounding with incredible speed!\n\nOne of the Behemoths fires three bolts of artificial lightning from its three weapon spheres, and the energy arcs in on one of the pilots in Squad Gamma, completely obliterating the top half of his M.A.U. in a single blast!", "action_results": [{"action": "You open fire on the Behemoths with your energy cannon and your twin-firing plasmabolt machine guns!", "result": "You start blasting away with your fellow Dale Company M.A.U.'s at the Behemoth war machines. Blasts of superheated energy lance out from the energy cannon attached to your mecha's right arm, melting lines through the thick armour of the enemy war machines. Your twin-firing plasmabolt machine guns rotate at blinding speed, spitting out fiery bolts that spray the surface of an enemy war machine, peppering it with superheated metal.\n\nUnder the concentrated fire of Dale Company, one of the front legs of a Behemoth begins to buckle at the knee joint. As it starts to fall, it fires the three lightning-globe weapons, lashing out with fierce energy strikes. Two members of Squad Gamma are blown away by the strike, and a member of Squad Alpha goes down as the other Behemoth fires as well! There are only nine M.A.U.'s left in Dale Company!\n\nThen the front Behemoth tilts and it's leg snaps at the knee. The machine falls forward, pounding into the ground, but you realise that the moveable lightning-ball weapons on the top/sides of the machine are still able to point in the direction of the Fort's walls, so it is far from being out of the battle.\n\nSwarms of infantry charge the walls, some of the lizardmen jumping and bounding across the ground. As they reach the bottom of the wall, the jumping lizardmen leap up onto the wall, and somehow manage to cling to the slick metal surface! With horror, you watch as a dozen of the leaping lizard men climb up the wall, and leap past the towering Dale Company M.A.U.'s, and into the courtyard!\n\nYou glance behind you momentarily to see the infantry of Dale Fort battle it out with the lizard men. A number of soldiers die horribly, as the lizard men draw wicked looking swords, and cut them down. Then the Fort's battlesuit warriors open fire with their anti-infantry weapons, and blow the lizard men away.\n\nA small lightning bolt blast explodes against the wall beside you, from one of the Behemoths, and you turn you attention back to the battle!", "action_results": [{"action": "Focus fire on the fallen Behemoth!", "result": "Everyone joins together in firing on the fallen Behemoth. After a while, fragments of metal blast away from the top of the machine, and you fire into the hole. There's a huge explosion from within the Behemoth, as fire roars out the hole in its hull. Everyone cheers!\n\nThe cheers are cut short, six streams of lightning blast out of the trees. Tomcat and the Captain are blown away as two more Behemoths stomp out of the forest and join the battle! Then you notice energy charging at the front of the massive transports in the distance.\n\n\"Everyone down!\" you cry out, and everyone ducks as a massive lightning blast assaults the Fort. The Command Centre at the middle of the complex blows apart, shattering under the assault of the weapon! Then you see hundreds of lizardmen leaping over the walls and bounding down into the courtyard!\n\n\"We're being overrun!\" someone shouts over the military channel. You quickly stand up again, and open fire on the lizards with your Gatling's  twin-firing plasmabolt machine guns, mowing down groups of lizards, but there's too many of them! The Fort's infantry are swarmed, falling and screaming beneath the assault. Beside you, a fellow M.A.U. get's blown away by a back shot from the Behemoths behind you, on the other side of the wall!\n\nThen the lizard men are leaping and bounding onto the M.A.U.'s. You try to look down at the body of your M.A.U. but you head can't look straight down. They're crawling over your body, doing something! You glance at an M.A.U. near you, and see lizard warriors planting what looks like small explosive charges on the backs of his war machine. Moments later, you hear an explosion behind you, in the cockpit, and feel wind rushing inside.\n\nYour last thought is that they've blown the cockpit hatch off, and then you feel the blade of a sword thrust through your back, and everything goes dark.\n\nIt is the end... for you.", "action_results": []}]}, {"action": "You focus your twin-firing plasmabolt machine guns on the swarms of lizard man infantry!", "result": "You set your twin-firing plasmabolt machine guns into rotation mode, and start laying down lines of superheated bolts across the clearing, mowing down lizardmen soldiers who are charging for the Fort's walls. Some of the other Gatling pilots join you, focusing fire on the enemy infantry, while the Fire Hawks and the Captain's Nova focus their fire on one of the Behemoth war machines.\n\nTo your amazement and horror, many of the lizardman infantry leap and bound as they head for the wall, managing to dodge most of the superheated bullets streaming from the Gatlings' machine guns. Then the Behemoths open fire, six streams of artificial lightning surging toward the wall. You see the three M.A.U's of Squad Alpha get completely blown away under the assault! There's only nine of you left in Dale Company!\n\nAs the approaching enemy infantry reach the bottom of the wall, the jumping lizardmen leap up onto the wall, and somehow manage to cling to the slick metal surface! With horror, you watch as a dozen of the leaping lizard men climb up the wall, and leap past the towering Dale Company M.A.U.'s, and into the courtyard!\nYou glance behind you momentarily to see the infantry of Dale Fort battle it out with the lizard men. A number of soldiers die horribly, as the lizard men draw wicked looking swords, and cut them down. Then the Fort's battlesuit warriors open fire with their anti-infantry weapons, and blow the lizard men away.\n\nA small lightning bolt blast explodes against the wall beside you, from one of the Behemoths, and you turn you attention back to the battle! One of the Behemoths' legs snaps off at the knee and it falls forward, plunging into the ground. However, the moving, rotating design of its weapon system means the two lightning weapons on its upper body can still aim and fire toward the wall, so it isn't out of the fight yet!", "action_results": [null]}]}]}]}, {"action": "\"Let's wait a moment longer, to make sure nothing else comes out of those transports,\" you order.", "result": "You wait a minute longer, as the detachment of enemies draws closer, watching the transprots to see if anything else you've never seen before comes out. Nothing does.\n\n\"Okay, let's get out of here!\" you order.\n\n\"I hear ya!\" Tomcat says in relief.\n\nYou turn to run back west through the forest, Tomcat just behind you, when suddenly you hear the cracking sound of the transport weapons firing again! You only have a moment to respond, diving to one side, before it strikes. There's a huge explosion, shattering trees and scattering debris, as your war machine rolls along the ground, crashing into the trunk of a large tree.\n\nFor a while there is just a ringing sound in your ears, and large cracks and gaps in your vision tell you the optic feeds from the head of your M.A.U. were damaged. You try to stand up, but your limbs are all held solid in place, meaning your M.A.U. took severe damage, and it can't get up. Swearing, you try hailing Tomcat.\n\n\"Tomcat, you okay?\" you say over the squad channel. You get no response, just static. Damn, you think to yourself, as you flick a switch on one of your control panels, and power down. Your suit suddenly becomes limp, as the power turns off, and you slip out of the cockpit harness that held you in place. Unplugging cables you pull your headset free, and your own eyes' natural vision is restored. You realise your M.A.U. is lying on its side, on the ground, and press a button at the back of the cockpit to open the rear hatch. Only two meters off the ground, in this position, you lower yourself down to the forest floor.\n\nLooking around, you see that one of the massive lightning strikes hit right where the two of you were standing. Tomcat's M.A.U. lies scattered about in pieces of burning rubble. The blast must have struck him in the back, and because you were in front of him, you were partially shielded. Turning, you assess the wreck of your war machine. It will never walk again.\n\nWhat do I do now? You wonder. You decide to try and hike back to Fort Dale, and hope you don't run into alien infantry... or one of those massive behemoth war machines!\n\nYou start hiking, grumbling about the fact that M.A.U. pilots aren't equipped with sidearms. About ten minutes into your hike, witnessing two more of the powerful lightning strikes surge through the air above the forest, and hearing explosions from the Fort, you hear whining engine sounds behind you.\n\nThe sounds come so fast, you don't have time to respond. Alien soldiers on hoverbikes roar past you, narrowly missing you, as enemy scouts head toward the fort. Suddenly one of the hoverbikes comes back! It quickly slows to a halt, and the soldier leaps down onto the ground. Before you stands some sort of lizard man, covered in green scales!\n\nThe lizard man looks you up and down, and sees you have no ranged weapon on you, so he tosses his rifle behind him. Then you notice he has two more weapons - wicked looking swords hanging from either side of his belt. Swords? Who in the galaxy wields swords in this day and age??\n\nThe alien creature tosses one of the swords at you, and it lands quivering blade-first in the ground at your feet. It gestures for you to pick up the sword. With no other options apparant, you hesitantly pull the blade from the ground. Instantly, the alien launches into its attack. With no training in this sort of thing, you manage to block the alien's first sword blow, but the second slices clean through your heart.\n\nThis is the end... for you.", "action_results": []}]}]}, {"action": "Spread out behind the trees and let them pass. Hopefully they won't see us,\" you order.", "result": "You quickly run south, and try to get as many trees between you and the incoming vehicles as possible, while Tomcat runs north. You watch the small blips on your sensors, and hear small engine sounds roar past through the forest. The blips on your display keep heading west toward the fort, and then they vanish from sight.\n\nYou head north and meet up with Tomcat again.\n\n\"Must be scouts of some kind. Hopefully they didn't detect us, or the rest of the enemy force might know we are coming,\" you say over the squad channel.\n\nSuddenly there's a loud crack, and a massive bolt of lightning flies over the top of the forest. Explosions tell you that they struck at the Fort again, and you wonder how much damage they did.\n\nYou wait a moment, and then wave your Gatling's hand. Tomcat moves into position beside you, and you head off at a fast pace, continuing through the forest toward the landing site. Ten minutes later, numerous sensor blips begin appearing all over your sensors in the distance, close together so it is hard to tell what was a large enemy unit, or what was just a group of them close together. At the edge of your sensors, three massive blips mark the location of the enemy transports.", "action_results": [{"action": "\"Okay, let's run to the edge of the forest, get a good look, then get back to the Fort in one piece,\" you order.", "result": "You head for the edge of the forest, noticing that some of the enemy forces are moving away from the transports, toward the forest as well. Minutes later, the trees begin to thin before you, and you get your first glimpses of the enemy.\n\nThe three massive metal transports rise high above the ground in the fields beyond the forest, and massive hatches in their sides have opened. Hundreds, if not thousands, of infantry soldiers had already poured out of the transports to assemble in large formations in the fields. What is more disturbing are their mechanised assault units. These M.A.U.s are like nothing you have ever seen.\n\n\nInstead of being shaped like a big metal man, they are on four legs, with a large body pod-section in the middle, bristling with weapons. What is worse, if your estimates are correct, is that the enemy M.A.U.s must be sixteen metres (52 feet) high! They tower above the ground like five or six-story buildings! That's more than twice the height of your own war machine - and you thought your Gatling was big!\n\nThe body section of these behemoth sized war machines have three rotating cylinder shapes coming out of them, with sparkling, glowing spheres moving along the rims. They must be weapons of some sort, able to move about to fire in any direction!\n\n\"Squad Leader,\" the Captain's voice comes over the military channel. \"Zoom your optics in on those soldiers, let's try to identify who we're dealing with.\"\n\nYou press a button and zoom your view in on a large group of soldiers. What the - you gasp. You hear the Captain and Tomcat swear in unison, as they both get a better look as well. At first you had thought the infantry were wearing some sort of green body suit, but the zoomed image shows something quite different - you realise it's their skin! Their unhelmeted heads reveal the enemy to be some sort of lizard men! You're dealing with an alien invasion fleet! No wonder the scout ships in this star system hadn't reported in - they had been destroyed by aliens with completely different weapon technology to your own! Thinking further, you realise that there haven't been any frontier raiders attacking in a long time. Perhaps the frontier star systems had already been conquered by the alien force?\n\nEven more chilling, you notice that many of the lizardman soldiers have long swords hanging from their belts, in addition to the rifles they carried. Swords? Talk about close combat. You feel glad that you aren't in the infantry, but have many sheets of metal between you and whatever comes your way.\n\n\"All right, Squad Leader, get back here pronto! We'll need all the help we can get!\" Captain Jefferson orders you.\n\n\"This aint good man... this aint good!\" Tomcat says over the squad channel, as one of the massive transports sends another crackling lightning bolt over the forest, and into the Fort compound.\n\nSome legions of infantry, and two of the massive behemoth war machines, have begun marching toward where you and Tomcat are hiding among the trees. Have they seen you on their sensors? Most probably, you think.", "action_results": [null, {"action": "\"Let's wait a bit longer, and make sure nothing else comes out of those transports,\" you order.", "result": "You wait a bit longer, and as the enemy forces assemble in the fields, you realise nothing else is coming out of the transports.\n\n\"Come on, before they detect us,\" you order, and the two of you turn to run back through the forest.\n\nSuddenly there is a massive cracking sound, as one of the enemy transports unleashes another lightning bolt attack. You only have a moment to respond, diving to one side, before it strikes. There's a huge explosion, shattering trees and scattering debris, as your war machine rolls along the ground, crashing into the trunk of a large tree.\n\nFor a while there is just a ringing sound in your ears, and large cracks and gaps in your vision tell you the optic feeds from the head of your M.A.U. were damaged. You try to stand up, but your limbs are all held solid in place, meaning your M.A.U. took severe damage, and it can't get up. Swearing, you try hailing Tomcat.\n\n\"Hey, you okay?\" you ask over the squad channel. You get no response, just static. Damn, you think to yourself, as you flick a switch on one of your control panels, and power down. Your suit suddenly becomes limp, as the power turns off, and you slip out of the cockpit harness that held you in place. Unplugging cables you pull your headset free, and your own eyes' natural vision is restored. You realise your M.A.U. is lying on its side, on the ground, and press a button at the back of the cockpit to open the rear hatch. Only two meters off the ground, in this position, you lower yourself down to the forest floor.\n\nLooking around, you see that one of the massive lightning strikes hit right where the two of you were standing. Tomcat's M.A.U. lies scattered about in pieces of burning rubble. The blast must have struck him in the back, and because you were in front, you were partially shielded. Turning, you assess the wreck of your war machine. It will never walk again.\n\nWhat do I do now? You wonder. You decide to try and hike back to Fort Dale, and hope you don't run into alien infantry... or one of those massive behemoth war machines!\n\nYou start hiking, grumbling about the fact that M.A.U. pilots aren't equipped with sidearms. About ten minutes into your hike, witnessing two more of the powerful lightning strikes surge through the air above the forest, and hearing explosions from the Fort, you hear whining engine sounds behind you.\n\nThe sounds come so fast, you don't have time to respond. Alien soldiers on hoverbikes roar past you, narrowly missing you, as enemy scouts head toward the fort. Suddenly one of the hoverbikes comes back! It quickly slows to a halt, and the soldier leaps down onto the ground. Before you stands some sort of lizard man, covered in green scales!\n\nThe lizard man looks you up and down, and sees you have no ranged weapon on you, so he tosses his rifle behind him. Then you notice he has two more weapons - wicked looking swords hanging from either side of his belt. Swords? Who in the galaxy wields swords in this day and age??\n\nThe alien creature tosses one of the swords at you, and it lands quivering blade-first in the ground at your feet. It gestures for you to pick up the sword. With no other options apparant, you hesitantly pull the blade from the ground. Instantly, the alien launches into its attack. With no training in this sort of thing, you manage to block the alien's first sword blow, but the second slices clean through your heart.\n\nThis is the end... for you.", "action_results": []}]}]}]}]}]}, {"action": "\"Sir! Squad Beta will take turns looking over the wall,\" you volunteer.", "result": "\"Oh, great. Just great!\" Wolfman says over your squad channel.\n\n\"Okay, we're depending on you to tell us if any enemy units reach the clearing,\" the Captain says.\n\nFor the next fifteen minutes, you take turns leaning up and peeking over the wall. Now and then an enemy transport fires its massive lightning cannon at the Fort, sending debris showering across the courtyard.\n\nHowever, luck only smiles on you so many times. You lean up to see if you can see anything, just in time to be targeted by a lightning strike. All you see is white, searing light, filling your vision, and then the top half of your M.A.U. is gone, along with most of your body.\n\nIt is the end... for you.", "action_results": []}]}]}]}]}, {"action": "\"Let's go for a long patrol. We'll head out to the fields and hills, out east past the forests,\" you order.", "result": "You lead the squad to the towering gates of the Fort. \"This is Squad Beta, requesting Gate Clearance,\" you say to the fort's traffic control tower.\n\n\"We read you, Squad Beta. You're good to go,\" someone replies. The massive gates slide into the Fort's surrounding wall, and you lead your squad out. A large clearing lies between the Fort's walls and the forest that surrounds it, so that any approaching vehicles can always be seen. You lead your men east, off the road and into the forest, among the equally towering trees. It's a funny thing, being at eye-level with the tops of many of the trees, and it always takes you a moment to get your balance right, and for the feeling of being a giant to become natural.\n\nMany of the trees are toppled over throughout the forest, from people having stomped out among the trees. Being a three-story high metal man means that you often have to push trees out of the way. While conservationists might have a problem with such actions in some areas of the planet, no one complains when soldiers do it around a fort, as they depend on the forts scattered across the planet for protection, and you never knew if a raider force had secretly touched down, and enemy M.A.U.s were hiding among the trees, waiting for an opportunity to strike.\n\nWell, actually, that sort of thing was pretty rare. The Orbital sensor network always detected incoming ships, and could pinpoint the exact landing location of any military transports on the planet. Anyway, you stomp off among the trees, shoving them out of the way whenever you need to make room for your machine. Wolfman and Tomcat stomp along, off to either side of you.\n\n\"One of these days, we're gonna find a raider mecha waiting for us out here, and patrol is going to actually be interesting,\" Tomcat laughs.\n\n\"Hey, anything beats sitting around the barracks, losing at cards to Thunder,\" Wolfman replies.\n\nA twenty minute march later, and you come out from the thinning trees, and into the eastern fields of the region. Low hills rise here and there, and you walk about taking in the scenery. Nope, you think, no raider pirates out here today.\n\nSuddenly a ComTech from the Fort speaks over the Fort's military channel. \"This is Fort Dale to all units on patrol. Be advised, the planetary sensor network has detected unidentified incoming starships. We haven't been able to establish contact with the starship scout network either... This could be a raider force. Stand By for possible interception coordinates.\"\n\n\"I hope they land in our sector... haven't seen any action in months now,\" Tomcat says over the squad channel.\n\n\"Hang on, did they say they couldn't establish communcations with the starship scout network? What does that mean? A raider force couldn't take out all the carriers and gunships out there. I haven't heard of them being able to jam our communications either,\" Wolfman says worriedly.\n\n\"Nah, probably just a technical glitch at our Fort. The other Forts have probably heard all about it from the scout network by now,\" Tomcat says dismissively.\n\nThe ComTech at Fort Dale speaks over the military channel again. \"All units on patrol, be advised the planet has been taken to High Alert. We don't know what those ships are up there, but they're huge! Dozens of smaller ships, we assume they're military transports, have come out of the mothers, and are coming down all across the planet. We've got a couple of these transports inbound toward your location. Keep an eye on the skies, people, and if you get in over your head, get back here, and take up defensive positions inside the Fort! The other pilots at Fort Dale are mounting up, and should be ready for action soon.\"\n\n\"What the hell? Multiple transports heading our way? What exactly are we up against?\" Wolfman asks anxiously.\n\n\"Hey, frontier raiders aren't well armed. They're probably just small transports, full of infantry. We'll mow them down, and be back to the Fort for dinner in no time,\" Tomcat says confidently.", "action_results": [null, {"action": "\"Raiders usually only have one or two beat-up old M.A.U.s, I think we can handle that. Let's wait and see what's coming down,\" you order.", "result": "You lead them back into the treeline at the edge of the forest, and wait for a few minutes. Then you hear the loud rumbling of incoming spaceships. Moments later, four massive transports come into view to the east, slowing down, and heading toward Fort Dale. They looked about the size of a squad carrying M.A.U. transport, but were boxier and bulkier.\n\n\"What the heck are those things? I haven't seen a design like that before!\" Wolfman says over the squad channel.\n\n\"We could be up against twelve enemy M.A.U.s,\" Tomcat says.\n\nSuddenly the front of one of the enemy transports begins to glow, and moments later, there's a loud cracking sound as a massive bolt of artificial lightning shoots out from it and over the treetops toward the Fort. You hear distant explosions!\n\n\"We are under attack, I repeat, Fort Dale is under attack!\" you hear Captain Jefferson's voice over the Fort's military channel. Moments later, the Captain patches through direct to your M.A.U.\n\n\"Squad Leader - unidentified forces are attacking military Forts all across the planet. We won't be getting any reinforcements any time soon, and no one in our space fleet has reported in either. I want you to hang in there, and get some visual data on the enemy forces, so we can work out what we are up against!\" he orders.\n\nYou hear the sound of Gunship afterburners, and four Gunships suddenly roar over your heads. The afterburners switch off, and their rotors fold out, allowing them to hover in the air. The Gunships open fire on the lead enemy transport, blasting away at it repeatedly. The massive transport buckles, and slowly sinks toward the ground. The explosive impact knocks you off your feet! Moments later, massive lightning bolts fire from the other transports, and obliterate the Gunships in another quick succession of fiery explosions.", "action_results": [{"action": "\"Keep it steady, boys, we've got to film all of this for the Captain,\" you order.", "result": "Wolfman and Tomcat take up positions in the forest off to either side of you, and the three of you activate your optics recorders. Now, everything that you 'see' through the eyes of your mecha will be recorded to an inbuilt hard drive.\n\nYou watch in awe as the three remaining transports slowly lower to the ground, and feel the shuddering impact as they land. Moments later, one of them begins to glow at the front again, and another barrage of artificial lightning lances out overhead to assault Fort Dale. Checking your map display, you realise that the weapon is firing at a massive distance - further than any weapons you have ever seen before. You can't help but feel confused about this technology. Surely, no frontiersman would posses such a weapon, you think.\n\nThen massive bay doors slide open on the transports, and the enemy comes out. Hundreds, perhaps thousands, of infantry soldiers descend the boarding ramps. You are about to zoom in on them to try and make out any insignia on their green body-fitting uniforms, when you notice a massive metal leg protrude from inside one of the transports.\n\n\"What the hell...\" Tomcat murmurs over the squad channel. Then the rest of the enemy war machine comes into view as it stomps out of the transport.\n\n\nInstead of being shaped like a big metal man, the enemy machines walking out of the transports are on four legs, with a large body pod-section in the middle, bristling with weapons. What is worse, if your estimates are correct, is that the enemy M.A.U.s must be sixteen metres (52 feet) high! They tower above the ground like five or six-story buildings! That's more than twice the height of your own war machine - and you thought your Gatling was big!\n\nThe body section of these behemoth sized war machines have three rotating cylinder shapes coming out of them, with sparkling, glowing spheres moving along the rims. They must be weapons of some sort, able to move about to fire in any direction!\n\n\"Squad Leader - you better see what I'm seeing,\" Wolfman says, astounded.\n\n\"I see it!\" you reply.\n\n\"No, I mean, the infantry. Zoom in on the infantry!\" he replies breathlessly.\n\nYou turn your view to zoom in on a large group of infantry, and find yourself holding your breath in shock. What the - you gasp. You hear Tomcat swear as he looks at them too. You had thought the soldiers were wearing some sort of green body suit. Now you realise it's their skin! Their unhelmeted heads reveal the enemy to be some sort of lizard men! You're dealing with an alien invasion fleet! No wonder the scout ships in this star system hadn't reported in - they had been destroyed by aliens with completely different weapon technology to your own! Thinking further, you realise that there haven't been any frontier raiders attacking in a long time. Perhaps the frontier star systems had already been conquered by the alien force?\n\nEven more chilling, you notice that many of the lizardman soldiers have long swords hanging from their belts, in addition to the rifles they carried. Swords? Talk about close combat. You feel glad that you aren't in the infantry, but have many sheets of metal between you and whatever comes your way.", "action_results": [{"action": "\"We've got to get these visuals back to the Fort! Come on!\" you order.", "result": "\"We're with you, Squad Leader!\" Tomcat says, and they take up a position behind you, as the three of you run off through the forest.\n\nYou race among the trees for a good six minutes, and then you notice small, fast moving blips, on the sensor display that is projected onto your sight by your headset. The blips are catching up very quickly, obviously hover vehicles of some sort. They shift side to side occasionally as they dodge trees.\n\n\"We're being followed,\" Wolfman says over the squad channel.", "action_results": [{"action": "\"Brace for fire, and attack on sight,\" you order, coming to a stop.", "result": "\"Roger,\" they reply. The three of you plant your war machines' feet slightly apart, and firmly on the ground, having turned to face the incoming targets. You tap a button on one of your suit's control pads, and the twin-firing plasmabolt machine guns attached to your M.A.U.'s left arm begin spinning rapidly, ready to fire.\n\nSeconds later, the fast moving machines zip into sight through the trees, and you all open fire. Superheated bolts of energy blast out from your arm, tracing a line of destruction through the trees. You see a couple explosions, and fiery fragments of hover machines go flying through the air, but two of the small machines go flying between you and your squad mates, and in a second, disappear into the trees behind you.\n\n\"What the hell were they?\" Wolfman asks.\n\nYou wait to make sure the hover machines aren't heading back in your direction. On your sensor display you see them continuing on toward the Fort. \"Must be scouts of some kind. We've got a moment - bring up visual playback and let's check them out,\" you order.\n\nYou bring up a small window in the corner of your vision, and rewind the optical recordings of what your M.A.U. has seen recently. Just before the explosions took place, you press pause, and see a blurry image of what you blew up. It looked like a civilian a-grav hoverbike, but of a more angular design than those you had seen. One of the lizardmen aliens sat on top of it.\n\nSuddenly there's a loud crack, and a massive bolt of lightning flies over the top of the forest. Explosions tell you that they struck at the Fort again, and you wonder how much damage they did.\n\nYou wait a moment, and then wave your Gatling's hand. Tomcat and Wolfman move back into position beside and behind you. You head off at a fast pace, continuing westward through the forest toward the fort. Five minutes later, the clearing around Fort Dale, and the tall metal walls surrounding the Fort complex, come into sight. You see the shattered remains of the two hoverbikes that had flown past you. Looks like the boys at the Fort had a little target practice, you smile.\n\n\"Fort Dale, this is Dale Squad Beta. We're back, so open up!\" you call out over the local military channel.\n\n\"Welcome home, boys,\" Captain Jefferson says, as the massive Fort doors slide open. You race across the clearing and into the fort.\n\n\"You better lay low,\" Captain Jefferson says. \"They're a good shot with that lightning weapon of theirs.\"\n\nYou see that some of the buildings have large half-melted holes in them, and debris is scattered all about. It looks like some of the Fort's infantry were in the wrong place at the wrong time, and you see Medics carrying some away on stretchers. The other M.A.U.s of Fort Dale Company are crouched behind the eastern wall, and the three of you quickly stomp over and crouch down as well.\n\n\"We got visuals on the enemy Captain,\" you tell him, and then pause, thinking of how to explain. \"Sir, they're aliens! Lizard men or something. They're... they're not human, sir!\"\n\nThe Captain is silent for a moment, then replies, \"Patch a video feed through to my M.A.U., and show me what you've got.\"\n\n\"By the gods!\" he swears moments later, after seeing everything you witnessed. Then you notice large sensor blips in the distance. The enemy army is marching toward the Fort, through the forest.\n\nThe Captain addressed the M.A.U. pilots of Dale Company. \"Okay, people, I want a defensive line along this east wall. Infantry will stand prepared to deal with any of those lizard men who manage to breach the walls. We're to focus on those big...enemy machines...\"\n\n\"I call them Behemoths, sir,\" you prompt him.\n\n\"Hmm. Behemoth it is. All pilots to focus fire on the enemy Behemoths. Gatling pilots, feel free to use your machine guns on the infantry forces as well. We only just got word that the Carriers Rogerson and Toyama are still up there in space. The Toyama will be bringing their squadrons of Gunships to provide us some support here at Fort Dale, so we just have to hold out until they arrive. If you believe in God or something, now's the time to say a prayer.\"\n\nYou say a quick prayer, then ready yourself for combat, watching the blips slowly approach as the minutes pass. Then an idea comes to you.", "action_results": [null]}]}, {"action": "\"Let's wait a moment longer, and make sure no other surprises come out of the transports,\" you order.", "result": "You wait a bit longer, and as the enemy forces assemble in the fields, you realise nothing else is coming out of the transports.\n\n\"Come on, before they detect us,\" you order, and the three of you turn to run back through the forest.\n\nSuddenly there is a massive cracking sound, as one of the enemy transports unleashes another lightning bolt attack. You only have a moment to respond, diving to one side, before it strikes. There's a huge explosion, shattering trees and scattering debris, as your war machine rolls along the ground, crashing into the trunk of a large tree.\n\nFor a while there is just a ringing sound in your ears, and large cracks and gaps in your vision tell you the optic feeds from the head of your M.A.U. were damaged. You try to stand up, but your limbs are all held solid in place, meaning your M.A.U. took severe damage, and it can't get up. Swearing, you try hailing your squad mates.\n\n\"Guys, you okay?\" you ask over the squad channel. You get no response, just static. Damn, you think to yourself, as you flick a switch on one of your control panels, and power down. Your suit suddenly becomes limp, as the power turns off, and you slip out of the cockpit harness that held you in place. Unplugging cables you pull your headset free, and your own eyes' natural vision is restored. You realise your M.A.U. is lying on its side, on the ground, and press a button at the back of the cockpit to open the rear hatch. Only two meters off the ground, in this position, you lower yourself down to the forest floor.\n\nLooking around, you see that one of the massive lightning strikes hit right where the three of you were standing. Tomcat and Wolfman's M.A.U.s lie scattered about in pieces of burning rubble. The blast must have struck them in the back, and because you were in front of them, you were partially shielded. Turning, you assess the wreck of your war machine. It will never walk again.\n\nWhat do I do now? You wonder. You decide to try and hike back to Fort Dale, and hope you don't run into alien infantry... or one of those massive behemoth war machines!\n\nYou start hiking, grumbling about the fact that M.A.U. pilots aren't equipped with sidearms. About ten minutes into your hike, witnessing two more of the powerful lightning strikes surge through the air above the forest, and hearing explosions from the Fort, you hear whining engine sounds behind you.\n\nThe sounds come so fast, you don't have time to respond. Alien soldiers on hoverbikes roar past you, narrowly missing you, as enemy scouts head toward the fort. Suddenly one of the hoverbikes comes back! It quickly slows to a halt, and the soldier leaps down onto the ground. Before you stands some sort of lizard man, covered in green scales!\n\nThe lizard man looks you up and down, and sees you have no ranged weapon on you, so he tosses his rifle behind him. Then you notice he has two more weapons - wicked looking swords hanging from either side of his belt. Swords? Who in the galaxy wields swords in this day and age??\n\nThe alien creature tosses one of the swords at you, and it lands quivering blade-first in the ground at your feet. It gestures for you to pick up the sword. With no other options apparant, you hesitantly pull the blade from the ground. Instantly, the alien launches into its attack. With no training in this sort of thing, you manage to block the alien's first sword blow, but the second slices clean through your heart.\n\nThis is the end... for you.", "action_results": []}]}, {"action": "\"Let's get out of here! If they detect us, they might turn those massive weapons on us!\" you order.", "result": "\"But sir, our orders?\" Wolfman asks over the squad channel.\n\n\"To hell with orders, I'm with the Squad Leader,\" Tomcat says. Wolfman's M.A.U. nods its head, and they both fall in beside you as you run back westward through the forest for Fort Dale.\n\nSuddenly there is a massive cracking sound, as one of the enemy transports unleashes another lightning bolt attack. You only have a moment to respond, diving to one side, before it strikes. There's a huge explosion, shattering trees and scattering debris, as your war machine rolls along the ground, crashing into the trunk of a large tree.\n\nFor a while there is just a ringing sound in your ears, and large cracks and gaps in your vision tell you the optic feeds from the head of your M.A.U. were damaged. You try to stand up, but your limbs are all held solid in place, meaning your M.A.U. took severe damage, and it can't get up. Swearing, you try hailing your squad mates.\n\n\"Guys, you okay?\" you say over the squad channel. You get no response, just static. Damn, you think to yourself, as you flick a switch on one of your control panels, and power down. Your suit suddenly becomes limp, as the power turns off, and you slip out of the cockpit harness that held you in place. Unplugging cables you pull your headset free, and your own eyes' natural vision is restored. You realise your M.A.U. is lying on its side, on the ground, and press a button at the back of the cockpit to open the rear hatch. Only two meters off the ground, in this position, you lower yourself down to the forest floor.\n\nLooking around, you see that one of the massive lightning strikes hit right where the three of you were standing. Tomcat and Wolfman's M.A.U.s lie scattered about in pieces of burning rubble. The blast must have struck them in the back, and because you were in front of them, you were partially shielded. Turning, you assess the wreck of your war machine. It will never walk again.\n\nWhat do I do now? You wonder.", "action_results": [{"action": "You decide to try and hike back to Fort Dale, and hope you don't run into enemy infantry... or worse.", "result": "You start hiking, grumbling about the fact that M.A.U. pilots aren't equipped with sidearms. About ten minutes into your hike, witnessing two more of the powerful lightning strikes surge through the air above the forest, and hearing explosions from the Fort, you hear whining engine sounds behind you.\n\nThe sounds come so fast, you don't have time to respond. Soldiers on hoverbikes roar past you, narrowly missing you, as enemy scouts head toward the fort. They were wearing some sort of green bodysuit, but you didn't get a good look at them before they had gone by. What uniform is that? You wonder, trying to work out where the soldiers might be from.\n\nSuddenly one of the hoverbikes comes back! It quickly slows to a halt, and the soldier leaps down onto the ground. It is then that you realise with horror, that it was not a green uniform - it was their skin! Before you stands some sort of lizard man, covered in green scales! The invading force - they're not raiders from the frontier systems, they're aliens!\n\nThe lizard man looks you up and down, and sees you have no ranged weapon on you, so he tosses his rifle behind him. Then you notice he has two more weapons - wicked looking swords hanging from either side of his belt. Swords? Who in the galaxy wields swords in this day and age??\n\nThe alien creature tosses one of the swords at you, and it lands quivering blade-first in the ground at your feet. It gestures for you to pick up the sword. With no other options apparant, you hesitantly pull the blade from the ground. Instantly, the alien launches into its attack. With no training in this sort of thing, you manage to block the alien's first sword blow, but the second slices clean through your heart.\n\nThis is the end... for you.", "action_results": []}]}]}]}]}]}