{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=17306", "context": "", "first_story_block": "Blackness.\n\n\nYour mind is cloudy and hazy.\n\n\nPain. You feel pain.\n\n\nFlashes of sound burst in the distance. You slowly feel awareness coming back, the world leaking back into coherent form. You are in so much pain. Around you you hear familiar sounds: Screaming, the butchery of men, the agony of rape, buildings burning, children screaming, and the cheers of the victors.\n\n\n\"Where am I?\" You think to yourself. Slowly you move your fingers, then your toes. A soft moan issues from somewhere around you. You realize it is you and you begin to make your stiff body begin to move again. First one arm, then your leg, then you slowly lift up and look around.\n\n\nYou think hard to remove the fuzziness of the recent events from the corners of your mind and concentrate on survival. \"I've got a concussion.\" You conclude.\n\n\nFinally, you peer through the dense smoke and realize that you are in a crater, the bodies of men, horses, and weapons of war surround you. The acrid smell of burning flesh mixed with the tinny smell of blood, the pain in your head, and the entrails of the man you ran beside all make you vomit.\n\n\nStrangely, you feel just a little bit better and your head is starting to clear, \"I'm Sebastian, a mercenary, I chose to defend the city of Essitrea against the Turric . I don't think we won... I think I'd better get the hell out of here!\"\n\n\nLooking around you a sturdy broadsword sticks out from a body of a Turric soldier, you recognize the blade as yours. You stagger over to the soldier and with effort pull the blade free from the man's corpse.\n\n\nNow armed, you know you've got to get out but amidst the rubble and the ruffians running amok, the sounds of battle in the air, and the thudding of artillery, every step could be your last.\n\n\nYou decide quickly that you can either run building to building a fast method of travel but with heavy odds of discovery; try to enter the sewers, an obviously unsanitary means to travel but with less likelihood of discovery, or you can try to hole up in the nearest building and wait for the action to die down.", "action_results": [{"action": "Run For It!", "result": "You grab your blade tightly and look around quickly before dashing over the lip of the crater and towards the blasted wall nearest your left side. Nearby an explosion spurts up chunks of earth and stone as well as the arm of a corpse, high into the air. You watch in horror as the appendage plops onto the sidewalk.\n\n\nFrom your left, three Turric warriors rush and assault an injured merchant, stabbing him repeatedly with their wickedly barbed scimitars before looting the man's corpse.\n\n\nTo your right you see another building about twenty feet across some exposed ground.\n\n\nDo you:", "action_results": [{"action": "Attack the Turric Warriors?", "result": "You attack the warriors with the advantage of surprise. Crawling low, you creep until you are at the edge of the wall you were hiding behind then you suddenly sprint with your broadsword lifted in both hands. As you descend upon the Turric Warriors, you swing the sword in an arc that splits the first Turric Swordsman's left arm from his body. You spin and use the heavy blade's momentum to make a second cut from the shoulder blade up through the man's neck decapitating him instantly.\n\n\nAs the first warrior falls, blood arcing into the sky, the two others reel in shock. You take advantage of this momentary lapse of reason and bring a low slice towards the second man's knee. The blade connects and the limb is taken clean off. Following the blade's momentum, you raise it up and steer it into the man's chest.\n\n\nThe third warrior has now gathered his wits and attacks viciously trying to slice you with his barbed scimitar. You back away from the first strike, block the second, and duck the third. His blows are coming faster than the broad-blade can react. Do you: Parry and look for an opening with the butt of your sword to stun the enemy or block with the sword and pull a dagger with your other hand and plunge it into his neck?", "action_results": [{"action": "Parry and Stun the Enemy!", "result": "You conserve your energy and block his blows. Knowing the wild style of the Turric swordsman, you easily parry several wild blows. As he failed to strike he becomes more and more frustrated and you lure him into a wide swing and while he is pulling back, you step in his reach and break his nose with the handle of your sword. The stunning blow makes him stumble backwards and you press the advantage kicking him backwards and then turning your sword and driving it through his stomach!\n\n\nHe squirms like a worm for several long seconds before you twist your blade and finish the job. Though you conserved your energy by blocking, you attracted the attention of a few more warriors. They come streaming out of a building to your right and you count at least five men, two with crossbows aimed in your direction.\n\n\nDo you: Run away or  turn to face the group and take them head on using throwing knives to whittle them down before resorting to your sword?", "action_results": [{"action": "Run Away!", "result": "Feeling like discretion is the better part of valor, you turn tail and run away as fast as you can. You are lithe and Agile and in light armor and the heavier, more armored men can't keep up. However, one of the crossbowmen draws a bead on you and fires. The bolt slams into your left shoulder and you scream in pain before skirting around a clump of rubble and ducking under some fallen timbers. The warriors curse as they try to track you but they walk past your position and disappear into the smoky ruins.\n\n\nYou are injured and the bolt projects out of your left shoulder. You try to hold back tears as you reach with your good arm and gingerly touch the shaft. It's buried deep and you'll need a healer to remove it. You grimace and pull your first aid kit out of your belt. You find a few bandages and make yourself a sling and place your left arm in it.\n\n\nYou are alive but now you are crippled. Without both arms your swordplay will be much diminished and you realize that your ability to defend yourself has been compromised. You will now have to use stealth until you can find an ally or escape altogether.\n\n\nDesperate, you must move on, losing consciousness in this state could be life-ending.\n\n\nDo you:", "action_results": [{"action": "Wait for Nightfall to Continue?", "result": "Resting back, you decide to wait until nightfall to continue trying to escape. You hope that your stealth will be aided by the darkness. The problem is finding a decent place to rest. Carefully, you creep towards a building that looks promising. It is three stories tall but also damaged and missing most of the roof. You think that it is the least likely place around the enemy will look but you admit it's a gamble and a possible deathtrap if you get cornered by enemy forces with no where to run.\n\n\nMaking sure no one is watching, you scurry from the rubble to an alley and with another quick look around, you duck through a hole in the wall and make it into the first floor. A quick search reveals nothing good. A family has been butchered, the man stabbed repeatedly, his wife raped and her throat cut, the oldest boy, perhaps ten in age, was stapled to the wall with crossbow bolts and still hangs there, his life's blood pooled and congealed at his feet, and the youngest daughter, about six? Well if there is a hell, who ever hurt her will burn there forever.\n\n\nYou curse the gods at their apathy and resolve to never give up, never surrender, even if death is the only alternative! Better to jump from a building or cut one's own throat than to be raped and killed like a cowering dog.\n\n\nA noise takes you out of your revelry, you need to hide somewhere and fast! Rushing towards the staircase do you...\n\n\n \n\n ", "action_results": [{"action": "Run Upstairs!", "result": "You skate up the stairs taking three at a time and find a door at the top of the stairs. You pull out your lockpicks and begin to jimmy the door. Within seconds you hear the lock 'click' and you slide inside closing the door behind you. You hear a creak and some sniffling sounds somewhere in the room. It's very dark, all of the windows are shuttered, and you negotiate the room by sound and touch rather than lighting a lamp and giving yourself away.\n\n\nFollowing behind your sword, you investigate the dark room and try to track the noise before someone or something gets the drop on you. When the sound is made again, you rush to the wall ripping off a tapestry and see a that it hides a small doorway. You open it in a flash, sword back to provide a fatal stab. To your surprise a young girl, perhaps sixteen years in age is in hiding.\n\n\nYou look at her frightened face, streaked with tears and the knowledge that none of her family made it through whatever happened downstairs. She screams at the sudden discovery and scrambles as far back in the hidden compartment as she can go. You curse your luck and say, \"Be quiet girl! I'm not here to hurt you! Pray you haven't woken the neighborhood!\"\n\n\nYou quickly move away from the whimpering girl and check the windows. Sure enough two Turric Swordsmen and a Wardog are on the prowl. The dog starts to bark and drag the two soldiers towards the house.\n\n\n\"Shit!\" You hiss and move back to the secret compartment. Pulling up the tapestry you tell the girl, \"No matter what you do, no matter what you hear, do not leave this compartment for the next few hours unless you hear me say 'Defender'.\" You slide a dagger her way and say, \"And no matter what, don't let them take you alive, if this place is discovered, if this flap is opened and they try to take you, slice your throat, plunge this into your chest but don't let them take you out of here. No matter what!\"\n\n\nYou close the hidden door, drop the tapestry, close and lock the door to the first floor, and hide behind a desk. When those bastards come through they're going to pay dearly.\n\n\nThe sound of heavy boots tromping up the stairs follow a barking dog. They try the lock, try it again, and then start trying to bash the door in. The door survives four solid charges before the door rips off of the hinges and the men and beast rush in swords drawn.\n\n\n ", "action_results": [{"action": "Kill the Dog First", "result": "You realize that the hound is going to be a noisy, dangerous problem and so you resolve to end that issue first. As soon as the trio of enemies rush into the room you pop up from behind the desk and throw three throwing knives at the beast. The first knife goes wide and lands knee level in the wooden wall, but the second catches in the jaw bursting it's teeth and jutting through it's muzzle, and the third smashes in the flanks sticking through it's hind quarter. The beast yelps pitiably and staggers backwards incapacitated.\n\n\nThe beast howls and you leap over the table drawing both of your short blades. In close quarter fighting, your short swords and stabbing style will be a good match against the barbed scimitars the Turrics favor which require wide fast swings.\n\n\nThe first Turric swings high and you duck and deflect the first blade while reversing your spin and cutting the soldier's leg off at the knee. The second swings towards your midriff but you tumble and his swing lodges in his already injured partner's ribs.\n\n\nYou crouch and then spring low stabbing the second soldier's foot and slicing his sword arm off at the wrist. The second soldier screams and tries to stagger backwards but his foot is pinned to the floor. Rising you pull the blade free and jut the short blade up into his stomach pushing under his ribs until the blade pierces his heart and blood runs down his armor like a burst dike.\n\n\nAs he falls back, you turn to the hound. You hate to kill such a noble beast but it was now time to end it's pain. A quick reversal of your swords sets up a downward thrust that pierces it's brain and severs it's spine. The hound collapses with a quiver.\n\n\nYou wipe your swords on a soldier's sleeve and place them again on your back. You then collect your throwing knives and search the soldiers for anything they carry you can use. You ignore their damaged armor, barbed scimitars, and top-heavy daggers and instead collect their coin pouches. Thirty Silvers later, you check the windows. You are relived to see that there is no further action in the streets.\n\n\nDo you:\n\n\n ", "action_results": [{"action": "Go into the Basement?", "result": "You hurry downwards, using the stairs to enter the basement. At the bottom of the stairs is a cellar door. It opens easily into a pitch black room. You back up and decide to light your lantern.\n\n\nNow with a fresh light source, and broad sword in your other hand you begin to explore the room. The basement is dark and eerie, filled with boxes and other items of storage, small terra cotta statues, paintings and furniture with tarps over them, extra sets of candles, piles of clothes, and other errata fill the shelves, cabinets, and wall spaces.\n\n\nYou figure that if you were to hide here, you'd probably be able to get the jump on any who entered here but you'd be trapped if there were multiple opponents. You reason you could probably take two swordsmen without difficulty but a larger group would be problematic.\n\n\nDo you:\n\n\n ", "action_results": [{"action": "Search the Basement", "result": "You decide to search the basement. You comb through the boxes, look through the shelves, and rifle through the cabinets looking for something that could help you with your escape from the city. As you are searching, you hear some noises coming from above. Quickly you duck and blow out your lantern.\n\n\nYou can now light your lantern 2 More times.\n\n\nTense moments pass but the sounds cease. after ten minutes you feel safe enough to try looking again. After about a half of an hour you have accumulated everything that might be of interest to you. It isn't much but these people were obviously merchants, not warriors and as such didn't store any warrior items.\n\n\nYou find:\n\nLantern Oil: Useful for lighting your lantern 3 extra times.", "action_results": [{"action": "Crash here.", "result": "You're tired, you've had  a long afternoon and you have found somewhere to crash. You hope that this place is safe enough but in a city under siege, no where is truly safe. You find a little corner amongst the clutter and nestle in as best as you can.\n\n\nYou place your broadsword to your side within easy reach and thank the gods you have your modified light chainmail. It's very comfortable to sleep in, especially compared to most armors. Covering yourself with a blanket you slip easily into the demesne of sleep.\n\n\nTEST YOUR LUCK: Pick a number between 1 and 3.\n\n ", "action_results": [{"action": "1", "result": "You sleep fitfully, your dreams filled with nightmares that involve you being caught by the Turric, held down, and cut into pieces and fed to wardogs with fiery eyes. Several times you jump awake and look about yourself hoping you haven't been discovered and sit for several minutes straining your ears for phantom noises but eventually give up the search and head right back into another nightmare. You aren't discovered but you really don't feel rested when you awake.\n\n\nFrustrated when you awake, you grumpily gather your few belongings and head back out into the city. It is now NIGHT.", "action_results": [{"action": "NIGHT: Creeping in the Darkness", "result": "You wait until nightfall and begin to make your journey flitting from alley to alleyway and make good progress though you occasionally have to see nightmares, at one intersection you see Turric soldiers by a scaffold where then men and women; soldiers and civilians both, are being hanged. You cringe as the men slap the horses underneath the victims and the prisoners are left to dangle helplessly in the air struggling as their weight begins to choke them to death. It takes over three minutes before the last of the men stops twitching, leaving the bodies swinging in the air.\n\n\nYou move on helpless to alter the events of the sacking of the city. Stepping from an alleyway you later see hundreds of Turric soldiers leading hundreds more prisoners down a broad street towards whatever grim fate awaits them. You turn back and enter a building through a window moving across the floor and exiting out the other side. Most of the buildings have by now been ransacked.\n\n\nYou exit out of the other end and creep into the next street. You immediately flatten against the wall as you see a Turric Deathwarden steering a group of hellhounds down the street. The flaming hounds are barking and growling but don't catch your scent. Taking a deep breath, you wait for the Deathwarden to pass and sprint for the next street.\n\n\nFinally, after over two hours have passed, you arrive at a massive barricade. The barricade is manned by a holdout group of Essitrean soldiers each holding crossbows. There have to be dozens of them all on watch. The bodies of hundreds of Turric soldiers lie scattered in the streets around the barricade though it's obvious the Essitreans are wounded and exhausted.", "action_results": [{"action": "Join them", "result": "You pull your contract and slowly move towards the Essitreans making sure that you hold the contract high so that the tired and trigger happy soldiers don't mistake you for the enemy. As you enter into their line of sight, you hear the guards call out, \"Halt and identify yourself or you'll be shot on sight!\"\n\n\nYou enter into the torchlight and call out, I'm Sebastian, a mercenary serving under the Essitrean flag, here is my lawful contract. I wish to join you.\"\n\n\nThe men aren't much moved but a voice calls through the barricade, \"Sebastian? By the Gods you're still alive? Boys, let her in, she's a friendly.\"\n\n\nYou jog across the street looking both ways for any enemy snipers or troops and enter a small gate and go beyond the barricades. The gate is closed quickly behind you. The situation behind the barricades is worse than you would have imagined, with dozens of troops injured or dead, scorch marks from enemy mages, and decapitated undead minions lying like wheat after the harvest.\n\n\nA soldier approaches you and offers you a handclasp. You recognize him as Captain Krayler, a stern but effective commander whose forces numbered a full company, scarcely three platoons exist now and you see that by daylight only two dozen men will still be clinging to life. His face is grim and streaked with blood and dirt. he says, \"What is the situation in the city beyond.\"\n\n\nYou reply, \"The city is lost, the Turric are killing and rounding up anyone they find and Deathwardens, Vanguards, and Deathmagi wander the streets at will.Those who aren't killed or turned into the Walking Dead are being turned into slaves. I'm sorry Commander.\"\n\n\nHe nods and said, \"I was expecting as much. The tide of refugees has thinned and you've been the first person we haven't had to fight in three hours. This is a tragedy, we watch the death of my beautiful home and the birth of another Turric Enclave. Such a blasphemy to the gods should have never been seen.\"\n\n\nYou nod.\n\n\nHe says, \" I know you are tired and hungry, let me offer you some scant supplies and then we'll talk further.\"\n\n\nYou are led to a chow table, mostly chunks of bread and a few sips of water from a canteen before he leads you to a chair. You have a seat and instantly the weight of the night descends upon your weary bones. The captain brings you a tightly wrapped scroll and says, \"Bast, you've always been a reputable mercenary, I need someone I can trust with an important mission. I need you to take this scroll and this boy. He is the heir to Essitrea's throne. Though his home has been lost he can keep the noble lineage flowing and can rally any escapees under the Essitrean Banner so that one day we can take this place back. I need you to take him with you to the gates. Can you do this for me?\"\n\n\nYou ponder your options:", "action_results": [{"action": "Take the Boy and Scroll", "result": "You nod, this was a grave task. \"I will be proud to serve the throne, Sir. I will take the young lord and deliver him safely to his men outside the gate.\" \n\n\nThe Commander nods and points to one of his men, and from a tent they bring forward a richly dressed but dirty faced little boy of about ten Summers old. Blood stains the front of his clothes but he appears uninjured. He wields a short sword uncertainly and there is both fear and stout resolution in his eyes. The boy looks you up and down, \"I am to go with this lady?\"\n\n\nYou look to the captain who says, \"Yes, Milord, Sebastian is an experienced and wise warrior and your best hope from henceforth, follow her, do what she says, and rebuild our city. Remember those who died for it.\"\n\n\nThe Lordling nods and says, \"I am honored to make your acquaintance Sebastian. Take my horse Arbalest he is a true steed meant for a warrior. The white pony is my own mount Bayerus.\"\n\n\nThe Commander smiled and said, \"Well that's that. We'll hold the wall, we are the last hope for anyone to try and escape this blasted place. I wish you luck Sebastian.\" You salute and turn to head for the gates.\n\n\nYou begin the last part of the journey even as you hear behind you, \"Ready men, here they come!!!\"\n\n\nThe sound of battle rings out behind you as you gallop for the Only gate left in the city still controlled by Essitrean forces. The last that you see of the captains forces is the zombies overwhelming the barricades.\n\n\nLess than fifteen minutes later you arrive at the gates with the Lordling. Men snap to salute as you and the Lord Ride out of the city into the countryside. You know not where the future lies but you realize that you have found the only candle of hope in the darkness that falls over the city of Essitrea.", "action_results": []}, {"action": "Refuse and Go it yourself", "result": "You decide to refuse the offer and exit the barricade choosing to make it on your own.", "action_results": [{"action": "Head to another part of the city.", "result": "You decide to head to another part of the city and are flitting from building to building when you see a massive attack by Turric troops to your left. To your right an explosion rocks the streets and ahead, you see a Deathmagus and his Vanguard accompanied by a horde of undead. You are spotted by the Deathmagus down the streets and you turn to run, there are just too many of them. At first you try to retreat and go back to the barricades but another explosion collapses the buildings around you.\n\n\nYou are now faced with running into mass combat, into the necromancer or down the alley where an explosion just occurred. You run down the alleyway and lose sight of the Deathmagus and the battle but run into a mass of Turric reinforcements. You are trapped. You retreat and are now surrounded by the three forces.\n\n\nYou resign yourself to a death by the sword. Choosing the least dangerous option, you run into the mass combat. The chaos of arrows, swordfighting, and bodies moving en mass make the situation deadly. You duck, twist, and dodge through the massive melee. Unfortunately, you are struck by an random arrow and then tripped by the boot of a running soldier who is quickly killed by a crossbow bolt. You try to rise but watch as a roiling ball of flame explodes incinerating those around you.\n\n\nAnother explosion takes a building out and it collapses showering stone and mortar over the street. You are caught be a falling piece of rubble the size of a horse and it lands on your leg. You try to free it but another explosion demolishes the next building and it collapses and sprays more stone upon you. You are killed by a falling brick  that turns your head into a read smear.\n\n\nYOU HAVE FAILED!!!", "action_results": [{"action": "A Horrible Awakening", "result": "Blackness.\n\n\nYour mind is cloudy and hazy.\n\n\nPain. You feel pain.\n\n\nFlashes of sound burst in the distance. You slowly feel awareness coming back, the world leaking back into coherent form. You are in so much pain. Around you you hear familiar sounds: Screaming, the butchery of men, the agony of rape, buildings burning, children screaming, and the cheers of the victors.\n\n\n\"Where am I?\" You think to yourself. Slowly you move your fingers, then your toes. A soft moan issues from somewhere around you. You realize it is you and you begin to make your stiff body begin to move again. First one arm, then your leg, then you slowly lift up and look around.\n\n\nYou think hard to remove the fuzziness of the recent events from the corners of your mind and concentrate on survival. \"I've got a concussion.\" You conclude.\n\n\nFinally, you peer through the dense smoke and realize that you are in a crater, the bodies of men, horses, and weapons of war surround you. The acrid smell of burning flesh mixed with the tinny smell of blood, the pain in your head, and the entrails of the man you ran beside all make you vomit.\n\n\nStrangely, you feel just a little bit better and your head is starting to clear, \"I'm Sebastian, a mercenary, I chose to defend the city of Essitrea against the Turric . I don't think we won... I think I'd better get the hell out of here!\"\n\n\nLooking around you a sturdy broadsword sticks out from a body of a Turric soldier, you recognize the blade as yours. You stagger over to the soldier and with effort pull the blade free from the man's corpse.\n\n\nNow armed, you know you've got to get out but amidst the rubble and the ruffians running amok, the sounds of battle in the air, and the thudding of artillery, every step could be your last.\n\n\nYou decide quickly that you can either run building to building a fast method of travel but with heavy odds of discovery; try to enter the sewers, an obviously unsanitary means to travel but with less likelihood of discovery, or you can try to hole up in the nearest building and wait for the action to die down.", "action_results": [null, {"action": "Sewer Crawl", "result": "The sewers of Essitrea are known as dangerous places because of sickening garbage, diseased creatures, and rogues who operate within it's demesnes. A place without laws, the sewers often cough up bodies into the lake every month or so. However, compared to the world above, the sewers seem like a dream.\n\n\nYou duck into a pocket of ruins and smoke and look for a manhole cover. It takes you several minutes and you have to dodge several roving bands of Turric Raiders but you eventually find and alley and prop open a manhole. Seconds later you slip inside and pull it over your head.\n\n\nThe crawl down into darkness makes the world above muffled and the liquidy darkness below echoes with the hollow ring of the tunnels below.\n\n\nFinally you touch bottom. Looking around you, you see a dim light in a big tunnel to the south and a overwhelming darkness in the tunnel to the north. You've a small lantern but it's glow is sure to attract the curious, just as it might ward away other survivors trying merely to remain unseen. Either way you need to make a decision.\n\n\n ", "action_results": [{"action": "Go south towards the dim light.", "result": "You decide to go towards the light, as you move you begin to hear voices, hushed voices that whisper quietly. As you approach you see a group of huddled figures cowering under the light of a single covered lantern. They gasp as they see you and begin to flee but stay when they realize that you aren't an enemy soldier. \n\n\nPassing the non-combatants, you move deeper into the tunnel. Rats and cockroaches skitter over your feet as you move around sludge and piles of fallen debris deeper into the cavernous tunnels. You arrive at a 'T' intersection and face a choice Right or Left. Both are dark and you know that you will have to light your lantern to continue forward.\n\n\nDo you:\n\n\n ", "action_results": [{"action": "Take the Right Tunnel", "result": "You've been following the right tunnel for about thirty minutes with your lantern projecting light through the darkness. You are pretty creeped out because you know that as far as you can see with the light, those you approach can see the light radiating five times farther. You see shadows flitting around you, the squeek of rats, the clicking of roaches and spiders, the awful ugly smell of garbage piles, the occasional stench of something that died in the tunnels, and hear the occasional yowl or hiss of something larger lurking within.\n\n\nThe sewers are like a labyrinth of connecting tunnels with pipes spewing filthy water into the sluices of carved out rovers in the bottoms of the mazework. Occasionally grates ooze with seaweed like funguses and patches of mold make the slick damp walls furry.\n\n\nYou reach a place where the water splashes down a hole that drops into the darkness. Over the hole is a grate. Unfortunately the tunnel stops at this point. You realize that you've hit a dead end.\n\n\nTurning around with a silent curse, you spot a manlike form approaching you. You raise the lantern and hear a shriek. Before you are three Nuppers, ugly grey creatures that look like furless chimpanzees with heavily armored knuckles. their white sightless eyes and razor sharp teeth remind you that these scavengers are deadly to lone travelers even though they are by nature cowardly.\n\n\nYou try to decide whether you want to go into ranged combat against the fast moving Nuppers or go into melee combat.\n\n\n ", "action_results": [{"action": "Go melee with Swords", "result": "You charge the Nuppers with your broadsword and swipe across the waist. The first Nupper leaps up into the air over the slowly moving blade and punches you hard in the chest. You whirl around and execute a downward slice at a second Nupper which rolls backwards. From your back a Nupper kicks you forward with a two clawed foot to the head.\n\n\nYou realize that the Broadsword is too slow and you drop it and pull your short swords but you take another hit to the side from a gnarled fist. You swing to meet it and catch it across the throat causing a burst of black blood to fly free as it staggers back and falls into the sewage sluice and is swept away in the current down the hole.\n\n\nYou scarcely have time to react before a Nupper kicks your knee causing it to buckle and twist taking you to the ground. Both beasts immediately leap on you and you block a bite to your face even as the second bites your thigh ripping away a chunk of flesh. You scream and stab ineffectively at the one on your chest  as the bottom one rips into your stomach.\n\n\nAnother stab kills the one on your chest when you shove your blade into it's neck so that your blade pierces through it's skull. The rip in your stomach widens as the bottom beast rips into your intestines. Blood spurts from your mouth in frothy red bubbles as you see your intestines get ripped out of your body. Your swords fall limp and clatter on the ground.\n\n\nYOU HAVE FAILED!", "action_results": [null]}, {"action": "Fight at range with Daggers", "result": "You slip your throwing knives out of their sheathes and let them fly, the first blade is deflected by a quick moving Nupper but the other slides into his chest. It staggers back a bit s you loose three more and dodge a Nupper who leaps high, swings off a pipeline and aims for  a kick to the head.\n\n\nYou spin away and throw three knives into his back. It yowls in pain and staggers forward. Meanwhile you dodge another Nupper with a quick flying fist. Spinning around him you pull your dagger and another throwing blade. Before you can launch your strike you sidestep the Nupper with a knife in it's chest and slash it's furless arm with your dagger. It retreats a bit holding onto it's injured arm and you turn and throw a knife at the Nupper with three knives in it's back. Another knife sticks in it and it staggers and falls.\n\n\nYou face an uninjured Nupper and one with a knife blade and a deep arm slash. You circle for position before launching two throwing knives at the injured one. It blocks the first blade which goes whizzing off into the darkness. The second is blocked by his other arm and the throwing blade sinks deep into the uninjured arm.\n\n\nYou cheer inwardly as it retreats in pain. However you quickly have to duck under a swing from the uninjured Nupper. You duck at an angle and slice upward leaving a slash across it's stomach.\n\n\nIt reverses it's stance and punches with it's left grazing your chin which feels as if it were hit by a brick. Luckily you don't lose a step and push forward imbedding your dagger deep into it's forearm. It now howls in pain and you execute a spinning kick that knocks it off of the ledge into the draining sluice. It disappears into the dark swirling muck and flows down the hole into the darkness.\n\n\nThe last Nupper is intimidated and decides to flee. Collecting your throwing daggers you realize that two are gone forever. You are happy to be alive but feel much less armed that before.\n\n\nYou spend the next hour navigating the mazes back to the 'T' Intersection and face a choice of which way to go.", "action_results": [{"action": "Take the Left Tunnel", "result": "You head down the left tunnel hoping that you can find an easy way out of the city. On your way you encounter masses of garbage, some  piled twenty feet high. You worry about the roaches and rats that scurry with increasing frequency around you. The already horrid stench somehow worsens and becomes almost unbearable as flies swarm over every inch of this place. You see several bodies in various stages of decomposition, most are animals, some are human.\n\n\nYou are bitten by a large horsefly and swat it away painfully.\n\n\nYou see nothing but garbage and sewage ahead and are unsure that you are willing to continue any further, however you figure if you don't want to go down here, no one else might want to either. It's probably abandoned by soldiers and all but the most desperate refugees.\n\n\nDo you:\n\n\n ", "action_results": [{"action": "Continue into the Trashlands", "result": "You delve deeper into the Trashlands, the piles of garbage are disgusting and you try to avoid climbing through as much as you can, however, you cut your hand on a broken bottle, get bitten repeatedly by vicious biting flies, and slide down a hill of slippery rotten fruit and cash into a broken wooden crate banging up your ankle.\n\n\nDespite this, you encounter no solders or any other form of humanoid life for the next fifteen minutes. The animals, on the other hand are awful and ever present. Roaches as big as your fist, horseflies that are as big as coins and horribly aggressive and vicious, fruit flies that buzz in an ever present haze, rats the size of cats, several small snakes, maggots galore, and even several rabid wild dogs.\n\n\nFinally, after an hour you are rounding a massive trash heap and you see a massive rat the size of a warthog. It snuffles in the garbage and surrounding it are five other rats the size of cats as well as dozens of junkyard rats at least a foot long.\n\n\nYou try to avoid them and move on without incident.\n\n\npick a color:\n\n\n ", "action_results": [{"action": "Red", "result": "You try to avoid the rat swarm but they spot you after you accidentally kick a can hidden in the muck. Drawing your throwing knives you pick off three cat sized rats before they close on you. You back up and throw two more knives as the swarm reaches you. The knives pierce the other cat-sized rats and they lie quivering in the morass as you take repeated bites by the junkyard rats.\n\n\nYou'd like to try to swat them off but you are attacked by the Warthog sized Rat and have to pull your short blades. You dodge a charge by the rat and plunge your sword in it's back as three other rats take chunks of your ankles. You back slice one out of the air cutting it in half. The other sword blocks a bite from the King Rat and you reverse the sword to cut a slice it's mouth.\n\n\nYou are now being bitten by dozens of rats and you are near the point of panicking so you dive and roll across some broken stones. It hurts like hell but most of the rats scatter and you roll to your feet having crushed three during the tumble.\n\n\nYou circle for position and the king rat charges again nearly biting your hand but you pull it away at the last second and stab the beast through it's neck. The beast squeals loudly and you jerk the blade and pull it up trying to sever everything in it's throat. Despite the gory wound, it twists and rips the blade out of your blood-slicked hand.\n\n\nIt retreats several feet with blood forming rivers on it's matted fur. The lesser rats are swarming towards you so you pull two more knives and toss them striking one in the brain and skewering it like a pig on a spit. You then turn and run up a mound of trash and kick rubbish down upon them. Most of the rats dodge but one is hit by a falling brick.\n\n\nYou have now become crazily desperate and you throw your lantern into the pile of trash which lights up the tunnel as the gas accumulated in the sewers explodes violently. All the rats squeal as the flames engulf them and spreads into the tunnel. Unfortunately, you also are severely burned by the explosion.\n\n\nAs the flames wipe out  everything in the tunnels, you hear explosions and see manhole covers explode in the distance popping them out into the streets. Only luck keeps you from being incinerated. Even so, you are knocked several dozen feet backwards and land in a pile of old dresses.\n\n\nYou wake up hours later in severe pain, barely able to stand and look around you. The lantern you used is gone but piles of trash still burn brightly enough that you can make your way staggering forward and out of Trashland. Finally you climb up the ladder to the surface and venture out into the streets.\n\n\nYou are a horror, covered with shit and garbage, slathered with blood and oozing sores, your hair burned to the roots and still smoking, and your gear and clothing burned to the quick, still you live and that  has to count for something...", "action_results": [null]}, {"action": "Black", "result": "You try to avoid the rat swarm but they spot you after you accidentally kick a can hidden in the muck. Drawing your throwing knives you pick off three cat sized rats before they close on you. You back up and throw two more knives as the swarm reaches you. The knives pierce the other cat-sized rats and they lie quivering in the morass as you take repeated bites by the junkyard rats.\n\n\n \n\nYou'd like to try to swat them off but you are attacked by the Warthog sized Rat and have to pull your short blades. You dodge a charge by the rat and plunge your sword in it's back as three other rats take chunks of your ankles. You back slice one out of the air cutting it in half. The other sword blocks a bite from the King Rat and you reverse the sword to cut a slice it's mouth.\n\n\n \n\nYou are now being bitten by dozens of rats and you are near the point of panicking so you dive and roll across some broken stones. It hurts like hell but most of the rats scatter and you roll to your feet having crushed three during the tumble.\n\n\n \n\nYou circle for position and the king rat charges again nearly biting your hand but you pull it away at the last second and stab the beast through it's neck. The beast squeals loudly and you jerk the blade and pull it up trying to sever everything in it's throat. Despite the gory wound, it twists and rips the blade out of your blood-slicked hand.\n\n\n \n\nIt retreats several feet with blood forming rivers on it's matted fur. The lesser rats are swarming towards you so you pull two more knives and toss them striking one in the brain and skewering it like a pig on a spit. You then turn and run up a mound of trash and kick rubbish down upon them. Most of the rats dodge but one is hit by a falling brick.\n\n\n \n\nAll of a sudden you ear a growl from behind you and you turn to see a rat the size of a horse. you barely have time to curse before the rat descends upon you and with one bite saws you in half.\n\n\n \n\nYOU HAVE FAILED!!!", "action_results": [null]}, {"action": "Blue", "result": "You are sure that you will be discovered but you hide anyway. \"Hell, I smell and look like garbage anyways, might as well settle in and ride this out.\" you think and squeeze into a pile of rotted melons. The goo of the nasty fruit slops on your pretty face but you hold your breath and count to one thousand.\n\n\nAfter this time has passed, you take a peek around the corner and see that the rats seem to have moved on. You creep forward and seem to be making great progress until you bump into a massive rat the size of a horse. The Emperor Rat rushes you and you jump to the side just in time to duck the onrushing rat.\n\n\nYou collect  yourself and roll up with your Broadsword as it turns towards you with malice in it;s red eyes. You taunt it and wave it forwards and it obliges rushing you as you dive to the right bringing up your broadsword and giving the beast a nasty slice down it's ribcage.\n\n\nIt doesn't stop there as it turns and tries to bite but you block it's bite with your sword which is torn from your grasp. Nevertheless, you pull your twin short swords. and meet snapping jaws that slaver with frothy saliva. It's massive eyes are red in the darkness and lantern light, it's teeth are  like yellow stakes thrown in randomly in rolling black gums. You stab to the left and it tries to snap off your rest, this is when you slick with your right cutting into it's skull but the blade doesn't penetrate the bone.\n\n\nYou circle for position and back away noticing a crowd of beady red eyes watching the fight intently. You nearly slip and get bitten by a snap from the massive jaws, and you thrust your blade into it's mouth cutting deep into it's gums before quickly withdrawing and pacing back several feet. It charges and you roll through rotten vegetables into an upright stance thrusting deeply into the rat's flank and slicing it's ten foot long tail with your other sword. It whips around and headbutts you knocking you off your feet but you roll backwards and land in a crouch. Just as sudden, it is upon you bowling you over and scampering over your body like being hit by a bison, however aside from superficial scratches you emerge unharmed and slice it's leg as it hurtlles past you and begins to turn.\n\n\nThis is when you run and jump on it's back and plunge both blades deep into it's back. The rat bucks like a bronco and you are tossed and banged around but you still hold the blades and your weight creates ghastly tears in it's flesh. Finally, you are flung into a pile of crates and smash through them.  You stagger to your feet and see the bloodied rat trying frantically to dislodge the twin swords you have planted deep into it's upper shoulders.\n\n\nTaking out throwing knives, you fling one after the other in rapid succession, ten in all, two bounce free, one sticks in it's ribs, two in it's face, two in it's ribs, one in it's rear legs, one slices the tail and lands hilt deep in a watermelon, and the last sticks into it's belly. Pulling your knives you rush to press the initiative whirling the silver blades into the Emperor Rat's body, stabbing, thrusting, and slashing the massive beast like a wild painter splashing paint across a canvas. Blood flies and the rat whirls and struggles under your mad assault. Finally, it limps, stumbles, and crashes to the floor.\n\n\nPicking up your Broadsword, you level the blade against the dying beast's neck and with a heavy downward slive, sever the vertebrae and decapitate the beast. It's head rolls free and you see the intelligence of the creature dim as it's lifeblood spurts free from his neck in weakening pulses.\n\n\nYou lean against the body to catch your breath and listen to the chittering of the multitudes of rats hiding in the darkness. Then, you lean forward and begin pulling the blades that turned the rat into a porcupine. Finally, you have collected your weapons and walk forward into the tunnels. The rats create space for you and none approaches as you move past them. After you have made it perhaps twenty feet from the body, the rats swarm their former leader and the Emperor Rat disappears under a carpet of writhing bodies.\n\n\nPerhaps fifteen minutes later you find a ladder to the surface and climb it.\n\n\nNight has descended across the city and even with all of the chaos and danger you face, you've never taken a sweeter breath of air.", "action_results": [null]}, {"action": "Green", "result": "You are worried about the creatures in the tunnel but are still caught by surprise when a burst of writhing tentacles from some unseen monster slithers into the air. Each tentacle is riddled with barbed suckers that slurp hungrily even as slime drips from the sucking mouths. You watch as a rat is picked up by a randomly flailing tentacle and is devoured in seconds as the tentacle wraps around the body, coats it with slime, and breaks it's bone. Soon the rat vanishes in the writing mass.\n\n\nYou've encountered a Wyrux, a tentacled monster with up to fifty tentacles that is renown for it's deadly paralytic slime, bruising strength, and voracious and unending appetite. You quickly cut a nearing pseudopod, duck under a sweeping large tentacle, and jump over a third. Pulling your short swords you hack at an offending limb, cut through another that is grappling a corpse of a dog, and roll to avoid another.\n\n\nRunning at full speed, your aim isn't to defeat the creature, it's to escape without being caught. Such a fate would equal a grim death and you don't want to die in the belly of a landsquid.\n\n\nYou duck a tentacle that is as wide as a tree trunk and lie flat when a smaller faster one reaches for your head. Rolling down a trash heap you land at the bottom and burst towards the exit of the tunnel.\n\n\nDucking an overhead slam, you roll and dive through a grate and kick the lever. The grate smashes down on several tentacles and you regain your feet and burst into a sprint down the sewer. Finally, you see a ladder up to the manholes that are on the street level. Bursting free, you exit into a maze of alleyways, and making sure no one sees you, replace the manhole cover and move onwards into the city. ", "action_results": [{"action": "Use the Back Alleys", "result": "You begin sneaking through the back alleys and slipping from shadow to shadow. This is your element and with the aid of the city's confusion and the dark places, you easily slip by several squads of Turric soldiers. You see some of the street thugs still trying to make their plays but for the most part, your heavily armed figure makes everyone back away.\n\n\nYou at one point run into a gang of looters grabbing anything they can find and throwing rocks at the Turric soldiers that approach. In the badlands of Essitrea, the city hasn't yet been conquered and fighting continues street to street. You have to duck some firebombs and skirt through the rear of a full out melee between club wielding ruffians and a small group of soldiers.\n\n\nFinally you make it through the thicket and you duck into an inn. Looking around you grab a drink and some food and then make your way out a window. You hit another alley and begin running when you see a Deathmagus (Turric Necromancer) and a horde of Turric Vanguards (Heavily armored Undead knights).\n\n\nDucking and dodging from crate to crate you finally slip free of the ghetto and leave the alleys behind. Though you are relieved that you've made it out of the alleys, you see before you a large view of the city at large, smoke billowing from the buildings, mass melees in the streets, and fiery stones flying both to and from the city. Several of the walls are crushed and Turric soldiers pour in like Red ants while Blue Essitrean ants try their best to fend them off. The numbers don't look good and you see blasts of spells being bandied too and fro on the city streets.\n\n\nYou decide to have none of it. You move into a small side street and head for a place where the warfare seems lightest.\n\n\nTo your left you see the remains of an old inn you and your fellow mercenaries drank at days before the assault. You duck in and grab a shot from a whiskey bottle on the shelf and steel yourself then head back into the city.\n\n\n ", "action_results": [{"action": "Keep Moving.", "result": "You decide to keep moving and move from one alley to the next. To your left a Turric soldier punches a man in the stomach while his partner slaps his comely women. The man goes down and tries to struggle as he is kicked. The woman's blouse is ripped by the other soldier and she is slammed against the alley wall. Laughing, the first Turric soldier stabs the man in the shoulder and grabs the woman's breast as her boyfriend struggles to save her honor even while bleeding.\n\n\nDo you:\n\n\n ", "action_results": [{"action": "Intervene and stop the rape?", "result": "Fed up with the senseless violence, especially against the innocent, you rush forward loosing two throwing knives at the soldier who stabbed the man. They smack into his arm and neck and he reels screaming like a stuck pig. Before they can even turn you leap into the air and get to work with your two short blades. You bound and stab the already knifed soldier in his shoulder driving the blade deep within his flesh and driving the blade's point into his beating heart.\n\n\nThe rapist turns and tries to draw his blade but you whirl and cut his hand off at the wrist and then swing low amputating his foot. As he falls to the ground you loom over him casting a long shadow. He cries like a child as you slowly, slowly push the point of your short sword into his groin and lean into the sword. The agony on his face is mixed with the bright arterial blood arcing all over the alleyway. \"Rape steel bitch,\" you whisper to him as you look deep into his eyes with your own silver ones.\n\n\nJust for spite, you finish him off with a crunching twist that causes his limbs to spasm epileptically before he falls motionless.\n\n\nLooking at the pair of victims you growl, \"Get off of the streets and make sure you don't let anyone make you victims again.\" You raise the man up with his good shoulder and then bandage him up as best as you can. These kills were the most satisfying you've had in quite awhile and you continue your escape with a better feeling in your gut. You can't save them all but this felt like a good victory.\n\n\nBefore you can celebrate, you see a full squad of Turric Swordmen and a Deathmagus with two Vanguards. You have only scant time to choose an option: duck back in the sewers, fight the group, or retreat.", "action_results": [null, {"action": "Fight the Group", "result": "Disregarding the odds, you attack the group. You charge from the corner and aim an attack at the Deathmagus, killing him will be the easiest answer. You are upon the mass before they can even react and lop the head of a Swordsman before spinning and cutting the leg off of another swordsman, and thumping a third with the butt of your sword. He falls unconsciously with a broken nose. \n\n\nSwords are coming out as you thrust your broadblade into the last swordsman in the group. However, as you try to bring your sword to bear against the Deathmagus, your chop with the broadsword is caught by the Vanguards protecting him. These armored undead  cross their swords and block the blade and then twist their blades and your broadsword flies out of your grasp and clatters on the streets.\n\n\nYou roll back and throw three throwing knives at the Deathmagus and the Vanguard block two of the blades but the last slips past their guard and strikes the necromancer in the arm. He screams and backs away holding the injured arm while his henchmen advance. You duck a Falchion slash and roll past a downward chop.\n\n\nComing up past their guard, you toss three blades at the Deathmagus and two more strike home, one in his chest and one in his hand as he tries to ward you off. The blade sinks to the hilt. He screams again and tries to retreat as the Vanguard, slower than you are turn and slash at you. You are quicker and pull your twin short swords and  charge him planting your blades deep in his chest!\n\n\nThe necromancer falls and lands in a heap and behind you, the Vanguards halt and freeze then their armor collapses and falls into twin piles on the street. The bodies once inhabiting the armor blow away in the dust.\n\n\nYou cannot believe you just scored such a tremendous victory!\n\n\nYou take a moment to collect yourself and then smiling to yourself you head back into the streets. Night has fallen and you use the encroaching darkness to hide your form.\n\n\n ", "action_results": [null]}, {"action": "Retreat", "result": "You retreat and let the large group pass. You decide that it's probably better to wait until nightfall before continuing, the streets are just to populated. You retreat to a blast crater which has a shelf that can hide you and wait for darkness to fall. Gradually, the night descends and you make your way back into the streets. ", "action_results": [null]}]}, null]}]}]}, {"action": "Yellow", "result": "You are worried about the creatures in the tunnel but are still caught by surprise when a burst of writhing tentacles from some unseen monster slithers into the air. Each tentacle is riddled with barbed suckers that slurp hungrily even as slime drips from the sucking mouths. You watch as a rat is picked up by a randomly flailing tentacle and is devoured in seconds as the tentacle wraps around the body, coats it with slime, and breaks it's bone. Soon the rat vanishes in the writing mass.\n\n\nYou've encountered a Wyrux, a tentacled monster with up to fifty tentacles that is renown for it's deadly paralytic slime, bruising strength, and voracious and unending appetite. You quickly cut a nearing pseudopod, duck under a sweeping large tentacle, and jump over a third. Pulling your short swords you hack at an offending limb, cut through another that is grappling a corpse of a dog, and roll to avoid another.\n\n\nRunning at full speed, your aim isn't to defeat the creature, it's to escape without being caught. Such a fate would equal a grim death and you don't want to die in the belly of a landsquid.\n\n\nYou duck a tentacle that is as wide as a tree trunk and lie flat when a smaller faster one reaches for your head. Rolling down a trash heap you land at the bottom and burst towards the exit of the tunnel. Then, horribly, you feel your ankle get tripped up by a lumbering tentacle that bursts out of the ground. You try to roll to your feet but your foot is covered in slime and you can't feel it any longer. A small, fifteen foot long tentacle wraps around your leg and begins dragging you backwards. You scream and kick and you are lifted into the air and begin to dangle upside down. You watch as several of your knives fall free from your clothing and you scream as the tentacle constrict your legs and you hear them 'pop!'.\n\n\nBlood squirts out of your leg as the bones roll and crack and another tentacle latches onto your arm. You fight feebly with a sword as the other falls twenty feet to the ground. This last hope is erased as yet another tentacle grabs your last free arm and rips it off. Blood geysers as you watch your arm disappear into the Wyrux's hungry maw.\n\n\nYou resign yourself to death as the creature's main body bursts from the ground and you are fed into the creature's mouth...\n\n\nYOU HAVE FAILED!!!", "action_results": [null]}]}, {"action": "Light your lantern and go north.", "result": "You light your lantern and head North. The darkness is cloying and seems to fight the feeble light offered by your lantern. You see shapes and shadows flitting from the corners and scraping up the pipes, crevices, and tunnels you pass. You continue trying to reach the edge of the city and get out alive. The sewers are disgusting and you have to walk around piles of trash, the occasional corpse, and loads of excrement. \n\n\nThe filth only grows as you travel. You have to cross a span of wood only a foot wide and over ten feet long over a crevice that drops into pitch blackness. At one time, you dodge a small mass of rats as they flee from one tunnel to the next. Several minutes later, you see a rabid pack of dogs chewing on the corpses of a family that tried to flee into the tunnels.\n\n\nYou have to climb into the pipes so as to avoid swimming in pools of filth that sludged towards a whirlpool sucking the filth down a broad pipe. Crossing to the other side, you see a skull. Followed by a skeleton of a dog, this was followed by another smaller pile of animal bones, and even more bones following that. You smell the stench of death ahead and you are starting to feel the prickles of your hair rising on the nape of your neck. You know danger is nearby. This is accentuated by the sound of something slurping and cracking what sounds like bones.\n\n\nYou are starting to wonder if heading this way is a good idea, perhaps you should turn around and retreat to the South.\n\n\n ", "action_results": [null, {"action": "Press on!", "result": "Unaffected by fear, you pull your broadsword with one hand and hold the lantern ahead of you and press on. After several dozen feet, you are now walking on a carpet of bones that crackle and shift under your feet. You reach a corner going right and the sounds of feasting are very close.\n\n\nDeciding not to be deterred, you turn the corner and see a massive six-armed humanoid with three snakelike heads and a spiny draconic tail ripping into the half eaten corpse of a human male. The man's upper body and arms remain while the entire lower half is gone. The dead man's eyes are staring forward and the look of anguish at death is frozen upon his face.\n\n\nThe beast turns and sees you and releases a growl that sounds somewhat like a chuckle and a sneer. You back away hoping it doesn't follow but it approaches with heavy footsteps and menace on it's three snake-like heads. You've already got your sword drawn and no longer believe you are going to get away without a fight.\n\n\nYou parry the first attack with your blade and make a downward cut as the heads swarm around you. The blade crashes against bony armor and barely dents the beast. It continues to close in on you as the snake heads each attack in turn, snapping high, low, and at midrange.\n\n\nAnother parry turns into a two-fisted attack with the broadsword and you take off a head before being bitten by a second head which snips your leg. Fangs bury themselves in your leg and you feel a cool liquid pump into your body. You turn, spin, and decapitate the second head even as the third plants it's mouth on your breast. You stumble backwards feeling poison running through you but you're not giving up yet!\n\n\nYou charge at the beast and it;s last snake head dodges and darts around you even as you chop off one of it's six arms. You reverse and spin landing a solid thrust that pierces the body of the beast and it retreats as you stagger.\n\n\nYour leg is oozing pus and blackish blood. You are losing the ability to stand on it but you press forward even though your chest is constricting. You press forward grimly, if you are going to die, you are taking the bastard with you. Now it is the creature playing defense as you stagger towards it. It holds the wound in the chest with one arm with it's snaking head weaving and bobbing.\n\n\nYour broadsword seems so heavy so you drop it and pull your twin short swords. The beast retreats farther into the lair it made for itself. You charge with faltering resolve but cut two of it's arms off and begin to work the body even as the snake head bites your back. You turn and slice the head off and the creature wanders aimlessly spurting green blood like a three-tiered fountain.\n\n\nFinally it collapses and you crawl towards it even as your vision clouds. Rising up, you grab your twin short swords and plunge them into the beast and it quits quivering. You slide down and rest on the body and slowly close your eyes, a grim smile fixed upon your graying face as the last of your life bleeds out.\n\n\nYOU HAVE FAILED!!!", "action_results": [null]}]}, null]}, null]}]}, null, null]}, null]}, {"action": "Catch Your Breath", "result": "As you sit and think, your memories begin flooding back.\n\n\nYou are Sebastian, you left your last name behind long ago.\n\n\nOnce you were a little girl who was young and innocent. This was a long time ago. Now the years have torn any innocence from your body, mind, and soul. You devote yourself to living by the blade and you know one day you will die upon it.\n\n\nYou were once a dancer and your lithe body and natural grace serves you well in combat.\n\n\nYou are an exotic beauty with naturally silver eyes and silvery hair that bounces and flows to your mid-back. Your naturally pale skin is tanned from years on the road and beneath your soft looking skin are muscles hardened by years of warfare. You are well respected in mercenary circles and you often are called 'Silver' by those first meeting you. Your very few close friends call you 'Bast'.\n\n\nYou and half of the other sell-swords in the country of Zanitar were going to flock to Essitrea and ask to be put on as guards for the city walls, this was good work and you had a horse and your own weapons and armor increasing your value to the city watch.\n\n\nYou hoped these advantages would outweigh you being female, as females are often ridiculed when trying to enter the fighting trades, paid less money, and occasionally flat-out passed over for work, no matter your skills with the blade.\n\n\n\n\nYou do have something many other mercenaries lack: You can read, you have a resume signed by respectable tradesmen you'd worked for in the past.\n\n\nYou are truly skilled with the Broad-blade of Lazarius and all manner of knives. You are more than fair with the bow, crossbow, and even more exotic weapons at range including your favorite weapons: exotic metal throwing fans used for range and melee combat. These are your prestige weapons, for the metal fans were rare, flashy and elegant. \n\n\nYou had trained as a dancer for many years in your youth while pursuing a less respectable trade, and you know a variety of martial skills that were disguised as dancing moves, much like the Kajimarans practiced.\n\n\nTo say you are a martial artist is an overstatement, you have little poise and refinement to your arts, you are more of a rough and tumble guttersnipe who has prodigious natural talents and an iron willpower that has made you tough and enduring. You are sturdy of build but remarkably strong, with a grip like steel. Your muscles when tensed are as powerful as a strong man's though you are built a head smaller than the average brute you work with.\n\n\nThis matters not to you, you are not going to out-muscle anyone, it is your athletic graces that make you deadly. Your patchwork training gives you a pastiche of martial moves that are both surprising and random, and your superb athleticism stems from a lifetime of physical training in dancing.\n\n\nMost mercenaries are large plundering half-wits, village strongmen, ex-soldiers, and bandits with a modicum of talent. You are a different breed altogether, and your quick wits often saved you from dangers you encounter that killed others with stronger sword arms.\n\n\nNow you fear you may have made your final mistake: No one anticipated the strength of the Turric Horde, the ruthlessness of it's leaders, or the mercenaries inside Essitrea who had secretly worked for the Turric all along. No one but the Turric envisioned a disaster on this scale.\n\n\nSuddenly, explosions of artillery begin landing around you, it's time to move or die! Do you wish to run from building to building or try your luck in the sewers under the city?", "action_results": [null, null, {"action": "Remember your Enemies", "result": "You think about the enemies you face. They come in several types:\n\n\nTURRIC SWORDSMEN:\n\nThese warriors are the rank and file warrior for the Turric forces. They wear light armor and carry quick barbed scimitars. The scimitar is most effective as a slashing weapon with wide swings. You can usually overcome small numbers of these men as long as you aren't surrounded.\n\n\nTURRIC WARHOUNDS:\n\nThese are powerfully built war dogs used to scout areas and hunt enemies. They often pounce and trip their prey and savage them fiercely while their prey is on the ground. \n\n\nTURRIC CROSSBOWMEN:\n\nTurric Archers and Crossbowmen are lightly armored ranged fighters. They use light crossbows or shart bows and attack from close to mid range. They don't like to get into hand to hand combat where their daggers and short curved swords are at a disadvantage. They are most effective if they have protection from Turric swordsmen.\n\n\nTURRIC SNIPER:\n\nHighly accurate long ranged warriors, they use crossbows to deadly effect usually from behind cover. Though their crossbows are slow to reload they are heavy enough to critically injure any struck by a bolt. They are able to snipe moving targets and any encounter with them should be avoided if at all possible. In close combat they are lightly armored and have to rely on sword curved blades and daggers putting them at a decided disadvantage.\n\n\nTURRIC DEATHMAGUS:\n\nThese are necromancers in the service of Lord Turric, they can raise dead troops up as zombies and are always flanked by two Vanguards, heavily armed undead zombie warriors tied to their life forces. They wear no armor and usually travel with groups of Turric swordsmen and their Vanguards so they have time to cast their deadly spells.\n\n\nTURRIC VANGUARDS:\n\nVanguards are undead warriors who wear heavy banded armor, carry falchions (Massive barbed two-handed scimitars) and provide protection to their Turric Deathmagus master. They can withstand tremendous amounts of physical damage and most light weapons and armors have little to no effect. Killing their master or decapitating them are the best methods of killing them. They are slow and methodical in combat but can occasionally summon up bursts of dark necromantic bolts from their hands which drain life and paralyze the victim.  \n\n\nZOMBIES:\n\nThese are unfortunate people raised by the Deathmagus. They are slow, uncoordinated, and incapable of complex thoughts. However, they must be decapitated or burned to die. Powerful Deathmagi can raise dozens of these disposable warriors at a time and use them against enemies as shocktroops.\n\n\nTURRIC DEATHWARDENS:\n\nTurric Deathwardens are masters of hellhounds. Though medium armored and possessed of barbed scimitars, their real weapons are the two Hellhounds they use as scouts, hunters, and killers.\n\n\nTURRIC HELLHOUNDS:\n\nTurric Hellhounds are large flaming dogs of powerful builds and possessing astute senses. They are dangerous to confront as they often knock over opponents and pounce on them attacking viciously as well as setting victims on fire. Whether or not they are summoned demons, they have a reputation for being very vicious.\n\n\n ", "action_results": [null]}, {"action": "Sebastian's Resume", "result": "NAME: Sebastian\n\n\nAGE: 25\n\nGENDER: Female\n\nOCCUPATION: Mercenary\n\n\nHEIGHT: 5'10\"\n\nWEIGHT: 135 Lbs.\n\nHAIR: Silver\n\nEYES: Silver\n\nNATIONALITY: Zanitarian\n\nHANDEDNESS: Right\n\n\nTRAITS:\n\nDancer's Grace: Sebastian is graceful and is often capable of ducking and dodging attacks. In addition, she is adept at tasks needing sure footing (climbing, balancing, and sneaking) and manual dexterity (picking locks, theft, and throwing).\n\nFluency: Sebastian is able to speak, read, and write Lazarian, Bandglan, and Zanitarian.\n\nBeautiful: Sebastian stands apart from the crowd and is well-known for her beauty.\n\n\nFIGHTING STYLE: Steel Crucifix. Sebastian likes to attack with her heavy broadsword trying to get a kill or two before switching to lighter, faster weapons, usually daggers or her short swords. Often she throws knives in the middle of combat to create space, stop charges, or fend of missile attacks. Due to her light armor, she prefers stealth and trickery to straight up brawling.\n\n\nBroadsword (1): This is a wide heavy sword known for it's sturdiness. It is slow to maneuver but does plenty of damage when attacking both armored and unarmored foes.\n\nShort Swords (2): Her fallback melee weapons, trades damage for speed. She likes to use stabbing attacks to pierce her foes and circular parries to defend against multiple attacks. Effective against light and heavy armor.\n\nDaggers (4): Heavier than throwing knives, these fighting blades are for in close work against foes who fight at speeds faster than her broadsword. Not effective against heavy armor but dangerous when used against lightly armored opponents.\n\nThrowing Knives (10): Sebastian is accurate over short distances with throwing knives usually throwing two or three at one or more opponents. The more opponents she faces the less accurate she is. She carries ten hidden around her body. Ineffective against medium or heavy armor.\n\nWarfans (2): Her exotic weapons, she uses metal war fans to deflect attacks, make trick throws (Curving throws, ricochets, and slicing). In addition, she can make gashing cuts against lightly armored opponents that are difficult to heal. She usually uses them if she is smuggling weaponry into places where none are allowed or when she is using her dance skills professionally.\n\n\nOPTIONAL:\n\nCrossbow: Though she doesn't usually carry a crossbow, she is quite deadly as a sniper.\n\n\nARMOR:\n\nChain Shirt: Sebastian wears padded chainmail made to be light weight and fit under her clothes. She sacrifices protection for mobility, stealth, and unobtrusiveness.\n\n\nNOTES: Sebastian fights best when she has room for mobility, launches the initial attack, and faces opponents at a short distance.", "action_results": [null]}]}]}]}, {"action": "Move on", "result": "You decide to pass them by, there has to be another way through the city without the aid of the Essitreans and the inevitable conflict they will attract. You head down a corridor and see flames rising ahead, to the left you see a massive army of Turric soldiers fighting with another smaller group of Essitreans. The carnage is horrid and you opt not to go that way. To your right you see an old stable. Perhaps within you can find a horse.\n\n\n ", "action_results": [{"action": "Head towards the Fire", "result": "The flames ahead of you fly many feet into the air and you try to find a way past the street but there are no obvious exits. Disheartened you retreat back to the previous intersection.", "action_results": [null]}, {"action": "Check out the Stable", "result": "You opt to check out the stable but there are no horses inside. As you are searching, you see the fighting from the left street starting to pour into yours. The mass combat is punctuated by explosions, the sound of steel on steel or flesh, and the screams of the injured or dying. You quickly decide to abandon the search and head back to the intersection before you are overwhelmed.\n\n\n ", "action_results": [null]}, {"action": "Go Backwards", "result": "You arrive at the massive barricade. The barricade is manned by a holdout group of Essitrean soldiers each holding crossbows. There have to be dozens of them all on watch. The bodies of hundreds of Turric soldiers lie scattered in the streets around the barricade though it's obvious the Essitreans are wounded and exhausted.\n\n\n ", "action_results": [null, null]}]}]}]}, null]}]}, {"action": "2", "result": "You fall into a deep and dreamless sleep. As luck would have it, you are not bothered by anything or anyone during your stay and you feel quite at peace with yourself. Your mother always said you were a strong one before she died. She never knew how many times you would have to test that theory. You wake up refreshed and ready to go.\n\n\nIt is now NIGHT.", "action_results": [null]}, {"action": "3", "result": "Your sleep is suddenly interrupted by the sound of the door being kicked in by heavy booted feet. In the entrance are five undead warriors, two heavily armored Turric Vanguards and a Turric Deathmagus, a necromancer by any other name. You rise to your feet pulling your broadsword and charging. Deathmagus takes no prisoners. This is going to be a fight to the death.\n\n\nYou swing a heavy blow and decapitate the lead zombie as the others charge forward. You've fought the occasional zombie in the past and you know from experience that you have to decapitate them to bring them down. As the first zombie falls, you face a thicket of swinging blades, what zombies lack in speed and accuracy, they make up in fearlessness and tenacity.\n\n\nYou need to fight without getting cornered or overwhelmed. You duck to the left and then run to the right, making the zombies slowly try to follow you. You pick a zombie at the edge and cut at his knees while parrying two blades aimed at your midsection. The zombies legs are undercut and you duck and blade and stab upwards into a zombie's gut. They keep onrushing but you roll to the side of a blow and parry a second before leaping on a table.\n\n\nA downward chop takes another zombie downward and you backflip off the table landing on your feet. Taking a mirror, you toss it into the face of a nearing zombie and slip to the left before arcing right and using your sword to decapitate the next.\n\n\nSeveral seconds later, you pant as the last zombie falls.\n\n\nThe Deathmagus claps his bony pale hands slowly, \"Very good little Silver one, you are most impressive. I've decided to give you one last challenge, if you can over come it I'll let you live.\" He turns to one of the fully armored vanguards and points at you. The Vanguard silently obeys stepping forward with his barbed Falchion at the ready.\n\n\nThe other Vanguard stands by his master and together they watch the duel. You know from experience that Vanguards are heavily armored juggernauts with undead endurance and massive two handed falchions with rasping barbs attached.\n\n\nDo you:\n\n\n ", "action_results": [{"action": "Use your Broadsword and Short Swords to inflict heavy damage?", "result": "The Vanguard was a heavy warrior with a massive slow sword so you decide to try your luck with your heavy sword relying on your natural quickness to keep one step ahead of him. As he nears you you double-hand the broadsword and smash it as hard as you can against his side. The blade bangs loudly against him and you see a dent appear in the armor but he moves as if it were a feather duster. He swipes at your head but you duck and spin away.\n\n\nYou finish the spin with a heavy blow to his knee and you see with some satisfaction as the armor dents in and his knee buckles. The Vanguard barely even registers the blow and chops at you with an overhand blow that meets the stone floor and shatters it. You roll backwards and throw two blades that ricochet off the armor and stick in the ceiling. \n\n\nHe keeps moving forward unperturbed by the blades and you charge towards him willing him to commit for a swing. When he does, you leap to the side and again bash his knee. The metal dents a little more and his knee visibly weakens. You roll away and place your broadsword between yourself and his blade.\n\n\nHis hand glows black and he begins to drag you towards him with some form of dark magic. You put your sword in front of you and duck another slash as you use his magic to impale himself with your sword. He staggers backwards and you block a sideways slash meant for your wait with your broadsword. The power knocks it flying across the room lodging into the wall.\n\n\nYou kick off of the Vanguard and run backwards as the knight continually steps forward thinking to yourself, \"That was cheating...\"\n\n\nPulling your twin short swords, you leap and twist so your blades smack deep into his shoulders. The Vanguard staggers and steps back and you tumble off of his body and duck to the left. You hear his stomps as you run for your broadblade. You reach it and pull it out of the wall just as the Vanguard reaches you. You have to release the sword in order to keep your arm.\n\n\nAfter his miss, you again grab the blade and rush around him to his backside raining your broadblade high into the air and stabbing it downward into his wounded knee. Your blade bites deep into the knee and sinks into the stone floor pinning him. Pulling your swords from his shoulders, you jump into his back making him fall forward and then roll over him pulling your twin blades with you. You then watch as he starts to pull himself up. This is when you strike with both blades at his neck repeatedly, the sparks of your work lighting up the room as your steel pounds against the Ulum metal of the Turric Mages. Finally, the metal gives way and you plant both swords into his neck and pull outward.\n\n\nThe metal shell and flesh peels outwards and you take your dagger and plant it deep into his spine wrenching it back and forth until the warrior drops coldly into the dust.\n\n\nBacking away you watch as his body, armor, flesh, and weapon melt and turn to dust.\n\n\nBreathing heavily, you turn towards the door where the Deathmagus nods his approval and turns to the exit. A second later, the place is quiet and empty. Despite yourself you fall into a deep, deep sleep...", "action_results": [null]}, {"action": "Stay at range and use throwing blades and daggers.", "result": "You begin the duel with two throwing knives as you try to stay at range. The blades hit square but ricochet off the heavy armor. You growl as you duck under his heavy blade and cartwheel out of his range. Having more space, you throw two more knives, one bounces off and sticks in the ceiling and the other lodges under his armor. The Vanguard pulls the blade out and throws it to the ground and you pull a dagger with two more knives.\n\n\nSince the Vanguard seems to be taking his time, steadily moving forward, you carefully aim the next two throws. The first slides into an eyehole of the armor and for the first time you get his attention. The blade spews brackish blood that leaks from under his helm and dribbles down his chin.  He pulls the blade from his eye and grasps the Falchion with both hands, the old leather crackles under his grip.\n\n\n\"Great...\" you think as you dodge a powerful but slow swipe that smashes the cabinet you ducked behind. You pull back and throw the second blade trying to lodge it through his plates under his arm. It connects with the armor and bangs off into the floor.\n\n\nPulling your daggers you duck under a sweeping cross-swipe and punch the dagger into his breastplate. The dagger rings in your hand without doing any apparent damage. He kicks but misses as you flit to the side and stab him in the neck. The blade slides into his neck but it doesn't slow him even a bit.\n\n\nHe backhands you and you barely escape a full on hit but feel your jaw instantly bruise and you see stars as you fall backwards into the debris around you. He is upon you instantly but you dodge his reversed blade and watch the heavy blade pierce the stone itself. You roll to your feet and try to kick out his feet but your leg meets with an unmovable object and you back away limping.\n\n\nHe closes in on you as you switch to your throwing knives which clink off his armor. You can't believe it when he raises his hand and you feel dark energy course through you.\n\n\n\"That wasn't fair...\" is the last thought you think as he plants his falchion deep into your stomach and rips downward splitting your body from stomach to crotch. The last thing you see is his dead eye peering at you as you bleed out.\n\n\nYOU HAVE FAILED.", "action_results": [null]}]}]}, null]}, null, null]}, {"action": "Help the girl out of the hiding place?", "result": "You dislike the thought of dragging around a non-combatant but you could at least take care of her until she can be handed off to someone else. By herself she'd either starve to death or get caught and become a victim to the Turrics. With you she had a slim chance to live, it wasn't much but it was something.\n\n\nYou dislike the thought of dragging around a non-combatant but you could at least take care of her until she can be handed off to someone else. By herself she'd either starve to death or get caught and become a victim to the Turrics. With you she had a slim chance to live, it wasn't much but it was something.\n\n\nGoing downstairs, you say 'Defender' as you pull back the tapestry but there is no answer. You say 'Defender' again but there is still no response. Dreading what you'll find, you open the little door to find the girl, her body lifeless with your dagger stuck in her chest. You curse her weakness even as the pragmatic side of you tells you your own survival rate just increased.\n\n\nAt least she'll be with her family you suppose. With a heavy heart you retrieve your knife and close the trapdoor.", "action_results": [null, {"action": "Search the Second Floor", "result": "You know that the building is three stories so you look around the small apartment for the way to the top floor. Above you, you find a trapdoor to the floor above. You stand on the desk and reach to pull the painted ring dangling from the trapdoor. Once you've grabbed the ring you pull it down and the door swings open. A folding ladder is attached to the door panel and you unfold it. Showing through the doorway is the burning sky.", "action_results": [{"action": "Go to the Attic?", "result": "Putting a dagger into your mouth and carrying a short sword in your right hand, you ascend the ladder. As you climb to the top you realize that the top of the building and whatever was in it was struck pretty hard by the flaming boulders used by the enemies catapults. The fire has burned to cinders and only the stone construction of the main building prevented the house from burning to the ground earlier. As a living space it is a total loss. As a hiding place, it's pretty darned perfect. Anyone who tried to climb into the attic would be a sitting duck on the ladder, would warn those on the ceiling by opening the trapdoor in the first place, and the wrecked timber and rubble provide hiding places on the roof.\n\n\n  From the street, the destruction is highly visible and many would just assume no one who was up on the roof was still alive, in addition, the trapdoor was painted white as well as the walls and the ceiling of the building. Only those looking for the trapdoor would find it. The downside is that you'd be highly susceptible to artillery fire.\n\n\nDeciding this is the place to stay at least until nightfall, you try to decide if you want to retrieve the girl.\n\n\n ", "action_results": [null, {"action": "Get some Shut-eye", "result": "Pick either 1 or 2", "action_results": [null, null]}]}, null]}]}, null, null]}, {"action": "Kill the men, then the dog.", "result": "You decide that men with swords beat out a hound so you ready your ambush by hiding behind a desk and wait for them to rush in. They do as you predict and you pop up from behind the desk and toss three throwing knives, two at the leader, one at the man following him. The first bounces off the lead man's armor. The second catches him in the neck and he goes down grasping at his throat. The third narrowly misses the following soldier by inches.\n\n\nYou draw your short swords which are a good matchup against the wide swinging barbed scimitars the Turric use, at least in confined spaces. Then you leap over the desk ready to take the second soldier out.\n\n\nHe charges as you rush to meet him. His swing is wild and you parry it ducking into a tumble and swing low cutting his foot off at the ankle. As you roll into a crouch you are hit from the side by the wardog which barrels into you knocking you off balance. It bites for your throat but you sacrifice your arm instead losing your left hand sword in the process. The short sword rings off of the wooden floor and skitters several feet away as you use your other sword to stab the dog in the ribs.\n\n\nEven as you stab the dog and it yelps, the other soldier levels a boot at your head and kicks you so hard you see sparkles and blackness for a second. The dog rends a massive rip in your bracer and blood spurts from the open wound into it's mouth. You stab it again and it collapses.\n\n\nThe second warrior raises his Barbed Scimitar as you struggle to get the dog's dead weight off of your own body. You scream as the blade comes down cutting deep into your skull. Death is instantaneous.\n\n\nYOU HAVE FAILED!!!", "action_results": [null]}]}, null]}, null]}, {"action": "Kill Em All!", "result": "You whirl quickly around pulling three throwing knives and letting them free at the charging warriors. Two of the three blades 'thunk!' into the Turric Swordsmen. One plunks deep in a man's chest and he staggers sideways before falling. The other knife slams into a warrior's arm causing him to howl in pain.\n\n\nWith four of the men left from the initial assault, you realize you are in a bind. You level your sword at the two melee warriors and try to stay out of the sight of the two crossbowmen.\n\n\nA bolt 'thrums' by your ear. Another 'thuds' into a pillar to your left. You circle for position as one warrior heads towards your left side and the injured warrior with a knife sticking out of his arm circles to your right. The crossbowmen are reloading and another attack is imminent.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Feint Right and Attack the Warrior to the left.", "result": "Quickly, you move right and fake the warrior to your weak side, then cross the blade over and thrust it deep into the warrior on your left. The sword punctures the armor of the warrior and slides thickly into his belly where you feel the steel edge nestle in his spinal column and break through his back. The man instantly collapses like a stack of bricks taking your sword with it.\n\n\nRolling with the momentum, you duck under the whistling blade of the other warrior and tumble through bolts fired by the crossbowmen several meters distant. Before you even roll fully out of your crouch you pull two daggers and let them fly into the swordsman giving chase. One bashes into his face piercing his skull and the other strikes his leg. He falls lifeless like a bull shot in mid charge.\n\n\nThe crossbowmen, once trying to pick shots are now hurriedly trying to reload. you turn to them and pull short swords and charge them. They fumble their crossbows as you near them. Two vicious strikes later and you stand triumphant over five Turric corpses.\n\n\nCatching your breath, you grab your weapons and check the bodies for loot. Seeing that your masters aren't probably going to be keeping you on the payroll, you may as well scrounge a little coin to prevent this from being a total loss. Three bags full of silver coins jingle in your hand and you put them in your pockets and turn to go.\n\n\nYou can either try to keep moving by skipping from building to building or you can choose to head into the dark alleyways across the street that heads to the ghettoes of Essitrea.", "action_results": [null, null]}, {"action": "Throw more daggers at the crossbowmen.", "result": "You are surrounded both by swordsmen and crossbowmen. Sensing that you might be plucked off from range you duck under the slash of the warrior to your left and pull your throwing blades. Two blades fly free and both strike the crossbowmen, the man on the left is hit in the chest and the one on the right feels a blade hit his shoulder.\n\n\nEven as they fall, you bring your broadblade up to parry the attacks from the man on the right. The barbed scimitar collides with the flat of your blade and sparks glide from the conflicting metals. Then you feel a sharp pain from behind as you see the point of a scimitar pierce through your chest. You feel as if your whole body is being electrocuted and you watch with hazing vision as your sword falls limply from your grasp.\n\n\nThe blade twists inside you and your knees give out and you fall to your knees. The left side swordsman measures you up and swings his blade. The sensation of your head rolling on the ground is eerie as you watch your body fall. Then, slowly, the world turns black.\n\n\nYOU HAVE FAILED!!!", "action_results": [null]}, {"action": "Feint Left and Attack the Warrior to your right.", "result": "You quickly feint left and then pull your heavy blade to the right with a vicious backhand arc that decapitates your opponent. The right-side swordsman's body twists in a ghoulish pirouette before stepping once to the left and falling. His head lies some ten feet into the distance.\n\n\nYou have however left your side exposed and you feel the results of a brutish slice into your side. You scream in agony and frustration before reversing your sword and thrusting it backwards. This catches the left-side swordsman directly in his stomach and you thrust it through his body before giving the blade a nasty twist.\n\n\nYou feel the warrior slide off of the steel and grunt in satisfaction. However, this is cut short by a bolt which smashes into your shoulder. You scream and reflexively draw a dagger which you hurtle across the field into the throat of the crossbowman who just shot you. However, his ally has been taking careful aim and looses another bolt which slams into your stomach.\n\n\nBlood courses down your armor as you collapse to the ground, your feet no longer able to carry you. You grip your sword and try to rise as the men reload speaking their guttural language. They walk cautiously up to you as you grip a dagger secretly and act just a little bit more wounded than you are.\n\n\nThe first man approaches and pulls a knife, \"You've got pretty skin bitch,\" he growls and grabs your face, pulling your chin up to his. \"Too bad I've gotta cut you up, you might have been a good ride.\"\n\n\nGrowling, you plunge your dagger into his crotch and twist. He screams, gripping his groin and falls to the side rolling in pain. The other crossbowman steps back in suprise then his look hardens, \"You've got teeth, Siak was always a fool. I'm not.\"\n\n\nRaising his crossbow he levels it at your head and pulls the trigger.\n\n\nThe bolt jolts your head back as you fall lifeless into the street surrounded by a pile of corpses.\n\n\nYOU HAVE FAILED!!!", "action_results": [null]}, {"action": "Surrender.", "result": "Surrounded by the warriors and realizing that you will probably not survive this fight, you drop your sword and raise your hands. The warriors grin and, under the careful watch of the crossbowmen, the swordsmen circle, one to the front and one behind. Suddenly, your hair is gripped and you are pulled to your knees.\n\n\nA knife is applied to your neck and the men begin to grin. \"Take her weapons Siak, the kitten still has claws.\"\n\n\nYou feel your body being searched, the knives being stripped and tossed, your belts being removed, and then the men fall on you. You scream and try to fight them but there are just too many of them. You finally burst into tears as you realize your impending fate. Two hold you arms as the others pry your legs open and the others pull off your pants. You scream for help knowing none will be coming.\n\n\nBefore they kill you, you hear Siak say, \"I wish all our girls were this easy...\"\n\n\nYOU HAVE FAILED!!!", "action_results": [null]}]}]}, {"action": "Pull the Dagger and go for the Kill!", "result": "Parrying his first attack, you slip a dagger from your belt and plunge it deep into his neck. The man stops and falls backwards, his body shivering and eyes glazing as he tries to pull the treacherous weapon free. His struggles soon cease and he lies in a glistening pool of his own blood.\n\n\nDo you:\n\n\n ", "action_results": [{"action": "Scram before anyone else sees you?", "result": "Deciding that it is smarter to pick your battles rather than have them pick you, you decide to leave the corpse alone and head for the nearest cover. Sure enough several men, three swordsmen and two crossbowmen curiously round a corner of a destroyed building and begin to investigate the area.\n\n\nYou are skilled but you'd rather not risk being put to the test against such ruthless men. You shiver when you consider what they do to women they take captive. Crouching, you duck out of sight and move quietly out of their range. A few tense moments later you are in a less damaged part of the city. You look around and you see two likely routes of escape, the sewers and the twisting alleyways that run through the slums.\n\n\nGoing through the main thoroughfares would be suicide so you decide to risk them. Normally both the alleys and the sewers are dangerous because of brigands, disease, and wild animals but for now, they might make for safe havens in the otherwise fallen city.\n\n\nWhich do you choose?\n\n\n ", "action_results": [null, null]}, {"action": "Search the Body.", "result": "You check the body of the fallen soldier and find a map. The map shows the city as it once was before the attack. You look around and try to get your bearings and spy a tower that is currently in flames. Orienting yourself, you see that the enemy has well marked battle plans and you can see troop movements marked in red as well as defending troop locations marked in blue. Perhaps you can make it to a defensive point where other troops might be, or you might just want to try to use back alleys to avoid all troops altogether. You could also ignore the map and head for the sewers.\n\n\nMAP: Essitrea Battle Plans", "action_results": [{"action": "Head for a Defensive Point", "result": "You move quickly and silently through the alleys, side streets, and main streets of the falling city. Several times you have to draw swords and fight enemy troops, run away from other Turric groups, or even loose undead creatures wandering the city, however, you find a place to hole up before you make the final push towards safety. You decide to wait until nightfall before moving onwards.", "action_results": [null]}, null, null]}]}]}, {"action": "Run for the Next Building?", "result": "You run for the next building, everything looks safe. No one passes by and the streets are filled with corpses. Perhaps the vanguard has passed by. Taking a breath, you peek out and sense no one.\n\n\nSlowly you rise and take some tentative steps towards the next building. Though you cross a twenty foot expanse, you safely make it to the next stop. Peeking around the corner, you see a pitiable sight, a small blonde boy is crying over the corpses of his parents in the rubble strewn debris that was once his building. The piercing scream of an incoming flaming boulder smashes into the cobblestones vaporizing everything in your vision and knocking you back.\n\n\nAs you rise, you hear yet another burst far to the rear.\n\n\nAfter regaining your feet, you start after where the boy was. There is nothing left but a smoking crater surrounded by a ring of flames. Despite your normal stoic nature, tears threaten to slide down your cheek. Gripping your blade, you force yourself to trudge onwards.\n\n\nThree streets upward, you notice a firefight going on. Three Essitrean troops are hunkered behind a wall. Each has a crossbow and a fourth soldier lies dead with a bolt sticking out of his neck. You run in a crouch towards their position and fall to a knee beside the sergeant, \"What's the situation Sergeant?\" You ask.\n\n\nHe turns and almost goes for his sword as he doesn't recognize you but he says, \"Mercenary?\"\n\n\nYou nod and he grunts, \"Figured you all had fled by now, hell if this wasn't my home I'd have fled long ago. Suppose I'll be dying within these old walls soon enough.\"\n\n\nA crossbow bolt smacking against the wall brings him back to the fight. \"Well, we're trying to reach a defensive position North of here but the bloody Turrics got us cut off. Out of a platoon sized element, only we remain and we're cut off from Main Group. If you can fire a crossbow, your help would be welcome. Hell, even if you can't you can at least take potshots at the bastards.\"\n\n\nYou nod taking up the Arbalest, a crossbow you are very skilled with and load the bolt. \"Where are they located?\" You ask.\n\n\nHe darws a quick picture in the dirt with a bolt and says, \"We're here, their behind that berm over there. I'm pretty sure there's a sniper a little to the west. Bad thing is, though we can't see him, he can sure as hell see us and he's a crack shot. Took out Ivey with one clean shot, got Spiner just over there.\" He points to a Essitrean corpse about fifteen feet away, a bolt planted in his back.\n\n\nThose idiots behind the berm are lousy but they've got us pinned with suppressive fire, can't raise my head without fear of taking bolts, the sniper though, he's the real challenge. We take him out and we can flank. Without him dead, we're stuck in a stalemate.\"\n\n\nAdd ARBALEST (Crossbow) to your Inventory.\n\n\nYou think over the options:\n\n\n ", "action_results": [{"action": "\"Cover me, I'll take the Sniper.\"", "result": "You agree to stay but you have to figure out where the sniper is before you can take him out. \"Hey Soldier, let me borrow that shield for a second.\" You grab his small metal shield and quickly raise it above the small wall you are all hunkered behind. Sure enough, the distraction brings a small hail of bolts from your front where the Turric Soldiers are entrenched, but they miss. However, from your right side a bolt slams the shield knocking it out of your hands and sends it rolling about ten feet to your left before the shield flops over.\n\n\n\"Okay soldiers, I know where the sniper is. I'm going to be heading to that little brick wall by the rubble pile, when I say go, I want you to fire your crossbows at the Turric Bastards until I'm set.\"\n\n\nThe men nod, they lock and load their crossbows and scrunch up preparing to fire.\n\n\nYou count to three and then begin a full-out sprint towards the brick wall in a low crouch. Meanwhile the Essitreans fire all they have at the Turric soldiers who keep their heads don until the flurry is over. They then return fire on the Essitreans and you wheel to the right towards the wall. You realize that the next five feet will be critical.\n\n\nTest your luck:\n\n\n \n\n ", "action_results": [{"action": "If your name starts with B, E, F, J, P, or Y...", "result": "You duck, dodge, and sprint and are scant seconds to making a dive for home when you take a bolt directly in the ribs. Crashing Uncontrollably into the bricks you injure yourself pretty badly but you skitter up behind the wall and lean against it.\n\n\nYou now have a 2 ENDURANCE (out of 3) if your ENDURANCE lowers to 0 you are Dead.\n\n\nBreathing with difficulty, you crouch and load your crossbow, you're going to get that Son-of-a-bitch if it's the last thing that  you do. After saying a quick prayer, you turn out from the wall and scan the buildings in the direction of the shot, just as quickly you  turn back in too the safety of the wall. A millisecond later a bolt smashes into the rubble you were just perched on.\n\n\nYou scoot over mentally aiming at the tall tower window on your upper right side. Then you skirt over to the small hole in the wall and aim. Inside you see movement in the wall and you draw a bead. Inhale. Exhale... Fire!\n\n\nThe bolt soars through the air and you hear a slight gasping sound before a man topples out of the window and falls four stories to the cobblestones below. The soldiers cheer and you send them a quick thumbs up.\n\n\nNow to deal with the Turric Soldiers.\n\n\nYou move along the wall to flank the Turric Crossbowmen being careful not to make noise or alert them to your position. Finally, you can go no further and you peek your head out to see where they are and how many. You notice five men, each loading their crossbows. Deciding to make it four, you fire at the most exposed soldier and duck back behind your wall. A scream rewards your efforts and shouts from the Turric soldiers show that they now have a sniper to deal with.\n\n\nYou reload your Arbalest and ready yourself for another shot. Turn, aim, fire, and duck. A scream follows that action and you slide back down the wall to communicate with the sergeant. He is busy instructing his men to take careful aim but you catch his eye and motion for him to send another soldier across to your position.\n\n\nYou slide back to your sniper's post and between you and the soldiers, lay down covering fire as one of the privates rushes to the wall you are hiding behind. You've now got the enemy flanked. He looks at you with the bolt sticking out of your ribs and exhales but you motion for him to move to the corner.\n\n\nHe takes a quick look and  sees a Turric Medic tending for their two wounded men while two men provide fire at the Soldiers you left. You nod and roll over aiming at the Medic and taking him out with a bolt that shatters his skull. The soldier with you runs to the side to another wall to the rear of the beleagured Turric warriors and The sergeant and his soldier keep up firing from the front.\n\n\nSeconds later, you and your soldier pick off the last two Turric Crossbowmen. You wave your hand back and forth indicating a cease fire and you all rise from the rubble strewn battleground. The Sergeant and his men rush to congratulate you, \"I don't know what we'd have done without your timely intervention. I'm Sergeant Reynall and these soldiers are Corvis and Leake. I'm guessing your that merc girl they call 'Silver'. I'd heard you were amazing but obviously the legends do you no justice.\"\n\n\nHe looks at the bolt in your side and cringes, \"Looks like you took one for the team, unfortunately our medic is lying over there with a bolt in him so I'll just bandage it up and keep it as sterile as possible. We're heading over to a defensive position where we think some friendly troops are stationed, your welcome to come along for the ride if you'd like. Four is a hell of a lot better than one I'd say.\"", "action_results": [{"action": "\"Thanks for letting me tag along...\"", "result": "You and the troops move quickly and silently through the alleys, side streets, and main streets of the falling city. Several times you have to draw swords and fight enemy troops, run away from other Turric groups, or even loose undead creatures wandering the city, however, you all find a place to hole up before you make the final push towards safety. You decide to wait until nightfall before moving onwards.", "action_results": [null]}, {"action": "\"Sorry, I work alone...\"", "result": "You head out, leaving the men to their own fate. Such was the life of a mercenary, why get attached to lost causes? You duck into an alley to avoid a patrol and then head left throwing your hood over your distinctive silver hair. Ducking to the right you enter a series of alleyways.\n\n\n ", "action_results": [null]}]}, {"action": "If your name starts with any other letter of the alphabet...", "result": "You duck, dodge, and sprint and then make a graceful rolling tumble into the rubble.\n\n\nComing up from your roll, you crouch and load your crossbow, you're going to get that Sniper if it's the last thing that  you do. After saying a quick prayer, you turn out from the wall and scan the buildings in the direction of the shot, just as quickly you  turn back in to the safety of the wall. A millisecond later a bolt smashes into the rubble you were just perched on.\n\n\nYou scoot over mentally aiming at the tall tower window on your upper right side. Then you skirt over to the small hole in the wall and aim. Inside you see movement in the wall and you draw a bead. Inhale. Exhale... Fire!\n\n\nThe bolt soars through the air and you hear a slight gasping sound before a man topples out of the window and falls four stories to the cobblestones below. The soldiers cheer and you send them a quick thumbs up.\n\n\nNow to deal with the Turric Soldiers.\n\n\nYou move along the wall to flank the Turric Crossbowmen being careful not to make noise or alert them to your position. Finally, you can go no further and you peek your head out to see where they are and how many. You notice five men, each loading their crossbows. Deciding to make it four, you fire at the most exposed soldier and duck back behind your wall. A scream rewards your efforts and shouts from the Turric soldiers show that they now have a sniper to deal with.\n\n\nYou reload your Arbalest and ready yourself for another shot. Turn, aim, fire, and duck. A scream follows that action and you slide back down the wall to communicate with the sergeant. He is busy instructing his men to take careful aim but you catch his eye and motion for him to send another soldier across to your position.\n\n\nYou slide back to your sniper's post and between you and the soldiers, lay down covering fire as one of the privates rushes to the wall you are hiding behind. You've now got the enemy flanked. He looks at you with admiration and awe but you motion for him to move to the corner and keep his wits about him.\n\n\nHe takes a quick look and  sees a Turric Medic tending for their two wounded men while two men provide fire at the Soldiers you left. You nod and roll over aiming at the Medic and taking him out with a bolt that shatters his skull. The soldier with you runs to the side to another wall to the rear of the beleagured Turric warriors and The sergeant and his soldier keep up firing from the front.\n\n\nSeconds later, you and your soldier pick off the last two Turric Crossbowmen. You wave your hand back and forth indicating a cease fire and you all rise from the rubble strewn battleground. The Sergeant and his men rush to congratulate you, \"I don't know what we'd have done without your timely intervention. I'm Sergeant Reynall and these soldiers are Corvis and Leake. I'm guessing your that merc girl they call 'Silver'. I'd heard you were amazing but obviously the legends do you no justice!\"\n\n\nHe looks at you and says, \"We're heading over to a defensive position where we think some friendly troops are stationed, your welcome to come along for the ride if you'd like. Four is a hell of a lot better than one I'd say.\"\n\n\n ", "action_results": [null, null]}]}, {"action": "\"Good luck guys. You're on your own!\"", "result": "You owe these soldiers no allegiance, you don't live in this city, and dying for a pointless cause in a nameless street doesn't seem very appealing. You say, \"If i were you, I'd retreat cause that's what I'm doing. No point in dying now, this war is lost.\"\n\n\nYou feel a slight twinge of guilt at the faces of the men who look as if you'd taken the little bit of hope you'd given them and dashed it. However, the Sergeant turns to his men and says, \"Don't worry about her men, she's a mercenary, she'd sell her mother if the coin was right. We're heroes fighting for our mothers, our families, and our city!\"\n\n\nThe men buck up and begin to rally sending bolts back towards the enemy as you leave them in the distance.\n\n\nSeveral streets away and you'd almost forgotten them. To each his own. As you cross a dirty alleyway you see an old woman wandering around the streets asking if anyone had seen her boy tears form rivers in her dusty face. You haven't so you move on. You were hired to fight, not to save the world, to cure the sick, or to save the innocent. It was just too much. You wonder to yourself as you pass the banged out ruins of a massive church, \"Where is this god these people prayed to? Why don't they ask him? I'm just one person and I can barely care for myself...\"\n\n\nThe bitter scenes of man's cruelest depravities pass your sight, dogs chewing on the corpses of a baby in a dead woman's arms, a scavenger stealing bread from a stall while the rats chew on the proprietor, and charred bodies still smoking from the artillery strikes.\n\n\nSomehow you sneak past a troop of Turric soldiers carrying the spoils of their ill-earned gains, golden rings, jeweled necklaces, and young girls, most already battered and beaten, headed to the slave squares and whorehouses the Turrics are so fond of. Nothing you can do, you're just one girl, at least you're not one of them.\n\n\nSneaking into a doorway you  are getting tired, your legs are weakening, and your vision is washed with sweat and exhaustion. You need to find refuge.", "action_results": [null, null]}, {"action": "\"Charge the Berm, they can't kill us all!\"", "result": "You charge the berm and watch as two of your men fall from the crossbows of the opposing soldiers. You are next to fall with a sniper bolt in your neck. As you watch the rest of the men fall you curse your stupidity and choke as blood fills your windpipe and you slowly choke to death facedown in a growing pool of blood.\n\n\nYOU HAVE FAILED!!!", "action_results": [null]}]}, {"action": "Wait for the Men to Move On?", "result": "The merchant is already dead so why waste your life fighting for him? Also running away will probably attract their attention so you hide and wait for the men to pass. After about three minutes, you see the men move on, one brags about the men he's killed as they turn a corner. As you are just about to leave, another five Turric soldiers appear from around the corner.\n\n\nYou are glad you didn't charge the first three or you might have been fighting eight men by now. You've got the drop on the five men but it seems like it could be really risky. You can also try to sneak away or continue to wait. You take a small breath and exhale as you make your next decision.\n\n\nYou creep towards the edge of the wall ready to make your move.", "action_results": [null, null]}]}]}