{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=470", "context": "", "first_story_block": "Welcome to Magus: Betrayal!\n\n\nYou are known as Uriel, master elementalist and accomplished magician of the Acadamy of Alzur.\nThe Spark, the talent to manipulate the essence of the elements in everything, has enabled you to live a youth far away from the spears of the soldiers, or the toils of the peasants.\nA findling you are, born to unknown parents and found on the steps of the Academy, but this is not a fate unusual, for the times are harsh for those without the privilige of noble heritage, and few can spare the resources to feed yet another crying mouth.\nIf the Magi of the Academy had not found the Spark in you, they would have turned you over to one of the servants to grow up as one of them, a practice that comes closest to local charity, and ensures that the servants are loyal to the Academy.\nBut this fate was spared to you.\nFrom earliest childhood you learned the arts of the scribe, the arts of the rune and the arts of the Elements.\nYour life has been one of scholarship, and learning, and even though your thoughts sometimes turned towards the parents you never had, you soon accepted that the Academy was your family, never knowing anything different.\n\nHowever, a restlessness in your soul worried your teachers. You were sharper than most of your classmates, and thus began to find the lectures boring, often huddling alone in your study with an ancient tome borrowed from the library with the librarian's grudging permission, learning on your own faster than your teachers could hope to achieve.\n\nFinally, the master magicians admitted defeat. They no longer could teach you anything, and thus it came as a relief to them, that you were chosen, with two other magicians, to fortify the guard of an Alzuran emissary on the dangerous, bandit-infested road to Khofte, a coastal city in the far south.\n\nThe council of magicians apparently thought that a bit of adventure would help to dull your restlessness and sharpen your practical skills.\n\n\nTo begin with, you must choose to specialize in one of the five elements: Fire, Air, Water, Ice and Earth.\nYou may still manipulate the other four, but you can only hope to access the powerful effects with the element of your specialization.\nFurthermore, specializing in one element also slightly affects your character. Ice elementalists are known for the cool and logical mind, while Earth magicians tend to be protective of their charges.\n\nChoose your Specialization.", "action_results": [{"action": "I choose to specialize in Fire, the element of Passion, Heat and Destruction.", "result": "You quickly, and with passion, learned everything you can from your chosen element, regarding little else.\n\nYou especially have disregarded the lessons of Water and of Ice, having nothing but contempt for those who have to think through every situation when, obviously, there is need for speed.\n\nYou possess a greater physical prowess than most of your classmates, and since your inborn arrogance left your without many friends but quite some enemies, you had to use your quickness and strength to avoid being the target of constant ridicule - noone dared to ridicule you after a while.\nInstead, you became something of a loner. You simply know you are a better magician than the others, and you are willing to prove it.\n\nThe specialization of Fire enables you to aquire a deadly arsenal of combat spells, far superior to that of other magicians. You are also able to command the element of elements, the Flames themselves, to do your bidding. Also, you are somewhat resistant to their heat.\n\n\nMake a note somewhere that you have specialized in Fire.", "action_results": [{"action": "I am ready to begin my journey!", "result": "It is early summer in the world of Thyr, and the smell of spring has not yet left the air.\n\nThe emmissary's trek consists of two coaches, one for the magicians, of which there are two more on board, and one for the emissary and his bodyguard himself. Furthermore, there are two dozens warriors on horse accompanying the trek, some of which are scouting ahead.\n\nIt has been two days since you left the Academy of Alzur, and by now you have left the city's military influence, as can be witnessed by the steady growing worse of the road.\n\nYou know close to nothing about Fahan Brownhand's - the emissary of Alzur - orders, or about the man himself, save that he is known to be a devious mind and a quick judge of character, abilities well received within a politician.\n\nAlso you know that your trek is carrying valuable gifts in jewels and gold for Khalar, the citystate you are destined to reach within the week.\n\nYour two magician-companions are no strangers to you. Opposite of you is sitting J'Arel Whitefang, a young man emitting an aura of arrogance that is barely to bear in the confines of the coach. He is, as you know, a capable Fire elementalist.\n\nCurrently on top of the coach, unable to bear the presence of J'Arel any longer, is Lucius Tarchild, an Air mage of some renown. Unfortunately, Lucius is somewhat senior to you, and thus he has the right of first choice, as he explained to you with a wink.\nAlready weary by the long trip so far, you did not argue.", "action_results": [{"action": "I wish to pass the time and speak with J'Arel.", "result": "J'Arel looks up from some thought in surprise, as you cough to catch his attention. His cruel eyes narrow themselves, and he pierces you with his look.\n\n\"What is it that you want?\"", "action_results": [{"action": "\"Do you know anything about the road ahead?\"", "result": "His eyes narrow even further as you ask him about the road ahead. Then he snorts, and shakes his head, while saying:\n\n\"Only as much as you, I suppose. The road will be getting a lot worse the next days, and when we reach the outskirts of Thalun Forest in two days, who knows what will await us in these ancient, dark and magical woods...\" His voice is getting dark and foreboding, and then he suddenly breaks into laughter.\n\n\"Peasants' superstition. Likely some bandits roam the Woods, and that's the reason why lone travellers sometimes are never seen again.\"\n\nHe grins, and forms a magical gesture with his left palm, upon which a blueish flame appears there, a ball of pure energy powerful enough to burn through a tree when hurled with enough force.\n\n\"However, we are no lone travellers\", he adds, his malicious grin broadening. Then, he claps his hands together, and the flame vanishes.\n\n\"I doubt that some ragged band of bandits is going to choose us as our target anyway,\" he says, sounding disappointed. \"Those soldiers look like excellent fighters, and I am certain the bandits will see this as well.\"", "action_results": [{"action": "Continue...", "result": "Suddenly, the coach shudders to a halt. Voices call out, but your first reaction of worrying is soothed as you recognize them as your scouts' voices.\n\nThe captain of the scouts, a burly man in leather armor, approaches the second coach, which is occupied by Master Brownhand, the emissary of Alzura. The captain dismounts his gelding, and appears to speak agitatedly with someone inside the coach - which is all you can make out. Unfortunately, they are too far away to understand a word.", "action_results": [{"action": "I will do nothing but wait.", "result": "The captain of the scouts is arguing agitated with someone inside the other coach, but you cannot make out the words, nor interpret the gestures. Probably nothing important.\n\nYou lean back against the hard wooden seat of the coach, wishing for something to break the monotony of the trip. Already you wonder when you will arrive at your destination. Or at least return to the comfort of the Academy.\n\nSuddenly the door is opened by Lucius, who had been riding the top of the coach.", "action_results": [{"action": "Continue...", "result": "Lucius is a tall, slender man. There is always the sly grin on his face, and his hair looks like he has been in a tornado.\n\nRight now, looking at J'Arel and you, his grin nearly splits his face, causing J'Arel to scowl back.\n\n\"Well, look who's here. Not suffocated yet, I hope\", Lucius grins. J'Arel only snorts with disdain, throwing you a meaningful look as if the journey would have been quite pleasant without your companionship inside the coach.\n\nBefore you can think of how to answer that challenge, Lucius continues as if not noticing the tension between the two of you: \"Looks like we got ourselves some trouble coming. The captain of the scouts just raced his horse nearly to death coming here, then barely pauses to take a breath before arguing with old Farhan. Seems like they want us to make camp here, instead of driving on, but Farhan doesn't sound too happy about that.\"\n\nLucius gives the countryside an appraising glance.\n\n\"Can't say I blame them. It's a good position here, with the hills in front and the plains at the back. At least if anyone's sneaking up on us, they're doing so from only one direction.\"\n\nJ'Arel interrupts: \"Phah, let them come, so we can finally have some use. I don't see why...\"\n\nLucius holds up a hand to silence J'Arel, cocking his head to one side and closing his eyes, as if listening intently.\n\nAs you strain to hear anything untowards yourself, you notice it... the silence is unnatural. Where the journey was accompanied by the rustling of leaves and grass, the chirping and buzzing of insects and the caws of birds, there is now silence... even the horses of the guards seem to hold their breath.\n\nThen suddenly the first volley of arrows hit the group. Lucius curses and hurls himself into the relative but crowded safety of the coach, but a few of the guards do not have as much luck.\nThe air is filled with the rearing of horses and the screams of the wounded. The captain of the scouts turns to face the enemy, but gives only a gurgle, as you can see the black arrow protruding from his neck.\n\nBlood runs out of his mouth, and for a horrifying second, he seems to stare at you with the paincrazed eyes of the already dead, before falling from his horse only to be gored by the panicking beast.\n\nWhen you catch yourself again, you see that J'Arel and Lucius are already preparing spells, even if they cannot yet see who is attacking you.", "action_results": [{"action": "I will wait until it becomes clear who is attacking us and wherefrom.", "result": "You decide to stay in the relative safety of the coach.\n\nJ'Arel, suddenly engulfed in an aura of sizzling flames, jumps out of the coach and hurls a ball of fire in the general direction of the assault.\n\nLucius leaves the coach on through the other door, and immediatley the carriage is rocked by gusts of wind, which also cause the arrows to stray.\n\nOne arrow, however, flies straight at J'Arel's head - but it bursts into flame upon touching his aura.\n\nSomeone bellows a command over the screams of the guards, and those that survived the initial deadly onslaught charge off into the direction where the volleys came from.\n\nYou are considering your options, when suddenly a lightning strike that turns you blind and deaf turns J'Arel into a cinder, but not before you hear his piercing death scream and see, in minuite detail how the fire mage's skin peels off under the tremendous energy of the lightning.\n\nShocked, you decide to join the combat as quickly as possible, before the next strike perhaps hits the coach.", "action_results": [{"action": "Continue...", "result": "Desperately, you attempt to get your bearing.\n\nFrom the twoscore warriors that accompanied the emissary's treck, only one dozen survived the initial deadly volley of black arrows.\nHowever, the guards are rallied and charge the enemy, apparently a group of about half a hundredship ragged looking beings you immediatley recognize as large goblins, led by a couple of their shamans. While a single goblin is no match for a human warrior, the shamans double the goblins' threat, and they make up in numbers what they lack in size.\n\nLucius is using his powers over the wind to make arrows useless, and most goblins have thrown their bows away and now wield evil looking barbed knives.\n\nOne guard, trying to charge through the goblins to strike down a shaman, is dragged from his horse, and both the guard and the poor beast soon disappear und the goblin's small twisted bodies.", "action_results": [{"action": "I am an adept of Fire.", "result": "The flame of the Spark is strong within you today, and your fingers itch with the desire to channel your magic.\n\nThis is it... this is how it feels to have an adventure! If not for the seriousness of the situation, you would laugh with delight.", "action_results": [{"action": "I will use my powers over Fire to rain destruction down the goblins!", "result": "You climb up the coach to get a better overview of the battle, trusting Lucius to do what he's best at, and turn away any stray arrows from you.\n\nYou close your eyes, drawing deep from the burning energies within you provided by the Spark.\nWhen you open them again, they seem to be ablaze.\n\nIn your hands, a powerful ball of flame forms, and you hurl it directly where the goblins' throng is thickest, where it explodes with a deafening noise.\n\nAbout twenty goblins remain on the ground, charred.\n\nAnother ball of flame takes out a dozen more of the wicked creatures, and this is sufficent to break their morale, and they turn to flee.\n\nThe soldiers cheer, and strike down the fleeing goblins as they run back to the hills from where they came.\n\nSuddenly, Lucius screams in pain. With another ball of flame formed in your hand, intended to speed the goblin's flight, you turn to see that Farhan Brownhand, emissary of Alzur, has stabbed Lucius in the back with an evil looking sword that protrudes from the Air adept's chest.\n\nHe grins wickedly at you and makes a gesture with his offhand. Instinctively you hurl your fireball into his general direction, and throw yourself from the coach.\n\nJust in time, as it explodes under you, smouldering splinters burying themselves into your robes and into your flesh.\n\nShaking, you stand up, turning to Farhan and the spitted Lucius, and prepare another spell...", "action_results": [{"action": "Continue...", "result": "You stare disbelieving at Master Brownhand, and before you can launch a spell at him, he uses your hesitation to weave a quick strand of fire at you.\n\nYou barely dodge the small bolt of fire that jumps from his fingers and flies past you.\n\nSeeing he missed you, he curses and prepares another spell. You have to act quick.", "action_results": [{"action": "I attempt to sever or unravel the spell's weave when Farhan casts it, thus countering it.", "result": "You concentrate, and your mental eyes follow the Farhan's weaving. He uses Fire, and mixes Earth in it, but when he leashes it out, you already took hold of one of the strands of magic with your mental touch, and the spell already unravels itself as it is cast.\n\nWhen it reaches you, it is nothing more than a gust of warm wind that ruffles your hair.\n\nInfuriated, sensing what you have done, Farhan pulls the black blade out of Lucius' body, and, brandishing it, charges you.\n\nOut of the corners of your eyes you see that the guards are approaching the obviously crazed emissary.", "action_results": [{"action": "I flee towards the guards, hoping that they will overpower the Magus.", "result": "Seeing Farhan approaching you with the evil-looking dark blade in his hand that is still glistening with Lucius' blood, you jump down from the top of the coach and hurry towards the surviving guards, knowing that you do not stand a chance against the master Magus alone.\n\nFarhan laughs, and you hear behind your back the incantations as he prepares another spell.\n\nHe is only a precious few steps behind you, but the remaining guards, led by a scarred and blackbearded bear of a man, already charge at Farhan with swords drawn.\n\nSuddenly, you hear a sizzle, and it is only instinct that saves your life. You throw yourself on the ground in midrun, just as the first guards pass you in the other direction, and, accompanied by a loud crackle, a searing pain blazes across your back, just before one of the guards in front of you emits a loud scream, and something bright hits him in the chest.\n\nAs you quickly jump to your feet again, bloodied and dirty, with a singed back, you hear another sizzle, a crackle, and then a double scream, as two guards that are running at Farhan are hit by more lightning.\n\nYou turn around, and the four remaining guards are about to swing their swords at the emissary, when suddenly, out of the shadow of the coach, Farhan's bodyguard, a bulky man that moves with the gracefulness of a cat, launches himself at the group of guards.\n\nFarhan turns to flee towards the hills, as his bodyguard snaps the neck of a guard with his bare hands. You shudder involuntarily as you hear the sickening sound.\n\nBefore you can react, the burly man is spitted on the sword of the black bearded soldier, and Farhan, weaving a last spell, disappears in a clap of thunder.", "action_results": [{"action": "Continue...", "result": "Farhan Brownhand, the emissary of Alzur, is gone and his bodyguard is dead.\n\nOnly three guards - and yourself - survived his treachery and the goblin attack. All agree that Master Brownhand had been probably in league with the goblins, but why he would attack the trek himself, noone knows.\n\nThe situation looks grim, reports Kor, the scarred and blackbearded bear of a man who led the charge against the emissary. He is a seasoned veteran, and you can see in his eyes the disgust for this treachery.\n\nThe horses drawing the coach are all either dead or have fled. Night is coming soon, and the road through the hills is known to be a dangerous way even in daylight. Bandits and bands goblins roam the area, as you were forced to experience yourself.\n\nThe plains are not much better. Any camp made on the way would be like a beacon to anyone searching for them, and neither Kor nor you have no doubts that Farhan will likely return - with or without help - to finish what the goblins had begun.\n\nAs a Magus, even a rather inexperienced one, the duty of leadership is on you, but Kor is ready with advice.\n\nBasically, you have only few options. You might attempt to travel back to the Acadamy and report of Farhan's treachery.\nOr, you might attempt to find him before he finds you. Teleport weaves, as Farhan has used to escape, are tricky: They are dangerous to pull off, because inexperienced adepts attempting to move their essence to somewhere else usually unravel themselves and get no second try. Also, the further away the destination is, the more difficult the spell becomes, and you know that even a master magician like Farhan Brownhand must have been tired after the spells he crafted during the battle.\nYour guess is, that he fled to somewhere in the hills, and Kor agrees with you on this, for in the plains, there is nowhere to hide for several miles around, not even a light wood or a small village.\n\nThe only thing you know for certain is, that it would be wise to leave this place as soon as possible, as long as the enemy Magus is still weakened from his spellcasting.", "action_results": [{"action": "We will turn back and attempt to make our way to the Academy to report Master Brownhand's treachery.", "result": "The guards pack their gear with some relief about the decision, and, lightly packed, you abandon the coaches in the coming twilight.\n\nHappy to leave the scene of the slaughter, an invisible tension leaves the men you did not notice before.\n\nNoone is happy to have Master Brownhand now in his back, but all of you are glad that he's not right in front of you.\n\nThe guards march at a good speed, and you, not really used to such sports, wondered whatever must have ridden you to ever complain about riding inside a coach.\n\nSoon, night falls, and the clear sky would be a beautiful sight were you in a mood for it. However, the moon is young, and there is not much light to see by.\n\nKor asks if you are capable of lighting a globe, and wearily, you agree.\n\nConcentrating briefly, although much, much longer than you would usually need, you create a shining sphere between your hands and command it to float over your group.\n\nKor reaches out to you as you stagger, your mental exhaustion nearly complete, but you catch yourself, and although your dignity as a Magus takes quite a scratch by stumbling because of such a simple spell, you are too tired to rightly care.\n\nSoon, the guards go off the road, and you just fall over on the ground when you hear that everyone agrees that now, you are far enough away from the place of the ambush to rest a while.\n\nYou are already asleep before you hit the ground and do not notice that someone wraps a blanket around you.", "action_results": [{"action": "Continue...", "result": "The smell of fried bacon and spiced tea wakens you, and, although bleary-eyed because of a rest that was too short by far, you stand up to face a barely rising sun.\n\nYou are greeted by the guards, and handed a wooden mug of the hot water as well as a small plate of food, and then, it is already time to break camp. You agree to to travel with all haste back towards the Academy.\n\nThe day passes uneventful, although you find yourself in a very bad shape. You wonder why you could have ever complained about riding inside a coach, stuffy as it might have been. The guards march a fast tempo, and you are barely able to keep up, even though your packing is somewhat lighter than that of the others.\n\nThe next day, your back feels like a wooden plank... even despite the blankets that are part of your travel gear, sleeping on the ground is never going to be your preferred method of rest, and you already long for the comforts of life at the Academy.\n\nKor reports that you are likely to reach Alzur by midevening the next day, and you are happy to hear so.\n\nThe next two days pass uneventfully also, although tension grew because everyone was expecting Farhan to return, or another goblin attack. Suspicions rose when you noticed the increased military patrols around, but they ignored a group of travellers and your desire to reach the council of the Academy was too great to become entangled with the military.\n\nFinally, after a journey you are glad to forget about, the sight of the walls of Alzur is very welcome to you.\n\nBut something is wrong. The gates, usually open all day and night, are barred, and the military presence has been more than doubled.\n\nKor apparently recognizes one of the guards and approaches him. The guard obviously expresses surprise and worry at seeing you return so early, but before you can question him what happened, you are immediatley led to the quickly roused council... it is past nightfall, after all.", "action_results": [{"action": "Continue...", "result": "You are lead into the heart of the city, and something definitely feels wrong here. The atmosphere is tense unlike the teeming, bustling city you left only five days ago.\n\nThe huge ironwrought gates of the Academy are opened for you, and your group enters. Without even given the chance to refresh yourself, much to your dismay, you are led before the council's chambers and bidden entry.\n\nThe chambers themselves are somewhat in disarray, as if there had been a meeting recently and yet no time for the personell to clean, and three of the five High Magi look like indeed they have been roused from sleep. They stare at you, some with unhidden contempt, until finally Tharain Ironweave, highest of the Magi, steps forward and explains the situation to you.\n\nThere had been an assassination attempt on the wedding night of princess Jessamin of Khalar, the very city your treck was initially heading. This was exactly two days before.\nAnd, apparently, evidences point towards Master Farhan Brownhand, Alzur's very own emissary sent there, as the assassin.\n\nYou begin to remark that this is not possible, your treck barely left Alzur's lands, but the High Magus interrupts you, that they knew this very well.\n\nYet attempts to explain that to the Khalifat of Khalar met only disbelief, understandingly so. They want some sort of proof.\n\nYou briefly relay to the council what happened to you on your treck, the attack of the goblins and Farhan's treachery, and are met by stoic silence.\n\n\"Do you, then, have any proof that could convince the Khalifat to take back their declaration of war?\", you are asked.\n\nNumbly, you shake your head.\n\n\"Then\", Thalain sighs and suddenly appears much older than he is, \"this war cannot be turned away...\"\n\n\nWishing your first adventure would have turned out to be more successful, you retire into your room, but the longing for comfort leaves a bitter aftertaste when you think that Farhan Brownhand, the traitorous emissary of Alzur, escaped your grasp...", "action_results": []}]}]}, {"action": "I am specialized in the powers of Ice, and will attempt to divine the target of the emissary's teleportation spell.", "result": "It should be not difficult to find such a powerful weave as a teleportation spell.\n\nYou close your eyes and enhance your trained mental senses to a point where you can feel the pattern of the world around you.\n\nBut although you search the point where Farhan has disappeared, you do not find any traces of the weave. You ponder this fact, and come to the conclusion that Master Brownhand must have masked the weave. This is a very difficult to achieve while casting or maintaining a spell, and your respect for the other Magus grows, whatever he might have done.\n\nYet your insight does not help you, and you are unsure of how to go on - a state which you, as an Ice Magus deeply dislike.", "action_results": [{"action": "It is only logical that someone should report the treason, but such a powerful Magus must be stopped. Thus I venture alone into the hills, and send the men back to the Academy to report.", "result": "Kor expresses worry about your shape, but you assure him that you do not intend to face down Farhan Brownhand in hand to hand battle right now, but it is important that you find out what Farhan is up to, and eventually, the warrior agrees.\n\nYou are handed a flask of some of the strong smelling brew with healing powers, and set up with light gear into the hills, with the best wishes of the guards and a short sword from one of the fallen - you usally carry no weapons with you, but your mental exhaustion is too great to be certain that you are able to defend yourself if attacked.\n\n\nKeeping slightly away from the main road, you travel crosscountry, following the trail of the fled goblins from the foiled ambush as best as you can.\n\nWearily, you walk on, although twilight slowly gives way to the starfilled darkness. Suddenly, you notive some movement in the distance... a goblin patrol!\n\nConfidence that you are still on the right track gives away to fear as they appear to have seen you.", "action_results": [{"action": "I am a Magus of Air, and an illusion will certainly divert them.", "result": "Gathering your last mental resources, you conjure the image of a powerful warrior.\n\nOnce finished, it looks indeed a bit like Kor, the scarred leader of the guards, and you wonder if you have overdone it a bit when it charges the goblins with deadly silence.\n\nThe goblins however break at the sight of the charging giant of a man, and dropping their assorted weaponry, they cry something in their own gutural language and flee.", "action_results": [{"action": "I will pursue them, hoping they will lead me to their hideout.", "result": "The goblins flee before you, and after ten minutes in pursuit - your lungs are about to give away - you arrive at a spooky scenery: Apparently the goblins' camp is under attack by wolves!\n\nTheir howl fills the night and make it seem even more dark. The goblins, under attack from all sides, fight with uncommon valor, but even the surprise reinforcements that fled before you are cut down by the powerful jaws of the wolves within seconds.\n\nA black, wolfformed shape is within their midst, and the goblins fight back in terror, but hopelessly, against its devastating power.\n\nThe camp is situated near a steep hill, and has a caveentrance. And out of that, a creature of your nightmares comes... it is the ugliest, and hugest goblin you have ever seen, with sharp claws like that of a troll. And beside it, stands Farhan Brownhand, the man you came to search for, wielding his dark blade.\n\nFarhan moves like a dancer between the goblins and the wolves, and whenever he swings his blades, a wolf falls down motionless. The big creature swings its long arms, regardless of hitting friend or foe, and whenever it hits, the victim is flung into the air.\n\nFarhan alone would suffice to turn the tide of battle in favour for the goblins, and with the strange creature against them, the wolves do not stand a chance.\n\nEven though you know the next spell might cost you your conciousness, you have to act fast.", "action_results": [{"action": "I am a Magus of Ice.", "result": "As you concentrate your magical powers, you suddenly realize what the creature is, as you notice its goblin resemblance.\n\nYou have heared of this long forgotten lore of magically melding one being into another, and clearly the creature is a meld between a goblin and a troll. Since it obviously obeys Farhan's commands, he must be its master... and that makes him an abomination to any Magi: a nethermancer, trained in the arts of the Dark Empire of Lôrn, someone who does not weave with the Patterns of the world, but rather against them, destroying, not creating, feeding of the world's natural order like a vampire feeds of blood.\n\nSo this is why you found no traces of the teleportation weave that Farhan used to flee, and obvious if you think about it now, though it must have been at great risk for Master Brownhand to reveal himself like that.\n\nYou snap yourself out of following your thoughts in that direction, and with uncharacteristic determination launch a devastating attack against the troll-goblin, or goblin-troll, knowing that before you can harm Farhan, who is likely feeding of its life energy, you must destroy his creature first.\n\nA column of pure elemental ice erupts from the earth below the twisted being, and spiked upon the sharp crystals, it twists in agony and emits a horrifying scream of death before it is finally still.\n\nFarhan curses madly at the death of his creature.", "action_results": [{"action": "Continue...", "result": "With the creature destroyed, Farhan's fighting prowess also seems to have suffered. You now see sweat on his face as he attempts to fight through the wolves, who now take the upper hand, to reach you.\n\nHis blade still seems to be thirsty for wolfblood, and whenever he strikes one, it remains still. You grip your blade as he appears to make his way through the now encircling wolves which attack him with all their fury, now that most of the goblins are slain, but then his way is bared by the giant black wolf.\n\nIt growls, and Farhan takes a step back, for the first time emitting fear. The wolf's growl seems to stop the others attack, and they circle Farhan, forcing him against the wall of the steep hill, next to the cave.\n\nThe wolf, apparently content to have trapped the emissary, appears to wait for something. Unsure what is expected from you, you approach Farhan.\n\nWhen he sees that the wolf seems to wait for you, fear is somewhat replaced with a mixture of grudging respect and hope.\n\n\"This is a nice pet you have there\", he speaks in that pleasant voice of his, straining to keep it straight. \"It won't do me any harm, will it? I can explain...\"\n\nBut you interrupt him. \"It is not my pet, and I have no command over it.\"\n\n\"But... but...\", he begins...", "action_results": [{"action": "I am a Magus of Air.", "result": "\"But\", you interrupt him in your smoothest voice, \"I might convince it not to harm you, if you tell me enough to satisfy my curiousity.\"\n\nYou wonder for a moment if he calls your bluff, but either your social skills are too developed or, as you rather suspect, he is too frightened.\n\n\"It wasn't my idea, you see\", he begins flustered, always nervously eyeing the black wolf, \"It wasn't my plan. It just had to look like an accident. You know, the princess... I mean, when the masters said... but...\"\n\nYou have no idea what he is talking about, but you made the experience that its best to let madmen and drunk talk, as they get to the point in their own time.\n\n\"The masters... the blood, all the blood, and... it was their idea! I am just a tool, and you... you won't hold a tool responsible, will you?\", he begs, and pleads to you in his mad ravings.\n\nThen, the hunted, mad look in his eyes clears. He calmly salutes with the blade, speaks calmly: \"My masters will save me.\"\n\nFarhan is obviously about to plunge the evil looking blade into his heart, as the black wolf growls and leaps.\n\nYou turn away in disgust, but the screams of the dying and the sickening sound of teeth tearing at the flesh of the dying man will haunt your nightmares for quite some time to come.", "action_results": [{"action": "Continue...", "result": "It takes you the better part of to two weeks to reach the city of Alzur again. When you arrive at the gates, the first thing you notice is that obviously, the patrols have increased. The guards at first turn you away, but then you show the documents you found searching the cave you faced Farhan and his goblins, and they, recognizing the seal of the High Council, immediatley call upon the High Magi.\n\nWhile you wait in the antechamber, you reflect your voyage so far. When the wolves finished with Farhan's body, there was not much left of it. After they had done this, the wolves, completely ignoring you, slunk away, many with a bloodied snout.\n\nThe large black wolf only raised his head to meet your eyes once, and it appeared as if it winked at you from the depth of those golden eyes. You do not know what kind of animal this creature was, but you were happy enough that it, too, ignored you and vanished with the rest of the pack.\n\nFeeling obliged to them, for some reasons, you spent a few hours piling the dead bodies of the wolves and burn them, leaving the goblins' corpses to rot.\n\nThen, you searched the cave. It appeared as if Farhan had quite a comfortable living hole there, filled with the goblins' plunder. You have also secured the documents Farhan was to bring to Khalar, as well as a note in a writing you were unable to decipher.\n\nDespite the risks, you decided to sleep the night there - exhaustion and the excitement of the last hours finally taking its toll. Undisturbed, you woke the next morning, and hurried to leave this place of carnage.\n\nThen, you hurried to catch up with Kor and his men, but you have not found them. Instead, the journey took much longer than you anticipated, and more than once you wished that this would remain your last adventure forever. Perhaps a life of devoted study and teachings in the Academy was not as bad a choice at that. At least the beds there consisted more than heaps of hay, if you could find any at all.\n\n\nBefore admitted before the Council, you are bathed and clothed new, and for the first time in two weeks, you feel moderately human again, though it will take some more time for the bruises to heal. You make plans to sleep through the whole next week.\n\nThen, finally, you are, accompanied by two guards, led into the Council chambers.", "action_results": [{"action": "Continue...", "result": "You are led into a rather gloomy room, and face the five most powerful Magi of the Academy.\n\nAncient Tharain Oakweave is the one to stand and greet you, and you have to recount your tale in full before he continues to speak.\n\n\"These are dire news indeed, but then, these are dire times. The Khalifat of Khalar has declared war upon us, for an assassination attempt was made on princess Jessamin during her wedding night.\"\n\nAh, so this must be the princess Farhan spoke about... but who are the \"masters\"?\n\n\"Unfortunately\", Tharain continues, \"evidence was apparently found that points to our emissary as the assassin, and the princess has been seen neither dead nor alive since then.\"\n\nYou try to interrupt and explain that this could hardly be, for Farhan has barely left Alzur, but you are silenced by a gesture of the old High Magus.\n\n\"We know, but we have no way to dismiss their evidences, which, to our own surprise, appear to be real.\"\n\nYou wonder what a war between the two most powerful states in Thyr would mean to your plans of living in comfort for the rest of your life, and you do not like the results you come to.\n\nThen, with a smile, you remember something, and produce the documents you found in the goblin cave.\n\nTharain takes them, and reads through them briefly. Then he inspects the strange note you found, and his bushy eyebrows rise.\n\n\"This, indeed, is a hint we might take into consideration.\" Without saying more, he looks at you, and smiles. \"Welcome back, young Magus Uriel. You might have done more than your share to reveal a dark plot indeed. Now, if only the princess could be found...\"\n\n\n\nCongratulations! You have beaten the part one of \"Tides Of War\". Part two will feature the story of Princess Jessamin, so stay tuned. :)", "action_results": []}]}]}, {"action": "I will question him about his plans.", "result": "\"My plans? MY plans?\", Farhan cackles. \"They are not my plans. And if I tell you, then what? You'll call of this beast? You will?\"\n\nYou try to answer, but he does not let you: \"No, I can see my death in its eyes. But I tell you one thing. It wasn't my plan, I was just my masters' tool. The princess... hah... it was a good plan, though... it would have worked, if not for...\" His voice trails off and his eyes suddenly have a glazed over look.\n\nThen, he smiles a half crazed smile, and raises his blade as if to salute to you. When he turns it around as if to impale himself, the black wolf leaps.\n\nYou turn away in disgust, but the screams of the dying man and the sounds of wolfteeth tearing into living flesh will haunt your nightmares for a long time to come.", "action_results": [null]}, {"action": "I will accuse him of treachery and call him to justice.", "result": "You accuse him of treachery, and tell him you will personally bring him back to the Academy for the council to do justice.\n\nHe just stares at you in disbelief, and then with a crooked smile at the black wolf.\n\n\"I do not think you will bring me anywhere, my young friend. I see my death in its eyes.\" Then, his grimace turns into a snarl. \"But for your insolence, I will first get you!\"\n\nSurprised by the sudden change, you raise your own blade to deflect his sudden lunge, but you are too slow, and the blade bites deep into your flesh.\n\nYou scream in agony as you feel your very soul drawn from your living body through the wound to feed the hungry sword. Your pain in the last seconds of your life is so great that you do not even hear the madman's dying screams as the wolves tear him apart.", "action_results": [{"action": "You have died...", "result": "An eternity passes in the wake of a second.\n\nYou are floating in an emptiness even your bodiless mind fails to grasp. It appears as both a darkness so dark as to blind your mental eyes and a light so bright that it is already black at the same time.\n\nYou see, with eyes not your own, the strands of raw magic that weave the pattern of the universe. There is the searing strand of Fire wherever the pattern forms a living soul, filling it with passion and emotion to differ it from the animals. Air lights up, with light blue strand of magic, whenever joy is felt or beauty grasped. Earth, a rich brown and green, gives life to plants and animals and all things that breathe. Water, the purest of elements, a deep blue that fills life in the hulls Earth is creating. Ice, most mysterious element of all, shines with a bright white, and you grasp that it forms the underlying logic of the pattern, directing all other strands into their destined form.\n\nAnd suddenly you understand.\n\nThe secrets of life, the wisdom of existence, the riddle of the creation. It is all so easy, so clear.\n\nYou see the forces of magic, and you also see the other forces, directing them, ordering them. And you see the forces that are directing those.\n\nYou see what has happened, what will happen, what must happen. The future is just another pattern in the great weave of what you unknowingly called existence, which is yet just the dream of an illusion and at the same time reality.\n\nNow you know you can read the pattern, now you know the choices that led you to your doom, and why they did so. You know, you would not choose again wrongly, not this time, if you just had another chance...\n\nanother chance...\n\n\nAnd the Fire that is Passion burns brightly within you and engulfs your soul, forming you into the essence that is.", "action_results": [{"action": "Restart the Game.", "result": "Welcome to Magus: Betrayal!\n\n\nYou are known as Uriel, master elementalist and accomplished magician of the Acadamy of Alzur.\nThe Spark, the talent to manipulate the essence of the elements in everything, has enabled you to live a youth far away from the spears of the soldiers, or the toils of the peasants.\nA findling you are, born to unknown parents and found on the steps of the Academy, but this is not a fate unusual, for the times are harsh for those without the privilige of noble heritage, and few can spare the resources to feed yet another crying mouth.\nIf the Magi of the Academy had not found the Spark in you, they would have turned you over to one of the servants to grow up as one of them, a practice that comes closest to local charity, and ensures that the servants are loyal to the Academy.\nBut this fate was spared to you.\nFrom earliest childhood you learned the arts of the scribe, the arts of the rune and the arts of the Elements.\nYour life has been one of scholarship, and learning, and even though your thoughts sometimes turned towards the parents you never had, you soon accepted that the Academy was your family, never knowing anything different.\n\nHowever, a restlessness in your soul worried your teachers. You were sharper than most of your classmates, and thus began to find the lectures boring, often huddling alone in your study with an ancient tome borrowed from the library with the librarian's grudging permission, learning on your own faster than your teachers could hope to achieve.\n\nFinally, the master magicians admitted defeat. They no longer could teach you anything, and thus it came as a relief to them, that you were chosen, with two other magicians, to fortify the guard of an Alzuran emissary on the dangerous, bandit-infested road to Khofte, a coastal city in the far south.\n\nThe council of magicians apparently thought that a bit of adventure would help to dull your restlessness and sharpen your practical skills.\n\n\nTo begin with, you must choose to specialize in one of the five elements: Fire, Air, Water, Ice and Earth.\nYou may still manipulate the other four, but you can only hope to access the powerful effects with the element of your specialization.\nFurthermore, specializing in one element also slightly affects your character. Ice elementalists are known for the cool and logical mind, while Earth magicians tend to be protective of their charges.\n\nChoose your Specialization.", "action_results": [null, {"action": "I choose to specialize in Air, the element of Joy, Beauty and Illusions.", "result": "You are a jolly companion, and had many friends during your early studies, before you became so engaged in the study of Air that you had little time for anything else, sometimes to your regret.\n\nYou are a connoisseur of things, you enjoy the gifts life has to offer you. You are also something of a charmeur, and this has more often brought you into trouble than out of it, especially considering the Academy's strict ruling according women, especially the social intercourse between students and servants.\n\nHowever, you took an instant disliking to the moody Earth-Magi, and you simply have no common ground with those oh-so cool adepts of Ice.\n\nYour focus on the element of Air enables you to create breathtaking visual illusions, that last as long as someone touches them... or you loose concentration.\n\nAlso, you have minor control over the torrents of the winds, something no other elementalist could hope to master.\n\n\nMake a note somewhere that you have chosen Air as your specialization.", "action_results": [null]}, {"action": "I choose to specialize in Water, the element of Wisdom, Compassion and Healing.", "result": "Your have always been wise beyond your years, but knowledge has never hampered your good judgement of characters, or hindered your compassion.\n\nYou had many friends, who knew they could rely upon you, and your classmates held you in something approaching awe.\n\nYou have perfected the art of meditation for yourself, usually tackle problems by following your heart after carefully thinking about the facts.\n\nHowever, you feel only pitty for those who focus on Fire as their element, for they are rash and destructive in nature, and do not understand the ways of man. It is the same with those who choose Earth above anything else, for they tend to think only of darkness when there is so much life.\n\nThe mastery of Water enables you to cast powerful healing spells, curing even the most serious afflictions. Also, your are able to douse water to a certain extent... thus maybe preventing you dying from thirst in a barren environment.\n\n\nMake a note somewhere that you have mastered the ways of Water.", "action_results": [null]}, {"action": "I choose to specialize in Ice, the element of Logic, Cold and Truth.", "result": "It is only logical you should have chosen Ice as your primary focus.\nIt is the only element that enables you to effectively use your superior intellect to apply to problems, and puzzles are your one obsession.\n\nFor you, magic is not an art: It's a science. Everything connects to everything else, and it is only a matter of approach until every single one of life's secret is to be understood.\n\nActually, you do not know if you ever had any friends in your youth, among your classmates. Or, to be more precise: You simply did not care.\n\nYou hold a certain contempt over those adepts of lesser elements, and while you can tolerate the presence of Earth and Water magicians, you simply cannot stand the unjustified arrogance of those following the path of Fire, nor the capricious jokers that are typical adepts of Air.\n\nYour mastery of the element of Ice enables you great powers of divination. With your spells, you can even divine if someone speaks the truth or not. Also, logical puzzles are merely a challenge, but never an obstacle for you.\nHowever, sometimes you might see connections where there are none.\n\n\nMake a note somewhere that your are following the path of Ice.", "action_results": [null]}, {"action": "I choose to specialize in Earth, the element of Nature, Protection and Life.", "result": "The Earth gave birth to you, and you decide to pay her homage by focussing on the powers this element grants.\n\nYou are, like many adepts of Earth, prone to dark moods, but also hearty laughter. You like to enjoy the bounties of Earth, the beer, the wine, and already you are looking forward to the journey.\n\nYou had few friends among your former classmates, but those friendships still last strong today.\n\nThe powers of Earth enable you to weave powerful protective spells among those you wish to save from harm, but you also are a master summoner. Animals will come to your help, if you call for them, and you can even communicate with them.\n\n\nMake a note somewhere that you are an adept of Earth.", "action_results": [null]}]}]}]}, {"action": "I want him to surrender his blade - it looks like a powerful object of magic.", "result": "\"My... my blade? Yes, here, have it\", he quickly burbles and throws it on the ground.\n\nYou move to pick it up, concious of the giant wolf next to you. But when you bend down to touch it, it snakes upwards as if moved by a ghostly hand.\n\nYou scream in pain as the blade bites deep into your flesh, and you feel your soul drawn from your body into its hungry metal.\n\nYour agony is so great that you do not even hear Farhan's mad laughter as the wolves rip him to pieces.", "action_results": [null]}]}]}, {"action": "I am an Adept of Water.", "result": "When you reach out for your mental powers, you suddenly realize that the creature is a magical construct, a being created and twisted from its natural form into a mindless killing machine, and quite likely insane.\n\nYou also realize what Farhan must be... a nethermancer, a Magus trained in the arts of the Lôrn, the Dark Empire. Master Brownhand weaves not with the Patterns of the world to create his spells, but rather against them - an abominable thought to any thinking Magus. He does not work with the essence of the world, he destroys it, like a vampire living from the blood of others.\n\nShuddering, you prepare to unravel the magical being's antipattern, knowing that if you wish to harm Farhan, you have to destroy his creature first.\n\nPatiently, and hoping he does not notice you yet, you mentally search the creature's being for a point of attack. It is difficult to do so without getting closer, but you do not dare to.\n\nYou are no priest, but you remember once having a spirited discussion with one, and you know that what you have in mind is not unlike the banishing of undeath the priests of Thyr are able to perform.\n\nPatiently, you seek on, and there, you find it... a scar in the weave of the being, like a twisted, cancerous knot. You feel for it, and then, with determination to end this miserable creature's unlife, you give it a sharp mental pull.\n\nThe creature screams in rage and pain, and flails blindly with those long arms of it, felling both goblin and wolf. Then, after a brief struggle, it falls down to the ground, the twisted pulsating knot and weave that gave it its unnatural life gone.\n\nFarhan screams in rage as he sees his creature destroyed.", "action_results": [null]}, {"action": "I will launch a barrage of magical missiles against the goblins.", "result": "Knowing this is the final facedown, you summon up all the energy left within to create a hail of tiny magical missiles that strike their targets with deadly accuracy. The goblins fall under your precise hail, and even Farhan and the ugly creature are subject to your attack, although both appear to shrug of the magical assault.\n\nYou feel you are beginning to blacken out, and the last thing you see is how the ugly goblinoid creature is brought down under three wolves. Then, your vision fades to black.\n\n\nYou awake, unsure how long you were asleep, to the feeling of something breathing in your face. You open your eyes and stare into those of the giant black wolf.\n\nYou tense in shock for a moment, but the wolf seems unaware. There is something strange about its eyes... it looks dead.\n\nA pleasant voice calls out to you: \"Ah, I see you made acquaintance with my new friend. I admit, it took a while to tame him, but in the end, he was willing enough.\"\n\nA shiver runs down your spine as you recognize it as Farhan's.\n\n\"A brave show of you, indeed. You slew many a goblin. But I no longer require them, now that I have a more powerful ally. So I might thank you for getting rid of them for me.\"\n\nFarhan pauses a moment, then adds: \"Please understand that my gratitude has its limits, though. Blackfang, feed.\"\n\nBefore you can react, the jaws of the black beast close around your throat, and not even a dying scream escapes your lips.", "action_results": [null]}, {"action": "I will cast a minor shield on myself and join the fray with my short sword.", "result": "Not daring to cast more than a minor charm in your current mental state, you weave a protective shield designed to turn the knives and spears of your enemies away without so much as penetrating your skin.\n\nThen, you grab your sword, and jump into the battle. A couple of wolves are startled by your appearance, and one snaps at you, but his teeth are deflected by your protection.\n\nYou ignore the startled wolf, and throw yourself on the next goblin, which is as startled. Piercing him with your blade, you move on to the next target, when Farhan notices you.\n\nA pile of dead wolves surround him, and he laughs a madman's laugh in that pleasant voice of his. Then, he utters a command to the giant goblinoid creature, and it ignores the wolves hanging from him and charges you.\n\nYou dodge its first blow, as it sweeps aside goblins and wolves to reach you, and make a bold stab against its chest. But its arms are somewhat longer than your blade, and like a hammer, his backhand swing hits you on the head. You feel lifted up and hurtled through the air, and as ground closes in again, you hear the sickening crunch of your right leg before you pass out into a darkness you will never again wake from...", "action_results": [null]}, {"action": "I will concentrate my magical assault on the ugly creature.", "result": "Somehow you feel more threatened by the presence of the twisted being than of Farhan Brownhand himself, though both leave tremendous damage among the remaining wolves.\n\nYou form a powerful weave to destroy the creature, and, still unseen by Farhan or the goblins below, you launch it at the giant goblinoid, going for speed rather than for finesse.\n\nThe mental strain hits you like a hammer, and you sway, but it is worth it as you see the big ugly thing implode with a deafening scream. The goblins, already panicking, are going frenzy and stab themselves as much as the wolves, and Farhan screams in rage at the death of the creature.", "action_results": [null]}, {"action": "I will focus my magical attack on Farhan.", "result": "You summon your mental forces and prepare to unleash a weave of raw magica against Farhan. He apparently has not noticed you yet.\n\nKnowing you have to go for speed rather than for finesse, you just hope that your mental strength suffices for you not to black out. Then, you banish those distracting thoughts from your mind and concentrate at the work on hand.\n\nWithin seconds, the weave is completed, and you hurl it with a single word of power against the emissary who dances among the wolves, cutting them down.\n\nYour magical force hits him straight into the chest.", "action_results": [{"action": "I am a Magus of Fire.", "result": "To your brief surprise, Farhan merely shrugs off the mental assault, and turns into your direction with a wicked grin, brandishing that evil looking blade of his.\n\nYou notice out of the corner of your eyes that the ugly creature cringed in pain when your spell hit Master Brownhand, and without thinking, you unleash the powers of Fire within you at the creature.\n\nAs it turns to ashes within a split second, much faster than you would have anticipated, Farhan screams in rage.", "action_results": [null]}, {"action": "This is not the case.", "result": "But Farhan simply shrugs off your mental assault.\n\nYou are shocked by this, and he turns towards you with an evil grin on his face, and cuts his way through the wolves towards you.\n\nHorrified, and knowing your mental reserves are depleted entirely, you brandish your own sword, slowly giving way to Farhan. Unrelentlessly, he comes towards you.\n\nYou turn to flee, knowing you cannot face him in hand to hand combat, and make a run for it, but he is faster.\n\nYou utter an inhuman scream as the wicked blade he wields bites into your flesh, and you feel your very soul being drawn into the very weapon, feeding both its wielder and its own hunger...", "action_results": [null]}]}]}, {"action": "Happy to have survived the encounter without much effort, I will rest to gain strength before continuing... before something worse than the goblins appears out of the darkness.", "result": "You decide that rest is what you need right now, for you cannot go on, your mental resources completely depleted and your physical condition is not much better.\n\nTelling yourself an hour rest will suffice, you feel weariness like you never knew before creeping up to you.\nThe cool air and the ground, not quite chilling yet no longer containing the sun's warmth ever help to keep you awake, yet you feel your eyes closing themselves involuntarily.", "action_results": [{"action": "I am a Magus specialized in Water.", "result": "You feel sleep threatening to overtake you, but you embrace the feeling and turn it into restful energy, knowing that falling asleep right now would probably be the last thing you would ever do.\n\nInstead, you use a ritual like that of meditation, only the other way around, and you draw the tiredness out of your body and into the surrounding Pattern of the magic weaves.\n\nYou close your eyes and reach a state like slumber, only at full awareness, while thinking through the situation so far.\n\nSuddenly you sense movement nearby. With a quickness that would surprise anyone taking your for someone asleep you jump up, your short sword in your hand.\n\nSneaking up to you were three goblins, each armed with barbed spears, and they are more surprised than you at seeing them. With a quick thrust, you end the first goblin's life, and the others, expecting a defenseless human instead of one awake and capable of killing them, turn to flee.", "action_results": [{"action": "I need to regain more strength before I face more enemies.", "result": "You feel like drowning in your weariness. The day has been more than taxing so far. Casting spells never felt so tiring, but then again, the conditions under which you wove your spells so far never had been so demanding.\n\nOnce you yearned for adventure, but right now, you yearn for a soft bed like you had when studying in the Academy.\n\nThe thought of a bed is a dangerous one, and you cannot hold sleep off any longer. With a sigh, you close your eyes and give in to the drowning darkness.\n\n\nYour dreams are vivid and colorful. You dream of the Patterns of the world, and how a different Pattern feeds into it. You sense a dark presence swirling the weaves, twisting them with fingers unseen. You somehow feel threatened by the presence, and will yourself to wake up - yet to no avail.\n\nAnother dark presence approaches the first... it is less human, more like an animal, but as dark and... you cannot put a finger to it... somehow out of place.\n\nYou feel the presences clash together, in your mind, and all the colors turn to black and white, and then vice versa.\n\n\nWith an incredibly intense, stabbing pain you awake, briefly, and, pierced through your chest is the barbed spear of a grinning goblin.", "action_results": [null]}, null]}, {"action": "I am an Adept of Ice.", "result": "Your drowsiness threatens to take over, but it would be most unlogical to give in to the desire to sleep, for it would be much likely to be the last thing you would ever do.\n\nInstead, you use the cool air and the cold ground to refresh your body and your mind. This is your type of energy, after all.\n\nSuddenly, you notice movement at the corner of your vision, and immediatley, your senses clear and you are full awake. Remaining still as to pretend being still asleep, you notice that three goblins are sneaking up to you.\n\nWithout further hesitation, you lash out your right hand into the direction of one, and with a simple yet effective weave freeze his heart. The goblins' companions gasp in surprise as their comrade simply falls over without another sound at your gesture, and they turn to flee immediatley.\n\nNot pausing, you stand up and run after them in pursuit, before they fetch more companions.", "action_results": [null]}, null]}]}, {"action": "I will rely on my magic to defend against them.", "result": "As you tap into your mental forces to prepare a weave to defend yourself against the goblins, you notice that your mental exhaustion is quite advanced... casting a spell to slay the four goblins will tax you dangerously.", "action_results": [{"action": "I am a Magus of Fire, and its destructive powers are my speciality.", "result": "Any other Magus would likely have a problem with the drain that comes with weaving destructive spells, but to you, it is rather refreshing.\n\nAs the goblins charge, you simply smile and spread your hands, which burst into a blueish flame which casts spooky shadows on the nightly hills.\n\nSeeing this, the goblins' charge falters slightly, but the two archers are unfathomed by this and nock arrows into their bows.\n\nDeftly, a small weave of fire turns the bows in their hands to cinders, and they yelp in pain as the skin on their hands turns to blisters.\n\nConfused by the cries of pain behind them, the two remaining goblins stop and turn, and when you hurl the blueish flame around your hands at one of the archers, he explodes in a ghostly fire without a sound before their eyes.\n\nThis is enough to convince the goblins that bravety is uncalled for, and they turn and flee.", "action_results": [null, null]}, {"action": "I will take out as many goblins as it feels safe to do, then face the rest with my sword.", "result": "As one of the archers comes in range and launches an arrow at you, you pick it up with a thin strand of air and redirect it to hit the other archer in the throat, which dies gurgling in a foul language you do not understand.\n\nThrusting your left hand forward and uttering a single syllable of power, you focus what power remains for you to safely use, and thrust it into a powerful weave that rips one of the remaining goblins apart from the inside.\n\nShocked by the display of power, the goblins are close to breaking point. You draw your short blade and charge them, and the darkness and their fear hides your exhaustion well from them.\n\nBefore you reach them, your blade glimmering in the starlight like the sword of an avenging angel - at least in the goblins' eyes -, they drop their weapons and flee.\n\nToo exhausted to pursue them, you slump down on the ground and decide to rest for a while.", "action_results": [null]}, {"action": "I will use my mental reserves instead to camouflage myself, so that the goblin patrol will not find me.", "result": "You throw yourself flat on the ground the moment the goblins begin moving into your direction. There, concentrating, you weave a small charm that blends your Pattern into that of the surrounding, effectively becoming invisible to the casual eye.\n\nYou have a good view of the goblin patrol, and as they approach, you use what little power remains within you to handle safely to mask your breathing and movements.\n\nThe goblins still approach, to the point where you can smell their sickening stench and hear their gutural language, which you do not understand. But obviously they are searching for someone, or something, and are not too happy about it.\n\nYou cannot stop yourself to breathe a sigh of relief as they pass you, unseeing, and vanish into the darkness of the hills below.\n\nYou wait for another quarter of an hour, and then you release your magic, slumping on the ground, mentally completely exhausted.", "action_results": [null]}, {"action": "Using magic would be too taxing - it is of no help if I fall unconcious because of weaving a spell - so I trust on my swordblade on this encounter instead.", "result": "Brandishing your short sword, you bellow a battlecry and charge the goblins, hoping that this will break their morale.\n\nThe two archers loose their arrows at you, but you do not even have to dodge them... goblins are not known for their aim, and indeed, their arrows go stray.\n\nOne of them manages to fire another arrow at you before you reach them, but that one misses you also.\n\nYour first blow, unexperienced as you are, is deflected by the goblin's shield. Using your weight and the force of the blow, your followup stab pierces his stomach.\n\nWith a cry of pain in a foul language you do not understand, the goblin falls to the ground.\n\nHowever, as you are about to free your blade from the goblin's body, one of the archers shoots an arrow at point blank at you, and as you cry out from pain as the wooden shaft bores into your flesh, the other goblin with the morning star smashes it into your skull, and after a brief pain, there is only darkness.", "action_results": [null]}]}, {"action": "Cowardice is preferable to death... I will hide myself!", "result": "You know that your magic is too weakened to rely upon, and while a trained warrior could probably handle those four goblins, you realize your swordskill is mediocre at best.\n\nThey appear to have spotted you, but you throw yourself flat on the ground - careful enough neither to break the flask you are carrying with you not to spike yourself on your sword - and roll down a hill, more away from the road.\n\nThere, you keep down, knowing that in your state you are unlikely to outrun them. The hand on your swordhilt, you cower in darkness, thankful that the young moon does not give off much light.\n\nAn eternity passes, and you are about to raise your head, as you hear the shuffling feet and the gutural language of the goblin patrol approaching. In the darkness, you briefly consider weaving a minor charm to make you unseen, but you are afraid that even the tiniest motion of a hand would betray you, so you hold your breath and remain still.\n\nAnother eternity passes - probably barely more than a minute - and the sounds of the patrol fade away again - obviously they were not intent on searching too hard, after the beating they took at the ambush.\n\nBreathing a sigh of relief, you sit down to gather your strength again before continuing.", "action_results": [null]}, null]}, {"action": "We are not in the possession of all the facts, and thus need to find out more about Master Brownhand. So we attempt to find him together, for eight eyes see more than two, and it is logical to have protection.", "result": "Kor and the guards do not like your decision, and express clearly so, but they accept your status as the group's leader.\n\nQuickly, you are packed with light gear, and, abandoning the coaches, you head into the hills in the approaching nightfall.\n\nThe moon is young, and the ground is not easy to see, yet you march through the hills slightly away from the road, as not to be so easy a target.\n\nAn hour passes, and nightfall becomes a beautiful starspangled sky, were you in a mood to appreciate this.\n\nSuddenly, Kor stops and points towards an approaching goblin patrol. They have spotted you too, and seeing that you equal their size, decide to make a run for it after the disaster of the ambush earlier.\n\n\"Get 'em 'fore they gets to their fellows!\", Kor bellows, and, axe drawn, charges them.", "action_results": [{"action": "I will attempt to strike down the goblins from afar, using the meager mental resources remaining to me.", "result": "You close your eyes and focus your mental view on the goblins' Patterns. You weave a few simple strands of air and fire, to keep low the strain on your already overtaxed mind, and cause one of the goblin's chest to explode.\n\nShocked by this display of power, the remaining goblins stop approaching you and appear to discuss what to do now - they are obviously not very bright.\n\nThis distraction is all the guards need to reach them, and the goblins fall under the blows of the men.\n\nSeeing you have been victorious, you gently fall over, already fast asleep, as the spell takes its toll from you despite your rigid concentration.", "action_results": [{"action": "Continue...", "result": "You awake when someone shakes your shoulder.\n\nWith an aching head, you stretch and stand up to face Kor, who woke you.\n\n\"Quickly\", he hisses. \"I know yer in no shape, but we need ya here. Dem's buggers found out bout us somehow, and dere's about two dozens creeping all 'round us, closin' in. We're trapped like rabbits!\"\n\nWith that, he thrusts a short sword into your hand. You do not feel in any shape to weave spells at the moment, and this is bad as you realize what Kor just said.\n\nThe goblins are approaching, and you see them... indeed, at least two dozens of them encircle the tiny camp the men made. You're uphill, but there's too many of them to really use that advantage.\n\nThe men, and you, form a square, each one guarding one side. The blade in your hand is unfamiliar, but you feel that it would be a good idea to become familiar with it rather quickly.\n\nThere is a moment of silence, and then, the goblins charge with cries in a gutural language you do not - and if the accompanying gestures are any indication, you are glad that this is so - understand.\n\nWith an answering battlecry that you join in, you intercept the first wave of the attack. Kor's great axe slices through the goblins' bodies, and the man to your right spits two goblins at once on his sword.\n\nYou are barely capable of deflecting the wicked spears and knives of the creatures, but you manage to bring in a well placed kick that causes one of the foul beings to yelp in pain, loose the balance and roll back down the hill, taking another one with him.\n\nAlthough the four of you manage to hold the goblins at bay, it is clear that you cannot do so for very long, and after a minute of frenzied fighting, a scream of pain indicates the guard in your back going down.\n\nQuickly, the square becomes a triangle, as you move to protect your fallen comrade, yet the battle appears to be without hope.\n\nDetermined not to be the next to fall, you fight on, and it is by sheer luck that you survive the next minutes.\n\nSuddenly, a spooky howl fills the night, and the goblins cower in fear for a moment, then abruptly the break of their assault and turn to flee.\n\nKor caughs something, and you notice that the giant of a man is wounded, as is the other guard. You, by none less than a miracle, are the only one not seriously wounded.\n\n\"After em, lad,\" Kor cries and throws you a bottle of that evil smelling medicine the guards use. You drink a gulp, pocketing the last remains, and the fire within refreshes you sufficently to grab your sword and hurry after the fleeing goblins alone in the dark, towards the source of that ghostly howl that has now ceased...", "action_results": [null]}]}, {"action": "This is a fighter's job, not mine... I am too exhausted, and the goblins should be no match for the guards.", "result": "While Kor and his men charge the goblins, and gaining, you slowly walk after them.\n\nYou are weary to the bones, and your mental resources are nearly depleted due to the exhaustion earlier. It would be of no use to anyone if you fell unconcious by trying to slay a few goblins.\n\nA couple of minutes later, and the guards are engaged with the goblins. Indeed, the goblins do not stand a chance against the trained fighters, but one of them manages to escape.", "action_results": [{"action": "I am a Magus of Fire.", "result": "Your instincts take over.\n\nWith a pleased grin, like that of a cat on a chase, you deftly weave a small knot of fire and hurl it after the goblin.\n\nIt hits him in the back, and within split seconds, only ashes remain of the creature, but even that tiny spell was too much for you, and you gently fall over.", "action_results": [null]}, {"action": "I launch a magical attack against him.", "result": "You focus what remains of your mental resources into a ball of pure energy and cast it after the fleeing goblin, striking him from behind.\n\nThe magical energy discharges into the goblin's body, and he falls down lifeless.\n\nYou, however, having reached your limits, fall down into a deep, dreamless sleep...", "action_results": [null]}, {"action": "I do nothing. What harm can one single goblin do?", "result": "You judge your mental resources too low to be able to weave a spell that would do more than tickle the goblin, and thus you let him escape.\n\nThe guards have finished dealing with the other three, but the fleeing goblin is too far away.\n\nKor curses, when he notices that one got away, but everyone agrees that he's too far away.\n\n\"The bugger's probably goin' ta get his friends on our heels within the hour\", he mutters. \"Let's get away from here.\"\n\n\nYou agree on this, and you head away from the road, to make camp somewhere safe.\n\nYou are in no shape for guard duty, and so the three men share it among themselves. Food is scarce, but sleep is all you need. Before you hit your blanket, you are already fast asleep.\n\n\nA battlecry wakes you in the middle of the night. Bleary-eyed you need a few seconds to get your bearing, and that is all the goblin standing behind you needs to ram a barbed spear through your body.\n\nA pain you never knew before fills you, and you faint the moment you see the spearhead protruding from your chest, falling into a darkness from where there is no awakening...", "action_results": [null]}]}]}, null]}, {"action": "I am specialized in the powers of Earth, and thus I attempt to question the animals of the area whether they know of Farhan's whereabouts.", "result": "You sit down on the ground and close your eyes, sending out a mental call to all the animals around you.\n\nYou probe into their minds and send your image, a human friend in need of help, and already you hear their answers.\n\nDominating the mental images that answer is that of a huge, black shadow, and you know it must be the most powerful animal around - a natural leader, as you will.\n\nYou feel its presence approaching, and the remaining guards gasp aloud as suddenly a huge black wolf jumps into your mid without so much of a sound. Swords and axes are drawn, but you command them to drop their weapons.\n\nThe wolf, with the natural grace of a killer, ignores them as lesser prey - you see them through his eyes - and approaches them.\n\nYou are about to lay down on the ground and bare your throat, not as a gesture of fear but as a token of respect, when you sense that something is not quite right about this wolf. You hesitate, but the wolf does neither appear to notice nor to care.\n\nHe sits down on his hindlegs in front of you, staring at you with uncanny yellow eyes that seem to hide an intelligence much more than mere animal.\n\nCovering your nervousness, that might as well bring you death, you frame a mental picture of Master Brownhand and send it to the wolf.\n\nThe reply is a flurry of images that nearly knock you out of your concentration. Blood, hatred, the scent of blood dominating the whole scene, slain cubs, a dark entrance into a cavern, the scent of goblins, the sickening taste of their foul flesh, and at the core of this, the being you knew as Farhan, and also something different, something dark, you cannot quite point your finger on.\n\nHastily you break your concentration before the hatred you feel overpowers you, and it is only then that you notice the deep, dark growling of the wolf as it simply looks at you, and the nervousness of the guards, which already have drawn their blades again despite your command.\n\nBut then, the huge animals simply stops, stands up and leaves towards the hills, ignoring the guards again as it strides through their midst.\n\nAt the edge of the battlefield, it turns its head to look at you, as if to see whether you follow, then turns again and trots into the hills.", "action_results": [{"action": "I will follow the wolf, with or without the others - it appears to want to lead me to somewhere specific.", "result": "You know that it is your duty to follow the wolf, and perhaps your destiny.\n\nYou have asked a favour from it, and it is now time for you to repay that favour. Kor presses a short sword into your hand and a flask containing one sip of that evil smelling brew with healing powers the guards used, but the men make it clear that they will not follow you.\n\nYou have no time to argue with them, for the wolf is already out of sight, and so you hurry on, into nightfall, falling the huge black shape.\n\nThe wolf waits for you just out of sight of the guards, and, seeing that you follow, turns to walk on again.\n\nLike in trance, you follow it. At least two hours, straight through the hills, slightly away from the road, the two of you march on. At one time, he sniffed the air, and lay low on the ground, and you did it likewise, wondering briefly about what kind of intelligence this uncanny animal possesses.\n\nThen, when you see a campfire shining at the horizon, the wolf emits a low growl. Then, suddenly, he raises his head and howls towards the young moon, a deafening sound that wakes primal instincts of fear deep within you. The howl is picked up through the surrounding hills, and the black wolf charges towards the fire.\n\nFascinated, and worried, you follow.", "action_results": [{"action": "Continue...", "result": "When you arrive at the campfire, there is a battle going on between silvergrey shapes and the twisted humanoids. The black wolf has launched itself into the fray, and the goblins, having nowhere to flee as they are under attack from all sides, fight with uncommon valor, but you can see that the odds are not in their favor.\n\nThe camp is situated against a steep hill, and you see a cave entrance out of which a nightmarish creature appears.\n\nIt is without doubt the largest goblin you have ever seen, larger than many a human, sporting huge claws. And, standing next to it, is Farhan Brownhand, wielding that dark blade of his.\n\nHe moves with the grace of a dancer amidst the goblins and wolves alike, and whenever he makes a cut with his sword, a wolf falls down motionless.\n\nFarhan alone might turn the tide of battle in favour for the goblins, and the goblinoid creature simply swipes those clawlike arms of it around, uncaring whether it hurts friend or foe. Even the powerful black wolf keeps its distance from it.\n\nWhile you are not exactly mentally fit, and afraid that even a single spell will be the last one you cast before falling down unconcious, you know you have to act.", "action_results": [null, {"action": "I summon the protection of Earth around the wolves.", "result": "You call upon the powers of the very earth you stand upon, and shield the wolves with your weaves.\n\nThe goblins, already panicking, never actually noticed that their weapons are now turned away from the beasts they fight without harming them.\n\nHowever, your weave offers no protection against the brute force of the twisted giant goblinoid, and the blade Farhan wields still wrecks havoc among the wolves.", "action_results": [null, null, null]}, null, null, null]}]}, null, null, null]}, null, null]}]}, {"action": "I launch a quick spell against him, intend on stoping him long enough for the guards to reach him.", "result": "You raise your arms, quickly contemplating the type of weave to throw against Master Brownhand, but decide for simplicity.\n\nA few minor strands of Air flow from your mind and wrap themselves around the emissary's arms, and, tightening, you attempt to hold him.\n\nHis eyes widen in fury as he realizes what you are about to do, and he attempts to sever the weaves that surround his arms with his own magic.\n\nSurprised at the deftness and skill of his magical counterattack against your spell, you cannot do anything but admire the man's finesse as he unravels your spell with his mind.\n\nWithin a split second, your spell falls to pieces beyond repair, and Farhan, unhindered again, charges the coach you are standing upon.", "action_results": [{"action": "I will jump down the coach and grab the sword of a fallen soldier to face Farhan in close combat.", "result": "Infuriated by the sight of your fallen friend, and by the treachery that you have witnessed, you jump down from the coach and grab the heavy, unfamiliar blade of a goblinslain soldier.\n\nYou see, from the corners of your eyes, that the guards are approach Farhan Brownhand with drawn weapons, but you ignore them.\n\nThe emissary grins a wicked grin and makes a fast and elegant move, that closes the distance to you and your blade much faster than you could have anticipated.\n\nBy sheer luck, you manage to parry the first of Farhan's blows, but he anticipated the move and brings his blade back in a small circle, cutting deep into your unprotected side.\n\nAs the black, evil-looking blade enters your body, you feel a pain you have never felt before. It is as if your soul itself is torn and shredded by the cold metal, and you utter an inhuman scream.\n\nFeebly, knowing that you are doomed, you wave your own blade towards Farhan, but he nimbly evades the clumsy blow and twists the sword in your side one more.\n\nUnable to bear the pain, you scream once again, and then, feeling your soul drawn out of your body through the wound, everything first fades from red to black to a chilling emptiness...", "action_results": []}, null]}, null]}, {"action": "I quickly launch a spell at him to disrupt his casting.", "result": "Quickly, you close your eyes and stretch your fingers towards Farhan, hurling a small amount of raw magic against him. This is without finesse, and rather taxing, but effective enough.\n\nMaster Brownhand gasps as the pure energy you launched at him hits him, and snarls a curse at you. Obviously, you successfully broke his concentration.\n\nThen, he grabs the dark blade still sticking in Lucius' body, hefts it in his right hand, weaves a protective gesture with his left and advances to the coach you stand upon.\n\nOut of the corner of your eyes, you see the surviving guards, with drawn swords, approach the emissary.", "action_results": [null, null, null]}, {"action": "I try to work a dangerous spell against Farhan, trusting my skill to complete it before him.", "result": "You close your eyes, concentrating feverishly on a weave that you know will destroy Farhan Brownhand.\n\nOnly seconds pass, as you prepare to launch the last patterns at your opponent, but he is faster, and a bright light errupts from the emissary's fingers, and hits you in the chest, just as you are about to complete your spell.\n\nWith a searing pain in the chest, Farhan's spell throws you backward from the coach you were standing upon, and you hit the ground below head first, just as you hear a bellow of rage coming from the remaining guards...", "action_results": [{"action": "Continue...", "result": "You are not dead, and you are quite sure of it, because you always heared of death being somewhat of a peaceful slumber. Instead, your head feels like it is going to explode every second now, the world appears to be one of those carroussels you have visited once on a fair near the Academy, and if your stomach wasn't empty already, it would soon be.\n\nWith a groan you open one of your eyes, only to find that the world not only spins like a carroussel, but the flashing lights that dance before your vision also appear to be like the fireworks that often accompany the fairs.\n\nYou have no idea how long you were left there lieing, but when you open your eyes again, you stare into a horrific face, swollen and blurred like a nightmare come true.\n\nYou gasp and wrench from the hands that suddenly grasp your shoulders, only to find that the sudden movement brings an explosion of pain so far unknown to you into your head, and you cannot help but twist to one side, assisted by the hands, and empty your stomach for good, even though all that comes from it is blood and bile, each spasm calling forth another explosion of pain that makes you wish you were, in fact, dead.\n\nA voice calls something you do not understand, and something cold splashes your face.\n\nWhen the spasms stop and the pain subside to barely above tolerable levels again, someone holds a wineskin to your mouth, and greedily you take a gulp, only to choke at the brandy that is now in your mouth.\n\nCoughing, and wincing, you try to sit up, and are assisted once again by the strong hands. You look at who is holding you, and finally, through the tears of pain, your vision clears and you recognize the scarred and bearded face of one of the soldiers who looks at you with some concern.\n\n\"Some concussion y'got there, lad\", he greets you.\n\nAn hour later, when you feel well enough to stand up again, though somewhat shaky - the brandy helped greatly to settle your stomach, there must have been something in it - you take in the scenery.\n\nOnly three guards - and yourself - survived, but the goblins were nearly decimated, and the few survivors fled.\n\nLucius Tarchild and J'Arel Whitefang are both dead, J'Arel obviously the luckier of the two.\n\nBoth were apparently killed by Farhan Brownhand, the emissary of Alzur, the scarred guard that woke you reports with a scowl. He interrupts his talking, and turns to spit on the ground.\n\nMaster Whitefang was slain by a bolt of lightning summoned by Master Brownhand, and Master Tarchild was slain by a darkly enchanted sword the emissary wielded when he attacked the magus.\n\nFor some reason, the emissary obviously was in league with the goblin horde, and wanted the trek to be exterminated. However, the guards managed to overcome the goblins in time, and faced by the remaining guards, Farhan slew most of them with his magic and then turned to flee.\n\nWhy he did this, the scarred man, who is named Kor, the guards never knew, but they suspect some dark treachery.\n\n\nYou have been unconcious for more than three hours, and it is high time to break the camp, in case Farhan, rested, returns to finish the work the goblins began.\n\nThe animals that drew the coaches are either dead or fled during the ambush, and you have little choice but to leave the place by foot in the twilight that announces nightfall.\n\nKor, obviously a seasoned veteran, is about to order the remaining guards to pack, when he hesitates a moment to look at you.", "action_results": [{"action": "As a Magus, it is on me to lead the group.", "result": "You explain that the duty of leadership is on you, as a Magus.\n\nKor's eyes show quite clearly what he thinks of this, seeing that you're in no shape, but then nods in agreement.\n\nHe grunts something, then hands you some of the evilsmelling brew you were forced to drink earlier, but remembering its healing powers, you eagerly take another swallow.\n\nFeeling the soothing warmth running down your throat, you already feel a lot better, though by no way yourself again.\n\nKor is ready with advice on how to proceed, and you gladly take it.\n\nYou agree that you have to break camp as soon as possible, before Farhan - undoubtedly in a better shape than you - returns to finish his work.\n\nBasically, you only have two choices. You either return to the Academy of Alzur, reporting of Farhan's strange betrayal, or attempt to follow him into the hills, where he likely has fled - Kor reports that he teleported away when the guards charged him, and you know that teleport weaves are hard to pull off and very exhausting, and not even a master Magus could travel very far. And since there is not even a small village or a forest in the near vincinity, it is only sensible to assume Farhan must have fled into the hills.\n\nKor suggests going back to the Academy, reporting the emissary's betrayal and counsel then what to do about it. A sideglance towards you either means that he is concerned about your weakened state and too polite to say so, or that he thinks you too young and inexperienced to even stand the smallest chance against Farhan Brownhand.\n\nBut you are the leader, as you made quite clear, and so the decision is upon you.", "action_results": [null, null, null, null, {"action": "As I am specialized in the powers of Ice, I will attempt to divine the destination of Master Brownhand's teleportation spell.", "result": "You have been unconcious for quite some time, and magical weaves disperse rather quickly, but you are confident to find the remains of such a strong spell as a teleportation.\n\nUpon your request, Kor shows you the place where Farhan Brownhand vanished. Closing your eyes, you concentrate upon your mental senses, and trying to feel the weave that the emissary must have left.\n\nBut to your surprise, you find nothing at all, not even the faintest remains. You ponder this for a moment, and think through all the possibilites.\n\nIt is unlogical that a weave that powerful would not even leave the faintest traces in the pattern of the world, not before a day or three would pass - and unless the guards lied, which you doubt, you were not unconcious for that long.\n\nThe emissary might have not teleported himself away after all, you consider for a moment - but quickly dismiss it, for even the simpler weave of an invisibility spell would leave traces that you could spot without really concentrating.\n\nSo... whatever spell he wove, he must have masked it. This is a difficult feat to do while casting or maintaining a spell yourself, and your respect for Master Brownhand increases despite what he apparently might have done or not.\n\nApparently. Yes. That is a a thought worth thinking through, you consider, your trained logical mind trying to reach into all directions to find answers.\n\nBut you quickly desperse this train of thought, for you see no logic in following it at the moment.", "action_results": [null, null, null]}]}, {"action": "Kor is a seasoned veteran, and I follow his lead.", "result": "As Kor looks at you with the question of leadership in his eyes, you only nod your head to him, and wince at the burst of pain this small movement causes.\n\nNoting it with some concern, one of the other two guards hands you a flask with the same evilsmelling stuff you were forced to drink earlier. Remembering its healing powers, though, you eagerly take a swallow, and the pain clears away nearly immediatley - although the taste remains, and you still not feel yourself.\n\nSeeing you recovered somewhat, Kor speaks to you: \"We'll be headin' back to Alzur, the Academy needs ta know 'bout what happen' here.\"\n\nYou cannot but agree, and although the thought of leaving Farhan behind makes you uncomfortable, you know that you at least are in no position to weave powerful spells at the moment.\n\nWithin the hour, you are packed and prepared for the long journey back to Alzur.", "action_results": [null]}]}]}]}]}, {"action": "I will single out the most powerful looking enemies and turn them into cinder.", "result": "You quickly climb upon the coach, to get a better view of the battle.\n\nDecisively, you summon the powers of Fire to channel thin strands of elemental flame into the bodies of the three goblin shamans, which turn immediatley into cinder.\n\nOne goblin has not dropped his bow, and fires an arrow at you, but another thin strand of fire takes care of both the arrow and the archer.\n\nAnother goblin is about to plunge his wicked looking knife into the neck of a soldier, but yelps in pain and drops it as its hilt suddenly glows bright red, which gives the soldier time to dispatch the goblin with a backhand stroke.\n\nWith their shamans dead, the goblins offer little resistance, and their morale is close to breaking point when you notice that Farhan Brownhand, the emissary of Alzur, is sneaking up behind Lucius, making strange gestures as if invoking a spell.\n\nYou do not know exactly what to think of this, but then again, you are not a pesky Ice adept who needs to think through everything before reaching a decision.\n\nInvoking the Fire again, you settle for a warning shot, and the earth in front of Master Brownhand explodes into flame.\n\nLucius turns around in surprise, but before you can react, Farhan has a slender, evil looking sword out and runs it through the Air adept, who's look turns from surprise to pain.\n\nFarhan lets go off his sword and turns towards you.", "action_results": [null]}, {"action": "I will weave minor protective charms to support the guards.", "result": "Earth is not your strongest element, but nevertheless you know of charms that prevent blows and knives to find their target.\n\nYou climb up on the coach you rode in to get a better overview, and concentrate on channelling the energies out of the ground, and into the armor and bodies of the soldiers.\nA few twicht uncomfortably as you know they must feel a tingling sensation, but those you enchant this way react surprised when the wicked knives of the goblins glance of their armor and skin without leaving a scratch.\n\nThe weaving of so many minor enchantments costs you a lot of concentration, and after a minute of holding the spell up, you are about to collapse.\n\nThe soldiers, however, have made the best of uses of your spells, and only a few of the goblins are left alive.\n\nSuddenly, Lucius, who has been preventing accidental arrows to break your concentration, screams in pain, breaking your concentration.\n\nBefore the whiplash of the dozens of suddenly broken spells wipe out your mind and cause you to fall into a deep blackness, you see Fahan Brownhand, the emissary of Alzur, standing behind Lucius, spitting him with an evil looking sword...", "action_results": [null]}, {"action": "I will weave a minor charm to slow down the goblins.", "result": "Water is not your most powerful element, but nevertheless you know enough about how to manipulate the fluids in a being to slow it down, hoping that this will give the guards enough advantage to slay the wicked creatures.\n\nYou close your eyes, concentrating, and hoping that Lucius can keep any stray arrows away from you, and channel the unaccustomed energies of Water through your body.\nGently but unstoppable, like the tide, the powers flow into the bodies of your enemies, burdening them, slowing them, and one by one you feel, through your bondage with Water, how the life form of one after the other is destroyed by the soldiers, who use the turn of events.\n\nSo absorbed are you in the unfamiliar enchantment, however, that you do not even hear the warning that Lucius screams to you, and the last memory of living that your soul carries to the netherworld is that of a blinding light and a searing pain, melting your skin and flesh and bones...", "action_results": [null]}, {"action": "I will grab a sword from a fallen soldier and join them into the fray.", "result": "Some strange fever grips you, and you grab a heavy looking sword from one of the fallen.\n\nBrandishing it in both hands, you roar out a challenge that comes from the heart, and charge the goblins. Suprised by your fierceness, the goblins shrink back from you, and you cut down two of them before they realize it.\n\n\nHowever, your clothings offer little protection against the barbed knives, and you are soon swarmed by the evil beings. One goblin cuts your sinews from behind, bringing you down to the ground with a scream of rage, and it is only a matter of time before one of the wicked, barbed knives finds the way to your throat and to your heart.", "action_results": [null]}]}, {"action": "I am a magus of Air.", "result": "The torrents of Air flow freely through your spirit, and you are determined to use them.\n\nStrangely, you are rather excited than frightened by the prospect of fighting your very first battle. So this is what adventure feels like!", "action_results": [{"action": "I will combine my powers with Lucius, creating gusts of wind to knock down the goblins.", "result": "You step beside Lucius, and begin to channel the energies of Air through your body.\n\nLucius looks at you, and you nod when he takes control of the flows of magic through your body, adding them to his own.\n\nWith no more archers shooting, Lucius forms a giant fist of air from the winds, and pummeling the group of goblins mercilessly.\nWhere the two of you strike with your combined magic, the goblins do not stand up again.\n\nA shaman attempts to cast a counterspell, wrenching the control of the Air around you from Lucius, but he is swatted like a fly, for combined, your magic is too strong to be redirected that easily.\n\nLucius is drawing more and more power through you, and you feel the strain of it.\n\nSuddenly, the bond snaps, and you stare in horror at Lucius' chest, from where an evil looking slender sword is protruding.\n\nThen, something hits your head, and, added by the strain of working powerful magic, you slip into a thoughtless darkness...", "action_results": [null]}, {"action": "will attempt to use my knowledge of illusion to confuse the goblins, so that they turn upon each other.", "result": "Swiftly you climb up the coach, to get a better view of the battle.\n\nTrusting your fellow Air magus Lucius to protect you from the archers, you begin to delve into the minds of the goblins, twisting the images they see until they appear to each other as their enemies.\n\nGreat is the sudden confusion as the goblins, suddenly panicked by the turning of their former companions into more soldiers, begin to hack and claw at each other.\n\nOne shaman, trying to counter your illusions' effects, is stabbed just in time by a panicking goblin.\n\nThe strain to maintain so many, albeit small, illusions is great for you, and after a minute of the frenzied fighting, you sink to your knees, sweatsoaked.\n\nSuddenly, your concentration is broken by a scream next to you.\n\nWith horror, you see that Lucius has been spitted on an evil looking sword wielded by Farhan Brownhand, the emissary of Alzur.\n\nHe lets go of the sword, and turns to you, grinning wickedly.", "action_results": [null]}, null, null, null]}, {"action": "I wield the powers of Water.", "result": "Water, filling you with peace even in the middle of a bloody battle and allowing you to calmly assess the situation, flows strongly in you.\n\nLife will be and has been shed, but this is nothing that you can prevent anylonger. You can only hope that it will not be your life, or that of your allies, though that hope already has been betrayed.\n\nYou briefly wonder about J'Arel's death. The goblin shamans cannot be possibly capable of wielding such magic. But the thought quickly eludes you, for you know you have to act fast and decisively if this battle is to be won.", "action_results": [{"action": "I will use my healing powers to revive the wounded soldiers.", "result": "You scramble up on the coach, to get a better view of the battle.\n\nTo your left, on the ground, is Lucius, protecting you from stray arrows with his power over the winds.\n\nClosing your eyes, you search for the hidden power in yourself, and, finding it, channel it gently out of your body.\n\nTouching the soldiers with the invisible strands of magic you invoke, you revive them and draw their pains away. A few of the wounded ones gasp in surprise, as their wounds close themselves, then they notice you, give you a curt nod of thanks, and launch themselves into the fray.\n\nWhenever the goblins cut down one of the guards, you channel the pure life back into the body of the wounded one. Slowly, the goblins notice that they cannot harm the men, and start to panic.\n\nHowever, the strain of keeping the spells flowing through you is tiring, and so you do not manage to keep your concentration when suddenly, Lucius screams in pain.\n\nHorrified, you see that behind him, Farhan Brownhand, the emissary of Alzur, has stabbed Lucius in the back with an evil looking sword.\nYou reach for the strands of Water again to channel life back into the Air adepts' body, but it is already devoid of life... you shiver at the implication of that, for the sword must hold terrible and dark powers to vanquish a life with only a casual thrust.\n\nGrinning, Farhan lets go of the sword, and turns towards you.", "action_results": [null]}, {"action": "I will attempt to strike the enemies with a barrage of magical missiles.", "result": "You quickly climb up the coach to get a better view of the battle.\n\nThere, you concentrate briefly and hurl tiny bolts of pure magicka with deadly precision into the horde of goblins. When struck, the goblins fall down never to get up again.\n\nAs the channeling of combat magic is not exactly your specialization, the feat proves to be very taxing.\nHowever, dozens of goblins fall to your small but deadly precise hail.\n\nThe goblins are close to breaking and turn to flee, when suddenly you are distracted by a scream. Lucius, having prevented that you become the target of those goblin archers that have not yet dropped their bow, is spitted on an evil looking sword.\n\nYou give a start when you realize that it is Farhan Brownhand, the emissary of Alzur, that wields the blade that has stabbed Lucius into the back.\n\nGrimly, you prepare to channel another two bolts of pure magicka into Farhan's direction, as you remember too late that his bodyguard is always close to him.\n\nA blow on your head drives thoughts of magic away for quite some time, and darkness engulfs you.", "action_results": [null]}, null, null]}, {"action": "I am specialized in Ice.", "result": "The Spark, for you a crystallized snowflake, burns brightly with cool reassurance deep within you.\n\nQuickly you assess the situation.\n\nThe goblins outnumber the surviving soldiers four to one, and even without the goblin's magical assistance in form of the their shamans, your guards will not stand a chance.\n\nThe shamans. Hmm. You would be surprised if one of them was capable of casting such a bolt of lightning as struck down J'Arel, and you are rarely surprised by facts.\n\nSo, there must be another magician close by, and someone quite powerful.", "action_results": [{"action": "I will attempt to divine the source of the lightning bolt that struck down J'Arel.", "result": "Closing your eyes, and trusting that Lucius' winds will shield you from stray arrows, you invoke the ancient runes of Divination, trying to make the magic tell you where the strands of woven magicka, of which the lightning bolt that charred the Fire magus undoubtedly consist, lead to.\n\nThis is a task that requires great concentration for several seconds, but your rigid training helps to fade out the screams of the wounded and dying and the clash of weapons.\n\nIn what is a split second but which feels like an hour to you, your mind picks up the magical weaves of the spell that had been cast, and unravels them.\n\nYou admire the precision and the masterwork, a great lot of energy must have been used up to strike such a powerful bolt of lightning at such precision.\n\nYour mental fingers follow the invisible strands of magic, and you are suprised to find that the origin of the lightning bolt seems to come from the emissary's coach.\n\nYou open your eyes again and break your spell, unsure as how to deal with this piece of information. Looking towards the battle, you see that the guards are in serious trouble dealing with the goblins.\n\nYou have to act quick.", "action_results": [{"action": "I ignore the information, and hurl shards of ice towards the goblins.", "result": "With cold fury upon witnessing the slaughter of the guards, you cast out your arms and hands, and hurl shards of ice into the goblin horde, where they explode into tiny slivers that burn with unnatural cold.\n\nThose goblins that are hit by the large shards themselves fall down never to get up again. Those burned by the cold splinters scream in pain and are swiftly dispatched by the soldiers which have been looking for just an opportunity.\n\nTwo more shards of ice strike down the shamans busily trying to heal their goblin fighters.\n\nThey goblins are close to routing, as suddenly, you sense someone behind you. You turn, and the last thing you hear before your vision fades to black is Lucius' inhuman scream on the other side of the coach...", "action_results": [null]}, {"action": "I ignore the information, and cause the ground under the goblins' feet to turn to ice, so that they stumble and fall.", "result": "You climb up on the coach, which is the best strategical position you can hope to achieve.\n\nLucius is protecting you from any stray arrows with his command over Air, and from here, you have the best overview.\n\nYou study the patterns of the goblin horde for a second, and then reach into yourself to draw out the powers that the Spark grants you.\n\nMumbling the necessary incantations and pointing your fingers at the fight, you allow the magical energies to escape your body and channel them to the ground below.\n\nYour efforts are rewarded by a cry out outrage, as the first goblin slips and stabs itself on the knife of a companion. This causes a chainreaction, from which the guards of the treck unfortunately are not unaffected, yet their armor protects them from the flailing, now unprecise stings of the goblins' knives.\n\nLucius, seeing what you have done, directs his winds to topple the remaining standing goblins, and keeping those down that try to righten themselves again, and the guards begin to easily dispatch their smaller enemies.\n\nBut suddenly, Lucius' screams in anguish, louder than the shrieks of the panicking goblins, and as you turn to him in surprise, you see that Farhan Brownhand, the emissary of Alzur, has stabbed Lucius in the back with an evil looking sword.\n\nYou are unsure of the meaning of this, a situation you are not used to, but you decide to prepare a spell against Farhan when you see his malicious grin as he turns towards you, leaving his sword sticking in Lucius' crumpled body.", "action_results": [null]}, {"action": "I will investigate the emissary's coach.", "result": "As you approach the coach, oblivious to the screams for mercy from the battle, the coach's door is openend.\n\nFarhan Brownhand, the emissary of Alzur, exits the coach, brandishing an evil looking, black sword. Directly behind him is his bodyguard, a nondescript man you would not give a second glance on a street, who looks startled at you.\n\nBehind you, you hear Lucius scream, as a small group of goblins throw themselves at the magus, and as you are about to turn, Farhan's bodyguard is behind you with three quick steps, and then, with a stinging pain on your neck, your senses fade to darkness.", "action_results": [null]}]}, null, null, null, null]}, {"action": "The powers of Earth are mine to command.", "result": "The rythm of nature, which for you manifests in the Spark, is strong in you.\n\nThe Earth will be watered with blood, and there is nothing you can do to prevent this.\nHowever, you can still protect those of your allies that have not yet fallen, and you are determined to see that victory, even against the odds, is yours.", "action_results": [{"action": "I will enchant the guards with the protection of Earth.", "result": "Trusting Lucius to deflect the stray arrows directed at you with his command over Air, you scramble clumsily up the top of the coach, to get a better overview of the battlefield.\n\nThe fighting looks grim, all of the remaining handful of guards are bleeding from dozens of wounds, while the goblin shamans take care that many of those goblins cut down leap back on their feet.\n\nDetermined, you act quickly, closing your eyes and drawing the powers from the bowels of the\nEarth herself, channeling it gently up the guards' bodies, turning their skin hard as iron.\n\nThe guards, at first surprised that the goblins' knives seem to be deflected by their suddenly hard skin, renew the ferocity of their attacks, and the goblin shamans cannot heal their companions quick enough.\n\nIt is rather difficult for you to command so many weaves at once, for every time one of your fellow soldiers is hit, it saps a bit of your mental powers to upkeep the enchantment, but you are determined not to let another of your companions fall to the wicked goblin blades.\n\nThe goblins, suddenly facing an enemy they cannot hope to defeat, are close to breaking point, when suddenly, your concentration is broken by a terrible scream.\n\nYou turn your attention towards Lucius, and see, to your horror, that your companion and friend is spitted on a black and evil looking sword wielded by Farhan Brownhand, the emissary of Alzur.\n\nWith the sword's tip coming through his chest, Lucius falls openmouthed and -eyed on the ground, and Master Brownhand lets go of the blade, and turns with a wicked grin towards you.", "action_results": [null]}, {"action": "I will send a call to the animals of the hills and plains to come and assist us.", "result": "Leaning against one side of the coach, you close your eyes and send out a call of help to all things attuned to Earth.\n\nYou project your own image, and that off the goblins, stinking, poisoning the earth with their mere foul existence.\n\nAnd your call is answered.\n\nSuddenly, a howl errupts from the hills, a group of wolves coming for a brother in need. Both the goblins and the guards, engulfed in deadly close combat, appear to be startled by the cries of the wolves, but they quickly catch themselves again.\n\nThen, the first goblin shaman is brought down with a single, powerful bite in the neck by a large, black wolf, who you easily identify as the leader of the pack.\n\nYou channel your powers of earth to deflect the goblins' knives from the hides of your friends, both animal and human, and the few surviving goblins turn to flee after a mere minute, as more and more wolves join the battle.\n\nThe wolves turn to pursuit the foul creatures, but not before the large black wolf catches your eyes and emits a deep growl. You understand perfectly: Brothers are there for each other, but this is a mutual responsibility. With this, the pack leader turns off to follow the rest of the pack, leaving the dazzled guards behind.\n\nYou move towards the fallen, seeing if you can do anything about their wounds, when suddenly Lucius screams with pain, and suddenly, your vision fades to black when something hard and heavy hits your head... from behind...", "action_results": [{"action": "Continue...", "result": "You are not dead, and you are quite sure of it, because you always heared of death being somewhat of a peaceful slumber. Instead, your head feels like it is going to explode every second now, the world appears to be one of those carroussels you have visited once on a fair near the Academy, and if your stomach wasn't empty already, it would soon be.\n\nWith a groan you open one of your eyes, only to find that the world not only spins like a carroussel, but the flashing lights that dance before your vision also appear to be like the fireworks that often accompany the fairs.\n\nYou have no idea how long you were left there lieing, but when you open your eyes again, you stare into a horrific face, swollen and blurred like a nightmare come true.\n\nYou gasp and wrench from the hands that suddenly grasp your shoulders, only to find that the sudden movement brings an explosion of pain so far unknown to you into your head, and you cannot help but twist to one side, assisted by the hands, and empty your stomach for good, even though all that comes from it is blood and bile, each spasm calling forth another explosion of pain that makes you wish you were, in fact, dead.\n\nA voice calls something you do not understand, and something cold splashes your face.\n\nWhen the spasms stop and the pain subside to barely above tolerable levels again, someone holds a wineskin to your mouth, and greedily you take a gulp, only to choke at the brandy that is now in your mouth.\n\nCoughing, and wincing, you try to sit up, and are assisted once again by the strong hands. You look at who is holding you, and finally, through the tears of pain, your vision clears and you recognize the scarred and bearded face of one of the soldiers who looks at you with some concern.\n\n\"Some concussion y'got there, lad\", he greets you.\n\nAn hour later, when you feel well enough to stand up again, though somewhat shaky - the brandy helped greatly to settle your stomach, there must have been something in it - you take in the scenery.\n\nOnly three guards - and yourself - survived, but the goblins were nearly decimated, and the few survivors fled, followed by the wolves you summoned, the scarred man adds with a sideglance at you.\n\nLucius Tarchild and J'Arel Whitefang are both dead, J'Arel obviously the luckier of the two.\n\nBoth were apparently killed by Farhan Brownhand, the emissary of Alzur, the scarred guard that woke you reports with a scowl. He interrupts his talking, and turns to spit on the ground.\n\nMaster Whitefang was slain by a bolt of lightning summoned by Master Brownhand, and Master Tarchild was slain by a darkly enchanted sword the emissary wielded when he attacked the magus.\n\nFor some reason, the emissary obviously was in league with the goblin horde, and wanted the trek to be exterminated. However, the guards - with the help of the black wolf's pack - managed to overcome the goblins in time, and faced by the remaining guards, Farhan slew most of them with his magic and then turned to flee.\n\nWhy he did this, the scarred man, who is named Kor, the guards never knew, but they suspect some dark treachery.\n\n\nYou have been unconcious for more than three hours, and it is high time to break the camp, in case Farhan, rested, returns to finish the work the goblins began.\n\nThe animals that drew the coaches are either dead or fled during the ambush, and you have little choice but to leave the place by foot in the twilight that announces nightfall.\n\nKor, obviously a seasoned veteran, is about to order the remaining guards to pack, when he hesitates a moment to look at you.\n\nSuddenly, a growl makes both of you look around.\n\nThe black wolf, a majestic animal, is standing at the corner of the battlefield.\n\nOne of the guards warily raises his weapon, but you call him to drop it. Ignoring the guard, the wolf casually and gracefully steps up to you.\n\nHe sniffs the air, then turns and heads of to the hills, turning his head just once to see if you follow him, then turns again to walk away.\n\nKor and the other two stare after him with distrust in their eyes.", "action_results": [null, {"action": "I ignore the wolf, and, as a Magus, it is on me to lead the group.", "result": "With a stab of bad conscience because of neglecting to repay a favour done, you are nevertheless certain that you have to cast the role of leadership on your shoulders.\n\nWearily, you explain to Kor that, as a Magus, it is your duty to lead the group, but you welcome his advice on what to do next.\n\nWith a cursory glance at you, he nods and agrees - you are the remaining Magus of the group, even though you lack the experience.\n\nSatisfied that you are not chasing after some animal, Kor advises that you return to the Academy of Alzur and make sure reports of Master Brownhand's treachery reach the council.\n\nBasically, you only have two choices anyway. You can attempt to follow Farhan into the hills - a teleportation weave, as he has likely used to make his getaway, as the guards describe to you, is a very taxing spell, and it cannot be used to cover large distances. And since the plains offer no hideout whatsoever in the near vincinity, tthe assumption he has fled into the hills lies close at hand.\n\nOn the other hand, it is also vitally important, as Kor suggests, to head back to Alzur to report to the council of the Academy of Master Brownhand's strange treason. Both of you still have no idea why he would have done something like that.\n\nThe decision on how to go on is on you, though. Kor makes his point that you are in no position to face down Farhan - even if you find him -, and neither are the men.", "action_results": [null, null, null]}, null]}]}, null, null, null]}]}]}, {"action": "I will leave the coach, weaving offensive magic to support the guards.", "result": "As J'Arel, suddenly engulfed in a flaming aura, leaps out of the coach, you take the exit on the other side.\n\nImmediatley you find yourself dodging panicked horses and stray arrows. Before you get your bearing, a loud crackle is heared, and something like lightning seems to strike nearby. A piercing scream barely recognizable as human tells you that the lightning must have found a target - it came from J'Arel's side of the coach.", "action_results": [null]}, {"action": "I will stay in the coach, preparing defensive spells before joining the fray.", "result": "Lucius and J'Arel both leap out of the coach, the Air magus to the left, and J'Arel to the right.\n\nYou prepare to cast a minor enchantment to ward blows and strayed arrows on yourself, feeling that you do not have the time for more.\n\nJ'Arel is already hurling fiery balls of flame into the general direction the surviving soldiers are charging, and when sudden gusts of wind rock the coach, you know that Lucius is busy trying to prevent the arrows finding their targets.\n\nAs you close your eyes to murmur the final incantation, something incredible bright strikes close to you with loud thunder and a pierced scream, and when you open your eyes again, you see that where J'Arel stood, the ground is charred.\n\nNot waiting any longer, you leap out of the coach.", "action_results": [null]}]}]}, {"action": "I will cast a minor spell which allows the air to carry the sound to my ear. [You can do that even without being specialized in Air.]", "result": "You mouth the charm to cause the wind carrying the syllables of the captain to your ear.\n\n\"...tracks! But did no follow 'em. 's gettin' dark in four hours, now jez be campin now, afore we getta beatin\", the captain of the scouts says.\nYou cannot make out the full reply, only catching a few words: \"...plan... alliance with... no harm come... not bandits...\"\n\nThen you notice that J'Arel is staring at you with unhidden curiousity, and are just about to comment, when Lucius, who had been riding on the top of the coach, opens the door and breaks your concentration sufficently to drop the spell.", "action_results": [null]}]}]}, {"action": "\"I don't think I like your attitude, J'Arel.\"", "result": "\"I don't think I like your attidue, J'Arel\", you reply.\n\nJ'Arel only snorts, and answers:\n\"And this would be your problem, or mine?\"\n\nYou choke back the angry answer that lies on your tongue. After all, you are supposed to guard the emissary in case of an attack, and not squabble with a fellow magician.\n\nWith a dirty glance towards J'Arel, you decide to let the point rest for now.", "action_results": [null]}, {"action": "\"Can you tell me anything about the emissary?\"", "result": "\"Less than you, I suppose,\" J'Arel answers, then sighs and shakes his head.\n\"I heared he's a powerful mage himself. I don't know why we're to accompany him, Master Brownhand is said to be capable of taking care of himself.\"\n\n\"If I were you, I would rather worry about the road that lies ahead than about or passengers. The road will be getting a lot worse the next days, and when we reach the outskirts of Thalun Forest in two days, who knows what will await us in these ancient, dark and magical woods...\" His voice is getting dark and foreboding, and then he suddenly breaks into laughter.\n\n\"Peasants' superstition. Likely some bandits roam the Woods, and that's the reason why lone travellers sometimes are never seen again.\"\n\nHe grins, and forms a magical gesture with his left palm, upon which a blueish flame appears there, a ball of pure energy powerful enough to burn through a tree when hurled with enough force.\n\n\"However, we are no lone travellers\", he adds, his malicious grin broadening. Then, he claps his hands together, and the flame vanishes.\n\n\"I doubt that some ragged band of bandits is going to choose us as our target anyway,\" he says, sounding disappointed. \"Those soldiers look like excellent fighters, and I am certain the bandits will see this as well.\"", "action_results": [null]}]}, {"action": "I will use the time to study the landscape, as I have never been so far from Alzura before.", "result": "There are fewer and fewer fields with toiling peasants, this far away from Alzur's protecting arms. The road snakes through terrain that is, plain spoken, rather boring.\n\nYour thirst for adventure is already seriously dampened - the coach, while preferable to a day on horseback, simply does not beat walking. Anyhow, through the smallish windows, you cannot see much anyway.\n\nSighing, you turn away from the plain fields, and wish for a book. However, the librarians of the Academy, while usually rather lenient when it came to you, were firm on the fact that no books would leave Alzur. Most likely, they were worried that in foreign lands, people would eat books.\n\nYou cannot stiffle your curiousity how the city of Khofte looks like. But that is still a good week ahead, and you suppose that you are dead by boredom until then.", "action_results": [null, {"action": "I consider taking a nap, so that the time will go by faster.", "result": "The best way to pass the boring time until you reach a place to make camp, you think, is to close your eyes and hope that sleep will bring some sort of distraction.\n\nThe rocking motion and lurch of the coach is enough to nearly make you seasick, and the hard, unpolstered wood you sit upon make your task not easier.", "action_results": [{"action": "I am specialized in Water.", "result": "You close your eyes, and take a deep, calm breath.\nYou have learned the art of meditation as a matter to contemplate the greater wisdom of life, but you feel no remorse upon using a technique for such a minor comfort as sleep.\n\nUsing a subtle pattern in the rolling and lurching of the coach upon the uneven road, your mind drowns out any disturbances and washes you away into a tide of sleep...", "action_results": [{"action": "Continue...", "result": "A scream of rage - or pain - pierces through your meditative rest, capable of shaking you out of your sleep immediatley.\n\nJ'Arel grins at you, engulfed in a fiery aura you recognize as a protection spell, and says mockingly:\n\"Ah, the sleepyhead is awake for the fray. Well, hop to it... there's some cooking to do.\"\n\nWith this he leaps out of the coach, and hurls a fireball into a direction unseen by you.\n\nScreams of pain and bellowed commands can be heared from the outside, and there is the singing of arrows in the sky.\n\nSudden gusts of wind rock the coach, but you quickly realize that this must be Lucius, commanding the Air to ward of the arrows. The guards, of which you can see quite a few dead, spiked with black arrows, charge into the direction J'Arel hurled his ball of fire.\n\nBefore you can react, a lightning suddenly strikes J'Arel, and burns the adept of Fire into a heap of ashes, but not before you can hear his piercing scream.\n\nYou decide that there are not many options open to you, so you leap out of the coach to at least see who, or what, is attacking the emissary's treck...", "action_results": [null]}]}, {"action": "This is not the case.", "result": "The rattling and lurching of the coach prevents you from finding a restful position, and you are forced to admit that sleep is not an option while the coach is moving on this so-called road.", "action_results": [null, null, {"action": "I will simply cast a minor charm on myself, which will allow me to sleep soundly.", "result": "While you have not extensively studied the ways of Water, you still know a few minor charms of that element.\n\nResting a body and mind so that it will drift into sleep is one of them, and it is easy to do so when the target of the spell is willing.\n\nYou concentrate briefly, put the index and middle fingers of each of your hands on each eye and invoke the powers within you.\n\nImmediatley, calm and peace rush into you, and wash away all distractions. Even the hard wood you are sitting upon is no longer so worrisome.\n\nGently you drift into sleep...", "action_results": [null]}]}]}]}, null]}]}]}