{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=50303", "context": "", "first_story_block": "A world on the cusp of disaster. Two sides on the verge of destroying each other, but there is hope. In the form of a hero. Now this will hero..., will they be able to rise into the mantle of hero? ", "action_results": [{"action": "Yes", "result": "As the son of your father, the Grand Priest of the Holy Kingdom, you've always had a lot on your plate. The moment  you could speak, your father put you in lessons of every type. At first they were purely academic, only ranging  from basic history to simple math, but as time progressed your lessons became more difficult. You were required to memorize religious texts of every manner, and you were even taught some philosophy. This routine was all there was to your life at twelve years of age. You were content with it too, until two major things happened. \n\n\nA breeze shakes the trees around you and cools your face. Your take a moment and close your eyes allowing the feeling to move across your entire body. It relaxes you, and coupled with the silence of the forest you imagine this is what Paradise must feel like. You open your eyes and are momentarily blinded by the sun. It'd been like this every day this season. Blistering hot, but with a breeze that you always make sure to thank the Creator for. Without it your training would be nearly unbearable. \n\n\nOf course, you'd much rather have to deal with your Knight training every day than have to do extra academic lessons. Maybe if you hadn't started the training to become a knight of the Holy Order you wouldn't hate lessons so much. Then again, you also wouldn't know the bliss of resting after a good workout. Besides, even if you hadn't begun your training there was always the second thing. \n\n\nEven as the thought enters the mind, the figure appears before you. Platinum blonde hair frame an angelic face that seems to hold your attention much longer than normal. You bring your eyes to her emerald ones for a moment then look away. \n\n“Hey Erron. Have you been waiting long?” Her voice is rich with authority and familiarity,\n\n\nYou turn back at the sound of your name to see a wide smile atop her face. “Yes I have. If you kept me waiting much longer, then some bird might've started using me for a nest.” You allow yourself a small smile when she rolls her eyes. \n\n\n“Are you ready for this, Alessandra?” Her name rolls off your tongue with ease. “Excuse me. I meant your Majesty.”  You bow slightly, and her smile stays for a few more moments before disappearing from her face entirely. It's replaced with an expression of apprehension. \n\n\n“I’m nervous. I don't want him to keep us from going back there.” \n\n\nShe runs her fingers through her hair. The young princess was authoritative, but often times, you find her to lack a lot of confidence. Or maybe that was just with you. \n\n\n“It’s fine. He's never been mean to us before. Remember? The only thing he asked us not to do was to bring anyone else when we visit him.” You cast your thoughts back to your memories of the man…", "action_results": [{"action": "Background: The World", "result": "The continent of Dellandia is a large one. It is famous for the wars and constant strife that inhabits its lands. Well, was famous for. \n\n\nYou cast you mind and thoughts back to your history lessons. You were born in the new era of Dellandia where the entire continent has finally been united under the rule of the current royal family. The Dellandins were just figureheads a short hundred years ago, but with the support of the Holy Kingdom they were finally able to latch onto some real power. As time passed the Dellandins grew more and more powerful until they were able to start conquering the lands of Dellandia. They stretched themselves too thin, and were about to collapse, but yet again the Holy Kingdom supported them. This pattern continued until the Holy Kingdom itself rose to power in a way that wasn’t just religious. Support of the people grew until the Grand Priest of that time revived the lost order of knights.\n\n\nThe Grand Priest declared this order to be a Holy Order of Knights created under the direction of their God. The Creator. However, the Grand Priest didn’t do all that his people wanted him to do. Instead of going to war with the Dellandins, the Grand Priest entered into an uneasy alliance with them. Although wary of the Holy Order’s knights, the Dellandins accepted and together they managed to bring the continent of Dellandia to their knees. \n\n\nAfter several heated arguments, it was decided that the Holy Kingdom (and their religion) were to be just that. A religion. No standing armies, but against their better judgement, they allowed for the Holy Order to exist. It was a heavily regulated existence with a limit on how many people could be trained as well as where the Holy Order could be “stationed.” \n\n\nThat is the situation to this day with only a few differences. The Dellandins are constantly pushing for more and more regulations on not just the Holy Order of Knights, but the Holy Kingdom itself. The King and the Grand Priest spend much of their time arguing, and recently you notice that tensions are getting much more strained. You just hope it won’t ruin your relationship with Alessandra.\n\n\nYou don’t really worry much about it though. You trust your father after all.", "action_results": [null]}, {"action": "The Man", "result": "You think about the first time you saw the guy. Two years ago, at age ten, you were fearing for your life. \n\n\nYou and Alessandra had only met minutes before at yours and her parents' insistence. They allowed you to both go into the royal forest on the castle grounds. It was a large preserve with plenty of animals to hunt whenever the King wanted to, but to  you and Alessa, it was a place that needed exploration. And so, you obliged.\n\n\nNeither of you were certain of each other, but you both had a childish taste for adventure, so when you saw the alluring cabin…well there was only one thing you could do.\n\n\nCasting caution aside, the two of you walked inside and began exploring. It had everything a person needed to survive, but oddly enough it also contained a well stocked book case. This didn’t quite catch your attention, but Alessa was enamored. She made you stay with her to look at the books. Time passed on, and eventually you found yourself reading too. \n\n\nIt was only a little after that that he showed up. Leather clothes fit around him, and his rugged beard made him look like a wild man. A barbarian of some sort. You hurriedly yanked Alessa to her feet and the both of you ran for your lives. He didn’t follow, and neither of you turned back.\n\n\nWhen you told your father about some strange man trying to kill you, he raised his eyebrows in disbelief. Alessa corroborated your claim, however, and the King formed a search party to find the stranger. You and Alessa stayed out of the forest with your mothers while your fathers led the search party. They took the better part of an hour searching, before they came back empty handed. They told you to stay out of the forest, but another meeting between you two was planned for the next day. \n\n\nThis time your parents weren’t present, and a guard was assigned to you two. One from the King’s royal guard and one from the Holy Order were always stationed with you. It was a week before you got the courage up to suggest going into the forest. When you finally did suggest it, Alessa agreed and the both of you snuck away from your guards. \n\n\nThe old cabin was there just like last time, but instead of marching into the cabin blindly, you and Alessa waited for the man to come back. When he finally came back you and Alessa spied on him nearly the rest of the day. Eventually the you returned to the guards and found them wondering where you were. \n\n\nEach day you and Alessa met, and this turned into a game. First, you would escape from your guard, and then you would spy on the enigmatic man. Back at the castle you and Alessa told no one of this, for fear of them ruining your fun.\n\n\nA couple weeks later the man finally caught you. You were in the middle of climbing your favorite tree when a spider of an absurd size climbed onto your hand and stung you. With a loud yelp you fell to the ground and passed out. \n\n\nJust thinking about it made your face red from embarrassment. Alessa later told you that the man took you inside and helped the bite on your hand heal, and even gave you medicine for the bruise that would soon surface on your head. You'd ruined the fun times of spying because you couldn’t stay calm around a spider. \n\n\nYou shake your head at your younger self, and then you shake your head at your current self. You shouldn’t criticize his past self too much, for it was because of that that you and Alessa were able to gain a friend. You glance over at her and find that she looks like she’s reminiscing as well. \n\nYou nudge her elbow before speaking, “We should get going.” \n\n\nAlessa nods, and you both start heading in the direction of that familiar cabin. ", "action_results": [{"action": "Continue", "result": "During all of the fun times you and Alessa spent in the man's cabin, neither one of you asked why he was there. The thought certainly crossed your mind, but you and Alessa entered into a bliss of sorts. You were afraid to ruin the friendly relationship you had with the man by getting on his bad side. After all, (well, at least in your experience) adults tended to anger quickly when questioned too often.\n\n\nThus you and Alessa enjoyed a period of unadulterated happiness...that you were sure was going to end today. As you grew older you began to question the man and his purpose even more. You mentioned it to Alessa, and while she was slow to agree, she eventually came around. She must have finally thought about the situation from someone else's perspective. Anyone else would have the guard chase down this stranger. Worst case scenario, the man could turn out to be some kind of serial killer. You doubted that he was, but there was always the possibility. \n\n\nYou hoped for the best, but feared the worst. That's most of the reason you carried the sword at your waist even though your Holy Order training was already over for the day. \n\n\nThe cabin came into your field of vision, and nostalgia cascaded over you. You stopped walking, and Alessa turned back to gaze at you. \"Are you ready? We don't really have to do this if you don't want to.\" Her voice was muddled with nervousness, and concern.\n\n\nYou could tell that she was hoping you'd turn back, and that you two could hang out without having to worry. You almost agreed with her, but you decided to do this. You were going to follow through with it. \n\n\nSome moments are seared in people's memories forever. Every one of your senses seemed to be extra sensitive. The sun was shining brightly through the trees above casting light that made you squint your eyes. Alessa stood half turned back to you with a question in her eyes. She was obviously waiting for you to continue moving. You look to the cabin ahead, and all of the warmth that you felt in the past dwindled away. In its place were ominous feelings of forbidding, but you gathered your courage and approached the cabin. \n\n\nAlessa knocks on the door, and you only have to wait a few moments before a muffled voice calls you inside. \n\n\nIf the outside of the cabin looked ominous, the inside was a picture of abnormality. Something was wrong. You could tell it from the moment you stepped into the cabin. You didn't need the door slamming shut behind you, or the crazed look in the man's eyes to tell you that much. He sat in a chair  against the wall on opposite side of the room. His wild brown hair was even more disorganized than usual. It fell across his face as he looked at the floor. \n\n\nA silent moment passed and the man began to speak. \"I know why you're here. I knew this day would come, but I didn't want to believe it.\" That part was directed at you and Alessa, but the part that followed seemed more like a crazed man's mutterings. And he never seemed crazed before.\n\n\n\"I wish I didn't have have to do this. I was content. Happy even. We were almost like a family. I felt needed, and not abused. Not like the people who use my name for evil purposes...\" His mutterings continue, but you've had enough. Enough of being here, that is. While you were prepared to deal with bad reactions, frankly you didn't think it would be this bad. You were getting really creeped out, and a quick glance at Alessa told you you weren't the only one. \n\n\nYou reached back to try the knob, but it didn't turn. You put more force into it, but still nothing. The man doesn't react, so you lose all pretenses of sneaking out. You throw your shoulder into the door, and it doesn't even quiver. Just as you begin to pull your sword from its sheathe, the man finally speaks to you two again.\n\n\n\"I'm sorry, but this has to be done. Alessa, Erron I hope you'll forgive me.\" He begins walking towards you two, and you decide that you don't want to know why he's sorry. You go ballistic and start hacking at the door, but after the first few swings you realize that it's not going to work. There was something otherworldly going on here and it was preventing you from leaving. Instead you turn back around and hold your sword the way you were taught. \n\n\nThe man nears the both of you, and you take the time to shout to Alessa, \"Get behind me!\" When you don't hear an immediate shuffling of feet, you turn and see her frozen with fear. At the same time you notice the man walking towards her instead of you.\n\n\nYou figure that somewhere inside each man there is a primitive instinct that overrides all self control. That instinct sends you rushing between the disaster that was surely about to occur. A couple things happen at once. Without your meaning to, your sword strikes the man's outstretched hand. And your body hits Alessa onto the ground behind you. Before you can check to see if Alessa is okay you notice the cut on the man's hand bleeding. But not just bleeding. Bleeding gold.\n\n\nYou barely have time to send up a prayer to the Creator before he speaks again. This time he seems to have some semblance of intelligence instead of his ranting. \"Alessa would have made a better choice I think, but I guess you'll do fine. I'll let you carry the blame for what's to come next.\" The man takes a deep breath and holds his hands out in front of him. This time that instinct doesn't come just in time. Your frozen in place, but to your surprise he doesn't touch you, or kill you or anything of the sort. \n\n\nInstead, two lights appear. With his palms facing up to the ceiling a bright white light appears in his right hand. A dark black light appears in his left hand. They both glimmer and shine alluringly, but for different reasons. You feel yourself drawn to the dark light, because of an eerie feeling of power. A power that you feel could bring you anything you ever wanted. The white light gives you a feeling of happiness. The power to endure and make it through anything that could ever come in your way. The power to obtain versus the power endure. You're enthralled. \n\n\n\"Now. Choose. Will you take this blessing,\" he moves his right hand forward, \"or this curse?\" He moves his left hand forward to punctuate the question. \n\n\nYou barely hear what he's saying, and you don't really get what he's saying about that dark light being a curse. How could it be a curse when it offers you so much power. Then again, the white light offers you security. You feel that you could protect anything, and get through everything that dared challenge you. You think of Alessa at that, whom is still sitting on the floor behind you dumbfounded. \n\n\nYou know you don't really have much of a choice here. Who knows what the man would do if you were to refuse? You have to choose one.\n\n\n \n\n ", "action_results": [{"action": "\"The Blessing.\"", "result": "\"Blessing.\" You whisper the words, and immediately the blinding light flies from the man's hand and into you. You don't feel any different at first, but as the seconds go by you feel yourself getting really tired. The fatigue spreads throughout your body and you know that at any moment you may pass out. The feeling reminds you of a story your dad once told you about him treading water for hours  at a time. He said afterwards that he knew he wouldn't be able to keep it up forever, but he would continue for as long as he could. \n\n\nYou sympathize with that thought as your body and mind betray you to their tiredness. When you finally feel as if you could not hold on any longer, you collapse to the floor beside Alessa. The last thing you see is the black light, the curse, flying from the man and into Alessa, and the man's face; a picture of sadness. \n\n\n \n\n~\n\n\n \n\nYou wake up hours later in the cabin. You peel your face of of the wooden floor and groggily rub your eyes. It takes you a moment to remember what happened, but when you do you leap to your feet confused. There isn't a single thing out of place in the cabin. You look all around for evidence of what you could've sworn happened here only moments ago, but you find nothing. Even your sword is back inside your sheathe. Nothing was amiss. Perhaps it was all a dream, you think relieved. \n\n\nWith a sigh and a shrug you brush the dust off of your clothes and open the cabin door. You remember the struggle you had with the man moments before, and you laugh to yourself. Leave it to your subconscious to turn one of your favorite people into a scary curse giving man with emotional problems. Although... you do wonder why Alessa isn't with you. You were supposed to meet with her in this cabin after all. \n\n\nYour don't think to much of it, for you finally realize the time. In the distance the sun begins to dip down into the gray blue clouds. It was sundown, the time time your parents require you to be home. You immediately break into a jog. You Father could be quite strict when it came to you. If he caught you coming back late, then he would surely punish you. \n\n\nYou jog into a relatively silent castle, although you hear sounds of eating and merriment coming from the main dining hall. As if to punctuate the point, your stomach rumbles in anticipation for dinner. Thankfully you only have to go up one staircase on the way to your room. You're careful to look through each hallway before entering in order to avoid a potential disaster with your dad, so in not too long you come to a solid oak door. Engraved on the wall beside it reads the name, 'Lucentia,' your family name. Without wasting any time you throw the door open and slam the door shut behind you. \n\n\n\"Erron? What are you doing back so late?\" You turn around to see your Father seated on at your desk with a grave look on his face. His deep authoritative voice is riddled with anxiety and subtle undertones of sadness. Something your dad rarely displays. \n\n\nYou begin to mumble an excuse about knight training, but your Father interrupts you. \"Never mind that. I need you to pack your things. We're going away for a while.\" The persona of a strong confident man your Father usually portrayed was gone. \n\n\nWhen you don't respond immediately, he raises his voice. \"Quickly now. We must be going!\" \n\n\nYou don't question him and immediately begin to pack your travel bags with necessities. You're at it for a couple minutes when you realize your Father had no bags with him. \"Did you already have your bags packed? you ask curiously. Any information you could glean from him would be useful. \n\n\nHe looks around for a moment confused. \"I must've forgotten to grab them. I'll be back, son. Stay here and pack. If I'm not back in fifteen minutes then go find Morden.\" He rushes out of the room leaving you even more confused than when you woke up in the cabin.\n\n\nYou shrug and obey him. Even at his worst he still knows more than you do. \n\n\nIt doesn't take you long to pack, and soon enough you're left waiting on your bed. A few long moments later you begin to hear shuffling outside, and shouting. You try to ignore it, but it soon grows to a point where you can't ignore it very well. That, and you're starting to get curious. The royal guards don't usually act so panicked, so maybe you should check it out.", "action_results": [{"action": "Sate your curiosity", "result": "Tossing your fathers wishes out the window, you crack the door open. If you come back in five minutes, then that should leave you plenty of time to find out what's going on. \n\n\nYou walk out of the door and into the stone walled hallways. You listen for a moment, then follow the sounds of shouting. As you near the source, other sounds enter the mix. The sounds of swords ringing and armor being torn fill your ears, and before you can turn yourself back you walk into the scene of the noise. Bodies of the knights of the Holy Order llitter the hallway floor. Royal guards stand amidst the corpses, while others drive their swords through the fallen bodies. Some dark liquid covers the cobblestone floor, and that same liquid is splattered across the walls. Blood.\n\n\nThe thought sickens you and you begin to retch despite not having had dinner yet. The sound draws some attention, and as you bring your head up from the ground your eyes meets with a dying Knight on the floor not to far from you. That knight mouths the word \"Run,\" just before his eyes lose the life in them. \n\n\nBefore you can really react to that you hear someone yell, \"There's the Assassin's son! Get him!\" You look up to find every royal guard with their eyes trained on you. Your instincts take over and you begin to run back the way you came. The sounds of metal boots hitting the floor echo throughout the hall behind you. Fear courses throughout your body, and you run faster than you ever have before. \n\n\nHowever, it's not enough. After only a few moments of running you hear a voice behind you yell, \"I've got him!\" You're only left wondering what he means for a moment, for right afterwards a javelin hits your shoulder. The force of it doesn't kill you, but it certainly sends you toppling to the floor. The pain is horrible, but luckily you don't have to endure it for long. A royal guard comes up moments later to finish the job.", "action_results": []}, {"action": "Stay in your room", "result": "While you're certainly curious about what all of the commotion is about, you trust your father's orders. He wouldn't tell you to do something without a reason, so you wait. \n\n\nAround fifteen minutes later your door is opened, but not by your father. Rather, it's opened by the General of the Knights of the Holy Order, Morden. His presence is intimidating, but from your experience he's always been more or less kind. At least when he's not giving you knight lessons. Then he becomes strict and commanding. You might be the Grand Priest's son, but that certainly won't stop him from going easy on you in lessons.\n\n\n\"Where's Father?\" You ask, but Morden ignores you and walks straight to the window on the opposite side of the room. You take the hint and stay quiet while he looks around. When he's satisfied he closes the windows quietly, then turns around to face you. \n\n\nHe speaks quietly, almost whispering, but his face tells you that the words he says mean just as much as when he would be yelling. \"Your father is outside. There was an assassination attempt on his life when he left your room, ands he's asked me to accompany you to meet with him.\" While he speaks, he gathers a quill with ink and scratches a message on a piece of parchment on your desk. \n\n\nIt reads, \"There are people outside the door. Say out loud that you need time to pack. In the meantime, gather these sheets and start tying them together. Don't be conspicuous.\" \n\n\nYou nod suddenly grateful for all of the lessons on reading you were taught. \"Give me a few minutes to pack my things, and then we can go.\" You say this and hope to the Creator that that your voice won't betray you. You don't say anything and Morden doesn't offer anymore information, so you both work quietly to construct a makeshift rope. Beneath the surface, however, your mind is racing to try and comprehend the situation. \n\n\nFrom the things that have been said, and the way your father has been acting you take it that there was, in fact an assassination attempt on your father. That would explain his nervousness, as well as all of the commotion outside. You briefly wonder why they haven't already barged into the room if they were waiting outside, but before you can come to a conclusion your thoughts go to you mother. Your heart skips a beat, and you quickly turn to face Morden. \n\n\n\"Where's Mother?\" You mouth, and Morden immediately looks away from you obviously avoiding the question. You stop working for a brief moment, for the severity of the situation suddenly hits you. That's why Father was hiding in his room. He was hiding from the guards whilst waiting for you to return from the cabin. They must have already gotten Mother. With that sobering thought tears come to your eyes, and you resume tyirng the sheets together.\n\n\nWhen you and Morden finally finish, he turns back to you and says aloud, \"Hurry up boy. We don't have time to waste.\" Then he immediately mouths to you, \"Your father will explain everything later.\" \n\n\nHe better, you think to yourself. Morden takes the newly made sheet rope and quietly opens the window. After a moment of securing the rope to one of your bed posts, he motions for you to climb down it. You hesitate for a brief moment, but remembering that your father is waiting you cast away your doubts and climb down the rope. \n\n\nFor the first time since you've lived at the castle, you've decided that you hate your room. As son of the Grand Priest, you were given one of the 'best' with a view worthy of kings. So they gave you a room on the second floor. You always just took for granted the view, and it never occurred to you that you might have to use this as an escape route someday. You remind yourself to have a room on the first floor next time you live in a castle. \n\n\nThe makeshift rope is sturdy enough, so despite your doubts you manage to climb down the rope without too much difficulty. Morden is different. He gets about halfway down the rope when you start to here the rope tear. The combined weight of his armor and a extremely muscled fully grown man were apparently too much for 'rope' to handle. It tears in half and send the armor clad General tumbling to the ground with a chorus of clanking armor. \n\n\nMorden is quick to get back on his feet, however, so he grabs you by the arm and starts to rush you off the castle grounds. It was luck that you had a window that led directly outside the castle. Once you and Morden have made it a fair distance away form the castle, you and Morden break into a run. \n\n\nThe familiar features of the castle grounds blur together in a seamless picture of grey and green. You really hope Morden knows where he's going, because you start to feel faint. Fatigue starts to hit you again in an all too familiar way. You remember your dream about the cabin, and have a brief hope that if this fatigue is the same, then perhaps this nightmare of escape is a dream as well. \n\n\nThe last thing you hear before you pass out is Morden's voice urging you to push on.", "action_results": [{"action": "Dreams", "result": "You're back in the cabin. Sunlight once again pours through the window, and once again the man stands before you. The choice is the same. Light is held in his right hand, and darkness is in his left. \n\n\n\"Which will you choose? Protection or power?\" Unlike the last time you saw him, the man seems to have regained his senses. His normally calm demeanor has returned, but his appearance is still that of an unkempt barbarian. \n\n\nYour gaze turns back to the balls of light, and you begin to reach for the man's right hand when you hear a voice. \n\n\n\"Give me the curse.\" Her voice is melodic and terrible at the same time. Melodic because her voice cleared your mind of the fog that made you think this dream was reality. Terrible, because you remembered what happened when you were last awake. Your Father was nearly assassinated, and you believe your mother was. You climbed out of your window... but you can't remember anything after that. Perhaps the feel of armor against your skin, or the faces hovering above you, but nothing definite. \n\n\nYou stop reaching for the blessing, and instead wipe the tears from your eyes. Out of the corner of your eyes you see the curse and blessing fly to whom they belong. You knew that yours and Alessa's fathers never really quite got along, but you didn't think the King would go so far as to assassinate the Grand Priest. Personal matters aside, this was an affront to the major religion of the entire continent. It was sure to cause an uproar.\n\n\nYou turn around to face the speaker at your back. \n\n\nStanding in the doorway is Alessa. Sunlight seeps in through the door and glances off of her hair giving her the appearance of having a halo. Her face is a mix of despair, and her posture reminds you of what yours must've been when you realized the chances of your mother being alive were low.\n\n\nUnder normal circumstances you would've been delighted to see her, but all her face reminds you of is the gall the King had to take your family away from you. \"Why did he do it? Why did your father kill my mother?\" You ask the question with your face a mask of sadness.\n\n\nAlessa looks shocked to say the least, but before she can respond, you continue. \"I don't know why I'm asking you. You're just some mirage my mind must've made up, and you're probably only here because whenever I'm at this cabin, you're usually with me.\" You start rambling, and although she certainly tries to say something several times, you ignore her. \n\n\nApparently it becomes too much for the dream Alessa, and instead of trying to overpower your voice with her own, she slaps you. You figured that since this is a dream it wouldn't hurt, but to your chagrin you are wrong. The force of the blow is more than enough to shake you from your rant, and you decide that this dream Alessa must have something important to say.\n\n\nYou weren't paying to much attention to her until now, but now that she's much closer you can see the tears in her eyes and the frustrated expression etched onto her face. \"First off, I'm the real Alessa.\" \n\n\nIt has to be a lie.\n\n\n\"Secondly, even if I was just a figment of your imagination...\" A sob interrupts her sentence, \"...are you seriously saying that you'd be this insensitive?\"\n\n\nYou flinch at that and look away. \n\n\nSurprisingly enough, Alessa reaches up, grips your chin, and faces you back towards her. As soon as she lets go, you turn your head back away from her. However you do take note of that. The real Alessa would've never done something so bold. \n\n\nYou hear a sigh of defeat, and the pat of footsteps on the floor. \"I'll be back when you're ready to believe me,\" Alessa says, but mutters immediately afterwards, \"i can't believe my Father thought I could trust you.\"\n\n\nIt's only when you hear the sound of the door close that you turn back around. You fall to your knees, and put your face in your hands. Too much was going on for you to think straight. If that really was Alessa, then you could already feel heavy guilt setting on your heart. But there was too much else going on. her father saying that she could trust you? as far as you knew her father didn't like you anymore than he like your dad.\n\n\nYou hear a sigh behind you. \"You two should really work together.\" It's obviously the man's voice, but when you turn around there's no one there. you sit there alone in the cabin, wallowing in your despair. It is then you decide that whoever took your family away from you...that person would recieve pain by your hands. No one harms your family and gets away with it.\n\n\n~\n\n\n\"He has to be blessed Cassius. There's no other explanation. You should be proud. Your son is the chosen of the Creator.\"\n\n\n\"I understand, But why now of all times, and why someone as young as him?\"\n\n\n\"I've heard rumors. They say that the princess is cursed. Perhaps the Creator gave us a Blessed One to combat her, A cursed One.\" The voice you don't recognize manages to fill as much contempt for Alessa as possible in that last phrase.\n\n\n\"Shush, I think he's waking.\" You figured you could fake sleep to hear more, but your father knows you better than you thought.\n\n\nYou open your eyes to the room beyond. White walls, and sheets cover every inch of the room. The only colorful spots are the two men at the foot of your bed. Your father on your right, and the stranger on the left. While they both have dark hair with a streaks of grey, the similarities end there. The stranger Is much more heavyset than your father. He looks like he spent a few too many times at the dinner table instead of exercising. Your father is slimmer than him, but doesn't quite have the muscular body he had in his younger days.\n\n\n\"Erron?\" Your father asks as your eye open fully. \n\n\n\"Father?\" You respond, or at least try to. Your throat is dry beyond belief. You feel you haven't had water in days.\n\n\n\"Get him some water,' your father commands the stranger before embracing you and smiling. \n\n\n\"What happened?\" you manage to croak out. \n\n\nYour father's joy at seeing you wake is replaced with a grim expression. \"Wait until you've had some water son. Then we can talk.\" \n\n\nIt isn't long before the one man walks back in with a goblet filled with water. You drink it greedily as your father begins telling you what happened. \n\n\n\"Things had been getting bad for a long time. You know the King and I didn't agree on a lot of things, but it goes beyond that. He was passing more and more restrictions upon the Holy Kingdom. I resisted as much as possible, but in the end my resistance only served as an excuse to get rid of me. As you can see, he failed.\" Sadness fills his eyes. \"Instead of killing me, he settled for getting your mother.\" \n\n\nSo it was true. However, your guesses did nothing to stop the tears from flowing down your face. \n\n\n\"When you were passed out for this past week, I was sure your mother wasn't the only loved one I'd lost.\" A week? There's no way. You only remember having the one dream, and even that dream didn't last that long.\n\n\n\"A week?\" you respond slowly before enjoying the last bit of water from the goblet.\n\n\nYour father nods. \"Yes, You were out for an entire week.\" A pained smile reaches tour father's face. \"But when i saw the mark, I knew you'd be okay.\" \n\n\n\"What mark?\" As soon as you ask the question you regret it. The stranger immediately goes on about how the Creator chooses people to serve him, and about the great honor it is. Your eyes start to glaze over, but your father manages to get the stranger to stop his lengthy explanation. \n\n\n\"That's the significance of the mark, but to answer your question, 'What mark?' I'm going to have to have you stand up son.\"\n\n\nYour legs are a little shaky from a week of no use, but you manage to stand up and go over to where your father is standing. He turns you around so that you are facing away from him, and he tells the other man to go get a pair of mirrors before addressing you.\n\n\n\"This is what the Creator has blessed you with.\" Your Father's hands brush the skin from your left shoulder to your right seemingly tracing lines onto your back. \"where I've touched is where the mark spans. You'll see in a moment what the Creator has given you. \n\n\nAs if on cue, the man from before comes into the room with the hand mirrors. Your father thanks him then takes them. With his help you position the mirrors at the best angles to allow you to glimpse at your back.\n\n\nGlittering lines of gold shine all across the top of your back. If you try to look at a single line you lose the picture, but when you try to focus on the elegant gold lines as a whole you see what it is meant to depict.\n\n\n\"The saving wings of the Creator,\" the man remarks. \"Said to only show when his followers are in grave danger.\" You continue to stare at the markings and marvel at how similar the wings on your back are to that of those of the Creator. \n\n\nYou begin to hear your father's friend launch into another lengthy description of the \"Blessed Ones\" but your father stops him short.   \n\n\n\"Let's leave him be. He needs more rest. He's only just now woken up.\" \n\n\nYour father makes a move to leave, but you stop him one last time. \"Father, can I go with you? You are going to fight back, right?\" \n\n\nYour father turns back around to face you, and examines you for a good few seconds before the stranger interjects. \"You can't possibly be considering this. Can you Cassius?\" \n\n\nYour father responds, \"Of course I can be. He's a Blessed One. Surely that fact will give our knights someone advantage on the battlefield. even if he is a mile away from the battlefield. And we can train him on the spot.\" \n\n\nYou smile and start to agree, but your father continues. \"But you might be of more use to us if you train here first, and then come help when you're ready. Here, as in the Academy of the Holy Order. It's a perfect opportunity to have you learn how to use your power as well. But, I'll leave the choice up to you. I believe the Creator will back any of your choices.\"\n\n\nYou aren't sure about all of 'Blessed One' stuff, but you do know that you don't want to be away from your father if he might need your help. You couldn't stand to lose another one of your parents. \n\n\nThen again, you also see the wisdom in waiting here and training before you go out onto the battlefield. You wouldn't be very useful if you died after all.\n\n\n ", "action_results": [{"action": "Go with your father", "result": "While you're sure the Knight Academy would increase your usefulness, you decide that you're more useful now than later. What if everyone you wish to protect is already dead by the time your prepared? Besides, your father did say that they could teach you on the way there.\n\n\n\"I'd like to go with you father.\" \n\n\n\"Alright son. Rest up. We leave at first light tomorrow.\" He pats you on your back, then leaves the room with the stranger. \n\n\nYou pack up your belongings, or at least what's left of them then leave to take a bath. You can't imagine that a week in bed does wonders for your hygiene. \n\n\nAfter that, you take a stroll around the Knight Academy. It is quite magnificent, and you're sure you would have had everything you needed had you stayed, but you've already made your choice. your place is at your father's side. The rest of the day goes fast, and before you know it you're already back in bed. One might think that a week sleeping would make it harder for you to fall back asleep, but soon enough you drift back into your dreams.\n\n\nYour dream is the same as it has been the last few times, except this time you're actually alone. No Alessa, and no shaggy haired man. Instead you go through your recent dreams, and a thought you shoved  to the back of your mind finally resurfaces. When your father and his friend were talking you connected the dots, but you didn't want to believe it. That yours and Alessa's friend was the Creator himself. It didn't seem likely, but neither didn't being hunted down until today.\n\n\nYou keep in in your head for when the piece of information might come in handy, and the next morning comes quickly. You and your father are allotted a wagon and several soldiers to ensure that you get to your forward camp safely. While waiting your father takes to teaching you the history behind 'Blessed Ones.' You learn that there role was to create peace on this world, and that often times they did so by focusing an evil foe. Most saw them as heroes, but you don't really understand why. The only thing people saw that was special about you was the golden mark on your back in the shape of angelic wings. \n\n\nBeyond that there was nothing else. These lessons continued for about a week before the unexpected happened. While gazing out the wagon window you see a glimmer out in the forest. you don't think much of it until you hear someone yell, \"Attack!\" All at once Dellandian soldiers start pouring out from the trees and to the wagon. Your own knights are heavily outnumbered, so you're father makes a split second executive decision. You both decide to run. \n\n\nYou make it around twenty steps before several arrows stick into your back killing you. you only hope that your father made it farther than you did.", "action_results": []}, {"action": "Enroll in Knight Academy", "result": "You hesitate while you think, but you answer before long.\n\n\n\"I'll stay here.\" Your father smiles, and it's obvious that he's very relieved at your choice. You imagine that a heavy burden must've been taken off of his shoulders. Here you would be safe. Here you wouldn't have to worry.\n\n\nYour father nods before turning to the heavy set man on his left. \"This is the Headmaster here at the academy. Headmaster Rallas. He's taught at this academy for years now,\" a slight smile breaks across your father's face, \"and despite his looks, he used to quite capable.\" \n\n\nHeadmaster Rallas scoffed at that. \"I'm still more than capable,\" he remarks before your father continues speaking. \n\n\n\"I'll be leaving in the morning, so it may be some time before i see you again, son. When I next see you, I expect to see a man grown and ready for anything. The Creator has blessed you as his champion, so you must prepare yourself to fulfill that demanding role. I'll see you again in the morning, but for now Headmaster Rallas will give you a tour.\" Your father embraces you, then walks out of the room leaving you alone in the room with Headmaster Rallas.\n\n\nHe regards you for a silent moment. \"You carry a great burden. If you're well enough I'll show you around.\"\n\n\nDespite the sleepy haze you've retained since you awoke, you nod and get up from your bed. You look around the room, and wonder why you're the only one here. This was obviously the Academy's infirmary and this was a fighting school, so surely there must be more people injured. You express these thoughts aloud to the Headmaster, and he smiles then throws an arm around you.\n\n\n\"You've got a good head on you. The academy is on break for another week, so until then, it'll be you, me, the  staff, and a rare few other students.\"\n\n\nYou nod and the Headmaster leads you out of the room. The halls remind you of the Castle back in Valium except that these were newer and more obviously centered around academics. The Headmaster leads you around, and before long you find yourself increasingly impressed with the facility. It's every bit as big as the castle, and the rumors you've heard about it do not nearly do it justice. \n\n\nThe Headmaster explains that aside from basic academics, everyone in the academy is taught how to wield a sword. Once a student finishes their schooling here, they begin their long noble service to the Grand Priest wherever it may take them. If even to death. You feel a sense of foreboding and briefly wonder how many knights died to help you escape Valium. \n\n\nThe Grand Priest finishes his explanation by telling you that at age sixteen every student is sorted into two more facilities depending on their aptitude for fighting. One is simply called Advanced Combat where the inhabitants focus solely on honing their skills in combat, tactics, and other such needs for war. The other school is called Support, which is more or less self explanatory. This school includes those training in the healing arts, organizational matters, but everyone one of them still is constantly trained in fighting. If the need ever arises, then those in both schools can form a force of a couple thousand, that is when all of the knights on missions are gathered in. Aside from the knights at the school, there are bases scattered around the continent each with a minimum number of five thousand strong. that is where the majority of your numbers reside. Apparently your father had been prepared for this, for you cannot imagine that the King would have allowed such an amassing of numbers to occur under his nose. \n\n\nOnce the introductions are over, the Headmaster leaves you to explore the facility whilst he claims that his work needs his utmost attention. You shrug and simply head off of in the direction of the armory. You didn't have much time to grab your sword when you left, so hopefully they could supply you with one. \n\n\nOn your way there you run into another student. You don't quite feel the want (or need) to converse with him, so you barely give him a glance. Despite your wishes, he moves in front of you effectively stopping you in your tracks. This was most inconvenient, because a staircase was not the best place to meet someone new. If it was someone younger, or even smaller than you then you may have pushed passed him. However, he was neither.\n\n\nHe was taller than you by a couple inches, making him around six foot, but that wasn't what stopped you. For someone who can't have been more than two years older than you, his frame filled his clothing and his muscles stretched the grey and black leather. He reminded you of Morden. He stood on the stair step right above you making his presence just that more imposing.\n\n\nAlthough you originally didn't want to meet him, you found yourself mildly interested. What did this oversized adolescent want with you? \n\n\n\"Are you Erron?\" his face was expressionless, but when you answer \"Yes,\" his face changes to that of contempt. \n\n\n\"You're the person that the teachers keep going on about? You barely have any muscle on you, and you look like you haven't ever seen a battle. The Creator should've chosen me, but instead he chose a scrawny piece of trash like you. I bet you didn't even have the guts to screw the princess while you were in that castle.\" \n\n\nHis voice is filled with mocking arrogance, and his insults, quite frankly annoy you. He had just barely met you, yet he acted as if he knew your whole story. His insults weren't even that good, but his attitude was certainly more abrasive than you could otherwise stand. You normally wouldn't even consider physical retaliation as a viable option, but his mention of Alessa tipped your judgment. She might be the daughter of a treacherous King, but she wasn't some cheap prostitute. \n\n\n ", "action_results": [{"action": "Ignore him and move on", "result": "While feeling tempted to show this peasant his place, you aren't that rash. If put to the test you figure you would have a high chance of winning in this fight. However, you don't think he got that muscular from sitting around doing nothing, and since this is an academy where people are being taught how to fight, so you assume he has more experience than you as well. Of course you were taught by the General himself, Morden, so despite the person's goading you push past him and continue up the stairs. \n\n\nOn your way past him he grips your forearm and speaks, \"Hey, don't leave when I'm talking to you!\" \n\n\nHe has a strong grip, but since you know how to get out of such a simple hold, you easily twist out and continue up the stairs. \n\n\nYou hear a string of profanity and calls for you to come back, but for whatever reason he doesn't come after you, so you continue to ignore him. It hadn't really occurred to you that there might some people that are jealous of you. Especially since you have no idea why they think you're blessed by the Creator. Certainly the mark on your back is indicative to the Creator's wings, but you're fairly certain that the Creator didn't just come down from paradise and bestow upon you the powers to govern his people on this world. No, you're fairly certain that this isn't the Creator's doing, and even more so when you remember your dream.\n\n\nIn the back of your mind things were already starting to make sense, but you didn't want to believe it. Somehow that man in the King's Forest was able to obtain power beyond your comprehension. Maybe he got it from the Creator, but regardless of where you are fairly certain that those years spent in the King's Forest were not normal. You thought it was odd when the guards couldn't relocate the cabin, but you always chalked it up to your superior tracking skills. Well at least until you learned enough to know that you were no where near as good at tracking as the royal guards. \n\n\nYou cast your thoughts to the very first 'dream.' If you recall correctly then you were actually confronting the man about his purpose in being in those woods. He'd mentioned about how he knew that day would come, and how sad he was. \n\n\nYou reach the Academy's armory, and you resolve to figure out what happened later. soon enough they find you a sword that's suited to your size and fighting style, and you leave with your mind still centered on weapons. You get the vague feeling that you were meaning to do something, but before you realize what it was, Headmaster Rallas shows up at the end of the hallway.\n\n\nHe's wearing the same grey and black material from before, but this time he has more of the stuff gathered together in his arms. You remember the other student you met, and realize that the Headmaster was holding some kind of student uniform. \n\n\n\"I'm sorry. I meant to give this to you before, but my attention was elsewhere.\" He shoves the grey and black uniform into your arms before reaching into a pocket and pulling out a key. \n\n\n\"This is for your room. We made sure to give you the best of the best.\" \n\n\n\"That's une-\" you begin, but the headmaster interrupts you. \n\n\n\"Nonsense. The son of the Grand Priest deserves the very best.\" \n\n\nYou hesitate before grasping the Gold plated key. Despite the unfortunate meeting in the hallway, you decide that you might very well get used to living here. \"Yes sir.\"\n\n\n~\n\n\nA few weeks pass, and the first battle happens. A messenger leaves you a letter from your father detailing what happened. It was mostly just the Knights testing the Dellandian army. It wasn't some crazy battle of massive proportions, but rather, it was a skirmish that didn't even contain a hundred men in total. While it wasn't the greatest battle, the Knights managed to beat the army with a combination of skill (from the individuals), and strategy. (from the different leaders) You find out that Morden is leading the charge against the corrupt royalty, and that in terms of skill, the Knights heavily outclass the army of Dellandia. You hope that superior strategy and skill will be enough, for the Dellandian army has the advantage in numbers. \n\n\nAside from that, the only important thing happening is the new term start for the Academy. No new dreams of the Man and Alessa happen leaving you with a relatively bored few weeks. You don't see the pretentious student from before, so you ended up spending most of your time staying fit and practicing your swordplay. You're in an almost feverish state, and your father and your friends only serve to make that fever go. Whether the mark you received was from the Creator or not, you feel your place is beside your father championing the cause of the Holy Kingdom.\n\n\nOccasionally you go to the library hoping to find information regarding this mark, and while there are a lot of history about what the Blessed Ones are, the texts never go into the differences between the Blessed Ones and other people. You're always left wondering if the mark is simply there to notify your enemies of whom to kill. \n\n\nThus, your thoughts are everywhere when you attend your first class at the Academy. The Headmaster had your schedule delivered to you earlier week with a note attached.\n\n\nIt read, \"Erron, enclosed is your schedule of the coming term. Seeing as how you were taught by the best while in Vailum, we've decided to put you in classes closer to your skill level. You will be surrounded by peer s who are older than you, and may even be jealous of you and your position. Heed them not, for  your position demands that you be above everyone else. You are held in a higher regard because of your blessing, so do not stoop down to the level of those who oppose you. Sincerely, Headmaster Rallas. \n\n\nYou take a deep breath and clear your head. The open doorway seems almost ominous in nature, but when you finally step through it, the classroom beyond leaves you astounded. Mostly because you've never really seen so many kids in the same location. The majority of the students are male, but you do see several girls around the room too. You do not see the teacher, so when you enter the room you try to sneak along the wall to an empty wooden desk. \n\n\nAlas, Your endeavor fails. It only takes a few seconds for someone to recognize you as the Grand Priest's son, so a fairly large group forms around you. \n\n\n\"Are you Erron?\"\n\n\n\"Can I see your mark?\"\n\n\nand\n\n\n\"Where'd you get that jawline?\" are only a few of the questions you hear.\n\n\nYou do your best to answer the questions, but luckily for you, the teacher steps into the room and tells everyone to go to their seats.\n\n\nThe teacher Introduces himself as Sir Kakanos, and he barely takes anytime before diving into the lesson. Your first class is history, and it ends up going fairly smoothly. Well at least for you. The rest of the class seem distracted by your presence, as if you're some kind of exotic animal. It's only when the student you met before walks through the doorway that the classes' attention turns away from you. \n\n\nSir Kakanos looks away from the class when he walks in, and gestures for the guy to sit. \"It's nice of you to join us Mr. Rallas.\" The Headmaster's son, you take note of that.\n\n\n'Mr. Rallas' walks to the seat designated, but takes a specific moment to look at you and stare you down. He doesn't have the same astonished and contempt filled expression as he did before. Rather it's blank, and you realize, with a start, that this guy wasn't just some brute filled with anger. No, if he had that much control over his emotions to begin with, then he was much smarter than you previously thought. If you allowed yourself to be angered back when you first met you might have been outclassed. \n\n\nThe class ends soon after that interruption, and you head to your next class. It turns out similarly, with the exception of the Headmaster's son actually being to his class on time.\n\n\nScience, Numbers, Battle Tactics, and Reading pass by fairly quickly and before long you're standing in a field outside the academy. Of all the classes you have, this is probably the one you look forward to the most. Advanced Combat. The teacher is a female Knight by the name of Sarrin. She's quite young. If you weren't her student, you might consider her beautiful. She quickly pairs off each the students there to \"see what each of you can do.\" \n\n\nYou're paired with a stocky fellow named David, and you start to spar with the wooden practice swords. It doesn't take you very long at all to best him, but David decides that he wants more. You happily oblige, for you haven't had a real opponent in a while. However, it soon becomes very clear that despite his two year advantage of age, you are the better fighter. \n\n\n\"Erron. Pair up Ashyr.\" You hear Miss Sarrin tell you, and before you can ask who she means, you see her pointing at the Headmaster's son.\n\n\nYou mutter a quick \"Yes ma'am\" and head over to your new opponent. Unlike your previous opponent, Ashyr stands a few inches taller than you. His hazel eyes regard you calmly, and he holds his practice sword carefully, lightly, as if the sword was his lover. The thought amused you, and you allowed a small smile to light up your features. \n\n\nYou ready your practice sword for battle. The space between you is filled with tension, and you start circling each other. For a fraction of a second you see his eyes shift to the contempt filled ones you first saw, but you don't have time to think about it, for Ashyr lunges. You react immediately by parrying, then you follow up with a counterattack of your own. He defends against just as easily as you did against him, and the both of you enter into a trance of sorts. Neither of you gain ground against each other, and each and every one of your strikes is parried or otherwise defended against. \n\n\nSoon enough you realize that this battle will be decided through endurance. The first person to slack off in their attacks, the first person to make a mistake, they will be the one to lose. You continue the fighting for a few moments longer before you realize that it would be you to make the mistake. While Ashyr showed hints of strain, he didn't look anywhere close to as tired as you were. You have to strike now while you still have the energy to do so. \n\n\nThroughout the fight, many different tactics have been employed. Given this, there are only a few things you think work. You haven't tried overwhelming him with power, so you might be able to take your opponent by surprise. The same principle applies to forcing him to grapple with you. If you get close enough you may be able to catch him off guard by tackling him to the ground. Of course, you could always wait for Ashyr to mess up. Maybe he feels more tired than he looks.\n\n\nIn any case you feel yourself beginning to tire, so you need to make a decision now.\n\n\n ", "action_results": [{"action": "Overwhelm him with attack", "result": "Ashyr is stronger, taller, and every bit as skilled as you. You don't think you'll be able to last for too long if you stay on defense. Tackling him might also have detrimental consequences. If you timed it bad then you could take a sword to the head. No, among the choices you figure your best one is to overwhelm him with attacks.\n\n\nWith a sudden turn of luck you parry a blow, and Ashyr decides not to pursue attacking you. Instead you start circling each other again. You're grateful for the time to rest before you begin your attack, but Ashyr doesn't seem to be thinking at all about his energy. Instead his eyes are focused on you with a puzzled look in his eyes. You guess no one has ever lasted this long against him.\n\n\nBy now the sun's heat has your body beginning to wear down, and your fatigue must show, for Ashyr smiles a triumphant smile. Immediately afterwards, he surges forward with an overhead slash.\n\n\nBut you're ready for it. You surge forward as well and parry his attack on your way. You leave him no time to counterattack, but instead press the advantage created by surprising him with your ferocity. For the first time since the fight started, you seem to have a clear advantage. Every attack Ashyr blocks is a step he is forced backwards, and before long the smile he had disappears from his face. Replacing it is a face contorted in concentration, and Ashyr finally seems like he the exertion is getting to him. \n\n\nHowever, you also feel your fatigue. You begin to slow down in your attacks whilst Ashyr's blocks pick up in their efficacy. Instead of barely being able to keep up, Ashyr is now blocking each attack with an attack of his own. It isn't long before you realize that you're going to fail. One of these moments you won't have enough energy to meet his attack with your own. One of these attacks you simply won't be able to raise your sword to block his. \n\n\nThe moment comes in the form of another overhead slash. Ashyr uses his height and superior strength to increase the attack's power, and you realize that he means to end the fight with this attack. You have no time to dodge and you feel like you don't have nearly enough energy to raise your sword, let alone enough to block the monstrous attack. Nevertheless, You push your arms with all your remaining strength to meet his attack with your own. Your thoughts aren't even centered upon winning the fight in that moment, rather, they're centered on making sure that that attack doesn't hit you. They're centered on protecting yourself. \n\n\nAs you bring your sword up, you feel a surge of energy resonating from your shoulders. It strengthens your body and fills your arms with power. Your sword clashes with Ashyr's, and the power behind your hit was so powerful that it knocks the wooden sword clear out of his hand. There's a moment of stunned silence all around, and in the back of your mind you realize that the other students must've stopped their sparring to watch, but your mind isn't on that. Instead the power you feel brings a grin to your face. It contrasts greatly with Ashyr's expression when you bring your sword to rest beneath his chin.\n\n\nThe changes in Ashyr's face come quickly, so if your weren't already looking at him then, you're not sure you would've noticed. Astonishment first, but rage soon followed with mixes of despair and vengeance coloring his eyes. You even thought that there was some respect there, but the moment of conflicting emotions passed. Back was his calm facade; the mask he wore was impressive, and if you hadn't seen it off when you first met, then you might really think that this calm demeanor was really him. \n\n\nYou hear hushed conversations among the remainder of the students, and soon enough Miss Sarrin shouts at everyone. \"Get back to sparring everyone!\" \n\n\nYou lower you sword and Ashyr takes a hesitant step. Then another. Before long Ashyr is heading off the field, and not much more time passes until he's out of sight. \n\n\nYou take this opportunity to rest. The fight was certainly much more difficult than you anticipated. You're sure you would've lost if you had not found that reserve of energy. Heat still resonated from your shoulders, although it certainly was much less noticeable than it was a few moments ago. \n\n\nYour rest only last for a few minutes before Miss Sarrin approaches you. \"You're one lucky kid. Without that blessing you would have spent the next few days in the infirmary. Ashyr put enough force into that last attack to give you a concussion.\"\n\n\nWhat blessing? Your tired mind thinks before realizing the importance of what just happened. It makes sense to you all of the sudden, for you recall the moment of the last attack. You were only seeking to protect yourself. It couldn't be a coincidence that The Man told you the blessing would give you the power to protect yourself. You'd been wondering what all the fuss about the blessing was for. After all, it wasn't until now that the so called \"blessing\" did anything except give you a cool mark.\n\n\nYou only nod in response. You don't really have anything to say, and besides, you'd rather take this moment to think upon the implications of what you just discovered. \n\n\nUnfortunately Miss Sarrin doesn't allow you to sit while everyone else spars, so she tells you to stand up and ready yourself. She spars with you for most of the remainder of class, but try as you might, you aren't able to beat her and you aren't able to activate your blessing. \n\n\nClass ends and Miss Sarrin pulls you aside. The rest of the students file off the sparring field until it's just the two of you standing there. She speaks first. \n\n\n\"Do you want to know how to control your power?\" \n\n\nThe question surprises you to say the least. \"Yes, of course.\" You reply immediately. While you've been able to keep your emotions in check for most of your stay at the academy, you still feel the smoldering of anger and sadness at your mother's death. If there's any way you could learn to use the power to help you become stronger, then your answer will always be certain.\n\n\n\"It will take a lot of training. Not to mention a change in your mindset. any more questions?\" she asks. \n\n\nYou raise an eyebrow at the 'mindset' comment. \"Only one. How are you qualified to teach me?\" You figure the question is necessary. You don't want to commit to learning if you're being taught by a teacher who doesn't know what they're doing. \n\n\n\"That's not something I am willing to tell. Go get some rest. From tomorrow onward, you'll be learning about this gift you have.\"\n\n\nYou're about to insist upon her giving you a straight answer when you realize that she's right. You do need rest, and tomorrow is another day. \n\n\n \n\n ", "action_results": [{"action": "Continue", "result": "At age sixteen you are the youngest person to attain knighthood from the Academy for Advanced Combat. The AAC. When you were at the Knight Academy, you were placed two years above your age group to compensate for the learning you received while in the castle at Valium. Because of this, you graduated to the AAC at a record age of fourteen years old. Which was even more prodigious then Miss Sarrin's feat of graduating at age fifteen. (You like to remind her of that whenever you get the chance to)\n\n\nThe AAC didn't pose much of a problem to you in regards to practically anything. Many classified you as a prodigy beyond all others, and as such you excelled at everything the AAC had to offer. You have a natural mind for strategy, tactics, and fighting; so much in fact, that many believe you will surpass Morden before you reach the age of twenty five. \n\n\nRumors of you spread at an alarmingly rate, and just before you graduated from the AAC, people came to know you as the Chosen Hero. A man of great regard that surpasses all who contend against him, and a man that would come and tip the war in the favor of the Holy Kingdom. (For the death of the King barely tipped the scales at all. In fact, some think that it only served to enrage the Dellandians and their supporters.) You had no control over the rumors, and they ended up being blown out of proportion. Ever the opportunist, your Father had Headmaster Rallas directed the rumors into propaganda of sorts. Essentially, they used your image as a rallying point for those eager to fight in support of the Holy Kingdom. And the Creator knows that the Holy Kingdom needs all the help it can get.\n\n\nYou tolerated the increase in attention towards, but when it got to the point where Academy students simply stopped in the hallway to stare at you, well it was a little too much. \n\n\nYou mentally shrug as you make your way to Headmaster Rallas' office. Raven walks beside you, who you can tell is enjoying the attention garnered from being beside you. As for why you were even back at the Academy... you weren't told much. The Headmaster at the AAC, Headmaster Farid, only told you that Headmaster Rallas needed you and Raven immediately. To quote, \"Headmaster Rallas needs to see you immediately. Besides, your fan club deserves to see you every once in a while.\" \n\n\nYou had rolled your eyes at that one. It was interesting thing. The kids at the Academy admired you, and went to great lengths to make sure you were always welcome there. It was a nice gesture, but all too often you felt turned off from all of the attention. Especially since you think that you wouldn't be getting nearly as much attention had you not been blessed by the Creator. (Ironically enough, you still weren't sure if that man was the Creator. Specifically because you know he was also the one that cursed Alessa. You don't mention this to anyone though. It would cause an uproar that's altogether unecessary.) \n\n\nThe only other times you come back here are when you want to see Miss Sarrin. You ended your lessons with her when you graduated, and the both of you left on good terms. You still don't know how she knew what she knew, but you're eternally grateful regardless.\n\n\n\"What do you think he wants us for?\" Raven says to you, as the pair of you make your way up a flight of stairs. \n\n\nAfter that first year of solitude at the Academy, Raven and you became fast friends. You ended up gaining other friends too, but none were as close as Raven, or Miss Sarrin for that matter. You crush on her faded off sometime last year, around when you and Alessa met in a dream for the second time. Ironically you think that your lack of interest in her caused her to be more interested in you. Of course it could just be your dazzling fame. \n\n\n\"I have no idea. I haven't talked to him in ages. My first guess was that he'd be giving us a mission, but Headmaster Farid is usually in charge of those, especially since we haven't had our first mission yet.\" Headmaster Farid had a longstanding tradition of presenting each new graduate with their first mission. Graduation was after the first two years in the AAC, but each student stayed enrolled until two more years passed of just missions and other tasks. After that, AAC students finally became true \"Knights,\" and were assigned to an area somewhere in the continent of Dellandia. This being war time, however, caused most of the knights to be on the warfront instead. \n\n\nRaven nods in response, but doesn't say anything. The both of you walk in silence the rest of the way whilst attempting to ignore the occasional gawping student.\n\n\nEventually the two of you come before two oak wood double doors. They were stained black with the handles grey, the colors of the Knights, and you don't even hesitate before knocking on the door. \n\n\nAlmost immediately you hear Headmaster Rallas' muffled response telling you to come in. You and Raven walk in the room and take in the surroundings. The Headmaster's desk sits as the centerpiece of the room with papers messily scattered all atop it. A bookshelf stands to your left, and maps stretch across the wall to your right. You've always heard about the Headmaster being very capable in his younger days, but you can't help but think he looks more scholarly then anything else. \n\n\nHe sits behind his desk facing the two of you. The only oddity in the room takes the form of a tall man. You immediately recognize the uniform and armor as being that of a tru knight. It's quite similar to what you have on with the exception of an extra insignia signifying that he had gone through his full four years of the AAC. A messy mop of golden blonde hair frames his roguish face, and his stubble accentuates this. \n\n\nYour first impression of him makes you want to keep your coin purse tied much tighter to your belt. Your second impression, however, leaves you certain that this is a good man. His roguish persona is all but gone when he smiles and extends his hand towards you. It's an honest smile that reaches his eyes. You immediately feel like you can trust this man. \n\n\n\"I'm Vitre,\" he tells you and Raven and you all exchange greetings before the Headmaster has you sit down.\n\n\n\"Time is of the essence. I've already briefed Vitre on the situation, but let me catch you two up as well.\"\n\n\n\"Catch us up as well?\" you ask. \n\n\n\"Yes,\" he waves the question aside as if you should already know what he's talking about. \"I need you two to go on a mission with Vitre.\" \n\n\nHe pauses for the slightest moment to make sure no one else was going to interrupt him before he continues. \"You two are here because I've received direct orders from the Grand Priest to include you in on this mission. Specifically you Raven, because the Grand Priest asked that someone Erron knew well be included on this.\" Headmaster Rallas shifts his gaze to you. \"You'll find out why you're here soon enough.\" \n\n\n\"A little less than a week ago your father caught a group of royal guards on patrol. He managed to capture them and take them prisoner, which, you all know, is not an easy feat.\" \n\n\nYou nod readily. Of all the people in the Dellandian royal army, the royal guards are the most skilled. It's been speculated that though miniscule in number, the royal guards are even more skilled in battle than true knights.\n\n\n\"But your father managed to do it. The odd thing was trying to figure out why they were so far from Valium. It took a few days, but your father and his aides managed to pry some information out of them. The princess has gone missing.\"\n\n\nYou register that thought for a solid moment. Alessa is missing... \n\n\n\"After a bit more prying, he managed to find out the date she was gone as well as the likely place she's headed. Long story short, we need you three to find the princess and bring her in alive. Or dead if she struggles.\"\n\n\nYour heart nearly stops in your chest. You figure that something like this might eventaully happen, but certainly not so soon. \n\n\n\"Erron. Your father realizes that two of you were friends in the past, and that you may be liable to sparing her.\" \n\n\nYou make it a point to raise your eyebrows in disdain. You don't want them thinking thst this was true. \n\n\n\"Therefore your father has offered you an alternate choice. If you feel you can't complete this mission, then your father has requested that you join him on the battlefield.\" \n\n\nEver since that fateful day nearly four years ago, you've wanted to join your father in taking the battle to the Dellandians. Now the opportunity was in front of you, and you find yourself not sure what to do. \n\n\nIf what they say is true, then your closest friend is in trouble perhaps even in a life threatening situation. You find yourself worrying about Alessa probably more than you should. If you do go on this mission, and find her, then the other will expect you to kill her. On the flip side, if you don't go, then you won't be able to help her. On the off chance that you find her, and the two of you are alone, then you think you could do wonders for helping her. Of course that would also mean betraying your father to a degree, but you don't really think that Alessa is much of a threat to the Holy Kingdom. Deeper down, however, you have a selfish need that wants her to stay alive. You don't want the person that understands you best to fall prey to your allies. \n\n\nThen again, Alessa does have that curse, and if you're anything to go by, it is quite the power. And that's leaving out the fact that Alessa might not even be there in the first place. Any number of factors could contibute to her not being at the expected place, and you aren't particularly inclined to waste the next few months chasing someone that might not even be where you're looking. Of course, your father may also need you on the battlefield. You could list off several ways that you'd be of service. \n\n\nA moment of silence passes and the three others in the room look at you expectantly. \n\n\nYou nearly laugh out loud. While your father is important to you, you know he can wait a month or two more for you to get back. There's only one real choice. ", "action_results": [{"action": "Accept the mission", "result": "You'd rather be safe than sorry. What if you decided not to go, and they end up capturing her? You'd probably want to help her, but at the same time, you wouldn't want to betray your allies. A situation like that could only end in disaster. Instead you would go to the designated location and hope to find her by yourself before anyone else is able to get to her. \n\n\n\"I'll accept the mission.\" \n\n\nThe Headmaster raises his eyebrows in surprise. \"You're braver than me. I'm not sure I would have been able to make the choice you just did had i been in your position. Alright then. Vitre, I'll leave the details to you. Just know that you need to leave within the next few days.\" \n\n\nWith that the Headmaster dismisses you. Vitre walks ahead of you two and motions for you to follow after him. Luckily, the Academy students are all in classes, so there's no one left to gawk at you. Vitre leads you and Raven down a few hallways, and before long you can guess where he's taking you. \n\n\n\"Are we headed to the library?\" \n\n\nVitre nods. \"There are maps there.\" His deep voice speaks quietly as if afraid that speaking in a tone larger than a whisper would interrupt classes.\n\n\n\"I wonder if Headmaster Farid is upset. I'm sure he was looking forward to assigning the chosen hero his first mission,\" Raven comments to you whilst giving you a slight push with her arm. \n\n\n\"I'm sure he'll be fine.\" You don't continue the line of conversation she tries to start. Your thoughts are pretty much exclusively centered on how in the name of the Creator you're supposed to find Alessa. Well, not only find her, but also make sure everyone else doesn't find her. Vitre, however, speaks again effectively ruining your train of thought. \n\n\n\"Does he really still insist on giving every new grad their first mission?\" \n\n\nRaven answers, \"Yes, he does. Honestly, I'm not sure how he does it. Ever since the war started there's been way too many people waiting to receive their first mission.\" \n\n\n\"He probably just sends most of them of to the warfront for their first mission,\" you comment. \"You could consider us lucky that we don't have a mission like that.\" You aren't too sure you consider yourself lucky, but if you were Raven, then you don't doubt that she'd rather be finding a lost princess than fighting a war. \n\n\n\"I'm not so sure about that.\" Vitre responds. \"If this princess really is a Cursed One, then we could be in some serious trouble. That's probably one of the main reasons your father wants you here with me.\" \n\n\n\"Why you?\" Raven asks almost immediately. You have to admit that you were curious as well. You know why you and Raven were chosen, but you had only just met Vitre. \n\n\nHe shrugs. \"There isn't really some grand reason for it. I just happen to have a lot of experience in hunting people down. It makes me the ideal person to lead you two. Especially since we don't need some insanely good fighter. We are only hunting a princess. She probably hasn't even touched a sword in her life.\" \n\n\nYou knew this was false, but you didn't really want to comment. Let him think that Alessa is incapable. It'll be easier for her to avoid capture that way.\n\n\nThe three of you reach the library to find it mostly empty.  A few academy students sat at desks doing classwork, but fortunate for you, no one is anyone near the map section. \n\n\nThe area isn't particularly large, but it's more than enough to suit  your needs. Perhaps the most notable feature of the area is the massive wall map. It's position on the wall allows for many people to look at it without crowding it. The map itself is double your height and is about the same length from side to side. After a quick once over you realize it to be a map of the continent. It was fairly recent, and someone even updated it to show which cities are under Dellandian control, and which are in control of the Holy Kingdom.\n\n\nIt's this map that Vitre stops in front of. \n\n\n\"This is where we'll be going.\" He points to the very bottom of the map, specifically at the city of Aeors.\n\n\nYou remember the city from your history classes. Back before the Dellandians and the Holy Kingdom conquered the continent, this was the largest city, and the last one to fall before the Dellandians might. This was largely due to the fact that an army the size of the Dellandians was very difficult to provide food and drink for, but even harder when attempting to take a city in the middle of the desert. \n\n\nWhen you and Raven don't say anything, Vitre continues speaking. \"Aeors has always been fairly removed from the events on the continent, and even now they don't offer support to the Holy Kingdom or Dellandia. This makes it a nearly perfect place for people to want nothing to do with the war to move to. We surmise that the princess noticed this, and headed south so she could reap the benefits of relative neutrality.\"\n\n\nYou're about to interrupt him to tell him that that isn't much to go off of, but he raises his hand to stop you. \"We also have reports telling us that she was last sighted heading in a southward direction.\" \n\n\nRaven speaks this time. \"If others saw and recognized her, then why didn't they already bring her in?\" \n\n\n\"I mentioned it briefly before, but there is a strong possibility that this princess is a cursed one. Every time one of our own went to apprehend her, they only remember speaking to her as if they were old friends. Apparently, whenever someone enters her presence they forget why they approached her, and she uses her cursed powers to confound them.\" \n\n\nYou nod in agreement. You do remember how easily you were swayed in your dream. \n\n\nVitre continues to speak about the mission detailing how we would recognize her, which you already knew, how long it would they were to stay in Aeors, and other such information. Before too long, he finishes his debrief of the mission and everyone returns to the temporary rooms at the academy. \n\n\nWith your thoughts a mix of worry, determination, and fatigue you go to sleep. \n\n\n~\n\n\nThe next few days go by fairly quickly, and you find yourself on the road for the first time in while. Years in fact. You weren't really permitted to take lengthy trips during your years of schooling, so your last trip of moderate length was when you left Valium. \n\n\nThe first few days of the trip go by almost quickly, but with each passing day thereafter, you begin to feel like it's taking forever. You tend to stay silent for most of the trip, but Raven decides talking is much more preferable to silence. After the first few attempts at talking to you either fail, or end in uninteresting conversations, she decides to talk to Vitre. It goes fairly well for her, and the both of them get along famously for the remainder of the trip. You think you see Raven making eyes at Vitre, but you chalk it up to motion sickness.\n\n\nAs the days go by, the terrain changes and you begin to see progress being made in your trip. The surroundings go from green to brownish yellow, and you start seeing more and more sand replacing the trees. Eventually you get to the point where the three of you are wandering through the southern deserts of Dellandia. They're the only real obstacle that lies between you and Alessa. \n\n\nThe desert is hot, arid, and leaves you wishing for water often. Luckily for you, Vitre planned the trip well enough to take a route following a river. \n\n\nSeveral more days pass, and Vitre finally talks about strategy. \n\n\n\"How do you two think we should go about finding this lost princess?\" \n\n\nYou'd been waiting for this. This conversation was the key to achieving your goal of helping Alessa. Had you brought it up yourself, and then mentioned your plan, Vitre might've gotten suspicious. \n\n\n\"Well, we know her appearance. Her hair is supposed to be pretty distinct in Aeors. If we patrol the area, and can just find her, then I think I can apprehend her.\" \n\n\n\"What do you mean by 'I can apprehend her?' You don't seriously think that you're going to take her on alone, do you?\" Raven questions you with a surprised look on her face. \n\n\n\"Of course I do,\" you respond cheerfully. When you see Raven about to object again, you continue. \"I'm the only one who can do it. I am blessed by the Creator himself. I probably won't be affected by her black magic.\" You sound silly to yourself, but Raven takes your words completely seriously. \n\n\n\"But she's a cursed one!\" \n\n\n\"That's even more of a reason for me to do it alone. What if she takes one of you hostage through her powers? That'd complicate things considerably. I'm not sure I'd even be able to rescue you if it came to that.\"\n\n\nThroughout this back and forth, Vitre stayed silent, but takes the momentary lull in conversation to interject. \"He's got a point Raven.\" \n\n\nYou allow yourself a small smile. If Vitre liked your plan, then you're quite certain that the two of you could convince Raven. However, your smile disappears when you hear what he has to say next. \n\n\n\"That being said, Aeors is not the kind of city we need to wander alone in. You're liable to get stabbed, robbed, and you're body desecrated if you wander alone. While I'm sure you're quite capable of defending yourself, I'm not convinced wandering around alone is the best idea.\"\n\n\nYou think he's probably exagerating, but you do see his point. Regardless of that, however, this was Alessa you were trying to save. You doubt that you'd get an opportunity to talk with her alone if you all patrolled as a group together, and you sure didn't want to find her when you're with the two of them. \n\n\nYou still wonder if Vitre is right though...", "action_results": [{"action": "Concede the point", "result": "A heavy sigh escapes you. \"I guess you guys are right. Even if I had you two trailing behind me, it would still only take a moment to stab someone, so I could be dead before you guys come to my aid.\" You say that, but you still wish that you were going at it alone. You'd just have to find some other way to contact Alessa. \n\n\nVitre nods his agreement. \"We'll find clothes there to disguise ourselves with, and then we'll patrol the city several times. If we still can't find her, then we can consider another option. Any questions?\"\n\n\nRaven and you shake your heads, and your trio continues onward. \n\n\nIt's a few days later when you finally come upon the city of Aeors. Walls of hardened sand surround the entirety of the city, and towers line either side of the main entrance. As you arrive, the sun dips beyond the walls and casts a welcome shadow over you and your companions. You continue to follow the river until you three approach the gate, then Vitre surges ahead of you and Raven. \n\n\nHe approaches one of the two guards standing beneath the gate. After a muted conversation and a few coins exchanged, Vitre motions for you two to follow him into the city. You glance around and are surprised to see that the river flows under a section of the wall and into the city beyond. This sparks a memory from your history class back at the academy. \n\n\nIt was in your first year that you remember learning about the city of the lake. A city that was founded entirely around a lake and the resources that came from it. Supposedly the city was able to sustain itself entirely of the agriculture, water, and meat that came from it. \n\n\nYou and Raven pass through the gate and form up beside Vitre. If the view from the outside was impressive, then the view from the inside was magnificent. Sunlight falls over the tops of the sandstone buildings creating a dynamic contrast between sunlight and shadow. You continue to follow Vitre through a maze of roads until you come upon a tavern. Raucous laughter emanates from the inside, and for the first time since you went on this trip, you find yourself in a somewhat familiar atmosphere.\n\n\nVitre casts sidelong glances at the two of you that seem to say \"here we go.\" With that encouraging look, Vitre pushes open the worn door open and steps into the tavern. You and Raven follow moments afterward.\n\n\nThe interior of the tavern is lined with torches, and the walls, floors, and ceilings are all made of polished sandstone. It's looks kind of odd to you, but everyone else seems to not care. Wooden tables are strewn about the room along with people of every type. You examine the room carefully, first to see if by some crazy chance Alessa was there. Second, to see if there was any danger in the immediate area. Aside from a few shady people in corners, no one pays the newcomers much attention. \n\n\n\"Wait here, I'll go fetch us rooms.\" Vitre goes off to the bar to secure lodging leaving you and Raven alone. \n\n\nYou sneak a glance at her. Her skin has started to tan, and there's a tired look in her eyes, but other than that (and of course her getting more... developed) nothing has really changed since you first met her. Despite your expert glancing, she catches you looking at her and raises an eyebrow. \n\n\n\"Staring at me at a time like this?\" A smirk follows the comment and you scowl.\n\n\n\"I wasn't staring,\" you object. \n\n\nShe laughs lightly, and you find yourself suddenly embarrassed. \n\n\n\"I'm glad you decided forget about that crazy idea you had,\" she refers back to you wanting to look for Alessa alone. \n\n\n\"It wasn't that bad of an idea,\" you point out. \n\n\n\"It was a bad idea to me.\" She sees you with a confused expression on your face, then she hesitates. She seems to be debating on whether or not to say something\n\n\n\"Erron, I'm sure you know that I've liked you for some time now...\" she trails off leaving you with a surprised expression on your face. Not surprised about her feelings, but about the fact that she had the courage to say anything. Especially since you hadn't given her any signs her feelings were mutual.\n\n\nRaven then looks you in the eyes. You are a few inches taller than her despite the two year age difference, so your eyes lock onto her deep brown eyes fairly easily. \"I'm not sure what I'd have done if you'd gotten killed because of your plan, but I do know one thing. My heart would be broken without you.\" \n\n\nThe sudden confession leaves you slightly flushed, but you maintain your cool. While she was confessing she inched closer to you, and now she gazes at you expectantly. Her lips are parted, and her face is even more red than yours.\n\n\nYou can tell what she wants.", "action_results": [{"action": "Kiss her", "result": "You are happy to oblige, for her confession sparked the old crush you used to have on her. Those old feelings resurface, and you realize that they were never really gone on the first place.You lean down and press your lips to hers. \n\n\nYou haven't really had much experience in the past with kissing. None if you don't count the dream kiss with Alessa, so you aren't quite sure what to expect. Her lips are almost deliciously soft. Almost because her lips are a little cracked, but you don't really blame her. After all, your lips are probably in worse condition. \n\n\nThe kiss keeps going for another five seconds or so before the denizens of the tavern start to take notice. When they do start to take notice, many laugh it off and chalk it up young people's hormones. Others look longingly at the two of you wishing they were entrapped in such an enthralling relationship. \n\n\nYou don't take note of either, however, for you happen to be occupied at the moment. \n\n\n\"As much as I'd like to stand here all night, and have people take bets on which of you would run out of breath first... I'm sure you can continue this after we've put our things in our rooms.\" Vitre looks around the room somewhat worried. \n\n\nYou break away from Raven and take a couple of deep breaths. Raven does the same, and the both of you follow Vitre up the stairs to the living floor of the tavern. \n\n\n\"I'm glad I got separate rooms. I'd hate to have to bunk in the same room as two sexually heated teens,\" Vitre comments idly. The way he put it leaves you more self conscious than you normally are. You're sure Raven feels the same way.\n\n\nVitre stops in front of a room, and hands you a key. \"I'm in the next room over. I don't care what you two do tonight. Just be ready in the morning to begin our mission.\" You and Raven nod absently. You hear Vitre mutter something about sex being the weakness of Knights just before he leaves the two of you to go to his own room. \n\n\nYou put the key in the keyhole and fumble with the lock for a few seconds longer than normal before you get the door open. You barely manage to pull the key out when, Raven tugs on your other hand to pull you into the room. You hadn't given too much credence to Vitre's comment of sex, but when you look into raven's eyes again, you know that there's only one thing that such fevered feelings could lead to tonight. \n\n\nYou find yourself kissing again, but for much longer. Actually you delay ending the kissing for as long as possible, for you aren't really quite sure what to do. If you didn't really have much experience with kissing, then you had absolutely no experience with this kind of intimacy, and you really didn't fancy asking Raven what to do. \n\n\nDespite your best efforts, when Raven breaks away you find yourself more than ready to be embarrassed. After a few moments of shedding clothes, you find yourself wondering what to do next. Luckily, (or maybe unluckily?) Raven knows what she's doing, and helps you get to where you both want to be. \n\n\nThe whole process is pure ecstasy for you, but you find that it ends all too quickly for you. Raven doesn't seem to mind though, so you shrug it off. You both lay under the covers breathing heavily. Your arm holds her close to you, and she uses the position to lean in and whisper into your ear. \n\n\n\"I love you.\" \n\n\nMaybe it's because of the heat of the moment phenomena , but you respond in kind, \"I love you too.\" \n\n\nSilence ensues and Raven falls asleep. Soon afterwards you find yourself drifting off, and your last thoughts before you go to sleep are you hoping that this relationship won't change between you two. \n\n\nFortunately your wishes come true. Unfortunately, this is because you are so tired that you don't realize the intruder enter the room. You and Raven die in your sleep from slit open throats. ", "action_results": []}, {"action": "Don't kiss her", "result": "Despite having cracked lips, you want to kiss her. You feel an inkling of the crush you used to have start to her come back, and then you nearly kiss her regardless, but you manage to stop yourself. \n\n\n\"Raven. Whatever you feel for me, see if you still feel it for me later. When we aren't on the cusp of life or death situations. Maybe then I can see how I feel about you.\" Disappointment flashes across her features. \"Until then, I don't want to be distracted by you.\" \n\n\nYou feel that you didn't really choose the best set of words to say, for now disappointment and hurt color her features. You mentally wince at the awkward tension you feel building up, but thankfully Vitre saves you from braving it alone. \n\n\n \"We'll have two rooms here for a week. If we haven't found her by then, then we can pay for longer. Agreed?\" Raven nods slowly. Certainly not in her usual jovial manner. You nod as well, and Vitre looks back and forth between the two of you with a knowing look on his face.\n\n\n\"Alright then. Follow me.\" You both follow him as he leads you up the stairs. \"Erron and I will share a room. Raven, you'll take this room.\" He gestures to a door on his left. \"We're in the next room over. If you need us, just pound on the wall. Okay?\" \n\n\nYou watch as Raven nods numbly, and you feel a brief stab of regret. Maybe you should've kissed her if it meant that you were to keep your previous relationship. Raven walks into her room and the door slams shut. \n\n\nVitre gives you a brief judgemental glance. \"What did you do to her?\" \n\n\nYou stay quiet until you are safe from being heard in your room. \"She confessed to me.\" You try to leave it at that, but he motions for you to continue. \n\n\nYou look away from him, \"I told her that, uh, I didn't want to be distracted by her.\" Your usual articulate self is long gone, and replaced by a less convenient embarrassed version of yourself. \n\n\nVitre shakes his head back and forth. \"You should've let her down more easily. I expected more from the Chosen Hero.\" He says that last part because he knows it'll get to you the most. \"I can't have something like this ruining the mission. You're going to have to make up with her before long, or the rest of this trip is going to be very unpleasant.\"\n\n\nYou nod your assent, and he gives you one last disappointing look before he goes off to take a bath. \n\n\nSomehow being left alone with your thoughts is even worse than having someone chastise you. You run the situation over and over again in your head trying to find a way that you could've rejected her without having left her so dejected.\n\n\nVitre comes back before you can fathom a way to do so, and you go ahead to take a bath as well. The water feels heavenly, but you don't feel as if you're really enjoying it quite as much as you could. Even before the incident today, you had quite a lot on your mind. With the addition of a sad friend on your mind, you find yourself starting to get mentally taxed. Sleep would do you good.\n\n\nYou come back to the room minutes later to find Vitre already asleep. Asleep on the only bed in the room at that. You sigh and tell yourself that you deserve it when you sink into a very uncomfortable wooden chair. You manage to get a few winks of sleep, but you often wake up due to aches on your body from sleeping in such an uncomfortable position. \n\n\nYou wake up again, and you automatically start to rub your back, when you see a figure begin to creep through the window. You immediately close your eyes most of the way, and hope he didn't see you moving. Luckily for you, it appears he didn't. \n\n\nHe wears a black cloak, so you can't see who he is, but that isn't what catches your attention the most. Instead of a typical rope coming across his chest to connect the two sides of the cloak together, there is an insignia. In the dark it's hard to see, but you think it's a symbol of the sun. You think it has a reddish hue, but you don't know for sure. \n\n\nHe walks silently and leans over the bed to stare at Vitre. You ready yourself to spring at the intruder at the first signs of aggression, but there's no need. Apparently Vitre wasn't who he was looking for. Instead the man turns his attention to you. You make sure your breathing is even as he makes his way over to you, and that your eyes are so close to being closed that it's nearly impossible to tell.\n\n\nHe examines your face, and gives slight nod to himself. You assume that you are his target, and ready yourself for the opportunity to strike. The man pulls a dagger out of his cloak, and starts the motions to stab you. \n\n\nIt's what you were waiting for. You twist out of the way at the last second, and his dagger lodges into the back of the chair instead. You take the opportunity to punch him in the stomach and shove him to the floor. He lets go of the knife, and you quickly pull that from the chair's back. The man recovers fairly quickly and attempts to tackle you to the ground, but the attempt only goes so far. You knee him in the face and throw him across the room. Coincidentally, that place you throw him happens to be the bed Vitre lays on.\n\n\nYou see Vitre start to stir out of the corner of your eye. You decide that you needed this guy immobilized as soon as possible, so you follow up your throwing him with another throw. This time, however, you're throwing the guy's dagger. Your aim is true, and the dagger hits the guys upper thigh. He yells out in pain causing Vitre to wake up fully. \n\n\nYou think of why someone would be targeting you, but then realize you have your priorities skewed. You needed to make sure that the danger was gone. You rush to the window and gaze out across the city that you can see. At first you see nothing, but a glint of silver shines in the distance and you duck down. An arrow embeds itself in the wall directly behind you.\n\n\nYour heart pound in your chest as you realize that you could've been dead if you hadn't been so fast. You glance to Vitre who has the first attacker subdued on the floor of the room. Whoever these people were, they obviously wanted you dead, and you doubt they'd stop after one attempt. You figure you should take them out now before they have a chance to regroup and attempt another assassination attempt. \n\n\n\"Make sure Raven is okay!\" You call out to Vitre as you vault the window sill out onto the street below. You hear what may have been Vitre telling you to wait, but you ignore that. Better to ask forgiveness than permission. \n\n\nAnother arrow whizzes pased you on the way down to the street. The fall is two stories high, but you use the momentum from gravity and roll to reduce any damage you might take from it. As fast as possible, you spring up from your roll to get behind cover. \n\n\nYou glance from behind the wall you took cover at. Almost immediately you hear the twang of a bow, and, consequently, you move your head back behind cover. Thoughts roil in your head as you try to figure out how to get to the enemy without getting hit by an arrow. A few different ideas come into your head, but when you examine and reexamine them you are only left with two plausible ideas. \n\n\nYou could use your blessing to speed up your reflexes in hopes that it'll allow you to dodge any arrows come at you. \n\n\nThe other idea you have much less confidence in working. You could dash from cover to cover, and hope he doesn't hit you. You don't really like this idea, because it puts your fate into the air. Instead of relying on your reflexes, you'd simply be hoping that he'd miss. \n\n\n ", "action_results": [{"action": "Dodge from cover to cover", "result": "The silence of the night seems to accentuate the risks your about to take. You breathe deeply and launch yourself from your position, across the alley, and behind a wall on the other side\n\n\nAn arrow hisses past you, but you manage to avoid being hit. You take another discreet glance down the alley, but this time your able to make out a figure about sixty feet farther down. \n\n\nYou take another deep breath and launch yourself across the alley once more. Once more an arrow launches past you, but once again, it misses. You feel the first two successful passes fill you with positive energy. You move once again across the alley.\n\n\nUnfortunately you forgot to take into account that you got closer to him with every pass that you made. If he was any less good of a shot, then your plan may have worked, but an arrow pierces your side and you feel your energy leave you. Breathing heavily, you attempt to call for help, but your voice is silenced by an arrow protruding through your throat. \n\n\nIf only you were faster.", "action_results": []}, {"action": "Use your blessing", "result": "In the past years you've become fairly efficient at tricking your body into thinking it needed to be protected. That way you'd be able to use your power whenever you wanted. Now, however, you realize you do not need to trick yourself at all. \n\n\nYou breathe in deeply, and then let that deep breath out. If anyone wa paying attention, then they might've thought an angel had appeared in the street. The mark on your back glows through your clothes and that familiar heat radiates across your shoulders. You prepare to rush the man, and at the last second pull your sword from you belt. \n\n\nYou rush out into the alley, and head in the direction of the archer. Almost immediately an arrow flies toward your head. You twist your head out of the way, and manage to get out of the way before it can touch you. It was close, but you were still fast enough to dodge it. You feel a surge of success, but you make sure you don't allow it to go to your head as you barrel down the alleyway. \n\n\nJust before the next arrow flies at you, you manage to make out the outline of your second attacker. The next arrow flies toward your chest, but the feeling of protecting yourself grows even stronger. Thus you feel like the arrow is moving slower. You bring up your left hand (the hand that isn't holding the sword) up and your timing is perfect. You grab the arrow just before it hits you. Somewhere in the back of your mind you feel pain from splinters entering your hand, but that doesn't;t bother you anymore. You've given yourself into the adrenaline that comes from such a life threatening situation. \n\n\nYou gauge the distance between you and the shadowed figure, and realize, with relief, that he wouldn't have enough time to draw another arrow before you reached him. \n\n\nUnfortunately, he notices this as well, and instead of bothering to fight, he runs. You continue running after him determined to find out who exactly wanted you dead this bad. \n\n\nThe would be assassin is much faster than you expected, so even with your blessing, you're barely gaining on him. He leads you down a maze of alleys and streets until he finally makes a wrong turn an hits a dead end. You cease your running, and the man turns around with a panicked expression on his face. Time seems to slow down as you wait for him to try and dodge past you. He stays eerily still as you walk towards him, and if you didn't have your blessing activated you might not have caught the signs. The signs that you were led into a trap. The man your facing made the mistake of glancing behind you. That mistake alone might not have given it away, but you hear the light fall of a single footstep behind you. \n\n\nThe hair on your neck stands, and you roll out of the way to dodge whatever was behind you. While your roll saved you from that initial attack, you're left on the defensive when you look behind you. \n\n\nSeveral cloaked figures stand between you and the exit of the dead end. You quickly count them up. Five. Including the archer from before, there were five more cloaked figures cornering you. All with that symbol of the red sun on their cloak. As you stand up from the roll, you see that the guy who tried to decapitate you looking suitably surprised at your reflexes. \n\n\nYou use half a moment to examine the surroundings. The blessing helps marvelously with this. You take note of each important thing in the form of fragmented thoughts.\n\n\nOnly one archer. Everyone else has swords. They arrived at different times. Must be why only one person attacked you a moment ago. One of the five stands alone in the back. The archer from before looks ready to draw another arrow. Take him out first...situation has changed. Don't try to disable. Go for the kill.\n\n\nAll of these thoughts run through your mind just as that guy (whom attacked you seconds ago) steps forward for a second try. It would be his last mistake. \n\n\nYou've always been great at fighting, even without your blessing, but with it you're pretty much unstoppable. You were even able to surpass Miss Sarrin before you graduated. \n\n\nSo when assassin number three (Assassin number one being the one back at the tavern) decides he wants another try, you parry his thrust and slash his throat before he could understand what just happened.   \n\n\nAssassin number two managed to string an arrow while you dealt with his friend, and is now in the process of aiming it at you. Assassin's number four and five decide that advancing at the same time might be better alternative to going at you separately. Assassin number six, oddly enough, doesn't do anything else but watch things go down. He seems to be the leader of numbers one through five. \n\n\nYou're left with two viable options. (short of giving up that is)", "action_results": [{"action": "Attack numbers four and five", "result": "Your original line of thought made you want to take out the archer first, but then a brilliant idea comes to mind. You glance at the archer, and sure enough he's starting to aim at you. You're tempted to smile, but you think better of it. You don't want to tip your hand.\n\n\nYou charge Assassins four and five, and take a brief, seemingly unnoticeable action, moment to position yourself between the archer and his friends.\n\n\nWhile surprised the Assassins react quickly enough. You slash and stab in a whirl of different tricks, and despite the fact that there are two people against you, you manage to put them on the defensive. during this, however, you use your blessing to the fullest. Your urge to protect yourself is so strong that time seems to slow down. It's certainly potent enough for your plan to work. \n\n\nThe first step being to place yourself, and therefore assassins four and five, in the archer's line of fire. Second step is to exploit your power so much that you're reflexes will be fast enough to dodge the arrow as soon as you here the twang of the bow. After that dispatching someone one on one would be easy, then the archer would go down leaving one final person to take care of.\n\n\nHe's the only person you're truly wary of, for when placed against a blessed one, all he does is watch. A cool confidence that you find a little disheartening. Of course, that's still only a little. There's no doubt in your mind that you'll be able take care of him. \n\n\nSo you wait. You wait for the twang of the bow whilst attempting to break through the defense of two people at once. Not just two people at that. Two people that happened to be quite skilled with a blade. you might have been more well aware of this if you hadn't taken the other two out via surprise. Still it isn't long before you do manage to find a whole in their defenses. \n\n\nYour assault of attacks must have become very taxing for them, and especially for assassin number five, for the next feint you throw at him proves to be his downfall. Your fake thrust to his left side opens his right side up, and you take that opportunity to deal a lightning speed thrust straight into his heart. \n\n\nIf you hadn't used your power to such an extent, then your sense of time may not have been so skewed. For that reason, you don't seem to realize that the archer didn't take his first opportunity to fire at you. No, he'd already seen the insane reflexes you'd exhibited prior to being cornered. He would wait for the perfect opportunity to shoot at you. \n\n\nStabbing your enemy through the heart was one such opportunity. Your blessing not only gave you increased speed, but also increased strength. When slashing it didn't particularly matter, but with a stab, it's easier to use to much strength. Therefore, when you finally do hear the twang, it takes you much too long to yank the sword out of your opponents body. \n\n\nEven so, you manage to let go of the sword to try and dodge away. The arrow still hits you however, albeit barely missing your heart. It is a tiny success in the grand scheme of things, for assassin number four takes the opportunity to avenge his comrade. If only you had been more self aware.\n\n\n ", "action_results": []}, {"action": "Attack number two", "result": "It doesn't matter that two guys are advancing toward you from your right, you don't at all feel comfortable with someone aiming an arrow at your back. It would only take one mistake on your part, and you would be lying dead on the cold hard stones of Aeors. \n\n\nYou rush archer number two with incredible speed, and the other two rush after you. The archer brings his bow up just as you get to him, and at the same time assassin number four closes in on you from behind. A truly un-ideal situation. Well at least if you hadn't expected it.\n\n\nYou twist out of the way the moment your heightened senses see the archer begin to release his arrow. Unfortunately for number four, he is nowhere near as fast as you. The arrow slams into his chest silencing him immediately. \n\n\nAstonishment colors the eyes of the archer as he kills his comrade, but you don't allow him any time for regret. You immediately advance and stab him through the stomach. Your blade sinks far into his stomach, certainly farther than normal, and you note that if you were any stronger, thn you very well could have your hand wrist deep into his body. \n\n\nLuckily for you, assassin number five isn't fast enough to hit you before you withdraw your sword from the archer's stomach. Unluckily for you, it seems that assassin number six finally decided to contribute to the fight. He makes his way towards the both of you just as you swing your first slash at number five. He barely manages to block it, and is put on the defensive immediately. You only manage to get a few swings out before number six joins the fight. \n\n\nA fast thrust is immediately dealt towards you, and as you parry it away, you realized that it was thrown with immense strength. You simultaneously kick out at number five, catching him in the leg, and slash from the bottom up at the newcomer.\n\n\nYour slash, although extremely fast, doesn't hit him. Instead, he's fast enough to avoid the deadly attack. Well he is. Your sword does manage to catch the edge of his cloak hood thoug, and the cloak material is thick enough that your sword takes just longer than a moment to slice through it. That moment is more than enough to send his hood flying off of his head. \n\n\nYou're so surprised that you nearly drop your sword. Ashyr stand before you. Obviously older, and with a scar on his chin, but Ashyr nonetheless.\n\n\nYou remember back when you first clashed swords years ago. For a brief moment you feel nostalgia, but that moment passes very quickly when you remember that he's trying to kill you. \n\n\nNumber five recovers from the kick and swings his sword in a deadly arc over his head at you, which you block, then Ashyr follows up with an attack of his own, which you parry.\n\n\nThe three of you soon enter a dance of sorts. Blades ring throughout the alley and echo into the night. There's a brief moment where you wonder if anyone will here the commotion, but you shrug it off quickly enough. Your opponents had the luxury of choosing the sight for this fight. You doubt they would choose a place where someone would impede their killing you. \n\n\nWithout your blessing you're sure you would already be dead, for Ashyr certainly kept honing his swordplay since the Academy, and number five is no push over either. You hate to admit it, but you doubt if you could beat Ashyr without your blessing. Someone of his caliber fighting against you would require you to use your blessing to win, and with someone else helping him... it turns the fight into a near stalemate. It is only a near stalemate though, because your increased prowess with your blessing, let alone that Ashyr no longer has strength and height advantage over you, allow you the edge in this fight. \n\n\nThat being said, you aren't really fighting offensively, so you don't get very far in your attempts to take them out. \n\n\nYou decide that in order to effectively protect yourself, and stay alive, you need to focus your attack on one of your opponents.\n\n\nWhile assassin five is certainly weaker, you briefly think that it might better suit you if you take out Ashyr first. Of course, there's also the flip side. If you take number five out quickly enough, then Ashyr won't be able to stand alone against you. \n\n\n ", "action_results": [{"action": "Focus your attacks on number five", "result": "Maybe it' a greater sense of strategy. or perhaps you just want to save Ashyr for last. Whatever the reason, you focus all of your strength on number five.\n\n\nTo the untrained eye, the fight will have stayed the same, but to the trained eye everything changed in the span of a second. Before you were attacking and defending from both sides, but with your new strategy you only attack against number five, and only ever defend against Ashyr. so long as you sufficiently defend yourself from Ashyr, and constantly press the attack on number five, then you don't get harmed. \n\n\nTo your surprise, it not only works, but it works famously. Number five turns out to be less suitable to defending than to attacking. He practically stumbles several times in his attempts to stay alive. What surprises you even more is Ashyr's performance on offense. He doesn't attack quite as skillfully as you might imagine he would have, so his attacks end up having loads of power, yet not quite enough skill to use it effectively. You catch a glimpse of his face during the encounter, and his face is a mix of true rage and hate. You knew he didn't like you, but you didn't think it would be quite so extensive. \n\n\nYou press the attack on number five even more urging him to cease his impotent defense. Every swing of yours brings a weaker block from him. Eventually this becomes too much for him and one of his blocks fails to have nearly enough power to stop your blow. Your over head strike knocks his sword clear out of his hand, but your sword continues and bites down into his neck. \n\n\nHalfway decapitated, number five falls to the ground amongst the bodies of the other assassins. \n\n\nDespite your moment of victory, Ashyr is undeterred. He launches a powerful strike in a deadly arc at your shoulder. Probably in hopes of making you lose the ability to use your arm. It was a smart move, but you do manage to bring your sword back in time for you to block it. To your chagrin, his attack was plentifully powerful. Enough to push your block down, and even make a slight cut in your arm. The pain isn't too great, and with the addition of of your adrenaline pumping you barely feel it at all. \n\n\nThis must've been a last ditch effort to defeat you, for he immediately goes back on the defensive. With your focus solely on Asher, you are able to to put all of your effort into attack. The eerie similarity of the situation astonishes you for a moment.\n\n\nYou pushing him back with a sudden ferocity akin to a demon.\n\n\nHim, defending as if his life depended on it. \n\n\nYou continuing to press him with attacks despite fatigue starting to come to you. \n\n\nHim, realizing your fatigue and desperately trying to hold out until your attacks weaken. \n\n\nYou, finally failing in your attacks, and on the defensive. \n\n\nHim, pushing you back with attacks  that you are barely able to defend against. \n\n\nYou start gasping for air, and it seems that you can never gulp down enough. Your eyes blur for a moment and Ashyr nearly takes your head off. Wait, this isn't right. You think this as you barely manage to stay alive against his onslaught of attacks. Your blessing should be giving you much greater energy than this. You try to activate it again, but realize that it is already activated. Still, you don't have the energy that you know you should have. \n\n\nThen everything connects in your head. The red suns...they were a symbol for an ancient assassin group. Your mind goes all the way back to when you were with Alessa in the Man's cabin. It was one of the books he had on the shelf. So these people weren't just assassins against you, they were regular assassins. And as with most assassins, Ashyr probably had his sword poisoned. It would explain the sudden loss of energy, as well as why he was so intent on simply hitting you. \n\n\nYou grow weaker and weaker. You realize that there's only one way this can end. You clumsily block Ashyr's next attack then immediately back up against the end of the alley. Apparently he had been pressing you hard enough to push you into a literal corner. Your back slides against the alley wall, and you sink into a sitting position on the ground. The strength gives out in your arms and your sword clatters to the ground beside you. \n\n\nAshyr stands above you with a triumphant expression on his face. He slowly brings his sword over his head and prepares to bring it down in a deadly stab. You close your eyes and await the inevitable. \n\n\nIt doesn't come. you hear a whirring sound in the air and then the sound of metal striking the alley wall. You open your eyes tiredly. \n\n\nAlessa stands at the end of the alley. The moonlight shines across her hair making her shine in the darkness. In her hands is a gleaming silver sword, and at her shoulders you can see a darkish aura rising from her persona. Ashyr stares in astonishment at the newcomer, but his true goal doesn't leave his mind. He brings his sword down again at you. You blink and Alessa is already beside you stopping his sword from killing you. \n\n\nShe was extremely close now, and you could see the outline of dark wings through her leather armor. Despite that you dearly wish to fall asleep...\n\n\n\"Stay with me Erron!\" Her voice commands you, and you reopen your eyes. Ashyr attack aat you again, and Alessa manages to defend you again. You want to tell her to leave you, but you don't have the strength to say anything. \n\n\nAlessa pushes Ashyr back with her sword, and a fight ensues. Alessa is clearly no match for him in terms of skill, but her curse gives her enough power to stay toe to toe with him. Alessa manages to push him back a few feet, but she is nowhere near as good at you at fighting. Moments later, you hear a pained cry as Ashyr's sword slashes across her upper arm. \n\n\nYou lose all hope then. Alessa's power would soon be depleted, and you would both die. The thought of Alessa dying starts to motivate you, and you look for ways to help her. You see your sword lying on the ground beside you, and you wonder if you can pick it up. Maybe you have enough energy for one last thrust...\n\n\n ", "action_results": [{"action": "Pick up the sword and stab Ashyr", "result": "You muster all of your remaining strength and reach for the sword. For a moment your fingers fumble, but you manage to pick the sword up. You roll forward onto one knee, and for a brief satisfying moment, you think you'll be able to do it.\n\n\nTurns out the extra movement only accelerated the poison. You collapse to the ground in a fit of coughs. \n\n\nYou die, knowing that you fail in saving Alessa. Some \"Chosen Hero\" you are.", "action_results": []}, {"action": "See if your blessing works", "result": "Your thoughts go once again to the cabin. The last time you saw Alessa in person. The choice was offered to you, but no words were said. You felt that one would give you power, while the other would give you the power to protect. You assumed that the power to protect meant only yourself, but as you see Alessa fighting for her life, you realize that being able to protect means that you protect more than just yourself. \n\n\nAnd if there was anyone that you wanted to protect more than yourself, it was her. \n\n\nPower surges from your shoulders and throughout your body. More power than you have ever felt before. You feel your blessing fighting off the poison and expelling it from your system. Much of the power you felt moments before, leave you body with the poison. You guess the blessing wasn't meant to heal such a detrimental poison. You reach over to your side and confidently grab your sword. \n\n\nAlessa looks like she's starting to feel the debilitating effects of the poison now, but the Creator must be on your side, for she sees you stand up. You meet her eyes, and she seems to understand exactly what you mean to do. \n\n\nShe maneuvers the fight so that she is facing directly towards you whilst Ashyr's back is right in front of you. You move as fast as possible but your fatigue hasn't entirely gone away, so the going is much slower than you'd wish it to be. A few feet away from Ashyr, he hears something and starts to look behind him. \n\n\nBut it's too late. You force your sword through his back, and into his heart. His body falls limply to the ground dead. \n\n\nAlessa falls moments after, and you rush to her side. The poison looks like its affecting her much more quickly than it affected you, so you know you don't have much time. \n\n\nHer eys open, and she smiles weakly at you. \"I'm glad I got to save you.\" \n\n\nYour thoughts are frantic, as you try and think of a way to save her. You weren't nearly strong enough to carry her anywhere, so you start to panic. \n\n\nAlessa's eyes start to close. \"Stay with me, Alessa!\" You shout frantically at her repeating the words she said to you minutes before. \n\n\nYou start losing all hop, and then an odd thought occurs to you. \n\n\nYou've never really known if you received this power from the Creator or not, but if you did, then surely he didn't want you to die. \n\n\nYou start to pray. You ask him to help you, and you promise that you'll forever be in his debt. You go on, and at the same to you start using your power to see if you can heal Alessa. \n\n\nYou feel power going through you and into her, but her eyes don't open. You pull and pull as much power as you can from your body in order to heal her. When you exhaust all of your energy, you pass out. ", "action_results": []}]}, {"action": "Focus your attacks on Ashyr", "result": "You decide that taking out the greater threat will prove to be more advantageous to you in the long run. \n\n\nTo the untrained eye, the fight will have stayed the same, but to the trained eye everything changed in the span of a second. Before you were attacking and defending from both sides, but with your new strategy you only attack against Ashyr, and only ever defend against number five. so long as you sufficiently defend yourself from number five, and constantly press the attack on Ashyr, then you don't get harmed.\n\n\nWell that's the idea. While it works at the beginning, you soon realize that you've made a huge mistake. On the outside Ashyr has always seemed like he would be an aggressor in a fight, but it is actually the contrary. You remember your first fight. You won after pressing him with a series of attacks, but never once did he truly falter in his defenses. Maybe if you had time you could wear him down, but you don't have that kind of time. You only managed to defeat him before, because of the overwhelming power from the blessing, and because you bested him while he was attacking. \n\n\nThis time is barely different. Except that number five is smarter than he looks, and has begun finding patterns in your defenses. Your deadly speed, strength, and skill are being analyzed and holes are starting to be exploited. Every swing presses you, and soon enough you're having to spend more and more time/energy defending than attacking. \n\n\nEventually Ashyr finds a hole in your attacks and manages to put you on the defensive. Despite your vast reserves of energy, you find yourself starting to tire. Your focus begins to wear thin as well, and it's all you can do to stay alive. You attempt to trick yourself into thinking that you need to be protected. It proves that you aren't in the best shape mentally, because you're already trying to protect yourself to the maximum. \n\n\nSuddenly you lose your grip on your sword, and, consequently, you make an awkward block against Ashyr. It proves to be a fatal mistake. After that clumsy block, number five surges forward and horizontally slashes at you. The blade cuts deep into your right side dealing you immense pain. \n\n\nFortunately for you, Ashyr ends the pain with a well placed stab through your heart. Your body falls limply into pools of blood on the ground. ", "action_results": []}]}]}, {"action": "Put your hands up and hope he doesn't shoot", "result": "A thought briefly crosses your mind. What if I just pretend to give up? \n\n\nIt doesn't seem like it'll work at first, but you hope that he'll be so surprised that he won't know what to do. Maybe even see if he can take you hostage. Then you would make your move.\n\n\nYou step out from behind the wall with your hands up above your head. A brief moment of silence passes, and you feel triumphant for a brief second. Then an arrow flies from the alleyway the archer is staked out in. You are no where near fast enough to dodge it, and it pierces through your chest. \n\n\nYou don't know why you thought this plan would work, but one thing is for certain. You're failed the Holy Kingdom in your role as the Chosen Hero. \n\n\nThe last thing you think is that the Creator must be face palming at your stupidity. ", "action_results": []}]}]}, {"action": "Keep trying to convince him", "result": "\"You said it yourself Vitre. There's a reason my father wanted me to be on this mission. If we all just travel together, then we'd draw too much attention, and an encounter with her could end catastrophically.\" \n\n\nSeeing that Vitre and Raven still weren't convinced, you continue. \"If you're that worried about me, then just follow behind me at a distance. That way you can rush to my aid if I ever need it.\" You make sure the emphasis on the 'if' is very clear. \n\n\nVitre starts nodding. \"That could work,\" \n\n\nRaven throws her hands up in exasperation. \"You too Vitre? I can't believe you really think this is a good idea.\" \n\n\nRaven continues to to express her dislike of the plan, but now that you have Vitre agreeing with you, everything goes much smoother. Even so, it takes most the rest of the trip to convince her. \n\n\nWhen she is finally convinced, everything returns to normal, or at least as normal as it can get when traveling. \n\n\nIt's a few days later when you finally come upon the city of Aeors. Walls of hardened sand surround the entirety of the city, and towers line either side of the main entrance. As you arrive, the sun dips beyond the walls and casts a welcome shadow over you and your companions. You continue to follow the river until you three approach the gate, then Vitre surges ahead of you and Raven. \n\n\nHe approaches one of the two guards standing beneath the gate. After a muted conversation and a few coins exchanged, Vitre motions for you two to follow him into the city. You glance around and are surprised to see that the river flows under a section of the wall and into the city beyond. This sparks a memory from your history class back at the academy. \n\n\nIt was in your first year that you remember learning about the city of the lake. A city that was founded entirely around a lake and the resources that came from it. Supposedly the city was able to sustain itself entirely of the agriculture, water, and meat that came from it. \n\n\nYou and Raven pass through the gate and form up beside Vitre. If the view from the outside was impressive, then the view from the inside was magnificent. Sunlight falls over the tops of the sandstone buildings creating a dynamic contrast between sunlight and shadow. You continue to follow Vitre through a maze of roads until you come upon a tavern. You can tell this because of the raucous laughter coming the inside. \n\n\nVitre casts sidelong glances at the two of you that seem to say \"here we go.\" With that encouraging look, Vitre pushes open the worn door open and steps into the tavern. You and Raven follow moments afterward.\n\n\nThe interior of the tavern is lined with torches, and the walls, floors, and ceilings are all made of polished sandstone. It's looks kind of odd to you, but everyone else seems to not care. Wooden tables are strewn about the room along with people of every type. You examine the room carefully, first to see if by some crazy chance Alessa was there. Second, to see if there was any danger in the immediate danger. Aside from a few shady people in corners, no one pays the newcomers much attention. \n\n\n\"Wait here, I'll go fetch us rooms.\" Vitre goes off to the bar to secure lodging leaving you and Raven alone. \n\n\nYou sneak a glance at her. Her skin has started to tan, and there's a tired look in her eyes, but other than that (and of course her growing) nothing has really changed about her since you first met her. Despite your expert glancing, she catches you looking at her and raises an eyebrow. \n\n\n\"Staring at me at a time like this?\" A smirk follows the comment and you scowl.\n\n\n\"I wasn't staring,\" you object. \n\n\nShe laughs lightly, and you find yourself suddenly embarrassed. Luckily, Vitre comes walking back to you giving you a welcome distraction. \n\n\n\"We'll have two rooms here for a week. If we haven't found her by then, then we can pay for longer. Sound good?\" \n\n\nYou and Raven nod your assent, and Raven and Vitre start to go up the stairs to the rooms. You pull Vitre back for a moment.\n\n\n\"Where's the privy?\" You ask him quietly. \n\n\nHe keeps his face straight apparently catching on that you would prefer Raven to not hear about your endeavor to expel waste from your bowels. Even so, amusement twinkles in his eyes. \n\n\n\"The Innkeeper told me it was out behind the building.\" \n\n\nYou whisper a thanks to him, and head outside to relieve yourself. You find the privy easily enough, and you step inside eagerly. \n\n\nIt's what comes after you finish, however, that complicates things. When you open the door to go back outside, you find a cloaked figure waiting for you. From the physique type, you can tell it's a man. a man with a sinister kind of presence. Before you can ask him what he wants, he reaches into his cloak and pulls out a dagger. He then lunges at you. \n\n\nHe's fast, but not nearly fast enough to hit you. You easily sidestep, and as his hand passes your body, you pull on it and shove him past you and into the privy. You are just about to turn around and reenter the privy to question the guy, when you see something glint in the corner of your eye. You step entirely out of the privy and roll away just in time to dodge an arrow. \n\n\nYou heart pounds in your chest, but doesn't stay that way for long. When you rolled out of the way of the arrow, you happened to roll in to a third enemy. This time you don't have time to react. The third guy had a sword waiting, and he plunges it through your heart. \n\n\nThe last thing you see is the face of Ashyr standing over you, and the word \"Payback\" mouthed on his lips. \n\n\n \n\n \n\n \n\n ", "action_results": []}]}]}, {"action": "New friends (Background)", "result": "The first of your new friends came in a most unexpected way. \n\n\nFollowing the day of your victory against Ashyr. You appeared to be something of a legend among the underclassmen. Even the upperclassmen showed respect for you. Ashyr must have been something of a symbol for the school. The Headmaster's son. No one particularly had a problem with him, and everyone respected him. Your victory sparked a transition phase from Ashyr being the symbol of the school, to you eclipsing him.\n\n\nOddly enough, Ashyr went missing. Searches were conducted, but it was to no avail. It was when Ashyr was finally confirmed as a missing person, that this new friend came to see you. You'd seen her in the hallways prior to your meeting, but she wasn't in any of your classes, so you didn't really pay her much attention. That is, until she slapped you. \n\n\nIt happened on your way back to the academy building after a training session with Miss Sarrin. You saw her coming towards you, but didn't pay her much attention. Why would a girl as pretty as her be storming toward you with an expression filled with ill intent? Well, apparently Ashyr had a girlfriend. \n\n\nThe slap she gave you probably surprised you more than it hurt. You were left confounded for a solid moment before she continued her assault on you in the form of words. \"What did you do to Asher?\"\n\n\nYou half expected her to be screaming her question given that she slapped you moments before, but to your surprise her voice is relatively quiet. \n\n\nYou shake your head. \"No. I've only ever met him twice. The last time I saw him was the first day school was open,\" you explain carefully. You'd rather not have her explode and slap you again. You don't think your honor could take another blow like that. \n\n\nHer angry demeanor changes in the blink of an eye. Tears start pouring from her eyes, and she sits down on the grass beside you. You aren't really sure how to react to all of this, for you've only been slapped like that once before, and the way you reacted to that left you feeling guilty beyond belief. \n\n\nYou decide that you can't just leave her there, but in the same thought you decide that it isn't really your place to comfort her either. Instead you stand still and wait for her to cry it out. you didn't really have any plan for the rest of the day anyway. \n\n\nMinutes pass, and you feel your legs begin to tire. You cast your thoughts back to the lesson with Miss Sarrin you had today. It was mostly just stuff you already knew, but you found yourself interested in it nonetheless. \n\n\nYou start thinking about how you ended up in this situation in the first place. About your mother's death, and your's and Alessa's falling out. If the girl slapping you didn't sully your carefree mood earlier, then this certainly did. \n\n\nYou're in the middle of that depressing train of thought when you notice the girl staring at you. Her tear stained face and eyes bore into you, but it has neither the anger nor sadness from before. Instead curiosity burns in her in her deep brown eyes. \n\n\n\"Why are you still here?\" she asks.\n\n\n\"I couldn't just leave you here,\" you respond. You realize in the back of you're mind that she might think you are more caring than you really are. You only couldn't leave her because that would be cowardly. Certainly not because you cared about some random girl crying. \n\n\nHesitantly, she stands and offers her hand for you to shake. \"I'm sorry about earlier. I was just frustrated with Ashyr disappearing on me.\" \n\n\nYou take her hand, albeit warily. If your life were more ordinary, then you might consider this an odd day, but you figure that it could've gone worse. \n\n\nShe releases your hand and fakes a smile. \"I hope we can start over. My name is Raven. Pleased to meet you.\" \n\n\nWhile you aren't sure if you really want to be acquaintances with her, you decide that it she can't always be this emotionally unstable. \n\n\n\"I'm Erron.\"\n\n\n ", "action_results": [null]}, {"action": "Lessons with Miss Sarrin (Background)", "result": "Your first year at the academy goes by fairly quickly. You turn out to be a less studious person than you'd ever realized. While you were at the castle, every lesson was tailored specifically to you, so you picked things up pretty easily. In this new environment you find yourself playing catch up more than you should be.\n\n\nHaving decided that you're her new favorite friend, Raven helps you with your schoolwork. Her friends tease her about hitting on a younger guy, which you and her ignore, but at the same time you can't help but notice that she is very pretty. Of course, you don't let that get in the way of your learning. Much. \n\n\nYou look forward to those lessons more than the lessons the classes offers. How can they even compete with being privately tutored by a pretty older girl. You have to remind yourself that she is older more than you'd like admit, but that doesn't prevent you from developing a bit of a crush on her. There are times when that crush causes you to think of Alessa, but you cast those thoughts away. You are at war now. If it came down to it, then you would be expected to fight her and her family. \n\n\nWhile those lessons keep you occupied, the lessons that really enamor you are the ones that Miss Sarrin teaches you. Learning about this 'blessing' you have is much more fun than you realize. Her lessons began with basic history lessons on the relevance of the 'Blessed Ones,' and how they ruled the continent at the word from the Creator. You already knew about most of it, so that didn't quite truly catch your interest. Instead what really interested you was what Miss Sarrin was able to learn about your power.  \n\n\nThis particular instance occurred a few months after you started your training with Miss Sarrin...\n\n\n~\n\n\nThe wooden sword fell to the ground beside you with a resounding thud. It was the third time that day that you lost against Miss Sarrin. She never went easy against you, and, consequently, this led to many bruises. It wasn't that she was looking to hurt you, but rather she was only trying to help you activate your power again. \n\n\nYour fight with Ashyr months earlier was the first and only time you succeeded in activating that blessing of yours. Try as you and Miss Sarrin did, you still weren't able find away to reactivate it. \n\n\nYou dropped the ground with your sweat stained tunic plastered to your chest. Your were frustrated with Miss Sarrin, the Creator, but most of all, yourself for not being able to activate this faulty power of yours. No matter how hard you tried you couldn't get it to adhere to your will.\n\n\n\"Get back up. Let's go one more time,\" Miss Sarrin insisted.\n\n\nYou were tired, and quite frankly, sick of losing over and over again. \"I'm sorry. I think I'm done with losing for the day. Let's just get with the academic stu-\" You interrupt yourself mid-sentence when you see Miss Sarrin's practice sword come flying towards your head at an alarming speed. Even though you are tired, you're still able to dodge the sudden attack. \n\n\nAlmost instinctively, you roll out of the way and grab your practice sword. You barely have to to raise it before Miss Sarrin is attacking you again. Several times you try to speak to get her to stop, but each time you speak Miss Sarrin rushes into another attack. Her ferocity surprises you, for you hadn't seen her like this before. While you've known her to be blunt these past months of lessons, she's never been this close to hurting you. She's always held herself back so she wouldn't hurt you, but this time is much different.\n\n\nYou manage to block each attack she throws, but you constantly lose ground, and soon enough you figure she'll get threw your defenses. Usually when she wins, Miss Sarrin stops herself from dealing any kind of finishing blow to you. This time, however, will be different. Her eyes are focused purely on the task at hand, and her face is devoid of emotion. She isn't thinking about your safety at all. \n\n\nYou begin to increase the effort you put into each block and parry. It wouldn't do to spend the next week in the hospital from a concussion. It's all in vain. Aside from Morden, She's the best fighter you've ever fought. Ashyr was easy compared to her, but unlike Ashyr, you don't think you have any chance of winning. Therefore your goal changes. Instead of winning, you only want to prevent irreparable brain damage. \n\n\nIt's unnoticeable at first. It's only a little heat on your shoulders, so you chalk it up to the sun, but as the heat appears you find yourself blocking each attack more easily. Miss Sarrin starts to move slower, and you feel yourself moving faster. Each swipe of your sword is a another step Miss Sarrin has to take back. It's like your fight with Ashyr. You feel victory within your grasp, so you close in on it with a thrust carrying your full force behind it. \n\n\nHowever, Miss Sarrin uses that force against you. She sidesteps the thrust and with a quick yank of your wrist pulls you farther than you intended. You're sent sprawling to the grassy ground before you. The burning in your shoulders disappears, and you're left lying fatigued in the grass. \n\n\nTo your surprise Miss Sarrin doesn't continue her attack, and even more surprising is when you look over to her and find her grinning. \n\n\n\"What are you smiling at?\" You question unable to hide the bitterness in your voice. \n\n\nMiss Sarrin starts to laugh a bit, and you feel even more slighted. Well at least until the reality of the situation hits you. Miss Sarrin rarely ever smiles, or even laughs, so this is a treat. Especially since it makes her face even prettier. Your offense is forgotten, and you briefly wish that Miss Sarrin was your age instead of ten years older than you. That way you might actually have a chance with her, but you chastise yourself. Even if she was your age, then she wouldn't be in your class. Apparently Miss Sarrin is the youngest prodigy to have ever graduated from the academy, and the Advanced Combat school that followed. That's why she'd been able to be an instructor here so quickly. \n\n\nYou turn your head away from her hoping that your blushing would be covered by the scowl you  put on your face. \n\n\n\"Erron. Do you realize what just happened?\" Her voice is filled with excitement. \n\n\n\"What do you mean?\" Your brief thoughts from earlier completely disappear from your head. \n\n\n\"I figured out what triggers your power!\" She continues to speak before you can answer. \"I was looking through the Blessed Ones histories the other day, and every account of them talks about their purpose being to protect.\" \n\n\n\"And what's that got t-\" You stop when it hits you. That's what the Man (you still weren't really sure he was the Creator yet) was talking about in the dream you had. He said that the blessing gave you protection. You think back to when you fought Ashyr, and just a few moments when the power was triggered again. Both times you were focused on protecting yourself. \n\n\nMiss Sarrin nods when she sees the realization come over you. \"It activates whenever you feel the need to truly protect yourself. That's why it wasn't working when were sparred previously. I was never actually putting you in danger, so you didn't feel the need to really protect yourself. You only wanted to win.\" \n\n\n\"Wait, does that mean you were planning on hurting me?\" you ask curiously.\n\n\nMiss Sarrin makes a small gesture with a hand as if she could brush the question aside. \"That's aside the point.\" Before you can pursue that point, she continues. \"Now we just need to make you better at using this blessing of yours. After all, you managed to use it this past fight, and still ended up losing. Of course that's probably because you aren't quite as good as me yet, but we'll work on that too.\" \n\n\nYou nod and get back to your feet. Your loss and fatigue replaced by a newfound sense of purpose. You were actually making progress. You ready your sword and Miss Sarrin readies hers. You really do like these lessons.\n\n\n \n\n ", "action_results": [null]}, {"action": "Your Allegiance (Background)", "result": "Three years have passed since the unfortunate events that sparked the civil war occurred. They say time heals everything, but you aren't so sure. You can still feel the pains of your mother's death weighing on your heart, and your thirst for revenge still leaves you parched from time to time. \n\n\nFortunately, today your thirst was quenched. \n\n\nThe war has been going on for some time now, and neither side has really taken much of an advantage. That is, until this past week. The Dellandians must've decided that they wanted the war to be over already, so the King led the next attack against the Knights. That was a major mistake. As soon as your father realized the King would be there, the goal of that battle changed. Instead of an all out battle, your father focused on taking out the King. An army without it's leader isn't very efficient after all, but you know that the driving reason for such a tactic was the revenge you and your father shared. With a mixture of luck, strategy, and skill, the King was killed and the head for the army cut off. \n\n\nYou feel a morbid sense of peace as you go to sleep that night. One that is promptly destroyed when you dream about that cabin for the first time in three years.\n\n\nThe scene is always the same. It's always afternoon, and without the context of the cabin, it would be a very peaceful place. However, the beautiful figure in front of you dispels all of that in the blink of an eye.\n\n\nIn the three years that you haven't seen her, Alessa seems to have grown exponentially more beautiful. Her long silvery blonde hair frames an angelic face. Her emerald green eyes train in on you, and it's all you can do to breathe. She's much more beautiful than both Miss Sarrin and Raven. Despite this beauty, her persona is accentuated by a sadness and tiredness that makes you feel inordinately sympathetic. \n\n\nWhen she speaks your eyes are drawn to her lips and your heart sinks with guilt. Your years of schooling have been preparing for the eventual situation wherein you would face the Dellandian army, and perhaps even the Dellandians themselves. Ever since the war started there's been a large emphasis on the corruption of the royal family, and the hate for the royal family is evident in your peers eyes. You'd be lying if you said you didn't feel hate for them either. Despite all of this, you can't help but remember that Alessa was a kid when all of this happened. None of it was her fault. \n\n\n\"Erron,\" she begins, and you find yourself desperately wanting to know what she has to say. \"Are you happy now?\" Her voice is bitter and accusatory. \"One parent for another, right? It's finally even. Are you happy now?\" she repeats.\n\n\nSomewhere in the back of your mind you realize that you aren't acting like your usual self. \"No, I didn't want this to happen.\" You start to say that, but then stop confused. You remember going to sleep happy that her father had been killed, and that you did, in fact, want this to happen. \n\n\nAlessa sees your confused expression and sighs. \"Don't you know how to use your blessing?\" Her tone is less bitter, and the question is something that doesn't confuse you (much), so you respond. \n\n\n\"Yes, but I have to feel the need to protect myself in order to use it.\" You tell her this without the slightest qualm, but her question triggers something in the back of your mind. In the past few years you've learned to use your power fairly easily by tricking yourself into thinking you need to protect yourself. You do this now, and that familiar feeling radiates from your shoulders. With the power activating your mind becomes clear. It's like a fog you didn't even know was there, was lifted.\n\n\nAlessa must've been able to tell a difference because she speaks again. \"You didn't answer my question. Are you happy now?\"\n\n\nNow that you're able to think clearly you register two things. The first, Alessa is much less captivating than before. Still gorgeous, but you aren't left speechless anymore. The second thing is you realize that your decreased mental state was most likely caused by the curse she bears. She probably didn't even do it on purpose, hence why she only noticed you were affected after she battered you with questions.\n\n\nStill you hesitate. You aren't at all torn up by the King's death, and you're certainly more happy about it than not. Of course, that doesn't mean you want to tell her that you like her father better when he's dead. \n\n\n \n\n \n\n ", "action_results": [{"action": "Tell the truth", "result": "\"I wouldn't call it being happy,\" you start, \"but I can't say I'm sad that the person who killed my mother is dead.\" You realize that this is kinda harsh, but you don't want to lie to your childhood friend. You expect her to be angry, but her face is blank. \n\n\n\"I thought you were going to lie to me.\" The sentence barely escapes her lips. \n\n\nYou shake your head. \"I thought about it, but I felt you deserved to hear the truth.\"\n\n\nShe nods in return, and a moment of silence descends upon the cabin. The both of you are left staring at one another. Eventually she walks toward you and wraps her arms around you. You hesitate before returning the gesture. Her face rests in your chest, and you feel tears leaking through your tunic. She starts speaking again, but this time everything she says runs together. You do manage to catch a few things though. \n\n\n\"I'm sorry all of this happened, I wish we could go back to the way things were,\" and \"I miss you,\" were just some of the few things you heard her say. \n\n\nThe sudden expression of emotion nearly overwhelms you, for you realize that she's voicing many things that you've felt for the past three years. Perhaps one of the most prominent of those feelings being a sad loneliness. After all, the only person that might understand you is your sworn enemy.\n\n\nThe pair of you stay like that for a while, but soon enough, and to your disappointment, Alessa lets go of you. She takes a step away from you, and starts to walk out of the cabin. The sudden absence of her presence leaves you cold, and as you stare at her leaving, you realize that this could be the last time you are able to be with her alone. Even if this 'being alone' was in a dream state. \n\n\nYou catch her hand and pull her back. Your heart feels like it's going to pound out of your chest when her eyes meet yours. Her face was a mask of surprise when you lean down toward her with your lips parted. You close your eyes half expecting to be slapped, but instead you feel the soft texture of her lips against yours. The kiss only continues for a few seconds, but you feel happier in those seconds than you have in a long time. \n\n\nAs you two separate, you feel your real self begin awake. She says, \"Bye Erron\" at the same time you say \"Stay safe.\" \n\n\nYou lay in your bed with the image of her seared into your memory. You feel elated, but only for a few moments. Any feelings you might still feel for her make you feel guilty. Regardless of whether or not it was a dream, you did just kiss an enemy. \n\n\nYou lie in bed torn between the people you're meant to protect, and the person who understands you better than anyone else. \n\n\n \n\n ", "action_results": [null]}, {"action": "Lie", "result": "\"I'm not happy, no.\" You start with this, but the next thing you say slowly turns what you're saying from a lie, into a bitter sarcastic truth.\n\n\n\"How couldn't I be happy that the man who had my mother killed died?\" With your mother's death on your mind, Your demeanor quickly becomes sour. You gaze at Alessa expecting her to be upset, but her face remains blank.\n\n\n\"I thought you were going to lie to me.\" The sentence barely escapes her lips. \n\n\nYou shake your head. \"I started to, but I felt you deserved to hear the truth.\"\n\n\nShe nods in return, and a moment of silence descends upon the cabin. The both of you are left staring at one another. Eventually she walks toward you and wraps her arms around you. You hesitate before returning the gesture. Her face rests in your chest, and you feel tears leaking through your tunic. She starts speaking again, but this time everything she says runs together. You do manage to catch a few things though. \n\n\n\"I'm sorry all of this happened, I wish we could go back to the way things were,\" and \"I miss you,\" were just some of the few things you heard her say. \n\n\nThe sudden expression of emotion nearly overwhelms you, for you realize that she's voicing many things that you've felt for the past three years. Perhaps one of the most prominent of those feelings being a sad loneliness. After all, the only person that might understand you is your sworn enemy.\n\n\nThe pair of you stay like that for a while, but soon enough, and to your disappointment, Alessa lets go of you. She takes a step away from you, and starts to walk out of the cabin. The sudden absence of her presence leaves you cold, and as you stare at her leaving, you realize that this could be the last time you are able to be with her alone. Even if this 'being alone' was in a dream state. \n\n\nYou catch her hand and pull her back. Your heart feels like it's going to pound out of your chest when her eyes meet yours. Her face was a mask of surprise when you lean down toward her with your lips parted. You close your eyes half expecting to be slapped, but instead you feel the soft texture of her lips against yours. The kiss only continues for a few seconds, but you feel happier in those seconds than you have in a long time. \n\n\nAs you two separate, you feel your real self begin awake. She says, \"Bye Erron\" at the same time you say \"Stay safe.\" \n\n\nYou lay in your bed with the image of her seared into your memory. You feel elated, but only for a few moments. Any feelings you might still feel for her make you feel guilty. Regardless of whether or not it was a dream, you did just kiss an enemy. \n\n\nYou lie in bed torn between the people you're meant to protect, and the person who understands you better than anyone else. \n\n\n \n\n \n\n ", "action_results": [null]}]}]}, {"action": "Defense is the best offense", "result": "You're willing to bet that you can defend longer than he can attack. After all, you only have to get one good hit in in order to win. With that plan in mind, you begin carefully watching for an opportunity to end tis fight.\n\n\nWith a sudden turn of luck you parry a blow, and Ashyr decides not to pursue attacking you. Instead you start circling each other again. You're grateful for the time to rest before you begin your attack, but Ashyr doesn't seem to be thinking at all about his energy. Instead his eyes are focused on you with a puzzled look in his eyes. You guess no one has ever lasted this long against him.\n\n\nBy now the sun's heat has your body beginning to wear down, and your fatigue must show, for Ashyr smiles a triumphant smile. Immediately afterwards, he surges forward with an overhead slash.\n\n\nHaving switched your mindset, you easily block the blow. Ashyr frowns and attacks again. He meets with no success,  but he isn't one to give up.\n\n\nHe continues his predictable strategy of continuous attack. You are grateful you decided that defense was the best option. You aren't sure you would last very long in a strategy of continuous attack similar to what Ashyr was trying. \n\n\nThe fight goes on with little change and you continue to tire, but, on the bright side, Ashyr is as well. All you need to do is wait for the moment where he falters in his attack. Almost as soon as you think that, the moment comes. It's eerie that it came so quickly, but you don't question it. His lunge was sloppy leaving you plenty of time and skill to exploit in your next attack. You bring your wooden sword above your head to bear down on him, but when you look at him you don't see fear, or any other emotions indicative of defeat. In fact you see the exact opposite. Triumph rests in his eyes as if he never had a doubt he would win. \n\n\nYou hesitate in order to figure out what he could possibly be triumphant about. Then you realize it. It was odd that he got tired this quickly. He had shown tremendous endurance throughout the fight, and for all of that to suddenly disappear...it was too easy. With a panicked thought you realize what is about to happen. The lunge you blocked easily from moments before was still beside your body, and unlike the moments before the hold on his sword isn't sloppy at all. Ashyr swings his sword from under and to the side of you in an upward slash. You turn to face it at the last moment in hopes of blocking it, but that proves to be a fatal mistake. \n\n\nYou're no where near fast enough to do that, and instead of blocking the attack, you only give Ashyr a better target. Unfortunately, the angle at which Ashyr swings his sword and the angle that your facing it combine to create the worst possible outcome.\n\n\nThe blow hits you just under your nose, but Ashyr doesn't stop the hit there. No, you realize he must've been fed up with the fighting. The blow is strong enough to hit your nose cartilage straight up and into your brain. The result in a quick, unlucky, and untimely death.", "action_results": []}, {"action": "Tackle him", "result": "Going on either pure attack or pure defense would be expected, you decide. You need something entirely unprecedented. Something that''ll surprise him so thoroughly he won't know what to do. \n\n\nWith a sudden turn of luck you parry a blow, and Ashyr decides not to pursue attacking you. Instead you start circling each other again. You're grateful for the time to rest before you begin your attack, but Ashyr doesn't seem to be thinking at all about his energy. Instead his eyes are focused on you with a puzzled look in his eyes. You guess no one has ever lasted this long against him.\n\n\nBy now the sun's heat has your body beginning to wear down, and your fatigue must show, for Ashyr smiles a triumphant smile. Immediately afterwards, he surges forward with an overhead slash. \n\n\nBut you're ready for it. When he gets close enough you get low and charge him. The impact of you hitting him stops him from continuing his swing downward, however, you aren't able to fully tackle him. The result of your attempt leaves you bear hugging his stomach. Ashyr reacts quickly and switches the hold on his sword so he can stab downward. You see what he's doing out of your peripheral vision, and you realize what's about to happen. \n\n\nYou disentangle yourself from him just as he starts to bring his sword down at you. The hit, originally aimed at your back, hits the top of your spinal cord due to your attempt to dodge, and you black out. \n\n\nYou wake up approximately a day later. The white of the infirmary hurts your eyes, but not as much as your pride hurts. You could accept losing, but losing in such a pathetic way was disappointing.\n\n\nYou reach you hand to cover a sudden yawn, but your hand doesn't move. You try to bring it up once again, but still, it doesn't move. You start attempting to move every possible limb, but your body doesn't obey you. The only things that you can move are your facial appendages. \n\n\nYou start shouting for someone, and soon enough a nurse comes to see you followed by Headmaster Rallas. They go into a lengthy explanation of what happened to you. That explanation ends with them saying that you are paralyzed from neck up. You end up going into shock, and you realize that you won't ever be able to do anything you want ever again. \n\n\nYou enter a limbo like state where nothing really matters to you. Even letters from your father seem to have lost their meaning. \n\n\nMonths pass and your thoughts are filled with regret and despair. If only you had gone with your father, or if only you had won that fight...if only. Those thoughts consume your entire being until there's nothing you can do, but think about what ifs. Life in this state leaves you wishing to be dead. You push those thoughts off, but when there's nothing else to do but think, then that becomes a burden too. \n\n\nOne day you finally decide to do it. Maybe the Creator will forgive you for being a failure as a Blessed One. \n\n\nWell, if that's all I could do in a fight, then maybe I am a hero. I saved everyone from watching me fail as the Chosen Hero of the Holy Kingdom. \n\n\nWith that thought you end your existence in Dellandia.", "action_results": []}]}, {"action": "Stay and retaliate", "result": "While on the inside you're starting to seethe, on the outside you manage to keep you're cool. You step to the side and start walking up the stairs past him, as if you're making a move ot ignore him. In reality you just want to have to high ground when you punch him. \n\n\nAs you place your foot on the step above this oversized boy, he grips your forearm saying, \"Hey, Don't walk away from m- Hey!\"\n\n\nHe interrupts his own sentence with \"Hey\" when instead of yanking your arm away from him, you use his grip and push him forward and hopefully, down the stairs.\n\n\nBut this guy is smarter than he looks.\n\n\nInstead of being surprised like you hoped, it appears he was more or less ready for it. he uses the momentum from your push to pull himself up and pull you past him down the stairs. Unlike him, you are completely surprised. You figured he was like a dog. Lots of barking, but no bite. You were wrong.\n\n\nYou attempt to twist your head away from the floor, but you were propelled at too fast of a rate. With a sickening crack, your head splits open on the white granite stairs. You pass out, and never wake up. Your last thought is that maybe the guy was right. The creator chose the wrong person. ", "action_results": []}]}]}]}]}, {"action": "\"The 'Curse.' \"", "result": "\"Curse.\" You whisper the words, and immediately the dark light flies from the man's hand and into you. You don't feel any different at first, but as the seconds go by you feel yourself getting really tired. The fatigue spreads throughout your body and you know that at any moment you may pass out. The feeling reminds you of a story your dad once told you about him treading water for hours  at a time. He said afterwards that he knew he wouldn't be able to keep it up forever, but he would continue for as long as he could. \n\n\nYou sympathize with that thought as your body and mind betray you to their tiredness. When you finally feel as if you could not hold on any longer, you collapse to the floor beside Alessa. The last thing you see is the bright light, the blessing, flying from the man and into Alessa, and the man's face; a picture of sadness. \n\n\n \n\n~\n\n\n \n\nYou wake up hours later in the cabin. You peel your face of of the wooden floor and groggily rub your eyes. It takes you a moment to remember what happened, but when you do you leap to your feet confused. There isn't a single thing out of place in the cabin. You look all around for evidence of what you could've sworn happened here only moments ago, but you find nothing. Even your sword is back inside your sheathe. Nothing was amiss. Perhaps it was all a dream, you think relieved. \n\n\nWith a sigh and a shrug you brush the dust off of your clothes and open the cabin door. You remember the struggle you had with the man moments before, and you laugh to yourself. Leave it to your subconscious to turn one of your favorite people into a scary curse giving man with emotional problems. Although... you do wonder why Alessa isn't with you. You were supposed to meet with her in this cabin after all. \n\n\nYour don't think to much of it, for you finally realize the time. In the distance the sun begins to dip down into the gray blue clouds. It was sundown, the time time your parents require you to be home. You immediately break into a jog. You Father could be quite strict when it came to you. If he caught you coming back late, then he would surely punish you. \n\n\nYou jog into a relatively silent castle, although you hear sounds of eating and merriment coming from the main dining hall. As if to punctuate the point, your stomach rumbles in anticipation for dinner. Thankfully you only have to go up one staircase on the way to your room. You're careful to look through each hallway before entering in order to avoid a potential disaster with your dad, so in not too long you come to a solid oak door. Engraved on the wall beside it reads the name, 'Lucentia,' your family name. Without wasting any time you throw the door open and slam the door shut behind you. \n\n\n\"Erron? What are you doing back so late?\" You turn around to see your Father seated on at your desk with a grave look on his face. His deep authoritative voice is riddled with anxiety and subtle undertones of sadness. Something your dad rarely displays. \n\n\nYou begin to mumble an excuse about knight training, but your Father interrupts you. \"Never mind that. I need you to pack your things. We're going away for a while.\" The persona of a strong confident man your Father usually portrayed was gone. \n\n\nWhen you don't respond immediately, he raises his voice. \"Quickly now. We must be going!\" \n\n\nYou don't question him and immediately begin to pack your travel bags with necessities. You're at it for a couple minutes when you realize your Father had no bags with him. \"Did you already have your bags packed? you ask curiously. Any information you could glean from him would be useful. \n\n\nHe looks around for a moment confused. \"I must've forgotten to grab them. I'll be back, son. Stay here and pack. If I'm not back in fifteen minutes then go find Morden.\" He rushes out of the room leaving you even more confused than when you woke up in the cabin.\n\n\nYou shrug and obey him. Even at his worst he still knows more than you do. \n\n\nIt doesn't take you long to pack, and soon enough you're left waiting on your bed. A few long moments later you begin to hear shuffling outside, and shouting. You try to ignore it, but it soon grows to a point where you can't ignore it very well. That, and you're starting to get curious. The royal guards don't usually act so panicked, so maybe you should check it out.", "action_results": [{"action": "Sate your curiosity", "result": "Tossing your fathers wishes out the window, you crack the door open. If you come back in five minutes, then that should leave you plenty of time to find out what's going on. \n\n\nYou walk out of the door and into the stone walled hallways. You listen for a moment, then follow the sounds of shouting. As you near the source, other sounds enter the mix. The sounds of swords ringing and armor being torn fill your ears, and before you can turn yourself back you walk into the scene of the noise. Bodies of the knights of the Holy Order llitter the hallway floor. Royal guards stand amidst the corpses, while others drive their swords through the fallen bodies. Some dark liquid covers the cobblestone floor, and that same liquid is splattered across the walls. Blood.\n\n\nThe thought sickens you and you begin to retch despite not having had dinner yet. The sound draws some attention, and as you bring your head up from the ground your eyes meets with a dying Knight on the floor not to far from you. That knight mouths the word \"Run,\" just before his eyes lose the life in them. \n\n\nBefore you can really react to that you hear someone yell, \"There's the Assassin's son! Get him!\" You look up to find every royal guard with their eyes trained on you. Your instincts take over and you begin to run back the way you came. The sounds of metal boots hitting the floor echo throughout the hall behind you. Fear courses throughout your body, and you run faster than you ever have before. \n\n\nHowever, it's not enough. After only a few moments of running you hear a voice behind you yell, \"I've got him!\" You're only left wondering what he means for a moment, for right afterwards a javelin pierces your shoulder. The force of it doesn't kill you, but it certainly sends you toppling to the floor. The pain is horrible, but luckily you don't have to endure it for long. A royal guard comes up moments later to finish the job.", "action_results": []}, null]}]}]}]}]}