{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=12165", "context": "", "first_story_block": "\"My dear, you know if I could stay, I would. But they need me out there!\" Isaac, your betrothed, squeezes your hand gently as he tries to soothe you.\n\n\n\"But I need you too! I need you here with me!\" You scream at him, unwilling to accept that all too soon, he will be going off to fight in a war and may never return.\n\n\nIsaac strokes your cheek gently. \"My love. I will return. And when I do, we'll get married, just like we planned before all this started.\" He leans down and kisses your forehead gently. \"I love you.\"\n\n\nHe walks off toward the other soldiers. You're not quite sure if he hears you as you whisper your last words of parting to him.\n\n\n\"I'll wait for you...\"", "action_results": [{"action": "Continue", "result": "You sit up abruptly and pull your sheets securely around your chest. It was just another dream about Isaac's departure, you realize. You've been having a lot of those lately, even though it's been two months since he left. You haven't heard anything from him since about a week and a half after he arrived at his destination. It was nothing particularly heartwarming. Just a letter to say he was alive and would write soon. But he never did. He couldn't be dead, though, you think. Surely, someone would have informed you by now.\n\n\nSuddenly, you hear a knock at the door, interrupting your thoughts. You really don't feel like getting up. You didn't sleep well last night. On the other hand, it could be the mailman with a letter from Isaac.", "action_results": [{"action": "Answer the door", "result": "It is the mailman, you realize with excitement after opening the door! But he doesn't have a letter from Isaac. It's a letter from the man who runs the factory where Tyson, Isaac's younger brother, works. Tyson had apparently been injured while working the assembly line. He was badly hurt and had nowhere to go. So they were sending him to you. No questions asked. He needed to be taken care of, and you were the only likely candidate for the job. Real doctors were much to busy taking care of injured soldiers to devote their time to a young man who couldn't even fight their war.\n\n\nTyson had broken some bones in his right hand when he was fifteen, and because the injury was never treated, they did not heal properly, resulting in partial loss of the functions in his hand. Therefore, he was useless, except to sit in a factory all day, producing weapons.\n\n\nNo one ever let him forget how his injury affected his daily life and his ability to be useful. They would constantly make him miserable, taunting and teasing.\n\n\nBut not you. He saved your life. You never believed he was useless...", "action_results": [{"action": "5 Years Earlier...", "result": "You were fourteen years old. It had already been a year since the accident when Tyson broke his hand, but he was still having trouble getting used to the fact that he didn't have full control over it.\n\n\nYou were walking along the beach one afternoon. You knew Tyson was at the top of a hill not far from the shore, watching you. There were signs of a storm coming in, but you didn't care. You wanted to be alone. You're father had just died, leaving you with only an aunt to take care of you.\n\n\nNaturally, you didn't notice (or maybe you just didn't care) when a huge wave came up the beach straight towards you. You had never been a strong swimmer, so when the wave dragged you into the raging ocean, you pretty much gave in.\n\n\nBut Tyson would not allow you to be stolen so easily. The next thing you knew, you were being carried out of the water in his strong, muscular arms. \"Stupid, stupid girl...\" He crooned gently as he stroked your hair. You weren't sure, but you thought he might've had tears in his eyes.\n\n\nHow do you thank someone for just saving your life?", "action_results": [{"action": "Kiss him", "result": "You were so overcome with emotion, you barely had any time to think before you reached up and gently pulled his face towards yours. Your lips met tenderly, and a small gasp of surprise escaped his lips. But he recovered and realized what was happening. He kissed you with a gentleness you weren't certain you knew existed. He ran his fingers through your hair and whispered \"Stupid girl\" against your lips as he pulled away.", "action_results": [{"action": "Present Day", "result": "It's not long before a few men arrive at your door, hauling the injured Tyson. You lead them into the house and to an empty guest room where they lay him out on the bed. As soon as they have him positioned comfortably, they are on their way.\n\n\nYou realize that Tyson is drifting in and out of a state of consciousness. You do everything your mother taught you to do when you were young to treat an injury like Tyson's. All that's left to do is wait.\n\n\nSo you hold his hand and sit patiently.", "action_results": [{"action": "2 Hours Later...", "result": "\"Where am I?\" Tyson's eyes are open, and he's looking around like a lost child.\n\n\n\"It's ok, Tyson. You're safe here with me.\" You gently stroke his hair as he takes in his surroundings.\n\n\n\"Did you save my life?\" He asks. You suppose he could've bled to death, but you weren't necessarily the one who saved him. \"Can I thank you for saving my life... like you thanked me?\"\n\n\nObviously a reference to the incident five years earlier. You two never talked about it - or the kiss - since it happened. But you were certain that's what he'd implied.\n\n\nHe wants to kiss you. Do you let him?", "action_results": [{"action": "Yes", "result": "He's injured. You don't feel as if you can refuse him. So you nod your head and lean close.\n\n\nHe gently reaches towards you, even though he clearly has pain in his arm, and pulls your face the remaining distance so your lips meet. You realize this is the first time the two of you have kissed since that day.\n\n\nHis lips are warm and soft against yours, not tainted with seawater as they were last time. He strokes your cheek gently as his mouth refamiliarizes itself with yours.\n\n\nThen suddenly, you pull away as if remembering something. You're engaged to his brother. For all either of you know, he may not be alive. But you are his. And you wouldn't betray his brother... Would you?\n\n\n\"Thank you.\" He whispers softly, as he closes his eyes to rest.", "action_results": [{"action": "Continue", "result": "When Tyson wakes up a few hours later, you sit next to his bed. You have prepared a meal for him, realizing he must be starving. He sits up carefully, wincing in pain as his injuries are once again agitated.\n\n\n\"Be careful.\" You say gently, resting your hand softly against his chest.\n\n\nHe looks up at you and sighs. He has an odd expression on his face, but you can't decide what he might be thinking about. \"Well, nurse,\" he says, his expression returning back to normal, \"I hate to be a bother, but I'm really rather famished.\"\n\n\n\"Right. Here you go.\" You lift the plate out towards him, and he struggles to obtain it, his injuries obviously causing him extreme discomfort.", "action_results": [{"action": "Offer to feed him", "result": "His pain is too much for you to bear. Your hand instantly retracts, removing the dish from Tyson's reach. A distraught look quickly spreads upon his face. \"Why?\" He asks pathetically.\n\n\nYou shake your head. \"I'm going to feed you. Whether you want me to or not. I can't stand seeing you grimace every time you move. So I'll do it.\"\n\n\nYou receive a look of shock in response. Possibly from the fact that you're treating him like a baby, or maybe just because of your extreme air of authority. But he doesn't object.\n\n\nYou scoop manageable bites into his mouth as he lays there helplessly. Every now and then, between bites, he'll send a small smile your way. Probably his less embarrassing way of thanking you for playing the role of his mother.\n\n\nAfter you've fed him the last of his meal, you stand to go wash his dishes. But before you have time to make it a step away from Tyson's bed, he snatches your hand and sends an audible groan of agony through the room.\n\n\nHe had his purpose in mind, however, so as you stand there with a worried look on your face, he draws your hand towards his lips and plants a delicate kiss on your wrist. \"Thank you.\" He whispers for the second time that day.", "action_results": [{"action": "Tyson's Progress", "result": "It's been several weeks since you've taken Tyson into your home. You realize you enjoy his company, not having previously noticed just how lonely you were. He seems to be getting much stronger, though he still hasn't left his bed a single time.\n\n\nOne afternoon, you enter Tyson's room to check on him. You see him struggling to stand on his own. When it appears that he's about to topple over, you rush to his side to support him. However, rather than accepting your assistance, he gently shoos you away. \"No. I have to do this on my own.\" He says with determination. Then he adds more softly, \"I can't always have you all to myself.\"\n\n\nYou stand back and give him space. He has trouble at first getting readjusted to the use of his legs. He still has some residual discomfort, but most of his pain is gone. Soon, he's walking about the whole room on his own.\n\n\n\"I want to go for a walk with you. Get some fresh air, see the sky. It'll be good for me, I think.\" He looks at you hopefully.\n\n\nShould you go and risk his injury, or tell him to wait till he's fully recovered?", "action_results": [{"action": "Go for a walk", "result": "You carefully lead Tyson out of the house. He blinks a few times, his eyes readjusting to the bright sun he hasn't seen in forever. \"Where to?\" You ask.\n\n\nTyson thinks silently for a moment, then turns to you with a grin. \"I think I know just the place.\" He takes your small, soft hand in his firm, yet gentle, grasp.\n\n\nThe two of you walk in comfortable silence for a while until you realize where he's leading you. Just below the hill where the two of you now stand, you can see the beach. Not just any beach. The beach where Tyson saved your life five years ago.\n\n\nHe leads you down the hill, then turns to you with a bashful expression. \"I figured now was as good a time as any to talk about what happened that day.\" He presses your hand firmly over his heart. \"You must know I had certain... feelings for you. I don't honestly know that I would've jumped in a raging ocean for just anyone.\"\n\n\nYou feel a wave of heat cross your face. You suppose you probably had figured that out by now, you just never wanted to consider the implications of what had occurred that day. Even back then, it was a known fact that Isaac had claimed you. You begin to wonder if you ever gave Tyson a fair chance.\n\n\n\"I'm not asking you to come out and say you've always secretly been in love with me. But... I do hope that maybe you'll start to consider - truly consider - how you feel about me.\"", "action_results": [{"action": "Time Goes By...", "result": "You and Tyson spend much time together as the days pass. It soon becomes evident that he must leave soon, as he is almost fully healed. You realize that this thought suddenly makes you feel sad and lonely.\n\n\nOne night, you enter Tyson's room to check on him. He had recently been having trouble sleeping, so it became your nightly ritual to hold his hand and tell him stories until he fell asleep.\n\n\nWhen you reach his bedside, you see Tyson looking up at you in the dim light, a sad expression on his face.\n\n\nA wave of concern washes over you. You sit on the edge of his bed and reach for his hand. \"What's wrong?\" You ask.\n\n\n\"I just... I love you so much!\" He squeezes your hand to convey the urgency of this revelation. \"I want you, all to myself, for the rest of my life. It's not fair that he's so lucky!\"\n\n\nYou are shocked by his outburst. His proclamation of love was the last thing you expected. You sat in silence, unsure how to respond.\n\n\n\"Well? Say something!\" You hear the overwhelming desire in his voice as he demands a response. \"I need to know. Please. Do you love me? Could you ever learn to love me?\"\n\n\nHow do you respond?", "action_results": [{"action": "\"I do love you.\"", "result": "\"Do you really?\" With the aid of the moonlight streaming in through the window, you are able to see a smile quickly spread across Tyson's face. \"Oh, my love!\" He pulls you to him and presses his lips to yours. You feel a wave of heat wash through you as he run his hands through your hair.\n\n\nYou realize this is the first time he's ever kissed you without that gentleness he usually treats you with. He has replaced that gentleness with a hunger and passion that you find alarming, yet alluring.\n\n\nTyson gently eases you down on his bed and pins you beneath him. He sends fiery trails of kisses up and down your neck, along your jaw, and returns to your mouth, uttering vows of love against your lips. He breathes heavily as he runs his hands over your body and continues kissing you as if the world will end tomorrow. \"My love... oh, how I've wanted you for so long!\"\n\n\nBy the early morning, you realize two things: First, you have just given yourself to Tyson. And second, you broke your promise to Isaac...", "action_results": [{"action": "The Dilemma", "result": "It has been three months since you and Tyson consummated your love for each other. You realize that there is no way to hide your affair from Isaac, if he returns.\n\n\nYou are pregnant.\n\n\nTyson returned to the factory two short weeks after your night of bliss. You haven't seen him since, but he's always sending flowers and writing to you. In his last letter, he informed you that he would be visiting in a week.\n\n\nHe doesn't know you're pregnant yet, but you plan on telling him when he arrives.\n\n\nYou spend the week preparing for his arrival. On the day of his arrival, you hear a knock at the door. You rush to the door, expecting to find Tyson. Instead, you are greeted by the mailman.\n\n\nIt is a letter from Isaac. He is coming home in three days.", "action_results": [{"action": "The Decision", "result": "The instant Tyson sees you, he notices two things: First, he notices the bulge your stomach has begun to form. He is delighted at the implication that he will soon be a father. Second, he notices the look of distress on your face.\n\n\n\"My dear, what's wrong?\" He asks, pulling you close with one hand. His free hand he gently rests on your stomach, right over the spot where his child resides.\n\n\nYou quickly explain to him about Isaac's letter. His reaction is some strange mixture of loathing and triumph. He couldn't stand the fact that, only months ago, you had come close to marrying his brother. But now, you were his. That is what you read on his face.\n\n\nHis response was calm, however. \"It seems to me we really only have two options.\" He states matter-of-factly. \"Either we stay here in hopes of reconciling with Isaac, or we run. Stay away for a few years. Long enough for him to get over losing you. We leave him a letter informing him of us, but don't tell him where we'll go. It's up to you, though.\"\n\n\nWhat will you do?", "action_results": [{"action": "Stay", "result": "You tell Tyson you think it would be best to try and reconcile with Isaac. Tyson agrees to stay with you to await Isaac's arrival.\n\n\nDuring the few days you two have alone before Isaac's arrival, you dreamily discuss the sort of life you will have together with your child. Tyson is constantly sneaking glances at your stomach, giddy with excitement of your child's arrival.\n\n\nThe moments you don't spend discussing your future, you spend with Tyson's lips pressed passionately against your skin.\n\n\nBut all too soon, Isaac arrives...", "action_results": [{"action": "Isaac's Arrival", "result": "It doesn't take long for Isaac to guess at your current relationship. Between the less than enthusiastic greeting he received, and the fact that you're obviously pregnant, he knows he's been betrayed.\n\n\n\"You! You traitor! How the hell could you do this to me?! How could you do this...\" He gestures at your stomach. \"...to her?!\" His rage has caused his face to turn bright red. \"You've made her into your plaything! She's no better than your common whore! My love, you've stolen her and her innocence!\"\n\n\n\"Isaac, you can't always get everything you want! But then, you've never been good at sharing...\" Tyson is clearly angered by Isaac's accusations and insults towards you. He shows remarkable restraint.\n\n\n\"No. No, I haven't. But... If I can't get what I want, then neither should you!\" He draws his handgun from his pocket. Of course he would be in possession of a gun. He just returned from war!\n\n\nWith barely so much as the blink of an eye, he snaps his gun towards Tyson.\n\n\nYou know how this will end.\n\n\nWithout thinking, you position yourself in front of Tyson right before the bullet reaches him. Instead, it plants itself firmly in your pregnant body. You fall backwards and are caught in Tyson's arms. He screams profanities at Isaac.\n\n\n\"Stupid, stupid girl...\" He says, stroking your hair, tears streaming down his face. He leans down and sends a gentle shower of kisses down upon your forehead. \"My love... My stupid girl...\"\n\n\nYou take another ragged breath. You cup his face gently in your hands.\n\n\n\"Now we're even...\" You whisper softly, before fading away.", "action_results": []}]}, {"action": "Run", "result": "You and Tyson decide that the best option is to run. You take your most important possessions with you and leave a long letter of apology for Isaac.\n\n\nYou and Tyson are married not long after your departure. For months, you constantly wonder how Isaac is. You don't regret choosing Tyson. No, you love Tyson. You only wish you hadn't been forced to hurt Isaac in the process.\n\n\nJust as you are settling into a comfortable routine with Tyson, you receive terrible news.\n\n\nIsaac has killed himself.\n\n\nYou don't question his motive. You know, without a doubt, it was because of you. Because he loved you. Because, not only did you betray him, but his brother betrayed him as well. You mourn his death for the months that lead up to the birth of Tyson's and your child. The baby is a healthy and handsome boy.\n\n\nYou and Tyson decide to name him \"Isaac.\"\n\n\nYou and Tyson have two more children several years later. Another son, Bryce, and a daughter, Lila.\n\n\nYou and Tyson live happily together for many years. And every night before bed, he kisses you softly and whispers in your ear, \"Thank you.\" And you know exactly what he means. Thank you for looking past the partial disability in his hand. Thank you for taking care of him when he was injured. Thank you for confessing your love that day, so many years ago.\n\n\nBut most of all he was saying \"Thank you for giving me so many years of happiness and a beautiful family.\" Or, put more simply, he meant: \"I love you.\"", "action_results": []}]}]}]}, {"action": "\"I don't love you.\"", "result": "\"Of course not! I've been a fool to even think I could win your heart. It was always Isaac. He was older. He was stronger. His hands were undamaged. He was going places! How could you ever love me?\" Tyson looks away, hurt and anger spreading on his face.\n\n\n\"Tyson, no. It's not like that at all! I just...\" You're at a loss for words.\n\n\n\"You just what? Tell me! Please! I'd love to know!\"\n\n\n\"I don't know, ok? I don't know...\" You're starting to tremble.\n\n\nTyson notices your trembling. His voice becomes gentler. \"Kiss me. Really kiss me and tell me you don't love me.\" He quickly leans toward you and wraps his arms around you, pulling you up against him. He covers your mouth with his and kisses you hungrily. His fingers trail up and down your body. His mouth never stops. His lips are on your neck, trailing along your jaw, and back on your mouth.\n\n\nAs if suddenly realizing he needs to breathe, he stops, still holding you, and comes up for air. \"Do you love me yet?\" He breathes heavily.\n\n\nThat's when you know your answer, once and for all.", "action_results": [{"action": "\"I'm sorry, I can't.\"", "result": "Tyson's face suddenly draws a blank expression. He had expected this response, but he was obviously hoping you'd changed your mind. He gently pushes you away. \"Please. Leave.\" His voice cracks.\n\n\nYour heart breaks seeing him this way. \"Tyson, I-\" He cuts you off.\n\n\n\"No. I don't want to hear it. Just go!\" His voice rises.\n\n\nWhen you wake the next morning, you realize Tyson is gone.", "action_results": [{"action": "One Year Later...", "result": "Isaac had returned from the war three months after that night when you refused Tyson. You and Isaac were married in a simple ceremony.\n\n\nYou were glad you decided to wait for Isaac. You loved him dearly, and it seemed as if not seeing you for so long had made him somehow more affectionate.\n\n\nYou were, however, sorry for the pain you caused Tyson. By this time, Tyson had become an infamous drunk. He was known for taking many women into his home constantly. More interesting was the fact that it was noted that he preferred a certain type of woman's company. And when this type of woman was described to you, the description sounded remarkably like you.\n\n\nYou were certain it wasn't a coincidence.\n\n\nYou and Isaac were soon expecting your first child. Isaac was out working one day. That's when the contractions started. You needed someone - anyone - there with you.\n\n\nAnd that's when he showed up. Tyson. You looked at him with utter surprise and disbelief evident on your face.\n\n\n\"I'll always be here for you.\" That was all he said. That was all he needed to say.\n\n\nBy the time Isaac got home, Tyson was long gone. In his place was a beautiful baby girl.", "action_results": []}]}, {"action": "\"I think I always have.\"", "result": "Tyson smiles, his eyes shimmering in the moonlight streaming in through the window. \"I hoped so! Oh, my love!\"\n\n\nHe recovers instantly from his previous lack of breath. He instantly begins trailing kisses along every inch of your exposed flesh. His hands are restless. He wants more.\n\n\nYou suddenly realize you are willing to let him have more. He can have all of you, if that's what he wants.\n\n\n\"Do you want me?\" Your whispers are intoxicating.\n\n\nTyson nods his head, breathing raggedly against your skin.\n\n\nIt is well into the morning when you realize you have just broken your promise to Isaac.", "action_results": [null]}]}]}]}, {"action": "Stay inside", "result": "\"Tyson, dear, I think that's a bad idea. I don't want you to get hurt. You're not strong enough to walk such great distances yet.\" You don't want to risk Tyson getting hurt all over again. You just hope he doesn't think you're being too controlling.\n\n\nTyson tries desperately to stifle a grin. \"You do care about me, don't you?\"\n\n\nYou blush fiercely. \"Well, of course. I've known you for as long as I can remember. Why wouldn't I care about my friend?\"\n\n\n\"Oh, is that all? Are you sure I'm just a friend? You've never once wondered what it would be like to spend the night with me?\" He asks in a seductive tone. He winks at you and steps closer.\n\n\nYou're blushing again. It's rather obvious. Tyson laughs and moves back a step. \"You're so cute when you're embarrassed.\" He says smiling. Then his expression turns serious. \"I'm not going to lie, though. I've wondered...\"", "action_results": [null]}]}]}, {"action": "Watch in silence", "result": "You watch as Tyson struggles to position himself to eat. He makes slow progress in trying to feed himself. Every movement causes a flash of pain to course through him.\n\n\nYou would do anything to alleviate his pain, however, you don't want him getting the wrong idea. So instead, you wince as you watch him suffer.\n\n\nWhen he's finally finished, he looks at you pathetically. \"You are a wonderful cook. I only wish I could've enjoyed your meal under more favorable circumstances.\"\n\n\n\"I'm so sorry! You look miserable!\" You whine sadly.\n\n\n\"No, no, darling. It's alright, really. I'm going to be honest. I don't mind it so much.\" He reaches out to take your hand and groans in pain. \"I don't mind because I get to be with you.\" He gently kisses your wrist.\n\n\nYou have difficulty suppressing a smile.", "action_results": [null]}]}]}, {"action": "No", "result": "\"Tyson... I'm sorry. We shouldn't. Isaac...\" You trail off.\n\n\n\"No, I'm sorry. I shouldn't have asked. I just... I've been wanting to kiss you again so badly ever since that day. But you were always his, weren't you?\" He looks away sadly.\n\n\n\"Tyson...\" You reach for his hand, but he pulls away.\n\n\n\"No, it's ok. I'm fine with it. I'm sure you two will be very happy once Isaac gets back. You'll get married, have his children, grow old together... But. Remember what I said, ok? Because I meant it. I'll always be there for you, even if you don't want me.\"\n\n\n\"Thank you.\" You whisper as you rise to leave. \"Get some rest, alright?\"", "action_results": [null]}]}]}]}, {"action": "\"Thank you.\"", "result": "Tyson looks somewhat disappointed. You're not quite sure what he was expecting to happen, but he nods his head and smiles. \"You know you don't have to thank me. I'll always be there for you if you need me.\" He strokes your cheek gently.\n\n\nSuddenly, without warning, Tyson leans his face close to yours and kisses you gently on the lips. When he pulls away, he's blushing.\n\n\nYou stare at him in shock. \"Sorry. I couldn't help myself.\" He shrugs casually but says nothing else as he walks you home.", "action_results": [null]}]}]}]}]}