{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=22", "context": "", "first_story_block": "Please read this disclaimer before continuing ...\n\nDISCLAIMER\nThe Fairview Highschool Game is pure fiction. The name \"Fairview\" was chosen as it is a very popular name for high schools and is not intended to represent any one high school. Also, all of the situations, locations, and characters in the game are fictional. Any likeness or resemblance to persons, places, or anything else is strictly coincidental.", "action_results": [{"action": "Play The Game!", "result": "*BEEP*BEEP*BEEP*BEEP*\n\nIt's 6:30am. What are you going to do:", "action_results": [{"action": "Wake up and go to school", "result": "You decide to wake up and go to school.\n\nYou arrive at school, and, of course, it is first period. Thanks to the wonderfully logical F.H.S. scheduling, you have a study hall. What would you like to do:", "action_results": [{"action": "Stay in study hall", "result": "You decide to stay in study hall.\nAs you sit innocently in study hall, some one wearing a \"Fairview Cult\" tee-shirt slips you the Fairview Cult Bulletin. After you read it, he asks you if you would like to join the Fairview Cult. What do you do:", "action_results": [{"action": "Say \"Hook me up!\"", "result": "You decide to join the Fairview Cult.\nAs you say the words, \"Yeah, I'll join,\" you feel the air part around you and it seems as if a very heavy burden is just lifted off of your shoulders.\n\nMoments later, the second period bell rings. You pick up your things and leave for your next class.", "action_results": [{"action": "Continue ...", "result": "Congratulations! You made it to second period! Acording to your schedule, you have Foreign Language Class now.\n\nDuring the first few minutes of second period, the highschool morning annoucments are played. The morning anouncers comes on the TV and give the usual, boring announcments. They remind everyone that today is a pep-rally and that the student council ellection winners will be officially crowned today.\n\nThe announcments end, and class begins. What would you like to do?", "action_results": [{"action": "Pay Attention", "result": "You decide to pay attention.\n\nThe teacher starts off by teaching some foreign language: \"Das es muy bueno y par le vue.\"\n\nAfter a few minutes of that, he tells the class a cool story about how he was almost involved in a drive-by shooting. Then, he goes on about civil issues, such as gun control.\n\nWhat do you do:", "action_results": [{"action": "Disagree and start an argument", "result": "You decide to disagree because your a pansy liberal.\n\nYou infuriate the teacher, and he procedes to rip down the overhead projection screen. He then cracks you upside the head with it, breaking your cranium.\n\nNever Argue with a language teacher.", "action_results": [{"action": "Click here to end the game", "result": "Well, it loos like you just couldn't cut it as an FHS student. Better luck next time.\nYour final score is: 017", "action_results": [null, null]}]}, {"action": "Agree and nod your head and go to sleep", "result": "You decide to go to sleep.\nThe teacher wakes you up with a note to go to the office. Mr. Greenwall, the associate principal, wants to talk to you.\n\nWhat do you do:", "action_results": [{"action": "Go down to the office", "result": "You decide to go to the office.\nWhat would you like to do:", "action_results": [{"action": "Take the direct route", "result": "You decide to take the direct route.\n\nAs you walk down the hall, worried about what the Associate Principal could possibly want, you are trampled by a herd of junior high swine passing through the highschool, going to their music class. You lie there bloody and gasping for help. You fade away and die.\n\nYou should have taken the scenic route, retard.", "action_results": [null]}, {"action": "Take the scenic route", "result": "You decide to take the scenic route.\nWhat would you like to do on your way to the office:", "action_results": [{"action": "Look in the costume room", "result": "You decide to look in the costume room.\n\nLooking through all the various clothes, you see this dress that reminds you of your mother's wedding dress. You think it looks really cool and it seems to be your size, so you try it on.\n\nAs you are putting it on, Adam O'Mallady opens the door to the costume room sees you in the dress. Mistaking you for a queer, he starts bashing your head in with his Marine Corp boots. As your life fades to black, you hear death metal in the backround.\n\nMan, you suck.", "action_results": [null]}, {"action": "Look in the janitors' closet", "result": "You decide to look in the janitor's closet\n\nYou open up the door labeled \"JANITOR\" and walk in. You see some brooms, dustpans, a coffe mug that says \"Mmmmm Janitor Java\", and a large, black void is sucking you in. As you enter the void, you pass through time, forward and backward in an endless loop for eternity. You see E=MC2 and melting clocks.\n\nSo what exactly did you think you would find in a janitors' closet?", "action_results": [null]}, {"action": "Stop by the art room", "result": "You decide to stop by the art room.\n\nYou see a few people you know hanging out in the art room: Joe Barney (the All-American of Fairview Park), Number 2, and Number 3 (both from the Fairview Cult). What do you do:", "action_results": [{"action": "Say hi to the All-American of Fairview Park, Joe Barney", "result": "You decide to say hi to the All-American of Fairview Park, Joe Barney.\n\nAs you do that, Number 3 of the Fairview Cult hands you the Fairview Cult Bulletin. What you do?", "action_results": [{"action": "Say \"Thanks, I've already seen it\" and go on your way", "result": "You walk in the office and are told to take a seat and wait. While sitting and waiting, you give the hot student office aide a wink. Finally, the secretary tells you that Mr. Greenwall will see you now.", "action_results": [{"action": "Continue ...", "result": "Mr. Greenwall gives you a stern look and tells you to take a seat. As you sit down and put your arms on the armrests, cold metal cuffs pop out and lock your hands and feet to the chair. Mr Greenwall begins to speak:\n\n\"I know that you are a member of the Fairview Cult. First, you need to sign this form. Here, you don't need to read it, all it states is that you understand that you are down in the office.\"\n\nHe twitches his neck and one of the clamps on your arm releases so you can sign the form.\n\nWhat do you do:", "action_results": [{"action": "Sign the form", "result": "The moment after you put your John Handcock on the carbon-copy form, you hear a demonic laughter coming from behind you, and see Mrs. Fuddmeadow and a few other teachers walking in.\n\nYou read the form you just signed and realize you just agreed to a 15-day \"special\" in-school suspension. Mr. Greenwall says:\n\n\"You have given up all of your human rigts to me. I will destroy you and your precious Fairview Cult and turn you all in to drones!\"\n\nThen, he twitches his neck again and the chair you are strapped to falls through a trap door in the floor. As you crash on the level below, you hear Mr. Greenwall say \"Let the Brainwashing begin.\"\n\nMoments later, FHS drones tie you up and tape your eyes open to force you to watch propoganda prom and football videos.\n\nYou are dead, but only on the inside. You are now an FHS drone. Have fun setting up the cafeteria for dances ... for eternity.", "action_results": [null]}, {"action": "Refuse to sign the form", "result": "Mr. Greenwall grunts and says:\n\n\"Fine. We can take care of this form later. So tell me, I keep hearing things about this \"Fairview Cult.\" Please, fill me in. I want to know more.\"\n\nWhat do you do:", "action_results": [{"action": "Tell him everything, but say you aren't a member", "result": "You start explain to Mr. Greenwall what the Fairview Cult is, but that say you are not a member. He nods his head and the restraints open to let you go. As you walk out of the office, Dominic Republican and The Scarecrow, both from the 440 rap group, gang up on you for ratting out the Fairview Cult.\n\nThe Scarecrow grabs both of your arms and rips them right off your body, then uses them for himeself, tossing his old arms on the floor. Next, Dominic rips out your soul, laughing, and puts it in a jar. You spend the next 10,000 years alone in this small, dark jar until the rubber seal finally decomposes.\n\nSniff Sniff. I smell a rat!", "action_results": [{"action": "Click here to end the game", "result": "Please read this disclaimer before continuing ...\n\nDISCLAIMER\nThe Fairview Highschool Game is pure fiction. The name \"Fairview\" was chosen as it is a very popular name for high schools and is not intended to represent any one high school. Also, all of the situations, locations, and characters in the game are fictional. Any likeness or resemblance to persons, places, or anything else is strictly coincidental.", "action_results": [null, {"action": "Look At Your Schedule", "result": "", "action_results": [null]}, {"action": "Get Some Hints", "result": "Period 1: Join what ever you are asked to join.\n\nPeriod 2: Scenery is nice. Listen to what King Wah has to say.\n\nPeriod 3: Impressing the teacher is not always the best thing to do.\n\nPeriod 4: Listen to the words of Jon Videc and check out the posters.\n\nPeriod 5: You can't go down the stairs, find another way. Talk to the right people and remember their advise.\n\nPeriod 6: Just...be careful\n\nPeriod 7: NO HINTS AVAILABLE", "action_results": [null]}]}]}, {"action": "Say \"A cult in Fairview? That sounds terrible!\"", "result": "Mr. Greenwall gives a stern look and shouts:\n\n\"You know exactly what the Fairview Cult is! DO NOT WASTE MY TIME! TELL ME ABOUT THE CULT, NOW!\"\n\nYou feel the cuffs around your hands and feet tightening. What do you do:", "action_results": [null, {"action": "Smile and say, with a smirk \"Like I said, I don't know anything\"", "result": "Mr. Greenwall smiles and sighs. In a very calm and almost soothing voice, he says:\n\n\"Listen, there is nothing wrong with just telling me about the cult. The Fairview Cult is a very bad thing. Just tell me what you know so you can help the people in it. All we want to do is help.\"\n\nWhat do you do:", "action_results": [{"action": "Tell him that no one is in real trouble as it is just a big joke", "result": "You tell him how the Fairview Cult is nothing but a big joke; you are a member, and every one is just having fun and joking around. After you finish explaining, Mr. Greenwall says:\n\n\"A joke? I find nothing at all funny about a cult at all! I will destroy you and your precious Fairview Cult and turn you all to drones!\"\n\nThen, he twitches his neck again and the chair you are strapped to falls through a trap door in the floor. As you crash on the level below, you hear Mr. Greenwall say \"Let the Brainwashing begin.\"\n\nMoments later, FHS drones tie you up and tape your eyes open to force you to watch propoganda prom and football videos.\n\nYou are dead, but only on the inside. You are now an FHS drone. Have fun setting up the cafeteria for dances ... for eternity.", "action_results": [null]}, {"action": "Angrily say, \"Sir, I would really like to get back to class. I don't have all day\"", "result": "As you say that, Mr. Greenwall's face turns bright red. He twitches his neck and you feel the hand and feet claps tightening, just about crushing you. He glances over at the window and nods his head; the window shades close and give the room a scary, dark feel. He says in a very angry and frusterated voice:\n\n\"LISTEN UP. I AM GOING TO GIVE YOU ONE MORE CHANCE. IF YOU DO NOT TELL ME NOW, I AM GOING TO TELL YOUR MOTHER AND SUSPEND YOU. DO NOT WASTE ANY MORE OF MY TIME!\"\n\nYou are in extreme agony from the clamps. What do you do:", "action_results": [null, {"action": "Shrug your shoulders, say \"What Fairview Cult?\"", "result": "Mr Greenwall's eyes grow, and you can see flames in his pupils. He starts to grit his teeth and you can feel the ground shaking. All of a sudden, the third period bell rings.\n\nHe growls and, in an instant, the shades open and the clasps release you and fold back back into the chair. You get up massage your wrists.\n\nOn your way out of his office, you wish Mr. Greenwall the best of luck finding out what he wants to about the Fairview Cult.\n\nYou head toward your next class.", "action_results": [{"action": "Continue ...", "result": "For third period you have gym class with Mrs. Fuddmeadow, so you stroll into class five minutes after the bell rings because you know you can. You are in the locker room. What would you like to do:", "action_results": [{"action": "Talk to your buds about your latest alchohol consumption", "result": "You decide to talk to your buds about your latest alcohol consumption.\n\nAs you start talking about all the booze you had for breakfast, you start feeling very woozie. Your friends help you to the bench and lay you down, but walk away and will not touch you as soon as you start to splurge up your Budweiser.\n\nThey all laugh at you while you die, choking on your own vomit. The last words you hear are, \"Huh huh, that kid can't hold his beer!\"\n\nNote for future: beer does not go with corn flakes and codine.", "action_results": [{"action": "Click here to end the game", "result": "Well, I gues you couldn't cut it in the life of a FHS student. Better luck next time.\nYour final score is: 031", "action_results": [null, null, null]}]}, {"action": "Put on your gym clothes", "result": "You decide to put on your gym clothes.\n\nYou change into your FHS Gym Uniform and head off to class. You sit down in your proper warmup squadron and Mrs. Fuddmeadow, your gym teacher, tells the class to start warmups. You first start with push-ups. What do you do:", "action_results": [{"action": "Impress the cute girl/guy next to you and do them as fast as you can", "result": "You decide to do pushups as fast as you can.\n\nYou move your body up an down at amazing speeds - it must be an adreneline rush. After your 58th push up, your elbow joints snap and your spinal column gives away. From the sheer momentum of your pushup speed, your head shatters on the ground as it crashes down. Blood splurts everwhere as your brains slowly ooze out of your crushed head. You die.\n\nDid you forget you had a severe case of arthritis? Whoops.", "action_results": [null]}, {"action": "Do as little as possible with the least amount of effort", "result": "You decide to do as little as possible with the least amount of effort\n\nYou lazily finish your pushups and other warmups, making sure to put effort into it only when the teacher is watching. Mrs. Fuddmeadow announces that, because of the Pep Rally later today, it is a free day. You can play just about any sport. What do you do:", "action_results": [{"action": "Go swimming in the pool", "result": "You decide to go to the swimming pool\n\nYou quickly change into your swimming suit and go into to the swimming pool. What would you like to do:", "action_results": [{"action": "Swim in the deep end", "result": "You decide to swim in the deep end\n\nYou dive right into the cold, slimy water. You pop your head out of the water, push your wet hair back, and fling off a piece of algee that was stuck to your hand.\n\nYou remember reading in the Fairview Cult Bulletin that there is a Fairview Cult logo on the bottom of the pool, so you go down to check it out. As you go near the bottom of the pool, your foot gets sucked in the broken drain vent. You strugle around and try to free but have no luck. After a few minutes, you take a huge gasp of water in and drown. You die.\n\nAt least you know how long you can, er could, hold your breath.", "action_results": [null]}, {"action": "Swim in the shallow end", "result": "You decide to swin in the shallow end\n\nYou jump in the shallow end like you've always jumped in the shallow end -- head first. This time, however, you jump a little too quickly and smash your head against the nice, hard pool bottom. Your head splits right open and turns the pool a nice red color and little as bits of your brain float to the top. You die.\n\nFor future reference: \"No Diving In Shallowe End\" means no diving in shallow end.", "action_results": [null]}, {"action": "Swim in the middle end", "result": "You decide to swim in the middle end\n\nYou are jump in the pool and chill out in the middle end, treading water. You hear a loud \"Aiiieeee!\" and turn around just in time to see a gigantic wrestler from the Fairview Wrestling Federation do canonball right on top of you. The impact snaps your kneck and your paralized body sinks to the bottom of the pool. You die.\n\nDuh! There is no middle \"end\" -- it is just the middle!", "action_results": [null]}, {"action": "Look at the cold, murky, cess pool and then decide not to go in because you don't feel like it, it's early in the morning, it's GROSS, and so on.", "result": "You decide to try somemthing else.\n\nWhat would you like to do:", "action_results": [{"action": "Play some basketball", "result": "You decide to play some basketball\n\nYou walk over to the court and see a bunch of people running up and trying to slam dunk the ball. No one has been able to to it yet. Johnny Jimclass is up next and is getting ready to go for it.\n\nWhat do you do:", "action_results": [{"action": "Trip Johnny as he tries to slam dunk", "result": "You decide to trip Johnny as he tries to slam dunk\n\nEver so innocently, you extend your foot just as Johnny Jimclass runs towards the basket. He trips over your foot, flies a few feet in the air, and crashes face down on the ground.\n\nInfuriated, he gets up and grabs the basketball. He whips the basketball as hard as he can, nearly approaching the speed of sound. You hear the ball whiz right past your head. The ball flies past you, bounces off the wall, and hits Mrs. Fuddmeadow smack dab in the forehead. She falls backwards and hits the ground.\n\nJohnny Jimclass flees the scene. What would you like to do now:", "action_results": [{"action": "Pick up a ball and \"accidentally\" hit Mrs. Fuddmeadow wth it", "result": "You decide to pick up a ball and \"accidentally\" hit Mrs. Fuddmeadow\n\nYou grab one of the basketballs and look over to your friend standing in the corner. You yell out his name, and whip it at him. You must have slightly miscalculated, as the ball flies right over to Mrs. Fuddmeadow and hits her right in the back of the head. She falls to the ground. What do you do now:", "action_results": [null, {"action": "Grab a ball and go for the slam dunk", "result": "You decide to grab a ball and go for the slam dunk\n\nYou pick up a basketball and ready yourself to go for the big dunk. All of the basketball jocks cheer you on. You run up to the basket as fast as you can, jump as high as you can, and ... you actually make it!\n\nYou land on your feet, but then slip on a puddle of sweat, and crash face first to the floor. You feel your jawbone SNAP and can taste loose teeth in your mouth.\n\nAs you are about to get up, you hear the jocks cheearing again, and you see Johnny Jimclass going for the slam dunk, missing, and lands right on your chest, collapsing it. Everything fades to black as you struggle to take your last breath. You die.\n\nTsk Tsk Tsk. Show off!", "action_results": [null]}, {"action": "Try to talk trash like the basket ball jocks", "result": "You decide to try to talk trash like the basketball jocks\n\nYou start quoting the Nike commercials and a few lines from White Men Can't Jump. But, while laying down some Yo Mamma jokes, you offend one of the Suburban Gangster Wannabees. Angrilly, he pulls out his \"piece,\" a pocket knife that he got in his Christmas stocking from his dad, and cuts you bad. You die.\n\nThat's the last Yo' Mamma joke you'll ever tell", "action_results": [null]}, null]}, null, null, null]}, null, null, null, null]}, {"action": "Sit and talk with your friends", "result": "You notice Number 13 and Jerry Pimpavelli, another cult buddie, is sitting aroud doing nothing. You go up to them and join in the slacking. Number 13 is talking about how unfair he thinks the school elections were and how he thinks they were fixed. After a few minutes, Mrs. Fuddmeadow tells you to do something -- you can't just sit around and talk!\n\nWhat to do now:", "action_results": [null, null, {"action": "Tell Mrs. Fuddmeadow you are sick", "result": "You decide to tell Mrs. Fuddmeadow you are sick\n\nYou walk up to her and tell her you have an awful stomach ache. She says, \"Hmmmm. You might want to see the nurse.\"\n\nShe gives you a pass to go see the school nurse. What would you like to do now.", "action_results": [{"action": "Go directly to the nurse's office", "result": "You decide to go to the nurse's office\n\nYou walk past the main office, past Mr. Greenwall's office, and into the nurse's office. The secretary tells you that the nurse will be back real soon. You sit in the nurse's office and look around. What would you like to do:", "action_results": [{"action": "Play with the tounge depressors", "result": "You decide to play with the tounge depressors\n\nYou open up the glass jar of tounge depressors and take a handful of them. Then, you try to flick one in the garbage can. You miss. You try again, and again, and again, until finally, on the eigth toss, you make it.\n\nNext, you make a little \"tounge depressor pyramid\" on the counter and then knock it down by throwing one at it.\n\nFifteen minutes later, the bell rings and the nurse never came. You throw the remaining twenty-four depressors in the garbage and leave for lunch.", "action_results": [{"action": "Continue ...", "result": "Lunch Time!\n\nYou walk by the cafeteria, smelling burnt food permeating through out the hallway, and look in to see all of your friends. You saunter in, avoiding a spilled pop mess left by the junior high school swine, and think of what you should do before you go to sit down to your lunch table. The lunch period seems to be moving especially slow today, normally it is half over by now.\n\nWhat would you like to do:", "action_results": [{"action": "Go sit down at your lunch table", "result": "You decide to go sit down at your lunch table\n\nYou go to sit down, but notice that some one, most likely junior high school swine, either spilled chicken fajita or puked up all over the chair. Whatever it is, you are not going to sit on it. What would you like to do:", "action_results": [{"action": "Stand around by your table", "result": "You decide to stand around your table\n\nAfter a few seconds of standing there, one of the lunch ladies yells at you for standing. You have to either sit down or keep moving. What to do?", "action_results": [{"action": "Go look for a chair", "result": "You decide to go look for another chair\n\nYou walk to a few adjacent tables and attempt to grab a chair, but a snotty Fairview High School student yells at you and says \"some one is sitting there\".\n\nYou have no luck and return to your table. Your seat still has an icky mess on it. What would you like to do:", "action_results": [null, {"action": "Keep looking for a chair", "result": "You decide to keep looking for a chair\n\nYou walk around the cafeteria some more, but turn up nothing. You return to your table and see your seat still has an icky mess on it. What would you like to do:", "action_results": [null, null, {"action": "Roam around the cafeteria", "result": "You decide to roam around the cafeteria\n\nYou wave to John, the Cafeteria worker, as he is asking a student to stack his tray lunch tray neatly. Number 873 is handing out Sour Patches candy to people because today is \"Fairview Cult Day\". There's all sorts of stuff to do in the cafeteria. Where would you like to wander to:", "action_results": [{"action": "Go to the army recruiter", "result": "You decide to go to the army recruiter\n\nThe army guy has a shaved head and doesn't seem to be happy. He looks tough and he's got the eyes of a drone. As you approach, he greets you with \"Hi! I've once went to Fairview! Would you like to join the Army?!?\" Next to the army guy, you see a Fairview Cult recruiter sitting, giving free teeshirts to new members. What would you like to do:", "action_results": [{"action": "Grab a bunch of army bumper stickers", "result": "You decide to grab a bunch of army bumper stickers\n\nHe says \"Hey son! So, you're interested in the army, huh?\" He gets real close to your face, smiling he shouts \"THE ARMY IS A GREAT PLACE TO GO!\" He flings specs of salivia in your face while he talks. What do you do:", "action_results": [{"action": "Sign me up! I want to be the best that I can be!", "result": "You decide to act like you care and want to join the army\n\nHe says \"What your name, son?\" You tentaively give him your name and he laughs and says \"Ho! Ho! Ho! Welcome to the army, son! Your life will be nothing like ... army, army, army, army!\"\n\nBefore you know it, another army guy comes in and escorts you away saying \"Congratulations, army, army, army, army, army...\"\n\nThere is nothing left for you to do except army.\n\nWell atleast you get to sleep in till 5:00AM on sunday. Nice drill seargent.", "action_results": [null]}, {"action": "Ask him if he's ever been in a conspiracy or heard of them", "result": "You decide to ask him if he's ever been in a conspiracy\n\nHe replies to you:\n\"No! There is no such thing! I was not used as a lab rat in vietnam! Nor was I given large amounts of brainwashing drugs! All those movies are false! Deny everything! Deny everything! NO NO NO!!! Deny NONONO Deny Deny Everything\"\n\nHe twitches a bit then asks \"Anything other questions, son?\"", "action_results": [null, {"action": "Ask him if he's believes in the commandment \"Thou shalt not kill\"", "result": "You decide to ask him if believes in \"Thou shalt not kill\"\n\nHe stumbles around and replies:\n\n\"But..um...uh...yeah. Of course I do!\" He has a vacant expression and just stares into space. What would you like to do now:", "action_results": [null, null, {"action": "Say \"Do I get to use a gun and kill people?\"", "result": "You decide to ask if you get a gun and get to kill people\n\nHe yells: \"Of course you do, son! Oh yeah, POP POW! BANG! It is the most is the most exciting thing of your life! You get a double barrel shot gun BOOM put a big old hole the size of a bowling ball in someone!\"\n\nWhat do you do:", "action_results": [null, null, null, null]}, null]}, null, null]}, null, null, null]}, {"action": "Take some army propoganda", "result": "You decide to grab a bunch of army propoganda\n\nHe says \"Hey son! So, you're interested in the army, huh?\" He gets real close to your face, smiling he shouts \"THE ARMY IS A GREAT PLACE TO GO!\" He flings specs of salivia in your face while he talks. What do you do:", "action_results": [null, null, null, null, null]}, null]}, {"action": "Go to the pop and vending machines", "result": "There are three vending machines in the cafeteria. What one would you like to look at:", "action_results": [{"action": "The Candy / Snacks Machine", "result": "You decide to go to the candy / snacks machine\n\nYou see the same old stuff in the machine. What would you like to buy?", "action_results": [{"action": "Rice crispies treat", "result": "You decide to buy something\n\nYou plop three quarters in the machine, press the corresponding button ... and that's it. Nothing comes out. You just got ripped off! What would you like to do:", "action_results": [null, null, {"action": "Read the posters around the cafeteria", "result": "You walk over to the bulletin board and see five posters hanging up. You happen to glance at the clock and notice that no time has passed since you have arrive in the cafeteria. What would you like to read?", "action_results": [{"action": "Bill Murrry Poster", "result": "BILL MURRY Playing at Speak In Tounges! Only $5\n\n\nYou should take your GRANDMA.\nShe bakes awsome OATMEAL COOKIES\nbetter than the ones in THE VENDING MACHINES\nTell everyone about Bill Murrry and\nespecially GO TO YOUR TABLE and tell them this\n\n\nWhat poster would you like to read now?", "action_results": [{"action": "Fairview News Poster", "result": "FAIRVIEW NEWS\n\nRead Fairview News every week.\n\nAlso, check out the FN Website, at\nFairviewNews.halogenstudios.com\n\n\nWhat would you like to read now?", "action_results": [null, {"action": "Fairview Cult Poster", "result": "WEIVRIAF TLUC\n* This is not a Fairview Cult Poster\n\n\nWhat poster would you like to read now?", "action_results": [null, null, {"action": "Orph Poster", "result": "Orph playing at Xandu\nORPH ORPH ORPH\n\nWhat poster wouldyou like to read now?", "action_results": [null, null, null, null]}, null]}, null, null]}, null, null, null]}, null, null, null, null]}, {"action": "Go into the lunch line", "result": "You decide to rush into the lunch line\n\nAs you enter, you dodge an ice cube tossed at you. You notice the cafeteria workers serving people and grabbing food without gloves. You are at the end of the line. What would like to do:", "action_results": [{"action": "Continue In Line ...", "result": "You continue in the line ... what would you like to do now:", "action_results": [{"action": "Combine nachos from another plate onto yours", "result": "You decide to put extras nacho on your plate\n\nA you grab some more nachos from another plate, the lunch lady yells \"HEY PUT THAT BACK! WHAT DO YOU THINK YOU ARE DOING? NO NABBING NACHOS!!!\"\n\nYou put the extra nachos back. You pay for your single plate of nachos. On your way out, you slip a nutty bar in your pocket, just out of spite.\n\nYou run into John Videc, who asks: \"Hey dude, ya got 40cents?\" What would you like to do now:", "action_results": [{"action": "Give him your change, 40cents", "result": "You decide to give Jon 40 cents\n\nYou slip you hand into your pocket and pull out fourty cents. You hand it over to him and he says:\n\n\"Aw Dude! Thanks a lot! Hey, by the way...I don't know where are the chairs are today, but if you just keep looking you will find one!\"\n\nOddly, you notice that no time has passed since you walked in the cafeteria. What would you like to do now?", "action_results": [null, null, null, {"action": "Leave the cafeteria", "result": "You decide to leave the cafeteria\n\nJust as you are about to leave, a gaurd stops you dead in your tracks. He reminds you that you may leave only 4 minutes before the bell rings. What would you like to do?", "action_results": [null, null, null, null, null]}]}, {"action": "Give him what you just ripped off", "result": "You decide to give him what you stole\n\nHe says, \"hey, it's not 40 cents, but it's food! Thanks!\" As you walk away, you see the lunch lady come out and start to question him. He got busted.\n\nYou notice that no time has passed since you got in the cafeteria. Where would you like to go?", "action_results": [null, null, null, null]}, {"action": "Don't give him anything", "result": "You decide to not give him anything\n\nYou tell John, \"sorry dude I don't have any money.\" As he walks away with a sad, puppy dog expression, a lunch lady comes up to you and says that she needs to talk to you in the back. She says that she knows what you ripped off and but will let you go. All she wants you to do is turn around.\n\nYou comply with her ackward request and start to feel salt, pepper, and other spices being poured on to you. You ask her what on earth she is doing. She says \"making lunch\" and then pusshes you in the Taco Master 2001. You get ground up and are tomorrow's mexican food.\n\nAlways give a Videc something ... it's just good luck", "action_results": [null]}]}, {"action": "Get for two pieces of pizza and eat one before the cashier so you don't have to pay for it", "result": "You decide to eat your pizza in the line\n\nYou ask the server for a pizza meal with an extra slice of pizza. You scarf down one of the pieces before you get to the cashier. As you go to pay for one piece of pizza, you say with your mouth full and pizza sauce all over your face, \"hanc eyou\". The lunch lady looks at you funny and charges you for the milk, squishy pears, and one piece of pizza.\n\nYou leave the line, but on your way out, run into John Videc. He asks, \"Hey man, can I bum 40cents?\"\n\nWhat would you like to do now:", "action_results": [null, {"action": "Give him your pizza", "result": "You decide to give him a slice of pizza\n\nHe says \"Aw dude! You rule! Hey, by the way, I don't know where all the chairs are, but if you keep looking you will find one!\" What would you like to do.", "action_results": [null, null, null]}, null]}, {"action": "Put a oatmeal cookie under your slice of pizza", "result": "You decide to put a oatmeal cookie under your slice of pizza\n\nYou get away with it! The lunch lady does not notice, and charges you for only the pizza plate!\n\nOn your way out, you into Jon Videc. He says \"Hey Dude, ya got 40cents?\" What do you do?", "action_results": [null, null, null]}, {"action": "Continue to the cashier without stealing anything", "result": "You decide to pay for your lunch and not steal anything\n\nThe lunch lady says \"thank you. This money will be going towards exterminating the Fairview Cult in school. Aren't you glad?\"\n\nBefore you can reply, she looks into your eyes and realizes that you are in the cult. \"Hey he's one of them! Get him!\"\n\nFive guys with non lethal weapons pop out of the back and bag you. The take you to a deprograming station and recondition you into a mindless zombie. You become a drone of FHS.\n\n\"School is good, right?\" Yes, master. School is good", "action_results": [null]}]}, {"action": "Steal a nutty bar and walk out the back", "result": "You decide to steal something\n\nYou slip it down your pants and casually walk out of the line, pretending you didn't want anything. Then, you run into John Videc, who asks you if he could borrow 40 cents, for his 40-cent discounted lunch. What do you do:", "action_results": [null, null, null]}, null, {"action": "Open up a milk and drink it in the line", "result": "You decide to open up a milk and drink it in the line\n\nThere are three types of milk to drink. Which would you like to drink?", "action_results": [{"action": "Regular, 2% White Milk", "result": "You decide to drink the regular 2% milk\n\nYou open it up and see that there are ice chunks in it. You say \"cool, milk slushie\". As you guzzle down the milk, you realize that the ice chunks are really milk chunks and the milk is curtled and bad. The milk is so old that it kills you. You die.\n\nWhy cant you drink chocolate milk like everyone else you freak!", "action_results": [null]}, {"action": "2% Chocolate Milk", "result": "You decide to drink the chocolate milk\n\nYou chug it down and throw the container under the counter. It was some good milk. You contiue on.", "action_results": [null]}, null]}, {"action": "Rip off an entire pizza", "result": "You decide to steal an entire pizza\n\nYou another friend work out the standard pizza-rip off technique:\n\nYour buddy goes to on of the cashiers and gets change for a five dollar bill. Meanwhile, you take the pizza out of the heater, and indicate to the other lunch lady that your friend is paying for it. She nods and you casually walk out with the pizza.\n\nOn your way out, you see John Videc. He says \"Aw Dude! Lemme have a piece of pizza! Common!\" What do you do:", "action_results": [null, null, null]}]}, null, null]}, null, null, null, null, {"action": "Grandma's Oatmeal Cookie", "result": "You plop three quarters and the machine and out comes the wholesome Grandma's Oatmeal Cookies. What would you like to do now.", "action_results": [null, null, null, null, null, null]}, null]}, {"action": "The Soda Pop machine", "result": "You decide to go to the soda pop machine\n\nThe pop machine has a big OUT OF ORDER SIGN on it. You remember reading in the Fairivew Cult Bulletin that the it purposely shut down so students can't have caffine. Caffine interferes with much of the brainwashing given in FHS.\n\nThen all of a sudden Eric Herron from punk band S.D.W.B. pops out from behind the pop machine and gives you a cold, unopened Mountain Dew. He says \"Here dude. It's FILLED with caffine but it also has a little bit of Yellow 5.\"\n\nYou ask him what Yello 5 is and he just smiles and walks away, headbutting a freshman and poking his eyes out with his spiked hair. What would you like to do now:", "action_results": [{"action": "Hand the mountain dew to someone else trying to use the pop machine", "result": "You decide to drink the mountain dew\nAs you chug the cold drink you just remember the shrink factor behind Yellow 5. What would you like to do now:", "action_results": [null, null, null, null, null, null]}, {"action": "Drink it down and get a lot of caffine", "result": "You decide to hand the mountain dew to some one else\n\nThis is good because you just remembered the shrinkage factor of Yello 5 that you read in Fairview Cult literature. What would you like to do now.", "action_results": [null, null, null, null, null, null]}]}, {"action": "The Mystic Beverage Machine", "result": "You decide to go to the Mystic machine\n\nYou walk up to the machine and see Number 2 of the Fairview Cult standing by it. As you are about to put your dollar in, Number 2 asks you if you would like a Mystic for 75 cents instead of a dollar. What do you do?", "action_results": [{"action": "\"No Thanks\", and put a dollar in", "result": "You decide to put a dollar in\n\nYou put a dollar in the machine, but it doesn't work and just takes your dollar. Number 2, still standing there, offers to get you a Mystic for 85 cents. You decide to give it to him.\n\nHe lays on the floor, reaches his hand up the machine, and uses his keys to open the grate. It beeps a little, but no louder than an alarm clock. He sticks his entire arm up the machine and grabs you a Mystic.\n\nYou take it from him and open it on up. You drink a few sips of it and realize that it tastes like CRAP! It is so bad, you end up giving it away. What would you like to do now?", "action_results": [null, null, null, null, null, null]}, {"action": "\"Okay\", and hand him three quarters", "result": "You decide to put a dollar in\n\nYou fork 75 cents on over to Number 2.\n\nHe lays on the floor, reaches his hand up the machine, and uses his keys to open the grate. It beeps a little, but no louder than an alarm clock. He sticks his entire arm up the machine and grabs you a Mystic.\n\nYou take it from him and open it on up. You drink a few sips of it and realize that it tastes like CRAP! It is so bad, you end up giving it away. What would you like to do now?", "action_results": [null, null, null, null, null, null]}, null]}]}, null, null, null, null]}, null, null]}, null, null, null]}, null, null, null]}, null, null, null, null]}, null, null, null]}]}, {"action": "See how much you weigh", "result": "You decide to see how much you weigh\n\nYou jump on the some-what new digital scale. It flips through a bunch of numbers and then gives you your weight: -451 pounds. You get off the scale and get on it again. Now, you weigh 1 pound. Giving up, you get off the scale and look for something else to do. What would you like to do:", "action_results": [null, {"action": "Slip some BandAids into your pocket", "result": "You decide to slip some BandAids into your pocket\n\nYou glance all around to see if anyone is looking, then grab a handful of BandAids and slip them into your pocket.\n\nA few seconds later, you hear a voice on the PA System: \"We saw that. Put them back ... now!\"\n\nYou reach into your pocket and put every single one back. You look around but see no hidden cameras. What would you like to do:", "action_results": [null, null, {"action": "Lay on the cot and sleep", "result": "You decide to lay on the cot and sleep\n\nYou hop on the cot and stretch out. You look at the brown stained celing and close your eyes and doze off. Later on you wake up to the bell ringing the nurse never came. You get up and go to lunch.", "action_results": [null]}, {"action": "Be good and sit and wait", "result": "You decide to be good and sit and wait\n\nYou sit in the faded black chair and wait. Twenty minutes later, the bell rings. The nurse never came by. You pack up your things and head out for lunch.", "action_results": [null]}]}, null, null]}, null, null, null]}, {"action": "Stop by the Senior Study hall in the cafetiera to see your friends", "result": "You decide to go to the cafeteria and see your senior study hall friends\n\nYou stop by the cafeteria and look around. The only notable senior there is Adam O'Malady. He has his Marine Corps boots on the table and is smoking a cigarette. You nod to him and contiue on your way to the nurse's office", "action_results": [null]}]}, {"action": "Go outside to the track", "result": "It's a farily nice day, so you go outside to the track and look around. You see your classmate, Johnny Jimclass stretching. He asks you, \"Ummmm ... you wanna race?\" What do you do:", "action_results": [{"action": "Race Jonny Jimclass", "result": "You decide to race Johnny Jimclass\n\nYou do a few quick stretches and get ready to race Johnny. You hear some one yell, \"On your marks ... get set ... go!\" and you both take off. You start to inch past Johnny. He notices this and gives you a nice shove, causing you to trip and fall, and then hit a fence post face on.\n\nYou smack against the metal pole, causing you to loose a few teeth and get a broken nose and jawbone, then fall backwards, hitting your head on the hard cement ground. You hear people running up to you yelling \"are you okay?\" You close your eyes and peoples' screaming and yelling comes to a halt. You die.\n\nYou still didn't beat Johnny, now did you!", "action_results": [null]}, {"action": "Run up and down the bleachers", "result": "You decide to run up and down the bleachers\n\nYou run up, then down, then up, then down, then up, then down, making a huge commotion the whole time. But, you then realize that running up and down the bleachers suck. You reconsider your options. What would you like to do now:", "action_results": [null, null, null, null, {"action": "Go to the climbing ropes", "result": "You go to the climbing ropes and see a few people hanging around. Johnny Jimclass working his way up to the top of the ropes.", "action_results": [{"action": "See how high you can climb the ropes", "result": "You decide to see how high you can climb\n\nAfter a little bit of climbing, you make it to the top of the rope and show all of your crushes that you can make it to the top.\n\nMrs. Fuddmeadow notices and yells \"great job!\" She gives you a big smile and yells out \"Hey gang, every one should be like our expert rope climber here!\"\n\nYour number one crush waves at you and, being so confident of yourself, you wave back. With only one hand on the rope, you loose grip and fall to nice soft mats below. Unfortunately, you land head first and just don't make the fall. You die.\n\nTsk. Tsk. Tsk. Show off!", "action_results": [null]}, {"action": "Try to knock Johnny off of the ropes", "result": "You decide to try to knock Johnny off of the ropes\n\nJust as Johnny makes it to the top, you grab the rope and swing it around. He looses his grap and falls from the ropes. You move out of the way just in time before he falls on you. Every one gets a good laugh except Johnny Jimclass. What would you like to do:", "action_results": [null, {"action": "Swing around like Tarzan on the ropes", "result": "You decide to swing around like Tarzan on the ropes\n\nYou swing around knocking and kicking people in the head as you fly by. Mrs. Fuddmeadow kindly asks you to stop and you kindly reply to her \"Oh-Oh-OHHHHHHHH (A Tarzan yell).\" Mrs. Fuddmeadow walks away, but the repetitive joke still gets laughs, especially from the opposite sex. You even get a phone number out of it! Damn your hot!\nWhat would you like to do:", "action_results": [null, null, null]}, null]}, null, null]}, null, {"action": "Run around the track", "result": "You decide to go around the track\n\nAfter your first lap, you realize how lame of an option this is to choose, especially since there are somany other things to do. What would you like to do:", "action_results": [null, null, null, null, null, null, null]}, null]}, null, null, null]}, null]}, null, null, null, null]}]}, null, null, null, null, null]}, {"action": "Lay on the floor and do nothing", "result": "You decide lay on the floor and do nothing\n\nWhile you lay on the dirty gym floor, watching everyone else do pushups, you glance up at Mrs. Fuddmeadow. She notices you doing nothing and gives you glares at you with the Evil Eye. All of a sudden, you can't breathe at all any more and your heard feels as if it's shrinking right in your chest. You start to hear a demonic laughter and the music from the Omen series in the back of your head.\n\nMrs. Fuddmeadow rushes over, yelling \"Annie Annie are you okay\" and begins to administer CPR. As she brings her face closer to yours, you see flames in her eyes, and as soon as she presses her lips against yours, you feel your soul being ripped out of you and sucked into her. Your lifeless body falls lays limp on the gym floor.\n\nThere is a difference between slacking and not working. Duh.", "action_results": [null]}]}, {"action": "Say you forgot your clothes", "result": "You walk out of the locker room and tell Mrs. Fuddmeadow that you forgot your gym clothes. A classmate overhears you and says \"Hey, don't worry! I've got a sprare set of gym clothes you can use - they are brand new!\"\n\nYou take the clothes from him and notice that they have the Fairview Cult Eye right under the FHS logo. He winks and says \"don't worry, we've got ya covered!\"\n\nYou have no choice but to change into the clothes.", "action_results": [null]}, {"action": "Lean on wall", "result": "You decide to lean on the wall.\n\nAs you do this, the wall falls inward, causing cement to fall on you and crush you. With the few tonnes of cememt on you, just about every bone in your body is broken and most of your internal organs are ruptured. As you life slips away, a classmate comes up to you and says, \"Oh yeah, don't lean on the wall.\"\n\nBelieve it or not, this based on a real incident. This page was inspired by a wall actually falling on a student at Fairview High Shool in Fairview Park, OH. If you go to FHS, and look at the wall in the gym locker room, you can see it is bolted to the surrounding walls.", "action_results": [null]}, {"action": "Talk to the football coach", "result": "You decide to talk to the football coach.\n\nSince the football coach is really into hunting, you tell him about a deer you bagged that had twenty tips on its antlers. He says \"Oh thats nuthin'! I shot me a bear that had twenty-two tips on its antlers!\"\n\nNext, he pulls out Old Betsy and says \"this here is my favorite deer hunting rifle. So easy to use, I'll tell ya what, all you gotta do is press this trigger right h---\"\n\n----- KA-BOOOOOOM -----\n\nHe accidentally shoots his gun and blows your head off. Your brain and eyeballs fly across the room and land right next to the \"Horse Play Can Hurt Seriously\" sign and your decapitated body falls to the ground, with blood gushing out of your neck stump.\n\nHot-Biggety-Bam-Blam-BOOM!", "action_results": [null]}, {"action": "Tell your gym teacher, Mrs. Fuddmeadow, that you are sick", "result": "You decide to Tell the gym teacher that you are sick.\n\nYou tell your teacher that you have a horrible stomach ache. She replies: \"You know, this is not the kind of work you can get off of the Homework Hotline. You've missed around 8 or 7 or 5 days in the pass two weeks because you were sick! Now get your clothes on and get to class!\"", "action_results": [null]}]}]}]}]}]}, null]}]}]}, null]}, {"action": "Ignore Joe and continue to the office", "result": "You decide to ignore Joe and contiue down to the office.\n\nAs you are leaving the art room, Number 2 yells at you for not giving respect where respect is due. Shocked at this comment, you start to walk backward and accidentaly walk into a spinning clay wheel.\n\nThe clay wheel digs into your side, causing you to fall right on top it. The clay on the wheel has an exacto knife stuck in it, blade side up, so the exato knife goes right through your eye. Plus, since it's spinning around, it moves all around in your head, causing blood to start pouring out of all of your gaping wounds.\n\nOf course, the clay gets all bloody. The art student working on his clay project gets mad you for ruining his clay project and stomps you to death.\n\nTsk Tsk Tsk. You should have said hi to The All American of Fairview Park, Joe Barney", "action_results": [null]}]}]}, null]}, {"action": "Refuse to go to the office", "result": "You decide to refuse to go to the office.\n\nYour language teacher shrugs and says, \"okay, you can go at the end of class.\" He then tells you to go to the office for violating the \"12 inch\" rule of sleeping in class.\n\nWhat do you do:", "action_results": [null]}]}]}, null, {"action": "Do homework for another class", "result": "You decide to do homework for another class\n\nThe teacher catches you doing other homework and laughs, saying, \"thank goodness for the right to bear arms!\" He then lifts up his shirt sleeves and beats you to a bloody pulp.\n\nYour classmates find this hysterical and promise not to tell on the teacher because he is so cool.\n\nWell hey, atleast you got your math homework done.", "action_results": [null]}]}]}, {"action": "Ignore him", "result": "You decide to ignore him.\n\nThe cult guy keeps trying to convince you to join. The study hall monitor hears the whispers and yells at you for talking. When you try to explain that you weren't talking, you get sent down to the office. As you walk in his office, the Principal Schillick grabs the paddle on his wall and says, with an evil sneer, \"I've been looking for an excuse to use this.\" He then beats you to death with it.\n\nWhat a loser. YOU DIED", "action_results": [{"action": "Click here to end the game", "result": "Well, I gues you couldn't cut it in the life of a FHS student. Better luck next time.\nYour final score is: 000", "action_results": [null]}]}]}, {"action": "Sign up as an A/V Aide", "result": "You decide to become an aide for the A/V department.\nYou can do whatever you want. What would you like to do:", "action_results": [{"action": "Roam around the halls", "result": "You decide to roam the halls.\n\nYou are walking around the quiet, musky smelling halls of FHS, loving your ability to roam freely as an A/V aide. While looking for things to do, you run into a roving band of suburban gangster wannabes - middle class, white teenagers dressed and talking as if they were born in the ghetto. The start beating you up for \"Roamin' Der Hallz!\" You call out for the nearest teacher, Doc Shaver, but he is nowhere in sight.\n\nDamn suburban gangster wannabes!. YOU DIED", "action_results": [null]}, {"action": "Stay In the A/V Office", "result": "You decide to stay.\n\nWhile chilling in the A/V office, watching daytime court dramas, Number 4 from the Fairview Cult passes through and hands you the Fairview Cult Bulletin. Then, he asks you if you would like to join the cult. What do you say:", "action_results": [null, {"action": "Ignore Him", "result": "You decide to ignore him.\n\nNumber 4 shrugs his shoulders and continues on his way. A few minutes later, the A/V leader, Mike SportsInstructor, asks you to move a TV from Mr. Xy's room to Dr. Mezzler's room.\n\nYou leave to grab the TV, and on your way to Dr. Mezzler's room, you are stopped by a roving band of suburban gangster wannabes - middle class, white teenagers dressed and talking as if they were born in the ghetto. The mug and suffocate you with their $200 Starter jackets, then take the TV.\n\nDamn suburban gangster wannabes! YOU DIED", "action_results": [null]}]}]}, {"action": "Go to the library", "result": "You decide to go to the library.\n\nAs you walk in, Mrs. Rollings, the school librarian yells at you and tells you to go back to study hall. Only half of the study hall is allowed in the library, and today is not your alphebetically designated day. What would you like to do:", "action_results": [null, {"action": "Sneak past Mrs. Rollings", "result": "You decide to sneak past Mrs. Rollings.\n\nYou successfully sneak past Mrs. Rollings. What would you like to do:", "action_results": [{"action": "Get a book", "result": "You decide to get a book.\n\nYou pull a random book off the shelf, \"The [censored] Adventures of Tom Sawyer.\" You start flipping through the pages and see that Fairview Cult Bulliten is glued to one of the pages. As you read the FCB, some girl puts her hand on the book you are reading and asks you if you would like to join the cult. She is wearing a gold ring bearing the FC eye-symbol. What do you do:", "action_results": [null, {"action": "Ignore Her", "result": "You decide to ignore her.\n\nMrs. Rollings comes over and yells at you for talking. When you point out you were being silent, she yells at you because it is not your alphabetically designated day.\n\nShe grabs the Random House Censored Unabridged dictionary and hits you over the head with it, knocking you out. You are then dragged down to the cafeteria and tossed in the Taco Master 2000. You get ground up and chopped and end up in many peoples' tacos.\n\nMmmm....Mexican food. YOU DIED", "action_results": [null]}]}, {"action": "Talk to your friends", "result": "You decide to talk with your friends.\n\nAs you are chatting with your buddies, the nice librarian assistant comes up to you and hands you an envelope that she says is from the office.\n\nYou rip it open to find the Fairview Cult Bulliten. After you read through it, a girl from another table looks at you and asks you if you would like to join the Fairview Cult. What do you do:", "action_results": [null, null]}]}]}]}, {"action": "Stay home and sleep", "result": "You decide to stay home and sleep.\nMr. GreenWall, the assistant principal, calls home and alerts your mother that you are not at school. What are you going to do:", "action_results": [{"action": "Talk it out with your mom", "result": "You decided to try to talk it out with your mom.\nYour talking does not work, so your mom grabs your dad's shotgun from under her mattress and **BOOM** she shoots you.\n\nStay home in a game about school? How lame!", "action_results": [null]}, {"action": "Run away from your mom", "result": "You decide to run away from your mom.\nYour mom chases you outside and catches up with you. She then proceeds to beat your head against the curb.\n\nStay home in a game about school? How lame!", "action_results": [null]}]}]}]}