{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=8038", "context": "", "first_story_block": "You survey the battlefield that you’ve created. All sides have been at war for a long time, and also evenly matched. Who will win? It will all be decided on tonight.\n\n“Hey! Its time to go to bed!” you Mom says coming into your room.\n\nOr at least it would be, if you didn’t have to go to bed!\n\n“Aw Mom! I was just about to do something!” you protest.\n“Well you can do something tomorrow, right now its bedtime, you know the rules. But before you do remember to brush your teeth and put these toys away.”\n“But…but can’t I leave them out? I got everything set up and like everything! The final battle for the universe is going to take place!”\n\nYour Mom surveys everything you’ve set up. You have a myriad of unusual toys and figures standing next to each other. You have plastic knights standing next to space men defending a castle made of blocks on one side while across from them has a combination of green army guys in vehicles and some metal robots. And yet on the far side of your room is another army set up consisting of dinosaurs and some other monsters. She just smiles at your creativeness.\n\n“Very well, it looks like you went to a lot of trouble, so okay. You certainly do have a vivid imagination to come up with some of the games you do.”\n\nHappily you go brush your teeth, and think about the battle that’s going to take place tomorrow! General Razor will try to storm the castle and Lord Justice will defend it! And then the Dino Demons will try to destroy everything! It’s going to be so cool!\n\nAfter brushing your teeth, you head back to your room where you carefully step around the figures you’ve set up with care and get into bed. Of course as usual, you don’t fall asleep right away; you read a couple pages of your favorite comic book first. Man you wish real life wasn’t as boring as it is. There’s no magic, no super heroes, no giant robots, no nothing! You often wished you lived in a world with all of those things.\n\nYou turn off the lights in your room when your Mom checks on you again and demands you go to sleep. You’re still a little to wound up to fall asleep though, so you just lie in your bed thinking how tomorrow’s battle is going to play out.\n\nOf course one bad thing about having an overactive imagination is letting it run away with you. Your room is dark, with only the dim moonlight shining in and creating creepy shadows on your walls. You begin to think the shadows are moving, begin to get a little scared and hide under the covers. Then you think back to something your mom told you the last time you got scared like this: “Monsters aren’t real. Nothing like that exists in this world.”\nOf course she’s right, after all you just thought the world you lived in was boring by not having those types of things in it.\n\nYou slowly peer out from under your covers, but unfortunately this isn’t the work of your imagination. These shadows ARE moving and now they’re right by the side of your bed. Red dots form their eyes and a bluish light form their grinning maws. Before you can cry out, one of them puts its hand over your mouth and puts its other hand to its own with its index finger to its lips. (Or rather where its lips would be if it had any)\n\n“Shhhhhhh, the master wants to see you…there will be plenty of time to cry then, little one. Open up the portal.” The shadow says\n\nSuddenly a purple portal opens up where your closet is, and two of the shadow creatures grab and carry you into it. The shadows run around you as you’re carried down the green tunnel which the portal has lead into. They excitedly talk about how their master will be pleased for getting you. Of course all you’re doing right now is panicking, and you start to struggle to get away, surprisingly, you manage to break free of their grip and start trying to run back to where they entered this thing.\n\n“Get him! He’s trying to run away!”\n“Do it quickly before the portal starts collapsing!”\n\nAs you hear the shadows giving orders to each other, the portal tunnel that you’re in is indeed starting to flash and blink a lot, when you look down at your running feet, the purple light “supporting” you disappears every now and then revealing only blackness. You can see your room just up ahead and you ALMOST reach it, before the green tunnel disappears completely.\n\nYou yell and scream about how you wish you back home as you fall through the endless void, and while that doesn’t happen, you do suddenly appear someplace else…\n\nYou land roughly, scraping your legs and knees and getting your pajamas all dusty. After brushing yourself off and rubbing your hurting legs, you get a better look at your surroundings.\n\nYou’re in what looks to be the middle of nowhere, though there is a small group of rickety looking houses nearby, probably a small village.\n\nOne thing is for certain, you know you aren’t on Earth, because, a small multi-colored lizard like creature with three eyes scurries by your feet and into the wilderness beyond. You’re still scared, but also fascinated by this place; however, you realize you need to figure out how to get back home and what exactly is going on.", "action_results": [{"action": "Head to the village", "result": "Upon entering you see many of the villagers just sitting outside their houses doing nothing, though a couple of them are lazily plucking some sort of stringed instruments. They barely pay any attention to you at all.\n\nYou know you’re not supposed to talk to strangers, but in this situation you don’t really feel like you have a choice, so you ask one of them for help.\n\n“Hey, I need some help, these shadow things attacked me…”\n“Wazzat? Shadows? Shadows don’t come ‘round here boy, we’s got ourselves a wizard to protect us! If you got shadow problems, maybe you should talk to him. He’s a pretty smart guy. He’s in that nice lookin’ house over there, the one with the roof! Careful though, he’s usually in a bad mood. Argues with his wife constantly too.” The fat villager says going back to drinking whatever it is he’s drinking.\n\nNot knowing what else to do you head over to the wizard’s house. As you approach you can hear arguing from the inside.\n\nYou knock on the door which is opened by a young woman dressed in a waitress like outfit. She’s pretty, but looks very tired, behind her appears an older man who doesn’t look much like a wizard at all.\n\n“Whadda you want kid? We ain’t buyin’ anything!” he scowls.\n“Are you really a wizard? You don’t look like one.” You remark.\n“That’s because he isn’t a real wizard. He’s a lazy charlatan!” the woman answers.\n“Shut up Talia, I was good enough to get YOU.”\n“Yeah, that’s because I was too young and naïve to know any better! I knew I should’ve married a knight!”\n“Hah! And what knight would marry a serving wench like you?”\n“Melcar, I don’t have time for your nonsense today, I have to go to work. Can you at least TRY to do something productive while I’m gone, like casting some cantrips to cut down the overgrowth in the backyard? Sheesh, I think I saw a nest of Furms making their homes in there and you know much I hate those little purple things! They infest everything and then you can’t get rid of them! So can you DO that one thing, if nothing else?”\n“Yeah, yeah.”\n\nThe woman throws her hands up in dismay and leaves the house, leaving Melcar and you alone.\n\n“So, what’s your deal kid? I know you ain’t from this backwoods village because I know everyone here and you actually look like you bathe every once in awhile. You lost or something?”\n\nYou explain your situation to Melcar, somehow he doesn’t look surprised, but he does look a little more interested in you.\n\n“Hmm, sounds like the Nightmare Tyrant. He has a habit of snatching people from other dimensions and draining them to harness his power. Those shadows you encountered are what’s left of his victims. I’m not entirely sure of his methods for choosing, but I do know he only takes those with strong imaginations though. It’s probably why he prefers children since they tend to be more inclined to think up fantastic things.” You were lucky to escape from him.”\n“Well how do I get back home?”\n\nMelcar looks at you a moment before replying.\n\n“You interested in doing a little yard work?”\n“Uh…”\n“I’m really busy with an experiment, and I just don’t have time to mess around with clearing the overgrowth in my backyard. If you do it, I think that’ll give me time to complete my experiment, as well as giving me time to look up the spell that can take you back home.”\n“Well okay…”\n“Good, there’s a scythe in the back. You shouldn’t have too much trouble.”\n\nMelcar closes his door and you walk around the back, which literally looks like a jungle. The grass is almost as high as you are and the scythe is a little too unwieldy and large for you to use properly. Soon tiny purple people appear and angrily throw small stones at you and squeak some sort of jibberish. They apparently don’t like you trying to tear up their home.\n\nYou don’t see how you’re ever going to finish this task.", "action_results": [{"action": "Try to scare away the purple people", "result": "You try to scare the little purple people much like you’ve ran after pigeons in the park, however the purple folks won’t be chased away so easily, this is their home after all, they just nimbly get out of your way and continue to pelt you with stones, which are really starting to hurt at this point, and a particularly large stone smacks you in the head knocking you out.\n\nWhen you wake up you’re nowhere near the Wizard’s house anymore, in fact you’re quite a ways outside of the village! The purple people must’ve dragged you here. As you groggily get up, you wish that someone would help you. Just then a shadow looms over you, at first you get scared again, but fortunately this one is attached to someone. You look up and see a woman dressed in leather armor, she carries a bow on her back and a sword by her side. She gives you a serious look while she grabs your hand to pick you up. You notice she has pointy ears.\n\n“Boy, what’re you doing out here? Don’t you know it can be dangerous out here? Do you live in that village?” she asks.\n“No, I was trying to look for help there. There was a wizard who said he could help me get back home if…”\n“Wizard? There wasn’t any strong magic activity detected around here boy. Where are you from?”\n\nYou explain your story, as the woman listens intently. Much like the wizard you ran into earlier, she doesn’t seem surprised.\n\n“Mm, yes you are a lucky boy indeed to escape from the Nightmare Tyrant, most never even have a chance. I think you better come with me, my name’s Lyssia”\n“But the wizard…”\n“Trust me, you’ll be safer with me, than that so called wizard you mentioned. Sounded like a hedge wizard that was just getting you to do some grunt work that he didn’t want to do. He couldn’t help you against the shadows, let alone get you back home. I might be able to though, well the Captain might anyway. We’ll head back to my platoon’s camp.”\n\nYou feel somewhat safer with Lyssia, not to mention she seems like she’s more readily going to help you, so you follow her. Eventually you arrive at a fairly large camp with armored knights, horses, and tents. Most of them look like they’ve been doing a lot of fighting recently and are still recovering from their wounds. When you enter the Captain’s tent, you see him looking over some maps before he looks up at you. He’s a man of average build, but his weathered and tired face shows the signs of having been in battle several times. His armor displays likewise.\n\n“Lyssia, you better have a good reason for why you’re bringing this boy into my presence. This is a mobile military unit; you know we can’t be coddling civilians, let alone children.”\n\nLyssia explains the situation and the Captain’s attitude towards you changes to a more sympathetic one.\n\n“Escaping from the Nightmare Tyrant’s minions is no small feat, especially for one unprepared for such an encounter. The terror they radiate is normally enough to paralyze most with fear. You’re obviously not a battle hardened soldier to such horrors, and there’s no evidence of any magic about you. You must have an innate strong will, boy. Which is good since you’ll most likely have to deal with them again.” He says grimly.\n“Again?!” you exclaim.\n“Yes, unfortunately the Nightmare Tyrant isn’t fond of losing those he marks for capture. He has no doubt sent his Shadow minions to look for you. Fortunately you have us to help you now. We are a recon team for the Parran Empire, we’ve been fighting the Nightmare Tyrant for years, trying to find a weakness with little success. Though after some searching we think there may be a powerful weapon that can help us. It’s in some ruins a few days from here, or should be. One can never know for certain with old legends. Now, I have a duty to defend innocents from evil, but I also have a duty to the Empire. I simply cannot take this team all the way back to the Empire just to drop you off there where our wizards can send you back home, I have a mission to complete first. You can either stay with us and then after the mission we shall all go back together, or I shall send a couple of my men with you back to the Empire. Keep in mind the Shadows are probably looking for you and they tend to hunt in swarms, so the more people defending you, the better.”\n\nYou really want to go back home, but you’re a little worried about not having all the protection you can.\n\n“Well can’t Lyssia go with me?” you ask hopefully. Lyssia smiles a bit at your request, but the Captain shakes his head.\n“Sadly no. While I can certainly understand and admire your judgment of wanting her to go with you, I cannot allow her to do so, as my mission will undoubtedly require her skills. As I said, I will send to two of my men, but that is all I can spare if you decide to head back to the Empire.”", "action_results": [{"action": "Head back to the Empire", "result": "The sooner you’re out of this place the better, so you request to be escorted back to the Empire where their wizards can send you back home.\n\n“Very well, I’ll send Paladins Salzat and Lakri with you, along with an official letter explaining your situation. Good luck and may you return home without any ill-fated encounters.” The Captain says handing you the letter for safe keeping.\n\nYou are presented to Salzat and Lakri who are explained their mission. Salzat doesn’t look pleased; in fact he gets angry and exclaims his skills would be better put to use fighting the Nightmare Tyrant and other evil creatures, not looking after a child. Lakri on the other hand looks relieved. After the Captain shouts him down and tells him to obey orders, Salzat grumbles and gets on his horse. Lyssia puts you on your own horse, you’ve\nnever ridden one before, but she assures you that these are the best trained horses in the Empire and will serve you well. You’re told you should reach the Empire in a few days.\n\nSoon you’re off with your new travel companions They couldn’t be more opposite. Salzat is a mean looking man with scars all over his face who barely speaks to you, but his armor is impeccably clean and well taken care of. It even has a shine to it, almost as if it was brand new. (He doesn’t seem to wear a helmet though, perhaps that might explain all the scars) Lakri on the other hand is much kinder and talkative to you. His armor looks like its seen better days though. It’s metal that looks hastily welded together, badly dented and even showing signs of rust! Unlike Salzat his suit of armor has a full face helmet which he’s wearing right now and Salzat has chosen to taunt him about.\n\n“Lakri, why are you wearing that thing? We aren’t even going into battle you coward! I swear I don’t know how any of you can see in those things anyway. I need to be able to swivel my head as quick as possible so I can see the next enemy I have to slay!”\n“Leave me alone Salzat! I like to make sure I’m protected! I don’t want to end up all scarred and ugly like you! I intend on getting married one day!” Lakri sputters.\n“Feh! I don’t need to look pretty; my DEEDS will win the hearts of damsels!”\n\n“How did you guys become Paladins?” you ask. Surprisingly Salzat answers your question right away.\n\n“Well unlike Lakri here, I didn’t have royal family connections. I worked my way up through the ranks and went through special training so that I could become a weapon against evil and serve the Empire. If I could wipe out all the evil in this world myself, I would not hesitate to do so. There is no greater deed than to serve the cause of good and righteousness and right now my talents are going to waste escorting you!”\n“Yes, well I for one am glad for the break from battle. This is a nice change of pace than fighting trolls, shadows and other such nastiness. I wasn’t really looking forward to going to those ruins the Captain mentioned either. Sounded dangerous.” Lakri says.\n“Yeah, well we know you’re a coward anyway, and a disgrace to the Paladin name.”\n“I’m not a coward! I…just want to live alright? I mean is it so wrong that I prefer my life to not be at risk every five minutes?”\n\n“Why did you become a Paladin, if you don’t like to fight?” you ask.\n“Oh, that’s a long story…let’s just say my Dad wanted me to.”\n“But you’re a grown up, shouldn’t you just be able to do what you want now?”\n“Ha ha! You think just because one grows up, you aren’t subjected to being told what to do by your parents? Guess again. Ah well, perhaps you have less demanding parents. You must certainly like them, if you wanted to get home so quickly to see them again.”\n\nBefore you can answer, Salzat suddenly looks up in the sky and draws his sword.\n\n“Shut up! I sense something…”\n\nSuddenly the sky grows considerably darker within only a few seconds and screeching can be heard from above. Dark winged creatures begin to descend from the sky\n\n“SHADOWS!” Lakri shouts.\n“Alright! And here I thought I wasn’t going to get to vanquish evil today! Come on and be destroyed foul creatures!” Salzat laughs.\n\nAt this point Lakri and Salzat show their differences again. Lakri panics to the point that he fumbles and drops his weapon before yelling that you all should make haste to escape. Salzat on the other hand turns to face the winged Shadows. You don’t see how he can possibly fight them all himself though.", "action_results": [{"action": "Follow Lakri", "result": "You’re in no position to fight a bunch of flying Shadows, you’re not armed with anything, and nowhere near being a warrior. You take you horse in the direction that Lakri headed, leaving Salzat behind to fight the Shadows, though you aren’t safe yet as a few of them are still in pursuit of you.\n\n“That’s the one the Master wants! The little one! Get him! Get him!” you hear raspy voices shout behind you.\n\nSoon your horse has almost caught up to Lakri’s. Lakri seems to have forgotten that he’s supposed to be DEFENDING you!\n\n“Hey! Aren’t you supposed to be protecting me?” you shout at him, while briefly looking behind you to see how close the Shadows are.\n“I…I’m sorry…I just…ARGH! Shadows! Gotta get away! Don’t follow me, they’re after you!”\n\nLakri must be so frightened for his own life that he’s gone half mad! Seeing that he’s not going to lose you, he ends up jumping off of his horse and running off into the wilderness in an effort to ditch the Shadows. It works for him since they were never after him and they continue to follow you and are starting to close in…\n\nSoon one is close enough to grab at you, in an attempt to rip you from the back of the horse.", "action_results": [{"action": "Attempt to punch at the Shadow", "result": "With your free hand you attempt to punch the flying Shadow, but unfortunately it deftly dodges your attack and you unbalance yourself causing you to fall off the horse.\n\nYou don’t land on the ground though since the flying Shadows swoop in to catch you before that happens. Of course now you’re in their evil clutches. They laugh and cackle with glee as they take you back to the Nightmare Tyrant.", "action_results": []}, {"action": "Hold on tight to the reins", "result": "You pulls away from the Shadow and hold on as tight as you can, hoping that somehow the horse can outrun these creatures, or at least hoping that someone can help you.\n\nNo sooner have you thought this, when suddenly you hear a sizzling sound followed by an ear piecing screech from above. The Shadow trying to rip you from the horse has been struck down by some sort of bolt of lightning. Soon another Shadow is destroyed in the same way\n\n“Cursed Shadows! Just hold on to the reins boy and keep moving! There’s a town up ahead where you’ll be safe!” you hear someone yell at you. You notice some trees and rocks along side of the road, but no people. Whoever it is helping you must be well hidden.\n\nEventually all the Shadows following you have been destroyed by bolts and you make it into the town, though you aren’t sure of what to do or go next, but for now you’re just glad to be alive. (Your horse has even clamed down a bit)\n\nWhile you just temporarily rest on top of your horse, you hear the voice of the person who helped you again.\n\n“Ah there you are, glad to see you’re alright. What’s a boy like you traveling by himself in these dangerous times anyway? The wretched Nightmare Tyrant’s minions seem to be everywhere nowadays.”\n\nThe one who’s helped you looks like a little different from what you expected, this man looks more like a warrior, but not like the knights you encountered earlier. More like a barbarian type. He’s bristling with muscles and has a large axe carried on his back.\n\n“You don’t look like a Wizard.” You say.\n“Of course I don’t, because I’m not.”\n“I thought only Wizards could cast spells.”\n“Oh that lightning bolts back there? That’s thanks to this magic ring I found a long time ago. Though I think it’s out of charges, it’s useless except maybe to trade with now. Here, why don’t you take it.” He says giving you the ring.\n\n“Thanks. I’m supposed to be heading to the Parran Empire to get back home.”\n“You live in the Parran Empire?”\n“No, but they’re supposed to have Wizards there who can help me get back home.”\n\nYou go into detail about your adventures to the barbarian; he seems a lot more surprised by your tale than the rest you’ve told have.\n\n“That’s some tale boy, though I have no reason to disbelieve you, given the things I’ve seen since my own travels as well as the things I have heard about the Nightmare Tyrant. His darkness has even reached my old homeland far north, though my people tend to be nomadic and the land doesn’t really contain anything of major importance. We had more problems with the usual menaces of giants and trolls more than anything else.”\n“How come you’re so far from home?”\n“Well as I said, my people are nomadic in nature, and I guess I’m even more so. I wanted to see other places outside of my homeland, so I traveled south to where civilization tends to thrive. I’ll most likely return one day.”\n\nBefore you continue this conversation, you have just realized you don’t really know the route to get to the Empire. The Paladins were supposed to lead you there and now both of them are gone. You don’t know who else to ask, you’re all by yourself again and this barbarian did help you, so you give it a shot…\n\n“Hey, um…could you help me get to Empire? I don’t exactly know the way.”\n“Me? Well, I’m not sure I’m the best person to ask, seeing as I’ve never been there either, though I’m sure that wouldn’t be too much of a problem, all I need is a few directions from someone and I could probably get there quickly…sure why not? As I said, I’ve never been to the Parran Empire lands so it wouldn’t really be a wasted trip for me, but we probably should find a room somewhere first. Also I’ll need to ask for directions. My name’s Qualan by the way.”\n\nQualan rents a room for the pair of you, but he doesn’t stay, instead he says he’s going to go ask for directions and explore the town a bit, and for you to just stay in the room and not to open it for anybody. He has the key, so he can let himself in. Soon you’re alone again in a relatively barren room. It’s pretty boring in here, but you try to keep yourself occupied, namely by thinking of all the people and places you’ve encountered since you’ve been here. In fact this is the first time you’ve actually got the chance to reflect on this little adventure. You also wonder about your Mom, she’s going to be worried about you and probably have the police looking all over for you! And when you finally do return, what will you tell her?\n\nYou don’t know, but what you do know for certain is that you DO want to get home as soon as possible. You find this place very fascinating, but the Shadows and the Nightmare Tyrant who’s taken an interest in you is something you can do without. You just wish you had something that you could fight them off with…\n\nNo sooner does that pass through your mind when you notice something glowing under one of the beds. You cautiously check underneath it, and find a short sword. It faintly glows with a white light for a moment longer and then fades back to its normal color.\n\nAfter “playing” with the sword for a bit, you suddenly realize that you created the sword, or you at least made it appear. In fact you’ve caused quite a few things to occur just by “thinking”. It seems like every time you “wished” for help, it suddenly arrived.\n\nMaybe you have magical powers here or something similar, this all can’t be a coincidence.", "action_results": [{"action": "Wish to be back home", "result": "If you knew that it was a simple wish that could get you home, you would’ve done it a long time ago! You begin to think really hard about going back home. You close your eyes and try to visualize it.\n\nFor a moment you think you’re succeeding, but suddenly all you begin to see is a black void and Shadow creatures. Something terribly wrong is happening. You really know it when you open your eyes and see nothing but darkness and you are being held down on some sort of smooth cold surface by Shadows and you no longer have your sword. A sinister voice emanates from the darkness and you’re completely paralyzed with fear.\n\n“Ah, yes I knew it would only be a matter of time before you tried that to get home. Fortunately I made plans ahead of time to prevent that from occurring. Of course, in a way you ARE home. Your new one anyway. Soon you’ll be one of us… after a few alterations of course.”", "action_results": []}, {"action": "Don't wish", "result": "Something instinctively tells you that “It’s not going to be that easy.” You remember back when the Shadows first tried to take you, you wished you were back home and it didn’t happen, you ended up in the middle of nowhere. There’s no telling where you might end up if you tried it again. So far “little wishes” have worked for you, so you’re going to stick with the current plan of getting the Empire wizards to send you home and use your “powers” only when necessary.\n\nYou eventually fall asleep with your new sword by your side, you’re awakened by Qualan in the morning.\n\n“Hey, get up boy let’s get going… where’d you get that sword from?”\n“Huh? Oh…well uh I found it under the bed.”\n“Sheesh, I know I’ve forgotten a few things in my travels, but never a weapon. That’s just unthinkable. You probably should have a sword anyway, I’m not sure how it is where you’re from, but a boy your age would definitely be somewhat familiar with a weapon of some sort by now in my tribe.”\n“Where were you?”\n“I told you, I was getting directions to the Parran Empire, and exploring the town a bit…well okay I was exploring the tavern, in fact I eventually explored the floor of it. Oh well at least nothing was stolen, not that I have anything left after spending it all at the tavern…hey you still have that silver ring? I think I might need to trade for a horse. I can’t be accompanying you efficiently if I’m not on horseback as well.”\n\nAfter giving Qualan the ring back, and uses it to buy a broken down nag, you and he are on your way again. You and he talk during your uneventful travel; he’s very fascinated with your world as you are with all the adventures he’s been on. Soon you come to a split in the path. You ask which way to go.\n\n“Well, both of these paths will eventually lead to the Empire, but one of them is a lot quicker. There’s a catch though, back in town I was told the quicker path is currently under complete control of a vicious goblin tribe. Apparently they’re attacking anyone that goes through there. I heard The Empire was supposed to send in some soldiers to take care of the problem, but the Nightmare Tyrant is a more immediate and dangerous threat and as such they’re concentrating their efforts on him instead. The second path is supposed to be safe and clear, but it’ll take longer. We’ll probably have to make a camp somewhere, before we even reach the Empire.\n\n“Let’s take the safer route.” You say.\n“Alright, but keep alert anyway, just because I heard it was safe doesn’t necessarily mean it is.”\n\nYou and Qualan travel further with no unexpected encounters. When it begins to get dark you half expect Shadows to come attacking you out of the sky again, but this is a natural darkness, night is merely falling. Qualan suggests that you should make camp and you do so. You and he eat the provisions he bought from town. He comments on how bad they are and next time he’s just going to stick to hunting in the wilderness for food next time.\n\nYou’ve never slept outside before, so like most things in this adventure it’s a brand new experience for you. One that makes you really wonder why some of the kids at school have said they like camping so much. You’re definitely a city boy!\n\nAfter trying to get comfortable several times and not worry about bugs crawling on you, you fall asleep, but not for long. A noise awakens you and Qualan. The horses seem agitated as well.\n\n“Qualan?”\n“Shhh! I heard it too…be prepared for anything.” He says standing up and readying his axe.\n\nSoon a large figure lurches out from the darkness. It’s another Shadow, but not like any of the ones you’ve encountered before, this one is bigger for one thing, almost as if its armored and for another it looks vaguely familiar. The black figure is hard enough to make out by the campfire, but when it speaks you know immediately who it is.\n\n“At last I’ve found you boy.”\n“Salzat?”\n“You know this…thing?” Qualan asks getting ready to attack.\n“Briefly, he used to be one of the Paladins sent with me to take me back to the Empire.” You reply backing away.\n“And I still have to waste my time escorting you around!” Salzat hisses. “Come boy, my new master the Nightmare Tyrant wants to see you, it would be unwise to keep him waiting, the agony will only be much worse the more you resist…”\n“Take the horse and ride boy! I’ll dispatch this monster!” Qualan shouts at you.\n\nYou’re sick of running at this point, and Qualan needs your help. Besides you figure you can actually do something now with your new sword, which you draw out.\n\n“Boy, I told you to get out of here!” Qualan exclaims as he defends an attack from Salzat.\n“Ha ha! Good. Saves me the trouble of chasing down the little fool!” Salzat laughs.\n\nWhile he’s laughing you take the opportunity to stab at him. He attempts to dodge, but you manage to slightly wound his leg. This causes him to bellow in a hissing shriek. Qualan hits him with his axe, but it doesn’t effect Salzat like your attack did. Salzat retreats back a bit to recover.\n\n“YOU MISERABLE LITTLE WHELP! YOU HURT ME!” he says before getting ready to charge again.\n\n“Boy, your sword can hurt it, but I’m better with wielding such a weapon, toss it to me and I’ll dispatch this creature!” Qualan quickly says bracing himself for another attack.", "action_results": [{"action": "Toss Qualan your sword", "result": "Following Qualan’s advice that he would do a better job at fighting Salzat you toss the sword to him and he meets Salzat’s charge.\n\nQualan lands what would look to be a powerful blow, but instead nothing happens! In fact you’ve noticed that it’s stopped glowing. Salzat winces a bit from the hit, but he doesn’t stop his own attack which fells Qualan. The sword flies out of his hand and disappears into thin air. It would appear that without your belief in yourself, the sword lost not only its power, but ceased to exist altogether. You attempt to wish for another, but you’re too panicked to think straight and you’re having a hard time concentrating altogether. Soon Salzat’s hulking shadow form has grabbed you, and your mind is filled with nothing but terror. He carries you back to the Nightmare Tyrant. You soon join Salzat and the rest in everlasting shadowy torment.", "action_results": []}, {"action": "Defeat Salzat yourself", "result": "You have to defeat Salzat yourself. It was your thoughts that created the sword, by your own sheer force of willpower. If you believe in yourself, you’ll be able to defeat Salzat, you know you will.\n\nSalzat predictable charges at you, Qualan attempts to stop him, but once again his axe does nothing and Salzat smashes him in the face with his free hand, knocking him out. He’s about to finish him off with his sword, but you prevent this from happening by stepping in and parrying the blow. For some reason, you feel much stronger than you ever have before.\n\n“Whelp! You will be sustenance for the Shadow Tyrant!” Salzat hisses and tries to break through your defense, but your confidence and sudden increase in strength don’t make you fear his threats or him. Your sword glows brighter causing the red dots that are Salzat’s eyes to close in blinding pain. While he temporarily shields them, you press your advantage and strike Salzat multiple times causing him to unleash an unholy scream before dissipating.\n\nYou’re breathing hard after the battle, and you sit down to catch your breath. Qualan’s regaining of consciousness makes you jump again.\n\n“Hey hold on there, it’s just me! Wow, that really hurt.” Qualan says holding on to his face. “Looks like you took care of him yourself. In my tribe you’d now be a man with all the benefits and respect as such. For defeating such a powerful creature you might even be considered an honorary great warrior. Here, take this.”\n\nQualan gives you some sort of strange tooth. Its larger than a humans that’s for sure.\n\n“What’s this?”\n“A troll tooth. It’s customary to take a trophy, but seeing as you fought a shadow, there is none, but you should have something to symbolize your hard earned victory, as well as possibly saving my life. Also know that you have made a permanent friend with no only me, but my entire tribe if you should ever meet them. It is our way.”\n\nYou are filled with pride and pocket the tooth, while thanking Qualan.\n\nThe remainder of the night is uneventful. The next day, you and Qualan bump into a regal looking carriage making its way in the opposite direction. The driver looks annoyed that you’re even on the same road as him, let alone in the way.\n\n“Hey you peasants! Get out the way! The Archmage is on very important business in the name of the Parran Empire!”\n\nYour eyes immediately light up in hope.\n\n“A wizard?” you ask.\n“An ARCHMAGE, peasant boy! And I told you and your barbarian servant to get out of the way!”\n“Servant? I’m NO ONE’S servant! I am his friend!” Qualan raises his voice in a tone which makes the driver flinch a little.\n“Erm…well yes, but I still need you two to…”\n“Driver, what is the hold up here?” an old wild haired man in a robe asks getting out of the carriage. “Who are you lot?” he then asks you.\n\n“You’re a wizard from the Empire! And I need to get home! You have to help me!” you blurt out handing the Archmage the note that the Captain gave you. He reads it and nods as you tell him the rest of your tale.\n“Hmm, you are a very lucky little boy. Not many get away from the Nightmare Tyrant, you must have a strong will.” The Archmage says inspecting you. “I sense that your sword isn’t natural, yet I can’t determine its magical origins. Yes, you DO have some sort of power boy. Ever thought of being a wizard? We could use someone like you against the Nightmare Tyrant.”\n\nFor a brief fleeting moment your adventurous side almost jumps at the chance. But still, you don’t want your Mom to worry about you anymore than she probably is right now. You still don’t know what you’re going to tell her.\n\n“No, I want to go home.” You reply.\n“Very well, we can’t have people here that don’t want to be. I can teleport you back home right now if you wish. I myself don’t like to use it for travel unless it’s absolutely an emergency. I still prefer to take life slower and travel the old fashioned ways, of course that’s not really an option for you being from another dimension and all.”\n“I can go right now?”\n“Oh sure I can get you there real quick. And don’t worry; the Nightmare Tyrant won’t be able to ever steal you from your home world again. He’s only able to perform that feat of interdimentional kidnapping once on a person. Hence the reason why he was so eager to get his hands on you before you could escape again. Now the problem is once I start to open the portal, you need to get going fast. It will undoubtedly alert the Nightmare Tyrant to this location where upon he’ll try one last time to capture you. I’ll certainly help, but this spell will be requiring most of my energy and concentration so hopefully your barbarian friend here will be able to fend off some of the Shadows. Since I’m afraid my driver will most likely be hiding under the carriage the entire time.”\n“Hey!” the driver says.\nQualan steps forward and nods.\n“Of course. I will do everything in my power to help him get home.”\n“Okay then, but that axe isn’t going to do much good, let me enchant it first…there. Now let’s begin.”\n\nThe Archmage begins to chant while you and Qualan wait for the spell to take effect. The driver looks nervous the whole time, but he hasn’t hid under the carriage yet.\n\nThe wind begins to blow strongly and once again that familiar darkness begins gather once again. This time it’s followed a stronger sense of malevolence.\n\nYou suddenly hear a menacing voice in your mind.\n\n“Boy, did you think you could escape from me? I am the Nightmare Tyrant! Destroyer of life! Your power will be mine and you WILL serve me!”\n“NO!” you scream out in defiance!\n“Don’t listen! It’s the Tyrant’s way of trying to get inside your head! Don’t let him do it!” the Archmage briefly shouts and then continues his hand gestures.\n\nShadow creatures come descending out of the sky screeching horribly as usual. Qualan stands in front of you ready to take the brunt of the attack.\n\n“Almost done!” the Archmage shouts.\n\nThe shadows swarm your position, and you and Qualan attempt to fight them off. Your sword fortunately is glowing brightly, which at least keeps them from overwhelming you. While you and Qualan are fighting them off, the Nightmare Tyrant’s voice booms from out of nowhere and clearly audible to everyone.\n\n“FOOLS! Attack the wizard! He’s the one who can create the escape portal!”\n“Too late Tyrant! Quick! Get in the portal!” the Archmage commands as a blue portal opens up and he discharges lightning bolts from his fingers to destroy some Shadows attacking him.\n“Go! We’ll be alright! We can hold them off!” Qualan adds.\n\nYou’re sort of worried about Qualan, but you realize you have to go now. The Nightmare Tyrant bellows again to his minions about not letting you escape as you run for the portal and entering it.\n\nYou are enveloped by blackness followed by swirling colored lights. Your sword also flickers in and out of existence. It’s all so strange and overwhelming to you that you pass out.\n\n“Hey! I told you breakfast is ready, are you going to sleep all day?” you hear your Mom call from downstairs as you awaken in surprise.\n\nYou quickly look around your room and nothing looks out of place. Your Mom hasn’t seemed to notice that you were gone, in fact it doesn’t look like you even left.\n\nWas it all a dream?\n\nYou shake your head trying to decide if it was, then you notice a big tooth on the floor next to the toys you set up yesterday. The troll tooth and oddly its right next to a barbarian figure. Strangely it has a pleased look on their faces.\n\nIt wasn’t a dream. It was real. Created by the power of your own imagination. You decide you’ll keep this information to yourself though, since nobody would ever believe it!\n\nYou had an interesting adventure, but you’re glad to be home you think as you go downstairs to eat.", "action_results": []}]}]}]}, {"action": "Help Salzat", "result": "You jump off your horse to grab Lakri’s sword in an effort to help Salzat who is already in the midst of battle, with the Shadow creatures who have almost completely enveloped him.\n\nYou swing the sword, but its still a little to big and heavy for you to weld properly, you hit a few of the Shadows, but its no use, they outnumber you greatly. Soon one of them manages to deprive you of your weapon and two more snatch you up and carry you up to the sky giggling about how the Nightmare Tyrant is anxious to see you.", "action_results": []}]}, {"action": "Go with the Captain", "result": "You don’t know anything about this place and you’re in great danger, so you decide it would be best if you had as many people defending you as possible. You’d rather stay with the Captain.\n\n“Very well, you may stay with us, just don’t make a nuisance of yourself. We’ll also be on the move a lot, so don’t expect a high comfort level, however whenever we make camp, you’re welcome to stay in my tent. For right now though, you’ll have to leave it, I’m having a meeting with Lyssia and a couple of my knights to discuss an important plan of action. Explore if you wish, but don’t wander away from us, we’ll protect you, but we won’t baby-sit you.”\n\nWith these words in mind Lyssia leads you back out of the tent, upon which another knight comes up to her with a message.\n\n“Sergeant, a man has arrived at the camp.”\n“Is he hostile?”\n“No, he says he was just passing through and figured maybe he could trade for supplies here.”\n“Tell him to move on, this isn’t a trading post.” Lyssia says and goes back in the tent.\n\nNot knowing what to do next you follow the knight back to the man he was talking about. When you see him, he looks raggedy, but well equipped. He a sword by his side and his leather armor looks more like a patchwork taken from several other suits. The most notable feature is the big backpack on his back. You wonder if he’s an adventurer.\n\n“Alright you, move on, this isn’t a trading post.” The knight repeats to the visitor.\n“Okay, okay, I’ll go. But can’t I just rest here for one minute? I’ve been walking a lot and it would be nice to at least know I’m safe for just a moment.”\n“…well okay, but make it quick, and stay on the outskirts of the camp.” The knight says and leaves. You continue to examine this traveler, who immediately knows you are.\n“Well, how come you get to stay here? Army camps aren’t known to house children.” He asks while sitting down on a nearby log.\n\nYou explain your situation to this adventurer, and once again you get an unsurprised look from your listener.\n\n“Got the impression you weren’t from around here. I somehow could sense it. I always had that ability; it’s come in handy a lot. But yes, the Nightmare Tyrant is very bad news; you would do well to leave this world as quickly as you can, no doubt Shadows are already on their way.”\n“Well I got this army to protect me!” you exclaim.\n“Perhaps, but you said it will be awhile before they return to the Parran Empire where you can get properly transported back to your world, in the meantime they WILL be attacked by not just Shadows, but also by whatever they come across in their mission. Tis a long time to put yourself at risk. Not to mention I see a lack of magic in this camp, I wonder about their chances against Shadows if the Nightmare Tyrant unleashes his full power in order to re-capture you.”\n\nYou’re almost sorry you started talking to this man, within a few seconds he’s managed to worry you all over again. Here you were thinking that you were going to be nice and safe.\n\n“But…but…well what should I do?”\n“Well, if we were back in Null, I could probably get you back home really quick…”\n\nBefore the Adventurer can finish you interrupt.\n\n“Null?”\n“Oh, that’s where I live. It used to be a great city of fantastic magical power a long time ago, but it was destroyed by its own petty bickering. The powerful wizards there began to argue among themselves, factions were drawn and the entire city along with several miles around it went up in a big ball of flame. It was a terrible tragedy that could’ve been avoided, but there was an interesting effect of the aftermath of it though.”\n“What happened?”\n“Well, no magic works there now, hence the name Null. Powerful wizards can’t get a simple cantrip to work there, let alone a spell. Even the Nightmare Tyrant’s minions can’t go there. Still, it’s far from safe. Lots of the Forsaken live there.”\n“Who are the Forsaken?”\n“Oh they’re the unlucky folks who actually managed to survive the catastrophe. Not all of them bad, but understandably such a powerful magic disaster had an effect on most of their bodies as well as their minds.”\n\nWhile this is all very fascinating, you still don’t see how this helps you exactly.\n\n“While this is all very fascinating, I still don’t see how this helps me exactly. I mean if no magic works there, how can I get home? And why would you want to live in such a place anyway it sounds dangerous.”\n\nThe Adventurer moves closer to you and looks around before speaking.\n\n“Okay, because I can sympathize with being in a tough position, I’ll tell you a little secret. Magic DOES work there, but only in one area and it’s only a place I know about as far as I know. There’s a deep, but small underground dungeon in Null where magic seems to work, I know because that’s where I live! I stumbled upon it completely by accident when I was exploring Null. Apparently one of the many trinkets that I had acquired in the past was a key of some sort. It began to glow and then the wall opened up the way for me. Pure random dumb luck. So I went in and discovered that entire section runs on magic or something like it at least. There are some sort of contraption that if you sit down in and visualize with clarity, your wish will come true! I tried it a few times and it was nice, but I’m a wanderer at heart and as such I couldn’t just spend the rest of my days wallowing in eternal paradise, plus I was always leery that something bad might happen if I over used the contraption for greed. However I did see it as a good place to make my home away from the road. In fact I use this magic chair to quickly travel to towns and other cities, of course it’s only one way, but at least it shortens the trip somewhat. You could probably use the chair to return home. Even if it doesn’t work, I could always take you to the Parran Empire to get you back home. It would still be quicker and safer than traveling with an army that has to complete some mission before it can back home. Who knows what responsibilities and dangers it might incur along the way? Think also, in Null, you wouldn’t be attacked by Shadows either. It’s up to you though, but choose quickly because I have to be leaving soon.”", "action_results": [{"action": "Go with the Adventurer", "result": "You have to admit, even though you want to go back home, part of you really likes it here. Null sounds interesting and anyplace where the Shadows can’t get you sounds even better. The Adventurer seems trustworthy enough, but you still hope you’re making the right decision.\n\n“Okay, I’ll go with you.” you say a bit hesitantly.\n“Alright, let’s get going, we still have a quite a trip ahead of us.”\n\nYou and the Adventurer leave the military camp and set off on your journey. The Adventurer explains that you’ll probably reach Null in a couple of days, but that you still shouldn’t worry too much about Shadow attacks, since the anti-magic effects from Null are also in the desert wasteland surrounding the ruined city.\n\nAs you travel further, you find that the Adventurer is quite talkative. He speaks about his many journeys, he also mentions briefly of why he chose his “profession” which was mainly because he was bored living in the small village where he was born. When you reach the desert you see a big ruined city far in the distance. You also notice night is starting to fall as it’s starting to get dark, though it seems to have come on all of a sudden. The Adventurer has noticed it too and he begins to go for his weapons.\n\n“It’s not supposed to get dark that quick…The Nightmare Tyrant! Quick! Run towards Null, the anti-magic field gets stronger the closer we are to it!”\n\nYou and the Adventurer begin to run and suddenly you hear screeching behind you, and you turn your head to see Shadows coming out of the sky to capture you. However, they seem to almost be flickering in and out of existence. The unnatural darkness is also being affected bizarrely, since its still “day” in front of you and then complete “night’ behind. Eventually you and the Adventurer outrun the Shadows and the darkness, as they both are unable to withstand the sheer anti-magical forces emanating from Null. After some angry screeching the Shadows retreat back to where they came, while you and the Adventurer take a breather.\n\n“See? Told you they can’t get you here. Whew, running in this hot desert is tiring. Let’s rest here and continue on tomorrow. The real night will be coming soon and actually walking around in Null after night isn’t particularly a safe thing to do either, the desert is a lot securer.”\n\nYou and the Adventurer settle down for the night, he brings out some water flasks from his backpack and gives you one. You drink it all up and it’s soon empty, but you still wish you had a lot more.\n\n“Hey, don’t drink all of it! We have to conserve it…wait, I know that flask doesn’t hold that much water.” He says in confusion as you continue to drink what seems to be an endless supply of water in the flask. When you’ve truly satisfied your thirst the Adventurer takes the flask and attempts to look in it and shake it and finds there’s no more water in there.\n\n“Okay how did you do that?”\n“How did I do what?”\n“You drank enough for two flasks! These aren’t bottomless canteens of everlasting water either and even if they were they wouldn’t work due to the anti-magic here. So I’d like to know HOW you did that.”\n\nThe Adventurer is looking at you suspiciously, almost as if you could possibly be dangerous. You stutter and fumble with an explanation mainly because you don’t even know.\n\n“I…I don’t know…I just wished I had more water…I was really thirsty…” you reply a bit worried. He looks at you for a moment longer and then speaks again.\n“Try to wish for a chest full of gold.”\n“What?”\n“Just do it, I want to see something.”\n“Erm…okay.”\n\nYou wish and think as hard as you can, but nothing happens. Well that’s not entirely true, you get dizzy and fall to the ground. A single gold piece appears near you though. The Adventurer picks you up as well as the gold piece, which is somewhat misshapen and uneven.\n\n“Hmm, so there are limits. Did you always have this ability?”\n“Huh? No. We don’t have any kind of stuff like this in my world.” You say trying to keep steady.\n“I’m not sure what exactly is going on, but it would appear you got some sort of weird mental powers independent of magic. I have fought monsters with similar abilities, which is why I was suspicious at first. You ability reminds me of the magic chair I was telling you about except your power can work even in this anti-magical place and it would appear it isn’t very powerful. I’d almost suggest that you could attempt to wish yourself back home, but as we’ve seen, it isn’t powerful enough to do that. Still, this is probably a good indication that the chair will be able to get you back home. Here, here’s a proper gold piece, I don’t need it. Well anyway let’s get some sleep, we should reach Null tomorrow.”\n\nYou pocket the faultless gold coin and the both of you go to sleep. Before you do though, you reflect on this little adventure. You also wonder about your Mom, she’s going to be worried about you and probably have the police looking all over for you! And when you finally do return, what will you tell her?\n\nYou don’t know, but what you do know for certain is that you DO want to get home as soon as possible even if you do find this place very fascinating.\n\nThe next morning the both of you wake up refreshed and ready to carry on your journey to Null. You don’t get far, when the Adventurer senses someone is following you. You both turn around and see a figure approaching. It looks like a teenage boy, but deathly pale. The odd thing is, he’s wearing modern clothing from YOUR world.\n\n“Is that one of the Forsaken?” you ask\n“Him? No, if it was it would probably coming from Null not towards it, not to mention it would probably be running at us trying to eat us. It also looks too human and it’s wearing strange clothing, in fact it looks more like…well your type of clothing. Friend of yours?”\n“Not that I know of, I’m not friends with anyone his age.”\n\nHe doesn’t quicken his pace; he just continues to walk steadily towards your position. When he gets close enough, you can see his face, which looks emotionless. In fact it looks like he’s staring right through the both of you. The Adventurer draws his sword, but it doesn’t look like this person is showing any sign of going to attack. In fact he just stands there looking off into space.\n\n“Alright, what’s your name?” the Adventurer demands.\n“John…Johnny Doe…” he replies still staring into the space. “This place…it’s dead…numb…like me…”\n\nAs odd as he is, something tells you he’s from your world. Maybe he’s another person the Nightmare Tyrant tried to capture.", "action_results": [{"action": "Try to help him", "result": "You step forward towards him, an action that the Adventurer doesn’t approve of at all.\n\n“What’re you doing?!”\n“I think you’re right, I think he’s from my world. Maybe he escaped from the Nightmare Tyrant too.”\n“I don’t trust him, he’s weird and in my line of work, if it’s weird more often than not, it isn’t good!”\n\nYou ignore the Adventurer and go back to talking to Johnny, who seems to have begun to direct his attention towards you.\n\n“Are you from Earth?”\n“Yes.”\n“Did the Nightmare Tyrant bring you here?”\n“Yes.”\n“Did you escape like me?”\n“No.”\n\nThis answer catches you off guard, so much in fact that you don’t react in time to jump out of the way of Johnny’s grip. When he grabs your arm, you feel an instant paralyzing numbness causing you to drop immediately. When this occurs the Adventurer leaps into action and strikes Johnny, but when his sword hits Johnny’s body, it’s almost as if the paralysis crept up the sword and was inflicted upon the Adventurer as well. He falls to the ground clutching his arm and dropping his sword. Johnny follows up by merely touching the Adventurer on the head, completely immobilizing him.\n\nHaving incapacitated the Adventurer, Johnny turns his attention back to you.\n\n“No magic can work here, but I can. The Nightmare Tyrant wants to see you. You must comply. Perhaps you will become one of the Shadows. Maybe you will become like me. The Nightmare Tyrant will decide. He knows best.”\n\nYou attempt to speak, but you’re unable to. You can’t even think.\n\n“No more talk. No more resistance. Just dead numbness.” He says and then picks you up and begins to carry you out of the desert. Eventually when you’re out of the anti-magic field, a dark portal opens up, and Johnny delivers you to the Nightmare Tyrant.", "action_results": []}, {"action": "Back away from him", "result": "From your world or not, something definitely isn’t right here. In fact you begin pulling at the Adventurer wishing to leave. He concurs, but attempts to warn this person to stop following.\n\n“Alright, Mr. Doe, now that we’ve exchanged pleasantries you need to just stop following us, before you get yourself in a whole mess of trouble.”\n\nThe teenager doesn’t answer; he just continues walking towards you both.\n\n“Get behind me. I get the impression that this guy doesn’t know when to take a hint.” He says picking up a rock and throwing it at the teenager. The rock hits him squarely in the head, it seems like it should’ve knocked him out, but instead it just makes him stop and blink a few times before addressing you in a monotone voice.\n\n“You should not resist. You must come with me. The Nightmare Tyrant must be obeyed. He is…”\n\nBefore Johnny can complete his sentence, the Adventurer strikes him with his sword, but a strange thing happens. The Adventurer drops his sword and falls to the ground, clutching his arm. It would seem a kind of paralysis has stricken the Adventurer.\n\n“RUN!” he yells trying to crawl away.\n\nWasting no time, you run towards Null. Johnny pays no more attention to the Adventurer and continues to follow you, but still doesn’t quicken his pace. Whatever Johnny is, it’s obvious his own powers are in full effect here too. Probably why the Nightmare Tyrant sent him here.\n\nAs you run, you realize you still need the Adventurer to help you get back home. You need to think of something.", "action_results": [{"action": "Lose Johnny in Null and then return to the Adventurer", "result": "Given Johnny’s seemingly relentless nature, it’s useless to try to reason with him, so you continue to run. He isn’t very fast so you figure you’ll be able to lose him in the ruined City.\n\nSoon you’ve outdistanced Johnny quite a bit, and are in the City of Null. You’re winded, but you just need to hide out here for awhile and then return to the Adventurer, you hope he’s still alright.\n\nLooking briefly around you try to find a big building that looks fairly intact for you to hide in, unfortunately you’re so busy trying to evade Johnny, you’ve forgotten that there are OTHER inhabitants that the Adventurer mentioned living here…\n\nA hideously deformed creature suddenly snatches you when you enter one of the buildings and more of them appear out of the woodwork.\n\n“Well what have we here? Fresh meat? Looks like we won’t be eating rats tonight!” he laughs.\n\nBefore you can try to think of something to escape, one the Forsaken knocks you unconscious with a rock.\n\nEven Johnny doesn’t find you in time to hand you over to the Nightmare Tyrant.", "action_results": []}, {"action": "Attempt to reason with Johnny", "result": "You remember Null is filled with dangerous creatures as well, so you wouldn’t be any safer going there by yourself and Johnny’s likely to just keep following you no matter where you go. Maybe you can use your “powers” to reason with him.\n\nYou turn around begin to try to psychically talk to Johnny. You figure he’ll be more receptive that way. You also don’t know what you’re doing since you’ve never done this before!\n\nJohnny steadily approaches you as you just stand there concentrating really hard while you attempt this unusual plan. Suddenly something happens, he stops walking and your own mind is flooded with a lot of weird thoughts.\n\nYou don’t understand all of it, but you get the impression he didn’t have a good home life in your own world. He used to “escape” to a fantasy world a lot and presumably that’s what attracted the Nightmare Tyrant. You attempt to reason with him, but the link is broken when he verbally shouts out!\n\n“STOP! Get out of my head! Only the Master is allowed! You MUST submit! He makes everything better! Shadows around me always. No pain, no pleasure, just nothingness…”\n“Johnny, you’re from the same place I am, don’t you want to return home too?” you retort.\n“…better here than what was at home…at least here I have power…and soon you will too. Isn’t that why you came here, to escape the pain?”\n“No! The Nightmare Tyrant kidnapped me! I want to go back home, my Mom’s probably worried about me!”\n“…mine probably forgot about me years ago…yours will too…you need to just submit…the Nightmare Tyrant makes everything better…”\n“NO! I will not! In fact I want you to stop following me! I want you to leave me alone altogether! You will NOT prevent me from going home! Johnny, you’re nothing but a slave to the Nightmare Tyrant. Is that what you want? Somewhere within you, you must miss something about your home.”\n“…better than home…but…”\n\nOnce again you’ve managed to stir some sort of emotion in Johnny. Suddenly he slumps to the ground and begins to weep. You’re unsure of how to react, but you see the Adventurer staggering back towards you, which at least makes you somewhat relieved.\n\n“Look, you don’t have to stay here; you could return back to Earth with me, all we have to do is…”\n\nJohnny looks up with red eyes, but has regained his composure.\n\n“No. I left Earth a long time ago. This is my home now. But I see now that I am still under a cruel…guardian. No more. I want to be free… Arrgh!”\n\nSuddenly Johnny grips his head, and you too feel a pain inside your own. A dark malevolent voice pieces your brain. It’s the Nightmare Tyrant, somehow he’s managed to speak to the both of you from wherever he is.\n\n“Disobedient children! How dare you defy me Johnny! After all I have given you! Didn’t I give meaning to your pathetic life? Didn’t I become the parent you needed? If you won’t obey me willingly then I’ll just have to destroy what little free will I still allowed you to have! And YOU, oh I have special plans for you! Such power cannot be ignored and WILL supplement my own!”\n\nWhile you and Johnny fall on the ground in pain, the Adventurer scoops you up and proceeds to run with you under his arm towards Null.\n\n“Hang on kid! Keep fighting whatever it is you’re fighting, I’ll get you to your destination, I haven’t failed in a quest yet!” he exclaims.\n\nIn the “real world” you fall unconscious, but in your mind you’re very much awake. It would seem you’re in some sort of dream world. You’re standing on top of a rock floating in the void of blackness. You see Johnny in the distance standing on another rock fighting off Shadows which are attempting to drag him over the edge. He’s punching them, but his fists are glowing with a white energy.\n\n“I won’t follow your evil commands anymore! From now on, I shall fight you with the very power you gave to me and your Shadows can’t stop me!” He shouts as he completely destroys two Shadows at the same time with one blow of his fist. While you’re watching this the Shadows have become aware of your presence and are climb over the edges of the floating rock.\n\n“Fight them off! Imagine yourself a powerful warrior! Or whatever you wish! The Nightmare Tyrant can’t stop you power of your mind if it’s strong enough!” Johnny shouts over to you.\n\nYou do just that, you imagine yourself in armor with a sword. You feel your strength grow and your reflexes quicken.\n\n“Cool!” you say and strike at the nearest Shadow, destroying it.\n\nThis battle continues for some time until it seems that the endless amount of Shadows have become too afraid to attack anymore. You hear the voice of the Nightmare Tyrant again.\n\n“FOOLS! You think you’ve won? I was just warming up! I will show you the personification of FEAR and of eternal darkness!”\n“You always did talk to too much.” Johnny says and summons up a bright blinding ball of light completely enveloping the entire area. You hear an unearthly bellow as you shield your eyes from the blinding light. When you open them again, you see Johnny standing before you.\n\n“Is he…”\n“Gone forever? No, but he won’t be bothering you ever again. Me? He will. But I’ll be even more prepared for him for the next time we meet.”\n“You’re still going to stay here?”\n“Yes. I meant what I said that this is my home now, and there is nothing for me back on Earth. But now I see that the Nightmare Tyrant just used me for his own purposes, to help him in his ongoing hunt for more power. I need to stay to make things right again. Maybe even destroy him once and for all. I have to try, after all the evil he’s caused and lives he’s ruined. You should of course go back home, and be thankful for what you have there. Farewell and thank you for opening my eyes.”\n\nSuddenly you wake up from a bed and you’re in an unusually colorful room. You see a broom sweeping by itself pass you by. Jumping up from seeing such a thing, you notice the Adventurer sitting by a table polishing his sword.\n\n“Now you wake up! You know I had to fight through ten Forsaken trying to eat us, with you under my arm and you didn’t even blink! Fortunately I got us here though. So, what happened to you exactly?”\n\nYou and the Adventurer swap stories about what you both experienced in your respective journeys and you both think that each of you had the easier time of it! After showing you some of the “cool magical stuff” in his home, you’re ready to go back to your own. This entire world is very interesting, but you want to return.\n\n“Well, I can certainly understand that. Like I said, I’m a traveler, but I suppose even I get a longing to return home. Y’know, maybe I’ll go visit mine. My real one, not this place. They might even have forgotten all the mischief I used to cause there!” the Adventurer laughs.\n\nThe Adventurer shows you the chair he was talking about. You instinctively feel a power coming from it. Not a magical one either, it’s the same one you have. Perhaps it was a device to enhance such abilities? Perhaps it was a secret weapon involved in the destruction of this City? You don’t know and the Adventurer doesn’t either, all you know is you’re hoping it will help you get home.\n\nSitting in the thing does make you a bit nervous as it resembles an electric chair, but you know you need to calm yourself of any sort of fear and doubt if you want to get back home. You bid goodbye to the Adventurer before attempting to concentrate and he mentions he’ll stand by to help in case it looks like you’re in trouble.\n\nYou are suddenly transported through a tunnel of blackness followed by swirling colored lights. It’s all so strange and overwhelming to you that you pass out once again.\n\n“Hey! I told you breakfast is ready, are you going to sleep all day?” you hear your Mom call from downstairs as you awaken in surprise.\n\nYou quickly look around your room and nothing looks out of place. Your Mom hasn’t seemed to notice that you were gone; in fact it doesn’t look like you even left.\n\nWas it all a dream?\n\nYou shake your head trying to decide if it was, then you notice a coin on the floor next to the toys you set up yesterday. A gold coin and oddly its right next to a sword wielding figure with a peculiar smile on his face.\n\nIt wasn’t a dream. It was real. Created by the power of your own imagination. You decide you’ll keep this information to yourself though, since nobody would ever believe it!\n\nYou had an interesting adventure, but you’re glad to be home and thankful for what you have in the real world you think as you go downstairs to eat.", "action_results": []}]}]}, {"action": "Stick with the Captain", "result": "While this man seems to mean well, you’re still hesitant to just go wandering off with a stranger. Not that you aren’t with some already, but you know the Captain and Lyssia a lot better than this Adventurer. Also you still feel safer with more people defending you, so you decline.\n\n“Very well, I hope you manage to make it home safely.” The Adventurer remarks and takes his leave.\n\nYou begin to wander around the camp looking at all the neat things. If you weren’t in so much danger and worried about getting home, you’d probably want to stay here. Still wishing to be around a familiar face, you go looking for Lyssia and hope she isn’t too busy.\n\nYou end up finding her tent, but she’s not there. You do see a sleeping black dog though, a big one, bigger than you’ve ever seen. Scary actually, in fact it’s even scarier when it suddenly wakes up and leaps on top of you!\n\n“Grrrrr! What have we here? A little thief? Maybe eating your hands would teach you a lesson and I’m pretty hungry!”\n\nYou’re so surprised by it talking; you temporarily forget that you’re in danger.\n\n“Y…you can talk!” you sputter.\n“Of course I can talk!” it snarls before sniffing you a bit. “Snnnn…you don’t smell like you’re from around here.”\n“I’m not, where I come from dogs don’t talk.”\n“DOG?!” it growls gnashing its fangs. “I’m a WOLF and maybe you need to learn that lesson too!”\n\nThankfully Lyssia enters at this point.\n\n“Black Fang, you leave him alone! He’s a guest!” she scolds. Black Fang gives you a dirty look, but backs off to his original position where he closes his eyes again\n\n“Thanks…he nearly ate me.”\n“Oh I doubt that, I know he doesn’t seem like it, but he’s really a softy.”\n\nOne of Black Fang’s eyes open and he makes a growl, but goes back to sleep. You begin to talk to Lyssia and ask her more about where you’re going.\n\n“It’s an old ruin of an ancient civilization called Zodan. I know because I found it myself while scouting, of course I didn’t explore it in great detail since I figured it would be better to have extra help, but the markings are Zodan. The Zodan are no longer around due to an ancient forgotten war that lead to their downfall, but it’s possible that remnants of their power still exists, possibly something we can use against the Nightmare Tyrant.”\n“Like what?”\n“Well we don’t know. It’s a chance we’re taking, but anything that might help against the Nightmare Tyrant will be a welcome relief. Many people believe his powers to be magical in nature, but they aren’t. A majority of it is purely mental hence why he is anxious to always absorb the fertile imaginations of children. The Zodan also dabbled in similar psionic activity, so maybe…”\n\nSuddenly a soldier comes running into the tent and you’ve just noticed how dark its gotten outside.\n\n“Lyssia, we’re being attacked by Shadows! They’re everywhere!”\n\nShe instantly draws her sword and says a few words before leaving.\n\n“You stay in the tent! And Black Fang, wake up, you protect him!”\n“Huh? Wha…grah! I have to look after this whelp?”\n“DO IT!”\n\nBlack Fang gets up and lopes over to the tent entrance and you hear the sounds of battle close by. Soon those sounds are nearly within the tent as a couple of Shadows find your location.\n\n“HERE! HE’S HERE!” one of them hisses before Black Fang attacks them with his teeth and claws. You wonder if he’s magical in nature since they fall and dissipate from his attacks. However, it looks as if the Shadows are determined to get you as they begin to overwhelm him as well as some of them on the top of the tent attempting to tear it open.", "action_results": [{"action": "Try to escape", "result": "You have to get out of here! You crawl on the ground and lift up the bottom of one side of the tent and squeeze out. Unfortunately midway through your escape the Shadows see you and quickly drag the rest of you out of the tent and swarm you. You feel a paralyzing fear overwhelm your mind and the hideous laughter of the Nightmare Tyrant fill it.\n\n“Now you shall join MY army!” you hear his voice say in your mind as the Shadows carry you off to his fortress.", "action_results": []}, {"action": "Look for a weapon", "result": "You would think Lyssia would have extra weapons in here tent, but if she does she’s currently using them all, because you can’t find anything! Meanwhile Black Fang is being overwhelmed by Shadows and some of them are successfully ripping open the tent.\n\nYou wish you just had a weapon of some sort to fight them with…\n\nSuddenly a glowing short sword appears in your hand. You’re surprised at first, but when a Shadow comes at you from above, you waste you time in swinging your new acquired weapon at it. The moment the sword touches the shadow, it dissolves and screeches before your eyes.\n\n“HEY, you got a sword how about helping me out over here!” Black Fang shouts out seeing noticing your actions while still fighting off the Shadows.\n\nWithout hesitation you help him, oddly you no longer feel any kind of fear as you strike down the Shadows. Soon you and Black Fang destroy all the Shadows around the tent, but the rest of the camp is still locked in battle and when you look up MORE Shadows start pouring from the sky. Lyssia comes running towards the both of you.\n\n“Quickly! We have to get out of here and head towards the Zodan ruins! The Captain says he’s going to stay behind to hold off the rest of the Shadows!”\n“But…”\n“Move!”\n\nYou, Lyssia and Black Fang take off into the woods, as the sounds of battle get further behind. There are still a few Shadows in pursuit, but you manage to dispatch them. Eventually you reach an abandoned cottage where you all take refuge in for the night.\n\n“Okay I’m pretty sure we lost the Shadows, we’ll rest here for the night and set off for the ruins in the morning. A question for you though, how did you come across that sword?”\n“I dunno, I just wished for something to fight the Shadows with and it appeared in my hand.”\n“Oh yeah? You think you could think up something to get rid of ALL the Shadows? That would really help out a lot.” Black Fang says.\n“Maybe I could wish myself back home…” you say before Lyssia stops you.\n“No wait, don’t do that. Your abilities while obviously powerful are probably not stable. For all you know you might end up in the middle of an ocean! The power of the mind can be very dangerous. The Zodan experimented with it and they’re no longer around anymore. The Nightmare Tyrant wields mind power for evil purposes in his pursuit to conquer everything in his path. I suggest you don’t over abuse your gift. Don’t worry we will get you home eventually though.”\n\nYou sure hope so, while you trust Lyssia, you really do want to get home. You can only imagine how worried your Mom is going to be and you really won’t know what to tell her when you get back!\n\nIn the meantime you settle down to sleep. Lyssia does as well while Black Fang takes watch since Lyssia points out that he was sleeping all day. Fortunately the night is uneventful and when the morning comes you’re on your way. Black Fang doesn’t travel with you though; in fact he pads off into different direction.\n\n“Why isn’t Black Fang coming with us?”\n“He’s not my pet if that’s what you think. He’s a free being allowed to come and go as he pleases, but he’ll be around. He just prefers his own company for the most part. If we get into overwhelming trouble I have complete faith he’ll be around to help. Anyway the Zodan ruins won’t take as long to get to with just us traveling there. We’ll be able to cover more ground and take paths that an army couldn’t travel through.”\n\nAs you and Lyssia travel, you and her exchange a bit of information about each others’ respective worlds which you both find very interesting. You make a lot of progress in one day. So much that Lyssia mentions that you should reach the ruins by the next day. She says that she has orders to search the place as much as she can, and then return back to the Empire where you can get help from the wizards to send you back home. She hopes that the Captain and the rest of his soldiers are alright and will eventually reach the ruins themselves before she returns to the Empire. When night comes Black Fang makes his presence known again as you settle down to camp again.\n\n“I feel I should warn the both of you that we aren’t completely alone in these woods. There’s something, possibly several things running around out there. Caught a glimpse of them a couple times, but they seem unnaturally quick.”\n“Shadows?” you ask.\n“No, they would’ve attacked already. Plus I can smell these things when they’re close by. They might be able to stay out of sight, but they can’t hide their scent. Smells rotten.”\n“I had a feeling that we were being watched, I never saw anything though.” Lyssia replies.\n“They’ve been staying further away from you two. I think they’ve been watching me a lot more. They probably think I’m a greater threat…and they’re right.”\n“Glad to see that you’re…” Lyssia suddenly stops. “Okay I heard that.”\n\nYou heard it too and all three of you prepare yourselves. You also start to smell something bad like what Black Fang was talking about. Two demonic looking creatures come jumping down from the trees. One of them is much fatter than the other.\n\n“Well there doesn’t seem to be anymore point in hiding, I’m pretty sure we can take them anyway.” The thinner one says.\n“Uh huh, yeah. Um, Jarac which one are we supposed to take back to the Nightmare Tyrant?” the fat one asks.\n“Hago, you really are an idiot, sometimes I wonder how we’re even related. The boy you moron!”\n“I thought the Nightmare Tyrant only had Shadows working for him.” You say out loud to Lyssia.\n“Oh the Nightmare Tyrant has many working for him, boy. However it seems that a new battle front has recently opened up and he has great need of them elsewhere, but fortunately we happened to be in the area… so here we are.”\n“So the Nightmare Tyrant relies on half witted demons to do his work now?” Black Fang growls.\n“Hey! Only my brother is half-witted! And for what he’s going to do to you, he doesn’t need to be very smart. Enough of this talk, let’s get to it. Are you ready brother?”\n\nHago doesn’t even reply he just smiles with a toothy grin and advances towards Black Fang. Jarak focuses his attention on you, but naturally Lyssia stands in front of you.\n\n“Run away pretty one if you value your existence, though I’d prefer if you didn’t.” Jarak says and attacks. He’s incredibly quick and manages to hit Lyssia and knock her to the ground. A quick glace sees that Black Fang is struggling with Hago.\n\nYou need to act now, you can’t possibly fight either of the demons with just your weapon given how quick they are, but even they wouldn’t be quick enough to fight the power of your mind…", "action_results": [{"action": "Think of something to help your companions", "result": "You wish for something that could help Lyssia and Black Fang, and at first nothing seems to happen, but Jarek then notices something when he tries to grab you and you dodge out of the way.\n\n“WHAT? I should’ve caught you! No human can move that quickly, especially not a boy!”\n“Jarek, I feel like something just sapped my…UGH!” Hago grunts as Black Fang claws him across the face. Lyssia also gets back up to strike Jarek across the chest. He reels backward and realizes he no longer has an advantage.\n\n“Our powers are gone! RUN!” Jarek shouts and runs off with Hago following behind. Black Fang pursues them.\n\n“Black Fang wait!” Lyssia shouts and runs after him. Not wishing to be left alone, you follow Lyssia. You have a hard time keeping up, but after a short distance she stops when she sees Black Fang sniffing around a strange gray building. There are no windows, just a single door. It’s actually quite tall; you can’t believe you never saw it before even in this forest.\n\n“What is this?” Lyssia asks.\n“Don’t know, but the two demons ran in there. I was tempted to go in, but considering this thing just materialized out of nowhere I thought discretion might be the better idea for once. It’s completely featureless except for this small weird symbol on the door.”\n\nLyssia tells you to stand back as she examines it.\n\n“This is Zodan! I saw these symbols in the ruins I briefly explored. We have to go in explore it If the Nightmare Tyrant’s minions are in there, who knows what secrets the Nightmare Tyrant might gain? We certainly don’t want him to get anymore powerful than he is!”\n\nAt this point the thought of getting home is still in the back of your mind, but with all that has happened you can’t help, but be caught up in this excitement even if a lot of it has been scary.\n\nYou all enter the building, which apparently is a lot bigger on the inside. All the rooms are lit and furnished, but again everything is a dull gray color, the furniture (Most of which looks like it comes from various time periods), the floors, the walls, all of it. Someone must’ve really liked that color.\n\nBlack Fang easily tracks the demons by their smell; however you all can hear their voices anyway. They sound like they’re arguing with someone. When you arrive in the room where they’re located, you see strange machines and the two demons arguing with a ghostly figure.\n\n“What do you mean?! Teleport this place! We gotta get out of here!” Jarek shouts.\n“This place isn’t your personal transportation system! I told you that this place uses up a lot of power and needs to recharge when it teleports. Not to mention you insisted on keeping this place invisible the whole time, didn’t you think that was going to use up power? You two are just going to have to wait awhile, there’s nothing I can do.” the ghost replies.\n“Argh! If you weren’t a ghost already, I’d make you one! Okay Hago, check…”\n\nBefore Jarek can give whatever order he was going to give, Black Fang and Lyssia attack. The two demons stand no chance without their enhanced speed. A couple of quick blows and both give other worldly shrieks before they burst into puffs of smoke and disappear. The ghost on the other hand just floats there observing it all.\n\n“Well, I’m glad they’re gone, they were really getting on my nerves. Never did like demons. Now what can I do for you?”\n“What is this place exactly?” you ask.\n“Oh just a relic of the past or the future depending on your outlook on life. It once was a mobile military base if you were looking for something a little more precise. Used for conquest and that sort of thing.”\n“This is Zodan in nature isn’t it?” Lyssia says.\n“Yes, but a fat lot good it did them, considering they aren’t around anymore, well not in the traditional sense anyway. I take it you’re not minions of the Nightmare Tyrant then?”\n“Do we look like we are?” Black Fang snarls.\n“Well you might, furball especially with that attitude! But the other two certainly don’t look the part, besides I know the Nightmare Tyrant turns children into Shadows. Nasty fellow. No redeeming qualities whatsoever.”\n“So who are you and why are you working for the Nightmare Tyrant?” you ask.\n“I’m not. I’m just a caretaker of this place and as such I’m tied to it. I can’t prevent someone from using it however they want, I’m just here to make sure it doesn’t fall into decay or get destroyed like so many of the other Zodan inventions. When the Nightmare Tyrant found this place he decided to use it to find other possible Zodan weaponry since this place can easily home in on other Zodan ruins. So far with little success as I said most Zodan equipment has lost all its power. Normally he has those mean little Shadows running around in this place chattering incessantly, but for whatever reason he put those two demons in charge. Guess he needed to reassign troops or something.”\n“Hey I found a Zodan ruin not far from this forest, is that why those demons were here?”\n“Yes, there was one located by me recently, but those demons aren’t like the Shadows and their minds weren’t as shall we say as sharp hence why we’re here in the middle of the forest instead of closer to the desired location. While this place is magical in nature, it was primarily designed to run on the power of the mind. The Nightmare Tyrant’s Shadows are all psionically linked to him so teleportation isn’t a problem. Those demons couldn’t focus on anything! Now you boy, I sense a great deal of mental focus in you. Your sword was created from your mind was it not?”\n“Yes, it was.”\n“Ah yes, I can see why the Nightmare Tyrant would want someone like you to add to his power.”\n“Can this place take me home?” you ask.\n“This place needs time to recharge as those demons used up much of its energy with their bumbling. However, you could probably take yourself home. This place enhances the powers of the mind. Normally I wouldn’t advise it since as I said it requires discipline, but you seem to have a natural gift at it and would probably be successful. Just visualize your home and concentrate.”\n\nIt seems so simple! You wonder if you could’ve done it all along, but that hardly matters, since you can do it now. Lyssia puts her hand on your shoulder.\n\n“Well, it looks like you’ll get home quicker after all.”\n“Thanks for protecting me from the Shadows and demons.” You tell her.\n“Hey you helped in both battles.” She says.\n“Oh and what did I do, sit around and watch?” Black Fang remarks to the both of you.\n\nYou nearly laugh and thank Black Fang too. The Caretaker then speaks.\n\n“Okay, now I advise complete quiet when you attempt this. It’s better for concentration and noise won’t distract you. So your friends will have to remain quiet. I’d advise that they leave altogether, as even their random thoughts could interfere. As I said, the chaos of the mind is one of the reasons for the downfall of the Zodan. I’m a ghost so you need not worry about me.”\n“Fine! Fine! I know when I’m not wanted I’ll go wait outside!” Black Fang says and lopes off. Lyssia is about to leave too, but you insist that she stay because you feel safer with her around. After seeing that you really want her to stay she does and says she’ll wish for you to get home as well.\n\nYou sit in the middle of the room and close your eyes and concentrate. You visualize your home. You see it. You can almost feel it. You’re there, until…\n\n“LYSSIA!” Black Fang roars as he runs into the room.\n“I told you the boy needs to concentrate and silence!” the Caretaker snaps.\n“Shut up ghost! Shadows are outside! A whole mess of them!”\n\nLyssia and Black Fang quickly run out of the room. Lyssia shouts at you to continue to your concentration.", "action_results": [{"action": "Continue to concentrate for home", "result": "You were close last time to getting home, you can’t stop now. Besides you have to do it quickly before the Shadows get inside!\n\nYou attempt to drown out the sounds of battle outside and your concern for Lyssia and Black Fang. Its very difficult and you’re having a difficult time concentrating. You see your house, then various people you’ve encountered, then this place, then total blackness…\n\n“HE’S HERE! GET HIM GET HIM SSSSSS!” you hear a Shadow hiss before you are transported, but it isn’t to where you wanted…\n\nWhen you open your eyes and see nothing but darkness and you are being held down on some sort of smooth cold surface by Shadows and you no longer have your sword. A sinister voice emanates from the darkness and you’re completely paralyzed with fear.\n\n“Welcome to your new home and family.”", "action_results": []}, {"action": "Attempt to help", "result": "You can’t just abandon those who have helped you, and you wouldn’t be able to concentrate anyway. You stand up and wish for something simpler and more immediate\n\nSuddenly you’re wearing shiny armor and armed with a glowing repeating crossbow.\n\n“Hmm, didn’t expect that.” The Caretaker says as the sounds of battle start to get louder, in fact now they sound like they’re coming into the building.\n\nYou run into the next room and Lyssia and Black Fang fighting off dozens of Shadows and more of them seem to be pouring in. You waste no time and begin shooting them with your new weapon.\n\n“Ha ha! Back to the void Shadow scum!” Black Fang laughs when he see you helping.\n“There’s more of them coming in from the left!” Lyssia shouts and suddenly you all hear a booming voice.\n\n“FOOLS! You think you can stop me and take what is rightfully mine? You cannot defeat me! And YOU boy! Your powers are nothing compared to my own, its time that you see what REAL mental power can achieve!”\n\nSuddenly the lighting gets much dimmer, almost to the point of complete darkness. Fortunately your powers maintain their glow making you the proverbial shining beacon of light. Suddenly more Shadows pour in from the corners of the walls. You’re surrounded. However, help comes in the form of the very building you’re in…\n\n“Nightmare Tyrant you have attacked this structure and as I am bound to defend it, you have made yet another enemy!” the Caretaker ghost exclaims and the entire building gets brighter, blinding most of the Shadows.\n\n“Get ‘em while they’re weak! I’m using all the power that this structure recharged right now!”\n\nYou, Lyssia and Black Fang destroy more Shadows than you can count, but they still keep coming. You can’t believe it. You’ve got a lot in your favor except numbers, if you just had that, maybe you could finally defeat these Shadows once and for all…\n\nOnce again it would seem your wishes have come true.\n\n“Back to the void! Forward men!” a familiar voice shouts. It sounds like its coming from outside.\n“That’s the Captain!” Lyssia exclaims as she strikes down another Shadow.\n“Bout time we got some help here!” Black Fang growls.\n\nThe battle is going badly for the Shadows who aren’t attacking so much as they’re trying to get away right now. The Nightmare Tyrant’s voice again is heard and filled with rage.\n\n“COWARDS! FIGHT OR YOU’LL SUFFER FOR YOUR FAILURE!”\n\nIt’s no use though; even his threats can’t motivate the Shadows to victory. You can somehow sense that the Nightmare Tyrant is desperate for victory because if he can’t get you now, he won’t be able to get you ever again. Eventually all of them are defeated. You, Lyssia and Black Fang meet the Captain outside who has a handful of his original army left.\n\n“How did you find us?”\n“Well after we beat back the first Shadow attack we regrouped and headed towards the ruins as planned. Then we saw this tall gray structure looming in the distance so we head towards it, and found more Shadows, so finding you was somewhat pure chance! Well it looks like some of you have underwent some changes…” the Captain says when he sees you with your armor, sword and crossbow.\n“We’ve got a lot to discuss about this structure Captain, but first he has to use it to get home.”\n“Very well, I’m interested in hearing your report Lyssia. And as for you, I wish you a safe journey home. And thank you for your help with the Shadows, you’d certainly make a good knight.”\n“Yeah, you’re a natural Shadow slayer kid.” Black Fang remarks.\n\nAfter Black Fang’s uncharacteristic praising remark, you and Lyssia return to the structure where the Caretaker floats about fixing stuff.\n\n“Blasted Shadows. It’ll take me forever to fix this place again. Oh well, I suppose that’s what I’m here for. So, are you ready to go now? I trust the fighting is over?”\n\nYou nod and get ready to concentrate again, but before you do, Lyssia gives you something.\n\n“Here, this is medal I was awarded for bravery in battle. I’ve been awarded many actually, but I feel your actions were certainly deserving of such a medal. So this is for you.” she says and then gives you the medal and hugs you goodbye.\n\nCherishing the gift, you prepare for your trip home, and concentrate once again. Soon you can feel yourself being transported.\n\nYou float through a tunnel of blackness followed by swirling colored lights. It’s all so strange and overwhelming to you that you pass out once again.\n\n“Hey! I told you breakfast is ready, are you going to sleep all day?” you hear your Mom call from downstairs as you awaken in surprise.\n\nYou quickly look around your room and nothing looks out of place. Your Mom hasn’t seemed to notice that you were gone; in fact it doesn’t look like you even left.\n\nWas it all a dream?\n\nYou shake your head trying to decide if it was, then you notice a medal on the floor next to the toys you set up yesterday. The medal is next to three figures: A man in plate armor, a black wolf and finally a warrior woman in leather armor and strangely they all have a look of victory in their faces.\n\nIt wasn’t a dream. It was real. Created by the power of your own imagination. You decide you’ll keep this information to yourself though, since nobody would ever believe it!\n\nYou had an interesting adventure, but you’re glad to be home and thankful for what you have in the real world you think as you go downstairs to eat.", "action_results": []}]}, {"action": "Think of something to directly harm the demons", "result": "You immediately concentrate on something that will hurt the demons, and your sword suddenly becomes a glowing blue axe. With Jarek approaching you strike at him and score a hit. He bellows in great pain, but it doesn’t stop him from knocking you out with his quick reflexes.\n\nWith you as no longer a threat, Jarek calls his brother to retreat. Lyssia and Black Fang attempt to pursue, but they’re not fast enough to stop the two demons from disappearing with you.\n\nWhen you wake up you’re in near total darkness with only the sinister voice of the Nightmare Tyrant with you.\n\n“Well it would appear my minions have successfully served me this night. I certainly hope you will serve just as well in the future.” You hear him say before the darkness completely takes you.", "action_results": []}]}]}]}]}, {"action": "Run back to tell Melcar", "result": "You aren’t going to mess about with a bunch of angry little purple people; you don’t know how dangerous they might be. You head back to the front of the house and knock on the door to get Melcar’s help.\n\nYou don’t get an answer, but a short man with a long pink beard comes walking up the steps, he’s your height, but is obviously old. He reminds you of a dwarf. Maybe he is, you are in a different world after all, but the pink beard is really bizarre. There’s another taller man walking behind, but is very disheveled looking. His odor isn’t the best either as he gives off a bad smell and he isn’t even next to you.\n\n“Outta the way boy! I got important business with this charlatan who claims he’s a wizard!” the dwarf exclaims nearly knocking you down.\n“Chargrum, are you sure this is a good idea? I mean it was only five gold…”\n“ONLY FIVE GOLD? Stinky, you’ve been working for me for how long now and you’re still too dumb to figure out that nobody steals from me? You’ve truly hit an all time low in stupidity!”\n“Yeah, but this guy’s a wizard…”\n“He’s a charlatan! And even if he was a real wizard, it doesn’t matter because the money for once is the least of my complaints, he’s gotta pay for what he did! That blasted potion turned my beard PINK, or were you too stupid to even notice that Stinky?”\n“Okay, I’m just saying…”\n\nBefore you can react to all of this, Melcar finally answers the door and addresses you first.\n\n“What’s all this blasted noise? Didn’t I tell you to go clean up my backyard?”\n“But there are all these mean little purple people throwing rocks at me!” you say.\n“So? They’re just Furms, just stop them, shouldn’t be that hard for you.”\n“Nevermind all that, I want my five gold back, look what your potion did to my beard, you charlatan!” the dwarf yells.\n“Oh fer…look Chargrum, I said no refunds when I sold you the potion, besides you got what you wanted. Your beard grew a lot longer didn’t it? Don’t like it? Shave it off!”\n“WHAT!? Shave off my beard? That’s madness! But no dwarf wants a pink beard! What Dwarven woman would want me like this?”\n“(Sigh) Stop pretending that you’re a dwarf! You’re a Halfling that’s just trying to fool Dwarven women! And you’re calling ME a charlatan?”\n\nChargrum suddenly looks around nervously and then hits Stinky for snickering.\n\n“Shhhh! Alright, alright, keep your voice down! Look, do you have anything to change my beard back to a proper color?”\n“Maybe, but…hmm, that doesn’t look good…”\n\nMelcar’s statement and his eyes gazing past his porch cause the rest of you to turn around look where upon you see the sky turning jet black and dark winged creatures begin to descend from it.\n\n“SHADOWS!” Malcar yells at which point you, Chargrum, and Stinky all rush inside before he shuts the door.\n\n“What are shadows doing here? This village isn’t even of any strategic importance to the Nightmare Tyrant!” Chargrum shouts.\n“He’s the Nightmare Tyrant, does he need a reason? But I’ll wager they’re looking for him.” Melcar says pointing at you. “They’ll probably try to swarm the house soon, I better prepare this place….I have to go get my spell book!”\n\nAfter Melcar runs off to go get his book, Chargrum demands and answer from you.\n\n“What did he mean, they’re probably looking for you?”\n\nYou hesitantly explain yourself at which point Chargrum gets a look in his eye that makes you uncomfortable.\n\n“So if that’s the case, then the Shadows will probably leave after they get you, well I know how to solve this problem!”\n\nChargrum advances on you.", "action_results": [{"action": "Run away", "result": "You run up the stairs of the house, with Chargrum in pursuit.\n\n“Don’t just stand there picking your nose Stinky, help me catch the little runt!” Chargrum shouts.\n\nYou reach the second floor and run into one of the rooms locking it behind you. You turn around to see that you’re in a bedroom. Probably Melcar’s no doubt. A single window leads outside. You could escape from it, but you then remember all the Shadows are outside waiting for you in the first place, in fact you can hear their screeching surrounding the house.\n\nA Shadow breaks in the window just as Chargrum bashes the door open and you begin to wish you were anywhere, but here!\n\nNo sooner have you thought that, you find yourself in front of Melcar, surprising the pair of you! From the looks of things, you’re in a basement, or lab. You know you’re underground, because you can see there is a stairway leading up and hear Chargrum’s voice coming from above. He’s screaming actually.\n\n“Wha…where did you come from?” Melcar asks.\n“I…I dunno! I was running from Chargrum and hiding and then I wished I was someplace else and then I found myself here!”\n“Wait. Why was he chasing you?”\n“He was trying to throw me to the Shadows!”\n\nNo sooner have you said that, when Stinky comes running down the stairs.\n\n“The Shadows are in the house and they took away Chargrum through one of the windows!”\n“What?! I just erected a barrier! They shouldn’t be able to get in!”\n“Well a few of them have, and Argh! Here they come!” Stinky says as some Shadows come down the stairs hissing and screeching. He quickly runs towards the both of you and behind Melcar.\n\n“Get behind me too, kid.”\n\nA few chants and Melcar unleashes a couple of electrical blasts from his fingers zapping all of the attacking Shadows. They give one last screech before disappearing.\n\nMelcar immediately rushes upstairs to see if there are anymore Shadows, you and Stinky follow closely behind him. After some checking, it would appear that the rest of the Shadows have been kept out and only a few managed to get in before the barrier appeared. You can still hear them still trying to get in though.\n\n“Whew. Okay. That should hold for awhile.” Melcar says collapsing in his chair.\n“But what about Chargrum…the Shadows…they…”\n“I can’t do anything. They got him and that’s it. But judging by what the kid told me he was trying to do it sounds like he got what he deserved anyway. Besides, I would’ve thought you of all people would’ve been glad to be rid of him, with the way he treated you.”\n“I…guess so, but what’re we going to do now?” he asks.\n“Dunno yet, but I’m hoping the kid can help out. If he can like I think he can; then we should be fine.”\n\nNow both of you are looking at Melcar wondering what he’s talking about. He sees that he’ll need to explain in more detail.\n\n“Kid, as I said you were brought here by the Nightmare Tyrant due to your strong sense of imagination. However, judging from your recent transportation trick it would appear that your imagination is strong enough to cause things to happen with the mere power of your mind. Yet, it would also appear that your power is limited. You wished you were away from danger, yet only re-appeared in another place in the house. Though my magic barrier was up at that point, so perhaps that has something to do with it. I don’t know…let’s test something.”\n\nMelcar points to another chair.\n\n“Concentrate, and think about that chair being solid gold.”\n\nYou aren’t sure about all of this, but you’re interested in this “new power” you’ve acquired so you comply. Perhaps you could try to even wish yourself back home!\n\nYou close your eyes, concentrate and wish for the chair to be solid gold, but it’s more difficult than you thought. Your mind is periodically bombarded with images of darkness and grinning Shadows. Eventually you fall to the floor. Melcar helps you up. The chair is still the same, except it has a single gold piece on the seat. Melcar checks to see if it’s real, and then he pockets it.\n\n“Well, just as I thought, it’s unpredictable and weak right now.”\n“I…saw Shadows and darkness…” you say still holding your head.\n“It looks like the Nightmare Tyrant really wants you; he’s probably linked to you psychically or something. I wouldn’t try to use your power to try to get back home. You’re likely to appear right in his clutches, but if we harness your power a little better, we can at least get rid of this immediate threat of Shadows. Focus on immediate help right now rather than a long term…”\n\nSuddenly Melcar is struck in the back of the head, by a Shadow! It must’ve still been hiding during the search! Melcar collapses and falls. Stinky runs off, leaving the Shadow to turn its attention towards you, hissing aggressively.", "action_results": [{"action": "Use your power to try to escape", "result": "You attempt to wish yourself elsewhere again, but you failed to heed the warning given by Melcar who stated how such an action might be dangerous, and in this case it was…\n\nYour mind is once again flooded by darkness and Shadows filling you with terror, and causing you to feel pulled towards it. A sinister laugh echoes throughout your head causing you to immediately break your concentration, but the damage is done as you are captured by the Shadow that’s currently in the room with you. At this point your mind is too paralyzed with fear to be of any use, but it knocks you out just to be sure you don’t try to escape again.\n\nThen it, along with its fellows takes you to meet the Nightmare Tyrant, whose laughter you hear once more before he carries out his evil plans for you.", "action_results": []}, {"action": "Use your power to fight back", "result": "You have to fight back, as escape is not an option. You don’t even concentrate; you just wish you had something to defeat this creature!\n\nSuddenly a glowing sword appears in your hand. You also feel somewhat different, as if you have been trained to use one before. The Shadow steps back a bit, but then attack anyway. You take one swing at it and strike a powerful blow causing it to completely disappear.\n\nYou hear more coming in from the second floor again. The barrier must be weak in that area. Seeing as Melcar’s out of it, you’re going to have to reinforce it yourself.\n\n“Stinky! Stop hiding and try to bring Melcar back around so he can help! I’m going to get rid of these Shadows!” you order as you run upstairs.\n\nMore Shadows are eager to carry out the will of their master, but you’re better prepared for them now physically as well as mentally. You strike down the first one coming down the hallway, and then the second one, and then the next, until you get back to the bedroom that you teleported from. You can see that the same window that the Shadows broke through before is where the barrier is also “broken”. The blue glow of the magic barrier is non-existent there.\n\nBefore more Shadows can get in, you begin to wish for the barrier to be repaired. While you attempt this task, you begin to hear the taunts of the Shadows trying to fill you with doubt. You also hear a more sinister voice, one that carries fear directly to your mind.\n\n“Little fool! Do you actually think this is going to stop me? Your attempts only delay the inevitable. Eventually you WILL be mine!”\n\nThis evil presence in your mind causes you to break your concentration. You’re a little shaken by hearing the voice of the Nightmare Tyrant and you’ve failed to repair the barrier and now more Shadows are climbing in. Fortunately, Melcar has regained consciousness and has appeared to help.\n\nMelcar zaps the Shadows and with a few mumbling chants the barrier is repaired. Before you thank him, you notice that he’s soaking wet.\n\n“Uh…”\n“Yeah I know, I’m all wet. Stinky nearly drowned me in his attempt to wake me up. Pity he doesn’t immerse himself in as much water! Still, I guess it worked.” Melcar replies.\n\n“I heard the Nightmare Tyrant’s voice in my head.”\n“Not surprised. He’s probably trying to prevent you from using your power. He’s able to focus in on you better because you’ve been in the same location for a long time. I’d suggest moving, but given that we’re surrounded by Shadows, that’s not really an option anymore.”\n“Look, can’t YOU just send me back home? I mean that’s what you said you’d do if I had cleared your backyard.”\n“Uh, yeah…about that. I was just kind of being lazy. I just didn’t want to be bothered to do it. In fact I had a list of other chores I was going to have you do if you finished that one.”\n“What!? You lied? You mean your wife was right about you being a charlatan?”\n“AM I NOT! I AM a wizard! I erected this barrier didn’t I? Though maybe my wife is right about one thing, I am lazy. (Sigh) I guess I’m paying for my sloth now. If I’d just cleared out the backyard myself, instead of having you do it, the Shadows wouldn’t have arrived. Bah, no time to worry about the past now, we need to solve this problem. Okay, I’ll try to get you back home, without you around, the Shadows won’t be around either. I know I have some sort of portal spell in one of my books somewhere. I’ve never had any reason to use it before though and those types of spells are very taxing. I would definitely have to take down the barrier first and of course you know what that means and I still don’t know if the spell will be successful, like I said I’ve never cast one before.”\n‘Is there anything we can do to slow down the Shadows?” you ask.\n\n“Well, we can barricade the house properly before I take the magic barrier down which will take us some time, but it’s safer. We’ll have to hope the Shadows don’t break in quickly though. The second way is if we actually try to destroy all the Shadows currently out there, before I start the portal spell. In this case we’ll have to hope that the Nightmare Tyrant can’t summon reinforcements quick enough.”", "action_results": [{"action": "Barricade the house", "result": "You might have new abilities, but they’re still limited. Fighting a bunch of Shadows is just going to tire you and Melcar out and Melcar needs all of his energy to cast the portal spell.\n\n“Let’s barricade the house.” You say.\n“Alright, but I have to look for that spell first, so you’ll be doing most of the barricading. Hopefully it doesn’t take me too long.”\n“Oh, well maybe I can get Stinky to help me.”\n“Good idea, I would imagine he’ll be able to at least be useful in that aspect. Make sure you stay focused and block out any of those Shadow tricks or anything the Nightmare Tyrant might try to do to your mind.”\n\nYou take Melcar’s advice and go talk to Stinky. He’s still in a state of panic, and gibbering about the Shadows trying to get in.\n\n“Hey, help me barricade the house.”\n“But what good will that do? Trapping ourselves in won’t help! They’ll get in eventually!”\n“Look, we’ve got a plan so that the Shadows won’t bother you ever again, but I need you to pull it off and that involves you helping me barricade the house! You’re braver than you think Stinky, look at me, I didn’t think I could fight the Shadows either and I did.”\n“Yeah, but I don’t have any powers like you do and Chargrum always said that I was too…”\n“Chargrum isn’t around anymore to abuse you, so his opinion doesn’t matter, in fact it never did. You’re better off not thinking about anything he might’ve said about you. You can do this. Now’s the time to prove yourself.”\n\nYour inspiring words make Stinky feel more confident in himself, probably for the first time in his life. He immediately thanks you, and begins to help you barricade the house. You spend a whole day doing this mainly because Melcar has a really hard time finding anything in his disorganized lab. You mainly focus on the task at hand as does Stinky, but your thoughts briefly wander about your home. If…no WHEN you get back home, you don’t know how you’re going to explain your disappearance to your Mom. You can’t dwell on such things too much though, you need to keep yourself alert.\n\nEventually Melcar comes back up from his lab.\n\n“Found it. Now I’m going to go back down into the basement and begin the spell because it’ll be the safest place I’ll be able to cast it. I hope your barricades are strong enough to hold because I won’t be able to fight Shadows AND cast this spell. If the Shadows do manage to break in, well its going to be up to you to fight them off.”\n“And me…” Stinky pipes up.\n“…well, this is a surprise. Okay, the both of you then, here Stinky you’ll need something magical to fight them.” Melcar hands Stinky a wand of some sort. “Make the shots count, because I forget how many charges it has left in it. Okay I would suggest you two guard the basement doorway and when I tell you the portal is open that will be your cue to make haste into it, because again, I don’t know how long I can keep it open. You guys ready?”\n\nYou and Stinky nod.\n\n“Okay, I’m going to dispel the barrier.”\n\nMelcar makes a few chanting noises and the barrier goes down where upon you hear the Shadows howling in excitement and start trying to bash their way in. You all retreat back to the basement, where you and Stinky prepare yourselves for an attack and Melcar begins to cast the Portal Spell.\n\nAll seems to be going smoothly, but then you hear the inevitable break in, and the first Shadows attempt to recapture you. Fortunately you’re in a good position to fight them. They can’t overwhelm or sneak up on you. After striking a few down, a smaller Shadow appears and sounds painfully familiar…\n\n“YOU did this to me! Now I’ll do what I wanted to do in the first place! Throw you to the Nightmare Tyrant!” Chargrum hisses in his new Shadow form.\n\nYou take a swing at Chargrum, but you miss and end up falling off balance causing you to fall down the steps! You’re hurt, and very dizzy, but you can see Stinky trying to fight off Chargrum. He discharges a bolt from the wand, but once again Chargrum proves to be very nimble in his new form and knocks it out of his hand and him to the floor.\n\n“Outta the way Stinky! When ya get turned into one of us, I’ll make sure to really punish you, for you traitor!”\n\nChargrum races down the stairs towards you, just as you see Stinky getting swarmed by other Shadows at the top of the stairs. You roll out the way of Chargrum’s clutches and pick your sword back up.\n\n“Better put down those Shadows quickly! I’m not near done yet!” Melcar shouts from his own position after seeing you engaged in combat with Chargrum.\n\nYou strike down a couple more Shadows, but Chargrum continues to prove to be faster. He manages to knock you down again and jumps on top of you as your sword is separated from you.\n\n“The Nightmare Tyrant wants to relay a message to you!” he hisses and you feel the sinister voice of Tyrant entering your mind again.\n\n“You’ve lost! You cannot defeat me, I am everywhere. You WILL submit and become my servant!”\n\nThe Nightmare Tyrant is attempting to break your will and fill you with terror again, but it’s not going to work this time, you can feel that victory is almost near and the Tyrant probably feels it too. He knows that if you get away back to your own world that he’ll never be able to try to get you ever again. You won’t be beaten after coming this far, all you need is a distraction to help you get your sword back and Chargrum off of you…\n\nAnd with that thought in mind, Stinky comes from out of nowhere and zaps Chargrum point blank in the back with his wand. He screeches horribly as he disappears before your eyes.\n\n“Should’ve watched your back around a traitor like me, Chargrum.” Stinky smirks as you scramble to retrieve your sword.\n\nYou strike down a few more Shadows, and try to hold them back at the bottom of the stairway. Stinky’s wand has run out of charges, but the better news is that Melcar has completed the portal spell! A large blue portal opens up. Now you can hear the Nightmare Tyrant very clearly.\n\n“NO! GET THE BOY! NOW!” he roars.\n\n“It’s open! Get in quick! I don’t know how long it will hold!” Melcar shouts.\n\n“Go! We’ll be alright! We can hold them off!” Stinky adds.\n“I can’t leave you without a weapon!” you shout and hand Stinky the sword, at which point he hands you the used up wand.\n“It’s not much, but think of it as a souvenir! Thanks for your help!” he shouts as fights off more Shadows coming down the stairs.\n\nYou run towards the portal and give Melcar a look before jumping in.\n\n“Stinky’s right, we’ll be fine, though I’m sure my wife will yell at me for destroying half the house! Get in!”\n\nYou’re sort of worried about Stinky and Melcar, but you realize you have to go now. The Nightmare Tyrant bellows again to his minions about not letting you escape as you run for the portal and entering it.\n\nYou are enveloped by blackness followed by swirling colored lights. It’s all so strange and overwhelming to you that you pass out.\n\n“Hey! I told you breakfast is ready, are you going to sleep all day?” you hear your Mom call from downstairs as you awaken in surprise.\n\nYou quickly look around your room and nothing looks out of place. Your Mom hasn’t seemed to notice that you were gone; in fact it doesn’t look like you even left.\n\nWas it all a dream?\n\nYou shake your head trying to decide if it was, then you notice a small rod on the floor next to the toys you set up yesterday. It’s the used up wand and oddly it’s right next to a couple of figures, one holding a sword and another with his hands positioned to cast a spell. They strangely have a tired, but yet relieved look on their faces.\n\nIt wasn’t a dream. It was real. Created by the power of your own imagination. You decide you’ll keep this information to yourself though, since nobody would ever believe it!\n\nYou had an interesting adventure, but you’re glad to be home you think as you go downstairs to eat.", "action_results": []}, {"action": "Destroy the Shadows", "result": "You want to get home and away from this place as soon as possible. You feel with your sword and new abilities along with Melcar’s help you should be able to take care of them.\n\n“Let’s destroy the Shadows!” you say.\n“Alright, but let me look for that spell first, because after we’ve destroyed the Shadows, we’re going to want to cast the portal as soon as possible. Shouldn’t take me too long.”\n“Okay, what about Stinky?”\n“Stinky? He won’t be of any help! He’ll probably be hiding in the house the whole time! I’ll go look for that spell, you just get yourself prepared, because this won’t be easy.”\n\nYou take Melcar’s advice and begin to get yourself in a proper frame of mind; in fact you spend a day doing this since Melcar has a really hard time finding anything in his disorganized lab. Stinky is constantly in a state of panic, and gibbering about the Shadows trying to get in, making it harder for you to keep yourself calm.\n\nEventually Melcar comes back up from his lab.\n\n“Found it; alright let’s get rid of these Shadows quickly. I’m going to dispel the barrier.”\n\nMelcar makes a few chanting noises and the barrier goes down where upon you hear the Shadows howling in excitement and start bashing their way in, and in the case of some already get in through the upstairs window.\n\nYou and Melcar begin to fight the Shadows, while Stinky goes off to hide, though it doesn’t do him much go since the Shadows at this point are intent on not just getting you, but now everyone in the house, eventually all of his running and hiding attempts fail as you see him being dragged off by a few Shadows, you attempt to stop them, but nearly get yourself captured in the process.\n\nThis ordeal is very tiring as the Shadows seem to be more numerous than you thought. Melcar eventually exhausts his spell power and is reduced to beating the Shadows with a magic wand. You briefly worry about him being able to cast the portal spell, but as it turns out, that will be the least of your worries.\n\nA shorter Shadow suddenly jumps on your back; it begins to taunt you as it attempts to wrestle you down. The voice is very familiar…\n\n“YOU did this to me! Now I’ll do what I wanted to do in the first place! Throw you to the Nightmare Tyrant!” Chargrum hisses in his new Shadow form.\n\nWhile you manage to get him off and strike him down, Chargrum was able to distract you long enough for other Shadows to overwhelm you, and your sword is separated from you. The blackness has now enveloped you and your worry has now become terror and you can’t think straight. You call out for Melcar to help, but he too has been overwhelmed.\n\nThe sinister laugh now fills your mind, paralyzing it, and soon all is forever shadows when you are taken directly to the Nightmare Tyrant.", "action_results": []}]}]}, {"action": "Fight him", "result": "Chargrum is your height so you think you can fight him off, however you’re forgetting that he still has the strength of someone a lot older than you, he easily fends off your attack and grabs you by the scruff.\n\n“Stinky open the door! We gotta get rid of this Shadow magnet! NOW!”\n\nStinky fumbles with the door while you protest and struggle, but its no use, Chargrum has already thrown you outside to the Shadows.\n\nWhen you pick yourself up, you’re stricken with mind paralyzing fear as a large group of grinning Shadows encircle and capture you.\n\nThey take you back to the Nightmare Tyrant who has no intention of getting rid of you.\n\nEver.", "action_results": []}]}]}]}