{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=18988", "context": "", "first_story_block": "Vampire.\n\nIndeed, that is what Kelso called you. You can still hear his cold, baritone voice explaining it to you. Vampires in the tales of Fantasy are glamorized; nigh-immortal, sexually desirable, powerful. But, while you suppose you are some of those things, in truth, you are not much more than an albino with a lot of health issues. The sun, he said, will damage your skin more than anything else. Any sort of foodstuff can't be digested anymore by your barely functioning bodily systems. He claims to have an idea of what the 'Professor' was trying to do to us, but for whatever reason, he has dodged the questions anytime you ask.\n\nAny information other than that, Kelso hasn't revealed. The irking thing is that it is obvious he knows what's going on, but he consistently acts as if it is in your own good you don't know what went on.\n\nThe nights have been hard since your escape from the Facility. Most nights you wake up shivering, after all the nightmares you've been dealing with. It's terrifying, and it only makes you wonder what horrible things were done to you at the Facility. You do know that they must have affected your ability to feel. No, not the wishy washy 'emotional' garbage you'd usually expect, but your sense of touch was dulled. While a lot of your senses have been heightened, that one stands out. You feel very little pain from your feet, which is odd; considering how you spent your time running over cracked glass just two days ago, but it seems to have healed recently.\n\n---\n\nWaiting. It should be sunrise by now. Kelso said you shouldn't get out, as you are a creature of the darkness now. He, on the other hand, has been out for the entire night and then some. You're not sure what Kelso is hunting for, but you know that you're beginning to get thirsty. More and more questions begin to build up, and no doubt the bastard won't answer half of them. Even while you ran with him through the night, running across various landscapes. Most are just a barren dessert, though every once in while you'd pass a half-buried house like this.\n\n\"Bright lights up ahead.\" He said. A city only several miles down. Kelso must have gone there for the clothes he mentioned, but you hope he's safe....", "action_results": [{"action": "Continue waiting inside for Kelso", "result": "A sigh leaves your lips as you ruffle your hair with your hand. Now scratching, several hairs fall off. Perhaps not too unusal; trivial, even. But things like this interest people in boredom. That, and the twitching of a certain fly beside the table. Twitch. Twitch. Twitch.\n\nIt's annoying. Your nose flares as you continue to sit. Sleep isn't what it used to be either, more like an odd sort of meditating. Besides that, your senses continue to ring as the fly takes to the air around you. It lands, and you feel a faint tickle on your cheek-- And you catch the damned bugger. Nothing but your hand moved, a small action was all it took to take the flies life. You didn't even mean to kill it immediately, though you don't mind it's yellow ooze. Without feeling it, you squished it. Threat destroyed, you put your fingers to your temples and try to meditate.\n\nAlmost immediately, your mind begins to drift...\n\n---\n\n\nCome on, wake up!\n\n\"Wuh? What's going on? Who are you?\"\n\nWe can formally reintroduce ourselves later damnit, the lab is falling apart!\n\nThe lab? What lab? Why the hell am I in a lab?\n\nI'll explain everything once we're safe. But we need to go. Now.\n\n\nIt is then when your eyes adjust enough that you can actually view the chaos that surrounds you. The red, flashing lights give you just enough light to make out cracked capsules with smelly liquid pouring out from them and flooding the floor. Looking even slightly up, you can see your own smashed container, as well as the pillars supporting the ceiling riddled with cracks. An odd assortment of humanoids seem to be sprawled out on the floor, with several still writhing and creeping sluggishly.\n\nBut besides all this, you don't really feel much, considering. A numbing liquid surrounding and licking at your sides, but not much else. You can't even recognize your own heart beat. Then again, that's quite possibly due to the tension and commotion. Perhaps you were numbed while in that storage container.\n\nThe man beside you seems to still shaking you, though it takes you several seconds to notice. Grabbing you by the hand, he begins to force you up and drag you along until your legs begin to feel enough to move. Although still sluggish, your motor controls seem to be working better than whatever you could remember. Finally, you feel like you can resume mumbling out questions, even while hurtling around breaking pillars and stumbling on broken glass.\n\n\nWhere... where are we going?\n\nOut. The Zealots of the Church may come in any moment, so we need to evacuate.\n\nThe Church? I... Can you at least tell me your name?\n\nStop talking. Just run.\n\nHow do you expect me to trust you if I don't even know who you are?\n\nI'm not sure you know who you are either, right now it's best you trust me and shut the hell up.\n\n\nAnd you do. Thinking about it, you really don't remember who you are. Who you were? It's... blank.\n\nThe man's hand is outstretched, motioning you to hold on and follow.\n\n---\n\nA sudden crashing noise awakes you from your revelation.", "action_results": [{"action": "A uniformed man appears.", "result": "Out of nowhere, a humanoid with flashy armor leaps at you. Fearful, you quickly send out a powerful jab, lamely clunking on his armor as he topples on top of you. You expect him to attack, or continue the assault, but he appears to be as dazed you are. Although the metal armor is heavy, you're able to throw him off of yourself, hearing a splintering in the wooden floor as he lands.\n\n\"I'm here.\"\n\nIt's Kelso. His striking features resemble an older gentleman. Whitish blonde hair and a gruff voice, though perhaps with a slight German accent-- almost grandfather-like. \"Master, where were you? What... is this man doing here?\"\n\n\"C.E. Agent, member of the Church and Special-Forces Unit for taking care of our kind. You need to kill this filth.\"\n\nYou raise an eyebrow, \"What? I dunno... Ugh. No, Kelso. He's just, like, doing his job. I think? No, it doesn't matter! What's going on?\"\n\n\"His job is to murder Creations, government is after us and the rest of the-- the Professor's creations. We're not safe. Which, is why you need to kill this officer. You need to get used to this before it becomes more common to handle.\"\n\nThe soldier slowly looks up at you, scrambling to get up. \"You two... speak? Lord in heaven, the damned speak!\"\n\nYou can imagine his eyes would be widening right about now, but his entire body is covered in the metal suit, flashing with electric blue lining, his helmet with a black visor. The figure, now up, begins to scramble for a rifle-like object, but Kelso gives a heavy slap to the back of his head, sending the man flying forward, his helmet flying off in a different direction.\n\n\"Kelso, Creations? What the hell is going on? Tell me!\"\n\n\"First, kill him.\"\n\n\"I'm really not sure about this...\"\n\n\"Kid, I know you're hungry.\" It's true. \"This is the only thing you can feast on.\"\n\nYou just stare in disbelief, shaking your head. Kelso stares at you for a moment before turning around and kicking the operative in the side. You hear a dent and a crack, likely his ribs were smashed along with his armor.\n\n\"Let's get your questions over with. Now. You need to decide what you'll do with him.\"\n\nYou take a deep breath, just shocked at everything that's transpiring. After mumbling and scratching your head, you think you know what to ask.", "action_results": [{"action": "\"Why the hell do I need to eat this man?\"", "result": "Kelso sighs with an apparent annoyance. \"You're not eating him. You're going to drink his blood. I've explained this before.\"\n\nHe sort of did, but it doesn't exactly make it better. He told you that you couldn't digest any food, but he never mentioned you'd have to digest blood!\n\n\"I... I drink his blood... from the neck?\" Your knowledge about supernatural creatures is more or less non-existent, give or take whatever nerdy things you might have dabbled in high-school. Unless you were some sort of jock before then. You don't remember...\n\n\"Not necessarily. The wrist works too-- as long as you get a stream of blood in your mouth you'll be satiated. This should be easier as things go along though, since any sort of infirmary should have some blood packs for transfusions, and those are easily broken into. And you can always drink non-human blood... But this is necessary. Oh, and do remember to watch out for the diseased, bad blood isn't good for yor system.\"\n\n\"Ugh... Do we really have to kill him?\" You ask with a frown.\n\n\"Unless you want him to call upon the rest of the C.E. Crew on our asses, then yes. Either way, you need to be full before we leave this shit hole. We have work to do.\"", "action_results": [null]}, {"action": "\"Creations? What did the Professor do to us?\"", "result": "\"You and me both. The Professor was a nasty sort, creating freaks of nature to...\" His face seems to strain, though for reasons you may or may not realize, \"To... for a program, you see. The Government shut the facility down early enough, but he kept the creations up and running for a while longer. When the soldiers came to burn the place down, well, that's where you and I come in. Possibly others.\"\n\n\"There are more like me and you?\" You ask, trying to absorb as much as you can before Kelso shuts up again.\n\n\"Maybe. I'd be surprised if that much survived the raid. But there are certainly other experiments that the Professor did. Chimera, Were-beasts, you name it. And, of course, 'vampires', like you.\"\n\n\"What about yourself? I thought you were a vampire as well?\n\n\"I'm a lot of things.\"\n\nA pause in the conversation occurs, before you shake your head and continue the questionnaire, \"Right... And why are the soldiers trying to kill us?\"\n\n\"I told you already, the Church, lead by a certain priest named 'Tomas', believes we're demonic mutants created by the Professor. They think they're cleaning the world from us. That's what they've been doing for years, hunting down Creations on some sort of religious-killing spree. The facility which you woke up from was the last one before they destroyed it. Even though we live virtually forever, this is a curse, kid, and they realize that. As Creations, we're biologically forced to do things. We have to drink blood-- it's a necessity. The sunlight burns us, for our skin is too fair. What they don't realize is that we're also sentient beings. We were humans, once.\n\n''And yet, the bastard that made us still lives somewhere out there. And I want you to help me find him. Furthermore, if we make a good enough team, we may even be able to overthrow the Church, for it's reach is strong. They're more or less the only ruling bodies the world has currently... Both of them, the Professor and the Church, are evils that need to be eradicated. We'll stop them both, just stick with me, kid.\"", "action_results": [null]}, {"action": "\"Who am-- was I?\"", "result": "Kelso stares at you, obviously contemplating how to answer.\n\n\"Don't know, don't care. Your new life begins now.\"\n\nDamn. Well, okay, doesn't seem like he's going to reveal anything...", "action_results": [null]}, {"action": "Continue.", "result": "After asking all the questions you can think of, you watch the pained man writhe and groan. The domineering Kelso looks at his pitiful state, bends down and puts his index finger to right above where his carotid artery is, obviously sensing for the pulse. \"Here, sink your teeth in and drink.\"\n\nAlthough you are hesitant, your instincts take over as your mouth begins to water slightly, making it slightly less dry for the first time. As you bend down, you begin to feel... fangs protrude from your upper jaw. Sharp, powerful teeth, ready to satiate your hunger. Hoping to get it over with, instinct and lust takes over as you bring your head down and get your teeth stuck on top of his neck. Rich, red blood squirts with an ugly squishing sound.\n\n\"God damnit, on the artery!\"\n\nKelso grabs your neck and, pulling your fangs out of the man, forces it back on the right place. You moan, half in pleasure and the other half in disgust. It tastes... salty, filling. It tasted good, and you don't mind choking on this stuff. It's the first time you've felt such a rush, it's like a drug...\n\nBut, on the other hand... This isn't human. This man... He's screaming, begging. Something about children and the forces of evil...\n\nAs Kelso let's you have control of your own neck again, the sudden rush ends, and you cough out the other man's blood. \"You didn't have to kill him, but he's dead now. Which is actually a good thing, but you really should be less sloppy. You missed.\" He continues to smile. Kelso begins to strip the Zealot's armor off, and hands it to you. A walkie-talkie falls to the floor and clatters, though it remains undamaged.\n\n\"Now we can begin.\" He tosses you the armor, a hoodie, and some sort of... lotion?\n\nYou catch, it reflexively, \"Begin what?\"\n\n\"Our vengeance. Tying up loose ends. Give meaning to your un-life.\"\n\n\"I... I just killed a man!\"\n\n\"Who was going to kill you. Plus, it was an accident.\"\n\nYou stand there, with bloody hands and a mouth dripping with delectable blood. Kelso... What's he up to? He... You think he's a good person, he saved you. But, this isn't right. Maybe you should get away...\n\n\"Snap out of it kid, we have a duty to fulfill. This isn't a blessing what happened to you and me, and that's why we need to kill the man who did this to us, so he can't do this to others.\"", "action_results": [{"action": "Lacking a healthy alternative, join Kelso for your new life.", "result": "It's like the first time you remember Kelso. His hand outstretched, asking him to join you... You shake it firmly.\n\nIt's crazy, but you trust him. Like a baby chick to the first thing it sees... It's funny. He's become of a master and more like a father. While he may not have the most moral methods, he still knows way more than you and will help you through it. Besides, the Professor no doubt know your origins, before you kill him you might even get that from him. If you stick with Kelso, that is.\n\nAs silence consumes the conversation, you attempt at conversing, \"So, the lotion...\"\n\n\"Sun-tan lotion. It wears off after a small while, but it'll protect you when it counts. Spread it on your face, wouldn't want that to peel all the way off. The hoodie and that is the best things I was able to take.\"\n\n\"So you stole it?\"\n\nHe shrugs. \"Took it. We need to hide, remember? Can't have people know about us and our condition. The soldiers are much stronger when they are in control. Also: the Zealot's armor. It's worth equipping, just need to turn off the flashy-light part.\"\n\n\"And now what?\"\n\n\"You stop asking questions and let me finish.\" He eyes you with seeming annoyance. \"We'll be finding his stronger Creations that no doubt survived this long. They're a violent lot though, which is why having you will be a big help. I figure one of them will know where the Professor is.\"\n\nAs if reading your mind, he continues, \"And we find them by trailing the C.E. Division, which have specific DNA trackers on some of us. Not you or myself, thankfully, but a good deal of the Creations were registered to the government. Government program and all... But anyhow, we're going to town soon. I say we wait at the police station, they should have an outpost there. After hearing where they are, we hitch a ride in one of their vans. Not a very elaborate plan, but it'll probably work.\"\n\nHe stares at you, as if expecting resistance. \"Unless you have a better idea?\"\n\n\"Actually...", "action_results": [{"action": "No. It seems solid enough. Let's do it.\"", "result": "\"It seems solid enough, let's do it.\"\n\nHe nods in return, as if pondering about something. \"Then let's go.\"\n\n\"Now? Are you sure I'm ready?\"\n\n\"Yes now. You're ready.\" Kelso smiles.\n\n---\n\nSuffice to say, you're pretty confident. You're in full control of your new body, and the armor you looted off the zealot may be bulky, but you'd be damned if you didn't look awesome with it. All this gave your self-esteem a much needed boost before setting off to the City. Kel, as you've come to call him, probably realized that when he offered it to you. Admittedly, it's probably why you haven't pressed him for questions on the plan; he just seems to have everything under control.\n\nNow, on the night of the full moon, Kelso's ambiguous plan will be enacted. Perhaps the full moon was completely planned, or perhaps not. Regardless, the tension can be felt in the air. Regardless, the journey to the flashy city several miles down is uneventful, save for the fascinating landscape and occasional howls that Kelso doesn't seem to hear (you've mentioned this to him; and he took interest but told you to save it for later, as it may be important).\n\nBut yes, the landscape changed dramatically from the collection of half-buried houses that you were holed up in with Kelso. From complete, uninhabited desert, to a flashy, futuristic town with strobe lights and a somewhat dense population considering the size of the premises. It's not even that big, but it's... Out of place. Surrounded by desert, it stands as a beacon of light.\n\nYour mentor is garbed with the hoodie he gave you earlier, his older, but surly exterior showing out in the twilight. As he leads you through the sand to the City, he suddenly stops to speak; and you stand at attention.\n\n\"So, you're probably all ears to hear what my plan was.\"\n\nYou nod. \"Err, yes.\"\n\n\"Then why didn't you ask? Didn't my plan sound ridiculous\"\n\nThe wind stops blowing. \"I know you have everything under control. I trust in you, master.\"\n\nKelso turns to face you, his face solemn and grim.\n\n\"Then you're not what I need. I want to tame a lion, not a goat.\" He spits, and before you know it your face has hit the rough sand. You quickly turn to see Kelso jumping up, the moon behind him and his silver claws in front, his eyes now turned red and gleaming. You jump from the ground to the side, but his hand catches your chest. You breathe; it doesn't regenerate.\n\nAnother breath. More blood squirts out. His other hand now clawing at your eyes. Aching pain... it's all black, but you're still alive!\n\nYou can feel your body spasming, and you turn all your confusion into rage and power, but to no avail...\n\n\nYou have been killed by your mentor.", "action_results": []}, {"action": "Why don't we just signal them?\"", "result": "Kelso rubs at his clean chin. \"Elaborate.\"\n\nYou hold up the walky-talkie, \"If they know where the Professor is, then that means they're either working for him, like you're assuming, or are just planning their vengeance; If we can get a message to them, get their attention--\"\n\n\"Then the C.E. Soldiers will get to us and them.\"\n\n\"Not unless our signal is obscure, something only a Creation would know. Can I assume that we're the only one who refer to the Professor, as, well, a professor?\"\n\nYour mentor smiles, \"Yes... That's what the greater Creations called him. Myself, the Werewolf, Stein, and several others. We all were forced under the bastard to look over Lessers, like yourself. One of them are bound to be in this town, has the smallest C.E. division in the East. We just have to hope we'll be able to handle them in the case that they're still loyal. So you want us to send a wide broadcast, maybe even a flare labeled 'Professor', and hope we catch some of our brethren?\"\n\n\"That,\" you continue, \"or we lure the church to us by contacting them with the Walkie, and just beat the information out of them. By the sounds of it, they'd be expecting a trap, so they wouldn't bring all their operatives to this location. Hopefully they have an idea where the other Creations are. It's not a perfect plan, but it's uh, better than yours. Don't think you can just nab one like you did with the last one, now that they're probably on guard.\"\n\nKelso nods, considering both of your plans, \"Much better. Regardless, Mr. Plans, we need to train.\"\n\n\"Train, for what?\" Crossing your arms as a child would, you question Kelso. \"I feel like you're not telling me everything. Even if the plan is solid, but we need to be solid, with, umm, each-other.\"\n\nWith a chuckle, Kelso replies, \"What do you think we're doing? We're fighting against an elite military operation, as well as bio-genetically advanced Creations. We're not playing here, son, there's going to be blood. I'm pretty certain that you'll be able to be very powerful if we train accordingly. This may be surprising, but I think you should cherish your undeath while it lasts. Not to mention that I'd rather not jeopardize myself.\"\n\n\"... So the Creations are going to be very hostile?\"\n\nHe shrugs in return, \"Maybe, more likely than not anyhow. We're betting on whether they're still loyal or not to their Creator.\"\n\n\"Why would they still be loyal to that... that bastard?\"\n\n\"Well, he did save our lives.\" You stand in silence with a confused frown. Kelso continues. \"Mind you, he also treated us like lab rats and played with our genetic-material. That's why we're going to find him and his Creations, to put an end to it once and for all, so no one else is 'saved' by that man.\" You nod in understanding. Kelso and yourself... You're going to help the world together. Clean it.\n\nA hero...\n\n\"The valley of dunes at night is the best place and time. We'll train today and tomorrow, and by then you should be ready. Now, more about that plan of yours...\"", "action_results": [{"action": "Contact the other Creations in any way possible.", "result": "You spend the next several nights preparing for action, training with Kelso. Over the course of your tutoring, you've begun to really fit into your new, adaptable body. You're able to fight, and you're able to think, strategize. Be efficient, be in control. You know you're ready, and you don't need Kelso to convince you of that anymore. You feel like you're ready to pull off one of your plans.\n\nIt's night once again, with the Moon full and bright. Kelso is clad in your hoodie, his aged but intimidating features showing out from under it. It didn't seem like his ideal clothes (you could see him rocking a cloak) but when at night a hoodie is probably more practical. You're still garbed in the bulky, but inspiring armor of the Zealot, just with the lights on the outside turned off. You look to your Mentor, who's sitting beside you in the half-buried house. You begin to explain your simplistic, though wishful plan to your mentor.\n\n\"This is obviously just an assumption, but if we were able to nick a talkie pretty quick, then any other Creation in the area would probably have one.\" You begin, eyeing Kelso's facial expression.\n\nBlank. \"Sound logic.\"\n\nYou cough, and then continue, \"But they wouldn't use the same channel that the Church uses to communicate, I'd assume. So if we fiddle with the channel, go through each one very thoroughly, then-\"\n\n\"We may find a fellow, nearby Creation. Interesting, though it may not work.\"\n\n\"And if it doesn't work then we can try my other plan.\" You say arguing for your plans.\n\n\"Well, we should get this done quick then. You're likely going to get hungry if you don't drink soon. Couple of days, I think.\"\n\nYou shudder; drinking like you did last time wasn't fun. Even if it was tasty. \"So, you think it's worth a shot?\"\n\nHe nods, \"Provided you know what to say to them if they reply.\"\n\nThoughts begin to form, though you can admit to yourself that you're not a hundred percent certain on what you could say. Hello, we're looking for the Professor? ... Um, want to tell us where you are? Thanks, please don't kill us when we meet.\n\nYou laugh, the situation playing out in your head. \"Let's do it then, no reason not to.\" You grab around and find the Zealot's walkie-talkie, and switch it on...\n\nClick\n\nYou immediately memorize where the current dial is set at and then begin to move the dial all the way to the left. You wait for a moment, only hearing static. The dial moves about a millimeter to the right-- just static. One centimeter at a time... To say the least, it gets aggravating. More static, keeps going, and going, and no dice.", "action_results": [{"action": "Trudge along...", "result": "Every time the dial moves slightly less than a centimeter, you pause for thirty seconds, push the button and recite in monotone, \"Hello, are you knowledgeable about the Professor?\" Hoping you catch something or get a response. Kelso's eventual chuckles are disconcerting, to say the least, but you focus on the problem at hand. You continue pushing the dial to the right, passing it's original point and beyond. Meanwhile, you're praying to no deity in particular that your plan succeeds. You want to impress Kelso. He's like a father-figure, the first person you saw when your hatched out of your tube. On the other hand, he's a teacher who's withholding information, which gets frustrating at times. You remain conflicted about the only person you have met in your vampiric form.\n\nSuddenly, you hear a response. Short and you can't make out what it's saying, but it's something. You push the button and repeat, \"Hello?\" You stop pressing.\n\nLots of static, probably bad reception on their end. A gruff, snarling voice speaks out, \"Who's there? What's this about a professor?\"\n\n\"You know who I'm talking about.\" You reply, hoping. \"The Professor, the one who Created us.\"\n\n\"Then who are you?\"\n\n\"A fellow Creation, and I want to join forces. The Zealots are too many in number for my liking.\"\n\n\"Do you really... Who's with you?\"\n\nYou look to Kelso, who brings a finger to his lips. \"Just... Just me. Why?\"\n\n\"Because you're lying.\" The voice coughs, sending over a truly ugly sound over the transceiver, \"But no matter. You wish to join the Wolves then, right?\"\n\n\"Assuming your group can take care of itself. How many are your group and where are you?\"\n\n\"Five and growing. You won't find it, it's under the ground.\"\n\nAnd growing? \"So can you lead me to where you guys are?\"\n\nYou wait a couple of moments, and then he answers, \"Hmm... Nah. We don't need more nutbars in this camp. I'd rather not bring attention to our hideout from the Zealots.\"\n\nSon of a bitch. \"Well, you're missing out, Wolfie.\"\n\n\"I'm sure I am, haha.\"\n\nYou click it off. \"Sorry, Kelso, that was pretty pointless.\"\n\n\"Though interesting. It doesn't sound like they're too interested in finding the Professor, rather just survival. Perhaps with a little arm twisting we can get in there...\"\n\n\"If we find out where they are.\"\n\n\"Well, that's what Plan B is for, right?\"", "action_results": [{"action": "Try to lure a Zealot here, in hopes one of them know where the Wolf hideout is.", "result": "\"Err, uh, yeah. Let's try my other plan.\"\n\nKelso laughs. \"Of course.\"\n\n\"Hey, both of my plans were better than your's.\" You argue, setting the dial back to where it was. Now that you think about it, you wonder why the Church never went out looking for the Zealot which your mentor killed, and you killed. Perhaps they did, just you and Kelso never noticed it. Or perhaps the Zealots often went out in long journeys without communication.\n\nNo matter now, You realize, they'll pick up at the signal. Somebody will.\n\nExcitedly, you fidget for the WT, and grasp it firmly. You clear your throat to speak, but Kelso briefs you.\n\n\"Remember, just put the channel on. Listen in and wait for a while, and if nothing turns up then try speaking. But only then.\"\n\n\"Does it matter?\"\n\n\"It might.\"\n\nYou cough again, then breathe in. Out. In.\n\nYou put the dial back to where it was in the first place.\n\nOut. Nothing but static, for now. Minutes go by. You stand at the ready. But all is static. Ten minutes turns to half an hour, though your body doesn't stop tensing. Something is coming.", "action_results": [{"action": "Try to communicate.", "result": "You push the button on the walkie-talkie, and speak into it. \"Hello?\"\n\nMoments pass. After several more crackles you get a response. A cool female voice speaks out, \"Sebastian? Seargent, is everything alright?\" British?\n\nKelso shoots you a sideways glance. You can almost feel him sending you a message with his eyes. Be creative, you call the shots for now.\n\nYou blink. Ahem, \"I have spotted some of the err, creations.\"\n\n\"Well of course you have.\" Matter of fact tone. \"We've known where the devils that are the Wolves have been for a while now. We just need to strike them. Which reminds me, we should get back to base.\"\n\nPerfect. Ish. \"No! The, uh, lord helped me and I found others.\"\n\n\"Others? What do you mean?\"\n\n\"There are other Creations that have escaped aside from the, uh, wolves, and-\"\n\nThe woman on the other side is excited, \"More?\"\n\n\"Um, only one. That I found, at least. But one is one too many. I uh, need backup.\"\n\n\"Stop stuttering, Sebastian. This is important. Where are you? Now searching it up...\" Pause. \"Your GPS tracker hasn't been functioning for a couple of days. That's probably why security has tightened around the City. Where the hell are you?\"\n\nShit. \"Well, uh, the battery died and, uh, things happened.\"\n\n\"Things? Sebastian, I... Did it take you hostage?\"\n\nYou've decided you like her voice. \"It?\"\n\nShe lowers her voice, \"What is your general location, Sebastian? We'll find you. You'll be safe.\"\n\nYou pause, looking to Kelso for help. To tell the truth, you have no idea where you are. Kelso looks the other way. You sigh, annoyed at him. Maybe he's just a bit offended that your plan was better. Or not.\n\n\"I...\"", "action_results": [{"action": "Force the reciever into Kelso's hand.", "result": "Scared to risk stuttering more and screwing things up, you take the WT and make sure Kelso holds it. He looks at you with contempt before speaking into it.\n\n\"Indeed.\" He seethes, his voice threatening and just... Cold. Kelso doesn't even need to try to get his voice that way, it just is, even if it sounds grandfather-like when he scolds you, \"I have him. It's amazing how the Church has destroyed what's left of this Earth. Only desert left aside from your little colony and houses buried in sand. But believe me, this 'Sebastian' isn't the first human who I've caught.\" Kelso pauses, and releases the button to see if she responds.\n\nShe doesn't.\n\nHe finishes. \"And he won't be the last.\"\n\nClick\n\nAnd it's off.\n\n\"Master, wasn't that too dramatic? We don't want them to send more than we can handle...\"\n\n\"Kid, you never force a person into a conversation he didn't start. You'd think you'd still remember proper manners. Let's just hope to heaven they don't bring every damn one of the king's men.\"\n\n---\n\nKelso and yourself find several mounds to hide behind. There are only several clusters of areas around the big City that have the half-buried houses, which means that the religious troupe will likely find them there, at some point. You keep your sights on the city. Every once in a while you'll see moving lights across the landscape, which are subsequently turned off. Then on. And off again...\n\n\"Those are the soldiers.\" Kelso points out to you. A good deal of them too, and approaching quickly on more than one side. The lights seem to travel in groups. You count... Eight groups of five. You wonder how many you can take, and in turn how much more Kelso could.\n\n\"So, what's the plan?\"\n\n\"We capture one and hightail it out of here. This... Is going to be challenging.\"\n\nYour mentor stands up, watching the approaching mob of Zealots. Two or three are way off, lighting up the opposite direction, but the rest are surrounding your vicinity, though you're uncertain if that's on purpose or not. Kelso motions you to come closer to him, to listen. \"This is where we split up. They're trying to flank us, but that won't work when they're spread out like this. We're, funnily enough, a straight, though long line away from the city. The lights are moving toward us, and with other groups closing in from the two sides; a circle. I go one way, you go the other.\"\n\n\"Like we trained, I hit hared and fast.\"\n\nHe nods. \"Let's get to it then. Good luck, kid.\" He begins jogging to the left. It's when he breaks out into a run when you only begin moving leftwards. For the first time since you escaped the Facility, you're scared. You sprint across the sand with your head down, maintaining balance and stealth even with your heavy armor. You ready yourself, the lights shining brighter and brighter until... You see them. Tall, thick, dark; the words that come to mind. Shining Crosses on ebony metal that covers the entire body, down to the legs. His helmet's visor is like a medieval knight's, only more techy. Not only that, but their rifles are huge, with tusks at the end. You wonder what caliber that behemoth could hold...\n\nStill, you have the element of surprise, if only because you aren't a lightbulb shaped a like freaking cross.\n\nYou leap up, letting a gust of wind propel you, making a cross of your own in the night-sky, Your body finds itself right above the ringleader, who dumbly looks up when your feet, disguised as sneakers, land on his  helmet. A heavy clunking sound is made before you hear a snap (his neck), which you use for momentum, jumping at another, this time with your fists. Refined rage, like Kelso taught you.\n\nIt was going fine until bullets came into the picture. After the second clunk the last three of the group turn and point their bayonets-on-crack rifles at you. What comes out isn't a bullet, more like... Lightning?\n\nIt bursts out at you with a mighty roar, and you feel your skin ripping, only to regenerate. Three more blasts, you make another swipe, hitting viciously through the armor of one, finishing him off with blood. Three (who were shooting at you) to go.\n\nThey reload, which thankfully takes enough time. One of them doesn't bother, however, and stick the tusks of his rifle into you. Some of your blood spills, and even more of his bursts out when you push his rifle from inside you to inside of him, his armor nothing when your rage takes over. With blood squirting into your eyes, the rest are easy work. You claw at the armored figures, their lightning-shots hurting you but not overcoming you until... You're done. Five of them were killed, and you don't even remember how the last one went down. You lay on the sand, too stunned to move.\n\nMore of the Crosses come over to belt you over the head with what must be a bible, because damn was it heavy.\n\n---\n\nEven more bright lights (a recurring theme, you tell yourself), and you find yourself strapped onto a chair. The room is all blue, but your chair is white. For whatever reason, the colors seem pleasant, and calming to you. You wonder what happened to Kelso...\n\nA powerful voice speaks out, \"Who are you?\"", "action_results": [{"action": "Reply truthfully.", "result": "\"I honestly don't know.\" You reply to the voice, \"But who are you?\"\n\nThe blue room begins to make funny, scratching noises. Then, the sound of clinking; gears shifting, and a part of the room turns backwards, revealing an opening. Out of it, and elderly man with a flowing white beard, skullcap and robe comes out. \"My apologies,\" His gravely, but strong voice speaks out, \"I am the founder of the Church and retired Zealot.\" As he says this, a hatch in the floor is cranked open, allowing space for an odd chair to form out. \"May I take a seat?\"\n\nYou lick your lips. Still some blood on them, you would have thought the assholes be kind enough to wash you, but apparently not. Seeing you not respond, the Father takes a seat. \"So,\" He begins, \"You don't remember... Anything? How have you been surviving alone? You're young.\"\n\nYou nod. \"No. I woke up when your 'Zealots' destroyed teh Facility. I'm lucky I made it out alive, with your dogs burning it down. I had a mentor, though you likely got him as well...\"\n\n\"There are two unlisted Creations? Fascinating.\" He strokes his beard, \"The burning of the facility was necessary. Not that you'd know, you're in the dark, I believe.\"\n\nYou find this funny, though not untrue. \"And you're about to enlighten me?\"\n\nTomas nods, \"Then end your suffering, through any means necessary.\"\n\n\"So I'm going to die by the end of this?\"\n\n\"Of course. Though there's always the option of cooperating. Even the saints needed the devils to do their bidding. Sometimes.\" He smiles.\n\n\"I'm not some sort of 'devil'.\" You reply, bewildered, \"Why do you suppose that?\"\n\n\"You like stories, yes? Because there is a necessary one here, one that you probably never heard of.\"\n\nHead shaking, you motion for him to carry on.\n\n\"For being such a good sport, I'll cut out the dramatic parts and just get to the real 'beef'\" He states, his eyes trained on yours. He coughs, spewing out dots of mucus in your direction, then does it again. WIth his throat now cleared, Father Tomas begins his tale.\n\n\"The world two decades ago was a much different place. Lush greens were the equivalent of sand today; everywhere you looked, there was grass. Huge cities, several miles in circumference, were common place. Buildings reaching the clouds and mods of transport like griffons, soaring high above. Religion, ironically, was considerably less widespread, and it continued to dwindle as so-called 'science' led many astray. As evil was legalized, sodomy and murder-rates soon became more and more consistent and the government fell to anarchy as horrible diseases began to spread. Militant radicals spread throughout the globe, raping and pillaging. At the time, to those who were looking, it was obvious that this was God's Reckoning; his flood to bring about a New Age. That's where Simon Kurschner's Creations came into play. With government support, he tried to find a way to get out of the apocalypse, not realizing it was God's will, it couldn't be stopped. But he tried, and he received the funding to do whatever he wanted, with hopes of stopping the plague, and creating beings who could stop the barbarians. He took the dead and dying, experimenting on them and trying to create slaves. There is no doubt in my mind he did things that weren't legal, but that didn't matter to them. As long as he saved us, he could go against the Lord's will, using humans as guinea pigs, and secretly trying to make for himself perfect slaves. Kurschner created many different sorts of entities, and for the next several years he was a beacon of hope for the non-believers. But we, the Church, we knew what was coming. The Creations were immune to disease, and had a fighting prowess unmatched by the strongest armies in the world. One Creation could destroy hundreds of Radicals with minimal effort, and it seemed like this would fix everything, but hell on Earth stayed. Even after the threats were stopped, the Creations and their Leader wanted more. They began to kill indiscriminately, with an attempt to rule the world.\"\n\nHe takes a deep breath, trying to remember, \"As God decreed, the Earth began to decay in the demons' wake. While Doctor Kurschner ruled his legions from hell, a few of us banded together. The Church was the new Ark; we banded together to maintain what's left of humanity. IT was hard, but we suceeded, with several towns in the Northern United States. But the demons still linger, and it is our duty to destroy what God intended to not let live.\n\n\"Because that's is what you are!\" He raises his voice, shaking his fists angrily at your helpless self on the chair, \"You were supposed to stay dead, like the rest of the infected. But you were given life, and now are doomed to live a cursed life because of that Doctor. That is why the Church will destroy all the Creations that are still roaming the Earth.\"\n\n\"But they're still human!\" You interrupt, pointing to yourself, \"I'm still human.\"\n\nThe Priest continues, as if not hearing you, \"However... It isn't your fault. Perhaps that's why I'm giving you this chance, a chance at a redemption, of sorts. After the men you've killed, there is nothing I can do to save your unlife, but perhaps you can still find favor with the Lord... Undercover.\"", "action_results": [{"action": "Hear him out.", "result": "His story is... Interesting, to say the least. So Simon Kurschner is the Professor's actual name.\n\n\"So what do you want from me?\" You ask, uncertain of yourself. Who is my main enemy? The Professor or the Church? Both? Is the Professor even still alive?\n\nThe Father nods, \"We need you to lead us to the other Creations, so we can finish them once and for all. You are the last of the Vampires, and you can most likely help our charge on the Wolves. As I said, the Creations are very powerful. Having one on our side could be a huge help.\"\n\nYou smirk back at him, \"Why though? It's not like you've given me any sort of ambition to help you wackos.\"\n\n\"Well, I thought life was good objective.\" He shrugs, bringing his hand close to the opening of his robes.\n\n\"You think I'd sell out my fellow Creations just for myself?\"\n\n\"I'd be surprised if you cared for them-- you don't even remember them! You have no connection to this world anymore.\" He grimaces, taking a knobby finger and waving it at your chest. \"The only thing that may be left is your heart, and even that is subject to debate. Will you side with us, the humans, or die here. The choice is yours. Light and Darkness, that is your only option here!\"\n\n\nLight and Darkness, but is it really that simple?", "action_results": [{"action": "Redeem yourself in the eyes of God.", "result": "\"Very good.\" The old man grins, \"Your training shall commence soon enough. Now, you will be fed every once in a while, we have some animals out back that you can feast from, if you want. But you certainly won't be getting human blood, haha.\"\n\nRegardless of your reasons for accepting the devil's bargain, you can't help but find him horribly irritating currently. You sigh, realizing that the only thing you can look forward to this week is the blandly colored room and the sneering priest. \"Goodbye, then, Vampire of the Light.\"\n\nThe priest happily shuffles away into the clinking gear-based doors, and your mind wanders...\n\nDays pass, and you'd be lying if you said that you weren't surprised that the withered old geezer wasn't mentoring you himself. Of course, this makes sense-- the rest of the Church would probably lynch him if he declared you 'AOK', but it's more surprising how spry the man is. He spends the next few days teaching you boring protocol, not-as-boring use of standardized C.E. weaponry, and a quick, refined crash-course through some-sort of martial art. Surprisingly, he doesn't bother you with the gospel of the Zealots, but you're too busy working on yourself in order to reflect on that.\n\nWithin a week, he manages to transform you into what he thinks is a Creation killing machine. And it's then when he reveals the plan you were already somewhat familiar with. \"It is necessary that we raid the Wolf hideout, and completely eliminate the Wolf threat once and for all, when they least expect it. We have found their coordinates, finally,\" he hands you a tablet, showing a mapping of the surrounding desert, \"And can now make sure they can no longer harm themselves or anyone else anymore. So, Vampire-Of-Light, do you think you're ready to take on the Demons, as is your holy mission?\"\n\n\"Sir, yes sir!\"\n\nHe grins, then outfits you with standard Zealot equipment; armor, rifle, and various gadgets used for communication.\n\n\"Now just wait here while I get the rest of the Zealots ready. Tonight, you will banish the evil in our own backyards! Godspeed, soldier.\" With that, he leaves, finally leaving you alone.\n\nAh, the open air and the cold night sky. Beautiful in many ways, and-- wait, I'm outside! I can run away from this place! I can't believe they're letting me out unsupervised like this...", "action_results": [{"action": "Run away, you must inform your brethren of the Church's plans before you're too late!", "result": "You slowly begin making your way up and to the right-side, in the direction of the Wolves' actual hideout. What starts off as a slow walk turns into full-blown running on the cool desert sand. You breathe in the air, and then out. Despite the recent turn of events, you feel absolutely wonderful; though that feeling is soon changed into a horrific one. You suddenly sense your body being pulled back by some sort of shocking force, and then your bleary eyes only make out another cool-blue room.\n\nDifference is, there are several others in the room, all in masks. You try to move, but your entire body seems to be restrained by a cold metal, and your face is covered by some sort of hazy mask and...\n\nIs that a scalpel!?!?\n\nThe Father's voice rings out, \"See, the funny thing is, you never really had a choice in helping us. In the end, God always opens up ways for his sheep to wander, and always closes the gates on the bad wolves. I had plans to make use of you regardless of whether you actually meant repentance.\"\n\nThough it's a slow and dull process, you feel your life-energy slowly being sucked out. Even if you could probably survive much longer, you slowly realize that survival is what they want, so they could continue examining your body and organs for whatever purposes and rituals the Zealots want. Soon, your spirit leaves your body, and you feel yourself die on the hospital bed.\n\n\nYou have been killed by the hands of the Church.", "action_results": []}, {"action": "Proceed with the facade of a loyal Zealot, only to turn when the time is right.", "result": "You remain compliant, for now. You think about everything you've been through so far-- not much, though it's felt like a lot. The main 'highlights' was Kelso, where the hell is that bastard? and the constant torment you've endured from Father Tomas. At least, regardless of today's outcome, you'll have you revenge against the Church, at least.\n\nYou turn your head to find at least fifty armored Zealots in formation, marching along with their flashing chests and a surprisingly optimistic attitude, as described by their songs. \"Soldier, what are you doing out here so early? What's your name and rank?\"\n\nCrap, I just got called out, \"Err, Father Tomas knows. Where is he? I thought he was, uh, coming.\"\n\n\"Nope, he's staying back for morale reasons.\" The person who called for you gets out of the formation, and runs to catch up with you. The man, especially shown through the armor, is huge-- probably the biggest Zealot you've seen thus far. His voice is pretty heavy, but he sounds surprisingly intelligent for one of his size, \"Wait, are you new? You look young...\"\n\n\"You could say that.\"\n\nHe laughs, misunderstanding, \"Right then, I'm Chief. If you need anything just ask, young one. This'll be much easier than you think. We'll steam-roll the hell out of those Demons with our newly refined weapons.\"\n\n\"Oh?\"\n\n\"All silver, baby. It cost a lot to build, and we're the only Zealots aside from Karat- you know, they guy who persists to wear white armor,\" Who or what the hell is he talking about? \"Who have this new design. The Father says this stops them from healing, so we have no chance of losing. Don't be scared, now. I'll get you a seat in formation, give me a sec.\"\n\nYour stupid grin at the cockiness of the head-Zealot is thankfully concealed by your helmet. He stuffs you in his position-- the front line, while he leads out in front. Just as well, you think, I don't think this will be as easy as he says, so my being in the front should help. I think.\n\nThe march is treacherously long, and if you're admitting to that then you can't imagine how the Zealots are with all the excess armor. Thankfully, your so-called curse comes with its blessings, and if you were to add it all up, you'd probably count the curses in the blessing pile. Everything would be good if only the damn Church wasn't involved.\n\nEventually, you reach the end of of the journey, and you find nothing but more desert. \"Uh, Chief? Where is the Wolf hideout?\"\n\n\"Literally, underground.\" He laughs. He takes out his rifle and screws off the tusk, and from his armor he withdraws a crafty little shovel-head. \"Samuel, Zadok, do the same. We need to open this up quickly.\"\n\nTwo of the larger Zealots come up from behind you to help shovel the certain mound of sand, and while you find it  amusing at first, it soon becomes apparent that this is the place when you hear a metal clanging sound.\n\n\"This is it!\"\n\nYou look into the ditch, and find an odd metal disk embedded into a round concrete tube, large in diameter. Maybe a well?\n\nTe man labeled 'Zadok' changes his rifle's end again, back to the tusks, then hollers for everybody to get back. Everybody complies.\n\nWith a large grunt, he prepares his rifle to shoot at the plate, then a large sonic-boom erupts, and the green lightning sets the plate to turn red, in heat. Samuel sends a heavy kick, which is just enough to send the disk out of its place, opening up the well.\n\n\"For God's glory!\" Chief yells, and they repeat after him with enthusiasm.\n\n\"FOR GOD'S GLORY!\"\n\nThe three head-Zealots jump down the well, landing with  a loud cracking sound.\n\nImpatient at this point, you decide to reveal your true, brutal colors while the Zealots line up for going down the well. Slowly, you wait your turn to follow the first half down the well, but as your turn is right about to come up, you grab the man in front of you, and turn him over and drop-- having him fall head-first into the concrete below. The other Zealots stop their chanting and look at you, confused.\n\nYou take advantage of their shock by ramming the silver tusks of your rifle through the man behind you, and following through the bum rush, pushing over several more people. You let leave of your gun,  and begin angrily clawing and punching any Zealot in your way, easily piercing their various armors. Occasionally, a larger one would manage to grab you during your rampage, but the built-up rage inside of you gives you the ability to flip them from over you, then continue your massacre. The state of chaos and cluttered set of armors running frantically around, trying to hit you with their weapons make it all the better, until, from what you can make out with blurred eyesight, comes back up from well, only to blast you with his rifle.\n\nWhat happens after that, you cannot tell.\n\n\nYou have been killed by Zealots... But at least you took out about half of them with you!", "action_results": []}, {"action": "Fulfill your duty as a Zealot of God.", "result": "Indeed, you stand in the cold more stalwart than you've ever been, an entire outlook changed. While the Church may have its faults, blaming it for the world's destruction isn't true. It all boils down to the Professor and his deviants, like myself. Unless they wish to repent, then they have no stake in this world.\n\nSuddenly, you begin to hear an odd sort of chant or jingle being sung  from behind you. You turn your head to find at least fifty armored Zealots in formation, marching along with their flashing chests and a surprisingly optimistic attitude, as described by their songs. \"Soldier, what are you doing out here so early? What's your name and rank?\"\n\nCrap, I just got called out, \"Err, Father Tomas knows. Where is he? I thought he was, uh, coming.\"\n\n\"Nope, he's staying back for morale reasons.\" The person who called for you gets out of the formation, and runs to catch up with you. The man, espeically shown through the armor, is huge-- probably the biggest Zealot you've seen thus far. His voice is pretty heavy, but he sounds surprisingly intelligent for one of his size, \"Wait, are you new? You look young...\"\n\n\"You could say that.\"\n\nHe laughs, misunderstanding, \"Right then, I'm Chief. If you need anything just ask young one. This'll be much easier than you think. We'll steam-roll the hell out of those Demons with our newly refined weapons.\"\n\n\"Oh?\"\n\n\"All silver, baby. It cost a lot to build, and we're the only Zealots aside from Karat- you know, they guy who persists to wear white armor,\" Who or what the hell is he talking about? \"Who have this new design. The Father says this stops them from healing, so we have no chance of losing. Don't be scared, now. I'll get you a seat in formation, give me a sec.\"\n\nYour stupid grin at the kindness of the head-Zealot is thankfully concealed by your helmet. He stuffs you in his position-- the front line, while he leads out in front. Just as well, you think, I don't think this will be as easy as he says, so my being in the front should help. I think.\n\nAnd this begins you ascent into God's plan, whatever it may be.\n\nThe march is treacherously long, and if you're admitting to that then you can't imagine how the others are with all the heavy armor. Thankfully, the curse comes with its blessings, and those blessings are obviously a reason why God's plan for you involved this. That, or we're all doomed. You shove that thought away for the moment, though.\n\nEventually, you reach the end of of the journey, and you find nothing but more desert. \"Uh, Chief? Where is the Wolf hideout?\"\n\n\"Literally, underground.\" He laughs. He takes out his rifle and screws off the tusk, and from his armor he withdraws a crafty little shovel-head. \"Samuel, Zadok, do the same. We need to open this up quickly.\"\n\nTwo of the larger Zealots come up from behind you to help shovel the certain mound of sand, and while you find it  amusing at first, it soon becomes apparent that this is the place when you hear a metal clanging sound.\n\n\"This is it!\"\n\nYou look into the ditch, and find an odd metal disk embedded into a round concrete tube, large in diameter. Maybe a well?\n\nTe man labeled 'Zadok' changes his rifle's end again, back to the tusks, then hollers for everybody to get back. Everybody complies.\n\nWith a large grunt, he prepares his rifle to shoot at the plate, then a large sonic-boom erupts, and the green lightning sets the plate to turn red, in heat. Samuel sends a heavy kick, which is just enough to send the disk out of its place, opening up the well.\n\n\"For God's glory!\" Chief yells, and they repeat after him with enthusiasm.\n\n\"FOR GOD'S GLORY!\"\n\nThe big-three Zealots jump in one after each-other, and after that it's a beeline to get into the concrete sewer below. Finally, when it's your turn, you manage to find foot-holds to climb down, rather than just jumping down aimlessly and without stealth. Of course, stealth is thrown out of the window whenever these lovable tools are in the equation. They're still chanting, and the light from their armor is the only thing lighting up the cavern!\n\nYour squadron of fifty or more begins a march through it, still as loud and boisterous as ever. But, suddenly, the mood changes. Something's not right...  Where are the Wolves?\n\nSlowly, as the Zealots move inside the maze of hell, you notice more and more of them disappearing. \"Chief! We're losing men as we speak!\"\n\nThe Chief looks around, his armor working as  a flashlight, \"Huh? But I don't see any of the Wolves?\"\n\nMore and more Zealots disappear, with barely anything but a gasp at best. What the hell is happening?\n\nAfter a small while of Zealots pleading for the Chief to turn back, you get the horrible feeling that you're next...\n\n\n\"Nobody touches my Creations.\"\n\n\nYou have been killed by an unknown player...", "action_results": []}]}, null, {"action": "\"I won't be your bitch, Tomas.\"", "result": "The wrinkled old man frowns, \"So, you're throwing your one chance for redemption?\"\n\n\"I don't need redemption from the likes of you.\" You seethe back, channeling your undead cajones. \"You want me to fight for you, but you're too worried about the decision that you wouldn't let any of the other Zealots.\n\n\"I won't tell you your wrong, but I will tell you that you're a fool to choose a unredeemed death over a redeemed life. But I cannot pretend to comprehend the demons.\"\n\nYou tilt your head, \"You don't really believe I'm a demon, do you?\" He continues to frown. \"This... You wouldn't give me any sort of chance if you actually backed your beliefs. By now you must be just fear-mongering. But why?\"\n\n\"Humanity needs a common-enemy, something to band us together to fight and destroy. That, and only that, will keep us alive.\"\n\nThe priest turns his back to you, and begins to slowly creep away. You struggle, and you yell out to try and kill him, to get out of this room. Yet, the UV-lights seem to hold you down, and when you realize what is happening. Flames emit from the bottom of your chair and begin to lick at your skin...\n\n\nYou have been killed by the hands of the Church.", "action_results": []}]}, null]}, {"action": "Reply sarcastically.", "result": "\"A heathen, no doubt.\" You manage to spit out, angrily.\n\n\"Not a heathen, an abomination. There is a difference.\" The voice is male, and older. \"But I don't wish to quell your anger, as you are no doubt misguided. Worry not, we shall end your suffering.\"\n\n\"Thanks, I wouldn't want to be a burden.\"\n\nHe laughs. \"You are a funny devil alright, but one who deserves an explanation, if he wants one.\" Gears grind, causing your ears to sting while a shaft opens up in the blue room. An old man in a priestly garb and a skullcap comes out, an inviting though intimidating aura around him. \"Do you wish to know why you're here? What the Church's mission is?\"\n\nYou stare at the man. \"What's the point if you're just going to kill me right after?\"\n\n\"Us antagonists like our monologs, do we not? You'd know, for I am only part of the lesser evil. So, if you please, allow me to explain why the verdict is so grim for one with such oratory abilities, like yourself.\"\n\nYou nod to the bizarre old man, \"Sure... But not before you tell me where my mentor is.\"\n\n\"Hmm?\"\n\n\"Kelso.\"\n\n\"Doesn't ring any bells. Can we go on?\" He says, looking at his watch.\n\nHe's not even wearing a watch! You sigh, \"You really want to tell me the story then, huh.\"\n\nThe pruned holy-man beams, \"Why yes!\"\n\nA long pause erupts. And you wait for the priest to tell you. He begins to cough, and cough... By now you're just irked, stuck in a room with a senile wackjob. It's surprising that he's your interrogator. \"So.\"\n\n\"Ah yes. On the first day,\" His large dark eyes twinkle, \"of the new Era, the world began to sink. Horrible diseases and militant radicals swept through different parts of the globe. Coincidentally, this all began after marriage became void and immorality was embraced.\" He shakes his head, \"Regardless, Simon Kurschner created his Program, with the government's support, and using the dead and dying as test subjects, he claimed that he wished to stop disease and create perfect soldiers as well. At the time, it sounded ludicrous; like a comic book. But the world governments were desperate, and he received the funding. The second day was much darker, with the disease spreading rapidly before Kurschner's lab was even finished. By the time it was done, he petitioned for less regulation, and that's when it began. There would be no stopping what he began to create. Worse than the viruses which wiped out humanity; a God's flood. This... you, are different, unnatural. Third day came and Simon sent a crew of his deathless zombies, which survived the disease under his care, to deal with military conflicts all over the world. The fact that it succeeded so well was a curse, as he gained more support. By the 4rth day he had thousands of Creations under his disposal. And who didn't trust him? The religious, the so-called 'supersticious' Church.\" He spits, getting emotional during his obviously summarized tale, \"5th Day, his Creations began fighting against the world, rather than with them against evil. One experiment could take on hundreds of regular soldiers alone, and so they laid waste, all while Simon was living the good life. Then, what do you know, the diseases evolved, went airborn, killed everyone but the faithful, those who stayed in the First Chapel. The Earth was dying, as God didn't want it to continue as it did, and only two groups survived; the Zealots, and the Creations. The next day involved war. W wanting to e slowly began building society back up, getting stronger technology and a bigger community. But it was not enough, and the Creations spread us weak and thin. But we're growing, and the Creations are now on the run, no doubt split between wanting to kill us or the Professor, who got them into this mess. Everything with them is 'kill', for they are demon-spawn.''\n\nHe notices your eyese rolling and then bends down to your level, \"Look at you, boy, blood on his lips and unrelenting anger. This is mercy, to end your cursed life. As now, on the 7th day, we shall put all of the cursed to rest. They may resist, but we will go out of our way to end them.\"\n\nYou take a deep breath, taking all of this in. There isn't that much to say, and you realize how much fragments you still don't know. There has to be more to this, though you're not sure why...\n\n\"Dramatic, no?\" He nods, continuing. \"Which makes me wonder where you fit into all of this. You don't have a name do you?\"\n\n\"Uh, no, I can't remember anything from before my awakening.\"\n\nThe Father frowned, \"Hmm, you must have been one of the last experiments if you're so young. Very well then, good night, I'm afraid. May God have mercy on your soul...\" He turns to leave.\n\n\"Wait, you're killing me after all that?!? Come back here! I'm sentient, I'm human, just like YOU!\" You yell, struggling at the immobile chair.\n\nHe doesn't answer. A quick, firey death unexpectedly follows, your seat spewing out bursts of flame, charring through your body and burning your soul to a crisp. Red, then all black.\n\n\nYou have died by the hands of the Church.", "action_results": []}]}, {"action": "Continue on, yourself.", "result": "You lower your voice, \"I... not sure. We're in some sort of house. Lots of sand.\"\n\nNo reply. You click it off.\n\nKelso nods in seeming approval. \"It'll do. Let's just hope they underestimate one Creation and send only a couple soldiers. They are tasked to deal with the unknown. I got lucky with 'Sebastian'; the foolish Zealot wandered out alone.\"\n\n---\n\nYour mentor and youself make your way to a particularly large sand-dune near the house, watching for incoming Zealots from the city ahead.\n\nIt doesn't too long-- after several minutes you begin to notice flashing armors marching in the moonlight. Your house is a surprisingly straight line to the city, and you notice some lights, formed in clusters, moving straight in your direction. Others seem to be coming in on a flank, moving to the left and right of the city before circling in, near your location. None are too close though, which gives time for Kelso to count them all.\n\n\"Five groups of five in all, with the Church having only a slight notion where we are and us having the element of surprise.\"\n\n\"You think that's good odds? From what it seems, they likely no more about what we can do then what we know they can.\"\n\n\"Not we, you. I fought Zealots before the facility was destroyed, you know. Even if they've grown considerably, they're still the fear-mongering, symbolic fools as ever. With enough force their armor can be clawed through, only thing you have to worry about is silver and their lightning rifles.\"\n\n\"Sounds fun.\" You chuckles out nervously, \"Silver bullets and lightning rifles?\"\n\n\"Ah yes, silver is specifically harmful to us, for whatever reason. It is very pure... and the only thing that will stop us from regenerating, thankfully though, I don't think they've caught on to that just yet. The shock-troops they send in are equipped with monstrous bayonets that shoot out streams of electrons at high velocity, which are scarily painful...\" He notices your frown, and smiles in return, \"But it's healable. And I think we can do it.\"\n\nYou nod, \"Not if their flanks succeeds. We need to either split up and fight the ones coming on the side or take the clusters on together.\"\n\n\"No question, we should fight together. Splitting up may make this go faster and more efficiently, but it's dangerous enough that it won't be worth it. Together, we can capture one of them as well as efficiently annihilate the groups one by one.\"\n\nYou nod back, assured. Kelso may retain information, but he's never lied to you. You think.\n\nThis brings your mind back to the incoming horde of Zealots,  which are less than a mile away by now, marching tirelessly, not exactly in your direction, but close enough...\n\n\"So, who do you think we should take on first?\"", "action_results": [{"action": "Zealots on a side.", "result": "\"Let's start on a side and move on from there. We can't let their flank be affective.\" Your mentor nods. \"There was a reason why I saved you, even if I didn't realize it at the time.\"\n\n\"Which is...?\"\n\n\"You're smart.\"\n\nYou'd blush if could, you like compliments, \"No, the reason why you got me in the first place.\"\n\n\"You'll find out at some point.\"\n\nYou both laugh. Kelso drops information every once in a while, and at some point you want to just have several hours with him to discuss everything. Was the world always like this? What happened to it? What is my purpose? And on and on.\n\nBy now the collection of lights are nearing, so you stop chatting with your master and turn your attention to them. Keeping your head close to the ground and sneaking to the right, you prepare to overtake the group of five on that side. Your mind flashes back to your training in the training you did with Kelso in the dunes. You try your best to channel your anger while you run, Kelso behind, at the Zealots.\n\nWhy should I hate the Church? Your mind answers. Because they hate me for what I am. The man called Sebastian called me a 'demon'; I'm not that. I know I'm not that. But they will crucify me if they can. And I won't let them do that to myself or Kelso.\n\nWith your mind settled on some sort rage, you vent it with your sprinting, reaching the Zealots quick enough. They're big people, the C.E. Soldiers. Stygian black metal overlays their entire bodies, with an obvious group leader with a different helmet (with horns, like a medieval knight's would have.) The rest have a simplistic SWAT-team-like helmet with a visor. The most notable part of their ensemble is their heavily tusked rifles, which take up both of their arms, if only to carry the heavy block of metal. You assume that that's the thing that Kelso mentioned; the lightning bayonets. 'That, and their lit cross on the chest, flashing on and off. Thankfully, they don't seem to notice you, yet. Their heavy metal probably restricts them of that.\n\nYou pay little attention to where Kelso is, and you angrily lash out on the leader, leaping from over eight meters away from the ground. While in the air, you let your claws grow out and you come onto the huge black being's chest, and sink your claws into him, through the weak parts of his armor. Wet, sticky blood pours out, and you messily continue to clutch onto him while he tries to shoot you off with his tusked-bayonet. He manages to shoot up wards once or twice before slumping to the ground, the Other Zealots probably pissing their pants at this point. You roar at them, jumping off the corps of their leader and sending a heavy-fisted slash at a close one that is unbashfully trying to use hiw walkie-talkie. The hand you send clunks off of his helmet, but the heavy crunch you feel from it obviously means you broke his neck.\n\nWhile you were busy with two, Kelso (still unseen) has done fine work with the remaining three, his body half-transformed into something... Animalistic. With hairy, muscular arms and sharp teeth he overpowers them easily, ripping heads off at insane speeds, to the point that you're convinced that you imagined part of it. After several lightning flashes from the last one, Kelso's new body soaks up the energy from it and grabs the Zealot, throwing him to the floor. Now, all that remains are you and your mentor. You hungrily sink your teeth into a nearby combatant, reinvigorating yourself. Kelso morphs back, seeming tired, and takes a helping from one of them. After only ten seconds, he grabs you to stop with him.\n\n\"That's one group down. There are three more groups to annihilate, two to the left (what used to be the middle) and the third which is standing back, way over to the left. I'll assume we're moving on to the middle?\"", "action_results": [{"action": "Continue to the middle.", "result": "\"Indeed, the middle-men are next.\"\n\nTwo groups of hulking Zealots stand between you and the other. They know you're there, and the element of surprise isn't yours anymore. Worse yet, Kelso seems to have used up whatever the hell that transformation was. Still, you're confident that Kelso and you can tackle on the fifteen Zealots left over,\n\nYou see them aiming their blockish weapons at you, and charge. Two leaders... You look to Kelso, and he nods. You take one, and he takes the other.\n\nAs they move forward with their tusks, streaks of bright green at you. You quickly move to the side, allowing for some to take mercy and miss, but one or two manage to land on your armor, causing it to heat up...\n\nKelso manages to dodge every single one shot at him, and runs up ahead of you to disarm the Zealots shooting at you. While your metallic armor sizzles, you do your best to throw it off you and follow-up with Kelso before they reload and shoot again. Kelso jumps into the air, swinging his foot down on one of the head-Zealots-head. It doesn't take him out, but it stuns  him long enough for Kelso to throw him at the other line of Zealots, and proceed to restlessly break their weapons by punching it. The Zealots try to fight him, but your mentor doesn't give up.\n\nMeanwhile, you quickly sweep the other Head's feet from under him during the confusion of Kelso's utter... coolness and fluidity in combat.  You stomp your sneakers on it's neck; the crack is all you needed to hear.\n\nMore bright streaks. You see the remaining six Soldiers trying to surround him and put him down, not paying as much attention to you. In return for their disrespect, you bring both of your hands to your sides, and begin a large tackle at the horde surrounding your master. Your rage-fueled push causes you to bleed (you're slamming your arms onto cold metal, remember) but pushes them all on top of eachother, all scarmbling to get up.\n\nKelso manages to get out of the huddle of Zealots, and picks up one of the bayonets, and begins spiking the clunky radicals. More, deliciously red blood squirts out, and you follow suit by taking your own bayonet. Now, only one group left.\n\nFive fearful Zealots pitifully trying to snipe at both of you. But it's obvious who will win this fight, in your eyes.", "action_results": [{"action": "Finish off the bastards on the left.", "result": "You continue to finish the ones trying to attack you. It is a quick fight, considering. Kelso rushes ahead, jumping up and using the butt of his new bayonet to whack the head-Zealot of this group over the head, not snapping his eck but at the very least knocking him out.\n\nWith blood-lust, you manage to bring up the hulking weapons to shoot lightning at one the group at point-blank, causing him to scream as his own armor boiled him. The others, no doubt bewildered by many things at the current moment, try their best to survive in various ways.\n\nOne continues struggling, actually managing to spear Kelso and shoot at the same time, only to find Kelso laugh, bring his arms back and snap the man's neck before getting out of the tusks.\n\nOne calls out to his god. In turn you gutted him with your rifle, piercing his armor like a can-opener.\n\nAnd one from the other side of the battle-field, that you obviously didn't kill correctly, gets up to flee back to the city. Even he didn't get a break. Kelso, with uncanny familiarity with the rifle, shoots him in the back. The flashing Zealot slumps over, dead.\n\nThe fight ends there, and Kelso puts his hand on your back as you walk to the unconscious head-Zealot of the Left-group.\n\n\"So, what do we do with him?\" You ask, warily, \"The Church will probably send more of it's operatives to subdue us.\"\n\n\"Doubt it. The head-honchos in the Church are probably terrified right now. More Creations in addition to 'The Wolves' are definitely not what they wanted. Still, you're right. We need to find a new place, but only after we find out where the Wolves are, and subdue them.\"\n\n\"You still think they know where the Professor is?\"\n\nHe looks at you, pondering, \"Unsure. If they do, then we'll have to fight them. Which is doable, with your newfound talents.\" He points to bloody undergarments, \"But if they hate the Professor as much as we do then we can join forces. Well, you might. I might have to leave soon.\"\n\nYou frown. \"Why?\"\n\n\"Ha, don't worry kid. I might not have to, but if I do I'll make sure you're ready to fend for your self.\"", "action_results": [{"action": "Loot the bodies and proceed to interrogate the Zealot.", "result": "Shrugging the thought of not having Kelso around, you collect the armors of the Zealots, turning the flash off and equipping them. They won't save you from everything, but they will certainly make you physical attacks stronger, if only because they're reinforced by cold metal. You wear everything but the helmet, since you like having your vision unrestricted. Kelso does similarly, putting on the armor, leggings, and boots. You also decide to take one of the undamaged rifles; good weapons, and more effective on humans than on Creations, ironically.\n\nAfter the slight diversion, you bring your attention to the rousing Zealot. Kelso points him out to you to deal with. With a cruel smile, you walk over to him, bringing your gauntleted hand to his armored helmet, and begin to squeeze.\n\nThat wakes him up.\n\nHe cries in agony, as his helmet soon becomes a 'custom-fit' of sorts. With your one hand, you pick him up by his face, and just hold him in mid-air. \"Kelso, are we just interrogating him here or somewhere else?\"\n\n\"Here's fine.\"\n\nYou shrug, and drop the Zealot on the floor. He groans in pain, bringing hands to his face to try to take off his helmet; he couldn't do it. \"Tell you what, if I take off your new skullcap if you tell me where the other Creations are.\"\n\nHe looks up pitifully, nodding. Carefully... You peel off the horned helmet from his visage.\n\n\"You killed Sebastian, didn't you!\" Is the first thing that erupts from his lips. That, and some spit. You back hand him, bloodying his face further and causing him to fall back onto the sand.\n\n\"Location, now. Or you end up having a worse fate than Sebastian.\"\n\nThe dark haired Zealots looks at you with menacing eyes, \"I don't consort with demons. I will die with honor.\"\n\n\"That's not what you were saying when your face was in a can.\" You laugh, and Kelso gets on one knee, beckoning closer to him.\n\n\"You can become one of us, if you like. Be one of the damned, and survive the hell that is God's world. Just lead us to where the so-called 'Wolves' are.\"\n\n\"I won't sell out that easy, demon. Sebastian was a brother before you bastards killed him!\" The agitated cripple would be somewhat intimidating if he wasn't in such a pathetic situation.\n\n\"Then it's time you became family.\" Kelso looks at you. \"Try ghouling him.\"\n\nYour eyes widen, \"What do you mean, 'ghoul'?\"\n\n\"Drink from him until he has only the minimum amount of blood he needs. He'll become one of us. Well, half. He'll also follow our commands in that state. For the first couple of days. An eternal slave.\" Your mentor grins. The Zealot, however, is horrified.\n\n\"No, don't! Don't drink from me, I'll get you to the Wolves, I promise! I'll even tell you when the Church is to attack their base. Everything, just don't turn me into one of you! Stop!\"\n\n\nOh, so very tempting. But kind of... Evil, is it? Is there even a line anymore, after what I've done? Kindness will only hurt you at this point, and a side-kick if Kelso ever leaves is tempting...", "action_results": [{"action": "Ghoul him.", "result": "Curious, and perhaps a wee bit thirsty, you motion to the Zealot. \"What's your name?\"\n\n\"David.\" He spits, \"Why?\"\n\n\"Because your new name is... Slave.\" His eyes widen in horror as you sink your teeth into his soft and milky flesh, this time getting it on the artery. The blood squirts down your throat, and the high that you get is unimaginable. Sweet and slightly sour blood, like apple-juice. The euphoria you get is uplifting, and you feel... Happy. Power surges through your veins, and your stomach does happy somersaults as it absorbs all the nutrients from the Zealot's warrior-blood, and you continue chewing on his neck, trying to get as much as you can from this man before he falters. Just sublime...\n\n\"Goddammit kid, your mother must have been some sort of an abuser.\" Kelso says with a chuckle, pulling you away. \"But I think that' enough drinking, your new slave is deathly pale, but still breathing, albeit very slowly and inconsistently-- a sign that you've drunk just enough.\" He points out, \"But hats off to you kid, you've got yourself a ghoul.\"\n\nYou both stand, waiting for your slave to wake. The pale Zealot opens his eyes back up, a glossy look to them. He doesn't speak, but instead lazily lets saliva and a red substance that likely is blood ooze out from the side of his mouth.\n\nNervously, you command him, \"Lead us to the Wolves hideout.\" He lazily tries to get up, only to fall back down again. \"Now.\" Firm. He gets up, straight this time. With uncoordinated steps he begins to march, stumbling through the sand and skin beginning to redden from the sun. You shrug, and follow your new ghoul. By the time you pass the City the trek is already nearly over. You take another left from there, then a turn to the right... And soon Kelso directs you and your new slave to stop.\n\n\"This,\" he begins, \"is where I take my leave.\"\n\n\"What?\" You exclaim, \"Why now? Didn't you say that the other Creations might be on the Professor's side?\"\n\nKelso tilts his head to the side, \"The longer I think about it, the less it makes sense. But I've been worried about something, and I'm nigh certain I'm correct on this.\"\n\n\"What do you mean?\"\n\nYour mentor walks to your ghoul, tugging at his armor's sleeve to get attention, \"You, David, what does the Church know about Simon Kurschner?\" Who?\n\nThe slave replies in monotone, \"Can't be found or traced. Not among Creations, unknown if even still alive.\"\n\nYou raise an eyebrow, \"Who's this Kurschner?\"\n\n\"The Professor.\" Comes the reply from Kelso.\n\n\"But I thought our plan was to see if the other Creations know where the Professor is? Which could mean that they still serve him. Or not.\"\n\n\"Exactly. If the Church has no idea of his whereabouts, then it's unlikely the Wolves have something definite either. Even though the Wolf and I have had our  arguments, I still trust him enough to give you vacancy while I search for the Professor.\"\n\n\"So where are you going?\"\n\n\"Anywhere. The world left is just a desert, and traveling by night only will waste time, which is why we have t split for the moment.\" Kelso frowns, and holds out his hand to shake.\n\nYou firmly grasp it, \"Then stay safe, Master. I trust you will return soon?\"\n\nHe stares at you blankly, \"I have no idea how long it will take. But I believe in you just as well. You can make it on your own, especially with how you proved yourself today. Strong decision making and vast knowledge on how survival works have made you to what you are. There is very little that I can teach you that I even know. You shall grow past what I can even guess you can do.\" He begins to let go of the hand shake, but you hold on.\n\nTightly. \"There's one thing that you still haven't told me.\"\n\n\"And what's that?\"\n\n\"How the World came to this pitiful state.\"", "action_results": [{"action": "The Wolf Underground", "result": "Your mentor, the Ghoul, and yourself make your way through the remnants of the past world. Suddenly, it all makes sense to you. The world went to hell, and it was the Professor's abuse of his Creations that furthered it. Now, the Church hunts you all down for no reason other than to to give hope to 'real' humans. It's despicable, but it's the world you're in right now.\n\nThe hot sun beats down upon you, while your slave suddenly comes to a halt. \"This is it.\" He blandly calls out, reaching down to the sandy flooring, and makes hand motions as to move some of the sand away.\n\nYou turn to wish your master a farewell, but he is already gone. Only a hazy version of him can be seen through squinting in the distance. So, it's just me and my Ghoul. Let's just hope it doesn't get bloody...\n\nYou follow David's beckoning, and bend down to see what he was unclearing. As your slave digs, more and more sand  seems to pile in. \"What are we looking for?\"\n\n\"They're underground, sir.\"\n\nWith a nod, you decide to help out with the digging. As you lay your hands on the sand, you thank fortune that you hadn't done this in the middle of the day, rather than just an hour or so after sun-rise. The sand would no doubt have burnt your fingers otherwise! Even though you and your ghoul are digging barehanded, it doesn't take too much time before you begin to feel the sand getting thicker, more doughy. With quick powerful stroke, you continue ripping through the sand, throwing it out of your radius, soon creating a little pit, low enough that you could stand up in it. After clawing at the earth with your servant for a while, you accidentally scratch at something... Hard, metallic. Underneath the sand lay a metal disk, with evenly-spaced holes around it's edge and the middle. Even as it is right now, it's fairly obvious that the disk is heavily embedded into the ground, and prying it out would no doubt prove to be a challenge. At first, you try just digging around and under it, but your efforts seemed to have been in vain; the plate appeared to be a part of both the earth and some sort of brick-well that goes much further down.\n\n\"You sure this is the place? You ask, making sure that this was the opening to the Wolf Stronghold. It'd make sense, as this is extremely safe from the Zealots, considering.\n\n\"Yes.\" Comes the monotone reply, \"The few remaining GPS satellites pin-pointed this exact spot. We caught several monsters disappearing from under the sand here.\"\n\n\nNow, how should we try to open this?", "action_results": [{"action": "Try to pry it open. The Ghoul's combined strength with yours should be more than enough.", "result": "\"C'mon Slave, you and I together can probably take this out of it's place.\" As usual, he complies. With a flick of your wrist, you bring out one of your signature claws, and draw your index finger along the bottom edge of the metal plate, taking as much sand out of it as possible. After thousands of sand pellets fall out, you both position yourselves opposite one another, and firmly grasp the end of the disc, clawing in anywhere possible to gain enough leverage to pull it upwards, out of it's fixed place. David and yourself glance at each other, and meet at the red-eyes.\n\n1, 2, 3!\n\nForming an odd sort of mental connection with your ghoul, you both bring all the strength you can muster to pull the rough, grainy plate out of the stop of the well. As you pull at the disc, you can feel yourself pulling your muscles as well, the first feeling you've had of strain for a while. This would be a good thing any other time (sort of), but now it's just not a good time to go back to human-like limitations. Your ghoul on the other hand, glumly shows little exertion, even though he seems to be attempting to carry out your will. \"David,\" You encourage, using his actual name this time, \"Put your back into it. All your body, we can do this!\"\n\nYou continue trying to pry open the hatch, but it just doesn't budge... Until a sudden movement. Feeling it shift slightly to the side, your ghoul instinctively follow you there, and you both pull at it in a close space, together. After exerting yourself greatly, you manage to take it out of it's wedge in a very sudden throw, flinging it out of your own pit with a clatter. You shrug, and smile at your Ghoul, and then proceed to look down the brick-well...\n\nIt's dark, for one thing, but you can barely make out the sound of feet pattering on cold concrete. Overcome with nervousness, you loudly blurt out, \"We come in peace!\"\n\nSeveral dark figures appear from the bottom of the well, after several glances upwards at you and whispering, one of them waves you down. Shivering, you jump down the well, using the cylindrical bricks surrounding you to position yourself as to not fall on them. Still, you fall with a heavy thud. Yeah, I'm gonna need new sneakers.\n\nUnlike yourself, David just goes down it normally, using the short metal bars protruding one of the sides, climbing downwards. The dark figures eye you carefully, taking a while to speak. One with dark gray hair and scruffy facial hair as well as a slouching hunchback of a surprisingly muscular body, points at your armor, \"If you're a Zealot, I'd turn back right now.\"\n\nHis voice isn't too threatening, but his body language and thick-eyebrows suggest otherwise. He's clad in tight cloth shirt and pants, bulging with muscles, and is surrounded in an intimidating aura. The other one is completely cloaked, though watches your Ghoul with suspicion. \"I'm not of the Church,\" you start, trying to make a good first impression, \"and neither is he. Not anymore at least.\"\n\n\"Then what are you?\" The gruff man calls out, his eyes narrowing.\n\n\"Well, I'm glad you asked. I'm a... A Creation, just like you. This is my Ghou--\" By the time you uttered the word, 'Creation' he had already put you in a headlock. The cloaked one has already put your ghoul to sleep, though hopefully not forever...\n\nThe man continues, \"What do you want from us, fangs-boy? I thought the rest of your clan died.\"\n\nClans? \"No!\" You exclaim, struggling out of his hold. You actually manage to surprise him with your strength and are able to push him off of you. \"I honestly have no idea what you're talking about. But you're part of the Wolves, right? My associate and I want to join your strong hold.\"\n\nHe spits back at you, \"We don't need any joiners.\"\n\n\"Why not?\" You argue, your body tensing. \"The Zealots are planning to raid this place soon, and I figure you could use as much help as possible.\"\n\nThe old man growls back you, \"What are you, some sort of message-boy for the Professor?\" Well, at least that means they aren't working for him. Probably. \"The Church means no harm to us at this point. It'd be stupid for them to attack us. If you're trying to make a powerful group do something out of desperation, then oh boy, have you come to a bad place, vampy. I'd go back to the sun, where the pain is relatively quick.\" He cracks his knuckles. If you weren't so confident in your abilities, you might have been intimidated by this Neanderthal.\n\n\"Then perhaps you should ask my Ghoul, David. He was a Zealot before I brought him to the darkness.\" You point at the slumped body on the floor.\n\n\"He's dead now, too late.\" The brute says with a cruel grin, \"Snapped his neck, Ragnor did.\"\n\nYou laugh, \"I don't think he'd die from that.\" You take several steps toward your slave, waving the cloaked man aside, you grab David by the cuff of his armor and pick him up, then bring your hand to his neck and snap it back.\n\nDavid glumly states, \"Hi.\"\n\nThe Wolf grits his teeth, \"Didn't know Vampires could use their powers like that.\"\n\n\"Then you'll be learning a whole lot more during my stay here. What was that you were saying about being the last of my clan?\"\n\nHe smiles back, surprisingly, \"Oh? So you don't know. You're the last of the Vampire Creations, as the rest died in this desert planet. I'm surprised you made it this long since the last Facility was destroyed. But if you don't remember that, then do you even remember your name?\"\n\n\"I'm afraid not. Can you at least tell me yours?\"\n\nThe Wolf laughs, \"Call me Gideon. The cloaked figure on the side is Ragnor, our residential assassin, even if fighting has little place anymore.\" He brings out a hairy, clawed hand to shakes yours.\n\nYou accept it. \"So I'm in?\"\n\n\"I'm still suspicious of your reasons for coming here, and your story about the Zealots needs some checking.\"\n\n\"Is it really that surprising?\"\n\n\"Less that and more that we don't want to fight them.\" What? Seeing your confused expression, Gideon continues, \"Listen here Vampy, I'd rather die and let humanity survive than not. And most of us here are ready for that. If the Zealots come to our turf then we'll wipe them out easy, but we're definitely not going to seek conflict, even if me and the boys can take those choir-boys out in an instant.\"\n\n\"Why not? They want to kill us all?\"\n\nHe shakes his head, his face now grim, \"The Church may believe that we're demons, but they also value the sanctity of life, so I doubt they'd come here. Regardless, they aren't all that wrong about us. The things we've done... The innocents we've massacred in our wake. It doesn't mean that we're bad now, per se, but what we've done is inexcusable. The World has gone to waste, and I'm alright if we don't survive to see it rebuild itself.\n\nYou stand in silence for a little while, realizing that you've joined ranks with the modern equivalent of the hippies.\n\nGideon grins again, \"But don't worry about that now, let's close the lid on top of our well and then introduce you to the rest of the gang.\"", "action_results": [{"action": "The rest of the Wolves.", "result": "\"Ragnor, use those climbing skills of yours and find a way to seal the top of the well better. Can't have one of them dust storms filling the place, nor let any traveler find us like these two rugrats.\" Gideon says, waving for you to follow him and his goofy walking pattern. While the cloaked man begins to climb, you and David follow the hunchback though the stronghold of the wolves. It's a dark tunnel path, but several well-placed torches along the concrete walls give you enough light to make out peculiar drawings on the walls. Not exactly professional artwork or anything, just passionate claw-markings. But still...\n\n“Hey Gideon,” you ask, examining one specifically for it's graphic nature, “What's up with the markings?”\n\nThe hunchback turns his head, but continues moving, “The writing? It's a code language we formed, mixture of all the languages the folks here are familiar with. It's more or less a system of simplified pictures, but you'll be able to read it if you stay here long enough.”\n\n“Can you read this one out to me?” You make sure to stop and point it out; the writing here is different than the rest, even more picturesque than the rest. You can't hope to read it, but you do notice a recurring theme-- a cross and a pentagram. Not only that, but they're much less refined than the others, as if written with anger.\n\n“That one is rather basic, I think I even went over it before. It basically boils to, eh...” He shuffles closer to you, and brings his large eye to the writing, “Peace is what keeps our humanity, for the Professor, cursed be he, uses strife to tear us apart. The cursed Creator wishes that we destroy our brothers in battle so he reaps the reward when it's over.” Gideon tilts his head back and continues forward, “I'd keep this in mind, vampy. I'm not sure why you're here, whether to warn us or to do devil's bidding, but I trust you enough to see you have no idea what's going on, so I'll be giving you the chance to give a little presentation for the guys here. By vote, we'll either agree or not. After that, it's up to you whether you stay or not. Got it?”\n\n“That's all I could have asked for, sir.” You reply, hoping you can prepare them for the Church's onslaught next week. If not, then, well, you and your brothers are done for, regardless of non-violent intentions.\n\nAfter several minutes of treading through the passages of the tunnel, Gideon stops to look up, even if his head doesn't lift that far. You catch up to where he is, noticing what he's looking at: an opening, light.\n\n“That's our hideout.” The Wolf jumps up, grabbing onto some sort of ledge to bring his deformed body up. You watch his body struggle up it, land on solid ground (and then a lot of murmuring from above), then jump up yourself, making it up with ease.\n\nThe hideout is surprisingly low-key for the most powerful beings on the planet, but considering how they're just trying to survive a dimly lit room filled with sleeping bags and animal-carcasses strewn about is to be expected. The ragtag group that are the Wolves are surprising though; a thin man with dark hair, only to have a visible streak of white in the front; a rather hairy, though otherwise attractive female with dirty blonde hair who's around your age (early twenties?); several scruffy teenagers; a dark-skinned, mustached, and barrel-chested man; at least three of obvious Asian descent; and, of course, Gideon, pointing you out to everybody.\n\nMost of them getting out of there bags, they begin gawking at you. You wince as the female eye you with interest, while the men seem to just want to know what you want so they could sleep. You motion to Gideon, and you get close to him and ask, \"These are the Wolves? Not as... Impressive, as I thought they'd be.\"\n\n\"You're not exactly super-hero material either, child. Kinda stock; dark, straight hair and pale skin. Lean physique.\" Noticing you're confusion he just pokes at your chest, \"What matters is what's on the inside. That's where power comes from. Remember that.\" He begins to raise his voice, \"Now, this here is a Vampire. He has no name, so call him whatever you like, but he has some 'opinions' he'd like to share.\n\n\nAs your ghoul struggles up the hatch, you wonder how you want to persuade this group of lazy Wolves to prepare.", "action_results": [{"action": "Describe it with urgency, they need to realize how serious this is.", "result": "It's time to get these sleepy assholes up and running.\n\nYou nod to the crowd as they gather around you, staring with glossy eyes and gaping mouths. \"I'm not going to sugarcoat anything,\" you snarl, starting off with a very loud, though clear voice, \"The Church has plans to raid our little stronghold here by next week.\"\n\nGasps from the Wolves, and men exit their bags. Seems to have worked, for now.\n\n\"And while that may be hard to believe, I'm sure we all know how ruthless the Zealots are. I escaped from the last Facility-- Facility 13, soon before it came tumbling down with C.E. Troopers, who burned down the laboratory. Since then, I have fought many of them, some purposely in order to find my brethren here, to join you as well as to warn you of the incoming second apocalypse. We are blessed Creations, gifted in our own right. We aren't innately evil, like the Church believes. Rather, we are capable of great things, but only if we survive our genocide.\"\n\n\"Then what do you want us to do?\" One of them shouts out, interrupting you.\n\n\"I want you to fight back, and prepare for when they come next week. We need to take the initiative; I know how powerful Creations can be, so I have no doubt in my mind that we can beat them. But only if we get ready.\"\n\n\"Why should we trust you?\" One of the younger ones ask.\n\nYou bare your teeth; fear is a big factor of your speech, \"Because if I'm right then we all die.\" You seethe out, staring intently at your brethren. \"We have three options the way I see it; defend the stronghold and prepare for when they come; try to take control of the city with our combined strengths before the attack; or just get slaughtered when the time comes.\"\n\nMost of the Wolves continue gaping, though Gideon cracks his knuckles.\n\n\"Nice speech, Vampire\" A voice declares, and the red-cloaked figure pops out of the hatch. Ragnor's hood fall down, and the profile is of a middle-aged, balding man. Terribly tall, and lean; powerful and domineering. \"Do you really think we can overtake the Church?\"\n\n\"If we do it carefully, yes.\"\n\nHe smiles, \"Then I like what I'm hearing; I'm in.\" While it's amusing how enthusiastic he is, it also seems to win over more of the Wolves. Perhaps Ragnor is a big figure in the Wolf Underground. \"It is likely to work, too. While some of us are inexperienced, we can easily beat them while their forces are divided into attacking our stronghold. We just need to be clever.\"\n\nGideon continues to grimly frown, \"I think the 'hold the fort' idea will work better. It's safer, and more suited to our abilities.\"\n\n\nIt's odd, but you feel like it's completely your decision. Maybe they just really trust in you?", "action_results": [{"action": "Side with Ragnor on this one.", "result": "\"I... Think Ragnor has a solid point. We can definitely beat the Zealots as long as we have the element of surprise. And if this goes well, then we won't have to worry about extinction ever again.\"\n\nThe blonde vixen looks up to you, as do most of the Wolves. Ragnor laughs, and pats you on the back. Gideon, on the other hand, merely frowns, closes his eyes, and announces, \"Right. Welcome to the family, Vampy. I'd rest, we're all practically nocturnal here anyhow.\n\nThe cloaked Ragnor frowns, \"Are you sure? I was just about to bring out the alcohol...\"\n\n\"No alcohol, Ragnor. We have a long night tonight, lots of training we need to go through. I don't think some of us here have actually fought Zealots.\"\n\nRagnor nods, and the rest of the Wolves shuffle back to their blankets. Gideon shuts the lantern off, and heads down the hatch, disappearing after a thud.\n\nMeanwhile, you find a piece of concrete that is comfortable enough to meditate on, and begin to close your eyes... Only to realize that all the Wolves are watching you for some reason. They're all smiling, and the pretty one in particular seems to watch you in the dark of day. At some point during the night, she leans towards you to whispers, \"Hi, I'm Cecilia.\" She giggles.\n\n\"Uh, hi.\" You whisper back lamely.\n\n\nThe next couple of days fly by, and you manage to go over the histories of your new friends, as well as prepare them for the fight.", "action_results": [{"action": "Assault on Church City.", "result": "The week passes by too soon for for your liking, but you and your compatriots can all agree that you got work done. You spent the week teaching the lesser-experienced Creations how to use their powers in battle, emphasizing team-work and effort. Like Kelso taught you, you passed on the knowledge of the power of emotion-- something you can vouch works in a fight. As the training went on it became rather obvious that in their human form, you can easily take on the strongest werewolf. In the real, bestial for, however, you have to use your wits. For that, you are forever thankful you are on the Wolves' good side. Heck, you're leading them to possible suicide.\n\nOther things you've focused on is appealing to both Gideon and Ragnor, both people whom you know you can trust to some sort of degree.\n\nThe one thing you feel somewhat apologetic about is that you haven't been able to spend as much time with Cecilia as you wanted to, but you manage to remind yourself that if you succeed in taking over the City, you'll have all the time in the world. Perhaps, with enough time, you'll even learn the wolven-lingo, though it's the least of your worries currently.\n\nYou focus on the plan: it's basic espionage, like how a movie would set it out (though you can't remember any one in particular). They send a one-man army to the middle of the battlefield, while they storm the castle-walls. You're confident that you can take care of yourself, especially in the night-time, assuming that's when you're sent in.\n\nThe Creations stand together in a circle, well below the surface, waiting for the the scouting team (Ragnor's group) to tell you whether today is the day. While the Zealots begin their march to the Stronghold, the Creations will quickly get away, and run toward the city, attacking it while half of it's forces are trying to find the nonexistent. Time passes; you do this twice a day, once in the morning and once in the evening, to see if they're preparing for a night-attack or not. You hope it's at night, as the Creations would have an advantage, probably. Additionally, you wouldn't have to worry about sun-tan lotion, the tube Kelso gave you will run out sooner or later. And so you wait, everybody around you waiting in silence.\n\nYou hear the codified knock: Clunk-clunk-clunk.\n\nThat's three times. Today isn't the day after all.\n\nYou go out to train once more, reviewing everything, and then turning back to refill on blood. Gideon gives you a broken plastic-cup with maybe an ounce of his blood. You drink it slowly, savoring the taste. It reinvigorates you, like usual, and you set down to meditate, waiting for nightfall.\n\nThat night...\n\nClunk-clunk-clunk-clunk\n\nThat's 4... Is tonight the night?\n\nRagnor's hooded head pokes out of the hatch, \"Come on, wake everybody. Now!\"\n\nGetting out of your trance, you begin repeatedly whispering, \"Now!\" as you went along, pulling off blankets from the Wolves. As with procedure, the Wolves spring into action, readying their clothes and going down, dividing themselves into the groups. Soon, the only Creations left are you (after ushering everybody out) and Gideon. \"Gideon, are you coming?\" You ask, concerned. You don't want to be late, after all.\n\nThe hunchback stares back at you solemnly, not speaking.\n\n\"Goddammit Gideon, let's go!\" You begin edging out of the room.\n\nHe opens his mouth to speak, then closes it again.\n\n\"Gideon, if you don't come with us, you'll die. We want you with us, so just... Come, man.\"\n\n\"You may have been right about the Church, Vamp. But it doesn't change a thing. The real monster is the Professor, not humanity. Hurting them is hurting us...\"\n\nYou shake your head in disbelief, before angrily waving him off. That hippie won't bring me down.\n\nWith haste, you make it to the well's opening, jumping off the walls to speedily catch up with Ragnor and the others. You were lucky they chose night-time, but that doesn't mean they didn't take advantage of it either. No flashes from miles ahead, just darkness, and maybe some slow movement here or there... But you only notice it if you squint. Crafty of them. \"Ragnor, you see them?\"\n\n\"Yeah.\" He says, calling out from ahead, \"But where's Gideon? He's supposed to be leading his group!\"\n\n\"I don't think that fool is coming.\" You spit out, finally catching up. \"But it's unimportant. David can lead them.\"\n\n\"David isn't exactly a leading-personality.\"\n\n\"He knows what he's doing.\"\n\n\"Which is why he should come with you! He'd be much more useful by you than by us. We're just giving you time. We can have one of the other Wolves lead, but for now you will no doubt need help, and a former Zealot is just perfect.\"", "action_results": [{"action": "Urge for David to head a group.", "result": "\"Ragnor,\" you hold your hand out defiantly, \"I can do just fine alone. I trust in David enough to know that he will aid you a lot in holding the fort than helping me on a stealth mission. Now come on.\"\n\nRagnor grunts in protest, but shrugs it off. You and the the rest of the Wolves, keeping your heads low, move around the incoming horde of Zealots, attacking the City on its other side, almost opposite from where the Zealots marched from. After an hour of movement, you're eyes manage to detect the sentries watching the City. There are only perhaps 6 in total, evenly spaced out in hexagonal circumference around the City, but they each handle a fierce strobe-light that will bring light to the actual situation. Thankfully, the group is just far enough away that you aren't spotted.\n\n\"So, do we have any good ideas on how I'm getting in?\" You ask, your mind flipping through several theoretical simulations of getting into the City: most of them, you die.\n\n\"You see the narrow dark passage-way in between the strobe lights?\"\n\n\"Yeah?\"\n\n\"You have to slip through that, then quickly kill the sentry on this side before he can get to the other, and then climb the barb-wire fence. You'll have to figure out what to do from then, but I'd focus on finding the actual Chapel, and killing the Elders there. We'll be rushing the City on this entire side while you're inside, confusing the Zealots and buying you time. Got it? Why the long face?\"\n\nYou hand him your rifle, \"Guess I can't exactly bring this with me, haha.\"\n\nHe takes it, smiles, and then salutes; this may be the last time you see him or several members of the group. You don't bother saying goodbye, and leave it to the hands of fate. \"Just take care of Cecilia and David.\" You say, turning around to slowly creep forward...\n\nFirst taking it slow, you almost crawl on the ground as to not be seen by the sentry, and move forward. You position yourself perfectly so the lights miss you, and the cloudy sky allows you to remain concealed. As you crawl onward, you notice that the Zealot Sentry is practically sleeping; he must have been here all day, waiting. Seizing the opportunity, you make easy work of him by bite. The defenseless man is quickly drained, to the point of being unconscious for reasons other than tiredness. You don't even bother checking whether his pulse is still there, whether he's dead or not doesn't matter right now. Finding the big Chapel does. You keep the strobe-light on as to not raise attention to anything, and continue on inside of the City. You leap over the fence, still clad in the Zealot armor. What you see in the City is amazing.\n\nNothing, almost a ghost-town. While the City has flashing banners all over, only two large buildings seem occupied: one with a giant cross, the other with an upside-down cross, like a sword.\n\nAs you enter the former, obviously the Chapel, you see an elderly man open the door in front of you. His squinty eyes stare at you for a moment before he asks in a gravely voice, \"Has my time come already?\"\n\nWordlessly, you grab at his throat, and begin to unintentionally rip at it, blood trickling down your wrist. \"You are the reason for my brethren's suffering.\" you start, your pupils widening in anger, \"You and your Zealots made us have to resort to living in fucking burrows. This is where God's plans for you ends, Tomas.\"\n\n\"Then so be it.\"\n\nHe dies there and then, and you find several monks staring at you in horror from the Chapel's door. Noticing them, you enter the Chapel to kill them as well. The balding priests hold out their necklaces, yelling, \"We shall fear no evil for there is God.\" Over and over again.\n\nThankfully, you aren't evil; you're just looking out for your race. Protecting it from those who want to cut down on it. The blood of the zealots tastes better than ever, but it gets cut short by the sudden blaring of sirens-- the assault has begun.\n\nYet, oddly, enough, over ten Zealots rush in from all sides come to gawk at your bloody attire. While you cackle evilly when jumping and clawing at them, they still manage to have you surrounded by numbers if nothing else, breathlessly ending your unlife with their bayonets, all in the name of their God.\n\n\nYou have been killed by the hands of the Church.", "action_results": []}, {"action": "Agree; David can help you take on the city from the inside.", "result": "\"Alright,\" you reply with a nod, \"David will definitely be a huge help, considering that he's familiar with the area, but...\"\n\n\"But?\"\n\nYou frown, \"I hope you guys'll be safe. The Zealots, especially in number, aren't pushovers.\"\n\nRagnor smiles, and gives you a brotherly hug, \"Don't worry Vamp, we'll manage. The Wolves aren't exactly pushovers either haha.\"\n\n\"I know.\" You grin, returning the hug. You imagine, that after all this ends-- the fighting, you can retire, and just live your unlife with your new family. A dream, perhaps, but it's something to hope for. Soon after Ragnor turns to leave, he suddenly looks back at you, pupils dilated.\n\n\"Wait a sec, David was a Zealot before you ghouled him, right?\"\n\n\"Err, yeah.\"\n\n\"And he's still wearing his armor?\"\n\n\"Everything but the helmet.\"\n\n\"You think they'd recognize him?\"\n\nA pause begins, and ends with laughter. Ragnor snaps at you and puts on a silly grin, and jogs ahead back to his groups. You don't know who will head the second group, but you hope that it won't matter. All you need to do is wreak havoc in the city, and stay alive. The assault groups will do the rest, hopefully without harm as well.\n\nWith David silently in tow, you continue on, analyzing the strong hold. Even from afar, the sleepless City is easily seen, and as you march on around the incoming Zealots, you can see how they set up the City's defense. Six sentries, commandeering strobe lights in a hexagonal circumference around the city, obviously looking out for unidentified enemies. Thankfully, flashing-Zealot armor is pretty identifiable, and so is David's face, assumably.\n\n\"David?\" You call, looking to make sure he's listening. He nods in return, but doesn't speak. \"You think the Zealots will recognize you if they see you?\"\n\n\"Definitely, why?\"\n\n\"Since that means that you can draw attention due to your disappearance while I kill the head-honchos.\"\n\n\"That's smart.\" He says, succinct as usual.\n\nYou quit trying to make conversation and, once you get close enough to the City, point at the Zealot commandeering the strobe light in front of you. \"Can you kill him before he turns to a radio?\"\n\nDavid nods, and clicks on his blinking Cross-armor (you figure that it's to ward off friendly-fire) before he begins the march through the strobe light, waving his hands in the air and running to the Sentry. After several moments, you can see a wordless discussion taking place, starting with the sentry saluting and ending with him unconscious on the floor. When David turns the light a bit to the right, it gives you dark-space to walk through, unnoticed.\n\nThe two groups are not too far away, and you manage to wave to Cecilia and Ragnor before following David into the urban Church City. You pat David's back and consider your good decision making. But, once again, you just hope the others will be alright...", "action_results": [{"action": "Church City", "result": "The strobe light aimed back to its original place and the Zealot downed by his own, you and David make your way to the barb-wire fence, and easily leap above it, too lazy to get the key from the Zealot. After David turns off his blinkers, you begin to pay more attention to the City only to realize that, from the inside at least, it isn't nearly as bustling as you thought it was. Perhaps that's because most of them went to raid the hideout. Gideon is still there...\n\nYou shake your head; you tried your best with that fool, now it's time to take what's yours; what the Creations deserve regardless of what the Church or the Professor think of them. Not weapons, not demons: just people. David waits for you to start walking again, tapping his foot eagerly. He doesn't speak much, but you can tell he enjoyed his time with the Wolves. Still, you'll always wonder what's inside his head, now as a ghoul.  You continue through the ghost-town, which for whatever reason has all of it's buildings rigged with neon lights, flashing. David leads you through the ugly urban landscape, and you keep a lookout for humans. Suddenly, you spot one, walking out of some sort of pub, walking unsteadily. You grab David by the cuff of his armor and quickly hide in the shadow of some sort of looming dumpster. With a finger to your lips, you wait until the man's back is turned before you sneak up on him, digging claws into his neck for a quick and silent death. The man falls to the ground dead, and you lick your bloody nails. David, unfazed, comes out of the shadows only to pick up the man, and silently position him into the trash. \"That pub holds a great deal of Zealots. We need to move out before they see me.\"\n\nYou nod in return. At first you considered just going in and slaughtering the gathering of Zealots, but then realized that the light-weights Ragnor and his crew could handle, but the higher-ups are going to be an issue. David once again takes lead, and you prowl the streets, silently killing anything in your way, passing by buildings of all shapes and sizes, though most not even occupied.\n\nTwo buildings in particular stand out, however: one mansion with a giant blue Cross above the door; the other large and rectangular with an upside-down Cross, for whatever reason.You'd look through the windows to see what's going on inside, but the windows of both buildings seem to just reflect your own image, though you can only really discern your armor since your pale profile doesn't come out well in the reflection.\n\n\"The one with the holy-sword is Zealot-headquarters, the other one is the Chapel.\" David answers your thoughts, smiling at you. \"I think it's in our best interest to enter and clear out both.\"\n\n\"Which do you suggest to do first?\"\n\n\"Either one, sir. We need to kill Father Tomas and the Chief, both in their respective buildings. The Zealots who aren't on their way to the stronghold will be in both, though. But whichever we pick, we need to do it quick; Ragnor and the others will be making their move any moment now.\"", "action_results": [{"action": "Enter the Chapel.", "result": "Not wasting any time, you turn to face the Chapel. Metallic and looming over you, with a large neon cross, still flashing. The door is a harsh steel, too old to cast a discernable reflection but maintained enough not to rust nor weaken. \"How should we enter, then?\"\n\n\"No backdoors to the Church. Only one direction if you follow God.\" David recites from behind you.\n\nWith a shrug, you continue onwards, going up a flight of concrete stairs, leading up to the looming steel door. You consider trying to bash the door in, but decide that knocking it and waiting for the door to be opened by whoever's inside would be an easier solution for getting in.\n\nClang\n\nYour gauntlet taps at the metal. After a pause, you can hear noises on the inside of the Chapel, mostly worried murmuring. You quickly motion for David to go in front, right before a bald young man in ceremonial blue robe opens the door. In response to your ghoul's profile, the man just gapes for several moments before opening his mouth to speak. \"Dave?!?\"\n\n\"No... Not anymore.\" He states, walking into the Church. The man doesn't seem to even notice you, engrossed in seeing a living ghost instead. Inside, several other monks are gathered, all of them staring at David with awe. You take the opportunity to slink into the shadow, and wait.\n\n\"Behold! The blessed Lord brought our child back!\" They cry, waving their hands in the air in synchronization. Up and down their hands go, until one with a cowl speaks up, \"Brother David, where were you?\"\n\nYour ghoul stares at them with disdain, \"I got lost, but was found by a group of humans.\"\n\nThey continue to gape. The cowled-one continues his interrogation, \"Hmm? More humans, you say?\n\n\"Crazy enough, the humans were in our backyard this entire time. We just didn't recognize them.\"\n\n\"Whatever do you mean?\"\n\n\"The Wolves, Vadim. They're good people.\"\n\nGasps erupt, and David's only looks down to his feet, and his hands ball up to fists. \"They changed you, didn't they?\" The one with the cowl points, and begins to chant in some sort of language which you are unfamiliar with.\n\nBored of their religious, antics, you make your presence known by jumping out of the shadows, and decking 'Vadim' with a right hook, sending him to the middle of the crowd of twelve-or-so Monks. David nods, and sends a sharp kick to the nearest Zealot surrounding him. Before you know it, it becomes a rowdy brawl of fists.\n\nThe monks may be very agile, but without any weapons nor armor you figure you or even David could take them out alone. Something tells you the alarms around the buildings weren't for show either-- you need to find the Father, quick!", "action_results": [{"action": "Abandon David to search the Church.", "result": "\"David, finish off these grunts as I find the big man upstairs.\" You call out, examining the building for the Father's Quarters.\n\nDavid nods, \"Up the stairs, to the left!\"\n\nYour head turns from right to left, looking for the set of stairs that will lead you to the Father. Finding the red-carpeted stairs, you begin your ascent, only to be stopped by a heavy-set Monk, who angrily shoves you backwards. \"Get away, foul demon!\"\n\nHe continues pushing, but you catch his left arm, and end squeeze-- Crack. He yells out in pain, and you manage to grab him by the cuff of his robe, only to throw him out of the way and into a wall. You run up the staircase, skipping steps to maintain speed. After reaching the end of the first staircase, you deftly,turn your body, not wasting any time by getting to the adjacent continuation of the stairs. Several leaps later, you reach the end of the stair case, only to be confronted by a terribly old man in a ceremonial blue robe, with a skullcap covering his no doubt balding head. His face is withered, and his frail eyes only compliment an extremely happy demeanor. This, you presume, is Father Tomas.\n\nHe stares at you, silent, and raises a large metallic cross from an opening of his robe, though he seems to be holding it the wrong way...\n\nWary of his silver weapon, you take a step to the side-- giving you room. \"Father Tomas, it seems that I have finally had the honor to meet you.\"\n\n\"No, the pleasure is mine, Vampire. Fate has brought it that it is my responsibility to put you down, as well as your canine friends.\"\n\nYou glare at him in anger, and flick at your wrist; claws out, you get into a battle-stance. He, in turn, raises his shimmering Cross, wielding it as a sword.\n\n\"I wouldn't put up a fight, if I were you. I know for a fact that you Creations can't heal from a wound of silver, and as such you have no otherworldly advantage over me.\"\n\nYou laugh, \"Except perhaps the age part.\"\n\nThe priest stops smiling and instead eyes you angrily, \"I suppose you'll learn the hard way.\" He slowly begins to approach you, his sword, pulsating with some sort of unrecognizable energy, held high. You make a quick examination of your surroundings: the stair case from behind you, doors and other hallways to your right, though several meters forward and to your left is a ledge, where there's an at least three-story drop down to the first floor, where you can see David slowly whittling off the Monks. Perhaps you can use the ledge to your advantage...\n\nYou continue to parallel the insane priest, your claws at your side and your wits still intact. You need to make the first move, but how should you go about it? The man looks old, but something about him tells you that he's more than capable of wielding his weapon masterfully. Still, you're probably quicker than him, and a quick fight is all you need. Then again, you need to watch out for the silver sword, because if he gets a solid hit on you then you're done.", "action_results": [{"action": "Fight Aggressively.", "result": "You continue to stand parallel to the Head-Zealot, slowly beckoning him closer to the side with a ledge. While you know you have to end the fight soon, you also know that this won't be an easy fight. The cackling priest advances, holding his heavy Cross out like a rapier, poking it at you, trying to get you to move back. Deciding that staying on the defensive won't save you from this mad man, you take action by leaping in his direction-- he grins, preparing to simply swing upwards to hit you, but manage to somersault out of the old man's swipe, and land a heavy kick to his face. He staggers backwards, his hand on his eye in a mixture of pain and anger. Tomas angrily sends another swipe with his sword at you, but you're already charging for him, pushing the old to the ledge that is now to your right with your forearm. The priest coughs, but quickly recovers.\n\nRelentless, you send another barrage of jabs at him, moving close enough to him that his long-range won't be an advantage for him. A mixture of punches and claws manage to cut his robe to shreds, and he struggles to get you off of him-- to no avail. After a silly, pointless scuffle you manage to hold him right by the ledge, where a fall to the death would await him. Tomas holds up his silver cross, creating a pseudo-barrier between the two of you, but you just grab hold of it with your gauntlets, and shove him at the wooden slabs, and slowly increase pressure, slowly increase it. Several seconds more of pushing, and he won't have a choice of how his body breaks, as you'll secure his death in the fall. You shove once more...\n\nSnap.\n\n\"There we go... See you in hell, bastard!\" The wooden splinters open, and you find the two of you tumbling down at several meters, both grasping for eachothers' throats.\n\nUnfortunately for you, the old man barely manages to grab hold of your hair and uses it as leverage to be just slightly above you...\n\nYou both fall with a heavy thud, your armored body crashing through the floor. You struggle to get out of it, as you find your armor almost embedded in to the rubble. Still, you manage to get up, and the sharp pang you feel in your head slowly begins to disappear.\n\nAs the dust clears, you find a bleeding Tomas with a bloody eye holding an unconscious David to the wall, his silver sword still gripped in his hands. His remaining useable eye stares right at you, and the priest begins to cackle further, \"If you take even one more step towards me, I swear I will slay your disciple right now. But, if you leave me here to die in peace, not of a sinners hand, then I can promise that I will not kill him. Hmm, you like this deal?\"\n\nYour loyal ghoul stares at you blankly, and his shaking head can either be interpreted as a plea to let him live or to kill the priest. Or perhaps something else?\n\nStunned and still recovering, you try to make a decision with a clear head...", "action_results": [{"action": "Kill the Priest where he stands, because damn the consequences.", "result": "\"I'm sorry, David.\" You state, realizing that Tomas will be killing your ghoul regardless of your choices. With that in mind, you rush the bleeding geezer, hoping to catch him before he can finish off your ghoul. As you thrust your clawed hand at his head, he just barely manages to skewer David.\n\nNever has a killing felt more rewarding. Your hand pierces the fleshy skin-- leaving a flayed face and a collapsed priest. With a grunt, you rush over to David's side, horrified by the gruesome hole in his chest.\n\nYou don't really say anything to him, as there is nothing more to say. He fulfilled his duty to you well, and his job, once the City will be taken over, will be easily replaced. But, for now, his death shall allow others of your kind to live. David smiles, and holds your hand firmly. Memories flash of your brief but powerful connection, Oh, and we just were getting close, too...\n\nAs David closes his eyes, you stand up, ready to continue your mission-- now, to Zealot HQ. You make your way through the piles of corpses to the front door of the Church, more angry than anything else at this point. By now you recognize that the sirens are still blaring, which means that Zealots should be piling up in the streets-- but the street you see has nobody walking. Though you do hear voices from somewhere far to the left, you can't help but notice that Zealot HQ has its door open.\n\nAm I too late? You wonder, as you make haste by running into the building, looking around for someone to waste your adrenaline on. Inside, you see perhaps three half-dressed Zealots yawning and loitering about, seemingly confident that this is a false alarm.\n\nThis means nothing to you, and you rush one-- kick him into a nearby table, deck the other one with a heavy punch, and angrily bite into the last one's hand when he tries to strangle you from behind. It's over in a matter of minutes, but you suddenly feel like you're being... Watched.\n\n\"Bravo, Demon.\" Comes the voice. From across the room you can see a white-armored Zealot, taller and more sizeable than most you've seen. He carries with him a silver sword, less blunt than Tomas's though it doesn't seem to resonate with the same energy. \"I see you were able to butcher my friends quickly enough, but somehow I doubt you'll manage to take someone like myself as easily.\"\n\n\"Who're you?\" You roar, setting yourself in front of him.\n\n\"Zealot Karat, Chief of the Zealots.\" He grins, \"At least, until the real Chief comes home from your clever diversion.\n\n\"If.\" You state, bluffing. I have no idea what happened with Gideon and the other Zealots... \"If, he comes back.\"\n\nKatar doesn't bother answering, and instead positions himself with his silver katana in an aggressive fighting position. Once again, you find yourself in a tactical situation that you need to decide how to approach. You need to be careful about his silver sword and make sure to finish the fight quickly, but he's probably more spry than that bastard, Tomas.", "action_results": [{"action": "Play it defensively, make sure that sword doesn't come near your body.", "result": "Fueling your rage into reserve energy, to be used when necessary, you plant your feet to the ground, readying yourself for the Zealot.\n\nKarat laughs, lazily letting his sword's tip fall to the ground. The man's bravery (or is it bravado?) astonishes you, \"So, you fear God's might?\"\n\n\"Maybe, but not your's.\" Comes your sharp answer.\n\n\"Then how come you haven't readied yourself to attack? Are you worried you won't make the cut?\"\n\n\"I'm simply more confident in your ability to leave yourself open, thanks.\"\n\nKarat shrugs, \"Suit yourself, Vampire. Perhaps you shall find fear of God's servant instaed.\" With that, he raises his silver katana, it gleaming in the neon lights of the building. His stance confirmed, aggressive, he poises to attack. The white Zealot advances, giving a wide and open slash in the air to test you.\n\nOf course, you pass with barely any effort-- just a turn of the neck. Karat laughs once again, and attempts to bum-rush you-- but your defensive stance gives you an advantage, and with clever foot work you grip his wrist, pull, and flip him onto a nearby table. It cracks under the pressure of an armored giant slammed onto it, but the Zealot gets back up and, still gripping his katana, sends a swift vertical cut down at you. You attempt to dodge, but you'd admit that you didn't expect him to get back up so fast, and the slash sticks into your shoulder-armor, just barely missing your skin.\n\nAs lucky as you were back there, now Karat has the initiative. He pulls the sword back, grabbing you with it and sending a heavy boot at your stomach. You begin to tip over, but you're sent backwards by a heavy, gauntleted punch to your nose-- which sends you back several feet and onto the ground. Your vision blurs slightly though you manage to get up before Karat manages to land a more accurate cut at your forehead, and manage to grapple him, using the core of your body to push him back. Your nose for some reason still bloodied, you continue to prefer close quarters, where your pinging head won't hamper your vision. Using the anger built up, you manage to grab hold of his helmet with both hands, and squeeze.\n\nThe man screams, much like your ghoul did not so long ago. They all do, the humans scream in pain, struggle and kick in their last moments. And as the helmet crumples up and the man goes limp, you embrace your inner demon and drink him dry. The blood is refreshing and your vision clears, but then you notice why his armor is so bright. Must be inlaid with silver...\n\nYou shrug. Does it really matter if the Zealots have been inlaying their weapons with silver? The Wolves can take care of themselves...\n\n\nRegardless, realizing that there aren't any Zealots left in the building, you leave to see how the war is going. Mission Accomplished.", "action_results": [{"action": "Look for Ragnor and the others.", "result": "You make your way outside of the building shaken but undeterred. The streets are empty, but you know that there are more humans in the houses, hiding. While the fighting itself may be dying down, you feel the need to go out and meet your courageous brethren, rather than have them come for you. You run down the steps and onto the concrete street, continuing back from where you came from, meanwhile trying to shove away distracting thoughts of your deceased friend. When this is done, we will honor you properly...\n\nEventually, you begin to notice armored corpses strewn about in awkward positions. Alternatively, you find a brown Wolf, whom you recognize as the Middle-eastern man, white-eyed and bloody by a curb. How many of us were lost this day?\n\nYou continue on in solemn silence when you reach the fence, and from beyond it you can see several more Wolven corpses. Frantically, you search for Cecilia-- Phew, none of them are blonde like she was. But still... This leaves perhaps eight of us left... Most likely the last of our kind.\n\n\"Vamp!\" Comes a cry behind you. You turn around quickly to be hugged by an especially warm Cecilia, with Ragnor smiling with glee. You return the embrace, happiness overcoming the previous thoughts of dread.\n\n\"I'm glad to see your alright, man. We had a tough fight, but we fended the hordes of Zealots off. How did your fights go?\"\n\nYou nod, \"We... We killed Tomas and- and a man named Karat, called himself 'Chief'.  Either way, the place was deserted from Zealots by the time I came looking for you.\"\n\n\"Zealots? What about civilians?\"\n\nCecilia joins the interrogation with the question you least wish to answer at this moment, \"And where's David?\"\n\n\"The Father killed him.\" You answer succinctly, still trying to get your mind off of it-- you don't want anymore nightmares. \"I'm going to deal with the civilians soon, Ragnor. I have a plan for them.\"\n\nRagnor nods in turn, \"Unfortunate, though he died a warrior's death. What shall you do with the civilians?\"\n\n\"Ghoul them, use them to help rebuild this city. Once this works, we can make an entire civilization of Zealots, and then... Find the Professor and kill the bastard.\"\n\n\"Solid thinking. But what precisely is the next move?\"\n\n\"Well, where are the surviving Creations?\"\n\n\"Rampaging. Cecilia here was the only one of the virgins to be able to control their forms.\"\n\n\"Rampaging?\"\n\n\"Err, yeah.\" Ragnor replies, confused, \"What's the problem?\"\n\n\"For the plan to work we need as many live humans as possible to rebuild. Ghouls, remember?\" Without wasting anymore time, you begin to move back in search of the Wolves when you feel a heavy hand on your shoulder, holding you back.\n\n\"Woah there, Vamp. Are you sure you want to stop them? This is the first time they're in actual control of their lives. Plus, they're probably too tired to do any real damage. Just let 'em have their fun, alright?\"", "action_results": [{"action": "Give in.", "result": "You stop in your tracks and turn around. \"Alright, Ragnor. But we need to go see where they are if only to get things up and running before the rest of the Zealots come back from the hideout.\"\n\nRagnor's eyes seem to pop out, \"Shit! I forgot about them!\"\n\nMoving as quickly as possible, you follow your ears to and alley-way, where seven Wolves lay, peacefully licking the blood off their coats. You let out a loud sigh of relief after this, thankful that they didn't cause too much havoc after the fight was won and that they're all in one place. Several of them snarl at you but remain reserved enough so Ragnor can give them a fatherly rub on the head, making them relax. And, as they collectively relax, they slowly morph out of their animal-forms and back to their naked, wonderful selves.\n\nThis, your family, will be the parents of a new nation of Creations. A new beginning for your race.", "action_results": [{"action": "Counting from A.D.", "result": "For both the humans and Creations of Church-City, now simply referred to as 'Home', everything changed after the Night of First-Blood. Twelve moons past and the event simply became what everybody began counting from. Today marks the first year since it happened, and the Ghouls, in all of this time, have slowly warmed up to the 7 apostles and yourself, dubbed the Messiah of Creation. You care little for the title, but the energy spent creating a hierarchy and stable society would be all for naught without a leader, and you-- decorated 'war' hero and leader of the Wolves was the unanimously voted candidate. Ragnor wasn't interested in the position-- the way he put it was, \"I'd much rather lead others to fight than lead them to work.\"\n\nAs such, he mostly leads reconnaissance and other various missions while you worry about the boring stuff, such as feeding the hundreds of blood-thirsty ghouls, setting up scouting teams and doing fluffy 'moral support' meetings with your apostles. The scouting teams come with information about the surrounding areas and the status of the wildlife and animals in the desert, but you make sure they don't go too far out-- several scouts have been known to just disappear mysteriously.\n\nYour methods can't be called 'moral' by any means, though they are efficient. Perhaps thirty of the least fit humans were spared from being ghoul, and instead were tasked with giving of their blood monthly. The ghouls didn't need more than an ounce per month in addition to other foods, though you found yourself needing much more. The humans gave to the point that they practically were ghouls themselves, but not quite. Too tired to revolt, but too useful to just kill.\n\nFurthermore, you spent time looking through old files in the Zealot-labs, searching for more information on the Professor. What you found wasn't as much as you'd hope, just his name and several of his affiliations. No physical description or photo, just names, affiliations, and several of his experiments.\n\nStill, you're hoping that when you finally crack the computer you'll be able to find more on him. Ragnor thinks it's a long-shot and stopped helping you sort through the files to figure it out, deeming it 'hopeless' and a 'waste of time'. Truth be told, he might have a point-- for all you know, the Professor could have died a while ago.\n\nBut there was one conundrum that among the time elapsed that you're all struggling to answer: what happened to the other Zealots? And Gideon?\n\nThe desert was periodically searched for any traces of them, but nothing turned up. Several times you've set out to search for Kelso\n\nAs much work as you had, you managed to do some more enjoyable things in your 'down time'.", "action_results": [{"action": "The Wolves. (Optional)", "result": "Even though the Creations are now in control of their lives and aren't persecuted for existing, you've heard several reports from the younger ones about nightmares and need for emotional support. After a small discussion about it with Ragnor, you decided that it may be best to have weekly group sessions where everybody can 'talk'. It's silly and tacky but you go along with it. Morale is important.\n\nOne of the more memorable meetings was when you discussed the trauma induced from the Professor himself.\n\n\"He used to stick a needle in me!\" the young Allen blurts out, breaking the ice. \"He'd continually poke and pull out my blood until there was nothing left...\"\n\nDarla scoffs, \"That's nothing, kiddo. The Professor-- he, he used to check if I could become...\"\n\nWe all watched her closely, intrigued by what she may say, until, suddenly, Doria begins to tear up and bury her head in her arms. Ragnor awkwardly puts his hand around her in an attempt to comfort her, but to no avail.\n\n\"The Professor... He was a character.\" Ragnor begins, \"I was brought to consciousness for several days, as he used to take me to spar-- no, fight to the death with his other mutants. Consistently the blonde bastard would take a mortally wounded Creation and perform more experiments on them, to check if he did it right. Still, there was something charismatic about the monster, charismatic; fatherly. Those who survived the fights were sent to far-off places to fight humans, and when we returned we'd be treated like kings until he stuffed us back into tubes.\"\n\nNordim remains silent, but perks his head up. His head shakes, but he says nothing. Shamino starts to speak, only to be shut down by Cecilia, who tightly grips Nordim's hand.\n\n\"Speak, young one.\" She whispers. Nordim nods, then opens his mouth. Nothing comes out, but eventually sounds can be made out.\n\n\"Professor Kurschner was like.... Like what Ragnor s-said, fatherly. Like, like a f-father to me. And, and... He used to give me treats... If I only hurt someone-- someone for him. I...\" He stops, and proceeds to 'do the Darla' and buries his head.\n\nSeveral gulps later, you begin to realize your displacement in the conversation. Why exactly is it that you are some sort of amnesiac? Everybody else seemed to remember something of the lab, but you know very little about anything. Only thing you know about yourself is that you're the only vampire left and that you somehow led 15 people to lead a rebellion against hundreds, only to win. Quite the accomplishment.\n\n\nYou shake your head out of the otherwise uninteresting memory. If only Ragnor had a better memory then we could track the Professor down...\n\nOther notes you've gathered on your 'apostles':\n\nRagnor, your second in command and easily the strongest fighter in Home. At least, in his beast-form. He couldn't care less for this garbage, but goes through it for the team.\n\nCecilia isn't bashful about expressing herself to you, though it's obvious she'd rather do it in private rather than discuss it with everybody else. Still, she realizes the importance of this for the younger of the group, so that's good.\n\nShamino is large and dopey, but he's really enthusiastic, which is great since something as silly as this needs the support.\n\nSimon is probably around sixteen years old and has been expressing discontent up until now. He seems to have warmed up after a couple of sessions of whining.\n\nDarla is still heartbroken over your ghoul's death. It's odd, but you never noticed that she and David were close. Then again, it's only now that you've really been acquainted with the Wolves. More personally, at least. Either way, she appears to be benefiting from the sessions.\n\nNordim remains passive throughout all the sessions. Seems to share a resentment of any sort of authority and shudders when the Professor is discussed.\n\nAllen is extremely young, adolescent. He appears to idolize you and Ragnor, which gives you an impetus not to disappoint.\n\nAs for you yourself, well, you try your best to act like a leader, though you've come to get bored of the place. The workload builds up and you don't want to bother anybody with your troubles.\n\nSomehow, you get the feeling that the Demon is somewhere out there-- the Professor lives. While you can't be certain of this, you simply feel the likelihood of something big happening any day now. And so you wait, praying for the day where you can take revenge on him  for what he did to you:  manipulating you and your brethren to hurt others-- without even knowing it! He used us as vessels for his own crimes, then left us out in the desert to be hunted down by the Zealots. The bastard will pay for what he did to us...", "action_results": [null]}, {"action": "The Ghouls. (Optional)", "result": "The Ghouls are, to put it simply, unhappy. From devout followers of God to what they believe are demons. If you weren't the leader of the City, you'd perhaps find it amusing when a Ghoul would attempt at suicide, only to find themselves un-killable by normal means. It's a sick kind of amusement which you don't take part it, though you can certainly see the appeal.\n\nThey mostly live wherever they used to anyhow, only now they depend on your monthly visits when you give them vials of blood which the parents hide from their children. Almost every-time you appear an enraged male tries to fight you, but they're quite simply no match. It takes a while, but it's relaxed, for the most part.\n\nYou have more or less recognized that only time can repair the fences torn down. Perhaps one day they'll understand.\n\nWhat you do realize, however, is that you'll need lots of blood to maintain this, and as such you have to make monthly visits to the old Zealot-HQ, where the twenty humans left serve as 'blood-donors'.\n\nYou stop off at the old Zealot-HQ, where the twenty-or-so remaining humans are still kept. You open the metal doors, where what used to be a cafeteria for Zealots now holds Ghouls, carefully placing vials of blood into specific containers, storing them in an unused cupboard. As you enter, the Ghouls rise at attention and salute, before scurrying out of the building. They know why you're here.\n\nOnce a month you have to extract more blood out of the humans, as well as make sure they're scared enough of you so they won't turn on each other. It's happened before, and you have to make sure it doesn't happen again-- after all, your society is defendant on feed.\n\nYou move forward and to the right, opening another door which leads to a hallway, which leads in to another door whom's staircase leads to the basement, where the humans are kept. You go down the steps, flipping a light-switch as you do so. The lights are dim and buzz a lot, but the Zealots installed a powerful generator can probably work for several more years.\n\nThe humans, shackled, pale, and grim, peer at you in the dim lighting. Their faces express nothing but disgust mixed with fear, and they say no words to you. You reach for a flask with one hand, and the other grasps the wrist of a young girl. She must have been ten before you took the City over, and now she is... Developed. Mature in physical, and probably would be attractive if she wasn't as pale as the undead themselves. You bend down and look at her straight in the eye as your claws rip into her wrist, and as blood pours out into the flask below she doesn't even cry out in pain-- none of them do, they just watch. When the flask is several centimeters full you patch her wrist with a large band-aid filled with alcohol. At this she winces when you place it on, her slender frame shivering. You stand back up, and stare at the others, watching you as you get ready to leave, placing a cork in the flask. You turn back around, finished with only one of your tasks concerning them.\n\n\"Where is your god?\" You question the humans.\n\nNone of them answer, they just stare blankly at you, soulless.\n\nYou point to one of them, one that has the soiled garb of a minister, \"Where is your god now, human? Where has he gone to protect you in your time of need? In case you didn't know, an entire year has passed since your holding, and behold nothing has succeeded in saving you. You are hopeless.\"\n\nThey maintain their silence.\n\n\"Your only possible hope is to become one of the fallen, one of the so-called 'Demons' you once told your children to fear. Today I give you that option, to live eternal unlife, not the death that awaits you.\"\n\nOne or two look up to you, some in fear, some in disgust, and some of interest.\n\n\"Those who wish to join me can. Stand up, throw away your principles, and you shall join the magnificent civilization that has been created in God's absence.\"\n\nThe girl you just cut speaks, \"If- if I join you... will, will my child be safe?\"\n\nYou raise an eyebrow, only to see one of the young men, close to her, holding her hand tightly. You notice a slight bulge in her stomach. You rub your chin, \"Aha...\" Perhaps that would be a better method to keep the City living. Use the thirty here to reproduce more children to feed off of... \"Yes, he would. You and your mate may stand, for we will take care of you.\"\n\nWith a weak smile, the girl trembles to get up, while the male solemnly helps her up.\n\n\"Indeed, I didn't expect for you to be able to... Be intimate here, but this is for the best. Whomever wishes to be fruitful, and to multiply, will be granted access to the World above. The rest will continue to stay here.\"\n\nSeveral more haggard men and women stand up, just barely able to with their shackles. With a powerful strike, you break the metal holding them, and the thirteen men and women stand behind you. The rest of them-- a truly hopeless pair of twins who still believe in their deity just wait there, watching as you take several of the men and ghoul them in front of the emotionally scarred group, the blood spraying over them. They stare blankly as you grab at the oldest human, and swipe at his neck-- revealing all of his ruby red blood before he could even react.\n\nThe boy of the pair stares at you angrily; and knowingly, that he couldn't possibly fight you. The other of the two-- an odd looking girl with a bizarre paper-hat on her head-- one shaped like some sort of boat-- doesn't even react, truly mortified by your actions.\n\nAs the youth glare at you, you deftly snatch the hat from her head, unfolding it slightly to read what the blotches of ink read. The brother breaks out of his phase just to push at you, trying to get the hat back only for you to easily push him back several meters with but a flick of your wrist. Just glancing at the paper, you recognize the format to realize that it is not recent-- pictures of gardens and open-houses primarily being the subject of the paper. Boring.\n\nYou drop the newspaper on the floor before motioning to your new workers to follow you. Soon enough, you place the mates into their own 'cells', houses under lock and key. Every several days you watch to see how things are, and whether their efforts to make children for you is working.\n\nUnfortunately, it seems like it will take years before you can harvest the fruits of this brilliant plan, but at the very least it seems like a good investment...", "action_results": [null]}, {"action": "The Wolven tongue. (Optional)", "result": "The lupine language is an annoyingly complex one. Even though the alphabet is blocky and primitive, it's amazingly complicated. If you were to guess, the language was probably formed from several other ones-- particularly English, German, and Latin. Or perhaps not-- it's just that foreign to you. Over the months of relative tranquility you've picked up most of it, though the constant use of prefixes, suffixes and roots still mess you up greatly. \n\nAs Ragnor puts it, \"It's a beautiful language, simple but elegant. It's confusing to learn though, I'll give you that.\"\n\nYou were given chalk and were set in some sort of rundown school, where they still used blackboards. Shamino-- who's just slightly younger than yourself, pretty much takes advantage of the opportunity to finally teach you something. He forces you to draw the assortment of curved lines in specific orders, with seemingly random dots in order to emphasize expression.\n\nProbably the most interesting part of the alphabet is that some letters are simply not used in the English language. Fittingly, they require use of the back of the throat to pronounce, almost like a choked howl.\n\nThey say that they formed it to spite the Professor, but you're not really sure how it would accomplish that. It seems that it would be more useful as a secret-code language if needed.  That's probably what it was at first though, assuming the Wolves were always this close in their Facility.\n\nIt's fascinating to you, though, that the Wolves were close enough to build this language together. Unfortunately, they seem to share a link together that you don't have, a connection that they all have. Even with the newly added benefit of speaking their tongue, most of them still find you aloof to them, simply a leader- but little else.", "action_results": [null]}, {"action": "Stargazing with Cecilia.", "result": "\"You're starting to lose your hair.\"\n\nWith a loud chuckle, you sift your fingers through your once luxurious head of hair. As you take your hand out of it, white strands fall to the floor. \"Ha, I suppose I am. I suppose that's what happens with stress.\"\n\nCecilia giggles, snuggling up next to you. For a moment, the two of you marvel at the open sky, unpolluted by light. The stars shines from behind the slowly clearing clouds, a full-moon masked by the gray matter.\n\n\"You think it was a good idea to sleep on top of a high roof top?\" You ask.\n\n\"Well, it's romantic.\"\n\n\"Not really.\" More laughter. \"You know, I still don't get you, Cess.\"\n\nShe gets up, her long blonde hair falling into your face, \"What is that supposed to mean, Vamp?\"\n\n\"You know I'm impotent.\"\n\n\"... Yeah, so? Doesn't mean I can't like you.\"\n\nNow it's your turn to chuckle. \"Of course, but that also means that you can't benefit our race if you stay the nights with me. Probably can't be too fun either.\"\n\n\"Sometimes we don't have to sacrifice of ourselves for others. I like you and I can trust you, and that's all  need, love.\"\n\n\"Ah-huh.\" You slowly rise up, only for her to grab your hand to sit down with her again. You get closer to her once more, \"Alright, so, you got me up here, finally, but as much as I like spending time with you, I think you need to tell me why you wanted to sleep on the roof tonight.\"\n\nCecilia turns away, \"I need to see something.\"\n\n\"Like what?\"\n\n\"You'll see.\"\n\nIn awkward silence you wait. As a powerful gust of wind passes, the night sky suddenly brightens slightly-- the full moon  fully exposed. The Wolf gets up from the mattress, only to hop down from the roof and stare intently at the moon.\n\n\"Cecilia?\" You question, not wanting to upset her. All you know is that she wants to be in her animal-form, but you're not sure why.\n\nSuddenly, your lover begins to tremble, her shoulders jerking spontaneously and her chest rising with heavy breaths. Her body, barely concealed by a night-gown, grows-- thick blonde hair sprouting from every area, her legs becoming thick as tree trunks, claws protruding and her nose extending to a snout. Ugly fangs hang from her mouth and a vicious tongue hangs out as her maw becomes a weapon to be feared.\n\nThe demonic beast stares at you and snarls in Cecilia's normal voice, \"V-vamp?\"\n\n\"You can speak in that form?\" You ask, shocked.\n\n\"Yes.\" She replies, moving towards you, \"I need you to do something for me.\"\n\n\"What?\"\n\n\"Ghoul me.\"\n\n\"What?\"\n\n\"I'm serious, my love. Else I wouldn't have already formed for you, rather than abruptly change in the middle of the process. I wish to live longer, like you shall!\"\n\nYou bring a hand to your brow, \"Cecilia, my dear... This isn't necessary, really. You'll be living a long life anyway, as a Creation.\n\n\"Cecilia, trust me, you do not want the curse of blood. The necessity eats at your very soul-- it justifies horrible things and--\"\n\n\"They're not horrible if they can be done with you.\"\n\nThe poor girl... She doesn't get it, does she? She thinks she that being ghouled is a blessing, but it's a curse. The ghouls here, for example; they became sheep to be herded. Even I'd have a companian forever, it also means that my companion won't be herself anymore...", "action_results": [{"action": "Become one with Cecilia.", "result": "With a weak smile you cautiously approach Cecilia. \"Alright, my love. Just remain quiet-- the others are still sleeping.\" You continue nearing the Wolf, who lowers her giant snout to clumsily lick your face. The slobber and sound gives you a distinct feeling of disgust, but you manage to nuzzle the liquid off your face on Cecilia's fur.\n\n\"Are you sure you want this?\"\n\n\"Oh yes!\" Cecilia whispers, her snout forming some sort of smile.\n\nOn her command, you sink your teeth into her neck, getting your mouth full of hairs. It takes a while, but you finally manage to slurp enough blood that you feel the 'rush'.  Power, energy, heat; everything connects you further in the moment. Despite her quirks, you've come to appreciate her more than anybody else. After all, she sacrificed most of her ability to feel just so you could savor her blood... No, she said she wished to live for eternity, like myself. To be with me, forever...\n\nYou feel the sticky red goo splatter around your lips as the Wol struggles to not howl by pounding the ground around you. Your teeth maintain a strong hold on her neck, for you know that if you release prematurely the Ghouling process would have to be repeated from the beginning. The sweet and sour drink continues to flow down your throat, and before you know it--\n\nCecilia falls to the ground, naked and in her more human form. You fall upon her, and find yourself unconscious.\n\nYou wake back in your quarters, a pale Cecilia in your bed and hugging you tightly. If it were anybody else this might have been an opportunity for debauchery or something naughty, but no-- you're still asleep downstairs. But that doesn't matter.", "action_results": [null]}, {"action": "Refuse.", "result": "Slowly, you approach the vixen. \"Cecilia... No, just no.\"\n\nIt's as if you can see a frown in that huge snout of her's, \"Why no? Vamp... I want this, for us. Why not?\"\n\n\"Because you shouldn't throw your life away for me!\" You snap back, standing up to her bulking figure. \"Ghoul's are inherently submissive and are forced to drink of other's blood to live. This is not a life for you-- I know you enough to know it isn't.\"\n\n\"Only submissive to our sires,\" Cecilia murmurs, nuzzling her large cranium to your shoulder. \"And I'd be okay with that.\"\n\nYou push her away, slightly. \"But I wouldn't be okay with it,\" you frown, petting her fuzzy chin, \"Can you respect that?\" Ugh, it's really hard to seem courteous when she looks like this...\n\nCecilia backs down, \"I suppose... I can't force you to do that. I'm sorry.\"\n\n\"Don't be, it was a miscommunication on both sides. I think. Now, why don't we get some rest together? We have lots of time to look forward to.\"\n\nYou smile and she smiles back.", "action_results": [null]}]}, {"action": "Researching about your Creator.", "result": "\"Alright Ragnor, check the bin in the back. I'll flip through the files in the cabinet.\"\n\nAs Ragnor groans, dropping a metal safe he was trying to punch open and moves to the back. \"You know, I still don't get why you're so fixated on it still. You've got quite a bit ahead of you, why not focus on that?\"\n\n\"Because he still holds the answers to my questions. Like, who I was, et cetera.\"\n\n\"Why not just put it behind you and focus on the present?\"\n\n\"Because I also need to make sure he doesn't mess with our future.\"\n\n\"You don't think he's dead?\"\n\nYou shake your head, \"Doubt it. Some of the files have already discussed the other Facilities and how the Zealots destroyed all thirteen of them. But I don't think that a man as resourceful and well-funded as the Professor wouldn't set up a back-up Facility. I'd wager that he's trying to do something there too- and we can't have that, can we?\"\n\nRagnor shrugs, \"If it makes you happy.\" He silently sorts through the bin.\n\nWith a sigh, you try to remember everything you've collected thus far: the Professor seemed to have thirteen Higher-Creations which eac helped run their specific Facilities, each with their own 'specialty'. From what you can tell, the ones you know are probably Gideon, Kelso, and... God, what was his name, Stein? They must have been the only ones who survived the Facility raids. The rest likely died.\n\nThe Professor-- Sion Kurschner, apparently was known to experiment on himself as well as others. No pictures detail him, though it notes that he was of Germanic background, though American-born and raised. A lot of things detailing him are ripped, so it's hard to get anything useful.\n\nYou flip through the last folder-- and something catches your eye. Eureka! It's a last sighting report. Apparently he was seen by Zealot scouts about a year ago, before the Church-City raid you ran. They saw a man in a white lab coat circle around the desert, then disappear. They say he went south, where they occasionally heard reports from another City that (used?) to be there. No other reference to that city is made anywhere else, but... This is the best lead we've gotten. Ever.\n\n\"Ragnor, take a look at this! In about a week we should be able to send a team in that direction in search of the lost City!\"\n\nWe'll find you, Simon Kurschner. It's just a matter of time now...", "action_results": [null]}]}]}, {"action": "Shrug Ragnor off and run to make sure the chaos is controlled.", "result": "With a heavy sigh, you continue on back to the streets of Church-City, Ragnor's hand not strong enough to keep you back. He and Cecilia follow you nonetheless, though in silence. The way back is uneventful, and the howls of the remaining Wolves are distinct enough to follow. Moving as quickly as possible, you follow your ears to and alley-way, where seven Wolves lay, peacefully licking the blood off their coats. You let out a loud sigh of relief after this, thankful that they didn't cause too much havoc after the fight was won and that they're all in one place. Several of them snarl at you but remain reserved enough so Ragnor can give them a fatherly rub on the head, making them relax. And, as they collectively relax, they slowly morph out of their animal-forms and back to their naked, wonderful selves.\n\nThis, your family, will be the fathers of a new nation of Creations. A new beginning for your race.", "action_results": [null]}]}]}, {"action": "Fight aggressively, to make sure the fight is ended soon.", "result": "Still angered by the death of your friend, you quickly lunge at the man, his mouth still moving. Karat moves out of the way, just in time.\n\n\"You're a feisty little demon aren't you?\" He laughs, readying his katana to slash. You don't waste a second when you swipe at him again, your claws forming from under the gauntlet. He dodges it again-- and counters, sending a flurry of swipes in your direction. Even though his advancing attacks barely give you enough time to dodge, you try to maintain being on the offensive.\n\nA horizontal slash causes you to crouch, and the next vertical one makes you have to move to the side. Again and again this cycle continues, and you feel as if he might be getting tired. When he begins to slow down even the slightest bit, you add a kick to your crouching, sweeping him off of his feet. He falls over, but not before  a wild swing cuts at your cheek. While only a small amount of pus dribbles out of your cheek. you realize that this marks something worse. Still, you make an attempt to jump onto him, and strangle the bastard to death, but even on the floor Karat manages to use his sword at it's fullest, and this time, his sword is pushed with enough force to pierce your body armor.\n\nOn the plus side, you did manage to end the fight relatively quickly.\n\n\nYou have been killed by the hands of the Church.", "action_results": []}]}, {"action": "Trust in the Priest and continue on to the other building.", "result": "\"You'll have your own choice of death today, Tomas. But I will honor the deal we made tonight, and I hope, for your sake, that you honor yours.\"\n\nFather Tomas stares at you with that crazy eye of his, nodding and cocking his head for you to move towards the door before he can release your friend. With an angry sigh, you move past the bloody corpses piled up in the room and hang by the front door.\n\nAs David is dropped by the Father, you stand up, ready to continue your mission-- now, to Zealot HQ. David stares at you meekly, trying his best to grunt loudly. You wave to him, expecting him to follow, before opening the front door once again. By now you recognize that the sirens are still blaring, which means that Zealots should be piling up in the streets-- but the street you see has nobody walking. Though you do hear voices from somewhere far to the left, you can't help but notice that Zealot HQ has its door open.\n\nAm I too late? You wonder, as you make haste by running into the building, looking around for someone to waste your adrenaline on. Inside, you see perhaps three half-dressed Zealots yawning and loitering about, seemingly confident that this is a false alarm.\n\nThis means nothing to you, and you rush one-- kick him into a nearby table, deck the other one with a heavy punch, and angrily bite into the last one's hand when he tries to strangle you from behind. It's over in a matter of minutes, but you suddenly feel like you're being... Watched.\n\n\"Bravo, Demon.\" Comes the voice. From across the room you can see a white-armored Zealot, taller and more sizeable than most you've seen. He carries with him a silver sword, less blunt than Tomas's though it doesn't seem to resonate with the same energy. \"I see you were able to butcher my friends quickly enough, but somehow I doubt you'll manage to take someone like myself as easily.\"\n\n\"Who're you?\" You roar, setting yourself in front of him.\n\n\"Zealot Karat, Chief of the Zealots.\" He grins, \"At least, until the real Chief comes home from your clever diversion.\n\n\"If.\" You state, bluffing. I have no idea what happened with Gideon and the other Zealots... \"If, he comes back.\"\n\nKatar doesn't bother answering, and instead positions himself with his silver katana in an aggressive fighting position. Once again, you find yourself in a tactical situation that you need to decide how to approach. You need to be careful about his silver sword and make sure to finish the fight quickly, but he's probably more spry than that bastard, Tomas.", "action_results": [{"action": "Fight defensively, as to make sure that katana doesn't touch you.", "result": "Fueling your rage into reserve energy, to be used when necessary, you plant your feet to the ground, readying yourself for the Zealot.\n\nKarat laughs, lazily letting his sword's tip fall to the ground. The man's bravery (or is it bravado?) astonishes you, \"So, you fear God's might?\"\n\n\"Maybe, but not your's.\" Comes your sharp answer.\n\n\"Then how come you haven't readied yourself to attack? Are you worried you won't make the cut?\"\n\n\"I'm simply more confident in your ability to leave yourself open, thanks.\"\n\nKarat shrugs, \"Suit yourself, Vampire. Perhaps you shall find fear of God's servant instaed.\" With that, he raises his silver katana, it gleaming in the neon lights of the building. His stance confirmed, aggressive, he poises to attack. The white Zealot advances, giving a wide and open slash in the air to test you.\n\nOf course, you pass with barely any effort-- just a turn of the neck. Karat laughs once again, and attempts to bum-rush you-- but your defensive stance gives you an advantage, and with clever foot work you grip his wrist, pull, and flip him onto a nearby table. It cracks under the pressure of an armored giant slammed onto it, but the Zealot gets back up and, still gripping his katana, sends a swift vertical cut down at you. You attempt to dodge, but you'd admit that you didn't expect him to get back up so fast, and the slash sticks into your shoulder-armor, just barely missing your skin.\n\nAs lucky as you were back there, now Karat has the initiative. He pulls the sword back, grabbing you with it and sending a heavy boot at your stomach. You begin to tip over, but you're sent backwards by a heavy, gauntleted punch to your nose-- which sends you back several feet and onto the ground. Your vision blurs slightly though you manage to get up before Karat manages to land a more accurate cut at your forehead, and manage to grapple him, using the core of your body to push him back. Your nose for some reason still bloodied, you continue to prefer close quarters, where your pinging head won't hamper your vision. Using the anger built up, you manage to grab hold of his helmet with both hands, and squeeze.\n\nThe man screams, much like your ghoul did not so long ago. They all do, the humans scream in pain, struggle and kick in their last moments. And as the helmet crumples up and the man goes limp, you embrace your inner demon and drink him dry. The blood is refreshing and your vision clears, but then you notice why his armor is so bright. Must be inlaid with silver...\n\nYou shrug. Does it really matter if the Zealots have been inlaying their weapons with silver? The Wolves can take care of themselves...\n\n\nRegardless, realizing that there aren't any Zealots left in the building, you leave to see how the war is going. Mission Successful. You get up, and stretch, getting ready to make your way to see how the Wolves fared.\n\nSuddenly... \"DIE DEMON!\" Comes the familiar thundering, though gravely voice.  You hear and feel the heavy thud of a metal beam smashing into your skull. You double over, barely conscious, but you're able to make out the blue robe of the Father, now striped with rust-colored blood in front of you. \"While it is saddening to think that you got this far, I am happy to relinquish you of your dark life-force, as I did to the man whom you corrupted. Good night.\"\n\n\nYou have been killed by the hands of the Church.", "action_results": []}, null]}]}, {"action": "Fight Defensively.", "result": "You plant your feet sturdily into the flooring, watching his sword with caution. Whenever he moves closer, you move forward and around him, bringing him closer to the ledge and maintaining an important amount of distance between the two of you. Tomas chuckles, and finally begins swinging his heavy artifact. He does so not wildly, rather with strong, fluid motions; all of which your utmost concentration allow you to just barely dodge. His long strokes give him a lot of range, and you have a feeling that he's only just started.\n\nHe picks up the pace, using his heavy sword more like a rapier, thrusting and swiping, attempting to corner you to the other side of the room; that isn't necessarily bad, as it's the side  that has the ledge, but you need to quickly get back in control of the fight if you wish to get the old fool.\n\nTomas advances, giving another quick thrust with his sword-- you try to take advantage of that by kicking his sword out of his hands, but his firm grip doesn't let go of it. Not wasting the opportunity, you leap at him while he rebalances the sword, and try to land a heavy claw at his neck. Seeing you, the old man, with bizarre agility,  drops to the floor, and sweeps your legs from under you, knocking your head on the rails. You quickly get back up with a sharp twist, but he has enough time to give you a thwack on the back with his sword. The pain stings, and you feel your bones crack as he smacks you upside the head again with it, over an over again. Every time you attempt you get up, you are taken out again by Tomas's repetitive strikes. Can't... Get back up...\n\nBefore you know it,\n\n\nYou have been killed by the hands of the Church.", "action_results": []}]}, {"action": "Finish off the remaining monks, then worry about Father Tomas.", "result": "Man, these bastards are quick.\n\nYou may have gotten lucky with the Vadim fellow, but the rest, now pumping with adrenaline, are much harder to hit. The bald men may not be especially strong, but they're skilled enough that they can at least dodge and block your powerful claws and punches. Of course, they're bound to get tired after a minute or so of constant movement, but I need to get this done quickly.\n\n\"Oof.\" One grunts as you land a knee into his groin, he stumbles to your side, where a heavy-set Monk elbows at your ribs-- only to miss and be targeted by David, who was unsuccessfully trying to down a midget of a Zealot. Your ghoul manages to leap atop of him and .wrap his arms around the man's neck.\n\n\"What... happened.... to you... my.... friend...\" Are his last words.\n\nThe remaining monks still take up your time, giving quick jabs to your non-existent pressure points as you try to land a hit on them. The acrobats continue dodging, and you relentlessly continue, not hampered by mortal energy-consumption. They begin to slow, and your wild, badly-timed swings catch several of the surrounding monks, crushing their bones easily. Minutes passed, the only one standing is the sweating midget named, 'Miguel', who hopelessly kneels before you, \"O how the lord has bested us, taught us a lesson in humility in dream-form, he did. Wake us from this nightmare, O merciful God!\"\n\nYou punt him across the room, cackling as you do so.\n\nUnfortunately for yourself and David, you can hear sirens-- Ragnor has begun his siege. You look from around you, and in front of you appears a pruned old man, wearing a ceremonial blue robe and a skullcap, wielding a shining... silver cross? Only, upside-down... As a sword... Father Tomas stares at you with a surprisingly serene smile, considering what you did with his disciples. \"My monks did their part, do not worry, Vampire.\"\n\nMoments later, the old man throws his heavy rod with unreal accuracy and force, impaling your belly and opening it, spilling some gastric juices, but that's all. You feel your body convulsing as the holy metals sucks at your life force. You groan in pain, and kneel before the lord...\n\nIf only you finished this man earlier.\n\n\nYou have been killed by the hands of the Church.", "action_results": []}]}, {"action": "Enter the Zealot HQ.", "result": "As you warily near the steel entrance to the Zealot headquarters, David taps on your shoulder, silently beckoning you to follow him. You comply, and follow your ghoul to around the building, where, after going up several flights of metal stairs (making as little noise as possible), you find a molding wooden door, a nice change from the ugly metal and concrete which make up the rest of the City. Of course, aside from giving you a vague feeling of deja vu, it's also gives you an easy opening. David motions toward it. Now let's make some noise.\n\nYou remain careful in your last moments of anonymity, you try the golden knob- locked. Not wanting to jam it accidentally, you settle for setting up a roundhouse kick-- you twist your body, hold for a forceful kick, and push.\n\nThe power of your kick rips at the wood, leaving a splintered hole in the door's midsection, big enough for you to swiftly roll under-- David following. Inside, you find several Zealots playing cards around a round table. They are visibly stunned, and gape at you and your ghoul.\n\n\"David?\" One asks, jumping up from their seat. Not cutting them any lack, you run at the Zealot, decking him to the floor with a solid punch. David takes on another, kicking him from the side, toppling him and his metal chair over. With only two left, you quickly claw at the one holding his hands up, splashing the table with his blood. With your claws entrenched in the Zealot neck, you fling him at the other the one. He flies, and with another clang the other one catches him, only to topple over as well. You quickly finish off any of them even barely conscious, clawing at their throats for edible parts. After grazing, you begin to hear footsteps. Can't waste time.\n\n\"Where's the chief?\" You roar, energized from the scuffle. David eyes bounce from each of the three doors connecting to other parts of the building, struggling to remember.\n\n\"I'm the 'Chief', demonspawn.\" The door to the right opens, and there stands a tall, unusually garbed Zealot. Like most, he's tall, easily more than six feet and with navy blue armor with yellow lining, rather than the customary black and blue. He wears no mask, though his neck seems to be heavily guarded. Smart, but useless in my current state. \"Vampire, we knew you'd come, but we didn't expect you to corrupt one of our own,\" he glares at David, and readies a gleaming silver sword, \"Nor for you to attack us when we least expect it. But no matter, you both will die where you stand, for you deserve no mercy in this world.\"\n\nYour ghoul points at him, \"Yes, that's Katar, we need to be careful with him though...\" You nod, wondering how the best way to approach the enemy would be.", "action_results": [{"action": "Angrily lash out at him as Kelso taught you; end the fight quickly.", "result": "Barely letting him finish his speech, you lunge-- bringing the heel of your palm down near his jaw, only for him to deftly dodge out of the way. He shuffles several meters to the right, and raises his sword. He points at you, \"By God's glory, the dead will stay dead tonight.\" Quickly, he swipes with his blade, you dodging it by as little as a hair. You continue to bend your spine in ways you never imagined you could, but remain on the offensive by clawing at him at every chance you have.\n\nYou send a kick at his shin-- causing his knees to bend, and  charge him with all your body force, screeching and yelling like a cat. You lay on top of him, and begin mercilessly pounding his bearded face, before he manages to separate you and him just by his sword-- which you angrily rip out of his grip, only for it to clumsily flip and cut into your forehead. He takes advantage of this and kicks you off, coughing out blood and quickly running for his sword. You try to reach for it, to no avail. David, now certain you need his help, jumps on Katar's back, trying to strangle the elite Zealot. Even with David on his back, he's able to stab you with his sword while you're still baffled as to why you're not regenerating your wounds properly. The cold steel hacks at your bones, and you begin crying out in pain while the holy man continues to mock you. Once you're incapacitated, the now ear-less Karat flings David off of him, and beheads him in front of you, the glum expression ever-present on your ghoul's head. He doesn't even need to finish you off, and you feel your energy being drained out.\n\nOn the plus side, you did manage to end the fight relatively quickly.\n\n\nYou have been killed by the hands of the Church.", "action_results": []}, {"action": "Might have to be defensive, that sword doesn't look too friendly.", "result": "David watches, sure in your chances and not wanting to get in your way while you set up a defensive stance, planting your feet to the ground and readying your hands at the sides. Katar, parallel to you, closes the door behind him, and then raises his sword, pointing it at you. \"So, you fear God?\"\n\n\"Not in yours.\" You laugh back, maintaining composure. He's trying to get me off-guard, that's what this mad-man wants.\n\n\"Then perhaps you find fear in his servants instead, fool. Why else would you not attack me before I ready my blade? Katar slowly approaches you, his long sword only a quick-thrust away from your armored chest.\n\nYou don't feel the need to respond, instead focusing on his blade. You remember Kelso mentioning to you that you won't regenerate from silver-caused cuts, making this the most dangerous fight you've been in, yet. You can only hope that after you survive this, you can make sure the Church doesn't have too much silver lying about. They probably have some idea of whether it works or not, otherwise Katar wouldn't have a silver katana.\n\nThe aloof Zealot chuckles, \"Then this will be an easy fight.\" He holds his sword with both hands, winds up, and swings it at your midsection, expecting you to duck and die. Thankfully, you saw through the ruse, and sidestep, only to slam the sword with your gauntlet out of Karat's hands. Angrily, he punches at you, sending a gauntleted fist at your nose. You get pushed back, but feel alright after rubbing it with your metal-covered wrist. You send a boot at the man's shins, making his knees bend, giving you perfect reach for swinging at his head. You feel his skull from under his skin after the blow, and the Zealot is pushed several meters away-- right next to his sword! Even though Karat is coughing blood, he gets up, using the sword as a cane.\n\n\"COME AT ME, DEMON!\" The bearded man yells, raising his word once more.\n\nYou shake your head, not falling for it. He angrily charges for you, only to be sucker-punched and knocked out before he could swing.\n\nYou stare at the man, then spit. \"This pathetic being is the Chief?\"\n\n\"Second in command, actually. Chief is probably fighting Gideon right now. But really, I don't think you realize how close you were to dying back there.\"\n\n\"Huh?\"\n\nDavid touches at your nose, \"I think his gauntlet is partly silver, so I don't think you're nose will fix itself.\"\n\nBoth of you laugh. If the worst thing that happens to us is that we get broken noses, then we're doing pretty good. \"So what now?\"\n\n\"Well, before the rest of the Zealots appear, we should probably try to kill Father Tomas, in the Church. Or, we could clear out this building while we--\"\n\n\"It's not a question, we finish the mission. Ragnor and the rest can take care of themselves.\"\n\nAt that very moment, sirens begin to blare, and red lights beam on-and-off all over the HQ...", "action_results": [{"action": "Continue to the Church.", "result": "With the alarms already blaring you make sure not to waste time in getting out of the building and into the Church. Outside, swarms of Zealots are coming out of the Church's front doors, obviously en route to fight Ragnor and his Wolves. You and David mostly blend in enough to not be recognized as anything but Zealots and manage to swim past the incoming horde and through the next street, then up the concrete steps of the Church and right in front of the Chapel's gates..\n\n\"How should we enter, then?\"\n\n\"No backdoors to the Church. Only one direction if you follow God.\" David recites from behind you.\n\nYou consider trying to bash the door in, but decide that knocking it and waiting for the door to be opened by whoever's inside would be an easier solution for getting in.\n\nClang\n\nYour gauntlet taps at the metal. After a pause, you can hear noises on the inside of the Chapel, mostly worried murmuring. You quickly motion for David to go in front, right before a bald young man in ceremonial blue robe opens the door. In response to your ghoul's profile, the man just gapes for several moments before opening his mouth to speak. \"Dave?!?\"\n\n\"No... Not anymore.\" He states, walking into the Church. The man doesn't seem to even notice you, engrossed in seeing a living ghost instead. Inside, several other monks are gathered, all of them staring at David with awe. You take the opportunity to slink into the shadow, and wait.\n\n\"Behold! The blessed Lord brought our child back!\" They cry, waving their hands in the air in synchronization. Up and down their hands go, until one with a cowl speaks up, \"Brother David, where were you?\"\n\nYour ghoul stares at them with disdain, \"I got lost, but was found by a group of humans.\"\n\nThey continue to gape. The cowled-one continues his interrogation, \"Hmm? More humans, you say?\n\n\"Crazy enough, the humans were in our backyard this entire time. We just didn't recognize them.\"\n\n\"Whatever do you mean?\"\n\n\"The Wolves, Vadim. They're good people.\"\n\nGasps erupt, and David's only looks down to his feet, and his hands ball up to fists. \"They changed you, didn't they?\" The one with the cowl points, and begins to chant in some sort of language which you are unfamiliar with.\n\nBored of their religious, antics, you make your presence known by jumping out of the shadows, and decking 'Vadim' with a right hook, sending him to the middle of the crowd of twelve-or-so Monks. David nods, and sends a sharp kick to the nearest Zealot surrounding him. Before you know it, it becomes a rowdy brawl of fists.\n\nThe monks may be very agile, but without any weapons nor armor you figure you or even David could take them out alone.", "action_results": [null, {"action": "Leave David to get to the Father.", "result": "\"David, finish off these grunts as I find the big man upstairs.\" You call out, examining the building for the Father's Quarters.\n\nDavid nods, \"Up the stairs, to the left!\"\n\nYour head turns from right to left, looking for the set of stairs that will lead you to the Father. Finding the red-carpeted stairs, you begin your ascent, only to be stopped by a heavy-set Monk, who angrily shoves you backwards. \"Get away, foul demon!\"\n\nHe continues pushing, but you catch his left arm, and end squeeze-- Crack. He yells out in pain, and you manage to grab him by the cuff of his robe, only to throw him out of the way and into a wall. You run up the staircase, skipping steps to maintain speed. After reaching the end of the first staircase, you deftly,turn your body, not wasting any time by getting to the adjacent continuation of the stairs. Several leaps later, you reach the end of the stair case, only to be confronted by a terribly old man in a ceremonial blue robe, with a skullcap covering his no doubt balding head. His face is withered, and his frail eyes only compliment an extremely happy demeanor. This, you presume, is Father Tomas.\n\nHe stares at you, silent, and raises a large metallic cross from an opening of his robe, though he seems to be holding it the wrong way...\n\nWary of his silver weapon, you take a step to the side-- giving you room. \"Father Tomas, it seems that I have finally had the honor to meet you.\"\n\n\"No, the pleasure is mine, Vampire. Fate has brought it that it is my responsibility to put you down, as well as your canine friends.\"\n\nYou glare at him in anger, and flick at your wrist; claws out, you get into a battle-stance. He, in turn, raises his shimmering Cross, wielding it as a sword.\n\n\"I wouldn't put up a fight, if I were you. I know for a fact that you Creations can't heal from a wound of silver, and as such you have no otherworldly advantage over me.\"\n\nYou laugh, \"Except perhaps the age part.\"\n\nThe priest stops smiling and instead eyes you angrily, \"I suppose you'll learn the hard way. Now, let's make that broken nose something much more.. painful.\" Offended, you touch at your nose, is it really that noticeable?\n\nRegardless, he slowly begins to approach you, his sword, pulsating with some sort of unrecognizable energy, held high.\n\nYou make a quick examination of your surroundings: the stair case from behind you, doors and other hallways to your right, though several meters forward and to your left is a ledge, where there's an at least three-story drop down to the first floor, where you can see David slowly whittling off the Monks. Perhaps you can use the ledge to your advantage...\n\nYou continue to parallel the insane priest, your claws at your side and your wits still intact. You need to make the first move, but how should you go about it? The man looks old, but something about him tells you that he's more than capable of wielding his weapon masterfully. Still, you're probably quicker than him, and a quick fight is all you need. Then again, you need to watch out for the silver sword, because if he gets a solid hit on you then you're done.", "action_results": [null, null]}]}]}, {"action": "\"We come in, uh, peace?\"", "result": "You raise your hands in surrender, though still maintain a defensive composure. \"Listen, Katar, I have no interest in fighting you. We can settle this dispute with less blood if you could listen to me.\"\n\n\"I wonder if you gave them,\" he eyes the corpses in the room, \"the same offer.\"\n\n\"They have no authority in the Church, and the only way to make us stop peacefully is to comply with our demands.\"\n\n\"We don't negotiate with terrorists,\" he smirks, though you feel as if he's telling you to continue.\n\n\"You need to let us live alongside you and the other humans in this city, and we promise we won't hurt you unless you persecute us. Simple, right?\"\n\n\"There is no rest for the wicked.\" He states, drawing his sword. Well, that didn't help.\n\nDavid just watches, seemingly sure in your chances and not wanting to get in your way while you fight. You set up a defensive stance, planting your feet to the ground and readying your hands at the sides. He, parallel to you, closes the door behind him, and then raises his sword, pointing it at you. \"So, you fear God?\"\n\n\"Not in yours.\" You laugh back, maintaining composure. He's trying to get me off-guard, that's what this mad-man wants.\n\n\"Then perhaps you find fear in his servants instead, fool. Why else would you not attack me before I ready my blade? Katar slowly approaches you, his long sword only a lunge away from your armored chest.\n\nYou don't feel the need to respond, instead focusing on his blade. You remember Kelso mentioning to you that you won't regenerate from silver-caused cuts, making this the most dangerous fight you've been in, yet. You can only hope that after you survive this, you can make sure the Church doesn't have too much silver lying about. They probably have some idea of whether it works or not, otherwise Katar wouldn't have a silver katana.\n\nThe aloof Zealot chuckles, \"Then this will be an easy fight.\" He holds his sword with both hands, winds up, and swings it at your midsection, expecting you to duck and die. Thankfully, you saw through the ruse, and sidestep, only to slam the sword with your gauntlet out of Karat's hands. Angrily, he punches at you, sending a gauntleted fist at your nose. You get pushed back, but feel alright after rubbing it with your metal-covered wrist. You send a boot at the man's shins, making his knees bend, giving you perfect reach for swinging at his head. You feel his skull from under his skin after the blow, and the Zealot is pushed several meters away-- right next to his sword! Even though Karat is coughing blood, he gets up, using the sword as a cane.\n\n\"COME AT ME, DEMON!\" The bearded man yells, raising his word once more.\n\nYou shake your head, not falling for it. He angrily charges for you, only to be sucker-punched and knocked out before he could swing.\n\nYou stare at the man, then spit. \"This pathetic being is the Chief?\"\n\n\"Second in command, actually. Chief is probably fighting Gideon right now. But really, I don't think you realize how close you were to dying back there.\"\n\n\"Huh?\"\n\nDavid touches at your nose, \"I think his gauntlet is partly silver, so I don't think you're nose will fix itself.\"\n\nBoth of you laugh. If the worst thing that happens to us is that we get broken noses, then we're doing pretty good. \"So what now?\"\n\n\"Well, before the rest of the Zealots appear, we should probably try to kill Father Tomas, in the Church. Or, we could clear out this building while we--\"\n\n\"No, we need to finish our mission. The others will be able to deal with the remaining Zealots, easy.\"\n\nAt that very moment, sirens begin to blare, and red lights beam on-and-off all over the HQ...", "action_results": [null]}]}]}]}]}, {"action": "Training (Optional)", "result": "You have talked with Ragnor at length on how you'll be running your operation on the City. What you both want to do is extremely difficult, even with the combined power of all the Wolves. The only chance you have is if the less-experienced Wolves learn from the best-- Gideon, Ragnor, and you. Not necessarily in that order either, since you have no idea what a werewolf is capable in full-form, nor do you know how you rank between them or even how they rank between each-other. Gideon is terrifyingly muscular, but Ragnor seems to be much faster. Any sparring matches you've had with either seemed to be somewhat held-back, for whatever reason.\n\nStill, the main plan appears to be that, after some hand-picked scouts tell you three when the Zealots are coming, silently break through one of the cities defenses, and drop you in. While you cause mayhem inside the streets of the City, Gideon and Ragnor's two groups will be pushing through the City's walls, and fighting from in there. Supposedly the head of Church is an old man who runs the whole shebang, a certain, 'Father Tomas'. Once you kill him, the Church will be extremely vulnerable. After that? Well, you just hope the humans don't continue resisting, otherwise it'll be a slaughter.\n\nAlthough you're going in by yourself (and maybe David, for ironic reasons), you're still tasked to help train the other Creations with Ragnor and Gideon. Over the days, what was probably most exciting' (aside from the shock of lovely Cecilia turning into a hulking were-wolf) part was your sparring match with Gideon. You can't help but feel both of you held back, however slightly, but it was likely of great education value to the other Creations.\n\n\n\"Alright Vampy, give it all you got.\"\n\nHa, worry about yourself.\n\nYou stand, parallel to Gideon, in a surprisingly flat part of the desert. The other Creations surround you both stripped down to nothing but basic shirt and pants, readying yourselves for an honest fight. As ugly of a creature Gideon is, he really is a mellow guy, which makes you almost not want to get into any scuffle with him, even if it's ust sparring. Still, you ready yourself to attack. You flick out your wrist, causing claws to edge out. The crescent moon lies above you both, and the hunchback chuckles as he slowly moves toward you, shuffling one foot through the sand at a time. You took your time as well, starting with a brisk walk, turning that momentum into a jog, then using that into all-out sprinting...\n\nGideon suddenly stops, and holds his hands out to block your advancing. When you reach him, you bring a clawed hand down, hoping to catch his shoulder; you succeed, though he remains unfazed, grabbing at your ankles while you deftly try to flip over him; that doesn't work. His palms squeeze at your feet, and he slams you onto the sand, using his weight to force you down. Thankfully, the rush of adrenaline, allows you to overpower him, throwing him off you. Once again parallel, he decides it's hsi turn to claw at you and he aims a long-winded at your gut-- your body twists, barely letting it hit, though allowing you to bring your elbow down to his neck.\n\nHe falls to the floor with a slump, though seems to quickly recover by holding you by his feet. You fall down as well, though you catch yourself with a roll, and get right back up. Gideon, however, gets up as Gideon no longer.\n\nIt was the first time you saw Gideon in his were-form. Massive, with a snout longer than an arm, silvery fangs almost as large as the L-bayonet itself, and white fur overlaying his entire body. You've seen other werewolves turn, but it's obvious why Gideon is the alpha-wolf around here. While you marvel at the werewolf, he sends a massive fist to crash down on you-- but you quickly jump out of the way. Unsure what you can do, you turn to your own fangs; they aren't nearly as powerful as his, but they have other uses other than killing. Gideon continuously deals out attacks, and you manage to dodge nearly all of them, only a couple giving you scrapes. The Wolf leaps at you, waving all of it's bulking appendages in your direction. As it nears closer to you, you see an opening...\n\nYou took a leap of faith, catching Gideon in the neck with your own fangs. It was only the next morning when you woke, moved to the hideout once more.\n\n\"That was an epic fight.\" One of the teen-wolves say, glaring at you in awe. Gideon was to the side of your bed, sitting up and laughing.\n\n\"Very good, Vampy. Nice use of your abilities, those fangs exhaust people way easy, even those pumped up on canine-adrenaline. Crazy effective. You hear that, Wolves? Someone who knows the full-outset of their abilities is a dangerous fellow.\"\n\n\nAnd that's how you remember it. Even though Gideon helped train the Wolves to fight, you worry about him. He doesn't seem too enthusiastic about taking over the city. Hopefully he changes his mind soon...", "action_results": [null]}, {"action": "Ragnor's tale.", "result": "\"Hey Vamp, take a seat.\" Ragnor calls out, waving you over to the off-kilter wooden bench he's sitting on. You comply; after several days and nights with barely any breaks, even sitting down to converse with the balding man who broke your Ghoul's neck sounds appealing. Plus, he can't exactly complain about not getting work done if he's taking a breather as well. If there's one thing you know about Ragnor, it's that he hates the Church more than anything. Except maybe the Professor; you've never really talked with him that much, after all. The cloaked man smiles at you, and helps sit you down with a heavy hand clutching onto your shoulder. \"Hey man, I'm really glad you joined us,\" he begins, taking his arm off of you and bringing it in front for a handshake; you respond in kind.\n\n\"Not as glad as I am to have joined.\" You laugh, releasing.\n\n\"Don't be so sure. It was getting rather stale, just hiding out in a bunker until we run out of food. You've given us something to strive for.\"\n\n\"Fighting the Church?\"\n\n\"Yeah.\" He nods, pauses, then shows out his palms to you in a waving motion, \"I know, I know. Gideon's not exactly fond of it, but if it comes down to us and them, I vote us.\" Ragnor laughs. \"You know, the moment you said that the Church is planning to destroy us, I already was planning on trying to overthrow the city.\"\n\n\"You seemed very confident about it.\" You nod, rubbing at your chin, \"But why?\"\n\n\"So that we have a stronghold strong enough that we won't be able to be exterminated that easily. We're a small group, the Creations. And it's not exactly a growing population either, at best you can ghoul whatever, but we can't breed normally. It takes more time for it to work, you know...\"\n\nYou raise an eyebrow, amused, \"You've tried?\"\n\n\"Ha, back when I was practically mind-controlled by the Professor, yeah. Heck, he probably tried things with you while you were unconscious, but who knows? Life before civilization fell was much different than now. The bastard wanted to create a new specie of man, and instead he got Hollywood monsters with bad skin conditions.\" He shrugs, \"But in some ways he succeeded, and I think that the Church shouldn't be allowed to hunt us down for it's own sake. There are some good kids in our pack, you know. Just honest-to-god decent kids that the Church wants to put down. It's not right.\"\n\n\"So what will you be doing if you suceed?\"\n\n\"Hunt down the Professor, definitely. The Church may be corrupt, but the root of the evil afflicted to the world spawned from that one man. After we end the Church in the nearby city, then we'll be able to be in charge.\"\n\n\"You seem confident that a couple of Creations can take on hundreds of Zealots.\"\n\nRagnor looks at you with a wry grin, \"You seem to be under a false-impression-- there really aren't that many Zealots. Can't be. The city they have is large, but only in comparison to other strongholds. Zealots are almost always male, if only because armor-fitting females is different, and they're probably sparse on metal. Plus, only able-bodied men can wield those huge-ass rifles. I'd say they have 200 Zealots tops, and that's not including how many you've just killed. Furthermore, they'll be divided while they march to our hideout and...\"\n\n\"That's still a lot.\"\n\nHe shrugs, \"As Wolves, we can shift either at will or automatically when stimulated luminescent orbs for some reason, into huge were-beasts. With proficiency, we can prove to be the fastest and most lethal things left on the planet. If, this week, we can train the kids to use their powers well, then it's definitely doable.\"\n\n\"You sure Gideon's okay with it?\" You ask, wondering whether you'll be joining him for sure,\n\n\"Regardless of what Gideon thinks about it, I won't be taking everybody with me, that's too much of a risk, and I doubt I could convince everybody, but...\"\n\nYou shrug, changing the subject, \"How experienced are you at your abilities?\"\n\n\"Enough.\"\n\n\"You think you can take me on?\" You ask, leaning forward and balancing your body on your palms.\n\n\"Maybe. I kind of figure the Vampire Creations were made in order to build foundations for the Professor. They can live forever, create progeny of sorts, etc. I have no idea how combat ready they are. Still, you're extremely resourceful, so I definitely hope you stick around. With your ghouling powers, we can create an entire civilization of Creations. Imagine how great that'd be!\"\n\n\"I'll be honest, Ragnor; you didn't seem so cheery when I first met you.\"\n\n\"When you first met me I had to make a good impression.\" He laughs. \"Now, come on, we need to get back to training the cubs.\"", "action_results": [null]}, {"action": "Gideon's tale.", "result": "Hours pass quicker than you'd want during the training sessions. You've realized that the Wolves are powerful, but undisciplined, almost childish at times. But at the end of the night, you got work done. Yet, even after the night passes, Gideon routinely goes under the hatch. You've tried to peek at him, in interest of what he does when alone, but it brings no more results than asking around; zilch. But on one of those times you spend upside down, silently hanging from the hatch, Gideon turns around to acknowledge you.\n\nThe hunchbacked leader stares back at you with cold eyes, \"What do you want, lad? You think it's possible I really do just like sitting down here, alone?\"\n\nShocked, you suddenly lose your grip; only to land upright, as a cat would. \"I, uh, maybe. But I've asked around, and people wonder about you, as I do. You're very... Silent, for a leader.\"\n\nHe laughs, \"Leader? Hah, that's good, Vampire. I just do the heavy work, as always. Keeping watch is one of my duties.\"\n\n\"Don't put yourself down, Gideon. You seem to know what you're doing.\" You say, unsure how to respond to his glumness.\n\n\"Vamp, the camp here believes you-- and that's fine by me, I'll be honest and say I trust you too, but the fact that we'll be fighting the Church isn't a good thing, regardless of the rewards.\"\n\n\"Like our lives?\"\n\n\"You're young and timeless, so it's not something you can really sympathize with.\" Gideon snorts, \"No offense, Vamp.\"\n\n\"None taken, but what do you mean?\" You say, letting him continue.\n\n \"I don't think you really get what the Church is. I mean, I don't think anybody here does. Even Ragnor, he's blinded by rage and fury. He believes that the Church needs to be destroyed for the betterment of everyone, especially us. But...\"\n\n\"But what?\" By now you're getting a bit agitated at Gideon for being so ambiguous.\n\nHe turns his face away, \"But he's dead wrong about it. Almost all of us here remember the treatments the Professor gave us. To say the least, you're lucky to have forgotten most, if not all of them. That man just bred hatred, even more than the religious back in the day.\" A pause. \"He hurt us all, in so many ways. But worse yet, he made us hurt others. It started with killing evil, but then came to killing innocents, the only food-source left for us. And we followed him through fire and water, that man. Kurschner represented our hopes and dreams, true power for a true purpose. But he lied to us, and used us for himself, experimented with us, made sure our past lives weren't there so that there was nothing for us to go back to. Even I don't remember too much of what was before I became a Wolf. The dreams stop after you get comfortable in your form.\"\n\nThe older gentlemen continues, \"By the way, are you still dreaming?\"\n\n\"Uh...\" You begin to realize that you indeed have stopped dreaming since you joined, \"No, I rest much better now.\"\n\nHe frowns in return, \"Best not get too comfortable here, then. Those dreams are your only way to know what is really going on.\"\n\n\"Which also reminds me, did you have somebody help you get out of the Facility before it was burnt down?\"\n\n\"Err, yes.\" You nervously answer.\n\n\"Did he have a name?\"\n\n\"Kelso.\"\n\n\"Who?\"\n\n\"Ahem, uh, Kelso.\" You repeat, slower this time. \"He said he knew you. Also mentioned a fellow named Stein.\"\n\nGideon bites his lip, \"Never met a fellow named Kelso. Did he say anything else?\"\n\n\"He mentioned being tasked with watching the Lesser Creations, along with several other elites.\"\n\n\"That explains it, though I can't say I know who he is under his new pseudo-name. I wonder where he is now...\"\n\n\"I wish I knew, \" you say, longingly, \"he said he'd come back at some point, he was searching for the Professor.\"\n\n\"As do we all.\" Gideon says, closing his eyes, \"Simon Kurschner was one evil, however brilliant man. A lot of our older members ran out in hopes to hunt him down, though they never returned...\"", "action_results": [null]}]}, {"action": "Agree with Gideon.", "result": "You sigh, somewhat content with the ability to choose for your group. \"I agree with Gideon-- defending is probably the best option. After all, the humans... Even if they hate us, they aren't our real enemy right now.\" Gideon grins, and slaps you on the back. Ragnor shrugs, and heads to a splintered cabinet in the back of the room. He comes back with several cans, accurately labeled as 'beer'. With a grin, he begins handing them out to the 'adults' in the room and you. \"Rest on the floor, Vamp. Today is a day of celebration, a joiner to our brood!\"\n\nWith some large chants, Ragnor clicks open the can, and begins handing it to you. As you reach to take it, he immediately withdraws it. He lays it on the floor in front of you, then proceeds to bring a clawed index finger to his wrist above the can, poking deeply into it and letting blood slowly drip into the can.\n\n\"Hah, I forgot you can't really taste anything but blood. Don't worry though, this'll get you high on no one's expense, Vamp, enjoy yourself.\"\n\nYou laugh, scratching at your head for forgetting. You accept the bloody beer; while it's nothing compared to full blood, it's the most happy you've been since you got out of the Facility. It's nice to be part of a family. You and the rest of the Creations laugh and discuss the 'happenings' of the current world. You can't add much, but the leaders of the Wolves' collective stories are fascinating in their own rights, though. On top of it all, you think you've really hit it off with Cecilia-- the blonde Wolf.\n\n\nThe next couple of days fly by...", "action_results": [{"action": "Defending the Stronghold.", "result": "The next week involved quite a bit of socializing and preparation for the big day. Night by night you trained, and although the week didn't give you as much time as you wanted, it gave you enough to get a feel for the Wolves, make a start with the community, and most importantly, teach the young ones how to harness their frustration into power. Power, that will hopefully be enough to block the Zealots off, and beat them by matter of attrition.\n\nYou feel as though you've gotten on pretty good terms with both Gideon and Ragnor, both of whom are simply great guys. You've noticed that, despite their differing ideologies, they have utmost respect for each-other, which is rather pleasant to see. Something that always lay at the back of your mind, though, was that Ragnor claimed that he was going to raid the City, regardless of what choice the group took, but you never understood that. How was he going to do that without support?\n\nStill, the only thing you really feel sad about is the lack of time you were able to have with Cecilia. Even though you've trained together, you really wish you could have talked to her more often, about things other than unleashing her concealed persona: the werewolf. But, you manage to keep yourself jovial enough knowing that if you succeed at stopping the Zealot onslaught, you'll have all the time in the world with your new love. Additionally, you might even be able to learn how to read the mysterious hieroglyphs when times of peace are near.\n\nBright lights ahead, but you just have to reach it.\n\nAs the week passes, you all begin sitting in a circle daily, discussing the plan thoroughly, and then send out scouts to see if the Zealots are sending their men to raid your headquarters. The plan is simple; when you are alerted of the Zealot present, you will block off the entrance with any object available, then hide in secluded corners in the dark maze that is the well, and slowly pick off the Zealots as they pass.\n\nToday is one of those days, and you are warily waiting for the knock from the scouts. Any day now, the Zealots should be coming. Time passes; you do this twice a day, once in the morning and once in the evening, to see if they're preparing for a night-attack or not. You hope it's at night, as the Creations would have an advantage, probably. Additionally, you wouldn't have to worry about sun-tan lotion, the tube Kelso gave you will run out sooner or later. And so you wait, everybody around you waiting in silence.\n\nYou hear the codified knock: Clunk-clunk-clunk.\n\nSomeone lets out a sigh-- today isn't the day.\n\nYou go out to train once more, reviewing everything, and then turning back to refill on blood. Gideon gives you a broken plastic-cup with maybe an ounce of his blood. You drink it slowly, savoring the taste. It reinvigorates you, like usual, and you set down to meditate, waiting for nightfall.\n\nThat night...\n\nClunk-clunk-clunk-clunk\n\nThat's 4... Is tonight the night?\n\nRagnor's head poking out of the hatch confirms it, \"Everybody, wake up, now!\" Hearing this everybody assembles, bringing out spare Zealot armors and weapons. Indeed, even you're surprised by their efficiency tonight.\n\n\"Alright Wolves, tonight, we defend our home!\" You announce, pumping your fist.\n\nHowever, unlike most of your announcements, nobody but Gideon roars in applause. Ragnor approaches you with a laugh, \"Sorry bud, I think we're making ourselves a new home, tonight.\"\n\n\"Huh?\" You look around and it seems obvious that everybody but you and Gideon know what's going on.\n\nCecilia turns to you with a frown, \"Sorry, love... but I can't live in this shit-hole any longer. I just... think it's time we took a stand. You understand, right?\"\n\nGideon moves into the fray, sticking his finger into the taller man's chest, \"What do you think you're doing, Ragnor? We, deh group, made a decision!\"\n\nRagnor stares back at the hunchback, \"Yes, and I made a re-vote, without the peer pressure the group is used to. Turns out, they trust the Church much less than you do, and think that surviving well is better than just surviving, uncertain if they'll get a next meal. We can be the new Human-race: 'Homo-Creatio,' us, the Wolves, Gideon. Think about it!\"\n\nGideon just spits in disgust, \"You fool! This is NOT how we're supposed to get continue! Ragnor, the humans \"aren't much worse than we are, for there outlook is for survival as well. We can merge with them after showing how similar we are by not slaughtering them in their City!\"\n\n\"I don't think so, friend. But if I were either of you, I'd join us for survival's sake only, no way can you survive the oncoming Zealots. I saw them-- several groups of ten and covering ground right now. It's either join us or meet your doom.\"\n\nYou look at Gideon, and his dark eyes just blink out, \"Don't.\"\n\n\nWhat it comes to, in the end, is whether you wish to join Ragnor and the rest to assault the city or stay by Gideon, alone and at the mercy of the incoming horde.", "action_results": [{"action": "Join Ragnor and the rest, to conquer the City as your own.", "result": "\"I'm glad you made the right choice, Vamp.\" Ragnor beams, and Cecilia gives you an excited thumbs-up. Gideon, on the other hand, simple glares at Ragnor, shakes his head, and takes a seat on a broken bench. \"You sure you don't want to reconsider?\" Ragnor asks, rubbing at his chin.\n\nGideon makes no answer.\n\n\"Forget it.\" He waves his hand, \"Alright, guys, let's do this!\" You all clamber out of the hatch and out of the well. The starry night opens up from above you and the darkness gives light to other matters. The Zealots, no doubt very ritualistic, are maintaining their flashing armor, which you vaguely make out from several miles away. You point them out to Ragnor, and he makes note of them.\n\n\"That's a lot of Zealots on their way, I hope they don't have that much more fortifying the inside. Ragnor, do you have a plan for this?\"\n\n\"Yeah.\" The Wolf grunts, scratching at his head furiously. \"God damnit! If Gideon came, he could have lead a group, and we'd have two solid teams, flanking the enemy fortress.\"\n\n\"Can't I lead?\" You ask, uncertain of his plan.\n\n\"You could, but that'd be a waste of you're abilities. We're going to send you inside of it, where you'll be trying to assassinate the leaders of the Zealots. That way our assault can succeed in their confusion.\"\n\n\"Okay...\" You nod, trying to visualize your role in this plan, \"So what about David?\"\n\n\"David isn't exactly a leading-personality.\"\n\n\"He knows what he's doing.\"\n\n\"Which is why he should come with you! He'd be much more useful by you than with us. We're just giving you time. We can have one of the other Wolves lead, but for now you will no doubt need help, and a former Zealot who knows the inner working of the compound is just perfect.\"", "action_results": [null, null]}, {"action": "Stand by Gideon.", "result": "You take a step back, standing by Gideon's side. \"I'm sorry too, Ragnor. But I simply don't think think this is the way to go.\"\n\nRagnor stares back at you intently, before shrugging, \"Alright then, Vamp. I'm not going to force either of you. But what about your ghoul?\"\n\n\"David?\" You look around, searching for him. He is currently standing stiff by Ragnor's side, parallel to you. You're surprised you didn't take note of this already.\n\n\"Yeah. I've talked to him, and he seems to sympathize with our cause. But, since I still more than an iota of respect for you,\" Ragnor pauses, giving you time to understand, \"I'd rather not cause strife from after death between us. So, may I ask for you to allow him to come with us?\"\n\nWith a deep breath, you firmly reply back, \"If he really wants to go, then he can follow you to oblivion.\"\n\n\"That is all I want from you, Vamp. See you in whatever hell we end up in, eh?\" He smiles and takes a hand out to shake.\n\nYou wave him goodbye, but don't shake, \"See you on the flip side, man. Good luck.\"\n\nRagnor suddenly stands with a more serious attitude, and turns to leave, the Wolf Encampment. Within minutes, Gideon and you are alone. Silence dominates the room for a long while before you speak up.\n\n\"Gideon, the Zealots are on their way right now. What are we going to do?\"\n\nThe hunchback takes his time finding a nice seat to reply from on, \"Convince them.\"\n\n\"Convince them of what?\" You ask, baffled.\n\n\"Convince them that we're the least of their worries.\"\n\n\"You mean sabotage the assault?\"\n\n\"Of course. You have a better idea?\"\n\n\"... I can't say, yet. But I can tell you one thing, none of my plans would ever include the possibility of leading the Zealots to kill our brothers!\" You bring your palm to your brow, \"Seriously, Gideon, what kind of idea is that?\"\n\n\"One that preserves the sanctity of life that doesn't leech off of others'.\"\n\n\"And you don't think they'll turn right around to kill us?\"\n\n\"Hey, if you can convince them we aren't actually Demons from outer space, then we should try that out first, but for now I'm satisfied with dying with the knowledge that I helped save the human race.\"", "action_results": [{"action": "Try to bring attention to Ragnor's groups.", "result": "\"So you think the only feasible plan would be to divert there attention for the moment?\" You frown, uncertain. The other option wouldn't make too much sense, considering that you fought with the Zealot army not too long ago, but this plan seems... distasteful, unattractive. You're betraying your brethren for those who believe you to be nothing more than a monster, people who believe that anything you do is without reason; good or bad, all mindless mistakes carried out by the Devil himself.\n\nIt's a scary thought to you-- people believe that about Gideon and me. While I'm not squeaky clean by any means, at least Gideon is willing to throw away everything just to save them!\n\nGideon begins to shuffle towards the hatch, \"Come on, Vampire. We need to get the message out any way we can.\"\n\n\"Well, we still have a Walkie-Talkie that's probably useable.\"\n\nHe turns back to face you, and his eyes widen, \"What? We do?\"\n\n\"Y-yeah...\" You reply, beginning to scavenge through the various in nicknacks the Wolves kept, and finding David's transceiver under the mess. \"Nigh certain it still works, too.\"\n\nHe throws his hands up in return, \"Then let's do that, genius.\" You grasp the radio firmly in your hand and get a vague feeling déjà vu as you once again dial it to the Zealot-channel. Click. It's on, sounding out static. You interrupt it with an additional button push when Gideon swiftly grabs it out of your hands. \"What the hell, man!\"\n\n\"I'm doing this.\" Gideon states, still pushing the button. \"Zealots, do you hear this?\"\n\nThe cool, female voice is back, \"Err, hello?\"\n\n\"This is Wolf-leader Gideon, Ma'am. I need you to call off the Zealots attacking our base, for your own sake.\"\n\n\"Um, we don't negotiate with evil, sir.\"\n\n\"No! God damnit Ma'am, I'm warning you because there are only two of us left in the hideout, the rest are on their way to attack your City right now!\"\n\nA pause. \"We will look into it, then. Thank you for notifying us, whatever you are.\" You aren't able to identify her tone that well, but you hope it isn't sarcasm. Either way, she doesn't respond to Gideon's next reply, \"Thank you.\"\n\nThe two of you sit down on a broken couch, unsure how to proceed further. \"So, if they still raid our stronghold, it's over for us?\"\n\n\"... Yeah. The way I see it, the best case scenario is that all the Wolves are wiped out by the C.E. Strike Force on the way. I just hope they find Ragnor and the rest after they get us.\"\n\n\"And you're okay with this?\" You shout, baffled by this still.\n\nHe doesn't answer.", "action_results": [{"action": "Try to contact the incoming Zealots directly and try to get them to sympathize.", "result": "With amazing agility, you turn around to send a powerful roundhouse kick to Gideon, making powerful impact-- just enough to have him on the floor, but not hurt too bad. Meanwhile, you grab the fallen transceiver and angrily scold him, \"What is the hell is matter with you, Gideon?\"\n\nHe doesn't respond, though he sits cross-legged on the floor, staring at the floor as a child would. You sigh, and try your own plan at survival.\n\nClick\n\nYou push the button in, too anxious to wait for the crackling static, \"Quick, Ma'am, what's the Zealot's Combat Channel?\"\n\nIt's the cool female voice, again, \"Channel 40, why? Who is this?\"\n\nBut you're already flipping the channels. Now, from 13 to 40...\n\nGideon sits up groggily, and watches you in silence.\n\n\"Incoming Zealots!\" You announce, then release the button, and wait.\n\nA heavy, though articulate-sounding voice replies from the other end, \"This is Chief. Who is this?\"\n\n\"Friends. Or, at least, those who want to be. We are the last Creations around, and we want to talk to you.\"\n\n\"What do you wish to speak about, Demons?\"\n\n\"Mostly about your usage of that term. We want peace, nothing else.\"\n\n\"Huh?\"\n\n\"We- we know you're coming for us and our hideout. But we don't want to fight.\"\n\nYou wait several moments for him to answer. \"Give me your name first.\"\n\n\"Err, Vamp.\"\n\nGideon chuckles nervously in the background.\n\nThe man named 'Chief' gives a heavy sigh, \"Right. And how do you want your meeting to be set up?\"\n\n\"Any sort of meeting that doesn't include me being shot or speared by your guns sounds good.\"\n\n\"Funny. If you actually wish to do this then I'd wait outside for us to come.\"\n\n\"I... Think you misunderstand.\" You reply, rather certain about Chief's false attempt to mislead you, \"Trying to kill us will not work out well for you. There are other Creations, actual evil ones that are heading for your city right now. If you don't stop them then you're city will be lost.\"\n\nStatic for a while. \"Why do you not tell me this sooner?\"\n\n\"... Do you even believe me?\"\n\n\"Perhaps,\" he says, \"We may send scout teams to check. But for now I'm interested in what you want to speak about. Are you a man of your word?\"\n\n\"I try.\"\n\n\"Hmm...\" Chief pauses, his low-voice ending awkwardly, \"Give us ten minutes.\"\n\nWhile you wait for him, Gideon just laughs, \"I swear, vamp, if you pull this off then I swear...\" He gets up with a wry smile.\n\n\"Let's just hope their scouts get good information.\" You reply, ironically trying to be as optimistic as possible. The chances are slim, but you think this could work out with your unlife intact.\n\nTime passes, and while you didn't count how much you still worry that they may have ditched messaging and are just continuing their march to this area.\n\n\"Vamp, are you still there?\"\n\nYou get out of your day-dream and push the button back to reply, \"Yes.\"\n\n\"It... Seems you're right that at there are a band of unknown beings several miles behind us. But this doesn't mean as much as you would hope.\"\n\n\"Oh?\"\n\n\"How many of you are there in all? What if there are actually much more Creations at your base?\"\n\nA reasonable suspicion,  \"Then that's problematic for you. But I'd wager that your guys won't be able to take on the ten-or-so of the Creations on the way. So I think getting them first should be more important.\"\n\n\"Ah, but that is a good diversion for ten others to bypass us, eh?\"\n\nUgh. You bring a palm to your brow, uncertain how to answer the perhaps rightfully paranoid commander.\n\nHe continues, \"Still, you bring a solid point. I think you underestimate our capabilities, however. We will deal with both problems, but for now, how do you wish to meet?\"\n\n\"I assume you know how to enter the well, correct?\"\n\n\"Yes, we have figured out your trick.\"\n\n\"... Right, well, send yourself and several of your best man down there and we'll talk. There are only two Creations here, but I assure you we can defend ourselves from whatever harm you might wish to inflict on us.\"\n\n\"We'll be there.\"\n\nAnd... Off.\n\nGideon looks to you, \"What now, Vampire?\"", "action_results": [{"action": "Prepare the meet-and-greet and hope for the best.", "result": "\"We prepare by meeting them at the bottom of the well, like good hosts,\" you reply with a laugh, \"If they kill us then they kill us, if they don't then we have a chance at surviving.\"\n\nGideon sighs, \"You think they'll be able to stop Ragnor and his men, at least?\"\n\n\"The Zealot name, 'Chief' seemed confident, but I doubt it. In Wolf-form, the Wolves can easily rip apart anyone in seconds, regardless of armor. Unless they send more than half of their troops all the way back to fortify the city then they have an issue.\"\n\n\"Let's hope they do.\" Gideon says with a frown. Well, you can go hope by yourself, Gideon. I'm hoping we both survive this ordeal.\n\nThe two of you wait for a while, unsure how to proceed. Eventually, you both head down the hatch and into the concrete cavern that is under the well. You make your way past the claw-scratches and to the end, where you notice Ragnor thoughtfully closed the plate from on top, instead of leaving it open.\n\n\"This is it, Gideon. Our moment of truth.\" You begin to say, trying to start a conversation.\n\nThe hunchback just nods in return, staring upwards to the closed opening, waiting.\n\nMany minutes pass-by, and when something like an hour passes you wonder whether they abandoned raiding the base at all. You idly stand, shaking in place.\n\nSand slowly begins to pour out of the holes  the plate, the the miniscule dots sprinkling on top of both you and Gideon. Soon, a vague blue light begins to peek in, and you know that the Zealots are here.\n\nYou hear a crackling thud, and soon the plate is kicked over and you notice several flashing figures hunching over the well.\n\n\"You there, below. You are, 'Vamp'?\"\n\n\"One and the same.\" You call back, \"The man beside me is Gideon. You wish to come inside?\"\n\nYou see some finger pointing from the three men surrounding the well, and one extremely built character jumps from the top of the well, using his armor as a brake by trying to grab onto the surrounding wall. You laugh inside, realizing that he obviously didn't notice the ledges on the other side of the cylindrical opening.\n\nThe man takes off his helmet, and what you see surprising you, though you;re not sure why. \"I am the Chief.\" The dark-skinned individual introduces himself, bowing slightly. \"I have brought exactly 32 men here, and the rest to find and kill the Demons approaching the City. Now, what do you want, both of you?\"\n\nGideon stares at the man with a wide smile, though he doesn't speak. You sigh once again, \"We want you to not kill us, to be frank.\"\n\nChief laughs, and calls upwards, \"Samuel, Zadok, come down and meet these two... Gentleman.\"\n\nSoon after he announces it, the two men watching from above the well jump in from behind Chief, crashing into the concrete with a loud crack. The dust settles, and the man continues, \"The two of you don't seem too bad, but even the Devil can act gracious-- but that's acting. How can you prove to us that you're actually willing of redemption? How can I trust you?\"\n\nThe two men behind him near, and although they aren't quite up to his size, they don't seem nearly as friendly.\n\n\"Well, for one, we warned you about the other Creations... Wait, how much men did you send to apprehend them?\"\n\n\"Truth.\" He nods, \"30, why?\"\n\nThat's 13 Creations against 30 mortals; they'll be slaughtered... You consider how to answer, but Gideon interjects, \"Chief, the Wolves on their way aren't pushovers.\"\n\n\"And neither are our soldiers.\"\n\n\"No,\" Gideon continues, \"I've seen their leader in action. He is merciless and faster than anything you've ever seen. Your precious City won't hold up!\"\n\nFor the first time, Chief seems alarmed, \"Wait... You are the only De-- Creations here?\"\n\n\"Yeah. We have no time to waste, then. If you want our support in saving the city, then we'll need your promise of being vouched for.\" You state firmly.\n\nChief nods, while the others watch you both, silent. \"You got it. Now let's get get back, before it's too late!\"\n\n\"Alright then,\" you say, \"Let's get out of here while we can.\" To show them the way, you rush ahead, using the ledges to climb. Gideon and the Zealots follow you up, where you find a horde of patient Zealots, waiting for orders.\n\nChief raises his hands and yells, \"RETREAT BACK TO THE CITY, NOW!\"\n\nThe Zealots' formation quickly changes and you begin your march to the city, hoping you get there in time...", "action_results": [{"action": "Epilogue.", "result": "With silent haste, the troops march back to the City. The Chief's strict protocol helps bring the scattered clusters into more orderly groups walking in a rectangular form. You cover plenty of ground in a short amount of time, but the tension builds when a scout comes back with no report on where the Wolves are. By the time you all reach the City, it's darker than it seemed before...\n\nChief motions over to you, \"You see, there?\" He points to a corner of the City's hexagonal circumference, \"The Sentries would usually be commandeering a light. But I don't see them now.\" He pauses to think, then speaks out in his powerful voice, \"Enter Church-City in five groups of six! Never lose sight of a team member and ALWAYS watch your back. Also, remember to turn off your armor's flash. Now move out!\"\n\nImmediately, the Zealots begin to cluster together, forming the teams, and spreading out and marching into the City. Before his new team begins to enter the City, Chief brings you and Gideon over, \"Now, how shall we stop the Creations inside?\"\n\nGideon replies, \"Especially now in the darkness, it'll be hard to defend against them. But otherwise it's find and then kill. Hope for the best, I suppose.\"\n\nYou don't have a much better answer. You can see that everybody on Chief's team is equipped with silver weapons, and that's the only weakness you know about. It all boils down to how much Wolves and Zealots are left inside.\n\nWith a sigh, Chief begins to lead his crew into the City while you and Gideon follow. Even in the darkness the City looks spectacularly flashy-- almost everything made of a flashy metal, with neon lights flashing up every corner. The clanging of metal boots on the harsh concrete makes any attempt of stealth completely pointless, but that doesn't seem to be the Zealot-style anyway. If anything, it looks like your team is looking for a fight. But, after marching through the otherwise quiet streets with no conflict, the group begins to relax slightly. Chief takes out his transceiver, and you can hear some muffled sounds coming from him-- but no response. You look around to notice only another group in a parallel street, but you don't see anybody else. \n\nSeveral minutes pass, \"Bizarre,\" Chief starts, \"Only one out of the four other groups are responding. You think...\" He trails off, but suddenly the world becomes more tense, and you all remain on high alert.\n\nOut of nowhere, a huge blonde beast smashes through the metal door of what you can only suppose is a Church. The massive hulking figure is leaves a literal rip in the opening, and appears to be bleeding from the mouth-- though you're pretty certain it's not from itself. The werewolf stares in your direction, hungrily, and slowly begins to advance.\n\nTerrified, the Zealots in your group begin to open-lightning on it-- though it doesn't appear to faze it in any way, aside from scorching its fur.\n\n\"Cecilia?\" You yell, trying to distract it by waving your arms in the air. The beast pauses, but then continues pouncing in your direction. You quickly run up to it, and bring all your might into an air-splitting punch at the wolf's protruding jaw. It doubles over, but not before, in an act of desperation, making a huge swipe for the Zealots trying to spear it; about three Zealots were flung  several meters into the air and back to the floor, only not to wake up. Chief manages to sink the tusks of his rifle into the horrid beast before she turns back into your would-be lover-- Cecilia.\n\nYou spit, trying to make sure your emotions don't meddle with this. We must take back the City, for humanity's sake.\n\nBy now, even the other Group appears to not be responding... \"Vampire... We aren't going to win this fight.\" Chief confesses, clutching at his healthy chest. \"What do we do now?\"\n\n\"You don't know that, Chief. There can't be too many Wolves left...\" You reply slowly. As expected, the heavy bounding of paws is heard, and a black Werewolf, standing on its hind legs stares at the remaining of your group with its ruby eyes-- Gideon, Chief, and yourself. The surviving Zealots fled, no doubt to be killed by Ragnor: the black Wolf. With a horrible shriek of a howl, the Wolf slams it's paw into Chief, hitting awkwardly as he tries to dodge though sending him back long enough for the Wolf to focus on you, grabbing you with its paws-- digging his claws into your skin, and throwing your bleeding corpse almost an entire street.\n\nYour body cuts itself on the concrete, and even though it heals itself you can feel the pain of a dislocated shoulder and a broken wrist and several ribs. You manage to get up, albeit slowly, only to witness an Albino Wolf wrestling with a darker one, both relatively similar mass but different in proportion. The white one (Gideon) seems to be shorter, though more muscular, while the stygian Wolf (Ragnor) manages to be taller and much more overbearing; much like how they are in their regular forms.\n\nYou run towards Ragnor, hoping to help Gideon out in the fight, but the white monster eyes you while it struggles against the darker one, it barks in your direction, as if telling you to get the hell out of this while they duke it out. As Ragnor sinks his teeth into Gideon shoulder, a horrible howl is let out-- and it soon becomes apparent that Gideon it outmatched.\n\nTaken aback, you meekly help the Chief up-- who's mesmerized by the masochistic display going on by the two forces at work. Gideon grasps the younger wolf by its throat, and manages to get on top in the scuffle. The two continue to exchange blows, blood squirting out into the floor, until... Gideon slows down, and with a final, angry bark-- he is killed.\n\nRagnor feasts on his killed with a hungry lust; ripping at his enemy's fleshy neck, and happily ripping out and crunching on whatever bones he finds. While Chief continues to blankly stare, you decide that its time you took action on Ragnor, and with the rage built inside of you, the death of Gideon; the one honestly good person you've met, manage to take the Wolf off-guard with a bull-rush. You sink your own claws into the wolf-man's throat, hacking into it. The heavier and stronger animal attempts to crush your midsection with its bare hands before you can kill it, but your swipes prove affective enough with the additional injuries Ragnor got from the White Wolf.\n\nAs the fight comes to a close, you find yourself soaked in blood and on top of a dead, un-regenerating corpse. You find the Chief bowing down to the floor, praying in a language you don't understand. After several moments he stands, in shock. Unlike before, there are no sounds; just the deathly chill of the wind.\n\n\"What-- what now?\" Comes his pathetic voice.\n\n\"We... We find the other Creations, and bring them to justice.\" You bring a bleeding hand to your brow, \"Think about it; this can't be the only civilization left, and there are bound to be other Creations wishing to do harm to others. But you and I, we can stop them. We can find a way through the desert.\"\n\nChief nods, \"But I don't think I can carry on with you, for I just... My legs... they aren't moving!\"\n\nWith a grin, you sink your teeth into his neck, and suck-- but not too much, just enough to ghoul him. The salty blood isn't as enjoyable since after today's events, but you'd be lying if you weren't.... Thirsty.\n\nThe former-Zealot stands erect, ready to be at your command. \"Shall we be off then?\"\n\n\"We shall.\"\n\n\nYou have managed to survive in your undeath and leave a possible legacy, but the questions remain! What happened to Kelso? What about the Professor? What could have happened if you had chosen a different path?", "action_results": [{"action": "Restart", "result": "Vampire.\n\nIndeed, that is what Kelso called you. You can still hear his cold, baritone voice explaining it to you. Vampires in the tales of Fantasy are glamorized; nigh-immortal, sexually desirable, powerful. But, while you suppose you are some of those things, in truth, you are not much more than an albino with a lot of health issues. The sun, he said, will damage your skin more than anything else. Any sort of foodstuff can't be digested anymore by your barely functioning bodily systems. He claims to have an idea of what the 'Professor' was trying to do to us, but for whatever reason, he has dodged the questions anytime you ask.\n\nAny information other than that, Kelso hasn't revealed. The irking thing is that it is obvious he knows what's going on, but he consistently acts as if it is in your own good you don't know what went on.\n\nThe nights have been hard since your escape from the Facility. Most nights you wake up shivering, after all the nightmares you've been dealing with. It's terrifying, and it only makes you wonder what horrible things were done to you at the Facility. You do know that they must have affected your ability to feel. No, not the wishy washy 'emotional' garbage you'd usually expect, but your sense of touch was dulled. While a lot of your senses have been heightened, that one stands out. You feel very little pain from your feet, which is odd; considering how you spent your time running over cracked glass just two days ago, but it seems to have healed recently.\n\n---\n\nWaiting. It should be sunrise by now. Kelso said you shouldn't get out, as you are a creature of the darkness now. He, on the other hand, has been out for the entire night and then some. You're not sure what Kelso is hunting for, but you know that you're beginning to get thirsty. More and more questions begin to build up, and no doubt the bastard won't answer half of them. Even while you ran with him through the night, running across various landscapes. Most are just a barren dessert, though every once in while you'd pass a half-buried house like this.\n\n\"Bright lights up ahead.\" He said. A city only several miles down. Kelso must have gone there for the clothes he mentioned, but you hope he's safe....", "action_results": [null, {"action": "Go Outside To Wait.", "result": "For whatever reason you haven't dared open the shades to view the sunrise yet. Kelso's commands... No, instructions, are powerful. Yes, that is the best way to explain it. He's an odd sort, not charismatic in the least, but it would seem as if you have an internal bond with him. Perhaps like the chick believes the first thing it lays eyes on is it's mother, you follow Kelso. While you don't remember much, if anything, of your past life, it is apparent you aren't good at explaining things, even to yourself.\n\n\nNow, however, you worry for your partner. He should be back here soon, and you want to greet him.\n\nAs the shades of the house creak open, causing dust to cloud your insensitive eye, you are baffled as the sunlight both looks beautiful like the devil itself. A gaping ball of flames that lick at your eyelashes, your pale eye sockets which begin to sizzle just just as you shut the shades.\n\nIt stings. It stings a lot.\n\nYou blink several times, reorienting yourself. Even with the several glimpses you got, it is apparent your mentor is not here. Hopefully he comes soon. You take a seat, no way are you going back out there.\n\nSitting down, your mind wanders back to your first memory...\n\n\n---\n\nCome on, wake up!\n\n\"Wuh? What's going on? Who are you?\"\n\nWe can formally reintroduce ourselves later damnit, the lab is falling apart!\n\nThe lab? What lab? Why the hell am I in a lab?\n\nI'll explain everything once we're safe. But we need to go. Now.\n\n\nIt is then when your eyes adjust enough that you can actually view the chaos that surrounds you. The red, flashing lights give you just enough light to make out cracked capsules with smelly liquid pouring out from them and flooding the floor. Looking even slightly up, you can see your own smashed container, as well as the pillars supporting the ceiling riddled with cracks. An odd assortment of humanoids seem to be sprawled out on the floor, with several still writhing and creeping sluggishly.\n\nBut besides all this, you don't really feel much, considering. A numbing liquid surrounding and licking at your sides, but not much else. You can't even recognize your own heart beat. Then again, that's quite possibly due to the tension and commotion. Perhaps you were numbed while in that storage container.\n\nThe man beside you seems to still shaking you, though it takes you several seconds to notice. Grabbing you by the hand, he begins to force you up and drag you along until your legs begin to feel enough to move. Although still sluggish, your motor controls seem to be working better than whatever you could remember. Finally, you feel like you can resume mumbling out questions, even while hurtling around breaking pillars and stumbling on broken glass.\n\n\nWhere... where are we going?\n\nOut. The Zealots of the Church may come in any moment, so we need to evacuate.\n\nThe Church? I... Can you at least tell me your name?\n\nStop talking. Just run.\n\nHow do you expect me to trust you if I don't even know who you are?\n\nI'm not sure you know who you are either, right now it's best you trust me and shut the hell up.\n\n\nAnd you do. Thinking about it, you really don't remember who you are. Who you were? It's... blank.\n\nThe man's hand is outstretched, motioning you to hold on and follow.\n\n---\n\nYou wake up from your stupor.", "action_results": [{"action": "Waiting.", "result": "\"Agh...\"\n\nYou continuously rub your eyes, trying to ease the pain. After several moments, the stinging lessens and your eyes open to see your hands paler than ever. Another oddity; your forehead is boiling, you can feel it as a faint heat, this must be the most blood contained in one point of your body since you awoke.\n\nIt's bizarre, but the situation is hilarious to you: the reason for only moving outside at night is because of sunburns. It's ridiculous, why would someone waste his time creating a useless being? Was there even an actual goal with you being tampered with?\n\nAs your thought process grows along with your annoyance at Kelso's reluctance to explain, you hear a sudden tapping. Then a crash, like a glass vase fell.\n\nInstinctively, your cold body tenses. And while your forehead must be a beaming red in contrast to your albino exterior, your eyes see fine now as you try to find the source of the breakage.\n\nInstinctively, your cold body tenses. And while your forehead must be a beaming red in contrast to your albino exterior, your eyes see fine now as you try to find the source of the breakage.", "action_results": [null]}]}]}]}]}]}, {"action": "Await death.", "result": "Seeing your stunned silence, Gideon just closes his eyes, \"Best get comfortable then. They'll find the hiding place soon, don't you worry.\"\n\nHopeless, you take a seat beside Gideon, and wait. Minutes turn to hours as you wait. After a long while, you hear footsteps approaching.\n\n\"They're here.\" You whisper to Gideon, who is unresponsive.\n\nSuddenly, a small ball is tossed from the hatch, and it rolls near your feet. The last thing you feel is heat, the last thing you see is a mixture of fire and shrapnel, and the last thing you hear is the heavy grunts of Churchmen and the crackling of flames.\n\nDeath was actually quicker than you expected.\n\n\nYou have been killed by the hands of the Church.", "action_results": []}]}, {"action": "Try to find a way to convince the Zealots you and Gideon aren't evil.", "result": "Regardless of the fights you've had with Zealots in the past month, despite the fact that you have brutally slaughtered dozens of Zealots before tonight, you realize that it is extremely important that now you finally attempt at settling the differences between you and the Church.\n\n\"We're going to survive this, Gideon. We can do it.\"\n\nHe lazily looks at you, and the yawns, beginning to recline on the broken bench. \"So, you've hatched a plan?\"\n\n\"Yeah,\" you reply, remembering that David probably left his Walkie-Talkie somewhere... You begin to dive through various clothes and various knickknacks that the Wolves have stored. \"Aha!\"\n\n\"Wuh?\"\n\n\"A Walkie-Talkie. If we can try to reason with the Zealots, don't you think we can maybe convince them to not kill us?\"\n\nHe gets up, \"You never told me you had one of those!\"\n\nYou nervously scratched at your head, \"I... Kinda forgot about it as well. But it's great use for now, Gideon.\"\n\nHe waves you off, \"Doesn't matter, you'll never reason with them.\"\n\n\"It's worth a shot,\" you say, crossing your arms defiantly. You unfold your arms and turn on the radio-- then remember that this would be Zealot HQ. Now you just need to fake being a Zealot again and get the station of the incoming horde...\n\nClick\n\nYou push the button in, too anxious to wait for the crackling static, \"Quick, Ma'am, what's the Zealot's Combat Channel?\"\n\nIt's the cool female voice, again, \"Channel 40, why? Who is this?\"\n\nBut you're already flipping the channels. Now, from 13 to 40...\n\nGideon sits up groggily, and watches you in silence. \"Incoming Zealots!\"\n\nYou release the button, and wait. A heavy, though articulate-sounding voice replies from the other end, \"This is Chief. Who is this?\"\n\n\"Friends. Or, at least, those who want to be. We are the last Creations around, and we want to talk to you.\"\n\n\"What do you wish to speak about, Demons?\"\n\n\"Mostly about your usage of that term. We want peace, nothing else.\"\n\n\"Huh?\"\n\n\"We- we know you're coming for us and our hideout. But we don't want to fight.\"\n\nYou wait several moments for him to answer. \"Give me your name first.\"\n\n\"Err, Vamp.\"\n\nGideon chuckles in the background.\n\nThe man named 'Chief' gives a heavy sigh, \"Right. And how do you want your meeting to be set up?\"\n\n\"Any sort of meeting that doesn't include me being shot or speared by your guns sounds good.\"\n\n\"Funny. If you actually wish to do this then I'd wait outside for us to come.\"\n\n\"I... Think you misunderstand.\" You reply, rather certain about Chief's false attempt to mislead you, \"Trying to kill us will not work out well for you. There are other Creations, actual evil ones that are heading for your city right now. If you don't stop them then you're city will be lost.\"\n\nStatic for a while. \"Why do you not tell me this sooner?\"\n\n\"... Do you even believe me?\"\n\n\"Perhaps,\" he says, \"We may send scout teams to check. But for now I'm interested in what you want to speak about. Are you a man of your word?\"\n\n\"I try.\"\n\n\"Hmm...\" Chief pauses, his low-voice ending awkwardly, \"Give us ten minutes.\"\n\nWhile you wait for him, Gideon just laughs, \"I swear, vamp, if you pull this off then I swear...\" He gets up with a wry smile.\n\n\"Let's just hope their scouts get good information.\" You reply, ironically trying to be as optimistic as possible. The chances are slim, but you think this could work out with your unlife intact.\n\nTime passes, and while you didn't count how much you still worry that they may have ditched messaging and are just continuing their march to this area.\n\n\"Vamp, are you still there?\"\n\nYou get out of your day-dream and push the button back to reply, \"Yes.\"\n\n\"It... Seems you're right that at there are a band of unknown beings several miles behind us. But this doesn't mean as much as you would hope.\"\n\n\"Oh?\"\n\n\"How many of you are there in all? What if there are actually much more Creations at your base?\"\n\nA reasonable suspicion,  \"Then that's problematic for you. But I'd wager that your guys won't be able to take on the ten-or-so of the Creations on the way. So I think getting them first should be more important.\"\n\n\"Ah, but that is a good diversion for ten others to bypass us, eh?\"\n\nUgh. You bring a palm to your brow, uncertain how to answer the perhaps rightfully paranoid commander.\n\nHe continues, \"Still, you bring a solid point. I think you underestimate our capabilities, however. We will deal with both problems, but for now, how do you wish to meet?\"\n\n\"I assume you know how to enter the well, correct?\"\n\n\"Yes, we have figured out your trick.\"\n\n\"... Right, well, send yourself and several of your best man down there and we'll talk. There are only two Creations here, but I assure you we can defend ourselves from whatever harm you might wish to inflict on us.\"\n\n\"We'll be there.\"\n\nAnd... Off.\n\nGideon looks to you, \"What now, Vampire?\"", "action_results": [null]}]}]}, {"action": "Training. (Optional)", "result": "\"Cecilia, please stop it.\" You say, pushing her off you. Thinking it through, it probably wasn't the best idea for you to personally trainer of the woman with mutual, though perhaps repressed for the moment, feelings for you. Regardless, she seems a bit too happy when she get close-and-personal with you during a sparring match. With a sigh, you look over to Ragnor and Gideon's respective groups-- it was a smart way the three of you ended up dividing the workload. Each of you would take 4 of the Wolves and personally trained them to defend themselves. Perhaps they gave you too much credit-- you're not a hundred percent sure what to do. Kelso was the one who taught you, but he seemed to recognize that berserking was the way you could unleash your full strength. You'll have to figure out how the Wolves were designed to fight, soon. On the plus side, you're very happy with you 'students', to the point that the names stick out in your mind. Shamino is a heavy-hitter, though surprisingly clumsy for one of his set stature; Haran is extremely agile, and almost vampire-like when it comes to fighting; and Cecilia, is, well, Cecilia.\n\n\"So, group, have any of you ever shifted into your were-forms?\" You ask, gathering your group outside the dunes. In the dark of night, the flat land of sand that you found might seem unimpressive, but the fact that's it's mostly flat is more rare than one would think here; the landscape is usually riddled with smaller hills evrywhere.\n\n\"Not me.\" Haran says raising his hand, \"Ragnor said that we'll turn only if our bodies deem it necessary. Or when there's a ball of light, but the moon isn't round tonight.\"\n\nAs the rest of the Wolves nod, you rub your chin in thought. \"David!\" You call, waving to your ghoul, who is walking around, aimlessly for whatever reason. \"Can you bring one of the L-Bayonets?\" He nods in response, and wanders back the to Stronghold.\n\n\"What do you want with the.. the guns?\" The young Shamino asks, looking frightened. The other two Wolves seem to look disturbed as well,\n\n\"Don't worry haha. We need to train your fortitude as well as make sure you master your abilities. From what it seems, you haven't done either.\" You watch them idly, waiting for David to bring the gun. As much as it may pain you, you'll need to see what the electronic bolt will do to them. If all goes well, they'll be forced to morph. And only then can you get started...\n\n\"You want to force us to morph for you.\" Cecilia states, frowning.\n\n\"Not for me, for you.\" You emphasize with a nod, \"The way learned to fight was when I had to unleash my primal being, but still pay close attention to my abilities and skills. If you want to defend against the the Zealots, then we need to see you morph.\"\n\nThey all gulp, but nod confidently. When David returns  with the rifle, you firmly grasp it and prop it up, \"This,\" you shake it as as to bring it at attention, \"is the Zealots primary weapon. The tusks at the end are sharp, and will probably pierce nearly any type of hide. Still, assuming you have any sort of health-regeneration abilities, that shouldn't be a problem. What will be a problem, however, is what this rifle shoots out. Lightning.\"\n\nSilence.\n\nYou clap, \"So, who wants to see who can handle the 'holy' firepower?\" To your surprise, both Cecilia and Shamino raise heir hands fairly quickly. Even though you're pretty sure Cecilia raised her hand first, you aim the gun in then big Asian's direction, \"Shamino, you ready?\"\n\nHe nods, bracing himself as his team-mates slowly back away from him.\n\nYou unleash the shot, it's force even taking you off guard as it erupts out of the rifle's end. The green-blue bolt reaches poor Shamino almost instantaneously, flinging him several feet in the air and into the sand, causing a small sand-mound of his own. You and the rest run to catch up to him, hoping he's alright.\n\nWhat you see isn't necessarily 'alright', per se, but it's what you wanted to see. What was a powerful Asian teenager is now a hulking, barely conscious furry monster. As it gets up, the snarling beast (about twice your height and thrice your width) begins sniffing around, it's eyes fully white. It's nose beckons in your direction before it lets out a horrible cry-- a howl. As your two students begin to run and David passively watches from afar, you find yourself at the mercy of Shamino the Werewolf. It starts towards you, walking on two feet and using it's other limbs to claw in your direction. While the beast begins it's charge, you take the initiative by jumping at it yourself,using the rifle's tusks as a range advantage. You stick the horns into the werewolf, though you're not surprised that it doesn't do much to slow it down. By now it has it's oversized arms around  you, crushing your body...\n\nClick\n\nA bolt of lightning shoots out, straight into the werewolf's stomach. More sticky blood oozes from its stomach, and ith a growl the beast releases you, if only to take the gun out from between its ribs. Once again taking the initiative, you send a slamming claw to it's snout, and follow up with a kick to its already bleeding midsection. While it pushes it back, it doesn't seem to do as much as you'd hoped. It takes the bayonet and uses it like a bat to hit you, leaving you breathless as you are flung into the sky, the heavy gun landing on-top of you. You cough out blood, and get up to analyze the situation: Ragnor and Gideon's groups have stopped training just to watch while David, Haran and Cecilia finally get into action. You run to catch up with them, and the unfolding scene would make you tear if you could; the three of them coordinate with each-other beautifully, with Haran both dodging the werewolf's blows and throwing sand at its eyes in order to occupy it, while the other tackle at it's heavy feet, just managing to trip it, and keep it there. It's not the greatest way to end a fight, but it's good teamwork.\n\nBy the time you reach them, Shamino is in his regular form, bleeding only slightly from his nose. He seems oblivious as to what happened, but you're excited team-mates are more than happy to fill him in. Several more lessons like this, and they'll be more than ready to fight the Zealots. After all, taking down a werewolf is much easier than a human.", "action_results": [null]}, null, null]}]}, {"action": "Start it light; they don't seem very prepared.", "result": "Better not freak them out. Can't have them overreact or something.\n\nYou nod to Gideon, who seems to be acting commander of the Wolves. They gather around you, staring with glossy eyes and gaping mouths. \"Right,\" you announce, clapping your gauntleted hands together, \"I am a fellow Creation, like, uh, you guys. And gals!\" You add in quickly before pausing, \"While I am the only Vampire left, I am a Creation just like you. I have been fighting the Church since I escaped from Facility 13-- the last one. As I understand it, the Church has been trying to kill us, even after the Professor is out of the picture.\"\n\nNothing but silence from your audience as of yet.\n\n\"Um, so after escaping the Facility, myself and a... A friend,\" It didn't sound like Kelso's on good terms with the Wolves, he probably knew Gideon from way back when, \"we trained in the sand-dunes, and went out to find the only Creations left. While trying to find you, the Wolves, we had to fight the Zealots, who were more than happy to send their troops at us. As you all are powerful Creations, I will leave it up to you to realize how easy it was to defeat them. But, I kept one as a ghoul, and he had something very interesting to say about you all.\" You look to David, who nods back.\n\n\"The Church has found out where your stockade is, and will send all their troops to finish the Creations here within a week.\" David says, blank-faced. Murmuring spreads throughout the encampment, and you can see several nodding their heads. Others seem more reluctant to believe it.\n\n\"So what do you want us to do with your information?\" One asks.\n\n\"Well, there are multiple options. One; we can defend it, and train for when they attack. Two; we can go on the offensive and just attack the city, taking them by surprise. Or three; stay settled cozy here and get slaughtered by superstitious assholes. Up to you guys.\"\n\n\"Can't we also flee?\" Another question, obviously there's a split in the group; some seem to be especially vengeful against the Church, others just want to be left alone. But everyone here wants to survive, you're certain of that.\n\n\"Possibly, though I doubt the Church wouldn't pursue you through the desert.\n\n\"... Why should we trust you?\"\n\nYou consider the question for a moment, and realize that although you aren't lying, they have the right to be paranoid, \"Because David was one of the Zealots, and he's just relaying what he knows. Heck, how do you think I found your hiding place? The Zealots know, and are getting ready to destroy everyone here. They believe us to be hellish creatures bound to Earth, and think that it's there obligation to banish us back to where we came from.\"\n\nMostly done, you watch everyone surrounding you. Gideon remains stroking at his scruffy chin, and the rest are just... Thinking.\n\nSuddenly, the cloaked Ragnor makes a return, jumping up from the hatch. \"So, what'd I miss?\" He asks with a chuckle, taking his ruby-red hood off. Ragnor is a balding adult, probably middle-aged before he was reCreated. He's muscular, but not in the way Gideon is; he's extremely tall; lean and built.\n\n\"Nothing much,\" Gideon answers, \"It basically boils down to whether we defend, attack, or not believe Vampy and the Ghoul over here.\" With a sigh, he looks scans everyone in the room, \"So, shall we put it to vote?\"\n\nOne of the younger wolves respond, \"I believe the vampire. I don't see why he'd lie, and... The Church does plan to hurt us, no matter what colored lenses we put on. We are evil to them, aren't we?\"\n\nGideon cracks his neck, waits for any other response (there isn't), and then turns to you, \"Well, it seems like you can decide for us. If you want my advice, I thinking attacking the entire city is a bit drastic, though defending well would get what's needed done: Survival.\"\n\nRagnor glares at you as well, boldly standing parallel to the leader, \"But going on the offensive will give us an advantage, for once. We just need to take the assault the City while the are on their way to our hideout. It'd be perfect timing to gain control of the city!\"", "action_results": [null, null]}]}]}, {"action": "Blast it open with the L-Bayonet.", "result": "\"Move aside, Ghoul.\" You command, grabbing for the huge rifle you looted off of the Zealots you last killed. It truly is an amazing weapon, the bursts of lightning would be extremely affective against anything if caught off-guard. Of course, shooting at a metal lid may not be the most brilliant idea, but it's much cooler to try out than using your bare hands to pick up the metallic disk. With David the Ghoul backing away to the end of your pit, you aim and fire a blast of lightning at the plate.\n\nYou hear a loud thundering emit from your weapon as you're flung several feet back from the recoil of this weapon. Through the cloudy smoke you can still make out the the green chain of lightning strike at the plate, creating a large hissing sound.\n\nGreat, now the metal disk covering the well is visibly red hot, glowing a neon color and radiating heat from it. Your Ghoul sighs, though doesn't speak his thoughts, obviously as to not insult you.\n\n\"Err,\" You stutter, realizing your blunder, \"David,\" (you use his real name this time), \"would you mind trying to kick off the plate? It should be weaker now that it's almost reached melting point. Maybe.\"\n\nYour ghoul shakes his head. He replies, \"Can we try to use the bayonet's tusks to pry it open?\"\n\nYou nod awkwardly, and near the searing plate with your rifle. Swiftly, but carefully, you fit the tusks in a slight opening where sand must have been embedded, and use whatever leverage you can to push the lid up. Thankfully, you succeeded in loosening the disk, which means that your rifle manages to carry the lid off of the well. The bad part? Well, the end of your rifle seems to have melted a bit. Perhaps it wasn't made to deal with anything but short bursts of extreme-heat, rather than a prolonged carrying-session. Still, it could be worse. David has a back-up rifle as well, so little harm done, considering.\n\nAfter patting your Ghoul on the back for the idea, you begin to hear the sounds of running from inside of the well...\n\nYou shrug, and smile at your Ghoul, and then proceed to look down the brick-well...\n\nIt's dark, for one thing, and the sound of pattering foot-steps on concrete grows louder. Overcome with nervousness, you loudly blurt out, \"We come in peace!\"\n\nSeveral dark figures appear from the bottom of the well, after several glances upwards at you and whispering, one of them waves you down. Shivering, you jump down the well, using the cylindrical bricks surrounding you to position yourself as to not fall on them. Still, you fall with a heavy thud. Yeah, I'm gonna need new sneakers.\n\nUnlike yourself, David just goes down it normally, using the short metal bars protruding one of the sides, climbing downwards. The dark figures eye you carefully, taking a while to speak. One with dark gray hair and scruffy facial hair as well as a slouching hunchback of a surprisingly muscular body, points at your armor, \"If you're a Zealot, I'd turn back right now. If you don't, then my friend here, the cloaked one, will happily snap your neck for making such a hideous racket.\"\n\nHis voice isn't too threatening, but his body language and thick-eyebrows suggest otherwise. He's clad in tight cloth shirt and pants, bulging with muscles, and is surrounded with an intimidating aura. The other one is completely cloaked, though watches your Ghoul with suspicion. \"I'm not of the Church,\" you start, trying to make a good first impression, \"and neither is he. Not anymore at least.\"\n\n\"Then what are you?\" The gruff man calls out, his eyes narrowing.\n\n\"Well, I'm glad you asked. I'm a... A Creation, just like you. This is my Ghou--\" By the time you uttered the word, 'Creation' he had already put you in a headlock. The cloaked one has already put your ghoul to sleep, though hopefully not forever...\n\nThe man continues, \"What do you want from us, fangs-boy? I thought the rest of your clan died.\"\n\nClans? \"No!\" You exclaim, struggling out of his hold. You actually manage to surprise him with your strength and are able to push him off of you. \"I honestly have no idea what you're talking about. But you're part of the Wolves, right? My associate and I want to join your strong hold.\"\n\nAfter stabilizing, he spits back at you, \"We don't need any joiners.\"\n\n\"Why not?\" You argue, your body tensing. \"The Zealots are planning to raid this place soon, and I figure you could use as much help as possible.\"\n\nThe old man continues growling at you, \"What are you, some sort of message-boy for the Professor?\" Well, at least that means they aren't working for him. \"The Church means no harm to us at this point. It'd be stupid for them to attack us. If you're trying to make a powerful group do something out of desperation, then oh boy, have you come to a bad place, vampy. I'd go back to the sun, where the pain is relatively quick.\" He cracks his knuckles. If you weren't so confident in your abilities, you might have been intimidated by this Neanderthal.\n\n\"Then perhaps you should ask my Ghoul, David. He was a Zealot before I brought him to the darkness.\" You point at the slumped body on the floor.\n\n\"He's dead now, too late.\" The brute says with a cruel grin, \"Snapped his neck, Ragnor did.\"\n\nYou laugh, \"I don't think he'd die from that.\" You take several steps toward your slave, waving the cloaked man aside, you grab David by the cuff of his armor and pick him up, then bring your hand to his neck and snap it back.\n\nDavid glumly states, \"Hi.\"\n\nThe Wolf grits his teeth, \"Didn't know Vampires could use their powers like that.\"\n\n\"Then you'll be learning a whole lot more during my stay here. What was that you were saying about being the last of my clan?\"\n\nHe smiles back, surprisingly, \"Oh? So you don't know. You're the last of the Vampire Creations, as the rest died in this desert planet. I'm surprised you made it this long since the last Facility was destroyed. But if you don't remember that, then do you even remember your name?\"\n\n\"I'm afraid not. Can you at least tell me yours?\"\n\nThe Wolf laughs, \"Call me Gideon. The cloaked figure on the side is Ragnor, our residential assassin, even if fighting has little place anymore.\" He brings out a hairy, clawed hand to shakes yours.\n\nYou accept it. \"So I'm in?\"\n\n\"I'm still suspicious of your reasons for coming here, and your story about the Zealots needs some checking.\"\n\n\"Is it really that surprising?\"\n\n\"Less that and more that we don't want to fight them.\" What? Seeing your confused expression, Gideon continues, \"Listen here Vampy, I'd rather die and let humanity survive than not. And most of us here are ready for that. If the Zealots come to our turf then we'll wipe them out easy, but we're definitely not going to seek conflict, even if me and the boys can take those choir-boys out in an instant.\"\n\n\"Why not? They want to kill us all?\"\n\nHe shakes his head, his face now grim, \"The Church may believe that we're demons, but they also value the sanctity of life, so I doubt they'd come here. Regardless, they aren't all that wrong about us. The things we've done... The innocents we've massacred in our wake. It doesn't mean that we're bad now, per se, but what we've done is inexcusable. The World has gone to waste, and I'm alright if we don't survive to see it rebuild itself.\n\nYou stand in silence for a little while, realizing that you've joined ranks with the modern equivalent of the hippies.\n\nGideon grins again, \"But don't worry about that now, let's close the lid on top of our well and then introduce you to the rest of the gang.\"", "action_results": [null]}, {"action": "Just call through the disc's holes and hope to hear an answer.", "result": "Using divine intuition, you lean in close to the holes on the lid and yell as loudly (and awkwardly) as you can, \"HELLO THERE, WE'RE LOOKING FOR THE WOLVES.\"\n\nYour ghoul snickers. You vaguely hear the echo of your voice trail off into the buried well. Hopefully somebody down there heard your dopey exclamation, even if it came out dumb sounding. You certainly wouldn't want to go through it again. You hear some heavy foot-steps from the well, and try your best to peer through it. Alas, it is too dark. Still, you hear a voice in response.\n\n\"Who are yeh?\" The voice progressively gets closer. It's gruff, but calm.\n\n\"Uh, I'm not a hundred-percent sure! But we're related.\"\n\n\"Related eh? You'd have to explain that one to me.\" You can hear a sharp thud, and the lid on top of the well turn from a flat 180-degrees to a wedged 90. A hairy, clawed hand withdraws. You hear another thump, probably the Wolf down there falling back to the floor.\n\nYou shrug, and smile at your Ghoul, and then proceed to look down the brick-well...\n\nIt's dark, for one thing, and you can't make out anything but two figures looking up at you. Overcome with nervousness, you loudly blurt out, \"We come in peace!\"\n\nSeveral dark figures appear from the bottom of the well, after several glances upwards at you and whispering, one of them waves you down. Shivering, you make sure to slowly go down, using the metal foot-holds protruding from the side of the cylindrical, brick well. The dark figures eye you carefully, taking a while to speak. One with dark gray hair and scruffy facial hair as well as a slouching hunchback of a surprisingly muscular body, points at your armor, \"If you're a Zealot, I'd turn back right now.\"\n\nHis voice isn't too threatening, but his body language and thick-eyebrows suggest otherwise. He's clad in tight cloth shirt and pants, bulging with muscles, and is surrounded in an intimidating aura. The other one is completely cloaked, though watches your Ghoul with suspicion. \"I'm not of the Church,\" you start, trying to make a good first impression, \"and neither is he. Not anymore at least.\"\n\n\"Then what are you?\" The gruff man calls out, his eyes narrowing.\n\n\"Well, I'm glad you asked. I'm a... A Creation, just like you. This is my Ghou--\" By the time you uttered the word, 'Creation' he had already put you in a headlock. The cloaked one has already put your ghoul to sleep, though hopefully not forever...\n\nThe man continues, \"What do you want from us, fangs-boy? I thought the rest of your clan died.\"\n\nClans? \"No!\" You exclaim, struggling out of his hold. You actually manage to surprise him with your strength and are able to push him off of you. \"I honestly have no idea what you're talking about. But you're part of the Wolves, right? My associate and I want to join your strong hold.\"\n\nHe spits back at you, \"We don't need any joiners.\"\n\n\"Why not?\" You argue, your body tensing. \"The Zealots are planning to raid this place soon, and I figure you could use as much help as possible.\"\n\nThe old man growls back you, \"What are you, some sort of message-boy for the Professor?\" Well, at least that means they aren't working for him. Probably. \"The Church means no harm to us at this point. It'd be stupid for them to attack us. If you're trying to make a powerful group do something out of desperation, then oh boy, have you come to a bad place, vampy. I'd go back to the sun, where the pain is relatively quick.\" He cracks his knuckles. If you weren't so confident in your abilities, you might have been intimidated by this Neanderthal.\n\n\"Then perhaps you should ask my Ghoul, David. He was a Zealot before I brought him to the darkness.\" You point at the slumped body on the floor.\n\n\"He's dead now, too late.\" The brute says with a cruel grin, \"Snapped his neck, Ragnor did.\"\n\nYou laugh, \"I don't think he'd die from that.\" You take several steps toward your slave, waving the cloaked man aside, you grab David by the cuff of his armor and pick him up, then bring your hand to his neck and snap it back.\n\nDavid glumly states, \"Hi.\"\n\nThe Wolf grits his teeth, \"Didn't know Vampires could use their powers like that.\"\n\n\"Then you'll be learning a whole lot more during my stay here. What was that you were saying about being the last of my clan?\"\n\nHe smiles back, surprisingly, \"Oh? So you don't know. You're the last of the Vampire Creations, as the rest died in this desert planet. I'm surprised you made it this long since the last Facility was destroyed. But if you don't remember that, then do you even remember your name?\"\n\n\"I'm afraid not. Can you at least tell me yours?\"\n\nThe Wolf laughs, \"Call me Gideon. The cloaked figure on the side is Ragnor, our residential assassin, even if fighting has little place anymore.\" He brings out a hairy, clawed hand to shakes yours.\n\nYou accept it. \"So I'm in?\"\n\n\"I'm still suspicious of your reasons for coming here, and your story about the Zealots needs some checking.\"\n\n\"Is it really that surprising?\"\n\n\"Less that and more that we don't want to fight them.\" What? Seeing your confused expression, Gideon continues, \"Listen here Vampy, I'd rather die and let humanity survive than not. And most of us here are ready for that. If the Zealots come to our turf then we'll wipe them out easy, but we're definitely not going to seek conflict, even if me and the boys can take those choir-boys out in an instant.\"\n\n\"Why not? They want to kill us all?\"\n\nHe shakes his head, his face now grim, \"The Church may believe that we're demons, but they also value the sanctity of life, so I doubt they'd come here. Regardless, they aren't all that wrong about us. The things we've done... The innocents we've massacred in our wake. It doesn't mean that we're bad now, per se, but what we've done is inexcusable. The World has gone to waste, and I'm alright if we don't survive to see it rebuild itself.\n\nYou stand in silence for a little while, realizing that you've joined ranks with the modern equivalent of the hippies.\n\nGideon grins again, \"But don't worry about that now, let's close the lid on top of our well and then introduce you to the rest of the gang.\"", "action_results": [null]}]}, {"action": "Kelso's tale (Optional)", "result": "Kelso sighs, \"Too true. It is about time I fill you in on the details, even if they're hard, even for me, to recall. It was a spread of about two decades. Surprisingly small for the whole world to collapse, but when shit hits the fan it has to either be cleaned or it'll spew out everywhere,\" he chuckles, motioning the Ghoul to continue the walk toward the Wolves. The story will probably take a while... You begin reanointing your sun-tan lotion while your mentor explains what happened.\n\n\"Years before you awoke, the world was in complete order. Governments were somewhat conciliatory with each other, and liberty and justice was preserved. It didn't take too long before the peace was endangered, the militant Religious-- like the Zealots,\" he shoots your Ghoul a glance, \"began rioting, terrorizing less fortunate countries and gaining power there. While the governments were large and powerful, they were inexcusably... lazy when all this happened. Soon, this spread to the more developed places on Earth, like this continent. For a little while, these religions were corner-stones of society, but this weakened it. People were scared, and fear makes the common man do things they wouldn't do otherwise. To say the least, the 21st century was not off to a good start. And it slowly, but sneakily, went downhill from there.\n\n\"Amidst all this, the earth was a beautiful, natural place. Ecosystems filled with life and splendor were everywhere. Civilization was at its peak, human beings were able to do wondrous things like fly, and cure almost all illnesses and conditions using scientific means. The methods used, of course, bothered many 'men of God', like your slave. They wanted to stop progress in the name of a deity long dead. After years of struggle, they were quieted to close-knit communities, and had no impact on politics and scientific progress. During this struggle, the terrorists began gaining traction. Even worse, new viruses began infecting parts of the globe, and the irresponsible Governments continued doing nothing, until it was too late. Developed countries or not, many fell ill of the horrible new diseases, and the Old-Zealots started to control more and more land, becoming the dominant force in most places. That's why the world turned to desert and we've already found a lot of remnants of the Old World buried in it; they were pillaged by the hordes of humans, and as the population dwindled, plants weren't tilled. Soon later, there was drought, and the entire world as we know it has become a giant Dustbowl, just mixed in with disease and raiders. Simon Kurschner became the 'man with a plan' for years during this. He garnered enough support from the local governments with his experiments to get funding, as well as a whole Facility to save the human-race. His science was new, revolutionary even; and while many disapproved of what he was doing, the Professor was recognized as the last hope of humanity.\"\n\n\"What'd he do?\" You ask, with vague memories coming back. Tidbits of information allow you to remember, but not enough...\n\n\"He created me and you. He found a way to create human beings with extraordinary powers, with abilities of legend. His Creations were disposable humans; ones who were going to die regardless. Even though he had no authorization to do so, he began using these dead bodies for his experiments. He gave the dead and dying new life, even with a price. The first experiments he made were immune to disease, and he said he hoped to save the human-race this way. But that wasn't true, he wished to rule what was left of the human-race with his new super-soldiers. Kurschner sent his Creations to fight the Militants, with each one as powerful as you or myself, ten of them made easy work of five hundred Zealots at a time. His new humans were invincible fighting machines, and all under his control. Similar to ghouls, only a step above that.\n\nRegardless, even after the Militia problem was solved, the Professor began to mass-produce his Creations, each of them ravaging wherever they went, unregulated. Under his command, they annihilated whatever was left of the World Governments, and soon came upon humanity. The bastard trapped us in capsules, letting my friends out just to go on psychotic rampages on the humans opposing the Professor. That's where the other Zealots, of the Church, come in. Even though they were smaller at the time, they managed to push the Professor back  by exploiting the Creations' specific weaknesses, and silver. They managed to destroy most of his Facilities, fighting against what they thought, and still think as, the devil. They grew very large as well, and have taken part of what is rebuilding humanity, with religiously-suited technology and a brand new gospel. But absolute power corrupts absolutely, and they ordered their men to kill any Creations left, regardless of malevolent intent. Our Facility, Facility 13, was the last one standing. By then the Professor was on the run, but the New-Zealots were laying waste to any of his work, believing that they should reset the World, like God did in his bible. Fueled on fear-mongering, the only human societies left rely on fighting evil, us, even though they massacre us now, as if it's open season. But no, they believe we are the Devil's work, and as such our sentience means nothing to them. So we run, and we fight, but only in self-defense.\n\nNow we're back in the Dark Ages, all thanks to the Professor, and once again, the Church.\" He kicks at the sand with a frown, but continues marching with you through the beautiful, though dead landscape, reminiscing about the world that was.\n\n\nYou barely speak throughout this, considering all of it.", "action_results": [null]}]}, {"action": "Let him guide you willfully.", "result": "\"I'll have mercy on you now, Zealot. But don't even dare try to cross me.\" You state, giving him the evil eye. He noticeably gulps, then nods. Kelso rubs at his chin, probably thinking about the other Creations. Your mentor likely knows the head of the Wolves, but if you'd guess that there is some sort of bad-blood between them. God knows what.\n\n\"So, what's your name?\" You ask, trying to make communication easier.\n\n\"David, sir.\" David starts, getting onto his own two feet. \"David Crowe... Son of the Lord.\"\n\nYou sigh, \"Cut the bullshit, 'Dave'. Tell us all you know about the Wolves.\"\n\nThe Zealot tenses, as if worried about something. \"I... The Wolves are on the other side of the Dunes, from where we are, we need to just go straight past the City, go several miles down East, and then search for a burrow, of sorts.\"\n\nKelso raises an eyebrow, \"What is the Church planning to do? If they know such an  exact location, they must be planning on doing something.\"\n\nDavid nods, \"Yeah, the Church is planning on raiding the burrow, taking them by s confused.urprise and purifying them.\"\n\n\"Purification?\" You ask, confused.\n\nHe rolls his swollen eye, \"Death by burning. It is said that you abominations will be going to hell, but by burning your soul is destroyed, so you won't suffer. Unlike you two bastards, the Church keeps the World To Come in mind!\" Kelso pushes him forward.\n\n\"Lead then.\"\n\nHe takes a deep breath, and leads you through the desert, passing the City that never stops flashing, and moving from there right. As you make the treacherously long walk, you notice the sun begin to rise. \"Kelso! Do you still have the lotion?\"\n\nHe nods, looking like he's glad you remembered. David chuckles nervously while you lather the lotion on your face, the only uncovered part of your body. Even while the sun reflects it's light off of your creamy-white head, you feel your skin itch. The lotion is definitely something to get used to. MAybe you could get a hat later so this wouldn't be as much of a problem.\n\nYou, Kelso, and David find the spot. At least, the spot David brought you to.\n\n\"So, where's the pit?\" You call out, beginning to search around the area for it with Kelso.\n\nDavid stays behind, \"It should be there, somewhere.\"", "action_results": [{"action": "Continue searching for it.", "result": "Odd. \"Alrighty then...\" You mutter,  searching the ground for any sort of opening. Several moments later you hear a boom as sand is pit at the back of your head, as well as the vague sound of someone screaming... Kelso?\n\nSon of a bitch...\n\n\"IT'S A TRAP!\" You manage to yell out before something horribly metal clamps on to your leg. \"You're going to die for this, David!\" You call out, though he's already limping away.\n\nShit, he probably still has a transceiver... As you leg heals enough to get unstuck from the clamp, you begin to sprint through the field of traps, mines exploding as you trigger them. Several burn your feet, but others give you just enough momentum...\n\nYou leap, easily catching up to the lying coward, and ruthlessly digging into the back of his skull with the momentum of the jump and the sharp ends of your gauntleted fingers, killing him almost instantly when you feel the mushy part inside (the brain?). Thirsty, again, you drink from the blood pouring from his head, barely realizing one of your feet were blown off in the explosion! Once you realize it, you begin to cough out all the blood you slurped in shock, unsure what to do. You see Kelso muttering in the distance, running away with more success than you are.\n\nIt doesn't take too long before the Zealots arrive, catching you red-handed, and finishing you off with several bursts of lightning.\n\n\nYou have died by the hands of the Church.", "action_results": []}, {"action": "Wait a second...", "result": "You hold pout your hand. \"Kelso, wait up.\"\n\nHe turns around, \"Found something already?\"\n\nYou look at David with an hungry grin, \"Not what we're looking for, but good enough.\" You raise your voice, \"David why don't you join us?\"\n\nThe Zealot's eyes go wide, as he shakes his head and repeatedly says, \"No.\" Over and over again. Kelso laughs, and slowly approaches the Zealot.\n\n\"What trap have you attempted to lure us to, son of the lord?\" The last bit dripping with sarcasm. You take an unfortunate step toward him, when it all goes black for a moment.\n\nYou find your ears deafening as you tumble forwards, firey mines exploding from beneath your feet. You run across the landscape, fire erupting all around. You eye the Zealot, angry, and noticing him running away and talking to his... fist? Shit, why didn't I take away his reciever?\n\nIt's too late now, and it doesn't take long to reach the coward, but among this you find yourself looking on the optimistic side; if you didn't catch it earlier, who knew what would happen?\n\nBut you still fear what will happen now. You sprint behind him, barely overtaking him even with your flayed legs. You flick out your wrist, and throw your arm at him, your body almost falling with pain and missing him by an inch or so. Determined, you continue the arm motion, turning your arm around your body once again, twisting your body in a circle, gaining just enough momentum to slam your clawed hand at the back of his head. You feel his brain hitting the back of his head as he slumps to the sand, dead as can be.\n\nYou look around; Kelso is nowhere to be found. Your body feeling heavy, you realize that Zealots are approaching from afar, and you suddenly black out again, probably due to the heat...", "action_results": [{"action": "You wake up.", "result": "An extremely... Blue, room is what you wake up to. Very bright, to the point you have to squint to make anything out. Worst of all, your skin begins to get irritated, and your efforts to get out of the chair seem to be futile. You scream, but your muscles seem to be neutralized. You simply can't get up.\n\n\"UV-lightning, like it?\" Says a robed figure, appearing out of an opening of the wall. You hear a clanking noise and steam rises when the opening is closed, making the opening close, the room is glows with the calming blue. The robe the priest is wearing is also blue, with white stripes. You notice, from a slight creak in his robes, that he has some sort of shiny sword in there. For whatever reason, you feel it from several meters away, your stomach hurting. \"Don't worry, that just means that it's working. You demons can't afford to be in the sun, so the closest thing to it would logically bother you in some way.\"\n\nYou notice that the bearded holyman, complete with a large blue skullcap, is terribly... Old. It's surprising he can move so much, with his crooked back and pruned face, the odd sort of shuffling he does to get closer to you is unnerving.\n\nNoticing you not retorting, he continues, \"Ah, but where are my manners? I, am Father Tomas.\" It takes a couple of minutes, but he manages to get hand-distance away from you. You struggle to even spit at the man, the lights dominating your will. He takes your hand in his, and shakes it against your will. \"So, what's your name?\"", "action_results": [null, null]}]}]}]}]}]}, {"action": "Skip the middle and around to the other side.", "result": "\"Divide and conquer, Mentor. Let's take out the smaller groups first.\"\n\nWith Kelso in tow, you make your way around to the other side. It takes longer, and you're certain the Zealots in the middle know you're there, but if you can finish off the five then the remaining ten are just more sheep coming to the slaughter.\n\nRunning, and dodging bolts of lightning from your right, you find the group from the left, dangerously close to the middle ones. In fact, it's almost like just a large group of fifteen, ready to fight you. But there is a gap, if you and Kelso can make it...\n\nThe green-lightning erupting from the rifles aren't very accurate, from what you've gathered, but when shot in large numbers you admittedly weren't surprised when one slammed into your armor. It stings, but the metal absorbs most of the impact. So much, in fact, that it begins to burn and boil your skin under it. You immediately throw it off, by then close enough to the group that you won't have to worry about dodging another shot from them. While they reload, you jump at them, kicking in mid-air and ruthlessly cutting through the weak spots in their armor, near the neckline. After killing one, the other spears your back, holding it up in the air while another charges at you with his bayonet, ready to pierce...\n\nThankfully, Kelso was fast enough to jump, twist and turn so that his feet gained momentum--  and slam his foot on the incoming soldier, sending him several meters away. Not a problem for now.\n\nBut the rest of the Zealots closing in are. Using your blind-fury, you manage to make a slight somersault while your back was tusked, releasing you from it's tearing grip and causing the soldier to flip over.\n\nEven with these successes, you realize that it is no use. Lightning is shot into the back of your head, causing you to fall on the ground, your head burning but regenerating. You can't find Kelso during this, but you realize one thing; bad strategizing did this one in for you. Your flesh didn't heal itself when shot multiple times in quick succession.\n\n\nYou have died by the hands of the Church.", "action_results": []}]}, {"action": "Zealots in the middle.", "result": "You point forwards. \"Let us obliterate the ten in front first, then move on to the sides. That is their main strike force, after all.\" Your mentor shrugs in turn.\n\n\"You're the boss, kid. Just make sure we both survive, alright?\"\n\nGrin. You crack your knuckles, hearing more nitrogen bubbles pop than you expected. Still, the implication that you're more than ready for battle is caught by Kelso, who laughs.\n\n\"Lead on, then.\"\n\nAs the lights on the side continue their march, you silently sneak around the dune, starting to walk towards the lights ahead. Slowly... then you break out to a run, then a sprint; you can hear Kelso on your side, like a shadow. You can't even see him, but he's there, following you. You approach the groups, them not noticing your pale body, regardless that you're wearing one of their own armors. Even from afar, you notice their elite-uniforms. Stygian black suits with flashy lining, and an  illuminating cross across their collective chests. Both of the groups have an obvious leader, with a horned helmet, reminiscent of the medieval ones knights used to wear. The rest just have simplistic, though futuristic, SWAT-team helmets with visors. The easily most intriguing thing is their tusked rifles, all huge and blocky. No doubt in your mind, those are the weapons you should watch out for most.\n\nYou continue your run, and you're very thankful they aren't the most perceptive bunch. Once your only 15 meters away, you hear a voice in your ear.\n\nMake the first move\n\nA nod. The moment one of them notices you moving forward, you leap at him, body-slamming him with all the momentum you've been buidling up. Even though you think they're higher-ranking than Sebastian was, your armor seems to be strong enough to send one of the flying with a clank, and falling on the ground with a thud. He twitches, but doesn't get up. By now, the nine surviving look at you. The leader eyes you from behind his helmet, \"God has delivered you into our hands. All troops, move in!\"\n\nYou here a crackle, no doubt from a walkie-talkie... Shit. Shit. Shit.\n\nWith a quick turn you swing your arm, desperate and angry. Your claws rip at his metal face, and it thankfully looks like you hurt him more than you hurt yourself. Your hand may sting and bleed from bashing metal, but the one leader staggers backward, as the rest aim their rifles at you. Suddenly, a cold wind passes, and blood squirts out from the leader's neck, his head suddenly missing. \"Kelso!\"\n\nShocked, the Zealots look around, and a storm of lightning shots are fired in many different directions. Eight of the Zealots are left, but... You pushed back as one of the shots hit you, the lightning burning your skin. You feel it growing back, but you're slowed. You jump at one of the closest ones, kicking at him with your ragged sneakers, and using that as leverage to leap at another one. After the push, you can feel him keel over with a gasp, but the other one stick his rifle right into you. You gasp, your mouth watering at the bloody sight. By now, the shadow that is Kelso has taken four or five of them, but even he was skewered by the other group-leader. More anger being built inside of you, you send a wicked, blood-felt punch at the Zealot who has you on the other side of his bayonet. The punch si probably the strongest one you've dealt, sending him and his rifle out of you. More blood squirts, and some even gets into your mouth (which feels good, gives you vigor). Kelso seems to disappear, no longer on the other C.E. Soldier's rifle, and in the confusion you forget that there are at least ten more Zealots coming in from all sides...\n\nA tingling feeling is felt and you find yourself on the sandy floor, bloody and beaten. The Zealots take turns shooting at you, making sure the demon has been destroyed.\n\nYour last thought is on why Kelso abandoned you...\n\n\nYou have been killed by the hands of the Church.", "action_results": []}]}]}, {"action": "Continue waiting for them to communicate.", "result": "You continue waiting. Time turns to an entire hour forward, and Kelso is getting antsy...\n\nCrackling. \"Sebastian? Sebastian, where are you?\"\n\nThe sudden noise surprises you and  you let out a sharp, \"Ahh!\", which makes Kelso sigh loudly. Thankfully, they can't hear you unless you press the button to speak.\n\nThe voice repeats itself. You recognize it as female, cool and British.\n\n\"H-hello?\"\n\n\"Sebastian! Thank the lord you're safe! We haven't been able to contact you for days!\"\n\n\"Wh-why is that?\" You stutter out, trying to mimic what you remember of the Zealot's voice best you can.\n\n\"GPS-tracker stopped responding a couple of days ago. I only saw this now, but that's probably why security has tightened around the City. Where are you? Are you alright?\"\n\n\"I, uh, yes, I am.\" You try to think of a way to get some soldiers here. \"I found another Creation.\"\n\n\"Another one? Like, one that isn't part of the Wolves?\"\n\nHer voice sounds nice, you decide. \"Yeah, different.\"\n\n\"Have you made contact with the demon yet?\"\n\n\"Um, no, but I need back-up.\"\n\n\"Wait, what happened? Are you alright?\"\n\n\"Of course. I just... We need to catch these guys, don't we?\"\n\nShe seems agitated as well as worried, \"We don't tackle on Creations alone, weren't you briefed?\"\n\nYou try your best to pull this off, \"Listen I... Just need back-up.\"\n\nShe pauses, \"Are you... Captured? Sebastian, where the hell are you!\"\n\nNailed it.", "action_results": [null]}]}]}, null]}, {"action": "Use the WTs to lure a Zealot and interrogate him.", "result": "You spend the next couple of nights training with your mentor. Practically having a dead body is odd, and it took you a while to get the hang of using it, but with the tutoring you've become very adept at recognizing what abilities it grants you, it's limitations, and how to channel your inner strength. Kelso has noted to you that he thinks you're ready, and you agree. Mostly. It's nerve-wrecking; at least, it should be, even though you're just excited to spread your wings (metaphorically, of course.) Overall, you feel that you're ready for this.\n\nAbout time too, you want to see more of the outside world, the part that isn't just dust and desert. Finding the rest of the Creations will help with that, hopefully. Your plan isn't overly elaborate, but you're certain it'll work. You pick up the walkie-talkie, and you wonder why on the other-side, why the Church hasn't tried to reach their operative. Maybe they knew he was dead, or perhaps the Zealots would routinely go on missions that took days. Who knows?\n\nNo matter now, You realize, they'll pick up at the signal. Somebody will.\n\nIt's night once again, the Moon is luminous and round. Kelso, is clad in your hoodie, his aged but intimidating features showing out from under it. It didn't seem like his ideal clothes (you could see him rocking a cloak) but when at night a hoodie is probably more practical. You're still garbed in the bulky, but inspiring armor of the Zealot, just with the lights on the outside turned off. You look to your Mentor, who's sitting beside you in the half-buried house. He nods.\n\nExcitedly, you fidget for the WT, and grasp it firmly. You clear your throat to speak, but Kelso briefs you.\n\n\"Remember, just put the channel on. Listen in and wait for a while, and if nothing turns up then try speaking. But only then.\"\n\n\"Does it matter?\"\n\n\"It might.\"\n\nYou cough again, then breathe in. Out. In.\n\nClick\n\nOut. Nothing but static, for now. Minutes go by. You stand at the ready. But all is static. Ten minutes turns to half an hour, though your body doesn't stop tensing. Something is coming.", "action_results": [null, null]}, {"action": "Bestial Training With Kelso (Optional read)", "result": "Hit hard and fast. Only then will you be able to puncture the stone.\n\nUgh. I'm trying!\n\nNot hard enough! I know what you're capable of so this game won't work with me. Let's try again; watch me closely this time.\n\n\nFrom what you're able to tell, your mentor is just throwing his arm at the boulder with as much brute force as he could muster, causing a large splintering in it's the middle of it, with his hand now stuck inside the middle. He withdraws it, and you notice the horrible scrapes on his forearms soon heal.\n\n\nNotice how I hit it?\n\nLooks to me like you just attacked it with all your might and nothing else. But I don't think that's the way it's supposed to go...\n\nWhatever do you mean? Embrace the beast, boy. Our primal natures are what make us human. Savor that. It may seem unrefined, but you have power--  I know you do, power that can only be unleashed by your raw spirit. Now attack it again, unrestrained!\n\nI... Isn't this supposed to be where you tell me I'm supposed to find inner harmony before I can unlock all of my abilities?\n\n\nHe squints at you, probably struggling to notice your humor. Kelso simply sighs, waiting for you to comply.\n\nRight... just ust need to find out how to stop restraining myself. It isn't a conscious thought process... I think?\n\n\"Who or what do you hate more than anything?\"\n\n\"Uh...\" Who, the Professor? Maybe?\n\n\nWith blunt force to your head, you find yourself toppling over. \"Get up!\" Your mentor roars angrily. You groan, getting up slowly, allowing your body to heal itself, right before Kelso kicks at you again.\n\n\"What the hell?\"\n\nAs if disregarding your cries for him to stop, he continues beating on you, up until the point you raggedly throw him off of yourself. Now that you're up, Kelso stares at you right in the eye, jumps in your direction, clawed hands out...\n\nAnd you move out of the way, just in time to land a solid, unrefined kick at him. He tumbles, though with an uncanny dexterity pops back up. You rush at him, with a hand held high ready to strike, and at the last moment he drops to the sand-covered ground and lets your hand land into the rock.\n\nUnfortunately, the tree remains intact and your hand has become horribly misshapen (though that'll no doubt heal soon), on the good side, however, the thick pillar has an obvious dent in addition to a new, more crooked position, leaning backwards from the force of your punch. Surprised by your success, you laugh even when Kelso trips you from the bottom.\n\n\n\"Now we're getting somewhere.\"", "action_results": [null]}, {"action": "Refinement Training With Kelso (Optional read)", "result": "It must be twilight by now... It's dark in the collection of sand-dunes, with several pillars of stone in the area, but the nearly full moon help your eyes adapt to the situation. You sit beside Kelso in a lotus position, waiting eagerly to here what he wants to say.\n\n\nWhile we  may need to recognize our inner animal in order to fight, we need to also need to see what we actually are. Our limitations, our skills, both inherent and learnt.\n\nOkay.\n\nSo, what are your main assets?\n\nMy claws and fangs?\n\nPerhaps. What about your regeneration capabilities?\n\nOh, uh, right.\n\nThis is for you, not for me, kid. Use your newfound abilities wisely, and avoid situations where certain things won't help.\n\nLike, my regeneration won't save me after my head is blown off, right?\n\nErr, yes. But it will regenerate most limbs back, provided they hadn't been burnt to a stub. The body is interesting like that.\n\nSo basically I should stay away from explosions.\n\nIndeed. We should tread carefully whenever dealing with the C.E. They no doubt have heavy-weaponry. But you should find out more about your abilities as time progresses, fairly certain your new genes are still stretching.\n\nI'm not really sure what that means...\n\nNeither do I, haha!", "action_results": [null]}]}]}]}]}]}]}