{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=20983", "context": "", "first_story_block": "  You wake up and grin. You did it. Your friends bet three cars that you wouldn't sleep in the haunted house and make it out alive. You're definitely alive. You look around and see the haunted store's giant lizard monsters. Wait a second! The haunted Radio Shack has no giant lizard monsters! It doesn't even have that weird whispering noise!\n\n\n  \"Attack the kitten! Yes go ahead and attack it! King Iwan Napee! It is your job to eat it! We will be invincible\n\n\n  You push yourself back into a corner. This is definitely a room, but this is definitely not the haunted Radio Shack. You start to bite your fingernails, a bad habit. But that's when you realize that your fingernails are claws! Wait, what! You look at your hands, uh.. paws... You also have an urge to itch your ears with your feet! You've turned into a kitten! You look down to your belly. You're a kitten yes, a fat one. Too bad for you!\n\n\nfor another year! Yes! Yes! Yes! Take it, take the fat thing! It doesn't know anything about us! The less curious\n\n\n  One of the lizard beasts says to you, \"Kitten! We are the Beasts! I am King Iwan and all twenty-eight of our endangered species will split you up and eat you!\" They all lunge at you, but you jump up and hide behind them.\n\n\nthe better! No! Don't let it get away! It might learn our secrets! Eat it so that we can all be invincible for a year!\n\n\n  You look around again and spot a few other kittens camouflaged with the walls. You can smell them out, too. They're watching you. What the?! You think to yourself and think of a way to escape. Hmm...\n\n\nDo not let it know that our weakness is tomato sauce! Do not let it know! Don't let it think! Don't!\"\n\n\n  You spot three things. There are three knives stuck in a piece of sausage on a table, a miniature rocket ship fit for two small kittens in the corner, and a large frying pan hanging on the wall. What do you do? ", "action_results": [{"action": "Get into the rocket!", "result": "  You immediately rush into the rocket just before the teeth of the Beasts snap your neck. To your surprise, there is a kitten with sunglasses dancing inside the rocket. Seeing as he's distracted, you rush to the control pad. You can feel the beasts shaking the rocket. There's only one thing to do.\n\n\n  You flip switches and push buttons and pound on the control pad. Pounding on the pad, you accidentally punch the DO NOT PUNCH button. Uh-oh.\n\n\n  The dancing kitten drops his sunglasses and his donuts and stares at you. \"Did you just-\"\n\n\n  Before you can even shrug, the rocket explodes, one of the large pieces stabbing Beast King Iwan in the left eye. Uh-oh! That's not good. You are launched out of the window, but thankfully you have a parachute!\n\n\n  You dive through the sky and breathe in fresh air. Aaaaaahhh, that's good. However, your parachute is ripped to pieces by a small piece of the rocket. Oh no! You look around frantically. Where do you want to try to land?", "action_results": [{"action": "Land in the forest close by", "result": "You bounce around on the leaves of a tree. You decide to bounce on it some more. Then you realize that leaves aren't bouncy. Who cares? You think and you jump up and down on the leaves.\n\n\n Then some grumpy voice shouts, \"HEY! This is private property! These leaves are for the Mitten Factory! Wait a second! Stop right there!\"\n\n\n  You bounce off of the leaves and run as fast as you can. The police kitten runs at you and notices something on your shoulder. \"Oh... If you're FAT, then you can stay around. Wait a second, all Feline Agent Troop members have the scale of a lizard on their shoulders!\"\n\n\n  \"Tell me the truth!\" The police kitten points a cane at you.", "action_results": [{"action": "Tell the truth no matter how crazy it is!", "result": "  You decide to tell the truth. You tell him everything from the day of your birth to the time you ate cheese on a dare and to the present time. The police kitten's eyes widen.\n\n\n  \"Wow, that's a story, kid! That's absolutely true! Only the most high ranking police know about all this mess. You're lucky kid. I'm a rebel who's against all that sacrifice mess.\" \n\n\n  The police kitten rants about the FAT, an acronym for Feline Agent Troop. They are kittens who protect Earth from giant lizard monsters called Beasts. He also tells you that every year, the kittens take a human and turn them into a kitten as a sacrifice to the Beasts. He tells you that the sacrifice is just something to stall the Beasts for a bit while the FAT are trying to figure out all their secrets.\n\n\n  \"My name's Waldo, kid. If you need the police, just dial my number on the phone. The thing is, the only pay phone that can call me is at the Beast Tower, where you were.\" He gives you a phone number. Great!\n\n\n  Waldo goes ahead and drives you to Mitten Village.", "action_results": [null, {"action": "Mitten Village", "result": "You're in Mitten Village, a strange little village with a mitten factory. Where do you go?", "action_results": [{"action": "The Archery Arena", "result": "When you walk in, an arrow flies at you. If only you could stop time!", "action_results": [{"action": "Death", "result": "  You get up. \"Wait, aren't I supposed to be dead?\" You ask yourself, but nobody is there. You look around until a random old cat with huge whiskers appears, meditating.\n\n\n  He looks at you and says calmly, \"To go forwards you must first go back...\"\n\n\n\"Go back...\"\n\n\n\"Go back...\"\n\n\n\"Go back...\"\n\n\n\"Go back...\"\n\n\n\"Go back...\"\n\n\n\"Go back...\"\n\n\n\"Go back...\"\n\n\n  You finally get annoyed (\"Go back...\") and you decide to meditate. After meditating for a week straight, you shudder. You feel like you can go back and solve everything, but there's also a way to end everything. What do you do?", "action_results": [{"action": "Go Back...", "result": "  You wake up and grin. You did it. Your friends bet three cars that you wouldn't sleep in the haunted house and make it out alive. You're definitely alive. You look around and see the haunted store's giant lizard monsters. Wait a second! The haunted Radio Shack has no giant lizard monsters! It doesn't even have that weird whispering noise!\n\n\n  \"Attack the kitten! Yes go ahead and attack it! King Iwan Napee! It is your job to eat it! We will be invincible\n\n\n  You push yourself back into a corner. This is definitely a room, but this is definitely not the haunted Radio Shack. You start to bite your fingernails, a bad habit. But that's when you realize that your fingernails are claws! Wait, what! You look at your hands, uh.. paws... You also have an urge to itch your ears with your feet! You've turned into a kitten! You look down to your belly. You're a kitten yes, a fat one. Too bad for you!\n\n\nfor another year! Yes! Yes! Yes! Take it, take the fat thing! It doesn't know anything about us! The less curious\n\n\n  One of the lizard beasts says to you, \"Kitten! We are the Beasts! I am King Iwan and all twenty-eight of our endangered species will split you up and eat you!\" They all lunge at you, but you jump up and hide behind them.\n\n\nthe better! No! Don't let it get away! It might learn our secrets! Eat it so that we can all be invincible for a year!\n\n\n  You look around again and spot a few other kittens camouflaged with the walls. You can smell them out, too. They're watching you. What the?! You think to yourself and think of a way to escape. Hmm...\n\n\nDo not let it know that our weakness is tomato sauce! Do not let it know! Don't let it think! Don't!\"\n\n\n  You spot three things. There are three knives stuck in a piece of sausage on a table, a miniature rocket ship fit for two small kittens in the corner, and a large frying pan hanging on the wall. What do you do? ", "action_results": [null, {"action": "Hit randomly with the pan!", "result": "  You grab the frying pan and swing wildly, not caring about anything at all. These bad monsters need to die! You then notice a water pipe system on the wall. That should do it!\n\n\n  You bang the pipe system and the water gushes out, hitting Iwan's eye. It pops out and you run around, looking for a way to get out. However, the pipe busts open and a huge fountain of water hits right at you. You slosh around until you reach a bathroom. The flood is so high that you actually get dumped into the toilet and the water flushes it for you.\n\n\n  ", "action_results": [{"action": "Through the Sewer", "result": "  You cough several times as you wake up. Apparently, you've been washed up on the side of a river. You walk and walk and walk until you reach a small hut.\n\n\n  You knock on the door and walk in. You smell the scent of stale milk and cold ice cream. You walk forwards and spot a she-kitten. \"Are you a human?\" She asks, saying are like ahh. She bats flies away from her whiskers.\n\n\n  \"How do you know?\" you ask her, shivering.\n\n\n  \"You ain't the only one. Last year, some guy escaped and landed in the river. He ran into the ice cream shop. Too bad they caught him. If I was a rebel at that time, I would've saved him, but I wasn't. Good thing now I am!\"\n\n\n  She explains everything about the FAT, an acronym for Feline Agent Troop. They are kittens who protect Earth from giant lizard monsters called Beasts. She also tells you that every year, the kittens take a human and turn them into a kitten as a sacrifice to the Beasts. She tells you that the sacrifice is just something to stall the Beasts for a bit while the FAT are trying to figure out all their secrets.\n\n\n  She pulls you into the back room.\n\n\n  You hear her say something to some FAT agents, who seem really stuck up. They march off and the kitten pulls you out of the room.\n\n\n  \"Here, heat up by the cream churner oven. Here's my number. If you get into any hassle with those FAT guys, just call if there's a free public phone nearby.\" She walks off, making more ice cream.\n\n\n  An hour later, you pad off towards a strange smelling area in the forest. Hmm... You look ahead and see a small village. Where do you go?", "action_results": [null, {"action": "The village", "result": "You're now in Kitten Village. You hear somebody whisper. \"Next to nobody knows about the human sacrifices. Every year, the FAT, you know, Feline Agent Troop, take a human and take them to the Beast Tower to be eaten! They do it so that they can stall the beasts and gain more time! But killing humans! I didn't think FAT could stoop down to that level... it's a conspiracy!\" Apparently, the whispering voice is a radio set to say that over and over again. The whispering is coming from a Kitten Radio Shack. Where do you go?", "action_results": [{"action": "Pizza Shop", "result": "You step into the pizza shop. There are many kittens working and eating in the pizza shop. The only kitties of interest are the cashier who has spiky purple hair and a skinny kitten with a monocle trying to cut some butter. What do you do?", "action_results": [{"action": "Skinny Kitten", "result": "\"What do you want?\" The kitten asks to you in a British accent. You shrug. He continues on trying to cut the hard slab of frozen butter. Hmm...", "action_results": [null]}, {"action": "Cashier", "result": "\"Whaddyawant?\" The cashier asks you. He shows you a list of things that you can buy. There are a bunch of pizzas and soft drinks, but you don't need those. Unfortunately, everything is very expensive, except for the cheese. The cheese is free. You take some cheese, but it's very smelly.\n\n\n  \"Good luck eating that!\" The cashier laughs. You look at the list.\n\n\nSuper Non-Toxic Tomato Sauce - 799.99 Kitten Dollars. Product can be bought by credit card\n\nKidz Meal - 9.99 Kitten Dollars\n\nPie - 20.99 Kitten Dollars. Product can be bought by credit card\n\n\n Well, that sucks.There are only two things worth buying.\n\n \n\n \n\n \n\n ", "action_results": [null, null]}, null]}, {"action": "Radio Shack", "result": "There's nothing here at the Radio Shack except the weird radio talk. There's a free rubber ducky though.", "action_results": [null, null]}, {"action": "Kitten Village Travel Agency", "result": "You walk in. The kitty at the counter, obviously bored, says \" Hello, where do you want ta go?\" You look at the list of bus destinations. There's only Mitten Village and Kitty City.", "action_results": [null, {"action": "Kitty City", "result": "  You're in the hustling, bustling, -insert something that rhymes with bustling-, Kitty City. You can practically smell opportunity out there! There are several stores and buildings. You spot a dark alley and a wide open alley with lights flashing TRAVEL AGENCY in big letters. There is also a small house where you can hear people playing games. The mayor's house is next to a library far away from the center of the city. Now, where would you like to go?", "action_results": [{"action": "TaCosino", "result": "You walk into the big Casino shaped like a Taco. You lick your whiskers thinking about tacos because you're definitely hungry. You walk inside and spot dozens of rows of slot machines and roulettes. On a bench is an old kitten with droopy whiskers and mischievous eyes. He also had a wad of cash stuffed in his pocket. Some employees stare at him enviously.\n\n\n  \"Come 'ere, yeah, you, newcomer,\" He says, yawning and blinking rapidly,\"Welcome to Kitten World's biggest casino ever with amazing tasting tacos! Here's my secret to success!\" The old cat hastily pulls out a kitten quarter, a gray quarter with a picture of an old orange kitten on it, except the odd thing was that the quarter had a string wrapped around it and tied up, \"I just got a jackpot so I don't need this anymore. Just don't use it in here because they're going to install security cameras soon.\"\n\n\n  He whispers something inaudible that sounded like, \"Stopping time would do good, too... Fun Dog Beach has a genius dog with a time stopper...\"\n\n\n  \"What time stopper?\" You ask. You notice that the old kitty pushes a large can of something titled \"Mr. High's High Lighter White Spacer\". There's nothing else to do but leave.", "action_results": [null, null]}, {"action": "Alley 1", "result": "This alley has some strange jazz music playing, but nothing else. You spot a little house in the distance which seems a little black, but there's nothing else here.", "action_results": [null]}, {"action": "Alley 2", "result": "This wide open alley has the backs of several houses. There is an open garage and there is the Kitty City Travel Agency. Where do you go?", "action_results": [null, {"action": "The Garage", "result": "  Hello sneaky little you, yes you, invader of some innocent kitten's garage! The light flashes on and you jump for the exit, but a shy voice says, \"Oh... I'm sorry, we just don't get very many visitors. They say the place looks like a garage. I'm Lena. For being the first person to show up this week, you get this free glow-in-the-dark paint. Would you like to go laser shooting? It's free for you because you're our customer of the... week, uh... month...\"\n\n\n  So, what do you do?", "action_results": [null, {"action": "Go Laser Training", "result": "  \"Sure, let's go laser training!\" You say to Lena. Her eyes widen.\n\n\n  \"Thank you so much! I actually have somebody to play with!\" She licks your fur, \"Thank you so much!\" Now you have a cute kitten here, who likes you. What's better?\n\n\n  You rush off to the laser training, immediately equipping yourself with a huge laser gun. Lena also equips herself with one. \"Try not to hit each other. Laser wounds are actually hard to clean up, you know. We're just training.\" Lena tells you. You nod seriously. You shoot a huge laser beam at the ceiling. Cracks appear right away. Wow, what a strong gun.\n\n\n  You begin to shoot the rag dummies that creep around the area. Wow, this is fun! Time flies and you are trying to beat Lena's high score of five-thousand rag dummies in thirty minutes. It's going higher and higher every second. Your score is still around three-thousand, but it's awesome.\n\n\n  After you're done, Lena gives you a slip of paper. \"Here's a phone number. If you need a laser shooter, then just call me up.\" Ooh... You've got a cute kitten's phone number. Wow! Good job, dude!", "action_results": [null, null]}, null]}, {"action": "Travel Agency - Kitty City", "result": "\"Where would you like to go?\" Asks the kitty lady at the counter. On a brochure, you see Kitten Village, Mitten Village, and Fun Dog Beach as places.\n\n\n  \"Fun Dog Beach is a no-no,\" says the kitty, \"You need to have a special VIK, Very Important Kitten Fun Dog Ticket if you want to go.\" Hmm... That leaves two options.", "action_results": [null, null, null]}]}, {"action": "Get onto the road to hitchhike!", "result": "  You get onto the road and make some signals to some cars, but nobody seems to see you. Hmm... You scratch your head just as you hear a motorcycle sound. Well, it seems like some kittens are playing Lanesplitter on their phones nearby.\n\n\n  However, when the motorcycle crashes into you, you realize that hitchhiking was a mistake.", "action_results": [null]}, {"action": "Library", "result": "  \"Hello.\" A librarian says. \"Welcome to the library. There's nothing much here except for some small books. People usually only use this library as a pathway to the tourist road. It takes you to the Beast Tower if you want to know, but you don't seem to have a car, so you must be a visitor. What book would you like? Unfortunately, we only have four you can read since my daughter borrowed the rest.\"\n\n\n  Sure enough, there are four books. Peter Cat, Cat and the Beanstalk, Black Kitty, and Kitty and the Beast. Seriously, what kind of kittens write these stuff? ", "action_results": [null, {"action": "Go to the Tourist Road", "result": "  You walk out of the library, leaving the librarian to sob all alone by himself. Wow, a tourist street. You see a bunch of bodyguards guarding a gate to Fun Dog Beach, but who cares? You can see the huge Beast Tower in the distant and you're determined to get there. But you don't have any way to get there! Hitchhiking seems to be the best option you have. You see a slow car passing by. Maybe the driver can lend you a seat!", "action_results": [{"action": "Jump onto the Car", "result": "  You jump onto the car. Panicked, the driver puts it on full speed and crashes into a tree. He jumps out of the car just in time while the car - and you - explode. ", "action_results": [null]}, {"action": "Wait Patiently", "result": "You decide to wait patiently and the car surprisingly stops in front of you. \"Why, hello there! You seem to be a newcomer to Kitty City! Well, hop in! You don't seem to know what a car is! I'll take you to the Beast Tower! It's fun there!\"\n\n\n  You walk inside cautiously, pretending that you don't know what the car is, and he drives off, much faster than before.\n\n\n  In a few minutes, you're at the Beast Tower! Awesome! You walk out, expecting him to follow you, but he says, \"Sorry, I left my girlfriend at the Tacosino... again... Bye!\" He drives off.\n\n\n  This is it. The moment you've been waiting for. Prepared? Got enough weapons? Go!\n\n\n  You rush into the gate.", "action_results": [{"action": "Gate", "result": "  Inside the gate, there is the humongous tower with two FAT agents guarding it. If you want to go inside, you need them out of the way. You might also need a strategizing machine. There's a pay phone right there. You might want to call somebody for help. Hmm...", "action_results": [{"action": "Payphone", "result": "This is a payphone. You need to pay a kitten quarter.", "action_results": [null, {"action": "Use your Kitty Quarter on a String!", "result": "  You push the quarter in and immediately pull it out. Who do you want to call?", "action_results": [null]}]}, {"action": "Barge in!", "result": "  You barge in, shoving the FAT members to the ground. You're about to rush upstairs until you get shot by a laser. The last thing you hear is, \"I never miss.\"", "action_results": [null]}, {"action": "Find a chink in the tower", "result": "  You look around and try to find a chink in the tower so that you can destroy it somehow. You might need some sort of strategizer to do it though. Since you're this close to the tower, you can use something to bust it down. ", "action_results": [null]}, null]}]}]}, {"action": "Peter Cat", "result": "You read Peter Cat. It's a wonderful tale of a cat who never grows who lives in a strange land. He has many adventures with kitten friends and blah and blah and blah. When you finish it, the librarian smiles, nodding. \"Another book, sir?\"\n\n\n  Okay.", "action_results": [null]}, {"action": "Cat and the Beanstalk", "result": "  You open the book and magically enter. Wow, that's so awesome. It's a magic book. The librarian squeals in delight as you get sucked in to the world of a giant and a cat named Jack. You hang around and decide to give those beans you had for lunch to some kid for a cow. You take the cow and chop it up into lemons where you make lemon juice, which is impossible. Well, this world is a fantasy, isn't it? Cow meat can turn into lemons at  any time, right? Stop complaining about it. You have lemons and made lemon juice. Drink it! Oh, tasty, isn't it? Watch out for that big axe falling from the sky.\n\n\n  The cat named Jack chops down the beanstalk and the giant hits the ground, dead. \"Thanks for the beans! Are you selling magical lemon juice now?\" Jack asks. You give him the lemon juice and he happily gives you the axe. Well, that was weird. You suddenly teleport out of the book. You have the axe, but that was really weird!\n\n\n  \"Another, sir?\" The librarian asks you.", "action_results": [null, null]}, {"action": "Black Kitty", "result": "  You read Black Kitty, the tale of a kitten taxi driver who is mistreated and roughly kicked out of houses. It's a good read. Maybe you should actually read the original human book form, Black Beauty, but you shrug it off. \"Another book, fair sir?\" The excited librarian asks you.", "action_results": [null]}, {"action": "Kitty and the Beast", "result": "  You open the book Kitty and the Beast. What a cheesy name. There are Beast monsters all around here. Imagine! A kitty and a beast! You've watched that Disney movie, Beauty and the Beast, but how could a Kitty fall for a Beast!\n\n\n  When you flip the first page, the book sucks you in. Wait, that's not right! Sucks you in? It must be a magical book! When you get into the book, you realize that you're in a room. A bathroom. And also, there's a Beast sitting on the toilet. Uh-oh. In a splatter of blood, bones, and fur, you're on the ground, dead in a magical book.", "action_results": [null]}]}, {"action": "The game house", "result": "  When you jump into the game house, you see three idiot kittens playing go-fish. Seriously, these three are stupid. \"Want to join?\" One asks you.\n\n\n  \"Shut up Yule, he's only a newcomer!\" Another idiot says.\n\n\n  \"Shut up or the talk-too-much-and-the-sleeping-drugs-will-work plan will work!\" Shouts another idiot.\n\n\n  Idiots... You decide to watch them talk and laugh until they all fall asleep. Now's your chance! Be a thief! You can see a queen of spades card on the table that you can easily snatch and a strategizer (a weakpoint finder) in Yule's pocket, maybe you can borrow that. What do you do?", "action_results": [null, {"action": "Steal 'em both", "result": "  You grab the strategizer and the queen and rush off. That was fun! Where are you now? Oh no! You watch as Yule's foot connects with your face as you fly away. That Yule must have a power-converter hidden in his socks. You close your eyes as you fly away and hit something with a splash!", "action_results": [null, null, null]}]}, {"action": "The mayor's place", "result": "  You stride into the mayor's house as casually as possible and nobody seems to notice you. That's probably because they're too busy putting out the fire. Wait, the fire?! The mayor's house is on fire! You need either water or something fireproof to get through the flames. You need to save the mayor!", "action_results": [null, {"action": "Search for water", "result": "  Yeah, searching for water seems to be obvious, but where?! You immediately find a bucket of water on the table and splash it on a random spot where the fire is.\n\n\n  Apparently, the stairs to the mayor's room is burnt down! Oh no! You jump up with all your might and rush into the mayor's room. However, you wasted time thinking about the water and the mayor was already dead. Too bad.\n\n\n  A police kitten, probably thinking that you were the cause of the fire shoots you until you die. Uh oh. However, the mayor's death can simply be restarted by going to the meditation grounds.", "action_results": [null]}]}, {"action": "The new amusement park!", "result": "  You run into the new amusement park and buy a free ticket for only ten invisible bucks, cheap, right? You use the ticket to get onto the Spin-n'-hurl ride.\n\n\n  You spin and spin and spin and spin and spin. Wow, when is the hurling? You are then hurled through the air and fly into a forest area. Uh-oh.\n\n\n  \"You know Joe, I don't think this ride is safe.\"\n\n\n  \"You said it, Steve.\"\n\n\n  Now you're somewhere just because of that unsafe ride Joe and Steve made. You can blame them for your fall into the forest.", "action_results": [null]}]}, null]}, {"action": "Kitten Prison", "result": "  You go inside the kitten prison and accidentally walk into the cell control room. Wow, good for you. You immediately spot some chocolate used to poison the bodies of the prisoners if they have a death penalty. You also spot a control pad. You take the chocolate and you hear somebody whisper to you, \"I'm innocent! Press the button and take me out of my misery!\" What do you do?", "action_results": [null, null, {"action": "Button Press", "result": "  You press the button. \"Just kidding, I'm a murderer! He jumps at you until you hear police footsteps. Uh-oh. He hugs you. That's weird. He was just about to kill you a few minutes ago!\n\n\n  \"Hey, you, you got the worst criminal ever out of jail. Now get into a cell, both of you!\" The police kick the worst criminal ever into a cell and kick you into a cell where an extremely old kitten in a jacuzzi is sitting.\n\n\n  \"Wait!\" You protest, \"I'm on first name terms with your Inspector!\"\n\n\n  \"Oh yeah! What's his phone number?!\" A police kitten asks you, obviously thinking that  you're lying.", "action_results": [{"action": "Give up and say that you don't know", "result": "  \"I don't know!\" You exclaim. The police kittens pad off. You look at the old prisoner cat in the jacuzzi.\n\n\n  \"If you want to get out, just use that hole in the wall.\" The old prisoner cat says.\n\n\n  \"Then how come you're not getting out?\" You ask suspiciously before entering the large hole.\n\n\n  \"It's comfy in here. I don't have a home!\" He scratches himself and gives you an ant. Wait, what? An ant? \"You might need the strength of an ant to uncover secrets! That's what my mother always said.\" You take the... ant... and escape.", "action_results": [null, null]}]}]}, {"action": "Liquid Labs", "result": "  Liquid Labs is a weird greenish building far away from the other buildings. You see a sign outside of it.\n\n\nWant Potions? Come  on over to Liquid Labs and the Master will Brew \n\nSomething Up for you! *\n\n\n\n\nBring your own ingredients if we don't have 'em!\n\n\n  Okay... When you walk in, you see a strange twitchy looking kitten standing over a high-tech cauldron looking device. \"You! I can sense deep in your heart and soul that a human making potion is best for you. You must bring me only one ingredient. Since I obtained this rare flower from Earth, a Rose, and tongues of Beasts, and hideous viper panda fangs, you must give me only one ingredient, and that is chocolate.\"\n\n\n Chocolate... Hmm...", "action_results": [null]}, {"action": "Anti-Knife Society Building", "result": "  You walk into the strange anti-knife building. Apparently, you can't see it if you have a knife with you. When you walk in, you see several lawful looking kittens. One of them shouts, \"The mayor has a scholarship again for nanotechnology! You have to save him though!\"\n\n\n  Several other kittens respond to that with loud hoorays and they all rush out. That was very weird.", "action_results": [null]}]}, {"action": "Strange smelling area", "result": "  You walk around the strange smelling area. You spot several dogs sniffing a pole. A kitten in a lab coat is watching you in surprise. He claps his hands several times and shouts something. You walk over to him, but the dogs smell you and jump at you. Uh-oh! You scratch the dog. Aha! These dogs are extremely weak, but have sharp teeth. If you have a weapon, you could get past them! Well, what do you do?", "action_results": [null]}]}]}, {"action": "Try one of the knives and escape!", "result": "  You grab the three knives and throw one at Iwan's eye. The eyeball immediately comes out and he screams in agony and pain. However, when you throw the sausage at them, they all get into a big fight over who gets it.\n\n\n  \"Butter Bomb! That's mine!\" A lizard shouted.\n\n\n  \"Am I the only sensible one around here?!\" Shouted Butter Bomb, grabbing the sausage piece once more.\n\n\n  \"My insides don't feel good!\" King Iwan groaned.\n\n\n  \"HEY!\" Shouted somebody, \"STOP REVEALING THE CODE TO THE KITTEN!\" You aren't at all curious about the code or anything like that.\n\n\n  You jump out the window, but don't even stop to think about what height the room is. Apparently, the room was on the top floor of a twenty-nine story building. Too bad.\n\n\n  You fall down and down and down into a clump of forest.", "action_results": [null, null]}, {"action": "Eat the sausage and throw away the knives", "result": "You don't care about anything else, you're hungry. Sleeping in a haunted Radio Shack and turning into a kitten is hard work, you know! You grab the sausage and chomp it. Yum Yum Yum!\n\n\n  However, the Beasts are also thinking 'Yum Yum Yum!\" as they eat you. Too bad!", "action_results": [null]}]}]}]}, {"action": "Mitten Factory", "result": "You walk inside the Mitten Factory. \"Welcome to the Mitten Factory! Home of the best mittens!\" A little kitten squeals at you, \"Feel free to look around! But if you're an employee, use your Employee card pass and enter!\" You spot a large stack of pillows\n\n\n  A worker kitten snorts at you. \"You want that trash? Take it!\" He says, \"There's no use for soundproof pillows, now are there?\" Good job, you've got a pillow! Now what do you do?", "action_results": [null, null, {"action": "Employee Door", "result": "There's nothing here except for an extremely large door with a card slot. ", "action_results": [null]}]}, {"action": "Kitten Travel Agency", "result": "  You walk to the Kitten Travel Agency. A kind kitty at the counter asks, \"Where would you like to go? They're all free!\" Hmm... You think for a while. Where would you need to go?\n\n\n  You look at the brochure on the wall. You can go to Kitty City, Kitten Village, or a special flight over the river! Wow! Where do you go? ", "action_results": [null, null, {"action": "River Flight", "result": "   You climb aboard the special Mitten Village Only Over River Flight Plane. You spot a few FAT members hanging around, but there's no need to do anything about them.\n\n\n  You sit down next to the pilot. She starts the plane by rubbing her fur on a strange fur sensor. With a strange buzzing noise, the plane starts to fly. You watch as the trees whiz by so quickly.\n\n\n  But the thing is, you're sleepy, so you decide to fall asleep. You lean down your head onto a button... wait, a button?! A button! The plane explodes, sending you into the river.", "action_results": [null]}]}, {"action": "The Apartment", "result": "  You're inside the five story apartment. You immediately see a sign. \n\n\n1st Floor: Lobby, Swimming Pool, and Rooms\n\n2nd Floor: Bar, Laundry, and Rooms\n\n3rd Floor: La Kitten Cafe and Rooms\n\n4th Floor: Artsy Shop and Rooms\n\n5th Floor: Used Book Store and Rooms\n\nRoof: Overlook Cafe\n\n\n  Wow, this place is awesome! What floor do you want to go to? ", "action_results": [{"action": "Stay on the First Floor and explore", "result": "  You take a look at the swimming pool and lounge around while sipping up free fresh milk. Ahh... This seems like such an amazing place to stay in. You stop lounging and get up.", "action_results": [null]}, {"action": "Second Floor", "result": "  At the second floor, you immediately go to the bar, but unfortunately, the \"bar\" is just a humongous statue of a granola bar that the owner once dreamed of. The laundry place has nothing in it either.", "action_results": [null]}, {"action": "Third Floor", "result": "  You go up to the third floor and find La Kitten Cafe right away. It's not so shabby, but the waiters and waitresses are creepy. They all have animated bags on their heads and they seem to be endlessly bored. To your horror, instead of giving you a receipt, they hand you one of the useless animated brown bags. Hmm... There should be a use for it, but it's useless... Unless Zephyrme and Mudshadow are lying this time! Ha Ha Ha! There should be a good use! You jump out of the cafe triumphantly and rush back to the lobby.", "action_results": [null, null]}, {"action": "Fourth Floor", "result": "  You go up to the fourth floor. You look to the left and to the right for the artsy store, but you can't seem to find it until you look up. There, you see a rope. You pull on it and a ladder slides down. You climb up the ladder wondering who in the world made this place.\n\n\n ", "action_results": [{"action": "Go Up", "result": " And just like you guessed, it is the artsy store. You see a bored customer lying around on the ground and a bored costumer trying to paint something with crazy paints. You also see a vending machine that only sold packs of markers... for a quarter! What to do...", "action_results": [{"action": "Go to the Vending Machine", "result": "  You need a quarter to buy some markers.", "action_results": [null]}, {"action": "The bored customer", "result": "  You try to strike up a conversation with the bored customer lying on the ground, but he doesn't seem to talk much about anything besides the used bookstore upstairs.\n\n\n  \"Everything inside the used bookstore is used! Even the lightbulbs are used! I saw some weirdo named Zephyrme walk into the used bookstore and he stole a bunch of ideas from other storygames from the books! Can you believe that?!\" He asks you.\n\n\n  That name, Zephyrme seems quite familiar to you. Maybe he's the reason why you're stuck in this place anyway! You should really go and check that bookstore!", "action_results": [null]}, {"action": "The bored costumer", "result": "  \"Dang it!\" The bored costumer cries out, sending paint flying through the air, \"This waterproof paint is waterproof, but it makes a mess of everything! Now look at these jeans I got yesterday!\" You stare at the dripping (wait a sec, how can something waterproof be dripping?) purplish glob that the bored she-kitten is holding. She pulls out a plastic bag with really dry looking paint inside. Oh no, she's going to give it to you, isn't she...\n\n\n  \"There's somebody who might need this. Go to the old lady inside the Mitten Factory employee area and you'll see what I'm talking about. Now begone before I get annoyed by the wretched paint's smell!\" The cranky and bored costumer shouts at you.", "action_results": [null, null]}, null]}, null]}, {"action": "Fifth Floor", "result": "  You walk inside of the used bookstore. To your surprise, the door is a used door from the 60's and the doorknob looks like an ancient skull doorknob. Wow. You walk inside and see a kitty wearing hippie clothes (probably used as well) and you see a smiling face on a patched up laptop screen. \"Throwing knives get you more wins.\" The smiling face said. What the heck?! Is that all?\n\n\n  You look at the shelves and see tiny blobs of dust. Those were probably ancient used books for fleas. Wow. This place is cheap.", "action_results": [null]}, {"action": "Roof", "result": "  When you get to the roof, you know right away that this is the snazziest part of the hotel. Very classic music goes smoothly through the speakers. Some very rich looking kittens are sipping cups of creamed coffee. Some kittens are actually licking each other (the equivalent of making out for kittens). You lay back and order the fancy guy seven pancakes and a good strong cup of cocoa coffee. He protests about something in French, \"Ne buvez pas! Le cacao est toxique pour les chatons!\"\n\n\n  You don't care what he says. He puts down the cocoa coffee and you start to pick up the cup until you see the clock. Wow, you really got sidetracked didn't you, going around this weird apartment! What do you do?", "action_results": [null, null, {"action": "Drink the cocoa coffee", "result": "  Apparently, you forgot that chocolate was poisonous to cats and you die a gruesome and poisoned death.", "action_results": [null]}]}, null]}]}]}, {"action": "Lie and save your skin!", "result": "  Before you can lie, the police kitten rants about the FAT, an acronym for Feline Agent Troop. They are kittens who protect Earth from giant lizard monsters called Beasts. He also tells you that every year, the kittens take a human and turn them into a kitten as a sacrifice to the Beasts. He tells you that the sacrifice is just something to stall the Beasts for a bit while the FAT are trying to figure out all their secrets.\n\n\n  He then shoves you into his police car while tossing you some fish. \"You aren't going to arrest me?\" You ask.\n\n\n  \"Nah, I know you're the human sacrifice this year. Breaking rules isn't too bad. Here, you're a nice quiet little guy. I'll take you to Kitty City, a nice bustling town. You'll like it, I know, just stay away from any FAT agents while you're there because you're now wanted by them. Be careful! By the way, the name's Waldo, Inspector Waldo!\"\n\n\n  You listen to him talk about his life as you sigh and lay back. You might actually have a nice life in Kitty City...", "action_results": [null]}]}, null, null]}]}