{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=14013", "context": "", "first_story_block": "Welcome to the Quest for the Holy Grail! In this game you play as Arthur, son of Uther Pendragon, from the castle of Camelot. King of the Britons, defeater of the Saxons, Sovereign of all England! ... Yes, you are rather impressive aren't you? Today seems like any other day of you riding through your kingdom with your knights of the round table looking for dragons to save and damsels to slay or something along those lines.\n\n\n\"Arthur! King of the Britons!\" You hear a voice bellow from above and suddenly the clouds part over your head and a cheaply animated adaptation of the Lord your God shines his glory down upon you.\n\n\nYou proceed with the ceremonial praising, grovelling and averting of your eyes for which God scolds you and tells you to stop sucking up.\n\n\nHe then explains that he is charging you and your knights with a sacred task, to seek the Holy Grail! He doesn't really explain what it's for or why he wants you to find it, but it's got the word \"Holy\" in it, so that must make it important, right?", "action_results": [{"action": "The Quest Begins!", "result": "Your sacred quest for the Holy Grail has begun! Where do you want to look first?", "action_results": [{"action": "Camelot!", "result": "Oh alright, if you must! But you don't want to stay too long. 'Tis a silly place! You make your way into the stables to find worthy steeds for yourself and your knights. Unfortunately the horses were all sold a few years back during the age of terrible glue shortage. You do however manage to find a coconut which you cut in half and give to your trusty servant Patsy who skillfully bangs the two halves together to make horse hoof noises. He's a prodigy on the coconuts that Patsy!", "action_results": [null, null]}, {"action": "The French Castle", "result": "You and your fearless knights ride gallantly to the castle... Well not ride exactly, you don't have horses. You sort of prance there, but you extend your hands as if you were holding reigns and it all looks very convincing!\n\n\n\"Hallo!\" You call out when you reach the castle. You can see a man with a very distinguished looking mustache in the castle battlements, but he doesn't answer. \"It is I, Arthur, King of the Britons!\" Again, you get no reply. \"We have come here on a sacred quest, and I wish to speak with your master!\"\n\n\nYou get no response at all. Either the man can't hear you or he's ignoring you deliberately. If only you had some way to get his attention.", "action_results": [null]}, {"action": "The Dark Forest", "result": "And so, you and your knights boldly make your way towards the Dark Forest, which is no more than two swallow's flights away!\n\n\nOh, that's an unladen swallow's flight away, obviously. It's more than two laden swallow's flights away. Four really, if they had a coconut on a line between them.\n\n\nAnyway, when you arrive at the forest, you come to a crossroads, where there are four signs. A sign saying \"Camelot\" which points back the way you came, a sign that says, \"Certain Death!\" Pointing to the east, a sign that says, \"REALLY Certain Death!\" Pointing to the west and a sign that says, \"Holy Grail this way!\"  Pointing to the north. Where do you want to go?", "action_results": [null, {"action": "Certain Death!", "result": "You boldly head towards certain death with Sir Robin leading the way. Eventually your band comes to an abrupt halt when a three headed giant blocks your path.\n\n\n\"Halt!\" Yells the first head. \"Who goes there?\"\n\n\n\"It is I, Arthur, King of the Britons!\" You tell him rather proudly.\n\n\n\"Awhh, a King is 'e? Well isn't that fancy?\" The second head says sarcastically. \"Who does he think he's impressing?\"\n\n\n\"Oh, you're just jealous 'cos you couldn't pull off a crown!\" Says the third.\n\n\nA rather long argument then starts between the three.\n\n\n\"I could if I wanted too!\"\n\n\n\"No, he's right you know.\"\n\n\n\"You have a fat head.\"\n\n\n\"Ooo, I do not!\"\n\n\n\"Look will you two shut up and let's kill the King!\"\n\n\n\"Owh, why do you always want to kill everything?\"\n\n\n\"And he wonders why we never have guests.\"\n\n\n\"Oh yeah, I'm sure it's got nothing to do with your signs.\"\n\n\n\"What's wrong with my signs?\"\n\n\n\"You mean besides the fact that they've got 'Certain Death' written on them?\"\n\n\n\"Hey, I spent ages making those signs!\"\n\n\n\"Yes but you used our hands to make them.\"\n\n\n\"Well if he'd have done it, at least he'd have spelt them right.\"\n\n\n\"Yeah, the first five tries you kept writing 'Curtain Death'.\"\n\n\n\"Who'd be scared of a pair of curtains?\"\n\n\n\"Oh yeah? Well you're ugly!\"\n\n\n\"Your mother's ugly!\"\n\n\n\"Boris, we're conjoined triplets! His mother's your mother.\"\n\n\n\"... Oh yeah.\"\n\n\nWhile they're all busy arguing you...", "action_results": [{"action": "Bravely run away!", "result": "", "action_results": [null]}, {"action": "Fight the giant", "result": "You let out a fearless roar and attack the giant, who grabs you and lifts you up with his giant's hand.\n\n\n\"Did you see that?\"\n\n\n\"See what?\"\n\n\n\"He just attacked me!\"\n\n\n\"So he did, the cheeky bastard!\"\n\n\n\"What shall we do with him?\"\n\n\n\"I say we throw him in the river.\"\n\n\n\"No, let's eat him!\"\n\n\n\"Ooo, don't you dare! You know Kings are bad for my indigestion.\"\n\n\n\"And the bones get stuck in my teeth.\"\n\n\n\"Well I'm not throwing him in the river. That's littering that it!\"\n\n\nWhile the three heads are arguing the giant's hold on you grows tighter until eventually you are crushed in their grip. You've died!", "action_results": [null]}, {"action": "Sneak past the giant", "result": "While the giants heads are arguing between themselves, you manage to sneak past them and head deeper into the forest. In the background you can just about hear the surprise when they realize you're gone, followed by a long argument over who's fault it is. Sadly you get lost in the forest and are forced to turn back, but while you haven't found the Holy Grail you did manage to catch an unladen African swallow on the way.", "action_results": [null, null]}]}, {"action": "REALLY Certain Death!", "result": "And so you and your brave knights ride boldly through the forest... No, I'm sure I can do better than that. I've used brave and bold before. What haven't I used? Noble? Chivalrous? Valiant? Yes, valiant! I like that one!. You and your valiant knights ride through the forest.\n\n\nEventually you start to hear rustling in the trees. Sinister laughter echoes all around you and some spooky violin music starts playing in the background.\n\n\n\"Ni!\" You hear a noise from within the forest.\n\n\n\"Oh no!\" You wail with horror. \"Cover your ears men, we are in terrible danger!\"\n\n\nYou and your knights cover your ears but you cannot block out the sound of that most dreadful and wretched of words! \"Ni!\" The sound comes again as a group of knights in horned helmets surround you. \"Pang!\" Another knight cries, and \"Nu womp!\"   Yells another.\n\n\n\"No stop!\" You cry out in agony. \"I can't take it anymore! Please, have mercy!\"\n\n\nThe leader of the knights then emerges through the trees too confront you and declares, \"We are the Knights who say...\" Yeah, you guessed it. \"Ni!\" And the other knights all start chanting \"Ni\" along with him. \"And we shall let not let you pass unless you bring us a wide border to a garden where small bushes are thickly planted, or a similar larger area with a path winding through it.\"\n\n\nYou look rather confused. \"So you want a...\"\n\n\n\"Yes!\" He cuts you off. \"We want... A shrubbery!\"", "action_results": [{"action": "Challenge the Knights to battle", "result": "\"I cannot let you interfere with my sacred quest!\" You tell the Knights of Ni. \"Knights of the round table... Attack!\" A glorious battle follows in which your followers hack away at the Knights of Ni with their sword and the Knights of Ni yell \"Ni!\" At you, but eventually your men can attack no more. It turns out hacking at someone with a sword is very difficult to do while covering your ears. Sadly you and you men are, for lack of a better word, Nid to death.", "action_results": [null]}, null]}, {"action": "Path to the Holy Grail", "result": "You follow the trail as it winds through the forest and after traveling around in circles for days the trail finally ends. Before you stands a sacred altar, and on that alter you see... A dead fish. Looks like that path was a red herring.", "action_results": [null, null]}]}, {"action": "A Nearby Village", "result": "You hope to find clues in a nearby village but on your way your path is blocked by a man clad from head to toe in black armour.\n\n\n\"None shall pass!\" He tells you.\n\n\nYou are left looking rather baffled. \"What?\"\n\n\n\"None shall pass!\" He repeats.\n\n\n\"But I am Arthur, King of the Britons!\"\n\n\n\"I move for no man!\" The Black Knight tells you with an unwavering tone in his voice.\n\n\n\"But God has charged me with a sacred quest and I must reach the village!\" You insist, but the Black Knight holds his ground.\n\n\n\"I will tell you for the last time... NONE shall pass!\"\n\n\nHow very rude! You'd challenge this man to a duel in a second but unfortunately you managed to get your sword stuck in a stone awhile back. If only you had some way to convince the knight to let you pass.", "action_results": [null]}, {"action": "The Castle Anthrax", "result": "And so, you and your knights set out towards the legendary Castle Anthrax. The days turn to weeks, the weeks turn to months, the months unexplainably turn into hours and The Hours turns into a 2002 drama film starring Meryl Streep and Nicole Kidman, which I've heard is really good.\n\n\nAnyways, you find yourself at the Castle Anthrax, where you are warmly welcomed at the door by eight school young blondes and brunettes, all between the ages of sixteen and nineteen and a half. Their's is a very lonely life of bathing, dressing, undressing and making exciting underwear, and they are utterly thrilled to meet so many handsome young knights.\n\n\n\"Greetings to you maidens. I am Arthur, King of the Britons!\" You tell them, \"And I have come here on a sacred quest to find the Holy Grail. Do you know where it is?\"\n\n\n\"Oh your majesty, you must be exhausted, come, come! Rest in one of our beds!\" Their leader Zoot suggests.\n\n\n\"I appreciate your hospitality young maiden, must I must find the Grail! Now is it here or not?\" But every time you bring up the Holy Grail, Zoot changes the subject.\n\n\n\"But you are weary and you must rest!\" She insists as she takes your arm. \"You may sleep in my bed. It is a very big bed. I'd say it could fit say... A King and at least fifteen scantily clad young women. Just come up stairs with me and we shall tend to your wounds.\" You are lead to Zoot's bedroom where you find a rather kinky looking nun costume, which you slip into your inventory because... Uhh... Because it's a clue! Yes, that's why! A very vital clue to finding the Holy Grail... Yes.\n\n\n\"Now you lay there and let us do all the work.\" Zoot tells you. \"I've been told by a very reliable source that the best cure for aching muscles is to cover yourself with melted chocolate and have three beautiful virgins lick it all off!\"\n\n\nAt that moment, Sir Lancelot bursts in the room and pushes the women out of the way. \"My Leige, we must escape this place! They do not have the Grail and these foul temptresses are trying to distract us from our holy mission!\"\n\n\nWhat will you do now?", "action_results": [null, null, {"action": "Save your men and heroically sacrifice yourself to these... Ehem... Foul Temptresses!", "result": "Getting out from the bed you heroically try to shoo Sir Lancelot away. \"Do not worry Sir Lancelot, I'll put these wicked wenches in their places!\"\n\n\n\"Oh yes!\" Zoot agrees. \"Let him put us in our places!\"\n\n\n\"Get away from him ye bride of Lucifer!\" Lancelot yells, pushing the women back with his mighty shield.\n\n\n\"Oh, don't worry!\" You tell him. \"I can tackle this lot single handed!\"\n\n\n\"Yes, please!\" Zoot begs. \"Let him tackle us single handed!\"\n\n\n\"No sire, I shall not leave you!\" Sir Lancelot insists as he starts to drag you out of the castle.\n\n\nWhat do you say?", "action_results": [{"action": "No, no! I can handle them! Save yourself!", "result": "\"Yes, he'll beat us easily! We haven't a chance!\" Zoot calls as Lancelot pushes you down the corridor.\n\n\n\"No sire!\" Lancelot yells. \"We must leave now! You are in great peril!\"", "action_results": [{"action": "Look, let me go back in there and face the peril", "result": "\"No, it's too perilous!\" Lancelot tells you as he drags you out of the castle.", "action_results": [{"action": "Look, it is my duty as King to sample as much peril as I can", "result": "\"No, we've got to find the Holy Grail. Come on!\"", "action_results": [{"action": "Oh, let me have just a little bit of peril?", "result": "\"No, it's unhealthy!\"", "action_results": [{"action": "I bet you're gay!", "result": "\"... No I'm not.\"", "action_results": [null]}]}]}]}]}, null]}]}]}]}