{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=9918", "context": "", "first_story_block": "You get up to the morning breeze blowing through the window. The start of summer is upon the villiage of Aravon. You, unlike most people of the village, have a dragon. Redscale has been in your care for several years now. You came upon him as hatchling when he was being attacked by a wild boar. Your long bow you had killed the giant boar in a single shot. You were ready for the dragon when you realized that he was no more than a baby. You took him to your house. That was a wise choice. You no longer have to worry of robbery. You two been best of friends since that faithful day.\n\nDragons in this land are common. They vary in size depending their age. Not many hang around humans because of their past war with dragons. The two races had disagreements that when one king went too far war was declared by dragons. It ruined may kingdoms and the caves of dragons. Until the war exhausted both of them they settled on leaving each other alone. Though some humans found ways to work with them. Together they built houses, discovered new medicine, and worked to get a better understanding of the world.\n\nNormally he'd be outside hunting around the time you get up. So you go outside to see the flowers bloom and a humid smell in the air. Clouds were in the sky. It might start to rain. Better get a coat just in case, you think. You live a hundred meters from Aravon. Near the edge of a great forest known as Valkar Forest. You get a coat and head out.\n\nYou get an axe. You go to start chop some wood for a fire when a blinding flash of light beams up in front of you. A snarling wolf demon appears and stares at you. Demons have appeared when the dragon war was ended by the humans that wanted power. Though the Royal Court of Varon put an end to it. Or most of it. All you have to defend yourself is a axe for cutting wood. You have your bow and sword inside. Still you prepare for battle. \"Don't bother to fight me Human.\" it sneers at you. \"You think you can kill me with an axe. I wouldn't try.\"\n\nYou stare at the beast, focused and concentrated. You were taught to stay calm at all times. \"What do you want demon?\"\n\n\"To talk to you about your pet dragon.\" It replies. \"We caught him.\"  You stand there. How could they catch him? Who would want to mess with you two? \" Where is he? \"I'll find him and kill whoever did this.\" you say.\n\n\" Go to Igor's tower and you'll find whom you seek.\" He disappears in flames leaving you there to think how this could've happened. And why would they just tell you that they took Redscale? It doesn't make sense. You don't have enough time to think about the situation you're in. You'll have to resolve it and fast.\n\n ", "action_results": [{"action": "Get Supplies", "result": "You return to your house to prepare for your journey. Whoever did this has to be very powerful to stop a big dragon like Redscale. You grab your weapons: a sword and longbow. You grab a bag full of coins differing in value. You make a list for what you need: a horse, food, and quiver of arrows. You look around for anything else you may need. You see nothing and start to move toward Aravon.\n\n You arrive to see several single storied. You head to the local butcher. He was a rather large man. He goes by the name of Scar. Noone in the village ever found out why he calls himself that. He was skinning a whitetail deer when you entered his house. \"Need something?.\" Scar asked.You sigh. \"I need some meat. Why else would I come here?\" He gets up and looks at you. \"Come\" was all he said.  He says nothing to you as you buy the meat you need for your trip.\n\n \nYou head to the blacksmith who is known to have quivers of arrows. You enter his workshop to a smell of smoke. You never hunted for any animal because Redscale would hunt for you two, so you  never really had any need for arrows. You see the blacksmith hammering a cherry red sword that had to be recently made. You say,\"Sir, I have come in need of some arrows.\" He continues to hammer until its shape is correct. He puts it into a barrel of water and looks at you. \"Sure, you need some for a trip. I'll get you a quiver of usable arrows.\" He returns with your quiver and you pay. \"Thanks.\" is all you say is before you leave.\n\n \nYou head toward the local stable that sells horses. You are looking for a palfrey or known as a riding horse. You see a chocolate colored horse that looks as it was never used. You walk to the stable keeper. \"I want that one.\" You point at the palfrey. \"Well Mister, its one of my finer ones. You have 100 gold pounds with you?\" He asked.  You sigh. Why is every stable keeper here a rip off, you think.  You reluctently give him the amount. You leave with your new companion. You give him the name Amin, the Honest horse.\n\n \nYou ride Amin to your house. You know Redscale went to Valkor Forest to hunt, so that is the direction you are heading in.", "action_results": [{"action": "Head for Valkor Forest", "result": "You are in the forest. Animals scurry around you. A bridge is about 50 yards before you are stopped by two warriors. They come in front of you. The wierd thing is no battle horses. They bear the symbol of Varon: the king's knights. \"Halt.\" one of them says. You bring Amin to a stop. He snorts nervously.\n\n\"Why are you in the forest, young one?\" he asked.\n\n\"I am but a simple peasant.\" you reply.\n\n\"Somehow I doubt that,\" The other one says, \" you would not have weapons like that.\"\n\n\"Gotta protect myself.\"  you say cautiously. You have uneasy feeling about these two. You look at the armor. You look at all the details and see nothing, but you see a sword mark by the heart. You now know what happened. These two must have ambushed a pair of battle-weary knights. By the look of the aromor they tried to fix it, but could not repair the heart wound. \"You two aren't knights! You're bandits!!!\" you yell.\n\n\"Your smarter than you look. The master misread your intelligence. Though we're not bandits, We'Re DeMoNs.\"\n\nNo more words are to be exchanged. These two are of the same demon that told you that Redscale was gone. These wolf demons must be killed. You can use your blade or take them out with your bow ", "action_results": [{"action": "Use Sword", "result": "You shoot your blade out of its scabbard with lightning fast reflexes. You were star pupil of world reknowned swordmaster Quon. As they pounced you slashed one deeply into the shoulder. It dropped to the ground howling in pain while holding his shoulder.\n\nThe other one leaped on top of you and knocking you to the ground. You drop your sword and it slides away from your reach. Damn. you think as you hit the ground.  You see a claw come at you to cut you. You grab the arm as its in mid swing and use your leg to kick him. That stuns him for a second and goes to grab your fallen sword. You get up to your knees to see him try to cut your head off.  You duck and give him a leg sweep to try get him down.  It works. He drops the sword and holds  the back of his leg. You get up and pick up your sword. You limp over and look down in disgust. \"You should've left me alone. Your action will cost you your life.\" You raise your sword and cut his head off. He's done. You walk over to the wounded one and say, \"Whoever is your master is as good as dead. I'll spare you to tell him that he better realease Redscale or he's doomed.\" You remount Amin and go across the bridge.\n\nYou know that there's two villages on two crossroads. You come up to one, but the road to Seri is blocked by collapsed trees. Looks like Xias is the only one. \n\n                                     ", "action_results": [{"action": "Xias", "result": "Xias is little less than a city. You head on the crossroad leading toward it. People are running around you trying to go somewhere  or get something. You get people to look at you. They step back from you. They're afraid of me, you think as Amin walks across a busy street. You make your way to the local inn for any rumors that may help. \n\n The innkeeper is a rather bulky figure. Stories are told of how he trained in the military. He goes by the name of Io. He asks you if you wanted some coffee. Io asked,\"What makes you visit these parts stranger? Not as many folks come in here as the used to.\"\n\n\"I'm looking for a certain wizard who has captured a close friend of mine.\" you reply. You don't want to get too detailed. You hear the front door open to see a person come in with a cloak.  The person heads to a croner and sits down. You're curious on who it is.\n\nYour curiosity was shattered by another person at the door come in. This was an angry group of men wielding swords and other kinds of weapons. A tall man, you presume to be their leader, steps up and shouts, \"Where is SHE! There you are you wrench!!\" They head over to the cloaked figure in the corner. You see them pull the hood down. A female sat there.  Knowing that, you stand up and draw your own sword. \"You should leave her alone if I were you.\" you tell him. The leader turns and whispers to two of his men. They come at you  with a axe and club.\n\nYou let them attack you first. The axeman swings the axe at your head. You duck and bring an uppercut to his chin that sends him staggering to the group. The man with the club tries to hit you in the head. It connects and sends you flying to the ground dazed and confused. Looks like I failed my quest. Forgive me Redscale, you think. For a moment there you think you felt a far sense of disappointment from somewhere. Then the woman leaps at the others with a concealed dagger. Within a few seconds, half the men that entered were on the ground, dead or wounded. The man raises the club for the final blow when a dagger thrusts through his heart. You see the woman standing over you, her hand reaching out at you.\n\nYou grab it and she pulls you to your feet. When you got up you got a better look at her. Brown hair that flowed down her back.  Blue eyes that shone with a life energy that you\"ve never seen before in someone. She looks over your shoulder and her eyes widen. \"Come\" is all she says. She dashes up  the stairs of the inn and disappears. You head up the stairs to see her in a room motioning for you to come in. you go in and she says, \"Help me.\" She's trying to barricade the door with the bed. You go over and out the corner of your eye you see a chair.  \"Let's jam the chair in the doorknob.\" you yell.\n\nShe grabs the chair and jams it under the doorknob. Pounding on the door starts and you know men are trying to break in. Fear is swelling inside your body. \"OPEN THIS DOOR!!!\" someone outside the door yells. You start to get angry and your fear is gone.\n\n\"Like that's gonna happen,\" you yell back. The pounding is harder now. \"Explain later. What now?\" you say to your supposed ally. She gives you a grin that makes chills go down you back.\n\n\"We jump.\" she responds.\n\n\"Where?\" you ask. She points at a window behind you. Oh boy, you think.", "action_results": [{"action": "Jump", "result": "You open the window to see a cart of hay below. \"Well.\" you hear her voice behind you. Better to jump than fight in my condition. Well, here I go, you say to yourself. You jump and land in the cart of hay below. You see her jump in to the cart nearly before you got out. \"What now?\"  She looks at you in a funny way.\n\n\"We go to the stable.\" She responds. We get to the stable to see Amin and another horse. It was a dark black. She mounts the horse. \"Do you have a horse?\" She asks. You nod and point at Amin who snorts. \"Nice. Let's go.\" You mount Amin and we head toward the gate.\n\nYou see some men with bows at the gate wall with bows pointed at your companion and you. judging by the distance you estimate a hundred yards. An arrow shoots by your head. Apparently these archers are expert shooters.\n\n\"Don't shoot.\" She says. You look at her in worry.\n\n\"Why?\" you ask.\n\n\"I have some help of my own.\" she says. \"Look to your right.\" You turn your head to the right to see ten archers with crossbows. They aim and fire to take out all of the archers. She turns to them and nods. You two bolt through the gate and head towards Valkor Forest.", "action_results": [{"action": "Finally Meet", "result": "You ride with her for hours until you make it back to Aravon. You head into your house and collapse on your bed. She enters and sits on a chair near your fire place. \"This is where you live? she asks and you nod.\n\n\"I'll put the horses in the stable.\" you say. You never use it and thought back then how it might come in handy. You take the black  horse and Amin to the stables. You fetch water from a small stream out back. You get some oats and feed them and head back in.\n\nYou return to the cabin and see your friend asleep. You go to your bed and doze off. You have a  dream: You see yourself in front of two shadow figures. \"How could you fail on killing the boy. I've trained him and saw potential. But he's not good enough to slay a demon and wound  one.\" a loud voice roars. To you it seems really familiar, though you can't seem to recall who's voice it is. \n\nA low one who's clearly afraid says, \"But Master... he's far more powerful than you envisioned.  His dragon has made him far too powerful than your magic can predict.\"\n\nAll you can see is black, but the voices remain very clear. \"My magic not strong enough. That is a lie!!! He may be more powerful, but I'm not stupid enough to not believe it.\" You hear a low rumble. You know its Redscale rumbling a warning. You are all too familiar with it.\n\n\"He will save me and when he does. I'll personally tear you limb from limb. Zaron, I know you're your here. Don't give up! Use the power that I saw in you the day we met!\" Tears started to flow down your cheeks.\n\n\"The boy is here!?! Fine. You listen up Zaron. I will have my revenge. Just you wait...\" the voice fades in to darkness.\n\n \n                                     \n ", "action_results": [{"action": "Continue", "result": "You wake up to your friend shaking you. Tears were really flowing down your cheeks. So it wasn't a dream, you say to yourself. \"We need to talk.\" you say to her.\n\n\"Fine. But I start. My name is Kai. I come from a wealthy family in the royal court of Varon. They were selfish. My OWN family!  They sent me off to marry some Lord Warren I didn't even know. I reluctently agreed to the marrige. As my escort and I neared to his lands we were taken by suprise by some large group of bandits. My escort was killed and I ran to Xias. Some of the bandits followed me and I bought the cloak you first saw me in from a farmer. I went to the inn you were in. As they entered I prayed someone may help me. When you stood up I thought you were leaving, but you helped me and almost died from it. For that I'm in your debt.\" Kai finished.\n\nYou nod. \"I'm surprised I'm in the presence of royalty. I'd escort you, but I have a mission that demands my immediate attention.\"\n\n\"What mission?\" she asked.\n\n\"You wouldn't believe me anyway.\"\n\nI've seen some crazy stuff.\" You give her a sarcastic look. \"I'm not lying. Tell me of your mission that demands your attention.\"\n\n\"I'm not trying to get into deatils, but someone was taken from me.\"\n\n\"You're trying to save someone?\"\n\n\"Yeah.\"\n\n\"Who?\" You sigh and go to the window to look at the sky. You look at her with a deep sadness.\n\n\"My dragon.\"\n\nThat got her attention. She didn't say a thing so you continue, \"Two days ago Redscale; that's his name, went out hunting and never came back.\"\n\nShe finally was able to speak,\"How do know he didn't just leave.\"\n\nFor once since he was taken you laughed. It didn't last long, but it felt good. You look at her. \"Because we were too close to leave each other without telling one another. Anyway, before I went out to chop wood a flash of light appeared. A wolf demon appeared to give me the news. Then I went to the village for supplies. I headed for Valkor Forest and took the path to Xias for any rumors. Before I got info you came along with those thugs. And I'm Zaron, son of Aron.\"  you finish.\n\n\"That's sad. Well I made my decision. I am coming with you.\"", "action_results": [{"action": "Continue with Kai", "result": "\"I accept your help Kai.\" you say with gratitude. \"We need to make a stop at Aravon. You know how to use a sword and shield?\" She nodded. \"We need a sword for you and two shields. Let's go.\"\n\nYou head out to the stable and mount Amin. She mounts her horse. You ask, \"What's its name?\"\n\n\"Shadow.\" She said. We went in the direction of Aravon.\n\nWe go to the blacksmith. He greets you two and asks what you want. \" Two shields and a sword.\" He comes back with a shield with a red dragon on it and a steel one with the symbol of Varon: an eagle. He asks Kai if she could use it. She grabs it and waits. \"This I made for you personally if the day came.  This battle-ready Red Dragon shield is made of 16 gauge thick steel which will protect you from poundings on any battle field. Its yours without cost. And this is for you girl.\" He uncovers a steel sword on a table and gives it to her. He goes back to work and you leave with your new gear.\n\n \nWe put our gear on and headed torward a mountain rumored to have Igor's Tower. You both didn't talk because you know you two may die. You make it to a pass up the mountain when you hear you a noise in the bush. You snap you head in that direction and saw more movement. A lesson from Quon to observe everything. Kai was already doing that when the attack came, but you were ready. \n\nGroups of demons varying from animals of all kinds. A bear demon swipes you off Amin and to the ground. You cut at its leg and it goes down. Before you could finish it two more of them were on you. You see Kai kill any demon that came at her with expert cuts. She kills every demon that crossed her path. Something fired inside you that made each swing of your blade and land an instant kill. The first was a bird-demon from the air aiming to pick you up and drop you. A tiger came and clawed at you. You blocked with your shield and cut it apart. They begin to retreat. You can follow them to there hideout or cheak the area for any clues.\n\n                                           ", "action_results": [{"action": "Check for clues", "result": "You go to see if Kai is okay. \"You hurt?\" She shakes her head. \"Yell if anything happens.\"\n\n\"What are you doing?' she asks panting.\n\n\"To search for any clues on how those demons got here.\"\n\nYou leave her while she tends to the horses. You look around to see a large set of footprints. You notice at least twenty humans have been here recently. You look around to see not only humans, but some demon footprints. Satisfied here you look in the direction opposite of which you looked at.\n\nYou go in the opposite direction to see a village there. North of there stood a large sructure you can't identify.  \"Looks like a prison to me, but who's it for?\" you say to yourself. With the information you have it looks like that's your next destination.\n\nYou head to Kai and all you say is \"Mount up. We can't leave those demons. We must find out who summoned them.\"\n\nShe smiles. \"Let's get to it partner.\"\n\n                         \n                                                           ", "action_results": [{"action": "Head deeper into the mountain", "result": "You remount your horse. Kai and you follow them. Whatever they're up to you need to know. You track them using the footprints and some blood they left. You have your sword laying in your hand for immediate use. Whoever is here has got to be powerful to summon these demons. \n\nYou eventually come to a cave. Kai said, \"We have to go in there.\"\n\n\"I never thought of that. Thanks.\"\n\n\"Don't have to be a jerk.\"\n\n\"I know. So we go in carefully or charge?\"\n\n    \n \n                                        ", "action_results": [{"action": "Approach carefully", "result": " \n\"Wait here.\" you tell Kai. You go in with your shield up enough to protect you but not enough to block your line of sight. A turn is up ahead with a small reflection of light coming from it.                                \n\nYou motion for her to come in. \"There is a light behind the corner. I'll go see what's in there. Stay close enough that if I need help. You'll be here. Don't move! Be ready for a fight. I sense a great evil in there.\"\n\nYou go in there to see an old man who's maybe seventy years old. He turns towards you and smiles. \"I've been waiting for you.\"\n\n\"Who are you?\"\n\n\"I'm known by many names. But you may call me Tora.\"\n\n\"Were those your demons?\"\n\n\"Yes. The has master taught me very well.\"\n\n\"Master? Who is he?\"\n\n\"Telling you would be too easy. You'll find out soon enough. After we bring you down.\"\n\nDemons from a secret path. One was a black dragon, bigger than Redscale. \"Kai!!!\" you shout.\n\n\"You have a partner. His reading said you'd be alone.\" Tora screams.\n\nKai comes by your side. \"No way. I may  never have joined you if I knew this would happen.\"\n\n\"Shall we?\"\n\n\"We shall.\"\n\nYou both leap into action. You cut down any demon that enters your blade's range. Kai also was doing great until all that remained was the black dragon.                                 \n\nYou can't move. Why can't  I move, you ask yourself. The feeling is preventing you from moving. the black dragon swipes at you. Kai intervenes by blocking the claw with her shield. \"Snap out of it Zaron!! This isn't a dragon. Its a dragon demon!\"\n\n You aren't able to keep its tail from smacking her across the room. She hits the wall and falls to the floor motionless. That angers you to see it do that. Whatever pity you have for it is gone now. It goes in the direction of Kai to finish the job. You run in its path and yell, \"You want her? You'll have to go through me first!\"\n\nYou hear a deep rumble in its throat, like a laugh. To your amazement it can talk. \"Go through you first? You can't kill me boy! For I'm no demon, for I'm the KING of all dragons. I'm called Calivir.\"\n\n\"Some king you are. You'll let one of your kind be taken captive? You have no right to be called king!\"\n\n\" NO RIGHT!?!\" Calivir roars.\n\n\"You heard me.\"\n\n\"You don't understand. He's my son. I couldn't convince him to leave you, so I helped capture him.\"\n\n\"You may be his father, but he's my brother.\"\n\n\"You have no right to say that. Your a human and not a dragon.\"\n\nYou shake your head. \"We look out for one another, we argue with each other, we will  risk everything to save each other, and the most important thing: we love each other. I don't need to be a dragon to call him my brother. I know he feels the same way. I feel it. So I have every right to call him my brother.\"\n\n\"Be as that may. I have no choice but to kill you.\" You look him in the eye and see something that shocks you. They have pain and a deep sadness in them. No.... something isn't right, you think.  No one should ever have that look. You try one more time to reason with him. \"You have pain.\"\n\n\"Alas I do. I have to kill my son's brother.\"\n\n\"You have pain that whoever has Redscale may kill him.\"\n\n\"You obviously know how to read a dragon from Redscale. If you defeat me I'll reveal his location to you. If not, you die.\"\n\n \"Very well.\"                                                                          \n\nYou get into a battle stance and Calivir sighs. He wips a claw and it glides across your shield. You cut a swipe at his leg and he flaps his wings to go airborne. He shoots a jet of flame at you. You lift your shield, unsure if it will protect you. It does however hold against the array of flames. You see him land and use his tail to whip at you. You are sent flying into a wall. Can't lose consciousness. You fight the urge to pass out. Calivir walks in your direction and shoots a claw at your chest. It rips your shirt off, but otherwise your uninjured. You grasp your sword for a final strke and cut a deep gash in his chest. Blue blood gushes out and he falls on his side. You fall to your knees after the battle. Kai and Calivir are in your sight. It gets blurry and blurrier by the second.  You think you'll die before you pass out. A dream appears to you: All blackness surrounds you except for a faint red glow. It grows bigger until you see Redscale.\n\n\"Redscale....\"\n\n\"Rise brother.\" He says. You hear passion in his voice.\n\n\"I can't... pain ...too great.\"\n\n\"You must. You must not leave us. The pain is not enough to keep you down. RISE BROTHER!!!\"\n\n\nA great power awakens in you. The pain disappears and you rise from the dead. \" I'm up.\"\n\n\"Run toward the light Zaron. Run towards it and arise from your grave.\" He fades away and you feel tears come up. You hold them in and look around to see a light above you. \"I'm not done. Not by a long shot.\"\n\nYou wake to see Calivir gone and Kai in a corner with a fire. \"I must have been hit by a rockslide.\"\n\nShe hears your voice and jumps up. \"Your alive! But your pulse was gone.\"\n\n\"I was dead, but a friend showed me the light.\"\n\n\"Well Tora was easy to kill. I burned his remains and  disposed off them. Calivir told me Redscale was in a prison in a village called Osco. I was gonna bury you, but you got up. How did you defeat Death?\"\n\n\"With purpose and Redscale. Let's go get him.\"\n\nWith your spirits refilled you head to the Osco. You will rescue him. You've got to, for it's destiny!", "action_results": [{"action": "Go to the Prison", "result": "You have no idea of Redscale's and your death sentence. You go to the large building you saw when searching for clues. Kai and you dismount your horses and sneak up a hundred meters from the prison. \"We'll camp here for the night.\" You start to set up camp for the night. You have another dream of Redscale:\n\nYou are on the ground you first saw Redscale.  You see the boar with that very same arrow you killed it with. You look down to see your sword isn't there. It was here the day you met Redscale. You hear a rustle in the bush to your right. You head in the direction to see Redscale in a river that wasn't there when you were last here. \" \n\n\"Redscale.\"\n\nHe snaps his head in your direction. His eyes flash with an acknowledgement of your presence. \" So your here.\"\n\n\"I am.\"\n\n\"Are you near the prison?\" \n\n\"I'm camped outside with my new ally Kai.\"\n\n\"Never seem to go alone.\"\n\n\"So it seems.\"\n\n\"I'll be killed at midnight tommorow, then you will be hunted down too.\"\n\n\"Don't worry old friend. You can count on us.\"\n\n\"What will we do when we get out of here?\"\n\n\"Go after this so called master.\"\n\n\"Then do me a favor.\"\n\n\"What?\"\n\nHe comes out of the water. He walks up to you and puts his snout on your face. \"Wake up...wake up...wake up...\" his voice says to you becoming fainter and fainter.\n\nYou open your eyes to see your blade in hand. Its changed in appearance: The blade itself was a deep shade of red and the hilt is the same except for a saphire on the end. You smile and know this will work out.\n\n                                   ", "action_results": [{"action": "Go into the Prison", "result": "You wake Kai. \"What...\" she asks half asleep. Her eyes are barely open. She falls into another sleep and you shake her. That makes her angry.\n\n\"WHAT!\" she yells.\n\n\"We're going in there now.\" you reply.\n\n\"Now? There's still hours till daylight.\"\n\n\"We need to go in there now. Redscale has been sending me dreams on how he's doing. We go in now because by midnight tommorow, he'll be dead. Why are we going now after a big fight? Night gives us the concealment of darkness. We only have one chance, so I will go in with or without you. Redscale's my world, so I'll go in and I'll die trying to save him.\" you say with affection.\n\n\"If we go now, we have time. Okay, let's go.\"\n\nYou sneak up to the prison wall and scan the area. You don't see anyway in, but after further looking you see a house. \"That house might be our way in.\" you whisper. You head in the direction with Kai following close behind. You  head toward the door and quietly open it. A guard is in ther asleep guarding a door next to him. You close it and whisper,\"There's a guard in there. Go in and take him down quietly. Then sneak around and get info. Don't make noise and run in the sign of danger. I'm coming with you in the house, but will seperate with you and find Redscale.\" She has no worry in her eyes, you can see determination.                                  \n\nKai heads in with blade drawn and cuts his throat. He falls and you drag his body outside to a big bush you see growing on the bottom wall.You head back in to see Kai waiting for you. You nod and go through the door. You go down a long passage underground and see a latter uphead of you. \"I'll go first.\" \n\n\n\nYou head up the latter to see a lit hallway that has two directions. You lift yourself up and whisper,\"Clear.\" Kai clinbs up and is next to you in a second. \"Don't make any unneeded noise. I'm going left. You take right.\"\n\n\"Zaron.\"\n\n\"Yeah.\"\n\n\"Better live.\"\n\nShe quietly dashes down the hall and takes a left turn. You walk in the other direction. You left your bow on Amin because most combat will be close up. You head down to two hallways leading in two differrent directions. One heads downstairs and the other up.", "action_results": [{"action": "Right (Down)", "result": "Redscale may be downstairs so you decide to go down. Sword drawn you head down to see doors.  All along the hallway.\n\n                                                   \n \n                                            ", "action_results": [{"action": "Dungeon", "result": "You see doors going all along the hall. The biggest is the one at the far end. You approach it with deep caution and peer through a window to it.                                             \n\nYou see Redscale there lying on the stony floor. You see keys on a table. A chair was there but no guard. You head to the door to put the key in the keyhole. You head in.\n\n\"I warned you whoever would come in would die.\"\n\n\"What did I do?\" you say playfully.\n\n\"Zaron!\"\n\n\"Let's go find Kai.\"\n\nYou her a scream from upstairs. Its no male. Then the saddening thought came to you. \" Go outside. I'll go get Kai.\" Redscale let loose a ripple of flame at the ceiling and flew outside the castle.", "action_results": [{"action": "Scream", "result": "You run up the stairs and see some man holding Kai by the arm. \"So you found your dragon, but that was not my true intention. Getting the princess was.\" That voice was very familiar. Then it came to you.\n\n\"It's been along time Quon.\"\n\n\"You remember me. How sweet.\"\n\n\"Let her go.\"\n\n\"I'd like to see you make me.\"\n\n\"Okay.\" You swing your sword at his head and he ducks letting go of Kai. She grabs her fallen blade and goes on the offense. Swing after swing she goes at Quon with. He blocks or dodges every blow she tries. You go at him with your blade and he cuts your thigh. You fall holding it. Then he swings and nails the hilt of his blade into Kai's temple. She collapses to the ground. \"You've failed Zaron. Your quest was successful, but your mission was in vain.\" A black shape came from above. It was Calivir. The blood surrounding you makes your vision blurry and you black out.\n\nYou wake up to see Redscale hovering over you.  \"You have waken. Where is your friend?\"\n\nYou look at your leg. It has clotted up and stopped bleeding. \"I'm such a fool. Why has that thought not occurred to me?\"\n\n\"Not everyone can predict what will happen.\"\n\nHe comes over and breathes on your leg. It starts to heal to a scar and finally to nothing. That get's you shocked.\n\n\"When did you learn to do that?\"\n\n\"People don't know everything about dragons. Many known facts on dragons are complete lies.\"\n\nYou look at the sky. \"Where do we go from here?\"\n\n\"We go back to Aravon or go for the rescue.\"\n\n \n \n ", "action_results": [{"action": "Go home", "result": "\"Let's go home.\" There was a faint disappointment in him. He did not argue. You go to Aravon on Amin and sold Shadow to a trader. You two live happily until you die of old age. Redscale then goes to live with his own kind. You often dreamed of what could have been.\n\n \n \n                                   ", "action_results": []}, {"action": "Rescue Kai", "result": "\"She helped me rescue you, so it's time to return the favor.\"\n\nYou get on Redscale's back. It felt prickly under you. You hold on to a spike that bunches ran down his back. \"Run toward the horses.\" He flaps his giant wings and is up several thousand feet in a matter of minutes. You aren't afraid because you became used to it from a very young age. He heads in the direction your horses are. They were grazing and drinking from a stream. They scuttle away from Redscale as he lands. \" So I fly above and scout the area.\"\n\n\"Tomorrow. We are gonna need rest and night is almost upon us. Plus we are gonna need to talk.\"\n\nHe gets into a comfortable resting position. \"Okay. What's on your mind?\"\n\n\"Does the name Calivir sound familiar.\"\n\n\"Yes, that's my father's name.\"\n\n\"He's working with Quon.\"\n\n\"That's impossible!\"\n\n\"I saw him!\"\n\n\"What color are his scales?\"\n\n\"Black.\"\n\nHe looks down. \"Only someone can remember a dragon's scale color once if he's seen it.\"\n\n\"So you believe me?\"\n\n\"Yes.\" You two rest for the night. You know where to look first: Quon's old training grounds.", "action_results": [{"action": "Quon's Old Training Place", "result": "You woke early in the morning to see Redscale looking at the sunrise. \"Beautiful. Isn't it?\"\n\n \nYou look to see swirling colors of yellow, orange and a light red color of the rising sun. \"Might be the most beautiful sunrise I've ever seen.\"\n\n\"Where we going today?\"\n\n\"Quon's training grounds.\"\n\n\"We're rescuing the girl?\"\n\n\"Yes. Either we'll save her or die trying.\"\n\n\"Why are we going there?\"\n\n\"Its the only lead we've got. Do you know where Igor's Tower is?\"\n\n\"No...\"\n\n\"Then that's where we check first. Fly above and keep watch for any guards, students, or demons of his.\"\n\n\"What of father.\"\n\n\"I couldn't beat him, but if you see Calivir you land at once! We need each other to finish this once and for all!!\"\n\n\"Understood.\" He takes off and soars above to keep watch over the land.\n\nYou arrive there in two days ride on your horses. It was once a plush place filled with flowers and life of all kinds. Now the place was a dead forest. No plants grew there and as your eyes could see there's no animal life. Redscale lands next to you. There stood the castle of Quon. Once a mighty place was now a former look of its former appearance. A destroyed castle. \"Let's   go.\"                                    \n\nYou ride to the former castle. You look around for any sign of Quon. No luck. Redscale sniffs the air around here. \"They were hear alright. Maybe four hours at best.\"\n\n\"Good going. Any sign of Kai?\"\n\n\"She's here.\"\n\n\"Now?\"\n\n\"Yes.\"\n\n\"Anyone else?\"\n\nHe had a sad face. \"Father's here too. Demons of all kinds too.\"\n\n\"We're going in. I know how hard it is to fight  someone you love. I felt like Quon is my father, but now I lost that love. I feel as if something is not right in there.\"  You walk in on Redscale's back. You see demons, but all they do is sneer and jeer at you. \"They don't stop us. Why?\"\n\n\"They want us to see what's in here. Let's go to the throne room.\" Redscale responds.\n\nWe go to the court room  and there you beheld a sight you may never forget. Kai and Calivir was there.\n\n\"About time you got here. I see you rescued Redscale.\" Calivir sighs.\n\n\"What's the meaning of this father?\"\n\n\"I work with Quon.\"\n\n\"WHY!!!\" Redscale roars.\n\n\"To save you from this human who calls you his \"brother\".\" Calivir says calmly. Kai comes at you  blade drawn. You get off his back with your sword drawn.\n\n\"She's being controlled.\"\n\nRedscale looks at me then snaps his head back. \"I'll never forgive you!\"\n\n\"I'm trying to save YOU!\" he shouts angrily shaking the room.\n\n\"I'm not asking to be saved. I DO think of him as my brother. We know how the other feels and thinks. We came for the girl. Give her to us.\"\n\n\"I'm afraid I can't do that.\"\n\n\"Why?\"\n\n\"She is under Quon's control. The only known way to break it is death.\"\n\n\"Zaron, take on Kai. I'll deal with Calivir.\" That's the first time you heard him say him by name.\n\n\"Kai, I'll make sure you won't die. Redscale, take on Calivir.\"\n\n \"Got it.\" His let's an inferno of flame at Calivir. The fight is on.", "action_results": [{"action": "Two Allies Fight", "result": "Forgive me Kai. I'll break this spell without killing you, you think as you go in.  She cuts and hacks at you without stopping . Each cut is blocked though you must get on the offense. But how, you say to yourself deflecting a thrust.  You could block or go on the offensive on your next move, but what would be the consquenses.\n\n \n                              ", "action_results": [{"action": "Offensive", "result": "You go on the offensive. You can't stay on defensive forever, so after her last blow you attack.  Blow after blow you drive her back. Redscale battles his father and by the looks of it is winning. You let your guard down for a moment to get a cut in the arm. Damn, you say to yourself. You then recall leaving your shield with Amin. you block another one and respond with an overhand cut. She deflects it. You see an opening and leap on her . Both of you hit the ground with a THUD. Both of your swords slid on the ground beyond reach. She keeps on hitting you and you refuse to fight.\n\n\"Fight me.\" she says punching you in the face.\n\n\"N-n-n-no...\" you say as you fall to your side.\n\n\"WHY?!?\" she screams.\n\n\"Your my f-f-friend...\"\n\n\"Even friends fight.\"\n\nYou stand up to see her in a fighting stance. \"Not like this... friends fight... but not like this.\"\n\n\"JUST FIGHT ME!\"\n\nYou shook your head. \"Kai, are you happy? Do your parents condone this. Strike me down. If it makes you happy, then I'm happy.\" You smile.\n\n\n\nSomething is different now. An opening has been made. You take a chance and throw her on the ground. You reach for your blade with her coming at you. You trip her and keep her grounded by your knees pinning her to it. I hope this works. You grab the hilt and put the jewel to her forehead.", "action_results": [{"action": "Break the spell", "result": "The sword and jewel light up. She stops struggling and looks at you. \"Why am I on the ground?\" she asks. You lift her up and don't answer. All you do is hug her.                                        \n\n\"I'm glad you're back.\"\n\n\"Where was I?\"\n\n\"Gone. But I found you again.\" She hugs you back and you feel that she's smiling. You know you will win this fight now.\n\nYou turn to see Redscale losing the fight. Claws and fangs were attacking him from each side. You turn to Kai. \"Let's help him.\"\n\n\"Come on.\"  And you charge together.\n\n \n ", "action_results": [{"action": "Battle Calivir", "result": "You get in between the recovering Redscale and the  towering Calivir. \"This ends here.\" Calivir merely laughs. He swings a claw at you and you roll out of its path. Redscale trys to stand but falls down.\n\n\"You are no match for me. You know of my kingship.\" You don't answer and aim for one of his legs. He flaps his wings and goes airborne. Kai goes and tends to Redscale. Calivir looks at her and aims a jet of fire at her. Redscale attempts to rise his head to shoot fire back but his head falls back down. \"KAI!\" you yell. Your sword all of a sudden blazes up with fire along the blade. You don't stare at it for long and aim it at the fire shooting at your friends. It goes and the fires collide. You move in the direction that Calivir's fire is. You align yourself with Calivir and wait.                                         \n\n\"So you learn some new tricks. Big deal.\" He looks at you. \"You're more powerful, but it won't save you,\" Redscale recovers and is behind you within a second. Kai follows shortly.\n\n\"You're right. It won't. But I've got friends to help me. We become strong if we're willing to save each other in our darkest moments. I now realize it. But we will finish it now.\" You smile at them.  Kai returns it but Redscale doesn't. He looks at you.\n\nCan you hear me. That's Redscale's voice in your head.\n\nRedscale, you think.\n\nYes. You can hear my thoughts and I yours. You have awakened your true power. Now let's use it.\n\nHow?  you ask.\n\nBy protecting those you care for.\n\nI must protect them. This isn't our battle anymore: it will determine the fate of Varon. We must win!\n\nYou focus all your energy to fighting Calivir. Your attacks become lightning fast. Calivir has no time to block them and soon falls from the small wounds you gave him. Not enough to kill but make him unable to fight.\n\n\"So this is how it ends, huh.\"\n\n\"Redscale, you decide your father's fate.\" Redscale comes over and you see his wounds were all gone.\n\n\"I've decided to spare you. Though if you intervene again I'll have no choice but to end you.\"\n\n\"Why?\"\n\n\"You are my father, but tell me why you joined Quon.\"\n\nCalivir has the pain in his eyes like in the cave. \"I was a fool. He promised me I'd win my son's heart over Zaron. I bought into his lies and lost what I wanted most; your love.\"\n\n\"I always have loved you.\"\n\n\"Then why did you never visit me? I'd lost hope and my heart became bitter. I'd lost the wisdom that dragons poccess. All to that I'd thought you've forgot me, but my guess is you never had.\" \n\n\"Dragons never forget their relatives.\"\n\n\n\n\"Well since I'm not making it back you have a job.\" Redscale looked confused. \"Since I'm no longer able to be King of Dragons it is now your job. Rule over us with pride son. And may I speak with you Zaron.\" You walk up to him and kneel by his head. \"Forgive me for my blindness. I never saw what Redscale meant until now. Take care of Redscale. For... without him... you'll find out life is... hardly work living... at all.\"\n\nRedscale comes over and says to Kai and you, \"He may not have been perfect but nor is anyone else. He was a confused and saddened dragon. But in the end he was a hero. As the new king I must go announce my father's death and claim my right as king. Are you two coming?\"\n\n\"I am.\" you announce.\n\nHe looks at Kai. She sighs and says, \"I'm coming. Though know now that I am the princess of Varon and the dragons have never been fond of us. Since the war five hundred years ago we've managed to get along, though never really made up for it.\"\n\nRedscale says, \"I forgive your people for your past deeds. What happened then can be fixed by YOU. Zaron and Kai; you are now official representatives of the human race. Do you accept?\"\n\nYou answer for you two, \"We do. But what of our horses?\"\n\n\"You must sell them.  Grab your shields and some food.\"\n\nYou nod and grab the shields and food. You then sell your horses to a traveling trader and go to the dragon's cave.", "action_results": [{"action": "Go to the Dragon's Cave", "result": "With Calivir left in the castle you head out. Redscale gets down on his chest and you climb to grab a spike on his back to hold on to. You help Kai up and put her in front of you. \"Grab a spike and hold on.\"\n\nRedscale gets up and asks, \"Are you ready back there.\"\n\nWe are. You decide to answer through this new telepathic communication you two share. He goes up and you head in the direction of his clan's cave. \n\nAfter a few hours riding on his back a new mountain range comes into view. You and Kai look down to see wildlife of all kind. Flashes of animals you see are wolves, deer, moose, birds and fish. Plants can be seen as far as the eye can see. Do you  like it? Redscale asked.\n\nIts great. It looks as if no human has been here forever, you respond.\n\nNo human ever has because of the dragons that live here, he says.\n\nHe turns right and heads to a small cliff on one of the mountains. A big cave stood there.                               \n\nI can see a dragon living here.\n\nPretty much anyone could see that. The clan would attack any human that came here without a dragon. They already saw us. So let me talk to them. Are you alright with that?\n\nWill they attack us, you ask.\n\nThey may. But they usually would question a dragon. Here comes one now, he says.\n\nA big silver dragon comes out and stands between you and the entrance.  You stand there unconcerned by this dragon. It looks at you and simply nods as if he approves of you. But when he turns to Kai there is a different reaction. It is of confusion and anger. It finally speaks, \"Welcome to the Draco clan. Dragon, why are these humans here?\" The voice of it is female. Comparing the size to Redscale its at least a few centuries old.                                                                  \n\n\"These are the human representatives. I'm Redscale and these are my traveling companions: my brother Zaron and Princess of Varon Kai.\" Redscale replies.\n\n\"Your brother? This human.\"\n\n\"Yes.\"\n\n\"You're Calivir's son. Is Calivir among us anymore?\"\n\n\"Unsure. He might have passed out in our fight. He's been working with the wizard Quon.\"\n\n\"Come.\" She heads in and you follow close behind Redscale.\n\n ", "action_results": [{"action": "Follow the dragon.", "result": "You head in and for about a hundred  meters you can't see a thing. Kai puts her hand on yours making sure you weren't seperated from one another. You finally see a light up ahead and are amazed by what you see.\n\n There was a large hole at the top of the mountain, letting the sunlight through. Grass and flowers made the ground glow like a rainbow. Looking above, you see hundreds of caves varying in size and shape. Then dragons come of the caves and look down at the passing figures. Some gave looks of surprise, others hate, and others of happiness. You were led down another passage way to a fire lit room. Three large dragons and a small one the size of Redscale sat there. One was gold, one deep blue, another was red like Redscale, and forest green. Whoever these guys were they were expecting you.                                  \n\n\"May I introduce the three elders of the Draco clan. The gold one is Haru, the green one Mia, the red one Scaro, and the young blue one Sea. And I'm Moon,\" the silver dragon says. \"Is there anything else you need elders?\" They shake their heads and Moon leaves.                                    \n\nHaru moves in your direction. Haru looks at Redscale and nods. \"You'll be a fine dragon one day.\" Its voice is female. Haru then sets her eyes on Kai and you. \"You two are the first humans to ever set foot in our clan's caves.  We knew Redscale had a human companion, but the princess of Varon is another story. We don't have any affection for your family girl.\"\n\n\n\n\"Do you still have a grudge against us?\"\n\nThe red dragon Scaro speaks up, \"May we speak of the matter of why they're here Haru? I have no affection for her either, but let's hear what young Redscale has to say.\"\n\nRedscale goes by us and says loudly, \"Dragon Circle, I bring grave news of Calivir and a request.\"\n\nThe green dragon Mia finally speaks, \"We will grant your request if its within our power, but what of Calivir?\"\n\n\"Calivir as you all know is king of the clan. Recently, he has been working in league with the wizard Quon. He and his demons captured me and brought me to a prison in Oscro. My companions rescued me for us turning to rescue Kai. We went to Quon's former castle to see Calivir waiting for us. He brainwashed Kai into fighting Zaron there, but he managed to break his control over her.  We managed to overpower Calivir and after the battle, he named me king. I have no idea if he's still alive, but we need your help. We then had no idea for the location of Igor's Tower. We have roamed far and wide for if you don't know then no one knows.\" He finished the tale of your quest.\n\nHaru looks mad at Kai and says, \"We can't help.\"\n\nThat gets you mad, but your teachings taught you to be calm at all times.\n\n ", "action_results": [{"action": "Mad", "result": "\"What do you mean you can't!\" you yell. Haru was surprised by your outburst.\n\n\"We know the location, but won't reveal it.\" That get's you even angrier.\n\nCalm down, Redscale says in your mind.\n\nShe is just annoying.\n\nLet me handle handle it.\n\nFine, you grumble. You start to calm down and eventually regain your senses.\n\n \n                                   ", "action_results": [{"action": "Calm", "result": "\"Dragon Circle\", Redscale roars, \"My father has named me the new clan king. So as the new king I order you to tell me the location of Igor's Tower.\"\n\nHaru sighs. \"Fine. Young Sea here will take you.\" She motions for the young blue dragon to come over next to her. \"She will take you to Igor's tower and help you end this darkness over the land. She's one of our greatest fighters and will fight to her last breath.\"\n\nYou calmly wait for Redscale to respond. Finally he says, \"What of my kingship?\"\n\n                                              \nScaro replies, \"You are a young king, so we will advise you until you're old enough to make your own decisions.\"\n\nMai says, \"You must return once you finish. Return them to the Varon capital and we will announce your new rule.\"\n\n\"And as for you Kai.\" Haru swipes a claw at her. You react and block it with your shield. You draw your sword and its blade gleams with glee. Mia and Scaro moved quickly for their age between you and her. Scaro screams, \"Haru! Return to your cave at once!\"\n\nShe prowls out with anger. You bow to the dragons. They incline your bow with a nod.\n\nSea speaks to you three, \"Let's spend the night here.\"\n\n ", "action_results": [{"action": "Rest.", "result": "Both dragons fly up to Sea's cave.  It was like a regular cave.  Everything made of stone. The two dragons retire as Kai and you head out and sit on the edge of the cliff. Kai finally says, \"Why'd you come and rescue me from Quon?\"\n\n\"Well I could not leave you. Why'd you not leave yet?\"\n\n\"I don't know why.\"\n\n\"This place is pretty.\"\n\nShe seems sad. You can tell by this next response, \"Sure. Its really pretty...\"\n\nYou now are concerned about her. What could be bothering her? \"What's wrong?\"\n\n\"When this is all over I'm gonna have to marry that creep Warren. He's three times my my age.\"\n\n\"Do you have a choice?\"\n\n\"Why? They arranged this years ago.\"\n\n\"You have a choice.\"\n\n\"What?\"\n\n\"To marry someone YOU love. Not some guy they tell you to.\"\n\nShe smiles and leans close to you. \"You're right.\" She kisses you. You're shocked yet somehow pleased. You are close together until Redscale comes out. You both don't see him until he says, \"Having fun?\"\n\n Kai pulls back almost immediately. She gives you a hug and goes in the cave. \"Why'd you have to ruin the moment?\"\n\n\"For rest.\"\n\nKai is in a corner. You look in a bag you brought and hand a blanket to her. \"Time to sleep.\" You turn and she grabs your wrist.\n\n\"You are sleeping by me tonight.\" You nod. You fall asleep in each others arms smiling. You dream of a wonderful future you will have with her. For once in your life you feel true love.\n\n ", "action_results": [{"action": "Shocking News", "result": "Last night is a night you'll never forget, but that's the past. Kai and you wake up early. Not that you wanted to but of the dragons making loud noises. You grab an apple from your bag and eat it. \"Let's head out,\" you say.\n\nMia and Scaro meet you outside of Sea's cave. Scaro whispers something to Mia and flys off. \"I've got grave news my friends.  Scaro was flying toward Igor's Tower to see Quon's armies marchng toward Varon. Even having the second largest army in the world Varon would be wiped out. Unless...\"\n\nKai stepped foward with determination on her face. \"Unless what?\"\n\n\"Unless the dragons weren't mobilizing to help. We've been stuck in petty hate for years and are ready to reestablish our friendship with the Varonians. Will you help us Kai?\"\n\nKai smiled. \"I will help. And when I take my father's throne you will become honored counsel members.\"\n\n\"Thank you. Now you must go warn your father and have him mobilize your army. We will come when we are ready.\"\n\nRedscale comes and asks Mia, \"Have you told them of the Circle's choice?\"\n\n\"I have.\"\n\n\"Then go prepare. We will go visit the king.\" She flys off and Redscale says to you, \"We are gonna need a whole lot of luck to win this.\"\n\nKai laughs. \"Don't worry. We have a great army in store for this. We faced threats like this before.\"\n\n\n\nYou step in. \"Come on you two. We have a job to do.\" Sea comes from another cave further down and comes to you. \n\n                                           \n\n\n\n\"I'm coming to.\" There was not any disagreements on it and Kai gets on Sea's back while you Redscale's. You head in the direction of the Varon capital Yeli. ", "action_results": [{"action": "To Warn a King", "result": "You fly in the direction of Yeli. Yeli is the most populated city in Varon. The first wall was in your eyesight and guards see you, yet don't stop you. You head over the city and people look up. The color drains from their faces and the run in the nearest building. The castle loomed in the distance and had a second wall protecting it. \"Land in by the entrance,\" you tell Redscale. \n\nThe two dragons land by the two large doors that go into the castle. Further down guards came and surrounded you in a circle. A man in the group comes foward. He studies you and Redscale. Then looks at Sea and sees Kai on her back. That shocks him. He stammers, \"W-w-what are y-y-you doing on a d-dragon?\"\n\n\"Captain!\"\n\n \"Yes.\"\n\n\" Fetch my father.  We have a horrible situation coming our way. And hurry!\"\n\n\"Yes mistress.\" And goes to get the king.\n\nThe king sends you to his chambers to talk to him. He was a large man. He wore the traditional robes of the royal family. Its color was a deep saphire and gold. He looks with interest as Kai and you enter his private study. He finally talks, \"You have put me in a deep issue here. Kai... you are supposed to be at Lord Warren's palace by now. He sent message that you never came.\"\n\n\"I was ambushed and fled while my escort held this large group of bandits off. This is a discussion another time. You have a larger threat in the making.\"\n\nHe walks around the room pondering that thought. \"I see no threat large enough to be of concern.\"\n\nYou shake your head. The king sees and asks, \"Who may you be?\"\n\nYou respond, \"The one who saved your daughter.\"\n\n\n\n\"Why didn't my daughter return here then?\"\n\n\"She offered to come along in my quest to save my dragon.\"\n\n\"I'm afraid you can't do that.\"\n\n\"It was already done.\"\n\n\"I thank you for saving her, but why are you still here then?\"\n\n\"To stop my old master Quon.\"\n\n\"What do you mean?\"\n\nKai interrupts, \"He turned evil long ago. He took control of my mind and Zaron here saved me. He made an army large enough to destroy Varon. They are coming here as we speak.\"\n\n\"Then there's no hope.\"\n\nYou say, \"There still maybe is.\"\n\n\"Where?\"\n\n\"The dragons have overcome the hate of Varon and are mobilizing to help.\"\n\n\"Only the king can be giving that order and Calivir would never do that.\"\n\nYou can feel the pain in his voice. \"Calivir is no longer among us as we know, but his son is my brother and he issued the help of the Draco clan.\"\n\n\"May I speak with him?\" the king asks.\n\n\"Follow me.\" All three of you head out to Redscale and Sea. ", "action_results": [{"action": "King to King", "result": "The dragons were lying down in the courtyard where you last saw them. The king had a worried look on his face.  They got up and look down on Kai's father. \"You are the king I presume\",  Redscale asks.\n\nThe king gets over his nervousness and responded, \"Welcome to Yeli. What makes you come to Yeli?\"\n\n\"The threat of a madman's demons. We have come to aid you and the dragons will join later.\"\n\n\"We must first come to the issue with you three now. Our army will prepare for this at once. First I've got to start with Zaron.\" He looks at you. \"I don't agree with what daughter and you did, but it may have saved us. I will have to have a fully detailed report on what happened between the rescue of your dragon to your arrival here. Please don't lie on anything. Come to my private chambers tonight. And Kai too. Dragon, may I speak with you alone?\" Redscale nods and they walk off in another direction.                                    \n\n \nKai and you walk towards her father's private chambers. You come to a door with an eagle symbol on it. You knock and a male voice answers, \"Come in.\" You go inside the room.The king sat on his bed. It was large and had the most exspensive bedwear out in the kingdom. His look was of pain and sorrow. \"Sit there\", he said pointing to a pair of wooden chairs. He gets up and walks back and forth between Kai and you. \"I've recieved a message from Warren asking why Kai isn't there. I responded to him of what happened to the escort and what transpired between you. He is to arrive at morning tomorrow, but what I called you here for is something to do with the marriage between Warren and you Kai.\"\n\nYou speak up, \"Why am I here sir?\"\n\n\"Call me Ponis. And because I have a suspicion something may have happened between you two. I'm not angry, but there may be some issue with it.\"\n\nKai's body froze up. You had a similar feeling in your body. Kai recovered and was the one who spoke up for the two of you, \"I'm going to have to say a kiss and a bit more. I don't think the marriage with Warren is what I want. I don't love him.\"\n\n\"I do understand. I fell in love with someone of nonroyalty. It was your mom Kai. If you do love him I will support you.\"\n\n\"I do.\"\n\nHe smiled. \"Then may the gods look over you two. You may go. We will talk of this tomorrow with Lord Warren.\" Both of you go to your bedrooms for the night.", "action_results": [{"action": "Redscale explains", "result": "Before you went to bed you went talk to Redscale. This power thing between Redscale and you has been something the occasion to talk of never offered till now. You went to the courtyard since there was nowhere in the palace big enough for him, so you walk up and sit next to him. Is there a problem?\n\nThere is Redscale. Its the entire power that we share. One is how my sword changed its appearance and has different abilities. Also how we can talk through thinking? How is this even possible?\n\nRedscale laughs. He responds, Many people over the ages in different places had bonds like ours. We are known as Entrin by the dragons. Or in your language known as Dragon Rider. We share feelings, thoughts, and are even considered realatives by some. The bond gets so strong by a human and dragon at times that supernatural things may happen. Just like your sword for example. There are none known aside from you and me since the war between our races.                                   \n\nWhy was there a war?\n\nHe looks to the night sky. You look at them with them and see thousands of little dots up there. Redscale answers, Its like those stars. Two worlds collide with different beliefs and traditions than the other. The stars represent the lives of humans and dragons. I can't say who's fault it is who started the war, but can say it killed it millions. People in and out of the war. So its just as bad. Though good came from it.                                               \n\nWhat?\n\nThe bonds that came between our races. It became the strongest link to connect humans and dragons, but evey person with a bond with a dragon took it very seriously. Now go rest . For you will need it for Lord Warren's arrival tomorrow. You leave Redscale and go to your room for the night.\n\n \n ", "action_results": [{"action": "Lord Warren's arrival", "result": "You are dreaming of a bright future with Kai and Redscale. You are the king of Varon and are sitting at a large round table. There are knights all around it. You seee them arguing about something. A pounding starts and you jump up. \"What's that?\" Your knights look at you with a worried glance. One of them gets up and looks at you. The pounding resumes until everything goes dark.\n\nYou launch up in your bed. You look at the door and the pounding was something from there. A voice said, \"Get dressed and to the court yard.\" Someone left you a new outfit: a expensive silk shirt with a detailed drawing of a red dragon on it with a  jacket to put over it. A pair of pants with a belt so you could have your sword with you. Finally with a pair of boots.                  \n\n\"Nice clothing.\" You get dressed and strap your sword on. You head to the courtyard to await the arrival of Warren.\n\nIt turns out you didn't have to wait. Ponis, Kai, and a man of sixty stood there. He had snow with hair and had a scar below his left eye. You walk up to hear him say in a raspy voice, \"... but the marriage was made years ago!\"                                                                      \n\nPonis repiles, \"I'm sorry old friend, but she already loves a man.\"\n\nThe man says angrily, \"Who may this coward be?\"\n\nThis man is getting on your nerves, but you announce your presence to them, \"Fair day to you three I suppose?\"\n\nThe man turns to you. \"Who may you be?\"\n\n\"Zaron.\"\n\nHe nods. \"So your this Zaron character I've heard about. You love Kai I suspect?\"\n\n\"I do.\"\n\n\"And you know of...\"\n\n\"The marriage. We talked about it.\"\n\n\"Then you must know the rules of that interference? You know peasants can't marry a royal family member?\"\n\n\"I'm familiar with them, but there is a way they can.\"\n\n\"And that is?\"\n\n\"Is that if the courter is beaten in single combat that he drops any rights to the member of the royal family. If my assumption is correct Ponis?\" He nods.\n\n\"You think you can beat me boy?\"\n\n\"I know I can!\"\n\n\"I have won some of the greatest single combats in history, You scared?\"\n\nYou look at Kai and smile. Then return to his glance and frown. \"I've beaten stronger people than you.\"\n\n\"Then I Warren accept your challenge.\" He draws his sword and prepares to fight.\n\nYou go for your sword until Kai says, \"Wait.\" She walks up to you and gives you a long kiss that makes your mind feel like its melting. She steps back and whispers, \"Please defeat him.\"                                       \n\nYou give her a kiss on the forehead. \"I'll win. Just like the battle with Quon.\" You draw your blade. Its red blade flashes with glee.", "action_results": [{"action": "Attack", "result": "You attack him with swordcuts from all angles. He is forced to block them. You manage to get a cut on his left arm. He jumps back and preapres to attack.\n\n \n \n                            \n \n                                        ", "action_results": [{"action": "Attack again", "result": "You attack again to keep the momentum up. You continue the attack and push him back. He tries to attack and he gets cut in several different places. Its tiring you out.\n\n \n                                   ", "action_results": [{"action": "Attack again", "result": "Your fatigue sets in and you fall to your knees, so you don't see his blade come toward your head. The ground is the last thing you ever see.\n\n \n \n                               ", "action_results": []}, {"action": "Defend", "result": "You go on the defense while he wears his strength down. He goes blow after blow and on his face you you can see his exhuastion grow. He stops to catch his breath and that's when you strike.\n\nYour age helps because of endurance. He recieves blows all over his body and he falls to the ground. Warren coughs blood from his mouth and mutters, \"D-d-do what y-y-you want with m-m-me.\"\n\n \n                               ", "action_results": [{"action": "Spare Him", "result": "\"You may have some great victories in the way of the sword, but I have more duty to rid this land of a great evil. You may live, but never return to Varon. And if you do I'll have no choice but to end you... forever.\"\n\nHe gets up and with his old gaze replies, \"I acknowledge defeat. I retake any claim I've got to Kai. You are a worthy man to marry her. May you two live in harmony for all enternity.\" He bows to you and asks to King Ponis, \"May I see your healer?\"                                  \n\n\"You may.\" For that is the last time you see Warren .\n\nA few hours later when a feast is prepared for your victory a messager comes and announces, \"The dragons are here.\"", "action_results": [{"action": "Dragons' Arrival", "result": "The dragons filled the courtyard as you exit the castle. Ponis come close behind with Kai and whispers, \"Oh my god!\"\n\n\"They won't hurt you,\" you assure him.\n\nHe gulps and says, \"I hope so.\"\n\nRedscale came through the mass of dragons and heads in your direction. He says, \"There's five hundred thousand of us here. The others will be defending our home.\"\n\nPonis replies, \"That's good. How far is Quon from Yeli?\"\n\n\"I'd say two weeks away.\"\n\n\"I'll go prepare a meeting with my generals. Come as soon as you announce what to do.\" He leaves leaving Kai, Redscale, and you with the other dragons. You say, \"Let's get started.\"\n\nRedscale nods and lets go a big roar to tell the other dragons to quiet down. He speaks loudly so every dragon could hear, \"We have come to an end of an era of hate and mistrust between our races. We have all agreed to fight together to stop a threat in a man we always trusted: Quon! A man who twisted Calivir's way of peace and trust to hate and bitterness. A man who capture a dragon against his will. A man who wants to destroy both our way of living. I say we work as one to stop this threat. I came to care for a human. So much that the bond we thought never would happen again did happen. Entrin, dragons, Entrin! The bond between a dragon and human. I have bonded with Zaron, but we share more than what our legends say. We have done more than any other pair that has existed. Dragons, will we fight to keep our ways the same or forever killed?\"\n\n\"Fight for freedom,\" the dragons yell.\n\n\"Now let my friend speak. Zaron.\"\n\nYou walk up and nod. You say as loudly as possible, \"We have come together for a common cause: Quon's death. All of you should hide in the forest and wait for his flying demons. The final confrontation will be between Redscale and me against  Quon. We will be prepared. Please try not to terrify Yeli. All of you may head to the forest.\"\n\nThey head to the forest, but the red dragon Scaro stayed for a second. He said, \"After the meeting come to the forest to talk.\" He flys off.\n\n\"Kai, let's go to the meeting. Redscale, wait for us to be done. Go with your clan for now.\" He flys away and you mutter, \"What a day it has been.\"", "action_results": [{"action": "A Plan", "result": "You follow Kai to the meeting room with Ponis and three large men waiting for you. All sat at a circular table with a map of the surrounding areas. They had little wodden figures on it to represent varon's troops, the dragons, and Quon's demons. You took a seat next to one of the generals and Kai sat next to her father. Ponis stood up. Zaron. I'd like you to meet Generals Aso, Tumera, and Ferka.\" The one named Aso was a large blond headed man who looked to have years of experience in battle. Tumera was a dark skinned man who must have been a general for a short time. Ferka was the one who was the pale one of them, but he looked to be a good strategist. You shook their hands and sat to begin the meeting. Ponis said, \"All the citizens will be sent to our ally Skania. I got the emperor's approval. All the provisions will be provided. Now onto the battle plan.\"                                                                                                                     \n\nFerka says, \"We have one your Majesty. We came up with it while you told us of the dragons. We will have the dragons handle our arial combat while the troops handle the ground. My 7th Legion will defend the courtyard and town area.\"\n\nTumera says, \"My 1st Division will handle the gate areas.\"\n\nAso finishes, \"And my 2nd Division will fight further out.\"\n\nPonis says, \"Okay. What will Zaron do?\"\n\nAso answers, \"He will be in my 2nd Division fighting outside with my soliders. Kai will help defend the castle.\"\n\nKai looked steamed. Though replies calmly, \"I'll fight further out. I'm fighting with Zaron and there's no stopping me.\"\n\nAso stammers, \"But princess...\"\n\n\"That's final.\"\n\n\"Fine. This meeting is dismissed.\"\n\nEveryone leaves the meeting room. You go to where you sent Redscale to see what's he wants.", "action_results": [{"action": "Continue", "result": "You think of what could trouble Scaro. Nothing comes to mind as you head through Yeli with speed. Kai and her advisors are talking over some private matters, so she couldn't come. Ponis was too nervous to even consider to. The generals were busy preparing to evacuate the citizens, but you were given no job. It gave you the free time to do as you please, but since Scaro has to talk you should see what he has to say.\n\nYou head out the gate and see the first wave heading out the northeast gate. You say to yourself, \"I wonder what would have happened if Redscale never came into my life, but I wouldn't have it any other way.\" You smile and head for the forest with that thought.                              \n\nYou look around for sign of the dragons. They had a habit of scorching trees and have tend to leave huge footprints. You walk for a few hundred yards until you see a few dragons flying overhead. You follow under them until you come to a large open area. The dragons were talking to each other and stop and look as you walk by them. You have to walk to the center of their little camp until you see Scaro, Redscale, and the green dragon Mia. Scaro sees you and motions for you to come to him. He says, \"Haru betrayed us. She was working for Quon the whole time. We were fools. Her place will be taken by Sea, but where is she?\"\n\n\"Oh, Sea? She's with Kai. She seems to have taken a liking to her,\" you reply.\n\nHe laughs. \"Seems your bad influence is starting to rub off Redscale.\"\n\nHe snorts. \"I doubt it.\"\n\n\"It is! It is! You may be a great king one day.\"\n\n\"Thanks. And how is it?\"\n\n\"The bond you and Zaron share made her think of it.\"\n\n\"Fair enough. What is the plan?\"\n\n\"Haru will most likely be carrying Quon. What most people don't know is past Dragon Riders have worn a dragon's saddle. Its used to keep the rider safe from the dragon's scales. We have one here that was newly made from an ally. Its for you Zaron. It is like a horse's saddle, but made for dragons. I'll tell you how to put it on. It has two safety buckles on the bottom to made sure it doen't move around. They are in between a middle buckle to make sure you have it on before you do the other two. You would see two footholds going down with a long piece of strong cloth. Step in it and sit in the saddle. That's about it.\"\n\n\"Where is it?\"\n\n\"Its behind me. Train for awhile. It will come in handy in tough predicaments. It won't matter how bigger Redscale is, but have a good time flying safer in the sky. You may go.\"\n\nYou bow to them and put the saddle on Redscale. He takes flight and its basically the same without the saddle. Still you decide to practice just in case.", "action_results": [{"action": "The first invasion", "result": "The days went by with training with your sword, to your nights spending with Kai, and to the hours training as a Dragon Rider with the dragons. Life would be great if it wasn't for Quon, but you already are ready for him. The thing you don't know is that a preinvasion Quon had. You were in the castle learning about Kai's backround and family history when the invasion started. Bells rang and you leap out to head to the courtyard. Redscale was fighting demons off.  None got to him. He slashed and bit and smacked all of them around leaving none left standing.\n\nRedscale!!!\n\nI'm fine. Get on. You were flying earlier and left it on for the invasion. You get on and he begins to circle the city. Demons and soliders were fighting off demons at every corner. He returns to the courtyard to you see Sea and Kai there. They both looked worried.  \"Kai, it's hell out there.\"                              \n\n\"Well that's bad. I also got a saddle for Sea. We decided we're partners since we are similar in many ways.\"\n\n\"Great!\"\n\n\"We going to fight?\"\n\n\"From above.\" Your both in your saddles and get in the air. You draw your sword and Redscale and Sea flew upside down so you could slash demons. This is around the time when they began to retreat. You watch until they are no longer in view.\n\nThe deaths were in the hundreds. You were all over and did many jobs. The final fight will start the next day.", "action_results": [{"action": "The final invasion starts", "result": "You were summoned to the throne room. Kai, Sea, Redscale and Ponis were there talking as you got there. \"... no way Zaron can win,\" Ponis says as you walk up.\n\n\"Win against who,\" you ask.\n\nHe jumps. \"When did you get here?\"\n\n\"Just now.\"\n\n\"Quon's army did some serious damage, but we have millions of soliders left to the hundreds we left.\"\n\n\"Were you saying I wouldn't beat Quon?\"\n\n\"I did.\"\n\n\"Well I'll win.\"\n\nThen a pounding noise was outside. It shook the whole castle. You were to put on a suit of armor. You did that and wore a suit of armor made of ruby, metal fused into it. Then that's where the talking stopped.                                       \n\nQuon has arrived. \"Redscale!\" Both of you rush outside. You see him and Haru waiting in the sky above. You mount Redscale and he flaps his wings with strong gusts of wind and pushes himself into the sky.\n\n     \n                                     \n                                      \n ", "action_results": [{"action": "Quon's Challenge", "result": "You head in the direction of Haru. Quon was in his saddle. His snow white hair became much clearer on his pitch black armor. He had a golden sword in one hand and a shield in the other.\n\nYou drew your sword. Its red blade gleemed in the morning sun. A smile crosses Quon's ancient face. \"So its come down to student and teacher. Will you back down?\"\n\n\"We won't.\"\n\n\"Join us! We can teach you so much. We could make all your desires come true!\"\n\n\"My dreams are here. With Kai, Redscale, and Sea. They're my desires.\"\n\n\"Then I suppose you leave me no choice.\"", "action_results": [{"action": "Redscale blows fire", "result": "Redscale blows fire at them. The fire hits them and you think its over.  You can't see as smmoke covers the area they're at. The smoke clears and they were not even damaged. He smiles and Haru does the same to you. Redscale flys sharply left to avoid the flame. You can't get why the fire didn't hurt them, but you don't dwell on it for long.\n\n                                                   \n                                                     \nThey move in and it's now close combat. You aim for a leg on Quon and he blocks you sword with his own. The fight between you and him with the dragons is getting you nowhere. He gets a pleasant look in his face and says, \"Let's do this alone.\"\n\n \n ", "action_results": [{"action": "A Long Fall", "result": "Quon snaps his fingers. A rumble went through Redscale's body and he begins to fall to the ground. \"Redscale! Redscale! Are you okay,\" you ask nervously.\n\n\"I can't move my body!\" He wiggling underneath you, but still no major body movement. Looks like the end of you two. In your mind it goes the other way. I can't die here. We came too far to lose now. He defeated Redscale so easily with his magic. I need the power, you say to yourself. You know that your family used to use magic for the royal court to help the people of Varon. You hope that the power is somewhere in you that remained dormant, but its unlikely. You get mad. Then some spark of unknown energy sparks through your body. Redscale begins to slow down and lands in the city unharmed. You slide out of the saddle as Redscale landed.                                \n\nRedscale collapses to the ground. \"I can't move. Looks like you'll have to fight on your own...\" Redscale is either dead or knocked out, but that makes you check for signs of life just to make sure. He's breathing, so he should be fine. Your anger is flaring and you look at Quon in the sky to see him smiling.\n\nThe fighting is further down the street. Among the fighting is Kai who saw what happened and runs over to you. Your anger is preventing you from noticing her. She says, \"Zaron, is Redscale okay?\"\n\n\"He's unconcious, but he should be fine.\"\n\nShe sensed something. Something abnormal, so she looks at you to see a red aura coming from your ruby armor. \"Your armor is glowing.\"                                                                                          \n\n\"I know,\" you reply.\n\n\"You were falling to fast to slow down by normal means, so you must have used...\"\n\n\"Magic. I did to save Redscale. I didn't know how to use magic until now. My family as you know used magic all those years ago to aid the royal family.\"\n\n\"But yours is aided by your anger. You must calm down.\"\n\n\"I... can't.\"\n\n\"You can. What would Redscale say?\"\n\nThat snaps you back into reality. You have a short thought on what'd he say. He'd tell you magic is the energy that flows through the kindness of people and all living things. Its possible to do many things. Your breathing slows down and you can think clearly now. \"Thanks. I'm better.\"\n\n\"You have a better chance to beat Quon now. You can use magic, but don't through rage.\"\n\n\"Okay. But what of Redscale?\"\n\nShe gives you a kiss on the cheek and says, \"I'll tend to his injuries. Now go and fight.\" She starts to care for Redscale's wounds. You run in the other direction to the gate to get to Quon and Haru.", "action_results": [{"action": "To fight alone", "result": "You dash out the gate and head in the direction of Quon. He is still airborne. Haru begins to lower herself to give Quon and her a better fighting zone. \"So you have unlocked your hidden power?\"\n\nYou don't answer as you get into a fighting stance. He sighs. \"Why do you always want to do the the hard way? You were always like that and still are.\" Haru breathes fire at you.\n\n \n                             ", "action_results": [{"action": "Block with shield", "result": "You block the fire with your shield and jump left. Quon shoots electricity before you can attack and you roll out of the way. You use your magic to lift Quon from his saddle and throw him to the ground. You'll have to fight a two on one battle, but you know you can't die until they are dead.\n\n \n                                   ", "action_results": [{"action": "Attack Quon", "result": "You aim for Quon. He is the reason that this battle is taking place. It's hard at first since of Haru, but eventually you come up with ideas to move around her to attack Quon. He becomes more desperate as he knows your gaining control of the fight.\n\n                             \nHe began to attack you from a sides and was getting more reckless. Soon he began to regain his senses and used magic on you. You block most of it, but a lighting bolt hits you in the chest and you fly back to hit a large rock. You see them above you ready to finish you when a fire blast knocks them away.\n\n                          ", "action_results": [{"action": "An Unexpected Arrival", "result": "You are struggling to focus when a familiar voice, but faint, say, \"I suppose I'll fight with you.\"\n\n\"Who... are... you?\"\n\n\"You mean you don't remember me?\" Your eyes begin to refocus and you see a former foe: Calivir. That was a shocking since the last time you saw him he was on the brink of death. He stood over you looking for you to get up. \"Come on. It won't take long for them to recover.\"\n\nYou get to you feet and look at him. \"You are going to help me?\"\n\n\"I'll fight till my last breath. I will die anyway because of my injuries. I found an old friend who put a temporary spell on me that will help me fight with you. Where's Redscale?\"\n\n\"With Kai trying to heal him. We fought them and we were tossed around like we were like children.\"\n\n\"I'll hold them off. Redscale will have to fight Haru alone. You on the other hand will fight Quon alone. The dragons in the sky are aware of me and the spell. I'll seperate them.\"\n\n\"No. We fight together.\"\n\n\"Fine. Get on my back.\"\n\n \n \n                             \n ", "action_results": [{"action": "Redscale Recovers", "result": "Redscale begins to regain his senses. He moves his legs, tail, and neck. He opens his eyes to see the princess Kai over him. \"What is it, Kai?\"\n\n\"Oh! Your awake? You'd better hurry.\"\n\n\"Why?\"\n\n\"Zaron is fighing alone.\"\n\n\"Not for long!\" Redscale opens his wings and flies off looking for Zaron's scent.                          \n\nKai stood there alone. She sighs. \"These two were made for each other.\" She laughs to herself.\n\nA man comes up and says, \"You are needed Kai.\"\n\n\"And so here we go.\" She heads off in the direction of where she's needed.", "action_results": [{"action": "Fight with Calivir", "result": "You got on Calivir's back and got ready to continue the fight. Haru got back in the air and stood about thirty meters away from Calivir. Quon was rubbing the back of his like he's hurt. He says, \"Well this is shocking. Calivir, I thought you were dead. And to think you'd betray me. Yes, very shocking indeed.\"\n\nCalivir merely snarls at Quon. \"What now Zaron?\"\n\n\"We fight.\"  He launches a ball of fire from his jaws and aims it at them.                               \n\n That made him go on the defense and you ask what will you do next?", "action_results": [{"action": "Sword", "result": "You have Calivir go in close so you can use your sword. That was your mistake. He was wanting close combat.  He cuts your back and then stabs your heart. He cuts Calivir and then Haru finished the job.\n\n \n                                          ", "action_results": []}, {"action": "Magic", "result": "You feel the power of magic flow through your veins. This power was yours and you focus all of it against Haru and Quon. You used fire, lightning, water, and much more against the pair. They couldn't keep this hell away. Quon smiles. Of all the things he can do, he smiles. Then he looked at Calivir.\n\nHaru moved in and Quon stabs Calivir in the heart. You tried to stop him, but were a split second too late. \"NOOOOO,\" you shout. You begin to fall to the ground once more.\n\n                                  ", "action_results": [{"action": "Redscale returns to a death", "result": "The fall was a foggy memory as Calivir and you fell. You come to see Calivir lying on the ground next to you. You move your arms and legs to make sure you could move. You could move without any pain, but you remember what happened and rushed to Calivir. His breathing was faint. He says, \"I hope your okay.\"\n\n\"I-I-I-I am, but what of you?\"\n\nHis mouth seems to have formed a smile. \"I won't make it. I have an idea how to defeat them.\"\n\n\"How?\"\n\n\"You must seperate them.\" Redscale appears over the horizon and lands next to you. He sees Calivir and moves back a few steps.\n\n\"Father...\"\n\n\"Redscale my boy. How good is it to see you.\"\n\n\"You're...\"\n\n\"Dying. Yes, I am. I want one last wish before I pass on.\"\n\n\"What?\"\n\n\"Protect Zaron and live a full, happy life. Goodbye... my... sons.\" And he closed his eyes for the last time.\n\nYou look at Redscale. \"Are you okay?\"\n\n\"I'm fine.\"\n\n\"I hope so. I got a plan to beat those two.\"\n\n\"What?\"\n\n\"Seperate them.\"\n\nThey come in the distance. You use a spell and Quon was lifted from his saddle and tossed in another direction. Redscale flys off and tackles Haru in the opposite direction.\n\n              ", "action_results": [{"action": "One on One", "result": "You head in the direction Quon landed. He was on his knees when you reached him. \"It ends now,\" you snarl at him.\n\n\"I couldn't agree more,\" he replied. You two begin to exchange sword blows. He was getting the advantage. You block his cuts and attack back. He had a hurt expression on his face. That gives you confidence. You attack him until you began to push him back. All the anger and pain was involved in these cuts. He misses a block and you get him in the chest. He falls. You look over him.\n\n\"Quon, traitor of Varon, you are hereby sentenced to death.\" You stab him in the heart and end his life. Fatigue sets in and you fall to your knees. \"So I may die as well. I am happy to rid this land of Quon. If I die, farewell my friends.\" And you fall down into a black conciousness.", "action_results": [{"action": "Celebration", "result": "You wake in your room and see Kai sitting by your bedside. She has a sad look on her face. You feel happiness and launch up to give her a hug. \"I did it, Kai, I did it.\"\n\nShe was in shock and recovers to say, \"I know, but at the price I thought was I lost you.\"\n\n\"It'd be hard to get rid of me.\"\n\nShe laughs and gives you a big kiss. \"I know. I think I'd perfer it that way.\"\n\n\"I do too.\"\n\n\"What will you do now?\"\n\n\"Stay here with Redscale and you.\"\n\n\"I think Redscale must leave.\"\n\n\"Why?\"\n\n\"He's the king of his clan and must rule them.\"\n\n\"I suppose. And you?\"\n\n\"You should know that.\" She laughs and and gives you another kiss.You leave the room and go outside to see everyone celebrating. With Kai there you go out.A party was made and you party all night. You drank, danced and talked a more than you did your entire life. Everything is how it is supposed to be. Life couldn't be better, so you go to see Redscale.", "action_results": [{"action": "Seperation of Brothers", "result": "Redscale stood in the moonlight. He looked at the heavens above him. \"I'll have to leave you,\" he said as you came to him.\n\n\"Kai said that you may have to.\"\n\n\"Are you okay?\"\n\n\"I am. For I have Kai and you, no matter how far we are apart we will talk through on minds.\"\n\nThat we can.\n\n\"Hahahaha, don't need to do that.  I'm sure going to miss you.\"\n\n\"But I'll come and visit every month. That's true.\"\n\n\"Its sad what happened Quon, he was such a great man.\"\n\n\"His ways were twisted from what they once were.\"\n\n\"What shall happen to Sea?\"\n\n\"She's telling Kai what I'm telling you. I've decided she'll be my queen.\"\n\nA big grin came to your face. \"Otherwise your wife?\"\n\n\"In your language... yes.\"\n\n\"Goodbye brother.\"\n\n\"And fair winds to you brother.\" What he said is the old dragon goodbye, but no one knows whoever came up with it. You put a hand on side. He moved so he was face to face with you. He put his snout on your forehead and gazed into your eyes. All the memories you had together flashed into your mind. You smiled and for the last time he says, \"Goodbye brother.\" He flies off.\n\n                                ", "action_results": [{"action": "Final Words", "result": "Months have past since you married Kai. You are on the Varonian throne with Kai by your side. Ponis decides to go on a long trip. He sends you letters every few weeks. Redscale and Sea did become mates and had many children. He sent one to you and it was a silver color to the egg. You smile and set it in a cushion. You are known as the Dragon King among your followers. For all you can do now is rest and wait. For your great journey is now over.", "action_results": []}]}]}]}]}]}, {"action": "Dragon fire", "result": "\"Fire!\" Calivir lets loose an inferno of fire on Haru and Quon. Calivir was unleashing hellfire upon the unlucky pair. They get burned and they fall back. Calivir  follows quickly behind them. Haru flys higher and you loose them. \"Where are they?\"\n\nCalivir responds, \"I don't know. They may be...\" He didn't finish because somehow they got below Calivir and Quon managed to stab his heart.\n\n\"Nooooooooo,\" you shout as you realized what happened. Calivir had no movement as you fell to the earth.\n\n                                  ", "action_results": [null]}]}]}, null]}]}, {"action": "Attack Haru", "result": "You try to remove Haru from the fight, but it was her that removed you. She clawed your stomach to make a big gash. Then breathed fire onto you. She bites you to finish the job.\n\n \n                              ", "action_results": []}]}, {"action": "Use magic to block", "result": "You raise your hand to create an invisible wall and the fire goes to the right, left and up. The power slides you back a little bit, but your otherwise unharmed. Quon was already on you with a sword cut and you block it with your sword. You attack a leg of Haru and get a deep cut in it. She roars of agony of the pain. You strike them with a combination of attacks. Some connect and others don't. You somehow manage to get under them to deal a finishing blow.\n\n \n                                          ", "action_results": [{"action": "Stab Haru", "result": "You manage to stab Haru. She roars and shoots fire at you. You roll out of the way and slash her again. She claws at you and manages to remove your helmet, but that just reveals your smile. Quon looks shocked. You guess that is how you are lasting so long against him without Redscale.                                      \n\nHe keeps on the offense and becomes careless in his attacks. You hit Haru and him a few times. He then uses magic on you and you are being pushed back one step at a time. He hits a fire ball on you and sends you flying back. He gets ready to finish you when a dark shape rams Haru to send her in another direction.\n\n \n                                  ", "action_results": [null]}, {"action": "Slash Quon", "result": "You slash at Quon. That's a mistake. He blocks it and hits your arm with his sword. He then hits a leg that makes you fall to the ground. He then cuts your head off to finish the job.\n\n \n                               ", "action_results": []}]}, {"action": "Dodge", "result": "You dodge the fire, but Haru stops the flow and keeps it on you by closing her mouth to fire again. You dodge it a few times more until the fire hits you. It burns through the armor and burns you alive.\n\n \n                                   ", "action_results": []}]}]}]}, {"action": "Sword Slash", "result": "Redscale moves in quickly so you can get a sword cut on Quon. He's ready and blocks the attack and returns with lightning fast reflexes. You raise your shield and blocked the hit. The dragons were fighting with their teeth, claws, tail, and fire. One hoping to get an advantage. Quon and you are exchanging blows, but is hard because of the fighting dragons. Redscale, you need to back up. We need a better plan.                                            \n\nWe don't have one. We attack until they die! And that's what you do. Or what you tried to do. It drags to a sword fight between Quon and you. He is getting made by the look on his face. The dragons fight below and its getting hard to fight Quon. He gets a annoyed look to his face.\n\n ", "action_results": [null]}, {"action": "Wait for him to attack", "result": "You wait for him to attack. Haru flys at Redscale, but he goes into a steep dive. He slows down by flapping his wings strongly to stop his fall. He rises up and faces them again.  Redscale lets a jet of fire go at them and they stay there and get hit. For some reason you think it isn't over. You were right, for they were in the same place undamaged. There is something wrong, Redscale.                                  \n\nI agree, but we may have to split up.\n\nThe fighting continues. You aim sword cuts at Quon and Haru. Some do damage and others don't. Redscale uses his claws on them and lands some while others are blocked or avoided. They return  the attack by sword cuts and claws flinging at Redscale and you. The same results as you did to them. Quon has a nasty look in his eyes now.", "action_results": [null]}]}]}]}]}]}]}]}, {"action": "Kill Him", "result": "\"You have my sorrow, Warren. I can't let you live though, for you may ruin my quest to kill Quon.\" You walk up and raise your blade and aim for his heart. His last breath is now forever lost in the sands of time. You look over to Kai and she's nodding.\n\nPonis comes over and says, \"Nothing could be done Zaron. He chose a young woman that a man had already claimed his love for. Warren's death was inevitable.\"\n\n\"I wish it may have turned out differently.\"\n\n\"As do I. Come! Let's have a feast in honor of your victory!\"\n\nYou feast  for the next fews hours until a message came of the dragons' arrival.", "action_results": [null]}]}]}, {"action": "Defend", "result": "You wait for him to attack. He attacks form all directions and gets no hits. He keeps going and hits  a blow on your left leg. You step back for another solution.\n\n \n                                     ", "action_results": [null, {"action": "Defend 2", "result": "You stay on the defense and he sword keeps coming at you. He seems he won't stop. You go to do something to turn this around.\n\n                                             \n                                  ", "action_results": [{"action": "Final Attack", "result": "You attack and attack ta him until you land a few hits on him and he falls to the ground. He has blood coming out of his whole body. He asks, \"Do you intend to kill me?\"\n\n\"I may.\" You don't feel right doing it, but he may be a threat later in life.", "action_results": [null, null]}, {"action": "Defend 3", "result": "You continue to defend and he lands a cut on your hand that's holding the sword. You drop your sword and hold your hand. He then stabs his through your heart.\n\n \n                              ", "action_results": []}]}]}]}, null]}]}]}]}]}]}]}]}, null]}]}]}]}]}, {"action": "Defensive", "result": "You go on the defensive and keep blocking cut after cut. This is zapping your strength. You got to go on the offensive before she gets a lucky blow in.", "action_results": [{"action": "Stay on defensive", "result": "You stay on the denfensive until a cut to the leg brings you down. Then a head blow finishes it.\n\nRedscale is recaptured and is come to believe his father's lies. Kai stay's under Quon's control who eventually takes over Varon.", "action_results": []}, null]}]}]}]}]}]}]}, {"action": "Left (Up)", "result": "He may be up there since he's so big. You head up there to see at least twenty soldiers. You are able to kill half of them until they overwhelm you with numbers.\n\n \n \n \n                                 ", "action_results": []}]}]}, {"action": "Redscale's Jail", "result": "Redscale wakes and smiles with glee. \"I'm in jail. Zaron will come. With his new sword he'll become the true Entrin.\" Or dragon rider. Redscale settles down for his noon meal. He hears a knock and a note appears at the door's bottom. Zaron taught him literature long ago. It reads:\n\n\n\nDragon,\n\nThis is your final night in this prison. Zaron will be killed and so with you. Enjoy your time in your cell. I'll see you later.\n\nMaster\n\nRedscale snorts and thinks, Zaron will be here before then.\n\n \n \n                                    ", "action_results": [null]}]}, {"action": "CHARGE!!!", "result": "You get your weapons ready for use. You dismount and run in ready. A man who's at least seventy years old is standing before you. He turns and smiles. \"I've been waiting for you.\" Without warning he uses some magic. A bolt of lightning hits Kai and kills her. Before you turn towards him, he launches a fire ball at you and burns you to death.", "action_results": []}]}]}, {"action": "Follow the demons", "result": "You follow them deep into the mountain.", "action_results": [null]}]}]}]}]}, null]}]}, null]}]}]}