{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=13349", "context": "", "first_story_block": "You have just run your sword through the last of the 6 bandits when you hear a cry for help. You jog over to a large chest. Upon opening it, you find a beautiful girl locked in with a rather large amount of gold.\n\n\n\"You must be Amelia\" you say, as you boldly lift her from the chest.\n\n\n\"I am!\" she replies breathlessly, \"You must have gotten my hidden message! Thank you for rescuing me. The way you challenged all the bandits to a sword fight at the same time was so very heroic!\" You lean closer....\n\n\nYou wake up and take in your surroundings, holding a tiny hope that one of your dreams had been reality and not just fantasy. But all you see is your one room hut, mostly empty and worn down.\n\n\n\"Last night it was a dream about escaping from an amazing tower of riddles ruled by an evil magician and today it's a hero rescuing princesses... I must be losing it.\"  You get out of bed, get dressed and take stock. One bed, a desk with your open pack and a chair by the cooking fire are all the furniture in the room. You slowly re-fill your pack with your cloths and hunting gear. The fire went out during the night leaving the room dank and chilled so, realizing you had no reason left to hang around, you stuff your sleeping sheet into you pack, sling it over your shoulders and head to the door.\n\n\nLooking out you see the dirt streets and hastily built shacks of the work camp you've been living in the past few months.\n\n\nDo you:", "action_results": [{"action": "Head off to talk to the foreman", "result": "You quickly walk through the camp towards the mine, looking in the empty shacks as you pass. Now that the mine is running and producing silver, all the temporary staff brought in to dig out the initial tunnels have been laid off. You were one of the last to go as you were one of the most experienced but tomorrow the shacks would all be torn down and only the huddle of nicer buildings would remain to house the permanent miners and those needed to support them.\n\n\nYou arrive at the entrance to the mine and see the Foreman sending the last of his men inside. He calls you over.\n\n\n\"Well, you've done a good job for us but I can't keep you on our books any longer. The mine's bringing up silver and they've sent down  some official to assess our operation. Sadly, that means he will be checking our payroll so there wont be any room for us to hire out side jobs for a few months.\"\n\n\nYou knew the job was only temporary so you tell him that it's alright and thank him for keeping you on after most others had been laid off.\n\n\nHe hands you a small purse with your pay.\n\n\nYou start to head off when he calls after you.\n\n\n \"I heard a rumor that another mine might be opening a few days walk north of here... Can't say if its true or not but there may be a few months worth of work up there if it is.\"\n\n\nYou wave your thanks and head out of the camp towards the road. It takes just over an hour to reach it so as you walk you think back on your recent dreams. In the tower of riddles you hadn't been much of a traditional sword swinging hero but you had shown great wits and intelligence to escape. In this morning's dream you had been a bold adventurer able to take on 6 ruthless bandits at the same time without breaking a sweat. Comparing it to your own life so far, you think its no wonder you're having escapist dreams.\n\n\nYour name is \"Glor\". Your mother once told you that traditionally, babies are named after the first thing a father says when a child is born. (This often causes no end of contrived first exclamations from new fathers) Your own father, upon hearing it was a boy, had strode into the room and started saying \"Glory be!\" (Obviously thinking Glory was a good manly name) Unfortunately, when he saw what a birthing room was like a few seconds after the deed he only managed, \"Glorrr...\"  Most couples iron over the small details like this and name the child what the parent 'meant' to say, but your mother had a wicked sense of humor so Glor stuck fast.\n\n\nYou grew up in a small section of the city called the \"Old Quarter\" near the docks and factories. Your family could only be described as the working poor, the people who do all the dirty and less desirable jobs that keep a city running. Your father worked hard and brought in enough money to keep you all fed, but 4 years after you were born, your mother passed away while giving birth to a stillborn child. Your father still worked but as a broken man and you were mostly brought up by friends and their families around the area. Once you hit your teens, you took any small jobs you could get. Cleaning, hauling, and off-loading ships - no job was too humble or dirty. You spent the rest of your time  hanging round the docks and warehouses chatting to sailors about other cities and lands.\n\n\nNot that yours is a sob story. Many had it much worse than you in those days. Lack of jobs sent more and more people into the Old Quarter and many families didn't survive their first years there. You had good friends and old family ties that took care of you when you needed, so it wasn't all bad.\n\n\nOnce you were old enough you joined a mining expedition and set off into the hills to make your fortune. Well, to dig holes while other people made their fortunes even bigger, but, it was a wage and a start. You had stayed up North since then, taking mine and farm jobs wherever you could. You claimed you were saving your coin and preparing to head back to the city but the years passed and you stayed, doing manual labor in mines. This latest job had brought you the closest you'd been to the city in years, even if it was still days of hard travel away.\n\n\nYour thoughts are interrupted as you reach the road. You take a good look around but see no-one in either direction. To the North, the road roughly follows the line of the hills; to the south, it disappears onto the plains, where it turns slowly east  towards the city.\n\n\nYou feel an urge to turn south and see the city again. There's certainly been more mining expeditions sent out recently, so maybe things have improved there. The money you just got paid for the months at the mine would keep you going for at least half a year if you're careful.\n\n\nOn the other hand,  if there is a new mine starting North, a few more well paid months away from the city won't change your situation for the worse. You think to yourself one more mine job without a break between would get enough for a years living when you got back.\n\n\nShould you make you way back South to the city or try your luck in the mine to the North?", "action_results": [{"action": "You head North.", "result": "You turn Northward up the road thinking that the rumors of a new mine are too good an opportunity to pass up, and hey, even if it's false you don't mind spending an extra week or two on the road.\n\n\nYou pull out some of your dried meat and start eating as you walk, thinking you should probably set some traps and snares when you make camp that night to stock up some fresh meat. You spend an uneventful day walking North and see no other travellers. An hour or so before dusk you start looking for a place to camp. You can camp on the roadside, head into the trees to the east for cover while you sleep or walk an hour or so to the foothills west and hope for a spring or cave.", "action_results": [{"action": "It would be good to find a cave to sleep in, head West", "result": "You walk for an hour west and reach the larger hill. After some searching you find a game trail  that leads to a cave and just have time to build a small fire before night sets in. You didn't find a stream but you're sure you'll come across one tomorrow.\n\n\nYou quickly lay a few snares just out of the reach of the firelight then retreat into the cave for the night.\n\n\n ", "action_results": [{"action": "Morning on the North road", "result": "You thought you had heard some noises during the night but there are no signs of other people in the cave. Sadly, your snares are empty too so it'll be another day of dried meat unless you find a traveller on the road today.\n\n\nYou cover the embers of the fire and walk back to the road. Once you reach it, you see a lot of fresh footprints and realize you must have missed a group that passed during the night. The tracks lead North so you follow them for a short distance on the road before coming across their abandoned camp on the edge of the woods.\n\n\nA quick look tells you they packed up and started their march North again several hours ago.\n\n\n ", "action_results": [{"action": "Follow them and try and catch up", "result": "You think to yourself that with the rumors of a new mine opening that it might be best to catch this group up and see if they know anything about it. You set off at a fast pace to catch them up.\n\n\nBy mid morning you see a dust cloud ahead of you on the road so you keep your fast pace up till you get close enough to make out the group.\n\n\nIts getting close to midday before you get close enough to realize who it is your chasing. Its a group of miners! You quickly conclude that they must be the hired hands sent to get the mine up and running so you approach them to see if you can find out more.\n\n\nAs you catch up to the rear of the pack some of them hail you. You respond in kind then fall in beside the rear couple and start chatting. You learn that there are about 50 of them in the group including all the skilled workers the mine needs but that they would be happy to have you along as an unskilled hand. Its not going to be as much money but they tell you that they have sent their mine guards off ahead to make the area ahead safe so there isn't any way to get ahead and get a better job.\n\n\n ", "action_results": [{"action": "Ask the Foreman to let you sign up as unskilled work and join their group.", "result": "You troop into the camp with your new companions and get your first look at your new job site for the next few months. Its a well cleared site around a small mine entrance that couldn't extend more than a few feet into the hill. The guards sent ahead had obviously arrived much earlier than you as the site overseer and his men had readied sheds for your company to sleep in and already had his handful of miners digging and putting up rough timber supports in the mouth of the mine.\n\n\nYou're shown your quarters, a small shed set out much like your last one, bed, desk and fire. You settle in and the next day begin your new job. Since you couldn't get a better position your one of the diggers and carters as the foreman put it. You dig to deepen the mine until your standing in a large pile of dirt, then you or someone else, shovel it into a cart and push it outside to be dumped.", "action_results": [{"action": "After a couple of weeks", "result": "After a few weeks of hard labor your not sure whether your regret your choice or not but your certainly keeping very strong and fit from wielding a pick and shovel all day. The mine has been progressing well, the main shaft has been tunneled deep into the hills bedrock and side tunnels are being opened to chase the smaller silver seams your crew uncover in the rock.\n\n\nYou're just taking you latest load of rock out in a cart when the foreman approaches you. \"Theres a small job available for you if you want to earn some higher pay than you are at the moment, dangerous though.\"\n\n\n\"What's the job?\"\n\n\n\"One of the main side tunnels has found a rich looking vein we want to open, but the rock around it is cracked and weak. The weak stone should only extend a few feet but we need some volunteers to risk mining through it. The pay is more than double what your getting now.\"", "action_results": [{"action": "Take the risk and the extra money", "result": "You take a proper look at the new tunnel you're to help open up. The stone is very weak and cracked. You and the two other workers start mining, carefully removing the weak stone along with the silver ore and painstakingly placing buttresses and supports as often as possible.\n\n\nA few days pass and your team is making some good headway. One thing you've decided you like about weak stone is that is easy to mine. Half of it just crumbles out of the wall with a single pick blow, That doesn't reassure you about the rest above your head though.\n\n\nAfter a week you're taking a rest at the end of your tunnel. You've made several metres into the stone and it looks like you've finally reached the end of the weak stone. Your buttresses held and you've earned some easy coin.\n\n\nThe Overseer told you after you were done with the weak stone that he might be able to get you moved to some logging duty for a week or two if you wanted, same pay but easier work as an additional reward. Starting today they would be felling the trees that grew near the mine to build more supports for the ever growing maze of tunnels.", "action_results": [{"action": "Leave the weak tunnel", "result": "You start to pick up your gear to exit your tunnel when you feel a slight shaking and see a few small pebbles fall from the tunnel roof.\n\n\nYou feel as if time had slowed around you as you think of the layout of the mine site. Your tunnel had branched far off the main one under the hillside. You can see a small root in the rock wall beside you. Your mind tells you that your seam must have run under the trees behind and to the left of the hill and that they were the obvious choice for the first logging, but all your body is telling you to do is run.\n\n\nThe tunnel is small so you start to run hunched over but as you take your third step you feel a tremor moving up through the tunnel floor.\n\n\n\"They felled the tree right over my tunnel!\" you think as a last thump resounds through the walls and the roof of your tunnel crumbles.  Tons of rock pour onto you.\n\n\nYou don't have time to think anything else in your rock tomb.", "action_results": []}]}, {"action": "Its not worth it, keep mining the main tunnel", "result": "You don't want to risk a tunnel collapse so you turn down the foreman's offer.\n\n\nYou work solidly for the next few weeks. You occasionally see the Officials from the miners guild and some officers from the army visit and watch them being greeted by the overseer and his daughter in their newly built house. From speaking to the other miners you find out that the overseer is also the owner of the new mine and a few others in the area, he moved from another country then made his way up from miner, to foreman, then staked his own claim after a few years. Now he travels to all his new mines and oversees their construction with his daughter doing his books and his cooking for him. You never hear about his wife.\n\n\nYou think its odd that he gets so many visits, especially from the army but you put them out of your mind as soon as the officials leave- the guild is nothing to do with the hired hands after all, only the owners.\n\n\n ", "action_results": [{"action": "Months of mining", "result": "You've been at the mine nearly three months now, the tunnels are going deep and several promising seams have been opened up, even the weak stoned tunnel is producing well now after a minor cave-in caused by logging right above it.\n\n\nYou know its nearly time for the hired hands to be laid off so you approached the foreman to see what the prospects are. He told you that most of the manual labor would be laid off within the week and sadly that included you, you'd been a good worker but with all the better positions filled he had no choice.", "action_results": [{"action": "Finish the week and head South", "result": "You get your things in order and even if you didn't make as much as you'd hoped for, you still added a few good weeks living expenses to your purse.\n\n\nThere have been rumors lately of bandit activity on the road south so you talk to the other workers there to see what their plans are. One group is planning to leave on the day they are laid off and make good time down to the city because they want to get back to family there. The other south bound group plans to stay until all the small jobs are finished around the camp for a few extra coins then have a much more leisurely trip with stops off at way houses and farms along the way. The second group will turn up to the city nearly two full weeks after the first but your in no rush yourself.", "action_results": [{"action": "Rush back to the city with the first group, you may as well get back there.", "result": "You all gathered on the Friday morning by the foreman.\n\n\n\"As you men all know, this mine is now officially up and running so the owner has employed one of the mining guilds to keep her running and turn a profit for him, they bring their own unskilled work as well as the their own guards so you'll all be paid up until today then free to go. You can collect you pay off me this evening or tomorrow morning.\"  as he turns to leave he pauses and says \"Hmm for about 10 of you there could be some small coin in clearing the old shacks and tidying the place up, a few days light work for light pay.\" then he heads off to oversee the cutting of some wooden struts.\n\n\nYou and your group finish your days work as quickly as possible then a few hours before dark you file up to the foreman and collect your pay, the owner is a generous man and since the build went well he provides you all with some dried meats and provisions for the trip out.\n\n\nYou all head off South into the evening leaving the camp far behind you before stopping. Your days are pretty uneventful with a large group of men around you no bandits make an appearance and you all make very good time to the city, marching most of the days and taking few breaks along the way.", "action_results": [{"action": "Rushed arrival", "result": "Your group makes it back to the city in what must be only a little short of record time and say your farewells at the gates, most of them running off to see wives or families. You take stock of the area then get yourself through the now alien feeling streets to your old area of the city and are relived to find it almost completely unchanged. You go to an old way house you knew in the hopes that the same owner was still running the place.\n\n\nAs you walk in the door a man behind a bar looks up and stares right at you for a full minute before saying \"Well this is some triumphant return, look at the state of..\"\n\n\nYour coin purse drops on the table\n\n\n\"your huge full coin purse\" he slowly finishes.\n\n\nYou grin and tell him you'll take his best room for the night and some hot food followed by whatever his best bottle of alcohol is then head upstairs to wash the road off your face. Your Old friend meets you as you come back down and tosses you a key as he lays a large bowl of thick stew on the table alongside a large bottle of mead with two glasses.\n\n\n\"two?\" you point out.\n\n\n\"Well its not everyday an old friend comes back into town after years away, so since your now paying for an entire bottle of finest mead reserve I thought I'd close for the evening and join you\".\n\n\nYou laugh and join him at the table sharing stories of the years since you grew up in the city together and went separate ways.\n\n\nVery late the next morning you wander down nursing your head and see your friend behind the bar equally worse for wear. You wander over and take the mug of water he hands you. Over breakfast and a lot more water you tell him your plans now that your back in the city. Your goal had always been to get enough to settle comfortably in or near the Iron district, then as the months went by, maybe get into one of the guilds as a skilled worker or arrange with a company to be a free-lance worker on their books. Your years of experience with all good references would stand you in good stead.\n\n\n ", "action_results": [{"action": "You decide that even though the rooms and food are basic at best that you'll stay renting from your friend for a few weeks while you check out the city and find a place of your own", "result": "After an enjoyable two weeks at the inn you've found yourself a nice place up in the Iron district, Its just a single bedroom with kitchen and small lounge off it but compared to the last few years it seems like a palace. Even better its only a few minutes walk from several of the guild buildings and mining corporation offices so sorting out a job shouldn't be too taxing, after several months rest of course.You let your friend know that you'll be leaving the next day and he just tells you to come down for drinks as often as you like.\n\n\nThat evening you both sit down to share a drink and talk about how to make easy money (your favorite topic since you were 10 and he was 15 working for his dad in this very bar). You glance out the window and comment that its awfully bright out for the time of day when you hear the first screams.\n\n\nYou both rush out to see a massive inferno sweeping through the wooden buildings of the old quarter. You both turn to run but there is a wind coming off the sea pushing the fire on and the old wooden buildings are going up like kindling. In your blind sprint you both almost make it to the walls dividing the city's districts when the flames overtake you and the smoke makes you choke and fall, its not long before you are engulfed entirely in flames.", "action_results": []}, {"action": "You Tell you friend that you'll just be staying a couple of days while finding your own place up in the Iron district, after all you have enough coin to rent an entire house for most of a year.", "result": "You hang around long enough for your head to stop hurting and the food to settle then head off to see what changes the years have wrought on the rest of the city. Your Old district may not have changed at all but the wooden docks and buildings have stood longer than most peoples grandparents had been alive. You walk slowly up the sloping city until you reach the large walls that divide the districts and head through the large gates. The first thing you notice is that the gates which used to be old relics unmoved in decades had been cleaned up, reinforced and were guarded, they seemed friendly enough and were only guarding the gates closing mechanism not the gateway itself but it was still an odd sight.\n\n\nThe Iron district had also changed, the stone buildings seemed even bigger than before and many of them were more ornate, even near the gate which would be considered the less well off area. You head further in and see signs for several new mining companies and new guard businesses recruiting. You quickly move off the main roads and find a respectable looking Inn to ask about rooms.\n\n\nYou don't have any luck in the first few inns and taverns you try but after a while you find one with a small flat to rent- Its a little more than you wanted to pay but its only a few minutes from the guild buildings so you agree terms and say you'll move in that night. You head back to let your friend know then move your few worldly belongings into your new place.", "action_results": [{"action": "Easy city living", "result": "You settle into your new place almost immediately. At first you have no idea what your going to do with the large wardrobe and drawers set up in your room but then you just smile to yourself and head out to the nearest tailors and buy several sets of cloths. All practical and hard wearing, but still one of the first times you've owned more than 3 outfits in your life. After stowing it all away you start your rounds of the district and try to see as many of the changes as possible.\n\n\nYou do your sight-seeing for the first couple of days then start to gather information on the Guilds and Companies that interest you. Having got the basics noted down, you buy in a nice supply of long lasting rations (just incase) and set about having an easy life for the whole of winter. Eating down in the taverns or the nice inns, and seeing what nightlife there was to offer.\n\n\nIt was just as you were starting to really enjoy your complete lack of routine and responsibility and were planning on heading down to your friends for an evening drink when you start to hear loud voices and strange shouts from the taverns main room. You thought that this was a little to nice of a place for it, but never one to pass up spectating a good tavern brawl (and occasionally participating) you head down the stairs.\n\n\nBut your stopped short when you reach the room and instead of a brawl you see a room full of panicked people all saying the word fire. You grab the nearest man and ask what is going on and he tells you the old districts up in flames, they think it started on the shore amongst the docks but the wind off the sea pushed it up into the old wooden buildings and they took like kindling, within minutes the whole district was one big inferno.\n\n\nYou rush outside and round the inn, your window looked the other way shielding you from the sight but now you just stare blankly towards where the wall separating the districts and see a fierce orange and yellow glow over the wall, occasionally punctuated by large bursts of flame with plumes of black filling the air above it. You sprint down to the gates but once you get there you find them closed and barred shut. grabbing the nearest guard you shout for them to be open so you can get to your friend but he just stares blankly back at you obviously shocked dumb then walks away. The gate captain walks over and tells you that if anyone is still in there and didn't get out before the gates had to be shut, that there was no chance of them being alive. You start to tell him that he is wrong and needs to open the gates when he takes you over to them and tells you to put a hand on them.\n\n\nYou reach out and feel the thick gates metal almost hot enough to burn you. The captain quietly tells you that the fire came at the worst possible time. it had been dry for weeks and wooden buildings had been build right from the shore to the base of the wall, all stocked full of the years produce, hay, wheat, pelts and oils. most of it flammable. The wind blowing in from the sea had fanned it into an inferno almost as soon as the first warehouses had gone up. It had spread unnaturally quickly and only the closing of the huge gates had stopped it spreading through into this district too. The gates would stay closes until the embers were cold, and that could take a couple of days at least without any rain to quench them.\n\n\nYou head slowly back to your room and collapse into bed unsure what to do next.", "action_results": [{"action": "Morning or choice", "result": "You awake in the morning unsure what to do. Your plans had been of an easy year living off your money and you could still do it, prices would probably go up for a time but you'd still comfortably now that your settled. But you are now sure you'd lost any place that you had called home and your closest friend in the fire so you at least wanted to find out what had happened.\n\n\nYou grab some food then head out to start trying to ask questions and see if anyone is the wiser about what had caused the fire, and to do a last look through the survivors for any sign of your friend.\n\n\nYou ask several guards but most don't seem to know any more than you do. Eventually you see a guard that isn't as shell shocked as the rest and he tells you that the captain over at the military barracks has all the information about the fire and that you should speak to him. You head there to see what he knows.\n\n\n'The Barracks' as it is generally know does contain the city guard's barracks but also the military side of things, the army barracks, its armory, offices and everything else it needed all in one giant building  that straddled and made up part of the wall between the iron and stone districts. You quickly see a small group of people talking to soldiers outside one of the entrances and approach them to hear what is going on.\n\n\nIts one of the captains explaining the fire to them, a few minor details extra but basically what you had heard before. Once he is done you ask him about how it started. He looks you over then sends you in and tells you to talk to the man at the desk, first room on the right. You enter and realize you not left with much choice as to where to turn since there is a group of soldiers blocking the corridor a few meters away with only one door standing open between you and them. You enter and approach the man looking at you from behind the desk.\n\n\n\"What can I do for you?\"\n\n\n\"I want to know how the fire started.\"\n\n\nThe man seems mildly amused by your abrupt response but any trace of amusement quickly vanishes as he replies.\n\n\n\"A ship packed with flammable fuel was set alight and rammed into our docks. the fire was deliberate.\"\n\n\nStunned by the sudden revelation you ask \"Are your sure? wait are you just telling everyone this, wont it cause a panic?\"\n\n\n\"There's no point trying to keep it a secret, half the fishing fleet saw it happen as did many of the survivors that ran into the sea and were picked up the by the ships, the entire city will know in two days at the most. Also there were thousands of people in that district at the time, I wont dishonor them by lying about their deaths.\"\n\n\n\"But who would do it, what is there to gain from burning down old district?\"\n\n\n\"We think it was Carn, at least the burning ship and the one that had been accompanying it bore their colours\"\n\n\nYou think for a few seconds but the name rings no bells \"Who?\"\n\n\n\"Carn, the city a few weeks along the coast by boat, you been living under a rock or something? There has been minor trouble and trade disputes between us for nearly two years now.\"\n\n\n\"I've been up North for years in the mines, news apart from bandit activity doesn't make it up there...\"\n\n\n\"Well long story short we started full maritime trading over 3 years ago, then two years ago some minor trade problems began, then it was about land, finally about fishing rights. things had been getting tense for months with armed ships keeping fishing boats company for protection and guards on our borders but no-one expected this. They have been sent ravens with questions about the ships but they will of course deny all knowledge, then it will be war. The king has already started recruiting to replace the men lost in the fire and more to fill out the army.\"\n\n\nYou just stand unsure what to say, should you hate an enemy you don't know for what they did? Denounce their tactics, or just avoid the war and try and rebuild a life in the city.\n\n\n\"So son\" the commander stands up \"we are still recruiting and the army wage is just as good as the miners one. You want to enlist?\"\n\n\n ", "action_results": [{"action": "You hate what they did but you have money and a chance at a life now so it would be stupid to throw it away in a war, you politely refuse and head out.", "result": "You spend the first few days split between organizing whatever is left of you life and watching the embers of the old district burn down to cold ash. Once the gates are opened you had planned to search through the wreckage for you old friends tavern but one look through the gate shows a nondescript layer of ash evenly coating  the ground as far as the outer walls and the shore, only the occasional blackened wooden timbers or cracked black stone sticking up to break the massive expanse of grey and black.\n\n\nSoldiers and workers begin repairing the walls and gates from the fire damage and as the weeks pass people begin to clear out the ash and wreckage that survived. In many places the fires burned hot enough that not even much bone was left but in others teams were on duty collecting remains and transporting them into mass graves outside the city limits.\n\n\nThe war had broken out after less than a fortnight. Carn repeatedly denied any involvement but after the trouble between the two cities and the witnesses to the ships bearing their royal colours war was inevitable. Reports said it was going our way and that we mostly had control of the seas between the cities and were making steady progress  on land as well, casualties were growing but going by the weekly reports given by the guards theirs were much higher and we would have them under tight siege by the end of spring.\n\n\nYou take it easy for the first few weeks but then begin helping out where you can. Your time in the mines has given you a simple grasp of solid construction so when work teams are put together building new stone docks in place of the wood ones you join them as skilled labor and since you don't need the money you let your wages go to re-homing the survivors. Your work and charity gets you some small attention from the survivors that make up a lot of the unskilled labor and when they learn you used to live in the old district your adopted into the 'family' again. You even meet a girl a little younger than you that lost her family in the fire. Your friends at first with you looking out for her, then you become closer, and by the time spring draws near you marry and settle into a life in the Iron town. \n\n\nBy this time you've begun accepting your wage since most of the survivors are now in temporary homes. Your work on the docks and accepted position amongst the survivors has landed you a full time position in the construction guild overseeing some projects in  the rebuilding of a new partly stone old district.\n\n\nThe War went as quickly as you had been told to expect with Carn under tight siege by spring and fallen completely by summer. your army had been ruthless , firing burning oil and tar into the city and burning their food stores whenever possible, all in 'revenge' for the old district. Their king had denied all involvement right up until the surrender but he was now exiled along with his advisors and the city under your kings command.\n\n\nThe world passed you by as you spent your years happily with your wonderful wife and family, there were always rumors of other wars and far off battles and victories but you didn't concern yourself with them as your city was now flourishing and always expanding and you had plenty of work as you moved up the guild ranks.\n\n\n*** Congratulations! This is the peaceful and happy ending. No big exciting adventure but you're happily married and well paid in a flourishing kingdom. And since all is going well its easy to ignore those little niggling doubts about what really happened that I know your harboring ***", "action_results": []}, {"action": "You cant accept what They did to your city and your friends. Setting the city on fire with no warning to kill civillians was not an act ment to go unpunished so you enlist.", "result": "Life in the army starts with training. You're assigned a bunk and basic leather armor on the first day and the next morning at dawn you're woken with the other new recruits to head out for basic training. Your unsure what to expect but life in the mines has kept you strong and and in excellent physical condition so the exercise runs, weights and jogging in full armor don't overly strain you. Other recruits don't fare as well but your not given the time or opportunity to help one another.\n\n\nYour thinking the training is a little harsh for the first day as many of the men and boys in your group have never done physical labor when your all gathered and told that today was the testing day. They needed to asses what sort of condition you were in so they could get you into the proper training programs. You see that everyone is relieved by this and you start marching back to the barracks as your sergeant tells you the last task for the day.\n\n\n\"Everyone is to be interviewed about their experience and past jobs, don't worry this isn't a test and it will be kept informal, we just need to know if you've ever held a weapon before or which part of the army suits you best\".\n\n\nYou all enjoy your evening meal then are called over one by one to the sergeant's table. You tell him that your good with a bow and passable with a knife but that you've never had formal training with a sword before. Your experience in the mines interests him more and one of the other men at the table takes over and asks you several technical questions about struts and construction work. You answer all he asks fairly well and after the Sarge gives him a nod he says \"Welcome to the engineering division\".\n\n\nYou look momentarily confused until he laughs and asks where you thought all the forts, war machines and defenses came from and who you thought build the army's outposts. The light dawns on you and the man smiles.\n\n\n\"That's right, you'll be supporting the army using your experience, building our defenses, putting together our war machines and constructing everything from our forward base to our cooking tents. It may not sound as glamorous as charging in with the vanguard but we have a much, much higher survival rate and if the camps are attacked we defend them shoulder to shoulder with all the rest, what do you say?\"\n\n\nYour readily agree and Sergeant Reardon, as he introduced himself, leads you off to meet your new training squad. Your introduced and learn they are made up of everyone from those with basic unskilled labor experience to a couple full guild engineers who signed up on the day of the fire.\n\n\nYour training goes well and you get on well with your squad, learning to treat them as your friends as well as squad mates. After a couple of weeks pass War is finally declared. You had known it was just a matter of time but you quickly find your Sarge and ask what it meant for you.\n\n\n\"For you and your squad? Nothing at all! Your not fully trained yet and once your basic is over you still need to be assigned to your unit and your duties explained. Since you've got good solid construction knowledge and the experience to back it up you'll most likely be sent to Third company on our borders to get the forward forts built and running as the war progresses. Wont be for another month yet but either way no chance I'm letting my boys out near the fighting till they are ready.\"\n\n\nReassured by the Sarge's attitude you pass the info onto your squad and finish out the last of your basic training in the barracks.", "action_results": [{"action": "Third company", "result": "The Sarge is a little off in his estimate of your departure time. It actually takes a month and a half to get your squad in shape. Its been a long wait but you are finally all ready to head out to the front to help in the war effort!\n\n\nYour squad is woken by an early bell ringing somewhere in the barracks tower and you all assemble in your new polished steel armor. during your training you had all been measured and fitted out in strong forged steel, it turned out many of the iron mongers and jewelers of the city had turned their forges over to making weapons and armor so there was no shortage of equipment for the army.\n\n\nThe Sarge gives you all one last look over.\n\n\n\"Well its taken longer than I'd like but your all ready to serve your king! You're all heading out to the 3'rd to help in the construction of the new bases so our boys on the front have a good foothold in place before winter hits.\"\n\n\nA soldier to the left pipes in \"But I thought we already had bases on our borders?\"\n\n\n\"Our Borders? Boy do you think the entire army has been sitting and waiting for you since the war started? They have been advancing solidly for the past 6 weeks. The new borders are near 2 weeks march further forward and THATS where we need the new bases.\"\n\n\nYou think to yourself that the army has made pretty amazing advances considering the fact that Carn was the kingdom that started the war.", "action_results": [{"action": "It DOES seem odd, so you speak up", "result": "\"Sir, Our men are making amazing progress in the war but I have to ask. Carn were the ones that started the war, I mean they sent the ships into the Old Quarter and everything with the trade disputes. Were they not prepared for our counter attack?\"\n\n\nYou see the Sergeant frown and a shadow clearly crosses his features. He quickly shakes it off and explains that the first week or two on the border was intense fighting and lead to a great many casualties. However once the army had broken through the initial defense line, it had been much easier to push ahead and prevent the Carn army from regrouping properly.\n\n\nYou think that this is indeed a possible explanation but a few doubts still remain in the back of your mind.The Sarge says a few last tips and goodbyes then heads off. The last you see of him is as he walks out the door with the shadow back over his features as if he didn't really believe what he had said himself.\n\n\nYou see a soldier you don't recognize step forward.\n\n\n\"Right then, I'm Capt. Argor. Since I took an arrow in the knee and had to come back here for treatment, I've been given the onerous task of accompanying you to the front lines to make sure you ladies don't get lost. You were all told to report here in full gear and with all your supplies so has anyone left anything behind that they just must run back to their rooms for? Hankies? Training Bra? No? Good, I might not have to babysit you all quite as much as I feared, lets head out cos this is gonna be a long trip for you city folk.\"", "action_results": [{"action": "Quick march out of the city with the new Capt. calling you all little girls for the entire 6 hour march.", "result": "You are given a break for lunch with only cold rations, then double speed marched hard till dusk. The Capt. Pulls you all off the road beside a small stream and even though your all ready to collapse and pass out he has you form up.\n\n\n\"Right then, this is first point spring. A few generations back some officers from the 1st and 2nd companies were insulting the 3rd, saying we weren't real soldiers because we just built things while they won the war. Our officers didn't take too kindly to this and lets just say a bit of an argument broke out. After the tempers calmed a bit our men challenged the rest of the army to prove their supposed superiority\"\n\n\nHe paused to give you all a big grin.\n\n\n\"Our boys in the 3rd work hard every day moving timber and stone, carrying loads long distances and almost never take days off. Their boys sit on their arses most of the time and only train short periods a day when they aren't actively attacking something. So our officers said they should all go for a little march. You all just made it here within daylight hours which isn't bad at all for this time of year. The 1st and 2nd company soldiers made it in about the same. OUR officers beat them by 3 hours and had a full camp set up and running by the time they limped in. They looked up from their fires and said this is normally just the first point the 3rd stop at before marching on but they had thought they should wait for them to catch up. Its been known as first point ever since. Now anyone joining the 3rd makes the march, so welcome to the 3rd gentlemen, now get our camp up!\"\n\n\nRelieved that Capt. Argor wont be calling you all girls for the rest of the march you all set up camp and get some fires going. You're just settling down beside your fire to have supper when a couple of other come over and join you.\n\n\n\"We had been thinking the same thing as you about how fast the war is going so when you spoke up we thought we should have a chat and share our concerns about the situation.\"\n\n\nYou think slowly before the reply", "action_results": [{"action": "\"Well then what did you think of Sarg's answer?\"", "result": "The two men seem to sense your hesitation so think for a while before one answers.\n\n\n\"I would say... that I'm not sure he believed it any more than you or I did.\"\n\n\nIt's exactly the feeling that you had gotten but you also wonder why they are bringing this up now.\n\n\n ", "action_results": [{"action": "\"Honestly? Your right, I'm pretty sure that no-one really bought it and there are other higher ups back at the barracks that seemed to share the doubts.\"", "result": "The men think for a bit before replying, the one who had been silent up till now looks at his companion and says \"On your head be it.\" then gets up and leaves.\n\n\n\"Sorry about him.\" the man says \"He is just a little bit on edge about this whole situation.\"\n\n\n\"And just what is this whole situation?\"\n\n\n\"Ha! fair enough. Well I can tell you some of it now, You did some work in the mines recently and our employer owns several of the new sites that have been opening, so in reality you've been doing work for him.\"\n\n\nYou nod slowly, its common for prospectors to open several sites to ensure one produces. You don't have enough information to pin down a specific job or owner though so keep listening.\n\n\nThe man continues \"He developed an interest in you from the reports he was receiving which is what put you on our radar and your behavior and reaction to the war made up my mind to come speak to you. Now you can appreciate how much of a risk I am taking here but I have decided to trust you. The war isn't all it seems and you know that. There are a lot of things you don't know about but the main one is that Carn didn't start the war and didn't attack the Old Quarter.\"\n\n\nHe pauses to watch your reaction before continuing.\n\n\n\"Now lets set one thing straight, we aren't talking treason here, we are completely loyal to the king, but we think he is being betrayed and tricked by his council. Now I will give you tonight to think this over and talk to you tomorrow evening again if you want to know more.\"\n\n\nThe man gets up and leaves. You realize you don't even know his name but he is too far to call out too now so you sit back and think over your options.", "action_results": [{"action": "No matter what they claim, they are commiting treason, report to the Capt. during the day and stop them!", "result": "Evil council tricking the king to start a war, its like something out of one of your dreams... you briefly mull over the fact you haven't had any of those recently but put it down to being so tired from army life and move on to planning.\n\n\nYou know what the two men look like and one other man that they talk to a lot so you just need to avoid them during the day and get to Capt. Argor with your information. You keep an eye out during the next days march and try to act as normal as possible, when one of the men comes over to you during a break you even share a water flask before moving off so you don't raise their suspicions.\n\n\nYou finally see your chance as the camp is being set up for the night, the two men are off at the edge of camp to set up their bedrolls like normal and the man they talk to a lot is on sentry duty. You don't know their names but you can give a near perfect description and point them out once you have the Capt. and other guards with you.\n\n\nYou move quickly over to the Captains' fire where he is talking with a runner from a temporary camp up ahead. He motions for you to wait until he is finished, you are impatient to tell him what you know but have no choice but to wait a moment since you don't want to blurt it out in public.  One of the cooks hands you ale and you sip at it nervously as you wait. The man drops his tray against your ankle as he passes and you almost jump out of your skin but just about remain calm and give him a nod when he apologizes.\n\n\nTheres no sign of the men and you only wait one minute but you are dripping with sweat as he waves you over. You realize its FAR too much sweat as you try and speak and feel your throat close over and collapse at his feat.  The Capt. immediately calls over a medic and crouches beside you but you are suffocating and he cant help, the medic runs over and immediately points out two small puncture wounds on your ankle. \"He's been bitten, looks like Asp poison, I'm sorry but theres nothing we can do.\"\n\n\n\"It was the cook, he poisoned me and stabbed my leg when he dropped his try!\" you try to shout, but all that comes out is a rasp.\n\n\nYou fade into black as you hear the Capt. ordering the men to kill all snakes on site and double check all kit before use.", "action_results": []}, {"action": "Wait it out and see what he says the next night, theres too much truth in what he says to ignore it all.", "result": "You've had your doubts all along so now you want the facts. You wait till evening when you are all making camp and head out to the edges where the two men normally set up their bedrolls. It isn't long before they come over, set theirs up near you and join you at the fire. \"So you didn't try to turn us in?\"\n\n\n\"I thought about it a lot but I need to hear what you have to say.\"\n\n\n\"Hmm honesty at least, I'm not sure I would have trusted you if you said it didn't cross your mind.\" he gives you a smile then moves closer so he can speak in a lower voice. \"Everything I said last night is true and we have the proof with us, letters and land deals signed by keys members of the council, all encouraging the war. One was even stupid enough to put in writing that he had captured the two Carn ships to use in 'plan spark'. Others talk about preparing for war and the buildup of the army being hidden from Carn's spies. Even the torture and murder of people they think might betray them or go to the king. Basically everything we need to avert a war and have the king put the men to justice.\"\n\n\nYou think for a while and decide if they really have all this proof that you are going to help them, besides now that you  know this much you are sure they would kill you if you show any sign or betraying them. You talk till sundown about plans and strategies.", "action_results": [{"action": "Reaching the Front Lines", "result": "The marching is taken slowly but efficiently and you approach the lines in just under two weeks. The Capt calls a halt for the evening about half a day out from the front lines and says that  he plans to arrive by lunchtime tomorrow so you better all clean up your gear and look presentable for the last march.\n\n\nThat night you and the two men set up your sleeping rolls near the edge of camp like normal and the man you often see them talking to goes on sentry duty nearby. Its all been arranged for midnight when all but the sentries are asleep.\n\n\nThe three of you stay awake and near midnight you all pack up your rolls and sneak over to the sentry who steps back into the light. One more man joins you and the five of you slip out of the camp then turn towards the front lines and break into a jog. The weeks on the road has made you strong and fit so you all go double time for the first few hours before slowing to a normal fast marching pace.\n\n\nThe man who is obviously the leader calls back to you all \"Right we need to get across by sunrise today or our chances of survival are near zero, our Proprietor has provided us a rough map of the front line fortifications as of when we left the city and plans of what work should have been completed since we will be heading about 2 miles south of the road where there shouldn't be any defenses in place yet so we will only have sentries to deal with.\"\n\n\nYou start marching again when you suddenly remember a conversation you had with Capt. Argor only 2 days back\n\n\n\"Wait!\" everyone stops and looks back at you \"listen, I was letting the Capt. go on about his love of rocks again when he mentioned a runner from the front, he said they came across solid granite just south of the road so moved a mining operation there at short notice, if its close to our crossing point it'll be swarming with men.\"\n\n\nThe leader stares at you for a second before considering the map again.\n\n\n\"Good work Glor, we cant afford to meet to many guards, so its north 5 miles instead. Double time people!\"\n\n\nYou all set off at a fast jog and your just glad you let the Capt. talk about rocks.", "action_results": [{"action": "Reaching Carn", "result": "Your leader guides you skillfully through he front lines, avoiding encampments and guards and you get across the lines with only one guard killed. You are sad that one had to die but there was no other way and plenty more would die if you didn't succeed.\n\n\nYou get through as dawn begins to break and all collapse two miles across the lines from exhaustion. You've all been jogging in full gear for just over 7 hours now and are all spent but you're across the lines and the leader says you can rest. You don't know what to expect but you soon see a small farmers cart approaching your position. The leader quickly speaks to the man and you all pile into the back as he turns back towards Carn and whips the horses into a trot.\n\n\nThe journey from there is uneventful, you all change out of your gear into nondescript clothing and the other men all have identification which marks them out as working for Carn's king so no soldiers bother you.\n\n\nYou reach Carn after several days hard travel, swapping carts a few times.\n\n\n ", "action_results": [{"action": "The War", "result": "THIS IS THE SECOND BEST ENDING, THE SOLDIERS ENDING.\n\n\n CONGRATULATIONS!\n\n\nOnce in Carn you are taken before the king and your leader makes his report after presenting the documents. King Hader immediately sends them to his scribes who make several copies and over the next few days they are smuggled out of Carn to all near-by kingdoms. King Hader also sends several emissaries to your City and is finally granted a cease-fire when one of your kings high council personally intervenes and tells the king that the council had been blocking Carn's requests and emissaries from reaching him. The Councilor was in fact your proprietor and was able to tell the king some of the truth of the situation.\n\n\nOnce the king knows he was being lied to he immediately took control of the military and ordered a cease-fire and confined the council to chambers under guard until he had found out the truth. And once the truth came out the entire council bar one was hung from the city gates. Peace was made between the two kingdoms and it was all due to you hearing your captain talk about his love of rocks.", "action_results": []}]}]}]}]}, {"action": "\"We'll were just soldiers, and new ones at that, guess its not really our place to question things we don't understand.\"", "result": "The two men seem to think about what you said for an age before finally replying.\n\n\n\"Well you might be right, have a good night since I'm not entirely convinced Arbor there is going to easy on the marching tomorrow!\" He gives you a smile and a bit of a funny wave as he stands up from the fire and you return the gesture before taking your soup from the fire and having your supper.\n\n\nLuckily the next day the Capt. does go a lot easier on you all, making the First Point in 1 day seemed to pacify him somewhat. He now is mostly quite congenial between short bursts of calling your all little girls but you think its just his way of encouraging you.\n\n\nThe next two of weeks passes very uneventfully as you march towards the border with days pretty much consisting of March, Eat, Sleep then march some more, when the capt. points out that you are all crossing the old border and into new territory. You think that it seems pretty close considering how far North you used to go mining and hear Capt. Argor saying that he can explain the local borders to anyone who wants.\n\n\nYou make the mistake of asking and after a very long a boring talk (maps appear to be Argor's passion but he is only sad he dosn't have an advanced editor to insert one here.) it is explained to you. To the North of your home city your borders are greatly extended due to the western mountain range as it slowly curves North and East and meets the sea. So since the mountains are hard to cross most of the year, your city controls all the encircled land, and since its safer there, that is where it has most of its farms and townships. Whereas to the south and east other nations have encroached significantly closer over the more open and less defensible terrain. Sadly he doesn't stop there and starts going into the different types of rocks in each area and you gather that this is some sort of hobby of his.\n\n\nWorn out by the talk of maps you bed down for your first night in the newly claimed territory. Since Argor kept you up talking about the types of rock in different areas of the kingdom most of the sleeping spots are full.", "action_results": [{"action": "Grab the spot beside the Capt. as its nearest.", "result": "Just as you lie down to sleep you see the two men who had approached you a couple of weeks before walking nearby, you give them a nod and they give you a wave and wish you a good nights sleep.\n\n\nNothing had come of the talk they had tried to start so you think to yourself that you had been very paranoid in suspecting perfectly normal guys in your own unit and drift off to sleep telling yourself that you should chat with them over supper sometime since they seemed nice enough.\n\n\nThe morning feels much like any other as you all pack up and start marching but you cant help but think about the fact that this used to all be ruled by a different kingdom, there is even the occasional sign of battle along the road. Whether from small skirmishes or a full battle you cant tell but the Capt. seems perfectly content to ignore it all and carry on down the road so you all just follow. He occasionally calls back a running commentary on the rocks and geology of the area but you all mostly ignore him when he does this.\n\n\nThe Capt. calls back \"Two weeks more and we hit the forward base sites and begin our work. Just remember that this used to be enemy territory so keep your eyes open as we go just incase.\"", "action_results": [{"action": "Nearing the New Border", "result": "The marching is taken slowly but efficiently and you approach the lines in just under two weeks. The Capt calls a halt for the evening about half a day out from the front lines and says that  he plans to arrive by lunchtime tomorrow so you better all clean up your gear and look presentable for the last march.\n\n\nHaving not gotten round to it before now you decide to spend supper chatting to the men who had approached you before. As you approach the fire one gives you a slightly cagey look but the other welcomes you and you all soon chatting happily away about life back in the city and plans for after the war. One or two others join you round the fire and by the time you head to sleep your feeling pretty silly for mistrusting their intentions at first.\n\n\nHaving had a tankard or two at the fire you readily fall asleep.", "action_results": [{"action": "Morning awaits", "result": "The morning horn is pretty normal, as is the packing up of the camp and forming up although you are all the shiniest you have looked since first got your armor since you were all told to look good for your final arrival.\n\n\nThe only trouble starts right before you are all due to set off and stems from the fact that 4 men are missing along with all their gear. The Capt. orders an immediate search of the camp and area around it but nothing is turned up. He seems genuinely angry for the first time and mutters about men being dragged naked behind horses before ordering the march to begin at double time since its an hour late.\n\n\nAfter an hour of double time he calls normal march and shouts back to the squad.\n\n\n\"Well boys it appears you have now seen the ugliest part of army life, deserters. I'm going to tell you now that running off after  you enlist and gain your armor is a very, very bad idea. The day you left training you swore to serve your country for at least 3 years so breaking that oath is treason and trust me on this, we deal with treason VERY harshly.\"\n\n\nThe proclamation is met with silence as you all try and think of who is missing, you think that you might have an idea when the Capt. begins to speak again.\n\n\n\"Now once we reach the temporary camps we are not going to enjoy a nice lunch like I planned, instead I will have to report this and each and every one of you will be questioned by some of our... lets call them information retrievers for now. So I'm going to give you all some honest advice. Do not lie to them, do not hold back and do not try and make things up. If you are honest, you'll have a two minute chat and be in the lunch tent right after. If they catch you lying you'll be in a whole lot more trouble. You all understand?\"\n\n\nThe squad replies with a resounding \"Yes Sir!\" then marches in silence until shortly before noon when a runner approaches from up ahead. Its a scout from the camp up ahead and he chats to the Capt. before running back the way he came. The Capt. thinks for a bit before addressing you all.\n\n\n\"Well it seems that our deserters tried to cross the lines some time this morning and get over to the enemy side, it also appears that they were carrying some important documents with them. They didn't make it. This wont change our plans at all but just a reminder for you all, be completely honest when questioned and you'll be fine.\"\n\n\nOnce you reach the camp you are all surrounded then guided to a large tent by soldiers from another squad whose emblem you don't recognize. You are informed that you are all here for a quick chat at the request of the intelligence section and that you should wait patiently to be called through as it shouldn't take long.\n\n\nThe man seemed nice and reassuring but being 'invited for a chat by the intelligence section' doesn't calm you down much.\n\n\nYour turn finally comes and you are lead through a tent opening into smaller adjoining tent with an old small man waiting behind a desk. You notice another man standing to the side poking at a lamp seemingly trying to get a steady glow from it as it flickered and spluttered.\n\n\nThe small man looks up and smiles \"Come in and have a seat, don't mind my colleague there, he just refuses to requisition a new lamp if he feels he can fix that one.\" The other man just grunts and nods in your direction before turning back to the lamp and swearing at it under his breath as he started fiddling with it again.\n\n\n\"So I'll be honest with you\" he begins \"The men that deserted your company may have been trying to take documents containing very classified information regarding our city over to the enemy. We simply need to know everything we can to ensure nothing got through that could put our city in danger, do you understand?\" he waits for you to nod before continuing. \"So if you could please tell us anything you think is important I'll note it down then you can be on your way to the lunch tent which I believe will be something nice today.\"\n\n\n\"Rabbit stew and potatoes.\" interjects the man at the lamp.\n\n\nThe small man laughs before continuing \"My colleague keeps a close eye on the menus, but we must be getting on, so do you have anything you feel might be important to share with us?\"\n\n\nThe men seem congenial and relaxed and this isn't exactly an interrogation so you quickly decide what to say", "action_results": [{"action": "No need to mention a few small chats and get yourself in trouble. You say that you dont really know anything, you may have said a few words to them but dont really know them or what they planned.", "result": "You didn't exactly lie to them at all but you left out quite a few details here and there. No point in mentioning things that might make you look bad since you didn't really have anything to do with it now is there?\n\n\nWell, The small man behind the desk doesn't seem quite as sure so asks one last question.\n\n\n\"There aren't any small details you may have left out are there, anything connected to the men or what they may have been thinking?\"\n\n\nHaving come this far you arn't about to make yourself look worse by changing story so you deny knowing more.\n\n\nThe little man thinks for a second then gives his colleague a small nod then turns back to you \"Thank you for your time Glor, my colleague here will point out the lunch tent to you, I believe that captain Argor is waiting anxiously there for you all, he acts like a bullying older brother, but like older brothers he does care about you all. goodbye.\"\n\n\nYou thank him and follow then grunting lamp obsessed man out of the rear tent flaps.\n\n\nYou got away with it!\n\n\nThe man holds aside the flaps for you and points towards a large tent with a blue pendant flying above it. \"That one.\" he mumbles at you then starts you turn back into the tent.\n\n\nYou take a step forward before everything goes instantly black.\n\n\n ", "action_results": [{"action": "Waking up?", "result": "You wake up in a small room with earth walls, you look round and realize you must be underground. You feel restraints on your arms and legs but can see the small man sitting near you. He is arranging small metal and bone implements on a table beside him. He begins to speak without taking his eyes off his task.\n\n\n\"good evening Glor, you have been asleep for several hours now while we finished the rest of our chats. Unfortunately you were clearly holding back when we talked so now I must find out exactly what you weren't telling us.\"\n\n\nYou immediately try to explain but realize your mouth isn't obeying you and you can at best make a slobbery grunting noise.\n\n\n\"Ah yes that is a drug I have given you. most people start talking far to fast and saying anything they think I want to hear at this point. To stop that behavior I have taken your power of speech for about half an hour. After half an hour the drug will wear off and you can start talking but until then I am going to make sure you understand that I want the EXACT TRUTH and nothing else. Not the smallest detail missing and not the smallest one invented. Now lets begin.\"\n\n\nThe pain is more than you imagined possible and you are informed that you have also been given drugs that appear to prevent people from going unconscious due to pain so that you have no escape. The man is as good as his word and by the time half an hour is up you are screaming wordlessly.\n\n\nhe stops and gives you time to recover and let the pain ebb away.\n\n\n\"Now you see how serious I am about the truth do you not?\"\n\n\nYou croak a yes in reply before telling him everything, every detail about the men you remember, every word you remember being said and everyone you saw them even talking to over a fire. After you are finished he asks a few questions he seems satisfied.\n\n\n\"Thank you Glor, now I see no hesitation at all in your eyes and your story perfectly matches what we already knew to be fact so I know you are telling the truth.\"\n\n\nYou sag back against the hard table relieved. he gives you something to drink before continuing.\n\n\n\"Now sadly I have made a small mess of a few parts of your body and some of the acids I used on you leave horrific scars and other damage. Also you now know about our section and its methods so you cannot be released incase you spread this information further. Ironically information about us and our commander was part of what those traitors were trying to smuggle out!\"\n\n\nYou try to object but realize the drink he gave you was the drug that paralysis your mouth.\n\n\n\"Now Glor since you were honest with me your death with be very swift, and do not worry, you body will be returned to the city as evidence of the horrible torture our enemies do to captured soldiers.\"\n\n\nYou barely even see his hand slip forward to slide his small blade into your neck and sever your spinal cord.\n\n\nYou die instantly.", "action_results": []}]}, {"action": "Complete honesty is best even if you might look bad. You tell everything from when you first had doubts, them approaching you and the last night by the fire.", "result": "You were warned not to lie to these people and you don't plan too. Even if they seem nice, they are still intelligence workers so you cant be too careful.\n\n\nYou tell them the entire story of meeting the men, you tell them every detail you remember about them before and after they approached you. You even tell them anything you think might have given them reason to talk to you. After your done the small man smiles encouragingly and asks a few small questions to clarify details before putting his quill down.\n\n\n\"Well thank you Glor, I do believe you've told us everything you know. You didn't even try to hold back minor details that may have made you look bad but don't worry, you having some doubts isn't a crime and I'm sure the commanders here can put any of your fears to rest. Now I believe the Captain is waiting anxiously in the lunch tent for you all. He puts on a strong front but he always takes care of men in his charge, now go enjoy your lunch, my colleague there will point the tent out to you.\"\n\n\nThe grunting lantern obsessed man waves you over to the back of the tent and opens the flaps for you \"The one with the blue pendant.\" he points to a large tent some way across the camp \"Rabbit stew today.\" he adds before retreating back into the tent.\n\n\nYou call you thanks and head to the tent. The little man was right and Capt. Argor is waiting at the entrance, he gives you a reassuring smile and sends you over to the long table where the squad mates who went in before you are all sitting and dishing out stew from a central pot.\n\n\nAs the lunch hour passes all but 1 of your squad makes an appearance. The Captain calls you all over and you hear him muttering that he told him not to try and lie before he addresses you all properly. \"Right boys you've been spoken too, had some good grub and not its time to meet the rest of the 3rd! We have the main barracks tent in this camp so the commander will give you all a once over before your all assigned duties. Follow me.\"\n\n\nNo-one asks about the missing squad member and several others had heard the Captain's muttering so you all march to the 3rd companies barracks tents in silence thinking that this camp may not be as welcoming as everyone seems so very keen to make out.", "action_results": [{"action": "The New Commander", "result": "Once you reach the 3rd Companies HQ tent you are all looked over by an older officer who is introduced as the 3rd's commander, and one of the highest ranked officers on the front lines. He gives a welcoming speech and tells a few of his old military stories to try and make you feel at home but ends with telling you all that one of your number ran off during questioning towards the front lines so was probably working with the others that had disappeared.\n\n\nHe quickly changes the subject and tells you that the most important matter at hand is getting this base up and running. You can see the start of the fortifications from here and the men working on them so he leaves you back in the care of Capt. Argor (who it appears requested to be assigned to your squad) and he takes you to the work site.\n\n\nOnce there you are divided into smaller teams and sent off to the areas that suit your skills best but 2 other highly trained men and your self are kept back and are taken to the work-site overseer's tent. Due to your experience you each given teams to command and areas of the fort to work on, The deadlines are strict but your labor is made up of disciplined soldiers so work should progress quickly.\n\n\nWeeks pass and the forts defenses and main buildings are fully constructed right on schedule. Capt. Argor calls in a few of the team leaders including yourself for a chat.\n\n\n\"Well boys the work here has gone great, but the 1st and 2nd haven't been idle either and and still pushing on ahead. Resistance is growing as they near Carn but we should have it under siege but the time spring hits. That being the case we need men and overseers on the front lines to quickly erect new defense lines and set up all the siege works once we reach their walls. The rest will remain here to finish off these forts and make them defensible and livable for years to come. I for one will be heading forward, its dangerous but I was never one for waiting around, who else wants the exciting job?\"", "action_results": [{"action": "Head to the front and eventually the siege lines", "result": "The trip to the front is a long one, each day away from the newly built forts increases the risk of being attacked by small bands of skirmishers or partisans that might be in the area. Your party has an escort from the 1st but you only number 100 men and so everyone is kept watchfull and double sentries are posted each night.\n\n\nAlong the way you stop at the small temporary encampments your army is using to move the supplies, no more than palisade walls around bare earth but each time your group stops for a day or two to help fortify the camp before moving on. Finally after many days of marching and building your company arrives at the front lines, they have been pushing ahead each day against increasing resistance but the enemy seems to retreat each time it has lost the advantage.\n\n\nCapt. Argor confides in you that he hates the tactic but that its been their most effective one of the war. They set up small ambushes and skirmishers to engage your vanguard into each fight blocking the advance. They would just keep moving and plow over the small attacks but very occasionally its a much bigger force and plowing ahead would lead to massive casualties. So most days the march is interrupted and temporary defenses erected.\n\n\nThe advance continues this way until you are within sight of the city and the clear plains around it prevent any large numbers of troops to be hidden.\n\n\nSpring is just about to begin as your troops encircle the city and you and the rest of the 3rd start building defenses and war machines.", "action_results": [{"action": "Final Charge", "result": "Your troops are elated about beginning the siege as they see it as a much safer occupation than marching through hostile woods and you share their relief. Your men work quickly and in a couple of days you are beginning to see walls, ditches and palisades spring up around the city.\n\n\nYou mainly work on erecting palisades behind shallow ditches but lend a hand to the construction of the massive trebuchet that are going to bombard the cities walls. You feel that the work is going well and that within a week your army will have a very strong position ready to repel any final attacks.\n\n\nUnfortunately Carn does not wait for the week to end and instead attacks in force. Just before dawn they flood out of a merchants gate and launch a full scale attack on your encircling lines. You have some defenses in place but there are still gaps and it is through one of the gaps that they push. Capt. Argor hearing the horn rouses you all instantly and orders you into full armor.\n\n\n\"Now is the time we draw swords with the rest! We built these defenses and now we man them ourselves!\"\n\n\nHe leads you all out and into the camp, as you move forward you can see fires spreading and hear the din of battle. Your army hadn't been as prepared as it should have been and it seemed that every man in Carn was on the field in full armor. The Capt. upon seeing the state of the camp lead you in front of the medical tents and ordered you into a defense line before running inside.\n\n\nOnce he returns he explains whats happening.\n\n\n\"They are attacking and making ground through the camps fast. These are the medical tents, sick and injured are being evacuated by the staff as we speak but we need to buy them time. We hold here. No retreat untill they are safe you understand me?\"\n\n\nYour squad responds with a resounding \"Yes Sir!\" and prepare for the onslaught.\n\n\nIt comes fast and is brutal. A full platoon of enemy soldiers charges you shield line and is in the process of breaking through when they are hit in the flank by a squad from the 3rd who were barracked elsewhere. They join your defense as the enemy regroups and you start gathering stragglers from defeated squads.\n\n\nThe enemy attacks relentlessly but each time you just hold the line long enough, then finally the all clear is given from behind. Your squad gives a ragged cheer and those left standing begin to try and retreat. Sadly the enemy has been reinforced and hits you hard, finally smashing through your defense line and overrunning the tents.\n\n\nYou fight bravely and have used your skills to take down several attackers but you are tired and you shield arm slips long enough for a spear to take you in the side. You fall and look up at one of your attackers officers as the rest push over you to get at the retreating defense lines. You see him pause to look down.\n\n\nYou manage to say \"We will still win the war, My home will be avenged.\"\n\n\nHe looks down at you with something akin to pity \"Avenged? We never attacked you, your own council sent the burning ships so they could invade us, no, there will be no vengeance for your home here.\"\n\n\nThen he takes a soldiers pity on you and ends it all.", "action_results": []}]}, {"action": "Stay back to finish off the fort's defences", "result": "The Capt. Looks right at you obviously wanting you to volunteer but you don't raise your hand and silently watch as he and the group of volunteers head out to the front.\n\n\nThe rest of you get back to work and the teams that no longer have overseers are split between you, but you know the work by now and more importantly most of the workers in the 3rd have been building these forts for years so know the work whether you do or not. The fort is finished on schedule and your men even find time to do some minor detailing on the wood and stone to make it feel more like a town than a front line fort.\n\n\nNews comes in from the front and you hear about your army's advance, and as spring is about to start you hear that Carn is finally encircled and that the siege lines are being build by the 3rd company already. You are once again amazed by the fast progress but keep your concerns to yourself.\n\n\nA few of you are given minor promotions for the speedy work and are retained at the fort for maintenance work and the continued important works that the commanders want. Your company has even managed to bring out or build proper long tables and roasting pits for the food hall. Its just when you are on your way to a meeting concerning the replacement of a wooden structure with stone that the news comes in.\n\n\nCarn launched a major counterattack from their city before the defenses and war machines were ready. they were beaten back but your army suffered very heavy casualties, some squads and platoons being completely wiped out. You ask about the 3rd but are told that they heroically held a defense line in front of the medic tents against horrific odds, most of them are getting medals for it but only 6 out of the 100 men there survived so the medals will be posthumous.\n\n\nFeeling saddened by the news you barely hear about how the Carn army was beaten back in the nick of time by a flanking maneuver. Nor do you listen to reports that bombardment of the city started with firebombs in 'revenge for the Old Quarter'.\n\n\nYou stay on at the fort for a few weeks then head back to the city as a military man, you settle into a city construction position and take no further part in the war, which quickly ends with your city's complete victory.", "action_results": []}]}]}]}]}]}, {"action": "You dont really want to sleep near the Capt. in case he tries to talk about rocks again in the morning, sleep out at the edge of the camp.", "result": "You head right out to the edge of the camp and set up your bedroll, you don't mind this as your used to sleeping in the wild and there is still the ring of sentries beyond the reach of the light. You drift off to sleep watching the stars and thinking about whether you prefer hare or rabbit in stews.\n\n\nYou awake to a slight noise near your head. You groggily sit up and see one of the sentries has come just into the firelight and at least two men were walking past your bed roll in full gear towards him. They freeze as they see you move before one comes close. Its one of the men who approached you before.\n\n\nHe squats down beside you and quickly whispers \"I'm sorry, we did give you a chance but theres no going back now.\"\n\n\nYou take a moment to wonder what he means since your still half asleep but before you can say anything you feel a wetness on your neck and chest. You try to speak but just gurgle blood and realize he had cut your throat.", "action_results": []}]}]}, null]}]}, {"action": "Head down and head out! The army awaits!", "result": "The Army must be pretty dam good since they have been advancing so far, you do have some niggling doubts about just HOW well they are doing but what is the point in raising them now?\n\n\nYou see a soldier you don't recognize step forward.\n\n\n\"Right then, I'm Capt. Argor. Since I took an arrow in the knee and had to come back here for treatment, I've been given the onerous task of accompanying you to the front lines to make sure you ladies don't get lost. You were all told to report here in full gear and with all your supplies so has anyone left anything behind that they just must run back to their rooms for? Hankies? Training Bra? No? Good, I might not have to babysit you all quite as much as I feared, lets head out cos this is gonna be a long trip for you city folk.\"", "action_results": [{"action": "To First Point", "result": "You are given a break for lunch with only cold rations, then double speed marched hard till dusk. The Capt. Pulls you all off the road beside a small stream and even though your all ready to collapse and pass out he has you form up.\n\n\n\"Right then, this is first point spring. A few generations back some officers from the 1st and 2nd companies were insulting the 3rd, saying we weren't real soldiers because we just built things while they won the war. Our officers didn't take too kindly to this and lets just say a bit of an argument broke out. After the tempers calmed a bit our men challenged the rest of the army to prove their supposed superiority\"\n\n\nHe paused to give you all a big grin.\n\n\n\"Our boys in the 3rd work hard every day moving timber and stone, carrying loads long distances and almost never take days off. Their boys sit on their arses most of the time and only train short periods a day when they aren't actively attacking something. So our officers said they should all go for a little march. You all just made it here within daylight hours which isn't bad at all for this time of year. The 1st and 2nd company soldiers made it in about the same. OUR officers beat them by 3 hours and had a full camp set up and running by the time they limped in. They looked up from their fires and said this is normally just the first point the 3rd stop at before marching on but they had thought they should wait for them to catch up. Its been known as first point ever since. Now anyone joining the 3rd makes the march, so welcome to the 3rd gentlemen, now get our camp up!\"\n\n\nRelieved that Capt. Argor wont be calling you all girls for the rest of the march you all set up camp and get some fires going. You're just settling down beside your fire to have supper when a couple of other come over and join you.\n\n\n\"Hey there mind if we join you?\"\n\n\nYou nod to a rock near the fire \"Of course.\"\n\n\nAfter sitting and eating for a minute one of the men turns to you, \"We should be honest with you, we didn't join you just for the company this evening. We have had something on our minds recently and thought you might be thinking the same things as us.\" After a pause where he looks carefully at your expression he starts again \"We are concerned about just how fast the war is going, how one-sided it is and maybe even some of the stories about why it started. We asked about it quietly before and the commander just told us its because we were better prepared than before and broke their defense lines. What do you think?\"\n\n\nYou think slowly before the reply", "action_results": [null, null]}]}]}]}]}]}]}]}]}, {"action": "Earn the last few coins and enjoy the leasurely trip back now you have no rush after all.", "result": "Your group numbers around a dozen workers and stays on over the weekend and most of the next week, dismantling old shacks and helping construct the permanent miners residences. The work is relatively easy after the hard labor of the mining and although the pay is low your still getting free food and a place to sleep. Once the work is done you all collect your pay from the overseer on the Friday, a week after the other group had left, and start a leisurely trip down the south road.\n\n\nYour group sets an easy pace stopping for at least an hour each meal and taking the occasional day out in farms and way houses that some of the other men knew from previous trips. You don't encounter any or the rumored bandits on the road but a dozen well built and fairly well armed men must make a less appetizing target for bandits. All in all you make terrible time back to the city but you really don't care as you enjoy the company and find the lack of rush very relaxing.\n\n\nSince you have plenty of time you all discuss future plans, some are just going to sit out the winter in the city living off their wages then head back out to new mines. A few are lifers and will be clocking in with their guild as soon as they get back ready to be sent on the next job and a couple like you are going to take a year or two out, one even gives you a name to ask about a flat in the Iron district.\n\n\nIts only when you all wake one morning expecting to see your first glimpse of the far off city in the dawn light and instead see a plume of pure black rising miles into the sky that you all start rushing back to the city as fast as you can.\n\n\n ", "action_results": [{"action": "Blackened Homecoming", "result": "Your group practically runs the entire way back to the city making it back well before the sun is at its peak. You all go through the main gates into the Iron district and down towards the source of the smoke. It quickly becomes clear that its the old District, the area you grew up and where you know your closest friend should be running his fathers tavern. as you get close to the wall separating the districts of the city you start to meet groups of people just standing and staring, all seemingly in shock. Most are the better dressed of the affluent Iron district but you see the occasional Old district dwellers, standing alone or in twos and threes, but all equally lost or in shock.\n\n\nYou approach the nearest group and ask what is going on.\n\n\n\"Fire, just a bloody huge fire. It spread in seconds. we didn't have time to do anything. Just ran. We were bringing some fabrics up from the dock, only reason we made it, we were only one street from the gate. Oh God..\"\n\n\nYou leave the man as he sinks to the ground and stares towards the high walls.\n\n\nYou had only been looking at the people and the smoke before but now you just stared blankly towards where the wall separated the districts and just see an orange glow over the wall with plumes of black filling the air above it. Thinking of you friend and his tavern located close to the docks you sprint down to the gates but once you get there you find them closed and barred shut. grabbing the nearest guard you shout for them to be open so you can get to your friend but he just stares blankly back at you obviously shocked dumb then walks away. The gate captain walks over and tells you that if anyone is still in there and didn't get out before the gates had to be shut, that there was no chance of them being alive. You start to tell him that he is wrong and needs to open the gates when he takes you over to them and tells you to put a hand on them.\n\n\nYou reach out and feel the gates metal almost hot enough to burn you. The captain quietly tells you that the fire started late the last evening. It came at the worst possible time. it had been dry for weeks and wooden buildings had been built right from the shore to the base of the wall, all stocked full of the years produce, hay, wheat, pelts and oils. most of it flammable. The wind blowing in from the sea had fanned it into an inferno almost as soon as the first warehouses had gone up. It had spread unnaturally quickly and only the closing of the huge gates had stopped it spreading through into this district too. The gates would stay closed until the embers were cold, and that could take a couple of days at least without any rain to quench them.\n\n\nYou stand and stare over the wall for what seems like an eternity then quietly turn and walk back up into the Iron district. You take your road companions advice and speak to the man he mentioned about a flat and find that he did have one free. You agree to the price almost without listening then buying a cheap bottle of mead you head back out to watch the place you grew up burn down to the ashes before collapsing into your bed long evening fell.", "action_results": [null]}]}]}]}]}]}]}, {"action": "It's not worth it, Start your journey south", "result": "Having decided to head back south you set off back the way you came. As you near the turn off to you old camp you see a new sign has been erected pointing the way to the new mine, a sure indicator that new guards and an official are there now. That means no easy nights rest there as they are always careful to keep hangers on and travelers well away from the mines \"to keep them from getting any ideas about the silver\" as you were once told.\n\n\nYou camp off the other side of the road  then continue south in the morning.", "action_results": [{"action": "The South Road", "result": "As you start down the southern road you think to yourself that it's been such a long time since you were back in the city that you're not sure that you'll even recognize it. Yet, despite all the supposed changes and improvements, one thing that would never change is the Old Quarter on the south bank where the river joins the sea. For as long as anyone could remember, the wooden buildings had stood virtually unchanged as the rest of the city rose and fell with the economy and rulers of the time. The Old Quarter was filled with dock-side housing, markets and way-stations for travellers; and it had been your home before you left to find work.\n\n\nHaving done your time in the mines and come away with a reasonably full purse you don't feel the need to hurry as you walk, so you are enjoying the experience of not having to rush to get to your next job. You don't see any signs of other travellers until early evening when a mid-sized group of workers and a few guards pass, marching double time to the north.\n\n\nYou carry on till it\"s nearly dark and set up camp in some woods beside the road.", "action_results": [{"action": "Morning on the south road", "result": "You quickly pack up your camp and set off south just as dawn reaches over the horizon, then realize ruefully that you could have slept in.  As you walk, you think on other habits you've picked up in the mines. Most were useful but getting up at dawn and sleeping at dusk would be pointless in the city where everyone rises late...\n\n\nYou are so engrossed in your thoughts that you barely notice the two figures on horseback when they join the road not far ahead of you and start moving south at a slightly slower pace than yourself.\n\n\nYou come out of your thoughts with a start as you notice them barely twenty paces ahead of you. Reflexively, your hand drifts down to your knife, just in case. But just as quickly you realize they are dressed as local land owners and one is a woman so you relax and hail them.\n\n\n\"Hey there, heading down to the city?\"\n\n\nThey turn back to you and both smile before the man replies \"Of course, there isn't too much else this way but we would be happy for some company if you'd like to join us?\"\n\n\nYou quickly catch up then fall in with them. You pass the time in conversation and learn that they are indeed local land owners heading to their house in the city for a few weeks. You tell them that you're just out from the mines and heading back for a well-earned rest. The day passes with you trading minor pleasantries and you agree to share a camp near the road for the evening. \n\n\nIt's just unfortunate that as you take out your sleeping roll the man clubs you behind the head and rides back north with the woman and almost all your belongings as you lie unconscious on the ground beside the fire.", "action_results": [{"action": "A Painful Morning", "result": "You wake beside the cold ashes of the small fire only wearing your shirt, trousers and boots. Everything else, including all your coin, has been taken. You curse yourself for trusting the couple from the night before simply because one was a woman and try to take stock.\n\n\nYou can't head North again, as in your current state you probably won't find another job for weeks and you can't even feed yourself so you're left with three choices: tightening your belt (well holding your trousers tight as your belt has been taken too) and heading to the city as fast as you can to hope for work/food there; hunting after the people that robbed you; or looking for the first trail off the road that might lead to a farm where you can ask for help or some work in exchange for food.", "action_results": [{"action": "Go After The Robbers", "result": "You think to yourself  \"Screw this, I worked too hard to give up all that money so easily!\"  You head north after the robbers, keeping just off the road in the trees in case they are waiting for you. \n\n\nYou follow their trail north for nearly the whole day until you find them leading off towards where the couple had first entered the road. You know since they were on horseback that they probably made it back the same evening, so you hope that after a whole day they would have become complacent.\n\n\nYou decide that:", "action_results": [{"action": "They are going to be complacent and you are a decent fighter, straight down the track after them!", "result": "You think you could take them in a clean fight as the woman seemed small and the man didn't seem like much of a fighter - He had just taken you by surprise before. You start quickly down the trail after the marks left by the horse and after half an hour you see signs of smoke ahead\n\n\nLooking through the trees, you see the woman grooming her mount and the man sitting by the fire, both completely unaware. You stride out into the small clearing and walk purposefully towards the sitting man.\n\n\nThe woman looks over at you and you hear her say \"Oh dear, this isn't very good, is it?\". The man glances up at you as you approach and says, \"Not good at all,\" as he starts to rise to his feet.\n\n\nYou laugh and say \"You're right! It's not very good for you. You picked the wrong man to rob!\" You smile and start to take the last steps towards the man, but as you raise your fists you feel a strange sensation, like being pushed from the side. You hear the woman saying \"Oh honey, we meant 'not good for you'. Bandits never just work in twos and this trap was intended for someone else. Since you don't have anything more of value we just need you out of the way fast\".\n\n\nYou look down at the crossbow bolt planted firmly in your side just in time to see a second one appearing in your chest with a dull thud. You sink to the ground. It all goes dark as you feel yourself hoisted up and carried into the trees.\n\n\n ", "action_results": []}, {"action": "Even if they are complacent, best you play it safe and try to sneak up on them through the trees and shrubs along side the track.", "result": "You've decided to play it safe, who knows if they were working alone and they may be better armed than before. Plus it would be sweet to see the mans face as he first realizes your there when you knock him out just like he did to you.\n\n\nYou sneak along near the track for close to an hour when you see smoke rising ahead from some trees. You push ahead being careful not to make any noise and approach the clearing slowly. You see the man and woman there near the fire talking and overhear snatches of conversation. You cant make it all out but it sounds like they are talking about a trap and waiting for someone.\n\n\nAre they talking about robbing you or a new trap for someone else?\n\n\nUnsure about their intent you think its best you take them by surprise either way and lift a hefty looking branch then sneak into the clearing at an angle so their backs are mostly turned to you. You approach as silently as if you were stalking a deer and slowly lift it above your head. You smile to yourself then call out \"Hey!\" just as you swing. The man looks up in shock just as the branch connects, knocking him out cold.\n\n\n\"Thats one down\" you say as you turn to the woman and heft the branch. The look of surprise on her face is priceless! \"How did you...\" she starts but you cut her off. \"Lets just say you picked the wrong guy to rob, now I don't make a habit of hitting women but I can easily make an exception so bring me everything you took, along with some food to make up for my inconvenience and I'll be going.\"\n\n\nShe just stares and asks \"But how did you get them all with just a stick?\"\n\n\nYou look at her blankly for a second and see her break into a smile \"Ooohhh, you just snuck into the clearing didn't you. I'm sorry honey but you should have realized we don't work alone, even if my guards don't make such good sentries\".\n\n\nYou glance at the trees just as several men with crossbows come running out and take aim at you. The woman backs away from you.  You think it was probably a bad idea to chase after robbers in the middle of nowhere as the men open fire rendering you into a human pin-cushion.", "action_results": []}]}, {"action": "Quick March to the City", "result": "You decide there isn't any other sensible option but to get to the city, and fast. You set off down the road at a fast walk and only stop to drink water from any streams or wells you see. You don't pass anyone else until a few days later you can see the city ahead in the far distance and collapse on the road exhausted.\n\n\nLuckily you fell near a well used field and the farmers load you onto their cart and take you the rest of the way into the city with a piece of bread to try to nibble on.\n\n\nOnce inside the gates they leave you off and after you thank them profusely, they head back out to the fields. You use the last of your energy to get yourself through the now alien feeling streets to your old area of the city and are relived to find it almost completely unchanged. You go to an old way house you knew in the hopes that the same owner was still running the place.\n\n\nAs you walk in the door a man behind a bar looks up and stares right at you for a full minute before saying \"Well this is some triumphant return, look at the state of you!\"\n\n\nYou start to explain but the man cuts you off and sends you upstairs to a small room to clean and says to come down for some hot food when you no longer smell and look like a beaten up pile of crap.\n\n\nOnce cleaned up and with a good meal inside you you tell your old friend the whole story and and he gives you two options. Work has been going well for him so he could give you a small room and meals and hire you for a low wage till you get back on your feet or you could up into the Iron district where the merchants and barracks have been hiring recently.", "action_results": [{"action": "The Iron District", "result": "You know that there is the option to join the guards as they are hiring at the moment, you'll get a basic wage but you have a bunk in the barracks and 3 good meals a day. Or you can approach the guild or large mining companies with your experience and hope for a starter job with one of them.\n\n\n ", "action_results": [{"action": "You head for the barracks as the guard seems like the fastest way to get a roof overhead and food in your belly.", "result": "You talk to the guard Standing outside the barracks, the home of the city guards and he directs you round to the recruiters. The Captain there looks you over once and asks your story. You explain in light detail that you had been working the mines for years but after being robbed had nothing left so you thought the guards would be a good way to get back on your feet. He thinks for less than ten seconds before passing you a quill to sign on the line telling you that many men had joined for worse reasons and that they needed more men on patrol.\n\n\nYou sign up and after a few days initial training you're attached to a squad and send out for your first training duty. You have no weapons while in training but you are given city guard leather armor and helm and sent out for, as its summed up to you, \"Stand behind the real guards in your armor and try not to look stupid for your first week\". You manage this with flying colors (especially the not looking stupid part) then for your next training rotation your given a choice by your sergeant.\n\n\nYou can join the training squad patrolling old town docks, the \"walk up and down in armor and not look stupid\" shift as he puts it (since you wont be armed for at least a month).\n\n\nOr the Iron district guard training squad, the \"stand out of sight and don't interfere with the cites working people\" shift.", "action_results": [{"action": "The dock patrole, at least you get to walk up and down...", "result": "Well, you were right, you did indeed get to walk up and down and it was passable exercise...\n\n\nLets face it, its not what you wanted from your life, BUT after a couple more weeks you will become a full guard, proper wages and you get to have a better say in your shifts, not a bad job in all, just the training period to get through.\n\n\nThe week goes as fast as the first one and the roof over head and hearty hot meals three times a day doesn't hurt matters at all. You actually take a liking to the patrol there as you get to stop and chat to the sailors and vendors along the dockside. The sailors there are self policing as a rule so you rarely have to step in to do anything dangerous.\n\n\nThe weeks pass and as you become a fully fledged member of the guard you make the docks your regular patrol, its a lot longer of a walk from the barracks on the other side of the Iron district but you like the atmosphere and relaxed attitude of the work. The occasional sneak thief or pick pocket are the worst of the criminals on your watch and you get to know the locals on your rounds on a first name basis, you even have time and enough spare coin to stop in for drinks with your old friend on occasion after work and he seems happy about how you landed on your feet.\n\n\nIts really actually starting to look up for you as time passes, you have some small savings building up again, a good job that keeps you fit and your making friends with the other guards and the locals, who like having the guards around even if they aren't usually needed. You even foster some ideas about trying to stay in the guards and move up the ranks as you watch the two large barges from Carn approaching the docks. You think they are approaching a little fast but with all the minor disputes lately they are probably just trying to bluster and throw their weight around with the smaller fishing boats near the dock.\n\n\nJust as you think about their speed you see the barge furl sails and out oars to turn and think to yourself that you were right when you realize the other had gone full sail and had smoke rising from the deck. You rush to the dock edge with the other guards and a few sailors as you watch its accelerated approach. you all realize its going to ram the old wooden dock about the same time as you see a full scale fire burst out onto the deck. You quickly look for the other ship but it had reversed course and is making haste away from the docks.\n\n\nThe sailors run for their ships and try to get them off the docks and you start forcing the crowd of gawkers away from the danger area but with the burning ship under full sail with the wind off the sea its only a few seconds more before it plows into the old docks and tears through them, crashing into two warehouses as it runs aground.\n\n\nYou start to cry out a warning as you see the ship tilt to one side spilling burning barrels full of oils and tars. But they explode as they hit the ground taking all the barrels filling the ship with them in one huge fiery explosion. You don't even have time to turn away as the blast smashes you through buildings killing you instantly and starting a fire that would incinerate the whole of the Old District", "action_results": []}, {"action": "The Iron District shift, leaning quietly against the district wall for a week is at least easy...", "result": "Well, you were right, you did indeed get to rest... and be bored...\n\n\nLets face it, its not what you wanted from your life, BUT after a couple more weeks you become a full guard with proper wages and you get to have a better say in your shifts, not a bad job in all, just the training period to get through.\n\n\nThe week goes as fast as the first one and the roof over head and hearty hot meals three times a day doesn't hurt matters at all. You actually take a liking to the shift there as you get to stop and chat to the workers and vendors along the roadside, and the guilds there are self policing as a rule so you rarely have to step in to do anything dangerous.\n\n\nThe weeks pass and as you become a fully fledged member of the guard you make the Iron district your regular patrol (yep the real guards get to walk around the district). Its short walk from the barracks and you like the atmosphere and relaxed attitude of the work. The occasional sneak thief or pick pocket are the worst of the criminals on your watch and you get to know the locals on your rounds on a first name basis. You even have time and enough spare coin to stop in for drinks with your old friend down in the Old District on occasion after work and he seems happy about how you landed on your feet.\n\n\nIts really actually starting to look up for you as time passes, you have some small savings building up again, a good job that keeps you fit and your making friends with the other guards and the locals, who like having the guards around even if they aren't usually needed. You even foster some ideas about trying to stay in the guards and move up the ranks as you walk alongside another guard down the main market street.\n\n\nYou both head back to the barracks when you're relieved as your's is the early shift that day and your entertaining the idea of another night down at your friends tavern- you've even got some friends from the guards liking the place enough to make it a regular thing for your patrol. You're just getting in the door when you hear mayhem breaking out in the barracks.\n\n\nYou push into the hall to hear the guards all shouting about a fire in the old town. You rush outside and head at a dead run to the speedily growing black cloud above the Old District.", "action_results": [{"action": "Reaching the Gates", "result": "You pull up from your run a couple of hundred feet from the gates and the wall. You just stare blankly towards where the wall separated the districts and just see a fierce orange and yellow glow over the wall occasionally punctuated by large bursts of flame with plumes of black filling the air above it. You sprint down to the gates but once you get there you find them closed and barred shut. grabbing the nearest guard you shout for them to be open so you can get to your friend but he just stares blankly back at you obviously shocked dumb then walks away. The gate captain walks over and tells you that if anyone is still in there and didn't get out before the gates had to be shut, that there was no chance of them being alive. You start to tell him that he is wrong and needs to open the gates when he takes you over to them and tells you to put a hand on them.\n\n\nYou reach out and feel the gates metal almost hot enough to burn you. The captain quietly tells you that the fire came at the worst possible time. it had been dry for weeks and wooden buildings had been build right from the shore to the base of the wall, all stocked full of the years produce, hay, wheat, pelts and oils. most of it flammable. The wind blowing in from the sea had fanned it into an inferno almost as soon as the first warehouses had gone up. It had spread unnaturally quickly and only the closing of the huge gates had stopped it spreading through into this district too. The gates would stay closes until the embers were cold, and that could take a couple of days at least without any rain to quench them.\n\n\nYou head slowly back to your room and collapse into bed unsure what to do next.", "action_results": [{"action": "Black morning", "result": "You awake in the morning unsure what to do. Your plans had been of an easy year living off your money and you could still do it, prices would probably go up for a time but you'd still comfortably now that your settled. But you were now sure you'd lost any place that you had called home and your closest friend in the fire so you at least wanted to find out what had happened.\n\n\nYou grab some food then head out to start trying to ask questions and see if anyone is the wiser about what had happened to cause the fire, and to do a last look through the survivors for any sign of your friend.\n\n\nYou ask several guards but most don't seem to know any more than you do. Eventually you see a guard that isn't a shell shocked as the rest and he tells you that the captain over at the military end of the barracks has all the information about the fire and that you should speak to him so you head there to see what he knows.\n\n\n'The Barracks' as it is generally know does contain the city guard's barracks but also the military side of things, the army barracks, its armory, offices and everything else it needed all in one giant building  that straddled and made up part of the wall between the iron and stone districts. You quickly see a small group of people talking to soldiers outside one of the entrances and approach them to hear what is going on.\n\n\nIts one of the captains explaining the fire to them, a few minor details extra but basically what you had heard before. once he is done you ask him about how it started. He looks you over then send you in and tells you to talk to the man at the desk, first room on the right. You enter and realize you not left with much choice as to where to turn since there is a group of soldiers blocking the corridor a few meters away with only one door standing open between you and them. You enter and approach the man looking at you from behind the desk.\n\n\n\"What can I do for you?\"\n\n\n\"I want to know how the fire started.\"\n\n\nThe man seems mildly amused by your abrupt response but any trace of amusement quickly vanishes as he replies.\n\n\n\"A ship packed with flammable fuel was set alight and rammed into our docks. the fire was deliberate.\"\n\n\nStunned by the sudden revelation you ask \"Are your sure? wait are you just telling everyone this? wont it cause a panic?\"\n\n\n\"There's no point trying to keep it a secret, half the fishing fleet saw it happen as did many of the survivors that ran into the sea and were picked up the by the ships, the entire city will know in two days at the most.\"\n\n\n\"But who would do it, what is there to gain from burning down old district?\"\n\n\n\"We think it was Carn, at least the burning ship and the one that had been accompanying it bore their colours\"\n\n\n\"But don't we just have some minor trade disputes with them why would they do this!\"\n\n\n\"Well long story short we started full maritime trading 3 years ago, then two years ago some minor trade problems began, then it was about land, finally about fishing rights. things had been getting tense for months with armed ships keeping fishing boats company for protection and guards on our borders but no-one expected this. They have been sent ravens with questions about the ships but they will of course deny all knowledge, then it will be war. The king has already started recruiting to replace the men lost in the fire and more to fill out the army.\"\n\n\nYou just stand unsure what to say, should you hate an enemy you don't know for what they did? Denounce their tactics, or just avoid the war and try and rebuild a life in the city.\n\n\n\"So son\" the commander stands up \"we are still recruiting and the army wage is just as good as the miners one. You want to enlist?\"", "action_results": [null, {"action": "You hate what they did but you have money and a chance at a life now so it would be stupid to throw it away in a war, you politely refuse and head out.", "result": "You spend the first few days split between organizing your life, doing patrols and watching the embers of the old district burn down to cold ash. Once the gates are opened you had planned to search through the wreckage for you old friends tavern but one look through the gate shows a nondescript layer of ash evenly coating  the ground as far as the outer walls and the shore, only the occasional blackened wooden timbers or cracked black stone sticking up to break the massive expanse of grey and black.\n\n\nSoldiers and workers begin repairing the walls and gates from the fire damage and as the weeks pass people begin to clear out the ash and wreckage that survived. In many places the fires burned hot enough that not even much bone was left but in others teams were on duty collecting remains and transporting them into mass graves outside the city limits.\n\n\nThe war had broken out after less than a fortnight. Carn repeatedly denied any involvement but after the trouble between the two cities and the witnesses to the ships bearing their royal colours war was inevitable. Reports said it was going our way and that we mostly had control of the seas between the cities and were making steady progress  on land as well, casualties were growing but going by the weekly reports given by the guards theirs were much higher and we would have them under tight siege by the end of spring.\n\n\nYou begin helping out where you can. You time in the mines has given you a simple grasp of solid construction so whenever you aren't on patrol you join the work teams which are put together building new stone docks in place of the wood ones. You join them as skilled labor and since you don't need the money you let your wages go to re-homing the survivors. Your work and charity gets you some small attention from the survivors that make up a lot of the unskilled labor and when they learn you used to live in the old district your adopted into the 'family' again. You even meet a girl a little younger than you that lost her family in the fire. Your just friends at first with you looking out for her, then you become closer, and by the time spring draws near you marry and settle into a life in the Iron town. \n\n\nBy this time your accepting your wage since most of the survivors are now in temporary homes and your work on the docks and accepted position amongst the survivors has landed you a full time position in the construction guild overseeing some projects in  the rebuilding of a new partly stone old district. The Guards saw the work you were doing and quietly let you quit as they knew you were doing better work rebuilding.\n\n\nThe War went as quickly as you had been told to expect with Carn under tight siege by spring and fallen completely by summer. your army had been ruthless , firing burning oil and tar into the city and burning their food stores whenever possible, all in 'revenge' for the old district. Their king had denied all involvement right up until the surrender but he was now exiled along with his advisors and the city under your command.\n\n\nThe world passed you by as you spent your years happily with your wife and family, there were always rumors of other wars and far off battles and victories but you didn't concern yourself with them as your city was now flourishing and always expanding and you had plenty of work as you moved up the guild ranks.", "action_results": []}]}]}]}]}, {"action": "You head for the guild as you know your experience could get you a good position if you push it enough.", "result": "You approach the miners guild with the hopes that your experience will land you some work fast, but your hope doesn't last long. They are happy enough with your resume and they even have a couple on people on staff who can vouch for your work but there are no new jobs right now and no major movements planned until the spring. They put you on the books and they guarantee you a skilled position by the time the winter snows melt but that isn't going to put food on your plate right now.\n\n\n ", "action_results": [{"action": "Your on the books now so what harm is there in taking up your friends offer for a few weeks?", "result": "Life isn't so bad working at the inn, you put in all the hard work required and your friend, apart from many sarcastic comments and jokes, is a good boss. You have a room and food again and start saving a small amount of coin up in the hopes of buying some new cloths and getting a better paid job eventually. After a few months you think you've saved up enough to make a go of it again in a richer part of town and let you friend know your plans.\n\n\nYou thank him for doing so much for you without really asking much in return as you know the work you did would never normally earn a wage along with room and food but he just waves you off and says the word \"friends\".\n\n\nYou arrange to finish off the week and move out as soon as you find a new job and new place to live.\n\n\nThat evening you both sit down to share a drink and talk about how to make easy money (your favorite topic since you were 10 and he was 15 working for his dad in this very bar). You glance out the window and comment that its awfully bright out for the time of day when you hear the first screams.\n\n\nYou both rush out to see a fire sweeping through the wooden buildings of the old quarter. you both turn to run but there is a wind coming off the sea pushing the fire on and the old wooden buildings are going up like kindling. In your blind sprint you both almost make it to the walls dividing the city's districts when the flames overtake you and the smoke makes you choke and fall. Its not long before you are engulfed entirely in flames.", "action_results": []}]}]}, null]}, {"action": "Look for a Farm", "result": "You start walking south, keeping an eye out for any farm trails or paths that might lead somewhere. You pass several small dirt tracks but most look more like animal trails and after your run in with the robbers, you're loath to risk them. After a few hours you pass near a stream. The water looks fresh and clean, so you take the time for a quick wash-up and a long, cool drink before you continue on.\n\n\nDespite your searching, it is only a couple of hours before the light starts to fade that you come across a well-worn track leading east off the road. Its the right direction for farm country and it seems to have seen recent cart traffic, so you decide its worth a look and start down the trail.\n\n\nAfter an hour or so the track passes through a thick line of trees and you see fields beginning in front of you. It looks like a large square holding of land surrounding a large old barn and house in the middle. Several men working the fields look up as you approach and lean on their scythes and hoes, keeping a watchful eye on the trees behind you. A man walks out from the door of the house while you're still a few metres away. He smiles and greets you cordially but you're somewhat distracted by the loaded crossbow he is holding casually at his side.\n\n\nYou explain your situation to him. He eyes you shrewdly and asks a few questions about the details of your story. After a few moments of consideration, he waves the men back to work and takes you inside.\n\n\nYou get a small apology for the crossbow but he points out that, as you learned to your own loss, there are a lot of bandits about recently and you can never be too careful. That comment at least makes you smile as you clearly hadn't been very careful at all. He gives you some hot food and a bed and leaves you to recover a bit.\n\n\nThe next day you work hard in the fields helping the other workers with the carrying and loading of carts then at noon they set off in a small convoy to the city to sell goods with you riding along. \"So you reach it in one piece\" as the Farmer had said.", "action_results": [{"action": "Reaching the city", "result": "It was a long trip on the carts but the farm-hands made good company and at least you had food. They take you with them to the markets first and you help unload as thanks. Then after thanking the farmer again for his kindness, you begin to make your way through the strangely alien streets toward the area where you grew up.  The city has grown so much in your absence that you had to ask directions several times before reaching the arch that has always marked the entrance to the Old Quarter.  On the other side of the arch you are relived to find it almost completely unchanged. You go to an old way house you knew in the hopes that the same owner was still running the place.\n\n\nAs you walk in the door, the man behind a bar looks up and stares right at you for a full minute before saying \"Well this is some triumphant return, look at the state of you!\"\n\n\nYou start to explain, but the man cuts you off and sends you upstairs to a small room where you are able to clean up a little. A few moments later, the man returns with change of clean, serviceable clothes and invites you to come down for some hot food when you no longer smell and look like crap.\n\n\nOnce cleaned up and with a good meal inside you you tell your old friend the whole story and and he gives you two options. Work has been going well for him so he has offered you room and board in exchange for some low wage bar work till you get back on your feet or he suggests you could also try your luck up in the Iron district where the merchants and barracks have been hiring recently.", "action_results": [null, null]}]}]}]}]}]}]}, {"action": "Search the camp remains for any valubles or food", "result": "Having decided to search the camp you reason that you should do it properly. You set a few snares in the trees nearby then start going over the camp carefully. You estimate that 40 to 60 people were here and they had lit a good number of fires so you search carefully around them and search in the grass beside the indents of the bedrolls.\n\n\nYou spent a couple of hours looking but apart from two miss-laid copper coins you find little of worth. Still, copper coins add up and you know what its like to go hungry so you add them to your pouch and collect up your snares. The only other thing you take is an old leather water bottle which you tie to your belt and remind yourself to fill it the next time you come across a stream.", "action_results": [{"action": "The road North again", "result": "Having finished searching the camp, you start North again on the road. You still see signs of the group ahead of you but they have well over half a days hard march on you and judging by how late they camped and how early they set off you decide that you won't be able to catch them without running for the rest of the day, and your not willing to try that just for some company. So, you set off at a steady pace North again looking for any signs of a turn off that may lead to the mine.\n\n\nYou spend an uneventful 2 days on the road, stopping occasionally to camp and refill your supplies but on the 3rd day you finally see signs that the group ahead of you turned off into the foothills west of the road.\n\n\nReasoning that such a large group must have a reason for heading into the hills, you decide that they are probably the crew for the new mine and that you've found the entrance. Knowing that with such a large group already there most jobs will be filled you can follow them and hope for some paid manual labor or you can give up on it and head South for the city. \n\n\n ", "action_results": [null, {"action": "Head into the camp", "result": "You walk into the camp drawing a few looks from the miners and guards but once you approach the man giving out orders they all lose interest.\n\n\nThe man tells your he's the camp overseer and asks you a few questions about yourself and how you found their mine. Satisfied with the explanation that his company of men had left a wide enough trail for a blind man to follow, he gets down to you main question of work.\n\n\n\"Most of the jobs, even the manual labor are filled, however we could find you some work if you're willing to do some of the more dangerous jobs that come up.\"\n\n\nHaving come this far already you reason that there's no going back now, so you agree to his terms and sign up.", "action_results": [{"action": "Work camp life", "result": "You quickly settle into the new camp. Miners are generally an accepting bunch as long as you keep your head down and work hard, so you make a few friends on the crew. The work is back breaking but it keeps you fit  and most of the riskier jobs aren't that bad really, so you just get on with it, knowing that once you're done you'll head South with enough coin to take it easy for a long time to come.\n\n\nAfter a few weeks the side tunnel you're digging reaches a very promising vein but it's surrounded by weak stone. You report it to the Overseer.\n\n\nHe takes a good look at the rock and the seam and decides that it's promising enough to force a tunnel through. You aren't sure you agree, as the fractured rock crumbles through your fingers. However, he says that it's the sort of job you signed up for when he took you on and that he'll offer you an additional bonus if the vein is good. You agree and are sent in with a couple of others to mine your way through to the vein.", "action_results": [null]}]}]}]}]}]}, {"action": "There's a good chance of catching food in the trees, head East", "result": "You decide a night under the trees and a good chance of catching food are too good an opportunity to pass up so you head east into the trees till you're well away from the road. You set up a small camp and fire and set up snares out in the trees.\n\n\nNot long after darkness closed in you hear some noise in the direction of the road and go investigate. You caught a Hare! you quickly skin and gut it and are about to head back to the fire when you hear noise from further towards the road. You walk quietly closer to investigate and see a large group setting up camp on the roadside.\n\n\nYou're about to leave the cover of the trees to go greet them when you over hear their leader telling a small group to go on ahead and prepare the mine camp. They are the workers sent to open the mine your looking for! You do a fast headcount and realize about 50 workers are camped there and many look experienced.\n\n\nYou decide that they must be the main team sent up to get the mining started and realize that they will have enough skilled workers to fill most of the mining jobs there, but unskilled labor is nearly always welcome- if on a much lower pay.\n\n\nYou think about it and you decide that you can either try to join up with them and risk the lower pay, or, you can try and beat the group sent on ahead and try and secure a better job at the mine site before word reaches them of their workers being so close.", "action_results": [{"action": "Race them to the camp!", "result": "You slip away from the workers camp fires and move quickly to your own, you kick dirt over your small fire and quickly collect in your snares. You wrap the hare in some leather and put it into your pack with everything else, you'll have to cook it later.\n\n\nYou set out at a jog through the trees, you know the road keeps straight for more miles than you can see ahead so you move until you can just see glimpses of it through the trees and settle into a fast jog.\n\n\nYou keep your pace up for several hours, you know it must be after midnight now and your pretty sure you passed the men on the road so you take a short rest below an old oak tree and hope they break for sleep too.\n\n\nIn the morning you wake with the first light and quickly set off, you set a more measured pace, walking fast but not quite jogging yet. You walk as fast as you dare through the day barely taking breaks apart from to eat some dried meats. An hour or two after night sets in you decide if you haven't put some distance between you and them by now you never would, so you build a fire to cook and eat your hare then settle down to sleep.\n\n\n ", "action_results": [{"action": "The Search", "result": "You rise at first light again, and quickly cover your fire with dirt. You head onto the road and search carefully for any sign of other men passing but find none. You must still be ahead of them, but you don't know by how much. You set off North again keeping your eye on the hills and woods to your left looking for any sight of a camp entrance or track leading away from the road.\n\n\nAfter a few hours you come across a small track leading into the hills through a copse of trees and on into the bare foothills. Its a very small track and could easily just be an animal trail but you can never be sure as people are always loath to leave any large signs of a new mine until the have laid full claim to it and got a fair number of guards in place. You spend a few minutes trying to check for other clues but in the end cant decide if it was made by men turning off the road of just some animals.\n\n\nYou could follow it further into the hills and check it out but it would be slow going and if it turned out not to be the mine it would loose you most of a days walking.", "action_results": [{"action": "Risk the trail", "result": "You decide the trail is worth the risk, its a little bigger than most animal trails and with the lengths some claimants go to to hide new mine sites it could well be the one.\n\n\nYou strike off onto the trail and after about half an hour it widens a little and you start to get more confident that you've made the right choice. A little more walking brings you to a man leaning against a tree and you think you can see a small amount of smoke over the hill behind him.\n\n\nYou approach the man as he hails you and asks your name and reason for being here. Its not the politest of greetings but you explain about coming off another mine job and hearing rumor of one here. The man looks at you for a while then tells you to follow him.\n\n\nYou follow him for 15 minutes or so till you've passed round one of the larger foothills and you come across a very small camp build around a very shallow mine entrance. You smile to yourself- Its the new mine, barely started and with only 10 or so men in sight you've beaten the others here!\n\n\nYour led up to a large man standing over a fire and are introduced to the Overseer of the new mine.", "action_results": [{"action": "The Overseer", "result": "You approach the Overseer who looks you over and repeats the questions about who you are and how you turned up at his mine entrance. You explain to him that you were a Skilled Laborer on a mine further south and that your old overseer had directed you here. Your a little liberal about the the date you left there and the amount of detail you had been told so he wasn't suspicious about your spring ahead of his expected workers. he thinks for a while and you think he has believed you. He presses for some details about your previous boss and the mine you were at then asked a lot of technical questions and posed several hypothetical situations about building mines and construction issues. It takes nearly an hour for him to be satisfied that you are who you say but finally tells you that he is from the same guild as your own boss and knows him well, since you convinced him of your ability and that your old boss recommended you he says he might take you on as a mid level skilled worker since he was a week behind and the men he had been expecting still hadn't turned up. \n\n\nHe walks off to a large, nice looking tent set up beside what looks like a half constructed stone house set off to the side of the mine entrance, he goes inside briefly then returns and tells you that the owner had agreed and you were hired, he takes you to the tent and you meet a middle aged but still fairly youthful looking man studying charts of the area with rock samples spread around the desk in front of him. he looks at you quickly and smiles\n\n\n\"So your the man who may get my mine back on schedule?\"\n\n\n\"I didn't know you were behind sir but I will defiantly do what I can if that is the case.\"\n\n\nhe smile again and re-arranges some of the rocks before replying. \"what do you make of this then?\"\n\n\nYou look at the arrangement of rocks on the table laid over part of a map showing your camp. the ones near where you were standing and the mine entrance were a mix of broken granite, shale and other unimportant rock but two of the rocks lying over the hill the mine was starting into had a definite shine to them, you life them to look closer then after replacing them see there is a piece of normal granite placed between them.\n\n\nYour about to say that there is defiantly silver in the hills when you stop to think why he would want such a simple answer so instead you reply\n\n\n\"You believe there are two main lodes of silver running into the hill and plan to open them both up from a large forked main tunnel instead of  a single straight entrance with branches?\"\n\n\n\"Ha! got it in one! its going to be harder on the crew building the supports but I think it will get both lodes producing ore much faster and if my hunch is correct the lodes are going to diverge more the further we get into the hills, I'm betting that our short entrance tunnel will be running the equivalent of two normal by the time we are fully up and working. Right since your here you can start today, sign this contract then get over to the loggers behind the hill and started on directing them to make the struts, Slarn there will give you the initial measurements.\"", "action_results": [{"action": "Beginning the mine", "result": "You immediately sign the contract put in front of you after a cursory glance confirms that its a skilled labor contract for a good wage and lasting at least until the mine is fully operational. You follow the Overseer out and round to where the three man logging team has stacked a small pile of trees ready for cutting and shaping into the mines first struts.\n\n\nThe overseer turns to you \"Right then these three have cut enough trees the past week to get us a good five meters into hill down both of the primary forks off the entrance shaft. But since we haven't had any skilled workers here apart from myself they haven't had the directions to get the struts started, so while I get back to the entrance shaft you get them moving double time.\"\n\n\nHe hands you a slate with the tunnel dimensions chalked on it and you quickly see the man knows what he is doing, he has laid out precise numbers and details of the style and shape of Strut he needs for each section. You quickly head over to the workers who had heard the entire conversation so to save your self time you quickly tell them your name and take the straight over to the logs. You set two of them to separate them according to diameter and wood type and keep the other with you to measure out the wood ready for cutting.\n\n\nYou've gotten the logs organized and marked out which ones to use for the braces and struts when you hear a small commotion from the camp at the mine entrance, guessing that this is the guards arriving you carry on working and get the men sawing the first struts according to your markings. The days work goes well and by evening you know you've pushed the men a bit hard but you have several well cut lengths of wood ready for final shaping in the morning.\n\n\nYou head back into the camp and have your suspicions confirmed, the guards have set up tents near the entrance to the camp but they pay you little heed as you retire to one of the shacks set up for workers for the night. The next morning you get your small team working right after breakfast because you now that the full work group should be arriving that day or the one after at the latest and you need to make a good impression first. You get them ready and you join in so your all sawing and shaping the logs while its still dawn and by noon you have 2 sets or struts with lintels cut, shaped and ready to put it place. you know they aren't smoothly finished or treated but you've been told the gear to do that will be arriving with the main workforce so just before the lunch break you and your team take the first two sets round to the mine entrance and stack them just to the side ready to be used when needed.\n\n\nThe Overseer comes over and after inspecting the wood and the shape he admits he didn't expect you to have any ready until tomorrow but inquires about your choices. You tell him that you knew he wanted to get the entrance shaft in deeper as soon as possible so you chose the easier to work wood to make the temporary supports so the shaft could be continued in safety while your team cut and shaped the stronger woods for the permanent supports meaning they could be fully treated before being put in place, you also give a lot of credit to you small team for how hard they worked. Your fast work, choices and ability to give credit to your men where it was due seems to make the Overseers mind up about you and he gives you a pat on the shoulder before turning to walk back towards the mine, he calls back for your team to take a break, the main workforce will arrive any minute and he will be transferring you to the tunnel construction crew now that there are struts able to be used.\n\n\nYou know you've done well and that he will be giving you good jobs now you've proved yourself so you head over to the mess area to grab lunch with your team as you see the main workforce approaching the camp.", "action_results": [{"action": "The mine well underway", "result": "The day the mining company men had arrived you had been called into the owners tent, the owner, Overseer and leading men of the main work group were there and you appeared to be the topic of discussion. They were objecting to you being hired since according to their contract they should be filling all the skilled labor positions They were also trying to bring your abilities and experience into question.\n\n\nYou arrived as the overseer had just vouched for your knowledge and stated that you had the backing of a second guild overseer so even if they weren't happy about it that your skills and experience were accepted as fully capable for what you had been hired to do. As you entered the owner paused the discussion and called you over, then asked if the overseers description or your work with the small logging team had been accurate. You relay what had happened again and the owner seemed very pleased. The mining group however didn't and stated that even if you were good at the job, the owner was breaching the contract to give you a position over one of their men.\n\n\nThe owner clearly tired of the discussion by this point started casually questioning the work group leader.\n\n\n\"When exactly does our contract state that your group would arrive and begin construction?\"\n\n\nThe man was smart enough to see were this was going to lead so carefully answered \"One week ago today sir.\"\n\n\n\"So considering that I paid a hefty deposit to your company in advance, how much money have I lost and how far behind is my mine's construction due to your lateness?\"\n\n\n\"The mine is almost a week behind sir, but the company will of course refund any loss of wages due to our late arrival. We were forced to wait while our supplies and gear was prepared for us.\"\n\n\n\"Never the less a full week is a pretty serious loss of coin and time for me and could easily be considered a breach of contract by your company, one that would enable me to cancel it for a full refund of deposit and hire someone else correct?\"\n\n\nThe man, now clearly sweating looked like he was trying to find a way out but could only answer \"That could be technically correct sir\".\n\n\n\"So considering that point; can you really argue that it is outside my remit, that during the week you were not present and my mine was not being constructed that I hired a single skilled worker to aid in my mines initial opening?\"\n\n\n\"No sir we wont object further\"\n\n\n\"Perfect, now that this is settled don't worry because he hasn't stolen any of your men's jobs. I'll hire him as an assistant to my overseer so that wont be a problem will it?\"\n\n\nObviously relieved that he didn't have a man out of a job he readily agreed and left the tent.\n\n\nThe owner and overseer finally turn to you and ask \"well now that the work group is happy and you have suddenly been promoted you have a nice choice ahead of you. You did a good job with your decision about the struts so I'd be happy for you to oversee the logging operation, but most of your experience lies underground and putting the struts in place, which job do you want?\"", "action_results": [{"action": "You pick the logging operation as overseeing it will keep you out of the way of the work group and you've already made a good impression there", "result": "You picked to run the logging group and have twelve men under your supervision plus the three who were there already. You send one of the experienced wood cutters to join your three and after briefly showing him what you had been doing there he quickly understands your system and gets started cutting and preparing the wood. The rest you organize into work teams and get them working on different stages of the process, some felling new trees, some stripping them and others cutting them to length for you final team to prepare, you make one experienced man in each group in charge of his team and your operation practically runs itself. You leave the small choices to the group leaders and spend your time ensuring that the final struts are up to specification and that you meet or surpass you daily quota of cut and treated supports for the mine. The overseer and owner seem happy with your work and leave you to make any decisions you feel necessary, just getting weekly reports and whatever you discuss directly with the overseer during the day.\n\n\nAs the weeks pass you all steadily work away and start logging smaller groups of trees near the mine to ensure a continuous supply of wood, you leave the choice of site up to the team leaders you assigned but you always take a cursory glance over them to make sure the trees are up to standard.\n\n\nThe mine has been progressing well, the main shafts are already going deep into the hill and side tunnels are being opened to chase any small seams off the main two. You've heard that a couple of the unskilled laborers have been tasked with digging out a particularly weak section of rock and your glad you above ground and not risking you life in a weak tunnel prone to cave in.\n\n\nAs the days pass you see one of your team bringing a tree over from the other side of the hill to your normal operation, you stop them to ask which trees they are felling and learn that its a small group of oak on the far side of the hill from the mine entrance. Realizing that some of the tunnels may have gone under in that direction you rush over just as two more trees are about to fall, as the smaller one hits the ground you feel it shaking and moving in an unnatural way. You break into a sprint and call for them to stop but its too late and the large oak falls and as it hits you hear a loud rumble and the whole hill shakes.\n\n\nYou realize you team has called a cave in. You run with them to the entrance as the whole camp arrives to asses what happened. Two workers were in the weak tunnel when the trees came down right above it, they were both crushed inside.\n\n\nYou weren't blamed for the incident and were just told to carry on, that accidents happen, but two men had died due to a mistake made by one of your teams. For the rest of the time you kept your head down and works as hard as you could making sure no more mistakes were made.", "action_results": [{"action": "Finishing the mining work", "result": "You kept your head down and worked hard for the rest of the time and not a single weak strut or badly treated piece of wood got past you after the accident. You were never blamed for the accident but you held yourself accountable and though your works was praised you didn't take as much enjoyment in it as you had before.\n\n\nAs the final day approached the Overseer called you into his now finished residence. You find him sitting behind a nice desk still covered with maps and charts and see a pretty girl who must be similar age to yourself sitting in a chair by a small log fire reading a book.  You begin to wonder if she is the overseers reclusive daughter that the camp is full of rumors about when he waves you over.\n\n\n\"I'll be leaving for the city in two days, the day you will all be paid for your work. You did a great job for me and worked harder than any other man here although I know its because you've been blaming yourself for the accident in the tunnel. Your pay has been arranged for what was agreed but a generous personal bonus has been included. Now take tomorrow off as I know your teams are set up to run smoothly enough without you hovering over them for their last day.\"\n\n\nYou thank the owner and head back out into the camp, The overseer is waiting outside and gives you a nod\n\n\n\"Don't worry I'll keep an eye on you teams for you, you've worked yourself too hard these last weeks so enjoy your paid day off.\"\n\n\nYou thank him as well then wander over to the packed breakfast tables. You chat to the workers there, many of whom you've become passable friends with and inquire about their plans now the mine is about to close.\n\n\nOne group is planning to leave on the day they are laid off and make good time down to the city because they want to get back to family there, while the other south bound group plans to stay until all the small jobs are finished around the camp for a few extra coins then has a much more leisurely trip with stops off at way houses and farms along the way. The second group will turn up to the city nearly two full weeks after the first but you're in no rush yourself.", "action_results": [null, null]}]}, {"action": "you think that overseeing the mines supports being put in will be the best use of your abilities", "result": "You know you did good work with the loggers but they will be receiving experienced men soon and your experience lies underground, The Overseer seems happy that he will be able to just concentrate on the tunnels themselves and the many minor jobs he does around the camp leaving the supports to you.\n\n\nYour given eight men to supervise so you split them into two teams, one to prepare the site while the other brings in and lays the supports, then both teams ensure its bearing the weight of the tunnel well before moving on, and you of course give the final check over yourself. Having caught a weak piece of wood early on you also check all the supports delivered to you before approving them for use to make sure there are no accidents caused due to your oversight.\n\n\nYou get on with your workers and everything goes smoothly and efficiently under your guidance, the Overseer and Owner seem very pleased with your work and just get weekly progress reports to supplement anything you talk to the Overseer about during the day. As the weeks pass you carry on working as before and as the tunnels deepens and sprout side shafts following smaller seams. You're given eight more men, so once you divide them like the first team you have two groups working simultaneously under you. After a few more weeks the Overseer mentions that a very promising seam has been found but that it initially runs through some very weak and fragmented rock. After a brief inspection you agree that its worth digging out and that after an initial tunnel with temporary supports is in place your men can permanently shore it up.\n\n\nOn the day its due to finish and your men are expected to start putting in the permanent supports you head to the tunnel to inspect the job. The unskilled workers have done well and had no cave-ins, and although weak and unprofessional the temporary supports are holding out well. your about to head back and ready your men as you can see the workers digging out the last loose rock when you feel a slight thump and a tremor running through the rock. You immediately think of the loggers and run out of the mine onto the hill above. You see not far off a tree on the ground with men cutting the last side branches off ready to be slid over to the logging camp, and two larger oaks behind in the process of being felled.\n\n\nYou see what is happening in an instant, the trees they are felling are almost right on top of the weak tunnel and if the biggest oak they are chopping at falls, the temporary struts will snap like twigs causing a huge cave-in. You start sprinting towards the men, shouting and waving your arms to get their attention. The men are too far away so have no Idea what you are shouting but luckily you are such an odd sight as you wave your arms while running and tumbling over the uneven ground that they just all stop to stare at you until you get close enough to pant out an explanation. As soon as they hear the word cave-in they send runners to get their supervisor and the Overseer. They both run into the tunnel to assess its position and immediately agree with you, if you had been 2 minutes later the workers finishing the tunnel would have been crushed to death.", "action_results": [{"action": "That evening you called in for dinner with the Owner and Overseer", "result": "You tidy yourself up as best you can before heading into the Owners stone house but you only own two sets of outfits, and both of them working leathers so theres only so much you can do. Your very relieved when the Overseer meets you to take you into the dining room in his normal working gear too.\n\n\nYour taken into a small but nice room lit by a log fire and see the owner and a pretty young girl sitting at the table with food being brought in from the kitchen. The girl looks about your age and is reading a book but she puts it away as you enter. The Owner waves you and the Overseer to some seats across the table from the two of them and introduces his daughter to you, Her name is Shia and you start trying to work out if she is indeed your age when the Owner asks you to explain about the tunnel.\n\n\nYou relay all the information as best you can with the Overseer occasionally adding information you didn't know or had missed. At the end the Owner thinks for a minute before starting to speak.\n\n\n\"I took a bit of a risk hiring you, but it seems to me now, that apart from doing an excellent job, you have just saved my mine from a cave-in and most importantly saved the lives of the two workers inside. Would you agree this is a fair assessment\"\n\n\nYou try to mumble something humble but he cuts you off and presses you for a yes/no answer.\n\n\n\"Then yes sir I'd agree with it.\" you finally reply\n\n\n\"Good, then from now on you are officially on my books as the assistant overseer and your contract has been upgraded to increase your pay in-line with your new position. There is also a job in my personal mining company for you as an overseer on future projects if you want it.\" you glance at the Overseer sitting beside you who just smiles. The owner continues \"yes it was his idea and I agreed wholeheartedly with it.\"\n\n\nYou thank him profusely before matters at the table turn to the food now being laced before you. You haven't eaten so well in years so concentrate mostly on the food before joining back into the dinner conversation. Your told that the Overseer is also a family friend so he joins the owner and his daughter for a meal once a week and that your now expected along too.\n\n\nStill dazed from all the good news you head back into the mine a very happy man.", "action_results": [{"action": "Completing the mine", "result": "You spend the rest of your time in the mine enjoying your new position and especially enjoying your time eating with the owners daughter once a week, she seems to also enjoy your company during the meals. You haven't made any moves yet to spend time alone with her but you think you'll have plenty of time to do that once the job is over if you join her fathers company. The rest of your time there passes without incident so as the final week approaches you feel a pretty good sense of achievement considering how well you did and your future prospects.\n\n\nAs you enter the final week you're called back into the Owners house and he say he has some options for you. You've gotten on well with him and he feels he can trust you so he is considering changing his plans and taking you back to the city a few days early. On the trip you would meet some other members of his company and some of his friends from other companies that work, not only in your city, but in neighboring cities and kingdoms too. He implies that there is a little more than he is letting on but he refuses to say anymore until you've made your choice.\n\n\nHe tells you that your other options are to stay out the week and head back with the other workers, he knows of two groups, one that is rushing back to the city on payday and the other is staying a few extra days then taking a leisurely route home. He wont judge you either way and the job with his company is always open to you, but if you don't come now you'll have to wait till the spring to contact him again as he is heading off to oversee another job of his soon.\n\n\n ", "action_results": [{"action": "Join him for the early trip back, it sounds interesting and a trip all the way back to the city in a carriage with his daughter sounds too good to pass up", "result": "Having agreed to travel back to the city with the Owner you have to get your affairs in order, you assign supervisors to your work groups and try to do a quick final check over some wood, but you've got your men working well enough to finish the job without you now. The Overseer will be taking over from you to make sure the completion and transition from construction to full production goes smoothly, he will even have use of the owners house whenever he isn't visiting the mine.\n\n\nHaving said your goodbyes you join the Owner and his daughter in their small carriage and set off back to the city. A second wagon with a few guards goes ahead of you to make sure you have no trouble with bandits as your also carrying one of the first silver shipments from the mine. The trip is significantly faster with horses pulling you at a brisk trot the whole way but it still takes a couple of days and that leaves plenty of time for talking with the owner and his daughter. To her about herself, and to him about this secret he wouldn't tell you before.\n\n\nYou find out that he has holdings and mines not just in the lands around the city in which you grew up but in many other places too. Your home city is really a small kingdom in itself, ruling many small villages around it and a stretch of coastline long enough for several small fishing villages and ports. There are many such city states and kingdoms in the surrounding lands and yours is just above average size for the area, however your city is large and old so your kingdom has a much higher population than many others.\n\n\nThe guilds of course know this and trade in the main cities of all the kingdoms but your king has never really spread the information widely- you of course knew of other places but they were always spoken of as far off  and hard to get too, not borders merely a couple of weeks away by horse from the city center.\n\n\nThe reason he told you all this was that recently there had been a lot of tension with your nearest neighbor Carn. You had heard rumors about it, that they had been causing minor trouble over trade and fishing, small regional things that you hadn't paid much mind to, but you were now told it wasn't as simple as that. His contacts in Carn and other cities had been providing very different reports than your own rulers, your city being much larger than Carn was the one causing the problems, making demands after signing treaties and encroaching on their land. He was convinced that your King didn't know what was really happening as he had always seemed like an honest man, but many of the kingdoms decisions, and most importantly, military decisions were taken by his advisors, who were not known for being honest men.\n\n\nYour given time to think over this as you finally see the city approach. As you draw near the first roadside farms your given another choice.\n\n\n\"Well now that you know the reality of the situation you need to decide. I know you might not believe me, you might even think I'm being treasonous in my allegations but that is why I'm offering you this chance. This farm is well under half a days walk from the City, you've had a good lunch not long ago and you have been paid very well for your work so if you want to you can leave here and walk back to the city with no strings attached. Or you can stay and we will head to the meeting.\"\n\n\n ", "action_results": [{"action": "You decide you really dont want to be mixed up with treason and he has already paid you your wages, enough for well over a years good living, you get out.", "result": "You tell him that your grateful for all that he has done but that he is right and a lot of what he says is dangerous so you'll be hopping out now. He looks like it wasn't what he had hoped for but he just tells you that its you choice and holds the door open for you. You have a last look at his daughter who looks a little sad but you hadn't really gotten to know her yet and with over a years good money you tell yourself that your sure to meet another pretty girl in the city.\n\n\nStill thinking about whether your lying to yourself concerning pretty girls in the city and if you made the right choice or not the door closes behind you and the owner calls goodbye.\n\n\nYou turn and wave and are just saying thank you again when you feel several punches in the back, looking down as your propelled forward you briefly have time to see at least three crossbow bolts sticking out from your chest before you land. You hear the owners daughter crying and the owner telling her that he had no choice, you could have betrayed them all and gotten thousands killed if you had talked. You think that you wish you had stayed in the carriage, you think that you wish you had talked to his daughter more.\n\n\nThings quickly turn black and your stop thinking anything at all.", "action_results": []}, {"action": "You've come this far and his daughter is smiling at you, you may as well carry on and see where this leads.", "result": "You tell him your choice and he just smiles back then says \"Well then lets go meet your new friends, I'll head up with the driver and leave you and my daughter to have the chat you've both been desperately wanting to have since you first saw each other. JUST a chat mind.\"\n\n\nYou immediately try to stammer out a response but he just laughs and climbs out and round to the drivers seat. You turn to his daughter to see she has turned an almost luminous shade of red and is desperately trying to look like she wasn't just mortified by her fathers candor.\n\n\nYou cant think of much to say so just go with \"He did that on purpose to make this awkward didn't he?\"\n\n\nShe seems to relax the tiniest bit as she replies that \"Its just his sense of humor but he means well.\"\n\n\nYou take the opening and run with it so that you're both having a good conversation as the carriage pulls into the city and heads right through the Iron district and into the stone district, the area of the wealthiest and most powerful members of the kings court and city. Your chat is interrupted as you pull up to a small mansion and the doors are opened but you both promise to have more soon and you all head inside.", "action_results": [{"action": "The 'Family'", "result": "You enter the mansion and are led into a large hall with several men and women lounging in chairs or drinking wine by small tables, they turn to greet you...\n\n\nSeeing that the Owner and his daughter have someone with them causes the talking to stop and everyone watches you for a while. The owner steps forward after giving them a minute to look you over.\n\n\n\"ladies and gentlemen this is Glor, he has proven to be a most resourceful and trustworthy man in one of my mining jobs and I feel that he would be a perfect addition to our little family. I'll be personally vouching for him\"\n\n\nThere are mixed reactions but a beautiful lady just a little older than yourself approaches and gives you a slightly too welcoming hug \"Welcome to the family Glor, I'm sure we'll get along VERY well indeed, once the music starts be sure to ask me for a dance\".\n\n\nAs she walks away you catch a glimpse of the owners daughter with bright red cheeks glaring daggers at her back. The owner sees your slight confusion and his daughters rage and just laughs. \"Right then neither of you are dressed for the occasion so you head off my dear and get ready and I'll see if I have anything to fit Glor.\"\n\n\nYou are lead through several rooms until you are in a bedroom with a butler standing waiting for you. \"Glor will be joining us for dinner, do you think you could make him presentable for the evening?\" The butler gives a quick nod and heads out of a side door, returning quickly with two dinner suits which he lays on the bed before circling you once. he takes one suit then heads out just leaving the one on the bed.\n\n\n\"Right then Glor my butler has an uncanny ability to size people up so that suit should fit you well, I'll be in the next room writing a few quick letters while you prepare\".", "action_results": [{"action": "Your a bit overwhelmed by the rapid turn of events but you dont have much choice now so you quickly wash and dress", "result": "Having gotten yourself to what you believe is a presentable state you knock on the owners door. He emerges and gives you a once over.\n\n\n\"Well its not bad at all for a first try!\" he smiles at you before fixing various parts of the suits that are hanging wrong and showing you how to put on cufflinks. \"Well you wont ever pass for some highborn sop who lives in a mansion but I rather think that it makes you a better man for it. Now follow me, I'm sure my daughter has had enough time to change as well.\"\n\n\nYour lead back to the large room where all tables and chairs have seemingly vanished and a small string quartet has started playing soft music, a few couples are already dancing near them on the open floor. The owner leads you to the side of the room to a small drinks bar.\n\n\n\"Ok its time I did my mingling and information gathering, the serious meeting shall begin in a few hours when most of the guests here are gone.\" He walks away towards a group of men smoking pipes before calling back \"The music is just warming up, make sure you dance with at least one girl while your here!\"\n\n\nYou're no master on the dance floor but you know the basics and as long as the songs are slow you're sure you could keep up. The music gets louder and more people move to the dance floor when you see two things happening. The Owners daughter enters the room looking beautiful in a flowing red dress and is immediately approached by several men asking her to dance, and the woman who approached you earlier detaches herself from the group she was in and slowly heads your way.", "action_results": [{"action": "The woman in blue is clearly coming on strong but the Owner's daughter is the one you want to dance with, head over towards her and hope she dosn't dance with someone else instead.", "result": "You start heading towards the Owner's daughter, you get close to the ring of men surrounding her and are unsure how you are going to approach this so you quickly glance back towards the woman in the blue dress. She has obviously seen you choose another girl over her flirtatious interest so gives you a stormy look before immediately slipping her arm through nearby man's who seems more than happy to take her for a dance. You look back just in time to see the Owner's daughter watching you with a huge smile on her face.\n\n\nShe makes quick apologies to the men around her and heads over to you, slides her arm in yours and leads you to the dance floor. \"Now if I wasn't very much mistaken I just saw a handsome but nearly penniless young man spurn the advances of the beautiful and extremely rich Lady Bridleworth, just so he could ask the daughter of a merchant to dance. What do you think about my surmise?\"\n\n\n\"I would never say your father was just a merchant...\" you start before seeing her cheeky smile and start again \"I'd say that the young man would be flattered to be called handsome by the most beautiful girl he has ever seen, and that he would pay every penny of Lady Bridleworth's fortune for a single dance with her. So clearly he made the right choice.\"\n\n\nShe laughs at your blatant flattery but you can tell she loves that you said it all the same and you begin dancing slowly to the music. \"I must admit I'm a little surprised, I thought I'd have to teach you how to dance, being a lowly mine worker and everything.\"\n\n\n\"Well my lady\" you give a slight mocking bow \"This worker has many surprises to him, I'm surprised in return though, you turned down offers from a large number of eligible gentry to dance with me, lowly as I am.\"\n\n\n\"Well if you are able to turn down the most eligible Lady of marrying age in the entire kingdom just to dance with me, why shouldn't I turn down the sons of some rich idiots to dance with the man I choose?\" Unable to think up a reply you simply laugh and keep dancing.\n\n\nThe rest of the night passes like a blur since you spend it entirely with her, dancing and talking and just enjoying every second in her company. Once the party starts ending she leads you over to her father and a group of men he is talking to and after giving you both a look over and a smile he leads you all through to a side room where a few people are starting to sit around a large table.", "action_results": [{"action": "The Truth", "result": "After everyone is seated the Owner addresses you \"Now Glor I have explained a little of why we are here during our trip down from the mines. This family I have gathered together is for the purpose of getting the truth out and showing the king that he is being tricked. We have tried getting evidence straight to him but the rest of the council has him surrounded day and night and I cannot do anything for fear of being caught and this entire group being put in danger.\"\n\n\n\"Which is why we are sending an expedition.\" one of the other men joins in. \"I am a commander in the 3rd company and will be sending some men along with a relief detachment to the border. they will be carrying proof of everything that has been happening over the past two years. We have had to wait this long as gathering the evidence without raising suspicion has not been easy but it is done now and we must hurry as we think the council are preparing for something big using two captured Carn ships. You will be drafted into the 3rd under my orders and send along as well, it'll become your job to help get the proof to Carn.\"\n\n\nYou think for a minute before answering. \"Why are we sending the proof to Carn, why not get it to our king?\"\n\n\n\"We tried, many times we tried, most of the men were killed and the rest searched and all the documents they had destroyed so they couldn't risk saying anything without proof, that would just lead to us all being killed before we could prove anything.\"\n\n\n\"so when does this expedition leave?\"\n\n\n\"It was going to be in over a month, but now that you are here, the man you know as the Owner of the mine you were in has planned to make them leave in 1 week. You wont be traveling with a relief squad but the papers I provide should see that you don't come under any suspicion.\"", "action_results": [{"action": "A New Morning", "result": "You spend the night in the large mansion and you wake thinking you haven't slept anywhere so comfortable before in your life. You find fresh cloths and a note inviting you to breakfast in the solar at the end of your bed so you quickly get ready and head out of your door.  You immediately realize that you are entirely lost and have no hope of finding the right room but are luckily saved by a butler who appears to materialize beside you arm.\n\n\nOnce you have been guided to the solar for breakfast you are left with the owner and a table laden with food. \"All from my own farms and holdings!\" he says happily \"Now dig in, we have a long day ahead and my daughter has 'informed' me that you are to meet her for a late lunch in the gardens. I normally would entirely ignore any order that came from my daughter but she has inherited a certain look from her mother that I know better than to argue with.\"\n\n\n\"Erm, of course that sounds lovely.\" you stammer, not really knowing what to say in the current situation.\n\n\n\"Hah! don't worry, I have no issue with the fact you both are going dopey eyed at each other since her choice in a man is hers to make, but I will give this warning, if you lead my daughter on then hurt her, I will destroy you entirely. Excellent, now that thats all been said on to business!\"\n\n\nYou're a little shocked by his change of pace but you both soon start chatting about the up coming plans and preparations. The next few days are spent much the same way, breakfast with the owner, planning time, then lunch with his daughter before more planning. The evenings however are spent at dinners, entertaining guests and holding meetings with other members of the 'family' from around the city.", "action_results": [{"action": "The Plan Begins", "result": "You have spent an amazing week in the mansion, you and the owner's daughter, Amelia (You almost laughed when you heard because of the dream you had back in the mining camp) are on first name terms and getting closer than ever. Your plans have been completed too. The 'family' of conspirators had been waiting as they didn't have anyone with enough training in construction to go with their team to the front that wouldn't arouse suspicion from the council, and that is where you were to come in. You would be their team leader with a sound understanding of construction, and since you hadn't been in the city for years, you were almost entirely unknown.\n\n\nThe plan was simple, The council were watching all the crossing points so you and three others would be sent to the borders with paperwork saying you are new recruits from the 3rd company, the army's builders. Then you would slip across the border and meet up with an intended contact a few miles to the other side.\n\n\nThe morning you were due to leave the Owner (Who's name you still haven't been told) arrives late to breakfast and hands you a small cloth bundle full of documents. \"These are the documents we need to get across the borders, each of you has a set and this morning we have included new information. One of the council members has managed to capture two of Carn's galleys and is now talking about some 'project spark' or something like that. We don't know what it is yet but we have included a letter in which he admits to taking the ships. You need to get these across the border before something big starts.\"", "action_results": [{"action": "Goodbyes", "result": "Having accepted your documents you finish eating quickly before heading back to your room to collect your things. The Owner has prepared you a set of nice traveling gear and also laid out some 3rd company clothing including a tunic and cloak. You've got a full set of Army issue armor in saddle bag on your horse but you'd rather not travel the whole way there in it so the tunic and cloak should be more than enough.\n\n\nYou head to the front of the house and find Amelia waiting for you. She looks relieved to see you \"I was worried I wouldn't be back in time to see you off! I've been down in the Stone quarter collecting an order I made a few days ago. Its something I had made for you, I want you to wear it under your tunic so you remember I'm thinking about you as you travel.\" You're unsure what to reply and your slightly worried she has gotten you a waistcoat or something you'd never normally wear but she has already turned bright red so you simply reply \"Of Course I will.\"\n\n\nShe hands you a small package which you unwrap to find a tunic made of unbelievably fine metal rings. \"This is incredible, I've never seen such fine mail before!\"\n\n\nClearly happy at your reaction she grins \"I had one of the best armorers in the city make it, its the finest steel so its very strong but the links are small so its light and can be worn under normal clothing. This way I can keep you safe while you travel!\"\n\n\nUnable to think of a proper way to thank her and distracted by her smiling face being so near yours you instead step forward and give her a small kiss. She is initially shocked and almost moves away but then returns the kiss for a second before stepping away her face a beacon of red. \"Well that was very forward of you Glor, now you have no choice but to return and beg my forgiveness afterwards!\" The she spins on her heels and runs off. You're almost worried you really did offend her until she reaches the door and gives you a big grin and a wave before heading inside.\n\n\nYou hop into the carriage that is waiting for you and quickly change into the gift then slip the 3rd company tunic over the top, and its almost impossible to tell your wearing any mail. The Owner joins you and the carriage heads off to the south gate of the city.", "action_results": [{"action": "A New Adventure", "result": "Once at the south gate you disembark and are given a last few words of encouragement by the owner before he is driven away, leaving you and your new horse alone at the gate. You are quickly joined by a group of three men similarly dressed to yourself and you all begin the ride out of the city on the road that will turn East towards Carn.\n\n\nThe first few days of the trip pass quickly, you see very few travelers on the roads and the border disputes with Carn aren't enough to have a large military presence on the roads so you only have to produce your papers once, when you come across a camp of soldiers from the First Company. You decide it would seems strange to ride on by them when it was nearing dusk so you all join them at their camp and spend a nice evening chatting over cooking fires.\n\n\nThe next morning you are all saddled up and preparing to leave the First Company soldiers who are traveling on foot when a call is raised of a fast rider approaching on the road. You feel a sense of unease and one of your company signals for you to be ready to ride hard if needed.\n\n\nAs the man approaches the small camp he slow momentarily to hand down a letter from his pouch \"The Old Quarter is burning, Carn has attacked us. I Need to get news to the borders quickly.\" You are panicked by the news since The Old Quarter is where you grew up and your remaining friends still live there. You catch his arm as he makes to leave.\n\n\n\"We are riding the same way, let us accompany you incase something happens on the road.\"\n\n\nThe man nods his thanks and your small group sets out at a fast pace from the camp. One of your men rides close by and whispers to you \"What are you doing getting us involved here?\"\n\n\n\"I need more information about what is going on, besides if they receive news of an attack before we get there we will look pretty suspicious but if we arrive as guards for the Councils own messenger they wont take a second glance at our reason for being there.\" The man still doesn't seem happy but falls back as you ride up to the messenger and ask if you can read one of the letters he is distributing since you didn't get a chance back at the camp. His orders are to give them to every military detachment he comes across on way to the border so he happily hands you one.\n\n\nYou ride in silence the rest of the day with only brief breaks for lunch and dinner and ride a couple of hours into the night. You finally pull up near a small stream to let the horses rest and make a temporary camp for the night. You take the opportunity to tell your companions what you learned from the letter.\n\n\nA couple of mornings ago two ships bearing Carn's colours had approached the docks in the Old quarter. One had pulled up and reversed course but the other sped up and rammed the docks, it seems it was on fire and filled with burning oils and other flammable substances. The first reports were all that had come in before the letter was sent but there was a fireball that tore through a huge area of the docks and started a fire that spread through the entire Quarter of the city within minutes. It had been dry for weeks and the Old quarter was made almost entirely of ancient timbers so you could imagine the fire tearing through it. The men around the fire swore and one finally spoke up. \"Its the ships that councilor captured, they burned down the old quarter themselves to start the war, I'll gut him myself for this!\"\n\n\nYou caution him to keep his voice down but luckily the messenger sees nothing amiss about the bits he hears of your men's reactions to the news, he joins you at your fire and you all share stories of the city, especially of the Old Quarter which you hope isn't as bad as the letter implies. As the messenger gets into his bedroll for the night the man supposedly in charge of the others speaks up.\n\n\n\"I was sent along to ensure we got the documents across the border no matter what happened, now this news changes many things but not our mission, if we can show it wasn't Carn that sent those ships we can prove the council did it and have our revenge. We have two choices, follow Glor's plan of arriving there as the messengers guards then try to slip across after nightfall, or we dispose of him to make sure we arrive before the news does so we can get across the border before they go into a lockdown.\"", "action_results": [{"action": "You want no part of killing an innocent man so you vote for staying as his guards and risk the harder crossing.", "result": "You continue your hard ride with the messenger and after a couple more days all arrive just as the horses seem likely to give way. You are unsure what to expect but as soon as you reach the gates and the messenger shows his papers your all admitted straight away. Being with him seems to give you some official status is the guards eyes as you are all not even checked as he passes checkpoints and reaches the commanders office.\n\n\nYou are all left in a waiting area as he goes in, he takes your identification papers with him. After a few minutes the commander emerges with the messenger. \"It seems you three haven't even entered full service yet but volunteered for a dangerous ride to escort our messenger safely here. he has spoken well of you and your intentions so you are all very welcome in my fort, even if its almost a week early! Now down to business. The fort is going into partial lockdown until the news is spread and the patrols have been updated, you'll be shown to your new bunks and be given a tour, since your duties don't start for days you'll be free to come and go around the fort to learn your way. My aide will give you new papers to this effect.\"\n\n\nThe new papers give you all the run of the forts interior and the messenger thanks you all before riding off again to deliver the letters down the line to the other forts. \"It seems this was the right idea after all, these papers should make it easy to slip across the border.\"\n\n\n\"We shall see.\" one of the men replies", "action_results": [{"action": "Night Falls", "result": "As night falls over the fort you have visited and gotten your faces and papers known by many of the guards under the pretense of exploring. You all finish a late dinner in the mess hall then head back to your bunks where you have prepared your gear and hidden the documents. You quickly prepare, check Amelia's gift is in good working order and all head out.\n\n\nGetting around the fort is easy for you now thanks to the leg work earlier in the day and any guards that don't recognize you let you pass after seeing your papers. You all make it to the gate without incident, however once you reach it you realize that the initial panic from receiving the news is still in full swing. You quickly think that you could slip out behind a squad going on patrol since the gate is in chaos but you are only in army issue tunics rather than full armor.\n\n\n ", "action_results": [{"action": "Tag along with a squad and try to stick close so you arn't noticed when they exit.", "result": "You all move close behind a squad heading out of the gate and move into formation as if you are with them. Its all going surprisingly well until one guard remarks that is stupid for them to have men without full armor with them. They all quickly turn and point out that you are not in fact with them, and they have no idea WHO you are.\n\n\nYou are about to quickly try and make an excuse when one of you men tries to run for it. Sadly with so many soldiers about he is almost instantly cut down and the rest charge at you. With so many men cutting and stabbing you at once even your special mail doesn't stand a chance.", "action_results": []}, {"action": "Pretend to be a repair squad, you are in the third company afterall and that is one of their jobs.", "result": "You realize that four men in army tunics would never get away with joining a fully armored patrol so approach the guard your selves, he seems harassed and overworked so you try to use it to your advantage. \"Repair squad from the third.\" you announce as you hand over all of your papers at once. The man gives you all a quick glance, then obviously trying to work as quickly as possible gives the top sheet a quick glance. He sees that it has the fort commanders own signature and 3rd Company across the front so he doesn't read further and just waves you through. \"Don't take too long out there, lockdown starts fully in a few hours!\".\n\n\nHaving a guard shout you through in such a loud manner makes the rest less inclined to bother checking your paperwork so you get through the gateway without incident.\n\n\nYour all thinking that this is going rather well so pick up the pace and head towards the border lines.", "action_results": [{"action": "The Perimeter", "result": "You reach where you think the border should be and almost shout for joy when one of your men holds up his hand and indicates to the side. You stop to listen and hear an approaching patrol. Its only a small one by the sound of it which means six men but they will still attack you on sight if they need too. You all quickly look for a place to hide but its too late and they come into view through some trees.\n\n\nThey immediately draw weapons and ask for identification. You decide to go with the same bluff as before so try to act clam and keep your hands away from your sword. You pull out your papers and hand them over. \"We are third company, they sent us out here to do some repairs before the lockdown began.\"\n\n\nThe other soldiers seems to relax their weapons a bit at your attitude and willingness to hand over your papers. You see some confusion growing on the face of the man reading the papers and realize that he knows your papers don't allow you to leave the fort. He is about to speak when your men act first, drawing hidden knives and taking down two of the parole before they can react.\n\n\nFrom there it turns into a bloodbath, it seems the men sent with you are very skilled fighters, but they aren't wearing armor and the patrol is. You are almost killed by a sword swing but the man pauses in surprise as his blade bounces off the hidden mail coat. You whisper a quick thank you to Amelia for her gift and saving your life as you use the flat of your blade to knock the man unconscious.\n\n\nYou look up to realize its over, two of your company is dead and the other survivor slightly wounded, three of the patrol are dead and the others wounded or unconscious. Saddened that they had to die you pause but the other man drags you away \"It wasn't our choice and it had to be done, now move or the rest will catch us!\" You listen and indeed hear the sounds of other men moving in your direction so you both run across the border and into Carn's territory.", "action_results": [{"action": "Carn", "result": "You are still a long journey away from Carn but the other man takes charge and leads you at a run for several miles. You both run until you finally collapse against a large rock outcrop. You help him bind up his wounds but he has lost a lot of blood and the run hasn't helped, he quickly explains that a cart will arrive here soon and that it will take you to Carn.\n\n\nYou let him drift off to sleep and keep watch until dawn when you see a small farmers cart coming near. You give the signal and it turns to come pick you up. You jog back over to the other man but realize he passes away from blood loss during the night. Your the last one left so you take the man's documents along with your own and get in the cart. The driver passes back some non-descript clothing and you quickly get out of your military tunic.\n\n\nThe trip from there involves a change of carts every few days and finally a carriage for the last few days to enable you to go faster. Eventually you reach Carn and are escorted to the King.", "action_results": [{"action": "The King", "result": "THIS IS THE  BEST ENDING, THE SPIES ENDING.\n\n\n CONGRATULATIONS!\n\n\nOnce in Carn you are taken before the king and you make your report after presenting the documents. King Hader immediately sends them to his scribes who make several copies and over the next few days they are smuggled out of Carn to all near-by kingdoms. King Hader also sends several emissaries to your City and is finally granted a cease-fire almost before the war even begins when one of your kings high council personally intervenes and tells the king that the council had been blocking Carn's requests and emissaries from reaching him. The Councilor was in fact your proprietor, the Owner, and he was able to tell the king some of the truth of the situation.\n\n\nOnce the king knows he was being lied to he immediately took control of the military and ordered an end to all hostile actions. He confined the council to chambers under guard until he had found out the truth. And once the truth came out the entire council bar one was hung from the city gates. Peace was made between the two kingdoms.\n\n\nKing Hader of Carn finally sent you back to your home city once the situation was fully resolved, he even bestowed some land and a house on the shore upon you as a reward. You are unsure what to expect from your own king upon your return but he is as welcoming as Hader had been. Once he learns that you had been given land on the coast beside the border he immediately gave you an equal plot on his side of the border meaning you now had a large holding of forest, farm and coastline in your name that spanned the borders of the two kingdoms. The man you knew as the owner is explained to have been Councilor Fenshield, one of the newest councilors in the city but due to his mines, one of the richest. He greets you warmly and invites you to his house again to recover, which you quickly accept.\n\n\nThere Amelia is waiting for you, she immediately rushes to you and gives you a kiss while saying how she always knew you would be successful, once you explain how her gift saved your life she almost cries before just hugging you for a few minutes.\n\n\nIts not many days before you are engaged and only weeks before you and Amelia are married. The wedding is held on your new lands which could only be described as substantial and the house upon them is more of an old castle than just a house. Councilor Fenshield brought many of his scribes and accountants with him and by the time the wedding happens your land is already turning over a profit from the farmers and fishermen on it.\n\n\nI'd say you lived happily ever after at this point, but that isn't always the case is it? lets just say you did have a few happy years, but after that what happens is up to you to choose.", "action_results": []}]}]}]}]}]}, {"action": "You can't risk arriving at a fort and being trapped there as the war starts, you think the messenger has to be killed for your mission to be sucessful.", "result": "Having decided by a vote to dispose of the messenger for the sake of the mission you all head to your bed-rolls and pretend to sleep. You wait until you hear the signal from one of the men and rise to find that the messenger already has his throat slit. You help them carry the body away from the road and hide it in some bushes, it isn't the best disposal ever but it only needs to last a day so you can get safely ahead.\n\n\nYou clear up any evidence you can see then all mount up and start riding towards Carn. What you did weighs on your conscience but you think that it was the only way so you push ahead.\n\n\nThe next few days are just made up of riding and very short breaks for eating and sleeping. You make it close to the border in great time and camp within half a days ride from the border forts so you can all rest and look presentable when you arrive. You fall asleep hoping that you have arrived ahead of the news and that you can get across safely. Yu think briefly of Amelia and what she may think of your choices so far but decide that she would also do everything it takes to stop the war. Pacified by that thought you fall asleep.", "action_results": [{"action": "The Border Forts", "result": "You all make sure your uniforms are clean and papers in order before you approach the fort, You expect to find some paroles but are amazed at the sheer amount of them and all the activity that is taking place. You have your papers checked five times before you even reach the gate where You finally get to ask what is going on as your let into the fort.\n\n\nThe guard explains that a messenger arrived the evening before from the coastal road, he had ridden from the city almost non-stop for days, swapping horses whenever he could. He had brought news that The Old Quarter had been attack and was burning and war was about to start. You all look stunned by what he said and he takes it to be shock at the news rather than the fact you had killed a messenger but were still beaten here. He lets you on through and your taken immediately to a small barracks where your given bunks and told that sadly the forts going into lockdown until everything settles down but that your welcome in all the normal areas like the mess hall.\n\n\nYou all settle in \"So it was for nothing then?\" you ask aloud.\n\n\n\"We had to do it, there was no way to know another messenger could beat us here by taking the coast road. Its all those bloody port outposts allowing him to change horses while we had to spare ours.\" one of the men replies.\n\n\n\"Either way we need a new plan, I'm the only one who really knows about construction so we cant hang around to be tested, what do we do from here?\"\n\n\nThe men think for a bit and come up with several ideas but it is whittled down to two options.", "action_results": [{"action": "Make a run for it that night while there is still confusion about who should be where.", "result": "Having made your choice you all get your gear prepared and ensure the documents are well hidden. You made sure your gift from Amelia is in good order then you all wait. Night falls slowly and there is still a lot of people moving about when you leave the barracks. The food hall is nearer the border gate than your current position so you head there as cover first. You all grab some stew from a pot and taking some bread start to stroll around the fort as you eat. You pass several men fresh off duty doing the same thing so you don't raise many eyebrows. Once you near the gate you see that the small one man door in it only has a single guard.\n\n\nOne of your men approaches him quietly then faster than the guard can react, he strikes him across the chin with the handle of his dagger. The guard falls unconscious and you all slip through the gate quickly, closing it behind you.\n\n\nYou know the wall patrols wont take long to find the unconscious guard so you all start jogging as quietly as you can towards the border lines. You think you have made it when you hear the bells of the fort going off. \"Thats it RUN!\" you shout as you hear noise of men ahead of you. Your warning came too late and you all run right into a patrol squad as they turn to face you. You all draw weapons and attack.\n\n\nYou feel several glancing sword blows hit you but Amelia's gift saves you from taking any major wounds until you and the only other survivor seem to break out the other side of the squad.\n\n\nYour about to run when you feel a blow to your leg and you stumble. Looking down you see a large gash across your calf and realize you can barely walk never mind run. You wave the other man on and turn to face the soldiers. At least one of you will get through with the documents you think as a spear stabs through your side. You think of Amelia as you collapse.", "action_results": [{"action": "Ending?", "result": "Sadly even if the other man makes it and stops the war you are still dead, no good ending for you.", "action_results": []}]}, {"action": "Wait for a few days untill the panic is over then slip across.", "result": "You decide that security is too tight to make a go of it now so you all settle in to pretending to be good members of the Third Company. The others help out in small manual jobs that don't require skill and you offer services in some of the more complicated work. After three days of the light volunteer work you seem to be trusted by the men there and the initial panic seems to have settled down into a steady routine so you think it might be time to make your move. Messengers and runners keep arriving but you all pay them little heed now as you are concentrating on finding the best crossing point near the fort.\n\n\nUnfortunately one of the runners came on the main south road just like you and reports about the finding the body of the messenger you killed. Its put down to spies from Carn trying to prevent news getting to the borders so the fort immediately goes on high alert. If you had known it was your own choice in killing him that lead to the lockdown being started again you might have even found it a little funny.\n\n\nSadly you didn't know any of this and only knew that the bells went off and everyone had to report to their bunks. No-one is told what is going on but the next morning you all see a small group of men with an unusual insignia arriving at the fort and heading straight into the commanders office. One of your companions informs you that these are from the 'intelligence' section and are very bad news. You cant risk them getting anywhere near you.", "action_results": [{"action": "You cant risk them finding you, run for it, NOW!", "result": "You nod to the men, \"Right then we have to get out of here, take only what you can carry easily and pretend we are on patrol, as soon as we get near the lines we get across and run for it.\"\n\n\nYou all get into your Army tunics and strap on weapons then head out towards the wall, your stopped a few times but explaining you have been drafted in for wall patrol because of the lockdown gets you through the fort and to the gates. You find you're in luck today as you know the man on gate duty, he is someone you have been working with so you greet him and take the time for a quick chat before asking to be let through so you can start your patrol.\n\n\nHe pauses for a minute but your chat has put him off guard and he lets you through. You all start walking quickly towards the border line where the patrols are thinnest. Your beginning to think you pulled it off but suddenly hear a bell going off behind you and shouting starting up.\n\n\n\"Run!\" you shout and you all start sprinting for the border. Arrows start falling from the walls behind you and one of the men with you falls with a bolt sticking out of his side. he waves you on and your forced to leave him behind. You feel something hitting you in the shoulder and realize Amelia's chain just saved you. You whisper a quick thanks to her as you run.\n\n\nThe arrows stop and you realize your out of range now. You really think your going to make it before you see a full squad forming up in front of you with pikes pointed in your direction. You are left with no choice but to charge them and hope you break through. You're mail saves you a couple more times and you cut down two men in front of you before a third gets a clean hit on you and runs his pike through your gut. You only think that you'll never see Amelia again before you die.", "action_results": []}, {"action": "They shouldnt have any idea about you and you have good paperwork, wait untill they leave.", "result": "Waiting till night seems like a better idea so you all prepare your gear and make sure the documents are well hidden then wait. Sadly it is not long before two guards arrive and ask you to accompany them to the commanders office.\n\n\nYou find the commander and the men from the intelligence squad waiting for you. They take your papers and look through them before speaking.\n\n\n\"Now gentlemen we have been tasked with finding some spies from Carn who have killed one of our messengers on the road to this fort. Your paperwork is all in order but it appears you all joined the third company very recently and most importantly you were all seen accompanying the messenger on his way here. Then arrived alone. Can you explain this at all?\n\n\nOne of your men speaks up \"We rode with him for two days but he needed to make haste so he went on ahead of us, we just assumed he had arrived already.\"\n\n\nThe man looks at you all for a short time before smiling \"Well we shall soon see the truth of that.\"\n\n\nYou are all grabbed from behind and lead down stairways until you are all in a large basement,  some dividing screens are set up and tables with straps brought in. Realizing what is about to happen one of the men tries to run but is immediately run through by a guard. The Intelligence man tuts then says \"hmm a waste of information there, ah well three is more than enough, lets begin.\"\n\n\nYou are all strapped down and have some fluid poured down your throats before the screens are moved in to block you from seeing each other. You feel it taking affect and your muscles relax and refuse to respond, you become entirely paralyzed and unable to speak. The man comes to you first \"Don't worry it will wear off after a few hours, and by then you'll be ready to talk.\"\n\n\nHe is true to his word and tortures you solidly for three hours  before you begin to be able to scream, he waits for you to stop before questioning you further. Once satisfied he turns to the guards. \"I'll start on the others after a nice lunch, finish this one off and dump his body at the front, claim it was soldiers from Carn torturing him for information.\"\n\n\nYou don't even have time to object before the guards run their spears through your chest.", "action_results": []}]}]}]}]}]}]}]}]}]}, {"action": "The lady from before is beautiful, in a low cut blue dress and is clearly flirting with you in a way the Owner's daughter never did, meet her on the dancefloor.", "result": "You see that the daughter is still surrounded by men talking to her so you head onto the dance floor and meet the lady in blue half way. \"Have you come to ask me to dance?\" she asks coyly\n\n\n\"Of course my lady\" you reply before taking her hand and beginning to dance.\n\n\nThe next hour or so passes rather quickly as the Lady dances much closer to you that you know is appropriate and keeps you to herself for the whole time the music is going. You do see the owners daughter dancing with a few men but she doesn't seem too happy. You consider asking her for a dance too but she has entirely ignored you since the dancing started and your current partner isn't sharing you.\n\n\nOnce the music and dancing has ended the Lady extracts herself from your arms with a little pout. \"Sadly Glor this is where you have to go to a meeting and I have to head home, but I do promise I'll be seeing ALOT more of you soon.\"\n\n\nLeft with the strong suspicion she would be taking you home with her if she could you head over to where you see the owner and his daughter talking to a small group.\n\n\n\"Ah Glor just in time, we are all going to adjourn to a smaller room for some drinks and our little meeting.\" turning to his daughter he asks if she would like to join them but she says no and walks away without looking at you. The owner gives you and her a quick glance before muttering \"Ah well.\" and leads you into the meeting room.", "action_results": [{"action": "The Truth", "result": "After everyone is seated the Owner addresses you \"Now Glor I have explained a little of why we are here during our trip down from the mines. This family I have gathered together is for the purpose of getting the truth out and showing the king that he is being tricked. We have tried getting evidence straight to him but the rest of the council has him surrounded day and night and I cannot do anything for fear of being caught and this entire group being put in danger.\"\n\n\n\"Which is why we are sending an expedition.\" one of the other men joins in. \"I am a commander in the 3rd company and will be sending some men along with a relief detachment to the border. they will be carrying proof of everything that has been happening over the past two years. We have had to wait this long as gathering the evidence without raising suspicion has not been easy but it is done now and we must hurry as we think the council are preparing for something big using two captured Carn ships. You will be drafted into the 3rd under my orders and send along as well, it'll become your job to help get the proof to Carn.\"\n\n\nYou think for a minute before answering. \"Why are we sending the proof to Carn, why not get it to our king?\"\n\n\n\"We tried, many times we tried, most of the men were killed and the rest searched and all the documents they had destroyed so they couldn't risk saying anything without proof, that would just lead to us all being killed before we could prove anything.\"\n\n\n\"so when does this expedition leave?\"\n\n\n\"It was going to be in over a month, but now that your here, the man you know as the Owner of the mine your were in has planned to make them leave in 1 week. Your group will be riding alone instead of with a relief detachment but the papers we provide you should get you there just fine.\"", "action_results": [{"action": "A New Morning", "result": "You spend the night in the large mansion and you wake thinking you don't think you slept anywhere so comfortable before in your life. You find fresh cloths and a note inviting you to breakfast in the solar at the end of your bed so you quickly get ready and head out of your door.  You immediately realize that you are entirely lost and have no hope of finding the right room but are luckily saved by a butler who appears to materialize beside you arm.\n\n\nOnce you have been guided to the solar for breakfast you are left with the owner and a table laden with food. \"All from my own farms and holdings!\" he says happily \"Now dig in, we have a long day ahead and you have received this invitation, so you may have a busy evening too I'd imagine.\" You inquire about his daughter but he says she broke her fast earlier.\n\n\nYou start on the food as you read the impeccably written invitation to dinner at Lady Bridleworth's manner house. Before you can even ask the owner tells you that its the lady you danced with the night before. Well you've never been invited to a dinner in a manner house before and she did seem very interested in you. You ask him if he could accept on your behalf and he gives a little nod to one of the footmen nearby who heads off with the invitation in hand.\n\n\nThe rest of the day is spent around the house and its grounds, speaking about the mission and plans for the next few days but you are mostly thinking about the invitation you received, luckily the owner is lending you a suit for the occasion so at least you will look presentable.", "action_results": [{"action": "The Dinner Meeting", "result": "As evening fell you are sent from the Owners mansion in a small carriage. It only takes a few minutes to reach the destination, which is a house almost the same size as the owners. You are dropped off and head up to the gate a little unsure of the protocol but the gate keeper greets you first. \"Master Glor, my Lady has been expecting you, if you head to the main doors the butler will show you in.\"\n\n\nClearly someone has done some research on you if even their doorman knows you by sight but you think that this is what it must be like when living in high society so head on in.\n\n\nYou are met by the butler who ushers you into the house and through a small maze of joining rooms. You are finally led into a room with a single round table in the centre and several chairs around it, only one is occupied and the lady is wearing  an even more low-cut dress than the night before. She rises as you enter and you are about to greet her when she raises a hand to cut you off.\n\n\n\"Sadly Glor I had many VERY enjoyable plans for you tonight, and having dinner was the least of them, but we heard this morning that that despicable little man had moved his plans forward to only a week away because of you.\" You are very confused by this but she continues. \"You see, he is a member of the kings counsel, but unlike the rest he is trying to foil the plans to start a war. One which we have been preparing for years, we would decimate Carn and double our territory in a matter of weeks. Sadly I am currently not on the council even though the king knows my family and myself so I have had to take steps to correct this. I help remove the meddling pest and I claim his seat, a fair deal no?\"\n\n\n\"Wait.. But...\" you stammer out\n\n\n\"Oh I know sweetie and I AM sorry\" She looks you over like a hungry man looks at a steak \"We really could have had so much fun. But part of the deal was I hand you over to these gentlemen from the councils intelligence section so I must give you up.\"\n\n\nYou feel your arms grabbed by men either side of you and are dragged through a sliding panel in the wall and down into a deep basement. You try and struggle, even as they strap you to the table. Sadly there are more of them than you and once they start injecting you the pain overwhelms everything.\n\n\nDuring your torture you tell them everything, you even try to make things up to please them but they always know you are doing it and they make the pain worse so eventually they know everything you do. Once they are finished they untie you and let you stand. They have done relatively little damage to your body, it was mostly your mind that suffered. You head for the door but are blocked by a large man \"Sorry but I'm afraid you were found here under a collapsed ceiling after heading to fetch some wine for the lady.\" he gently pushes you back into the room then shuts and locks the door. You watch helpless as the closing door knocks one of the beams away above you and the roof caves in on your head.", "action_results": []}]}]}]}]}]}]}]}, null, null]}]}]}]}]}]}]}, {"action": "Push on North and look for a more promising turn off", "result": "You decide that the trial is too small and too close to your previous mine to be the new mine turn off so you continue North at a reasonable pace.\n\n\nThrough the day you pass a couple of even smaller trails but you decide they could be nothing but animal trails as they often pass under bushes and shrubs so you continue till nightfall. You can out into the trees again and have the last of your cooked hare meat. You fall asleep reasoning that if the mine is still ahead that you should pass it tomorrow.\n\n\nMorning arrives and you set off North again but as noon comes and goes and you start to pass into the evening you still see nothing. You start to feel like maybe you made the wrong choice but you push on till night fall and make camp again.\n\n\nIn the morning light you take stock, you decide that you can head back and try the original trail, as long as your careful if you see the men approaching you on the road you can always double back North again. Or you can continue on and hope its still ahead of you.", "action_results": [{"action": "Head back for the side trail", "result": "Your turn back south and walk fast, always keeping an eye on the horizon for any signs of the men you passed but your see none. You push on at a reasonable pace till your forced to camp, in the morning you continue south keeping an eye out for the trail.\n\n\nYou come across it by the evening but now you see a large beaten down trail and the marks of a lot of people passing very recently.\n\n\nNot only had the small group sent ahead got there first but since you had lost nearly 4 days going North then back the main group had also gotten their first by a few hours.\n\n\nYou Sigh and head down the trail yourself knowing that you missed out on the chance of the good jobs.", "action_results": [null]}, {"action": "Carry on North", "result": "You decide there isn't any point in going back so soon and head off North as a fast pace again, most of the day passes without signs of a trail.  As evening falls you see clear signs of damaged undergrowth and a clear path off into the hills. It must be the mine!\n\n\nGlad you carried on North you strike off the road into the trail and head into the foothills loosing sight of the road behind you. You walk for an hour or two carefully following the trail further in when you see a man leaning against some trees beside the trail. He gives a small nod in your direction so you approach and ask if this is the entrance to the new mine.\n\n\n\"New mine? Now where did you hear that?\"\n\n\nYou explain about your work on a mine further south and that you had heard rumors from your old Forman about a new mine opening in this area.\n\n\nHe looks at you thoughtfully for a minute then says \"Alright if your fresh from another mine job keep going on this track for a bit till you see a big man with a woodman's axe, his names Pug, tell him Clay sent you, He'll tell you whats going on and get you sorted out.\"\n\n\nThanking Clay you set off again down the trail", "action_results": [{"action": "Pug", "result": "You walk for about half an hour until you see a huge man chopping some wood and stacking it into a cart, he pauses and leans on his axe while you approach.\n\n\n\"Are you pug?\"\n\n\n\"That would be me, now who would be doing the asking all the way out here?\"\n\n\n\"Clay told me to come speak to you, I'm a miner looking for work. He said you'd be the one to get me sorted out and explain the work here\"\n\n\nThe big man laughed and said \"right you are then, I'll be happy to explain it to ya\". He waved the axe indicating the hill just behind him \"Just over that rise is our camp, and even though I'm in charge I'm the only one that can ever be bothered to chop the wood for the fires, well I also enjoy it which is part of the reason I'm always the one here doing it but anyway you didn't come here for me to tell you about chopping wood. Were a small band here at the moment which makes it easier but sadly for you I wouldn't say were a mining camp\"\n\n\n\"Not a mining camp?\" your not sure how to take the news that they aren't a mining camp but Pug seems nice enough and you'd be happy enough to do logging or hunting work too \"So what work are you doing out here then?\"\n\n\nPug gives you a grin \"Ah that would be banditry mostly, some robbery, looting and such like.\"\n\n\nYour trying to think up a reply to his statement when you feel the wind being knocked out of you, looking down you see a steel arrow head pointing out of your chest. You fall backwards away from the grinning Pug to see Clay and a couple of others holding loading crossbows walking towards your head.\n\n\n\"Always nice when they come to you isn't it! This one said he just came off a job so should even have some good coin on him\"\n\n\nYou try to say something but can only gurgle a little before darkness closes your eyes", "action_results": []}]}]}]}]}, {"action": "Approach the foreman for a job", "result": "You sling your hare through a belt loop and walk out of the trees towards the foreman's fire. He watches you approach with obvious interest, glancing at the hare tied to your belt. You hail him and ask if you might make use of his fire to cook your hare, you would of course be willing to trade some for a mug of the ale the man was drinking if he was interested.\n\n\nThe man laughs and agrees, you finish preparing the hare and start cooking it. Once its starts the cook through you sit down beside the foreman to see about getting a job.", "action_results": [{"action": "The new foreman", "result": "\"Where are they off to so late at night?\" you ask indicating the group vanishing into the night up the road as he trades you a full mug of ale for a chunk of meat off the fire\n\n\n\"They're the mine guards that marched up from the city with us, I sent them on ahead to give the news that we are almost there and to make the camp safe and ready for when we arrive\".\n\n\nYou carefully start inquiring about jobs at the mine but he sadly informs you that they have all the trained hands that they need with them already but that you'd be welcome as unskilled labor, the pay would be much lower but that's all he could offer.\n\n\nYou realize with the guards sent ahead already that you wont be able to reach the camp before them so your left with the choice of joining them for much lower pay or heading back south to the city after all.", "action_results": [null, null]}]}]}, {"action": "Might be a traverler along the road, camp beside it", "result": "You decide it would be best to just set up camp beside the road and see if any other travelers come along during the night. You go a few feet east of the road to a nice looking oak tree and start setting up a camp for yourself as theres still some time till night sets. You Set a few snares further into the trees and build a nice fire for yourself then settle down for a while. \n\n\nJust as darkness arrives you hear some noise in the trees, one of your snares has caught a hare! Gathering in the other snares you quickly skin and prepare the hare then set it cooking on the fire- its worth staying up an hour or two for some good hot food. \n\n\nThe hare eventually starts to cook nicely and you've just pulled its leg off to start eating when you hear some noise coming up the road. You keep eating as you watch a large group coming towards you. They slow as they reach the fire and the one in the lead walks over to you.\n\n\n\"Hail stranger, mind if we set up camp with you for the night? I could even trade some ale for a little of that hare if your interested?\"\n\n\nYou haven't had ale in a week or two now so you readily agree and watch the group start to build a couple more fires and set out their sleeping rolls. The man who had talked to you first sends a few of the group off North up the road then joins you by the fire with a small ale keg under one arm.", "action_results": [null]}]}, null]}, {"action": "Put off speaking to your boss and go back in for a last look around", "result": "Your boss will be busy shouting orders at people anyway so talking to him can wait.\n\n\nYou turn back inside and have a good look around for anything you might have missed. You rummage under the bed and behind the desk, you even check the pot over the fire for any scraps.\n\n\nBut all you find is an old, completely rotted apple under the bed which smells so bad you chuck it into the coal embers as soon as you pick it up.\n\n\nSighing, you admit that your already carrying everything you own and head out the door to speak to the foreman of the camp.\n\n\n ", "action_results": [null]}]}