{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=51934", "context": "", "first_story_block": "Smoke from the burning city filled the air. Some detest the smell of smoke, others complain that it burns their eyes and throat. For Philip the Second of Macedon, however, smoke only meant one thing. \n\n\nVictory.\n\n\nHis eyes stay focused on the city of Potidea. Shouting, screams, and the sound of crackling fire reached Philip's ears, but he did not seem to be affected by it in the slightest. The man was the perfect picture of poise and power. He would never look away from the battle when started, for even the slightest moment. If he faltered for even a moment, then all of his plans could come crashing down. No, he would wait patiently for his field general to come back proclaiming victory in his and Macedon's name. Until then, he would wait here surrounded by his most trusted generals and guards. Philip only ever felt more home in one place. That being his fourth wife, Olympias', bed. He would often switch between the two things. His current battle, and his wife at home, whom, to Philip's delight, was pregnant. A son is what he hoped for, and one sired by him and Olympias was sure to be a boy of the strongest blood. She was getting fairly large at around the time Philip left for his current campaign, and while waiting for victory to be announced, Philip realized something. \n\n\n\"Polypias.\" Philip called out to his general, but still kept his eyes peeled to scene of chaos and destruction before him. \n\n\n\"My Liege.\"\n\n\n\"How long have we spent sieging this godforsaken place?'\n\n\n\"Around three months, my liege.\" \n\n\n\"I thought so. Prep-\" Before he can finish giving his command, a cheer goes up from the burning city. \n\n\nPhilip hears him before he sees him. \"Victory to Philip! Victory to Macedon!\" The man you've been waiting for, the field general, gallops out of the burning city with the city's flag on a chestnut war horse. In his right hand is a spear, and on that spear is the banner of Potidea. The field general, Philip can never seem to remember his name, decided that it'd be a great idea to set that same banner ablaze. Philip reminds himself to give the man a promotion. \n\n\nThe question Philip was going to ask Polypias is forgotten in the addictive wake of total victory. \n\n\n-\n\n\nThe sheets of Olympias' sheets are soaked. Maids run in and out of the room frantically. Some carry sheets, while other's carry buckets of water, but among the throng of the people surrounding Olympias, one stands out more than the others. A young maiden stands with a bow and a quiver of arrows over her shoulder. Her face is a mix of approval and joy, and her very presence radiates silvery light and power. \n\n\nPhilip gazes around the room in awe. None of the maidservants seem to notice him, and in fact, Philip notices, ignore him entirely. Perplexed that his servants would disrespect their king so easily, Philip reaches out to rebuke the closest servant for their flippancy, but his hand goes right through her. He tries again with nearly all of the servants, save the maiden, yet none of them respond to his attempts in the slightest. Still confused, Philip walks to the opposite side of the bed from the young maiden and approaches Olympias. Surely his wife will remember him. \n\n\n\"Olympias,\" he says, then tries to touch her shoulder. His hand passes through, and he cries out in frustration. \n\n\nOlympias cries out as well, simultaneously startling Philip and knocking him to his senses. Philip re-examines the room, and after a few seconds of thought, realizes that his wife is giving birth. Instead of being frustrated at his predicament, Philip watches and waits.\n\n\nA maid, apparently the one in charge of the lot of them, shouts, \"It's happening!\" Maids move around nearly in unison and in preparation of what's to come. The head maid positions her hands below Olympias' midriff and starts moving her hands amid a mix of blood and skin. Philip looks on excitedly. If this is a vision like he thinks it is, then he really is seeing his son being born. \n\n\nSome moments later, the head maid withdraws her hands from Olympias holding a baby that looks as if it had been bathed in blood. A beautiful sound echoes throughout the room, and as much as he's glad to see his baby born, Philip can't help but feel a sense of foreboding. That sense intensifies when a new sound joins the glorious cries of the baby. This one not nearly so pleasant. \n\n\nOlympias' screams overpower the baby's cries. It spurs all of the maids back into action, for at the splendor of the baby, they forgot their first priority, keeping Olympias alive. \n\n\n\"No, no, no...\" Philip starts muttering incoherently as he realizes what's about to happen. \n\n\nThe maid's are fast and efficient, but no where near as fast and efficient as Philip wants them to be. Every scream of Olympias he hears marks another maid's face he memorizes. If she dies in the care of these people, then there will be eternal suffering for them to pay when he returns. Olympias' breaths turn from heavy, to shallow, then ending at virtually non-existent. Some of the maids start crying, but the head maid keeps working until she feels the last breath go out of her. Only then does she start crying as well. The baby lays in the arm of another nameless maid at the foot of the bed. \n\n\nPhilip's heart skips a beat, and it's all he can do to stop himself from crying as well. Of all the wives he'd ever taken, Olympias was the only one he could say that he truly loved. And now she was dead before his eyes. The reality of the situation hits Philip harder than it should, and despite his best efforts, Philip breaks down into tears. \n\n\n\"Please. Zeus, Hera. If there be any Gods out there, Please don't take Olympias away from me.\" He doesn't usually pray so earnestly, but the situation seemed to call for it. \n\n\nEven though he was the one asking, Philip was more than startled to hear a response. It came from the young maiden on the other side of the bed. \"Are you sure?\" The voice exudes power unlike any other he'd ever heard.\n\n\nPhilip looks to the young maiden. Her ancient silvery eyes look back at him, and her eyebrows are raised in question. Philip nods and manages to mumble a \"yes.\" \n\n\n\"You may come to regret this.\" Before Philip can ask what she means, the Goddess leans over and kisses Olympias on her brow. With that action she disappears leaving Philip, the maids, and Olympias alone. \n\n\nOlympias breathing goes from shallow to deep, and her wound seem to heal themselves. If the maids had been paying a little more attention they might have seen the miracle occur, but amid their despair and Olympias blood no one but Philip saw what happened. \n\n\n\"Give him to me.\" The voice starts out as a whisper, but it grows steadily louder until the maids realize that their queen is still alive. The chaos that filled the room moments before the birthing reenters the room as the maids clean the baby and her mother up. Philip stands beside Olympias with his eyes rimmed red, but his expression a mask of joy. \n\n\nPrior to this, Olympias and Philip discussed what your name should be if you were to be a boy. \n\n\nIt is there, in your mother's arms that she calls you by it for the first time. \n\n\n\"Alexander.\"", "action_results": [{"action": "Olympias", "result": "You cling to your mother robes as tightly as possible, and look up into her eyes with a sad look on your face. She loves it when you hug her like that, and when you look at her with your sky blue eyes, she melts under your fingertips. It makes her want to sweep you into her arms, and hold you forever. You think it's because you remind her of you when you were just a baby, but what your mother often forgets is that you are the son of King Philip the Great, and Queen Olympias the God-Blessed. Thus, you are unnaturally talented in everything you've ever tried. So you can even trick the queen into doing what you want. Well at least that's what you think. Everyone else, including your parents, tell you that you're talented because you've been chosen by the Gods. That Artemis herself was there when you were born, and, what most people keep secret from you, that Artemis revived your mother when she died giving birth to you. \n\n\nAt the prime age of eight, you aren't sure if you believe that. \n\n\nYour dad's friends die all the time, and no Gods or Goddesses ever rescue them. You've never even heard of anyone being resurrected before, and even if it were possible, why your mother? Not that you're ungrateful if such a thing did happen, but why of all people her? You asked your mother once, and she just shook her head at you and told you not to worry about it. So then you went and asked Uncle Leonidas, and he just told you to continue your lessons and leave things like that to the adults. You responded by telling him he was being too condescending, and he nearly choked on the apple he was eating. Apparently six-year olds aren't supposed to know words that big. \n\n\nYou still don't have an answer to that question, but as you get older an older you care less and less. What matters is that your mom is here beside you...\n\n\n...and that by being affectionate to her, you can postpone Leonidas' lessons. Your mom holds you tightly to her, and you think that your plan will go through, but then she lets go.\n\n\n\"Go to your lessons, Alexander. You can't keep Leonidas waiting.\" She smiles and hugs you one last time, before motioning to your personal handmaiden, Lanike. \"Take him to Leonidas.\"\n\n\nSo today is one of those days. Your father left yesterday on another campaign, and it has mother sad. It's times like these that she likes to be alone, so like a good kid you oblige your mother's wishes. She did birth you after all. \n\n\nLanike grabs your hand and leads you from the room. Of all the women you know, Lanike and your mother are perhaps the only two that you will readily allow to touch you. If Goddesses really did exist, then there must have been some involved with the creation of this person. Beautiful black hair falls in loose curls around her perfect face. Her high cheekbones and rosy hue to her face compliment her appearance in an exemplary way. She was very young for a royal handmaid. Apparently her appearance wasn't the only good thing about her, for she worked her way up to this position through hard work and determination. The only two things, your father tells you, that can usurp latent talent. \n\n\nThe pair of you make your way to Leonidas' study, but as you near, your desire to to follow your mother's command dwindles. Leonidas was usually so engrossed in his paperwork that he barely notices when you're there anyway. You and Lanike turn down the hallway leading to your uncle's room and you find your opportunity dwindling. You still might be able to convince Lanike to let you skip the lessons. She is quite fond of you after all.", "action_results": [{"action": "Try to convince Lanike", "result": "If there's any chance of you getting out of your monotonous lessons, then you're going to take it. \n\n\nYour walk slows until it hits an eventual stop. You keep hold of Lanike's hand, and thus, pull her to a stop as well. A look of confusion comes over her face. \n\n\n\"Alexander? Why'd you stop?\" Her dazzling grey eyes scan you over, but in preparation for your plan, you have your face tilted downward. That way she'll have to lean down to get a closer look at your face. \n\n\nYou don't respond, and instead only squeeze her hand tighter. Something about holding onto women tightly really makes them give into you, for the very next moment Lanike crouches down and looks into your eyes. You can see the hint of worry in her eyes, and this close you could practically read every emotion etched into her face. \n\n\n\"Alexander?\" The words are spoken quietly, and when you open your mouth to reply, you realize you've made a grave mistake. \n\n\nYour original plan was to get her as close as possible to you without having to look her in the eyes, and then all at once you would hit her with a full dosage of your hopeful and sad look. The one that mother always falls for. Then you'd explain that you didn't want to go to the lessons, and would rather stay with her. While you were thinking this, you forgot to factor in the fact that she would be that close to you. Instead of you hitting her with the full power of your cute child persona, she hit you with a dosage of her beauty, and the worst part is that she didn't even mean to do it. You were bested by someone by someone who didn't even try. \n\n\nStill no words came out. Realizing your folly, you walk around her and attempt to pull her along the path Leonidas's room. Lanike, however isn't having any of that. You made her concerned, and she wasn't going to let you alone that easily. She uses your hand as a hold, and pulls you back toward her. this time, you don't look into her eyes. That way you might not be caught in her hypnotizing gaze. \n\n\nShe notices this. \"Look at me, Alexander.\" her voice isn't particularly commanding, but you can't resist it. You give in to her command, and look directly into her eyes. She doesn't say anything, and just looks into your eyes. She stays there searching, trying to divine the problem that she still seemed to believe was troubling you. After a few moments of looking into your eyes, Lanike leans toward you and plants a soft, feathery kiss on your forehead. She then proceeds to run her hand through your thick golden hair. If you weren't speechless before, then you were certainly speechless now. \n\n\n\"If anything is ever bothering you, you can talk to me. Okay?\" You can only nod. \"Now, I know you don't really want to go to your lessons, but the queen told me to take you there, and if you stay standing right here I can't do that.\" \n\n\nYou hadn't thought of that, and you certainly don't want to get Lanike in trouble with your mother. Your mother was notoriously protective of you, and if she found out that you convinced Lanike to keep you away from you lessons, well you probably wouldn't see Lanike very much after that. \n\n\nYou nod again, and the pair of you continue onward to Leonidas' study. When you two get there, Leonidas is sitting in a polished wooden chair with a book in hand. his desk is positioned behind him, and another chair is sitting in front of him. Several bookshelves line the walls, and each of the shelves are filled with copious scrolls, parchments, and a few bound books.\n\n\n\"You're late, Alexander.\" his voice sounds like your mother's, filled with authority, but the similarities end there. While your mother has fiery red hair, Leonidas has dull brown hair. Even their facial structures are wildly different. The only thing they really have in common, aside from their demeanor, is their color eyes which, like yours, are sky blue. \n\n\n\"His mother kept him longer than expected.\" Lanike immediately comes to your defense. \n\n\n\"Hm. Is that so? It can't be helped then .\" He says this, but doesn't sound at all convinced. \"Now come Alexander. We have work to do.\" \n\n\nLanike ruffles your tousled golden hair one last time disappearing into the hallway. She'll be back in a few hours to pick you up. \n\n\nYou sit in the chair across from your Uncle.\n\n\n\"Alright. What shall we start with?\n\n\n ", "action_results": [{"action": "Philosophy", "result": "Now that you're here you're left with very few options, so you choose the lesser of three evils. It's the lesser, because your uncle's primary vehicle in which he teaches philosophy is debate. Debate is more fun than simply memorizing things, hence the lesser. \n\n\n\"Philosophy.\" \n\n\n\"Good choice, my boy.\" You watch as a spark lights in the man's eyes. A true scholar indeed, for, you think, that only a scholar truly devoted to his studies could find enjoyment in such a task.\n\n\n\"Do you remember where we left off?\"\n\n\n\"We were learning about Socrates and...\" you trail off when you fail to remember what exactly about Socrates you were learning. \n\n\n\"Questions,\" Leonidas supplies readily.\n\n\n\"Questions?\" \n\n\n\"Yes.\" \n\n\n\"What does Socrates have to do with questions?\"\n\n\n\"What did Socrates spend his life doing?\"\n\n\n\"Teaching philosophy, right?\"\n\n\n\"How did he teach?\"\n\n\nYou rack your brain. \n\n\n ", "action_results": [{"action": "\"By studying the world around him.\"", "result": "Leonidas shakes his head. \"Sorry Alexander, wrong answer. Guess again.\"", "action_results": [null]}, {"action": "\"By asking questions until the answer was found.\"", "result": "The hints were subtle, but the hints were there and you caught them. Leonidas was asking you questions until you were able to answer. It was smart of him to teach you in the very way that you were trying to divine. \n\n\n\"By asking questions until the answer was found.\"\n\n\nA smile stretches across Leonidas' face. \"Brilliant Alexander. I knew you'd get the answer.\"\n\n\nYou can't help the small smile that comes across your face, and you and Leonidas share a moment of kinship together before Leonidas expounds upon Socrates' method. \n\n\nThe rest of the lesson goes famously, and you end up having, dare you think it, fun. It ends all too quickly and soon you're presented with another question. \n\n\n\"Which lesson do you want to do next?\"", "action_results": [{"action": "History", "result": "You don't really know why you decide to do history, as you've always disliked history the most among the subjects you were taught, but for some reason you feel like this lesson will be different.\n\n\n\"History.\"\n\n\nLeonidas raises his eyebrows in surprise, but he gets a twinkle in his eyes. \"Very well. I have a very special lesson for today. Tell me, Have you heard of the Trojan War...?\"\n\n\nLeonidas leaps head first into tale of heroes, gods, and revenge. This is certainly the most interesting tale Leonidas has ever told you, and you decide to give history a chance more often. \n\n\nSeeing your delight in the story, Leonidas asks, \"What was your favorite part?\"\n\n\n ", "action_results": [{"action": "\"When the trojan horse plan was crafted.\"", "result": "You feel a twinkle in your eyes as you tell him.\n\n\nHe nods, elated that you're finally taking to history like he's always wanted you to. After you finish telling him, he relates to you his favorite part.\n\n\n\"Remember when Hector was finally bested?\" You nod thinking on the act of vengeance being taken. \"After that Achilles refused to return the body of Hector to the Trojans, but after a time and fashion, he gave in. It is then that the Achaeans and the Trojans entered into a truce. Both sides had taken heavy casualties, and many heroes died, so they took the time to bury their dead. That truce is my favorite part Alexander.\"\n\n\nYou nod, but don't quite grasp what he's trying to say to you. \n\n\nLeonidas continues. \"I would have you remember that in war there is a clear line between opposing forces, but in the end, when we are all dead, we are the same. Don't allow yourself to forget that when you go to war in your father's armies that even in times of war, there can be peace.\"\n\n\n'Even in times of war, there can be peace.' The words carve themselves into your memory, and Leonidas finishes his lesson. \n\n\n\"What do you want to learn about next?\" He asks you.", "action_results": [{"action": "Philosophy", "result": "Leonidas glances outside, and then he immediately lets out a short, abrupt laugh. \"Well Alexander, it looks like you made it through the day.\" \n\n\nYou look up surprised. You would've never guessed that the time went by this quickly. Guess that old saying your mother says is true. Time flies by when you're having fun. \n\n\nYou hear someone footsteps, and immediately after that, a voice. \"Alexander?\" Lanike walks into the room and stands beside you. \"How were your lessons?\"\n\n\nYou look from Leonidas to her. \"They went well.\" That was your normal rote response, and was what Lanike and Leonidas expected you to say. Which makes it all the better when you add a genuine response. \"I actually really enjoyed the lessons today.\"\n\n\nSmiles spread across the pair's faces, and you get confused. \"Is that so odd?\" you ask curiously. \n\n\nLanike puts her hand on your shoulder and pats it softly. \"No not at all Alex. I'm just glad you're finally enjoying them,\" Leonidas says. \"I'll see you tomorrow then. On time as well I hope. Now go ahead and get going before your mother stats worrying.\"\n\n\nYou get up from your seat and grab Lanike's hand. The both of you start to walk through out of the room, but you decide to do something you've never done before. You turn around and look your uncle dead in the eye. \"Thanks for always teaching me Uncle.\" \n\n\nYou see his eyes start to glisten with tears. \"It's been a joy to teach you.\" \n\n\nWith that said, you and Lanike walk out of the room and head back to your mother's quarter's. If all your lessons go like today then you think your life will start to get a lot better. With a smile on your face and joy spread across your features, you go about the rest of your day. ", "action_results": [{"action": "2 Years Later", "result": "From age eight to ten, you entered a period of extensive training. Your father Philip decided that if you were to be his heir to the throne, then you needed to be trained to your utmost potential. Your mother shared in this sentiment, and together they cracked down on you. No more were you able to manipulate them into letting you skip lessons, and from then on you were to be disciplined like a soldier. \n\n\nMost other kids would crack under the pressure, but you? You did no such thing. Instead of buckling under the weight of heavy familial, social, and political expectations, you thrived. You went from second best at combat (among the kids your age) to first in a matter of months. Your best friend, Hephaestion was second, and another kid, Cassander, called Cass, was third. Beyond that you began to throw yourself into studies of philosophy, and history at an unprecedented rate. You were even beginning to be more well read than the average adult. Even if your parents wouldn't fall for it anymore, you still practiced manipulating others to do what you wanted them to do. \n\n\nYou progressed so well in all aspects of your life that you were even beginning to question your doubts that you were Artemis' chosen. How else could you excel at everything so well? Everyone was impressed by you and your passion to better yourself, but among those that were, your mother stands far above the rest. She was so proud of you that she even suggested to you father that he should start taking you with him on his kingly matters. \n\n\nIt was for this reason that you now stood beside your father in a field outside the palace. You father recently found himself in need of a horse, and not just any horse, but one of superior quality and breed. A thessalonian merchant must've caught wind of this, and so brought his best horse to present to Philip.\n\n\nThe black stallion was a beautiful horse. Even for a king. Your father was wildly impressed, so much in fact that when the merchant charged him three times the amount for it your father was quite agreeable.\n\n\nAgreeable until he tried to mount the horse that is. Every time Philip neared the horse, it would trot away. your father tried several times to mount it, but each and every time he was either thrown off or unable to mount at all. It was quite the spectacle, for your father was not a man of weakness. He was humbled greatly, and you as well to see your father fail, by the experience. \n\n\nHeated, your father stalked back towards the merchant. \"I refuse to pay for a horse that I cannot ride. What use is it to me if it doesn't do what I wish?\"\n\n\n\"Please reconsider, my liege. He really is a fine horse. If you would but try once more, I'm sure you would be able to ride him,\" the thessalonian merchant pleaded.\n\n\nBut your father wouldn't hear of it. \"I've tried many of times yet. Surely I cannot rely on a horse in battle if it is this rebellious.\" Your father waved the merchant away, then approached you. \n\n\nYou look your father over. Anger surges across his features, but you know him well enough to not just see the anger. Disappointment colors his features. A little bit of regret as well. It was plain as day to you that he wanted that horse, for even now he stares longingly at the black stallion.\n\n\nYou follow his gaze and watch as the merchant's stable hands try and lead the horse away. Each time one of the men try and grab its reins the horse rears up defensively. You watch amused as they fail at what was supposed to be their job. You find it so appalling that you cannot simply stay silent and watch as they timidly approach the horse.\n\n\n\"You thessalonians lose out on an excellent horse because you lack the boldness to even manage him.\" You laugh brazenly. For a youth of ten, you could be quite condescending. \n\n\nYour father turns to look at you somewhat bewildered. \"Why do you rebuke those older than you as if you could do any better?\" \n\n\nThe merchant looks just as shocked as your father. \"If you think you can do any better, than be my honored guest my liege.\" Haughty, he continues. \"In fact, if you are able to tame him, then you can keep the horse for free.\"\n\n\nThe offer sounds tempting, and everyone's eyes turn to you. ", "action_results": [{"action": "Accept the challenge", "result": "A semi-wild grin spreads across your face. \"I'll accept your challenge then.\"\n\n\nIf the merchant was upset before, then he was dumbfounded now. You guess he didn't really expect you to try something so daring, but hey, you didn't think you were going to accept his challenge either until a moment before you did. \n\n\nYour father's expression turns stony. He doesn't say a word, and all others watching stay silent as well. You take this as your cue, and begin to approach the beast. \n\n\nThe black stallion stands majestically as it grazes in the field before you. It faces toward you and away from the sun. Its eyes regard you for a moment before trotting away and grazing elsewhere. \n\n\nYou have the bravado down, but obviously it's going to take a little more than just that to tame this beast. Now, how to go about it...", "action_results": [{"action": "Try feeding it some grass", "result": "The way to a horse's heart is through its stomach, right? What better way to tame the horse than by feeding it?\n\n\nYou nod to yourself assuredly. It was a solid plan. Certainly better than simply running up and holding on for dear life at least. You gather some grass up in a fist and slowly begin to approach the horse. It stays calm and collected as you approach, and even stays that way when you offer it the grass, but when it lifts its head to look at you it panics and rears up on its hind legs. You barely manage to escape without getting kicked in the face.\n\n\nYou hear an amused laugh behind you from the merchant, and you turn around to look at your father. His face retains its stony visage, but you think you can make out some disappointment in his eyes.\n\n\nYou turn back to the horse and mull over your other options.", "action_results": [{"action": "Give up", "result": "You don't know why you were so insistent upon attempting to tame the horse. That and ridiculing those who tried, but now as you stand before it, you lose all hope of taming it you might have once had. You turn away from the horse embarrassed and walk back towards your father.\n\n\nWhen you don't act on your word the merchant laughs. \"All talk but no action. Just as I thought.\" \n\n\nYou stay silent, but your father won't have anyone insulting his son. \"You had a right to issue a challenge against my son, but cross that boundary and I will see to it that you never walk again.\"\n\n\nFear and regret alights the merchant's eyes and he quickly asks for forgiveness before hurrying and trying to rein in the majestic horse. You watch on shamefully. After finally entering the good graces of your father, you go and ruin it by becoming an embarrassment. You feel your father's gaze on you and you turn to face him. \n\n\n\"I wouldn't have expected you to do it anyway son.\" \n\n\nYou nod absently as if you aren't affected by your failure, but you could see, practically feel, the loss of respect from your father and anyone else watching. You tilt your head down in shame and pray to the gods for the day to be over with. ", "action_results": [{"action": "3 Years Later", "result": "This was the day. Your father searched for a long time, and now he finally found someone who he thought would be able to tutor you well enough. He'd been searching ever since it became obvious that there was nothing more for Leonidas to teach you, and Leonidas was no push over when it came to scholarship. Finding someone that would not only be better than Leonidas, but better than yourself as well would not be an easy task. That being said, your father did say he found someone \"suitable for your needs,\" and who were you to argue with your father?\n\n\nEven though you accepted having a new tutor, you remained skeptical even as you went to your very first lesson. It was a ways away from your home at the temple of the nymphs in a small village called Mieza. This doubly confused you, for surely a great tutor such as the one your father found would be quartered in a palace like that of the one you live in. \n\n\nDespite all of this, you were content, for there were many pros to this change in tutorship as well. For example, Hephaestion was to be tutored at your side along with a host of other nobilties' youth. You would be taught in a similar environment to the famed Academy of Plato, but you would also be taught further the art of swordsmanship along with various other talents. \n\n\nAll in all you hoped it would be an interesting experience. \n\n\nHephaestion shared this sentiment aloud as the pair of you made your way to the temple.\n\n\n\"I hope this goes well.\"\n\n\nYou yawn idly. \"I'm sure it will. It's only another tutor, and this time we'll actually be learning together,\" you point out.\n\n\n\"That is true, but honestly, I'm more worried about you than me. I know I have many things to learn, but Alex, you're accelerating at a rate far beyond me.\" \n\n\nYou don't respond. He is right after all. Your main reservation is that you might end up being woefully bored, and simply outclass anyone else there.\n\n\nSilence comes over you and Hephaestion until you make it out of Mieza entirely. The temple itself was located on the side of a hill, and was said to be pretty rustic in nature. Another interesting aspect of this whole escapade. \n\n\n\"Are you sure we're going the right way?\" You ask Hephaestion.\n\n\nHe nods readily. \"Of course. If I didn't memorize the way here, then you would've gotten lost for sure.\" \n\n\nAbout an hour passes by, and you repeat the question. \n\n\n\"Yes I know where we're going. Stop with the uncertainty. Don't you trust me?\" Hephaestion questions.\n\n\n\"Yes I do, but I thought the temple was much less than an hour away.\" \n\n\nHephaestion shrugs. \"I guess you were wrong then. It happens.\" He says this confidently. You wouldn't normally allow people to insult your honor so easily, but it was honestly one of the things you liked about Hephaestion. He's honest, and honesty is a valuable gift when your royalty, as people tend to lie to gain your favor. \n\n\nNearly another hour passes by, and you find your patience wearing thin. Hephaestion said that you were going the right way, but this was taking an inordinately long time.\n\n\nLuckily for the both of you, you see an older man in traveling robes heading along the road ahead of you. \n\n\nYou start to jog off in the direction of the man when you hear Hephaestion call out from behind you. \"Where are you going?\" \n\n\n\"To ask for directions. That gentleman over there looks like he knows where he's going.\"\n\n\n\"And I don't?\" \n\n\nYou hesitate, for you'd rather not offend your best friend, but at the same time you don't even know if he knows where he's going. ", "action_results": [{"action": "Ask for directions", "result": "You shake your head regretfully. \"I'm sorry Heph. I just don't think you know where you're going.\" \n\n\nA flash of sadness crosses his face, and you wince in response. You really wish he knew where he was going, but all the signs point to the opposite more obvious point. That you and him are lost. \n\n\nYou turn back to the man and jog in that direction. You hear Hephaestion follow behind you, and you're glad he wasn't offended enough to abandon you. As you approach, the man turns around and looks the both of you over. You do the same to him. Grey traveling robes adorn him, and his short cropped hair and beard are a mix of dull brown and grey. The fellow is older than you, but not quite as old as you first thought.\n\n\nYou speak first. \"Greetings. Do you happen to know of a temple nearby, or somewhere hereabouts?\"\n\n\nThe man nods, \"Yes, as a matter of fact I do. Are you two headed over there right now?\" He glances at Hephaestion, and before you can respond Hephaestion speaks.\n\n\n\"We were headed over there just now, but my friend thought it expedient to make sure we were going the right way despite my adamant claims that we were going the right direction.\"\n\n\nYou turn around bewildered that your friend would give a stranger so much information, but Hephaestion doesn't meet your eyes so your glaring has no effect on him. You turn around as the man begins to speak. \n\n\n\"Well done Hephaestion. You executed your job perfectly. Many thanks.\" \n\n\nIf you were bewildered before, then you were astonishingly confused now. Neither of you offered your names to the stranger, yet he called Hephaestion by name. \n\n\nThe man straightens his back, and begins to circle you. He looks you up and down in a very obvious way. \"I take it this is Alexander?\"\n\n\nHe addresses Hephaestion whom immediately respond. \"Yes sir.\"\n\n\nHonorifics too? Who is this guy to make Hephaestion respect him so? The only other people he respected as much were his and your own parents.\n\n\n\"Who are you?\" Your voice is flavored with curiosity, and confusion.\n\n\nThe man doesn't speak, but simply continues looking you over. Hephaestion instead responds.\n\n\n\"Remember when I told you we were going to the temple?\" You nod your acknowledgement. \"Well that was only a half truth. Even if we did go to the temple, there wouldn't be a tutor there.\" He glances over to the stranger. \"Well at least not yet.\"\n\n\nYou turn back and look the men over again when you finally realize what Hephaestion is hinting at. \n\n\nHephaestion continues. \"He met with me several days ago and asked for me to arrange this. Evidently he wanted to meet with you outside the temple because as soon as we got there, he had no intention of paying you special treatment.\"\n\n\nYou repeat your question to the man once more. \"Who are you?\" \n\n\nThe man's brown eyes meet your own, and you see a intelligent look in them. As if he simply knows all of the answers to any questions you might pose. \"My name,\" he says, \"is Aristotle.\"", "action_results": [{"action": "Continue", "result": "You'd gone into Aristotle's classes with your expectation wildly low, and came out with your expectations blown out of the water. \n\n\nYou didn't expect to learn very much, yet you've never learned more.\n\n\nYou didn't expect the tutor to be very amiable, yet Aristotle is like the grandfather you never knew.\n\n\nYou never expected to find a place where you would feel more at home than your real home, yet here it is before you. \n\n\nYou sit outside the temple entrance gazing around the near about endless fields and forests. Many different activities are going on, including sparring, horse riding, tree climbing.\n\n\nYour normal lessons are done for the day, and you are left with a few other things to spend your time doing. All of the activities you see going on are available to you, but if you feel tired then you could also just head to your quarters and fall asleep.", "action_results": [{"action": "Do something outside", "result": "Birds circle overhead, and a light breeze shuffles through the air. It is a perfect day to be outside. What do you plan to do?", "action_results": [{"action": "Go horse riding", "result": "You decide almost immediately what you want to do next. Riding horses has always been a passion of yours, and there are few things more enjoyable than riding into the wind on a perfect day. \n\n\nYou head to the makeshift stables created for the duration of Aristotle's school here and examine your options. There are many horses to choose from, and you have difficulty choosing, and just when you're about to decide on a horse you see him out of the corner of your eye. Hephaestion is out in the fields behind the stable riding a chestnut colored mare. He catches your eye and waves at you. \n\n\nSuddenly your choices change.", "action_results": [{"action": "Go riding with Hephaestion", "result": "It all happened so fast. You were losing popularity, and as the prince of Macedon, well, that's a death sentence. You don't know which people made the move, but you're certain they planned this very well, for you don't even see it coming. One minute you're in perfect health, but the next you join your ancestors in the afterlife. You die without even knowing what killed you. ", "action_results": []}, {"action": "Ride without him", "result": "You ignore him, for you did come out here to enjoy the simple pleasures of riding. If you rode with him, then he'd probably ask you to race him, which would turn into a devastating loss for you. None of the horses here would be able to be Atalanta, Heph's horse.\n\n\nSo instead, you grab a spotted white and brown horse and take it for a ride. Pointedly away from Hephaestion. \n\n\nAn hour or so goes by, and the ride gives you peace and elation not often gifted to princes. Now, time to see if doing something else will give you those same feelings.", "action_results": [null]}]}, {"action": "Go practice your swordsmanship", "result": "You've managed to retain your position as one of the best warriors here, but if others start practicing a lot, then you could find yourself quickly outclassed. Therefore, what better place than the training fields to spend your day?\n\n\nYou head over there, and see Cassander practicing. Luckily for you Cassander also happened to be one of the best warriors, so your training today would not be boring. Cass himself is already engaged in combat, but that doesn't last very long, for the poor sap Cass is fighting overextends and Cass executes a perfectly timed jab to his side. The other youth is sent reeling.\n\n\nThe fight over, you approach Cass. He sees you and before you can say anything, he greets you first. \"Greetings Alexander.\"\n\n\nAmong your friends he is the only that still insists on being formal whenever you two are together. \"Do you want to test your blade against my own?\" \n\n\nThe dirty blonde haired youth nods his head, but motions for you to wait. \"Let me rest a moment longer.\" \n\n\nYou nod before moving to the opposite side of the training circle. You grab a wooden sword and wait for Cassander to ready himself. \n\n\nIt's not long before your friend stands up and enters his fighting stance. You do the same and the fight begins. Unlike when you and your friends were kids, the lot of you actually know how to fight now, so this fight actually takes more than a few seconds to finish. Despite this, you have the clear advantage. Cass is good, but he's no where near as good as you are. \n\n\nThat being said, if you don't change tactics, then this fight could continue on for quite awhile. ", "action_results": [{"action": "Overpower him", "result": "Using superior strength is a tried and true option. Thus, you immediately go on the offensive. You use everything in your arsenal. The only difference being that you consciously make the decision to use excessive amounts of strength in each strike. You lose absurd amounts energy doing this, but Cass is clearly getting worn down as well. \n\n\nYou strike horizontally from the right to the left, and Cass goes to block it, but in doing so his sword is moved away from his body. With that strike you destroyed his fighting stance, and created a clear opening. Now all you have to do is capitalize on it. You strike fast and hard from above and your attack...", "action_results": [null]}, {"action": "Dodge until an opportunity arises", "result": "You and most of your friends tend to be aggressive fighters. Cassander included. If you just dodge until an opportunity arises, then you won't expend very much energy at all with the satisfaction of winning the match.\n\n\nYou apply your change in tactics immediately, and it doesn't go unnoticed. Cass narrows his eyes at you, and he begins to be more cautious. His aggressive attacks come less readily, and the fight drags on. You realize that if you're to win this then you need to be just a tad more aggressive. You need to force him to be aggressive. A plan forms in your head. If you can attack and intentionally leave an opening for him to strike, then you could very well set yourself up for winning. \n\n\nYou put the plan into play immediately. You strike aggressively, then allow an opening. Cassander takes the bait and lunges forward with his sword. Your plan...\n\n\n ", "action_results": [null]}, {"action": "Parry, then strike", "result": "The plan is simple, and perhaps the easiest of your options. You don't have to change your style of fighting at all. The only thing that needs to happen is for you to make sure you parry at the correct time, for parrying is all about timing. You prepare yourself mentally, and your stance changes slightly, but Cass doesn't seem to notice. Instead he goes for the classic overhead slash. Well it's now or never. You go to parry and...", "action_results": [null, {"action": "Fail!", "result": "Parrying involves redirecting your opponents energy immediately after his weapon makes contact with yours. You attempted to do this, but you started to redirect a moment too early and the full force of his swing sends your sword out of your hands. Cass then quickly follows up with a horizontal strike to your side. The strike hits and you are left reeling with pain. Your sword is on the ground, you are in pain, and Cassander stands victorious before you. \n\n\nSuddenly you don't feel like sparring anymore.", "action_results": [null]}]}]}, {"action": "Go tree climbing", "result": "You aren't particularly in the mood for anything too intensive, so tree climbing it is. There is something inherently satisfying and relaxing  about climbing a tree and sitting atop it's branches. The real hard part was finding a good tree to do the climbing.\n\n\nWhile the immediate area around the temple was flat, plain terrain, there were still quite a few trees scattered about. You see several pines and cypruses, but you ignore them. If you were really going to do this, then you were going to find a nice large oak tree.\n\n\nYou search for a good solid fifteen minutes before finding the perfect one. Tall and thick, the oak's branches wind around the wooden beast. Green dots of its iconic leaves sprout all around, standing as an example of life in its prime to anyone who is blessed enough to see it. such displays of magnificence were rare, and not only did you have the opportunity to see it, but to climb it as well. \n\n\nSmiling you approach the beast. The first branch stands several feet above your head, and it is clear you won't just be able to jump and reach it. ", "action_results": [{"action": "Use the tree to propel yourself into the air", "result": "You take a deep breath and run at the tree, and when you get there you jump at the tree, plant a foot on its side, then propel yourself up to the first branch. You barely manage to grab on with your right hand. You pull yourself up from there, and soon enough you're sitting atop the first branch. After that the going gets easier, for after the first branch branches sprout galore. \n\n\nYour next challenge comes a few minutes later. You are farther up the tree, and the farther you go up the less limbs there are to grab. You've managed to get to the point where here's pretty much only one tree limb that you can grab easily. Any other one would be significantly more difficult, but this isn't usually a problem because the easy limb is usually there. Usually. The part you're at has had its limb broken off near the trunk. You don't know how it happened, but you do know that there are very few options for continuing forward.", "action_results": [{"action": "Leap past it to the next highest branch", "result": " You briefly look down, then regret it. You are very high up in the tree, and any falling could very well kill you. You've already made your mind, however, and ready yourself to make the jump to the next highest branch. You take a breath then start to jump...but lip instead. You forgot to  factor in that when you would start to jump the branch might quake under your weight and bend. This did, in fact, happen and you start to fall through the air, but only for a second. Luckily for you, you didn't slip and fall very far from the branch, so manage to keep one hand on the branch. \n\n\nYou pull yourself back onto the branch, and rethink your choices.", "action_results": [{"action": "Use the stump part of the branch to climb", "result": "The tree limb was broken off, but you think you can still use the stump left as a foothold to get up higher in the tree. Dangerous, sure, but the results would be worth it. \n\n\nYou wrap your arms around the tree at the highest point possible and start to shimmy up until your foot is on top of that stump. The foothold is just as sturdy as you thought it would be, and from there it's easy to grab the next branch. \n\n\nYou continue your journey up the tree, but the higher you get the slower you go. The branches get smaller and you aren't sure if some of them will even hold you. Still you press on as far as you think you can go without the branches simply breaking under your weight. \n\n\nYou get the highest, sturdiest branch possible and gaze out over the fields of the the temple. The view is breathtaking. You see a few people riding horses in the distance, including Hephaestion. Cassander and a few other are practicing swordplay in the sparring part of the field. It all looks fantastic, but there's something yet that bothers you. You look up and see the highest branch possible. Something deep within you yearns to be at the top of that. To show the world that you conquered this tree. ", "action_results": [{"action": "Continue climbing", "result": "You are Alexander, Prince of Macedon, chosen of Artemis, and damn good at climbing trees. You aren't about to let a stick or two get in the way of you standing at the top of this tree. \n\n\nYou immediately set back to work in climbing the beast. The branches are rather flimsy, but you find that so long as you stay light of foot the trees don't snap, even though you do hear precarious creaking noises. \n\n\nEventually you make your way, yes, all the way to the very top branch. Despite being rash in making the decision to continue onward in the first place, you are cautious now, for you'd rather not die. You put one foot on the branch at a time, and in a long moment you find yourself standing at the very top of the tree. \n\n\nIf you thought there was a great view before, then you were wrong. Those sturdy branches could never attain the brilliance of the view that you now held. You think you could even see Mieza from here. You start whooping and yelling in excitement. It was truly a good choice for you to come up here. The mild risk of danger held no sway on you any longer, for you start pumping a fist in the air in your fit of elation. \n\n\nThen you hear the cracking. You don't have anytime to react before the branch you are on snaps and you are sent tumbling into the air beneath you. You hit branch after branch and pain courses through your veins. You feel many of your bones break before your head collides with a rather thick branch knocking you out. You fall for just a few more seconds wherein you hit the ground beneath with a resoundingly solemn thud. You never wake up again.", "action_results": []}, {"action": "Resist the urge", "result": "You aren't a fool. The chances of you managing to get to the top branch without breaking another one and falling are slim. Right now its better to simply take what you have and be satisfied with it. \n\n\nActing on those thoughts you make your way back down the tree a satisfied person. You wonder what else could make you feel accomplished.", "action_results": [null]}]}, {"action": "Stop climbing", "result": "You nearly died, and you decide it best not to tempt fate and death by giving them another swing at you. You climb down the tree and head back to the temple.", "action_results": [null]}]}, null]}, {"action": "Wrap your arms around the trunk and shimmy your way up", "result": "You take a deep breath and wrap your arms around the beast. You aren't even close to wrapping your arms all the way around, but luckily enough, you do manage to have enough grip to start climbing. The going is slow, but you manage to make your way up to the first branch without falling. You pull yourself up from there, and soon enough you're sitting atop the first branch. After that the going gets easier, for after the first branch branches sprout galore. \n\n\nYour next challenge comes a few minutes later. You are farther up the tree, and the farther you go up the less limbs there are to grab. You've managed to get to the point where here's pretty much only one tree limb that you can grab easily. Any other one would be significantly more difficult, but this isn't usually a problem because the easy limb is usually there. Usually. The part you're at has had its limb broken off near the trunk. You don't know how it happened, but you do know that there are very few options for continuing forward.", "action_results": [null, null]}, {"action": "Try to find purchase on the bark", "result": "You figure that oak bark is sturdier than most, and thus might contain hand and footholds all around its base. If that much is true, then making your way up the tree should be easy. \n\n\nYou take a breath and do, in fact, manage to find some spots that you could use as holds. You act on this revelation and begin to make your way up the tree. After a few seconds you fall from your holds and land back on the grass in a mix of dirt, grass, and bark.\n\n\nApparently bark can't hold your weight very well.\n\n\n ", "action_results": [null, null]}, {"action": "Go get some rope", "result": "Now that you know where the tree is, you aren't going to make it even harder on yourself. You go back to the temple and find some rope before coming back to the tree. After that you simply toss half of the rope up and over the first branch. You grab the other half of the rope again and use the rope to climb up the tree.You pull yourself up from there, and soon enough you're sitting atop the first branch. After that the going gets easier, for after the first branch branches sprout galore. \n\n\nYour next challenge comes a few minutes later. You are farther up the tree, and the farther you go up the less limbs there are to grab. You've managed to get to the point where here's pretty much only one tree limb that you can grab easily. Any other one would be significantly more difficult, but this isn't usually a problem because the easy limb is usually there. Usually. The part you're at has had its limb broken off near the trunk. You don't know how it happened, but you do know that there are very few options for continuing forward. Those options don't include the rope, for in your rush to climb the tree you left in on the first branch. You could go and get it, but at that point you might as well just stop climbing all together. \n\n\nYou're left with two options.", "action_results": [null, null]}]}, {"action": "Do something inside", "result": "The inside of the temple is reminiscent of a cave. Having been built in and on the side of a hill, the inside is rather dim. During the day a hole in the roof of the cave is opened for light to seep through, but that is only in one location. Everywhere else without sufficient light is lit with torches.\n\n\nAristotle's study group took the center of the temple to be under the hole in the cave. Those in the lesson sit in a semi-circle of wooden chairs with Aristotle himself at the head. \n\n\n ", "action_results": [{"action": "Go back to your quarters (end the day)", "result": "Before you know it, the day has gone by and you're left feeling accomplished at what you've spent the day doing. Most days since you've been at Mieza have been spent like this one. Sure the day starts with lessons, hard ones even, yet you've grown to enjoy your time here a lot. You rarely think of home anymore, and instead pour your entire being into your studies with Aristotle, your warrior prowess, and growing closer to your friends. \n\n\nLater that night, in your quarters, you think of how lucky you are to be alive and born into the situation you are in. The gods really must love you. With that comforting thought, you fall asleep and dream dreams of never-ending happiness.", "action_results": [{"action": "Three years later", "result": "Given the continuity of your studies, you held onto the illusion that they would never end. This illusion, it turns out, was entirely incorrect, and of course you knew it was, but pretending that it wasn't was easier. Pretending that you were a simple son of a random noble was easier then remembering that you were the heir to the throne of the Macedonian empire. \n\n\nSo when your father sent a messenger to retrieve you from Aristotle you were shocked. Inwardly only of course. It simply wouldn't due to have everyone know that you were shocked, or in anyway disappointed by your father's summons. There was, however, a farewell for you. all of Aristotle's students gathered to bid you good fortune. Those closest to you even gave you gifts. \n\n\nFrom Ptolemy you received a journal to document your travels within. You only got to know Ptolemy during the latter half of your studies, but he became a close friend quite quickly. \n\n\nFrom Cassander you received a sword of the finest make. It was a memento from all of the sparring you and him did together. \"To protect you when I'm not at your side,\" he'd told you.\n\n\nFrom Hephaestion you received his very own armor set. While not as well crafted as your own, the symbolic meaning behind the gift meant leagues more than the item itself. It was a reference to yours and his most admired people in literature. Achilles and Patroclus. The pair of you often likened yourselves unto the pair of them, and would often argue just as often about which one of you were Achilles and which one was Patroclus. The pair of you would  always declare to the other that yourselves Achilles, but neither one of you were ever able to convince the other of this. \n\n\nThe armor itself was a reference to, during the Trojan war, when Achilles was abstaining from fighting. During that time, the Achaeans were being driven back by the Trojans, and were in dire need of their greatest warrior, Achilles. Patroclus knew of their need, and pleaded with Achilles to return to the battle. When Achilles refused, Patroclus instead asked for Achilles armor, so that their army would think Achilles was with them, and thus fight better. Achilles obliged and Patroclus' plan worked for a time, but eventually he was slain.\n\n\nWhile you and Hephaestion disagreed on whom was whom, you did agree on one thing. That the pair of you would not fall victim to death so easily like Achilles and Patroclus did. The armor was a message. \"Don't die while we are separated,\" it seemed to say. But what Heph actually said was, \"Don't return this to me with your blood on it.\"\n\n\nFrom Aristotle you received your favorite book, The Iliad, annotated by Aristotle himself. Within it contained all of you favorite stories, and advice from Aristotle to reflect on while you read it. \n\n\nThese four gifts eclipsed all other you received, and you felt you were well prepared in all aspects to return home to your father.\n\n\nThe palace looked like it always did. Well, perhaps a tad smaller, but everything else was the same. You mother stood at the front of the palace waiting for you. The touches of old age had barely marred her features, and her brilliant blue eyes shone with tears as you approached her.\n\n\n\"Come here, Alexander.\" You oblige her and she immediately begins showering you with amounts of affection that only a mother could achieve. After she was done making sure you weren't hurt anywhere, she began the questioning.\n\n\n\"How did you like it?\" Her voice is music to your ears. Despite having loved being away, you can admit that being back was nice, for you really do love your parents. Their strict leash on you was overbearing at times, but, looking back, they always helped you become the person you are today. Very few people could compare themselves to you without feeling grossly unqualified. \n\n\n\"I enjoyed it mother. I learned so much, and you must remind me to thank father for choosing Aristotle as my tutor. Aristotle has a brilliant mind. One perhaps greater than anyone else I've has the pleasure of acquainting.\"\n\n\nYou mother puts her hand on your shoulder, and steers you into the palace. \"You can thank him yourself dear. He is waiting inside for you.\"\n\n\nYou raise your eyebrows at her. \"I thought he was on preparing for another campaign?\"\n\n\nShe eyes you carefully as you pass through the palace's white marble hallways. \"That is actually what he wants to speak with you about.\"\n\n\nYour heart skips a beat. Was your father finally going to take you on a campaign with him? You expected something similar, but you thought it would be on the next campaign he led. Certainly not this one. \n\n\nSilence descends upon the both of you on your way to the throne room. When you get there however, that silence is easily broken from the outside. Attendants and generals surround your father's throne, all of which are speaking each one vying for the king's attention. \n\n\nMassive white pillars line the way to the throne, and you and your mother walk square in the center of them. \n\n\nYour presence is noticed immediately. \"Alexander, my son. How good it is to see you!\" Your father calls from his throne before standing up and walking to you. \n\n\nTo others his presence might be imposing, but you can only feel admiration for the man as he wraps you in a bear hug. \"How went the lessons?\"\n\n\n\"They went well father. Many thanks for having Aristotle be my tutor. He is quite the teacher.\"\n\n\nYour father nods knowingly. \"That he is. I had to rebuild an entire village for him to agree to teach for me though. He was expensive.\"\n\n\nYou widen your eyes slightly. You had no idea Aristotle had required such a high price for his services. \n\n\n\"But let us move on to the topic at hand. Shall we?\" You nod and your father places his hand on your shoulder mirroring the position you and your mother were in moments before. He then leads you up to the throne. The attendants and generals were dispersed from it in the wake of your arrival.\n\n\n\"Go ahead Alexander. Sit in it.\" \n\n\nYou look at him curiously, and he meets your eyes with his. He then motions for you to go ahead and sit. Determining your father is serious, you walk up to the throne slowly. You knew that you would sit in the chair one day, but you figured that that day was still years away. After all your father was still alive, and he clearly had no intentions of dying. \n\n\nYou take a deep breath and settle your self into the throne. It was made of stark white Alabaster, and lined with silk and wool. It was very comfortable.\n\n\n\"Alexander. I now name you acting regent of Macedon. The throne is yours until I return from my campaign.\" Your father's face is deadly serious, and his voice is grave. You will not dishonor his trust by acting shocked or unworthy of the title. This has been what you've been training for your entire life after all. \n\n\nIt is there, sitting on the throne, that you get your first taste of real power.", "action_results": [{"action": "Life continues onward", "result": "Three years have passed since you were first name regent, and in those three years, you have failed more times than any other person you know. \n\n\nIt all started with the Thracians. Not too long after your father left on his campaign, Thrace rebelled against Macedon. Acing as regent, you immediately went to quell the rebellion. While it took some time and resources, you did eventually quell the rebellion. That part went alright. It was when your father returned that things went awry. Several different Thracian settlement began revolting, and, noting your previous success with quelling the previous rebellion, your father sent you to quell these revolts as well. You had to extend your army fairly thin, but you managed to keep the Thracians in line. Once that happened, your father told you to build up your army further, so you could help him in his next campaign against Athens. \n\n\nYou obliged, and everything was going well until the Illyrians made their move. For several month then, they had been making demands. Threatening to invade and other such claims. You dismissed these claims as lunacy, for everyone knew that the Illyrians could barely herd cattle. Let alone build an army threatening enough to invade the Macedonian empire. \n\n\nYou shouldn't have dismissed their claims. While the Illyrian army wasn't very large, it wasn't anything to laugh at. Especially since the majority of your army was occupied with the Thracians. Your were not nearly as well equipped to deal with the incursion as you should have been, and over half of your army was destroyed by the time your father came to intervene. \n\n\nIt was a huge disaster, and you were immediately dismissed from your general position. Even if you were his son, Philip would not have his general be failures. He needed the best of the best, and while you could've been called that in the past, your failure relieved you of that position. \n\n\nYou were no longer in charge of armies, and instead your father made you an ambassador. An ambassador! He would send you as far away from the battlefield as possible. Not because he cared for your safety. No, it was because he feared you would destroy all that he'd spent his life building up. You spent the last three years, until you were nineteen, settling minor disputes and brokering peace treaties among your empire with others. To your chagrin, you were rather good at it, and your father noticed this. He made you lead ambassador which carried a lot of authority, but you were away from battle. That assignment guaranteed that you would never be in charge of an army again.\n\n\nWell at least until now. Tensions between Athens and Macedon are at an all time high, and war between the two have all but started. The only key left to knock into place was Thebes. The two last powerful kingdoms in Greece not under you father's control were Athens and Thebes, but unlike Athens, Thebes had not yet taken a side. So, your father sent you, the lead ambassador, to see if you could win Thebes to your side. He told you this, and punctuated it with a promise. If you were able to win Thebes from Athens, then you would finally get your own army again. He must've seen that your heart still yearned for the battlefield.\n\n\n                                                                                                               ~\n\n\nThose were the thoughts going through your head as you were led into the Theban palace. Similar in Architecture to the palace back home, the Theban palace stood as a beacon of hope for Athens. A beacon that you had to put out. \n\n\nA theban attendant led you through the palace and into the throne room of the King of Thebes. White marble walls were everywhere you looked, and the throne room even had the same marble pillars leading up to the throne itself. The throne that the king was currently seated at. He was a grey eyed man. His wasn't young, yet his black hair hadn't started to grey either. He had an air of confidence and security that only a King could muster. \n\n\n\"Greetings majesty.\" You bow down slightly, as is only respectful when in the throne room of another king. That, and you are trying to win his favor. \n\n\n\"I am Prince Alexander of Macedon. Sent here on behalf of King Philip of Macedon. I would have words with you regarding your loyalties in the coming war.\"\n\n\nThe king regards you calmly. \"What say you Demosthenes?\"\n\n\nIt is only then that you notice a man standing beside the Throne. Greying brown hair sits in an orderly mop atop his head, and intelligent, if arrogant, eyes bore into you from him. You inwardly cringe as you here the name. Demosthenes. One of the most influential individuals in ll of Greece, and certainly the most influential person in Athens. The Athenian ambassador got here before you did. \n\n\n\"I would not put him away out right, your majesty, but I doubt anything he says will be of much consequence to you.\" You can practically feel the odds of your success stacking against you here. \"He is Philip's son after all. He would only seek to control you.\"\n\n\nThe king listens, but doesn't make any expressions on his face that would give way to what he is thinking.\n\n\nYou're in a tough spot. Demosthenes already got to the king, so anything you say will most likely be second source information.  ", "action_results": [{"action": "Tell the truth", "result": "\"Your majesty.\" You begin. \"Truth be told. My father is a very brash man, and can quite often be forgettable. Despite this, he is the greatest warrior and leader Macedon has ever known. He is brilliant on the battlefield, and has won many battles in which the odds were stacked against him. Many mistake him for a god when pitted against him on the battlefield. I assure you. You will not be any different if you go against him in war.\" \n\n\nYour throat feels dry and you swallow nervously. \"Plot with Athens all you want. This will not change the outcome unless you side with us. It would be a shame for a city so great to be razed to the ground just because the king was fooled into believing he had a chance at defeating Macedon.\"\n\n\n\"Athens has already sealed their fate. don't seal yours as well,\" you finish with that.\n\n\nThe room is deadly silent for several infinite moments. The king finally speaks.\n\n\n\"You toe a dangerous line Alexander of Macedon. Any more threats and would have had you executed, but you do have a point.\" \n\n\n\"You majes-\" Demosthenes begins, but the king waves him silent. \n\n\n\"Send a messenger to Philip telling him that I would speak to him in person before finalizing any sort of treaty being made.\" The king regards you for a moment longer. \"And find the prince a room.\"\n\n\nYou let go of a breath you hadn't realized you'd been holding in. You managed to get your father the opportunity to make a treaty with the king. You only hope that this will be enough for you to get your army back.\n\n\n ", "action_results": [{"action": "Continue", "result": "A guard walks you to your temporary rooms, and you get pretty solid rest that night all things considered. In the coming days the meeting is set, and all of the necessary arrangements are prepared. The meeting will be one month from the day you convinced the king to agree with you.\n\n\nYou stay on edge for the first week or so of your stay there, but soon you start to relax as you grow more and more confident that you won't be killed in your sleep. However, you still avoid Demosthenes and the king as much as possible, for you don't want to unnecessarily provoke them. \n\n\nThe month passes by fairly quickly, and before you know it the night before the meeting comes. You go to sleep early in anticipation thereof. \n\n\nUnfortunately for you, you aren't able to see how the meeting goes, for you are stabbed in your sleep. You guess that they could only deal with so many Macedonian royalty at one time.", "action_results": []}]}, {"action": "Tell the \"truth\"", "result": "\"Your majesty,\" you begin. \"My father only wishes for peace among us.\" Demosthenes scoffs. \"Yes. Even with Athens. He would have us all join together and form a coalition. We would finally bring all of Greece under one banner, and we would be powerful and rich beyond compare, and best of all we'd treat each other as equals.\"\n\n\nThe king looks amused, and Demosthenes looks more than a little skeptical. \n\n\n\"A triumvirate would be formed, and all decisions would be made together. Demosthenes, you would be granted a special place therein. You would no longer have to bow to the whims of your people's so called democracy.\" He stands there expressionless, as if considering your offer. \"We would become the most powerful empire in the world.\" You close with that, and anxiously await their reactions. \n\n\nThey look at each other for a moment, before the King stands up and walks over to you. You don't allow him to intimidate you, and instead stand your ground and hold his penetrating gaze. \n\n\n\"Alexander. You would have me believe that your father would not kill us and take emperorship for himself at the first opportunity he gets?\" He laughs in your face. \"That is a fool's hope. Almost as foolish as you blatantly lying in my presence.\" \n\n\nHe waves his hands in a quick motion and two guards restrain and force you to your knees while a third one gives the king a sword with a gem encrusted hilt. \n\n\n\"My father will avenge me.\" You say this, but you wonder if they hear the uncertainty in your voice. The king certainly does.\n\n\n\"He won't care. You fell out of favor with him long ago. He probably won't even ask for your body.\"\n\n\nThose are the last words you hear, before the sound of a sword swinging through the air fills your ears. You don't feel any pain as the king of Thebes separates your head from your shoulders.", "action_results": []}]}]}]}, null]}]}, null, {"action": "Go to sleep", "result": "You already finished your lessons for the day, so why not get some rest? You don't have anything else planned for the day, so it works out perfectly for you. Besides, even princes need rest from the monotony of academy life. One could even say you are doing the smart thing by taking a nap.\n\n\nTherefore you head through to the temple and to your quarters for some rest.", "action_results": [{"action": "Waking up", "result": "After a few hours, you groggily wake up. Post nap fatigue assails you, and you wonder if you should even get up to check what time it is. You really want to go to sleep, but a quiet nagging voice tells you that you should probably do something with your day. ", "action_results": [null, null]}]}]}]}, {"action": "Trust Hephaestion", "result": "\"I do trust you.\" You tell him this and a look of relief and shock come over his face. \"Lead the way.\"\n\n\n\"Well then,\" Hephaestion starts. \"This is not at all what was supposed to happen.\" \n\n\n\"What?\" You ask confusedly.\n\n\n\"Let's go ask that man for directions.\" Hephaestion says, and you only grow more confused.\n\n\n\"Wait, why? didn't you already know how to get there.\" \n\n\n\"Just trust me on this. Okay?\" \n\n\nYou thought you were already trusting him by letting him lead, but you do what he says and start jogging over to the man. You hear Hephaestion follow behind you. As you approach, the man turns around and looks the both of you over. You do the same to him. Grey traveling robes adorn him, and his short cropped hair and beard are a mix of dull brown and grey. The fellow is older than you, but not quite as old as you first thought.\n\n\nYou speak first. \"Greetings. Do you happen to know of a temple nearby, or somewhere hereabouts?\"\n\n\nThe man nods, \"Yes, as a matter of fact I do. Are you two headed over there right now?\" He glances at Hephaestion, and before you can respond Hephaestion speaks.\n\n\n\"We were headed over there just now, but my friend thought it expedient to make sure we were going the right way despite my adamant claims that we were going the right direction.\"\n\n\nYou turn around bewildered that your friend would give a stranger so much information, but Hephaestion doesn't meet your eyes so your glaring has no effect on him. You turn around as the man begins to speak. \n\n\n\"Well done Hephaestion. You executed your job perfectly. Many thanks.\" \n\n\nIf you were bewildered before, then you were astonishingly confused now. Neither of you offered your names to the stranger, yet he called Hephaestion by name. \n\n\nThe man straightens his back, and begins to circle you. He looks you up and down in a very obvious way. \"I take it this is Alexander?\"\n\n\nHe addresses Hephaestion whom immediately respond. \"Yes sir.\"\n\n\nHonorifics too? Who is this guy to make Hephaestion respect him so? The only other people he respected as much were his and your own parents.\n\n\n\"Who are you?\" Your voice is flavored with curiosity, and confusion.\n\n\nThe man doesn't speak, but simply continues looking you over. Hephaestion instead responds.\n\n\n\"Remember when I told you we were going to the temple?\" You nod your acknowledgement. \"Well that was only a half truth. Even if we did go to the temple, there wouldn't be a tutor there.\" He glances over to the stranger. \"Well at least not yet.\"\n\n\nYou turn back and look the men over again when you finally realize what Hephaestion is hinting at. \n\n\nHephaestion continues. \"He met with me several days ago and asked for me to arrange this. Evidently he wanted to meet with you outside the temple because as soon as we got there, he had no intention of paying you special treatment.\"\n\n\nYou repeat your question to the man once more. \"Who are you?\" \n\n\nThe man's brown eyes meet your own, and you see a intelligent look in them. As if he simply knows all of the answers to any questions you might pose. \"My name,\" he says, \"is Aristotle.\"", "action_results": [null]}]}]}]}, null]}, {"action": "Refuse", "result": "You bite your tongue. Your father couldn't even tame the beast. How could you ever hope to do it? You wish you'd never spoken.\n\n\nWhen you don't respond the merchant laughs. \"All talk but no action. Just as I thought.\" \n\n\nYou stay silent, but your father won't have anyone insulting his son. \"You had a right to issue a challenge against my son, but cross that boundary and I will see to it that you never walk again.\"\n\n\nFear and regret alights the merchant's eyes and he quickly asks for forgiveness before hurrying and trying to rein in the majestic horse. You watch on shamefully. After finally entering the good graces of your father, you go and ruin it by becoming an embarrassment. You feel your father's gaze on you and you turn to face him. \n\n\n\"I wouldn't have expected you to do it anyway son.\" \n\n\nYou nod absently as if you aren't affected by your failure, but you could see, practically feel, the loss of respect from your father and anyone else watching. You tilt your head down in shame and pray to the gods for the day to be over with. \n\n\n ", "action_results": [null]}]}]}, null]}, null, null]}, {"action": "Etiquette", "result": "\"Etiquette.\" \n\n\nLeonidas raises his eyebrows in surprise and in mild horror. This is his least favorite subject, and it shows plainly on his face. He is not happy with your choice. \"I suppose that we can do etiquette...\" He trails off as he walks to a a shelf by his main work desk. On it are several different devices of etiquette including: various brass utensils, the lyre, and a book which you know contains the proper ways to communicate.\n\n\nWhile he is turned around, you look out a window on the opposite side of the room. Some of the nobles' youth are practicing their skills with wooden swords outside. You yearn to go with them, but your conscious tells you to stay in your lessons. \n\n\nBarring your conscious, you really just want to go play with the other kids, and, you realize, that this is the perfect opportunity to sneak out. Leonidas has his back turned wile rifling through the proper etiquette book. If you left then you think he'd probably be happy. After all he doesn't want to do etiquette either. ", "action_results": [{"action": "Sneak out and play with the other kids", "result": "This is a great opportunity and you aren't going to miss it. You quietly stand up, then tip toe out of the room. You continue walking quietly until you are out of that hallway entirely. The white marbled walls once again grace your eyes with their brilliance as you make your way outside. Eventually you make your way out, and find the hill where you saw the other kids playing. \n\n\nYou've played with some of he nobles' kids before, but you never manage to remember their names. Well except for one. That one stands in the middle of a circle of boys your age. His name is Hephaestion.  You've never had many friends, but if there was one person you would call a friend, then it would be him. He stands engaged in combat with one other guy. You watch the fight as you approach the mass of raucous kids. \n\n\nHephaestion and the other kid stand on opposite sides of the circle with each one wielding a wooden practice sword. Hephaestion makes the first move charging with a simple overhand strike at the other kid who manages to block it, and make a swing of his own at Hephaestion's side. That is promptly blocked and parried away. Capitalizing on his advantage, Hephaestion surges forward with a lunge. This attack does not get blocked and the other kid soon drops into a heap on the ground. You then hear a chorus of cries.\n\n\n\"Come on, Cass. You had that!\"\n\n\n\"Now Hephaestion gets to go again!\" \n\n\n\"We all knew you would lose!\"\n\n\nThe kid, Cass, struggles up from the ground and shouts back at them. \"I'd like to see any of you beat him!\"\n\n\nHephaestion holds a smile throughout all of this, and you think it's high time you put him in his place. \n\n\n\"I'll do it.\" You say this at normal volume, but no one seems to hear you. They haven't even noticed you for that matter, so you try a different tactic. \n\n\nYou start shoving your way through the group. \"I'll do it!\" You shout over the arguing of everyone else, and everyone's eyes go to you as you break the center. Silence holds everyone's hands, and Cass simply gives his sword to you. No one speaks a word, for this is the fight. Whenever you do play with these guys, everything always boils down to this fight. You versus Hephaestion. It had taken on a kind of sacred aura, and as such the fight was given utmost reverence. \n\n\nYou enter into your ready stance, and Hephaestion follows. Hephaestion usually bests you in these bouts, but you feel that today is different. The only thing left to decide is how you'll fight. ", "action_results": [{"action": "Use superior strength", "result": "In times past you've allowed yourself to be worn down by Hephaestion's aggressive attacks. Not this time. This time you'll give him some of his own medicine. \n\n\nYou open up like he did against Cass. A charging overhead strike, and like the previous fight it is readily blocked. Unlike the previous fight, you don't allow him to attack. Instead you push his block with your sword to create space, then attack again. You keep on pressing attack, and but Hephaestion doesn't budge. You appear to panic, and so make a slow, weak horizontal strike at his side. Hephaestion sees an opening and instead of blocking your weak attack he swings down at your head. \n\n\nJust like you wanted.\n\n\nYour swing changes from a horizontal strike to a side strike at his sword. You put all of your strength into it and when the blades clash, Hephaestion's sword is sent flying. He stumbles back onto his posterior, and you point your wooden sword at his neck in triumph. \n\n\nThe silence is continued for a moment longer before a cheer goes out among your fellows. It invigorated them to see Hephaestion defeated. You meet his eyes and a grin goes across both of your faces before you help him back up. \n\n\n\"You got me that time Alex, but I'll win next time.\"\n\n\n\"I'd have to disagree,\" you respond with victory alighting your soul. \n\n\n\"I'm sorry, but it's the truth.\"\n\n\nYou're about to make a retort when Hephaestion groans. \"Your uncle.\" He points behind you and at the palace.\n\n\nLeonidas stands at the window you found yourself at just a short while ago. He gestures for you to come inside. You find yourself sighing. \n\n\n\"Teach these boys a thing or two, will you Hephaestion?\"\n\n\nHe nods readily. \"Don't die of boredom.\"\n\n\nYou go back inside the palace, through the hallways and back to Leonidas' study. He's already in his chair waiting.\n\n\n\"I'm sorry,\" you begin, but he holds up his hand. \n\n\n\"It's fine Alexander. Let's just move on to a different topic. Shall we?\"\n\n\n ", "action_results": [null, null]}, {"action": "Out maneuver him", "result": "In your experience, Hephaestion is a very aggressive fighter. If you can get him to overextend, then you could very well walk away with victory today. As such, Hephaestion is the first one to attack. \n\n\nTesting the waters, he quickly lunges forward only really using his arms as to not commit himself to the strike. You simply take a step or two backward to avoid the blow. Hephaestion attacks again, and you dodge again. Never attacking, but always ready to, you wait for your opportunity to arise.\n\n\nHephaestion, mistaking your hesitance to attack for weakness, quickly goes on the aggressive. Strike after strike come toward you, but you dodge them whilst making it look like you're on the run. Hephaestion doesn't seem to notice, and his form turns lax. Moments after, your opportunity comes.\n\n\nHe swings down in a deadly arc towards your right shoulder, and the swing carries a lot of power, but the harder he swings, the easier it is for him to overextend. You quickly dash toward his strike and let his sword run along the length of yours. His momentum carries him past you and he stumbles. You take the opportunity and plant your foot into his backside. He then goes tumbling to the grassy ground at your feet. You quickly place your wooden sword's tip beneath his chin. \n\n\nSilence continues for a moment longer before a cheer goes out among your fellows. It invigorated them to see Hephaestion defeated. You meet his eyes and a grin goes across both of your faces before you help him back up. \n\n\n\"You got me that time Alex, but I'll win next time.\"\n\n\n\"I'd have to disagree,\" you respond with victory alighting your soul. \n\n\n\"I'm sorry, but it's the truth.\"\n\n\nYou're about to make a retort when Hephaestion groans. \"Your uncle.\" He points behind you and at the palace.\n\n\nLeonidas stands at the window you found yourself at just a short while ago. He gestures for you to come inside. You find yourself sighing. \n\n\n\"Teach these boys a thing or two, will you Hephaestion?\"\n\n\nHe nods readily. \"Don't die of boredom.\"\n\n\nYou go back inside the palace, through the hallways and back to Leonidas' study. He's already in his chair waiting.\n\n\n\"I'm sorry,\" you begin, but he holds up his hand. \n\n\n\"It's fine Alexander. Let's just move on to a different topic. Shall we?\"", "action_results": [null, null]}]}, {"action": "Stay in your lesson", "result": "As much as you want to practice your fighting skills, you can't just leave Leonidas here. For all you know mother might get mad at him again. \n\n\nYou wait patiently as Leonidas decides how to teach you, and before long he walks back over to his seat with the Etiquette 'manual' in hand. He begins the lesson by teaching you the various ways you are supposed to address foreign dignitaries, and then having you memorize them and repeat them back to him.\n\n\nThis grows quite tedious and you find yourself whistling some nameless tune. Anything to break the monotony of blanket memorization. After a while you realize that Leonidas has stopped asking you questions, and instead is just listening to you whistle. The sudden attention surprises you and you break off your whistling. \n\n\n\"What's wrong Uncle?\"\n\n\nHe shakes his head idly. \"Nothing's wrong. The opposite in fact.\" You raise your eyebrows surprised and somewhat curiously. \n\n\nLeonidas gets up from his seat and walks back to his materials shelf. He puts the manual back, and instead grabs the lyre you saw earlier. He's never once given you the opportunity to play it before. \n\n\n\"Let's see how you do with this Alexander,\" he hands you the lyre, which you take gingerly, \n\n\nHe waits expectantly.\n\n\n\"I don't know how to play it,\" you tell him.\n\n\n\"Give it your best shot.\"\n\n\nSeeing no way out of it, you start to struma few strings. After you figure out the basic sounds of each string you attempt to play craft a melody. You think it sounds great, but Leonidas' expressing denotes otherwise. \n\n\n\"That's fine enough for starters, but I think you can do better. If you're willing to commit, Alexander, then I can teach you this instrument. It is a hard thing to do, but i think it's well within your reach. What do you say?\"", "action_results": [{"action": "Yes", "result": "You once heard your father say that there are two things that'll make a girl fall for you. The first: If you you fight honorably. The second: If you can play an instrument. Your answer was simple when you remembered that.\n\n\n\"Yes.\"\n\n\nA smile crosses Leonidas' face. \"Alright then. We can begin immediately.\"\n\n\nThroughout the rest of your lesson he teaches you the basic concept and notes of the lyre. Before too long, however, Leonidas decides that you better move onto something else. \n\n\n\"What do you want to study next?\"", "action_results": [null, null]}, {"action": "No", "result": "You don't know why else you have an aversion to it, but you feel like if you start to learn the lyre, you won't have very much time for anything else. \n\n\n\"No.'\n\n\nLeonidas frowns. \"That's a shame. I feel like you could have been one of the greatest musicians of our time. \"\n\n\nWhen you don't say anything he simply moves on. \n\n\n\"What lesson would you like to learn next?", "action_results": [null, null]}]}]}]}, {"action": "\"Using an open forum style to have his students debate.\"", "result": "\"I'm afraid that's incorrect Alexander.\" He looks disappointed in you. \"Guess again.\"", "action_results": [null]}]}, null, null]}, {"action": "Go to your lessons", "result": "While you really don't want to go to your lessons, you also don't want to disobey your mother. That, and there's the chance you might put Lanike in a bad spot with your mother. You'd rather avoid your mother's wrath entirely, for lessons can always end, but when your mother kindles her wrath, it can stay ablaze for several months at a time. It's quite unlike your father's wrath which flares up at the most unexpected times, burn hot, then turns to ash.\n\n\nYou yawn and the pair of you continue onward to Leonidas' study. When you two get there, Leonidas is sitting in a polished wooden chair with a book in hand. His desk is positioned behind him, and another chair is sitting in front of him. Several bookshelves line the walls, and each of the shelves are filled with copious scrolls, parchments, and a few bound books.\n\n\n\"You're late, Alexander.\" his voice sounds like your mother's, filled with authority, but the similarities end there. While your mother has fiery red hair, Leonidas has dull brown hair. Even their facial structures are wildly different. The only thing they really have in common, aside from their demeanor, is their color eyes which, like yours, are sky blue. \n\n\n\"His mother kept him longer than expected.\" Lanike immediately comes to your defense. \n\n\n\"Hm. Is that so? It can't be helped then .\" He says this, but doesn't sound at all convinced. \"Now come Alexander. We have work to do.\" \n\n\nLanike ruffles your tousled golden hair one last time disappearing into the hallway. She'll be back in a few hours to pick you up. \n\n\nYou sit in the chair across from your Uncle.\n\n\n\"Alright. What shall we start with?", "action_results": [null, null, null]}]}]}