{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=10885", "context": "", "first_story_block": "Tell me, o Muse, of that ingenious man, who traveled far and wide, after he was spoken to by the gods themselves. \n\n\n'Please aid me, Muses.' You whisper as you walk to the centre of the gathered crowd. 'Welcome, my very honored guests. Tonight I will tell you about the hero Odysseus, who braved many perils on his way home on the island of Ithaca. Once upon a time...'\n\n\nYou spend the following hours reciting all the long sentences you have memorized in the past few years. When you finish your story you are met by a wave of sound, as the audience loudly applauds your story. When the crowd leaves you finally begin to breath more easily.\n\n\n ", "action_results": [{"action": "The epic begins", "result": "After you leave the odeon, the performing place of bards, you gaze at the beautiful night sky above Athens' acropolis. The beauty of the night sky always calms you after your performances. However, as you gaze at the stars you suddenly see a golden light shining between the buildings of the temple complex, the acropolis.\n\n\nCurious, you cross the acropolis to get closer to the huge temple. When you approach it you see that someone placed the statue of the goddess Athena outside. Something is strange, though. The statue, that you know is made from marble, gold and silver, is glowing with a golden glow. The statue of Nike that she normally holds in her hand is gone and replaced by her shield, that normally lies by her side. You get uneasy and turn to walk away.\n\n\n'Halt!'\n\n\nYou turn around. Did someone just say something? You quicken your pace.\n\n\n'Halt!'\n\n\nOkay, you are really starting to freak out now. You now start running away from the Parthenon.\n\n\n'Foolish mortal.'\n\n\nYou spot an owl flying towards you. While you wonder what such an animal would be doing at this time at this place it crashes into your face. While your vision grows black you see a golden glow coming towards you.", "action_results": [{"action": "Light in the darkness", "result": "You hear faint murmurs in the darkness, like distant voices. A faint glow pierces your eyelids. When you try to open your eyes you are practically blinded by a golden light. After a short scream of fear and pain you close your eyes. The voices become clearer.\n\n\n'Do you really think he is up to this task?'\n\n\n'He is only a mere bard'\n\n\n'You, out of all people, should not criticize a bard, Apollo. And yes, Zeus, father of men and gods, highest of rulers, I do think that this mortal can complete the task we are about to give him.'\n\n\n'Apollo? Zeus? How hard was I hit by that flying piece of vermin?'\n\n\n'He'd better be, the fate of the world rests on his shoulders.'\n\n\n'Open your eyes mortal. I know you are awake. I hope my owl didn't hit you too hard. Don't be afraid.'\n\n\nYou slowly open your eyes, afraid to be blinded once again by that golden light. But this time nothing happens. When your eyes are fully opened and have adjusted to the darkness of the night, you see three people. Somehow they look familiar, like people you pass everyday without really looking at them. But on the other hand, you think you have seen their faces over a million times. When you realize just who you are looking at, your jaw drops with surprise. You are looking at three of the Olympic gods; the bright-eyed Athena, the ever-young Apollo and the aegis bearing Zeus. 'I... I... How... When...' While you try to make a coherent sentence, Athena speaks to you:\n\n\n'Please remain calm bard, great teller of tales, and listen to what we have to say. The world as you know it is about to undergo a radical change. War is about to erupt between the Greek city states, a war of which the likes haven't been seen since the great Trojan war. Many heroes died then, and many more will die now. You are the last hope of the Greeks.'\n\n\n'But what can I do to help? I'm just an ordinary bard. If the fate of the Greek cities hangs in the balance, then why can't the gods solve it? I mean, my people pray to you every day. Is this how you repay us?'\n\n\n'Insolent mortal. Is this how you repay us? Is this how you repay the immortal gods, who gave you life, who helped you in your times of need? If my daughter didn't favor you so much I would smite you on this spot.'\n\n\n'That will be enough father. I understand why you are angry, aoidos, but let us explain first. Even the gods are bound by rules, by fate, by moral. After the Trojan war Zeus decreed that no immortal gods may ever be involved in a war between humans again. The fact that we are giving you this advice is as far as we can go without upsetting the balance in the world. In order to avert this war you have to undertake a journey. You have to travel to the great oracle at Thebes, in the lands of the Aegyptians. There you will have to ask for advice on how to avert this war.\n\n\nStill baffled from your sudden encounter with the gods you answer:\n\n\n ", "action_results": [{"action": "'I'm sorry, but you have the wrong mortal, ehm... the wrong person. I'm not able to do that", "result": "'Ungrateful mortal!'\n\n\nAs Zeus speaks this words the skies fill with thunderclouds. The sound of the rumbling thunder drowns all other sounds that eminate from the city of Athens.\n\n\n'Insolent fool! Who are you to doubt the decisions of the almighty gods? I can't understand why Athena chose you as the savior of the Greeks, but she obviously chose poorly! But so be it, if you will not fulfill this task, then the Greek cities are doomed.'\n\n\nThe sound of thunder is becoming overwelming. While you cover your ears to block out the sound you see Athena looking at you with a sad expression. When the sound reaches it's climax a huge lightning bolt hits the acropolis. You close your eyes as the light is too intense to gaze at. You remain in this position for a minute or two, covering your ears with your hands and clenching your eyelids tight to avoid being blinded by another lightning bolt.\n\n\nWhen you finally dare to open your eyes you realise that the gods have left.\n\n\n \n\n ", "action_results": [{"action": "A year passes", "result": "A year has passed since your encounter with the gods. Although you doubt you really met the gods, you probably were hallucinating due to the stress you had because of your performance in the odeon, you can't stop thinking about their prophecy of war.\n\n\nYou suddenly realise that you have almost arrived at the assembly of the people. Time flies when you think intensely about things, maybe you should give up your job as a bard and become a philosopher. The assembly of the people is the highest ruling organ in Athens. The people decide on the future of the city, there is no single ruler or single ruling party. Normally only the richer people, that have the right to vote, attend the assembly. Today, however it seems like every person has come to the meeting place on the hill the Pnyx. But then again, today is not an ordinary day.\n\n\n'The time has come to take up our arms. Sparta, our old enemy has declared war upon us and many other Greek city states! Many other cities, like the city of Thebes, have declared war upon each other. An army of enemies will be arriving here within days! Now is the time to take up our arms, assemble the hoplites, mount our horses with their fast feet. Now is the time to defend our homeland against the aggressors, now is the time to fight!'\n\n\nThe speaker now shouts across the gathered crowd. The crowd shouts angrily in response. The great war has reached Athens...", "action_results": [{"action": "Days later...", "result": "You grip your spear tighter as you gaze at the distant flames on the edge of the horizon. The cool evening wind that is always present on the top of the big stone walls of Athens seems to be filled with the smell of burning wood. Great pyres of smoke have been visible for days since the Spartans and their allies invaded the lands of Athens. From your high point of view on top the gatehouse you can see the camp of the gathered enemies. A chill runs down your spine as you think of the fighting that has been occurring the last few days. Although the Athenian forces have been able to repel the invading forces, many people have lost their lives. Frankly, you don't believe that you are able to win this war. Most of the people that are defending the city only had the two years of mandatory military education. They are just regular citizens that were drafted to defend Athens in this great war.\n\n\nYou can see light dawning on the horizon, a new day has begun. A new day, filled with fighting. You can see activity in the enemy camp, men gathering, men mounting horses, people grabbing weapons and gathering in formation. You remember when these men first showed up on the edge of the horizon. You remember the men, women and children in front of them, running away, fleeing into the city. You remember men screaming as they assaulted the high walls of Athens, screaming when you pushed their ladders down to the hard earth, screaming as their souls passed on to the underworld.\n\n\nYou lift your shield as the enemy army marches towards the city, the fight is about to begin.\n\n\nMoments later you spot the first ladders being put against the walls and you rush towards them, either to push them down or to kill the men that are scaling them. Suddenly you hear a familiar sound, like a thousand birds flapping their wings in the skies. A shadow blocks the light of the sun as thousands of arrows fly towards the city of Athens.", "action_results": [{"action": "You quickly lie down", "result": "You throw yourself onto the ground, just as the arrows fly over your head. As you scramble to get up you realise that you are one of the few people that have survived this attack. Dazed, you watch across the city walls, oblivious to the rest of the world. However, you quickly come to your senses as you spot a Spartan soldier that has nearly reached the top of the wall. You pick up the shield and spear that you dropped when you tried to evade the deadly arrows. To your horror you realise that you can't move your spear arm and you realise that an arrow has lodged itself in your shoulder.\n\n\nThe Spartan soldiers have now reached the top of the walls and are advancing towards you and a few of the other survivors. Since there is no way that you can win this fight with only a shield, you retreat, stumbling over the corpses that now litter the once great walls of Athens. When you finally descend the walls you spot the swift-footed Polymachos, one of the most experienced marshals in Athens, giving orders to his men. 'Reinforce the walls, don't give them the chance to open the gates!'\n\n\nYou wrestle yourself through the soldiers that ascend the walls, trying to repel the invading Spartans, but finally you reach solid ground. You realize that you are more of a burden then an advantage to your fellow soldiers, so you drop your shield and walk away from the gates. Polymachos gives you an angry look but he turns away from you and runs towards the lion-hearted defenders of Athens. You now have a dilemma. Should you help defend the walls, or do you retreat to another part of the city?", "action_results": [{"action": "No, I won't run. I will help defend my homeland", "result": "You pick up your dropped shield and hurry back to the top of the walls. But before you even reach the staircase you hear a loud cracking to your left. As you look at the source of the noise you see splinters coming off of the city gates.\n\n\nWith a thundering crack the gates give way to the Spartan battering ram. At the same time a wave of Spartan soldiers comes flooding through the destroyed gates. You raise your shield and fight valiantly against the endless stream of enemies. Even with your useless arm you manage to injure quite a lot of enemies by smashing your shield at them.\n\n\nSuddenly you see general Polymachos fighting next to you. 'Cover my back!', he shouts at you, just when the spear of an enemy hits him in the chest. You gaze with horror at the sight of the swift-footed Polymachos, the most-experienced general of Athens, lying dead at the floor. While you are astounished by this sight an enemy manages to sneak up to you. As you finally realise what is going on he strikes you with his sword.\n\n\nAs your soul prepares to leave your body to journey to the realm of Hades you spot a golden light in the corner of your vision. When your soul finally leaves your body you wonder if this tragedy could have been averted.", "action_results": []}, {"action": "I have to retreat, I am in no condition to fight.", "result": "'I'll just be a burden for the other soldiers', you think as you run away from the walls.\n\n\nWhile you run through the besieged city you meet other people fleeing from the doomed city. A sense of shock creeps up on you as you realize just how many families are forced from their homes.\n\n\nYou finally manage to reach the opposite gate of Athens. Luckily, this one is badly guarded by the enemies as most of the soldiers are fighting on the other side of the city. A large group of people has already gathered near the gate and you hear shouts coming from it. 'Open the gate!' 'No, stay and defend our city!' 'Now, open...'. 'Fools, Athens is doomed!', you shout to them 'I saw the enemies myself, I fought them. There are just to many of them. Our only hope is to flee the city through this gate.' You armor and bleeding shoulder seem to impress the gathered people. Two other wounded soldiers run to the gates to open them. 'I hope you know what you're doing.', one of them says to you.\n\n\nWhen the gates open you see an almost deserted landscape. Only a handful of soldiers are left behind to make sure no one flees through these gates. Well, now they'll have to work for their money.\n\n\nWith the strength of a cornered lion, you, the two other soldiers and the gathered citizens attack the enemies. A few minutes later the enemies lie dead on the sandy soil, only two citizens have died in the attack.\n\n\nYou walk all day, always away from Athens. When night falls you camp on a hill. While the other refugees slowly fall to sleep, exhausted from the day's fighting and walking, you can't. Although the bleeding has stopped, moving your shoulder is still painful.\n\n\nYou gaze to the distant horizon and see the burning remains of what was the mighty city of Athens. In the inferno you see a flash of golden light coming from the hill that once housed the Parthenon. As you witness the destruction of your home you wonder if this could have been averted.", "action_results": []}]}, {"action": "You lift your shield to block the arrows", "result": "As the deadly projectiles rain down on the wall you quickly raise your shield above your head. Your heart pounds inside your chest as arrows rain down on your shield. As the final arrow strikes the stones of the city wall you lower your shield.\n\n\nThe sight of the slaughter on top of the city walls makes you gag. Dozens of men, who defended the walls, lie dead on the cold stone floor. Oblivious to the rest of the world you gaze at the fallen soldiers. The ones who survived are behaving the same. Suddenly you hear a shout coming from your right and you spot the first enemy climbing the siege ladders to the top of the walls. You quickly shout to the other men and rush to the enemy. Before he is able to reach the top of the wall you push back his ladder so he falls to the ground. A new wave of enemies, however, has climbed the other ladders. As you stumble over the corpses that now litter the walls you see your fellow soldiers repelling the enemies, destroying the ladders in the process.\n\n\nRelieved that this attack has been repelled you hear a thundering crack beneath you...\n\n\n ", "action_results": [{"action": "You quickly run down to the gates", "result": "Just as you reach the bottom of the staircase you see the gate give way with a thundering crack. The Spartan battering ram has breached the gates and a horde of enemies is rushing through.\n\n\nThe defenders of Athens fight valiantly against the intruders, trying to repel them. You can see the swift-footed Polymachos, the most experienced general of Athens fighting at the front of the defenders. You quickly join your fellow soldiers. Together, you fight bravely against the invading Spartans and after about half an hour most of the invaders are repelled from the city, the battle has moved outside the city walls.\n\n\nHowever, the enemy hasn't retreated yet. After they have regrouped themselves they attack you another time, killing many Athenian soldiers. You find yourself facing three enemies at the same time. As the adrenaline rushes through your veines you kill one of the attackers with your spear. But then the other enemies attack you...", "action_results": [{"action": "Duck!", "result": "You duck and the enemies' spears slice through thin air. When you prepare for another attack, your opponents haven't had the time to prepare themselves to defend your assault. You quickly dispatch of one of the soldiers by plunging your spear into his heart. The second one puts up more of a fight. He blocks every trust you make with your spear and vice versa. Eventually you see signs of fatigue across the face of your attacker. With a quick feint you manage to mislead your opponent and you manage to kill him with a single blow to his head.\n\n\nPanting, you look at the rest of the battlefield. You see your fellow defenders fighting with the courage and strength of mountain lions, but they are clearly outnumbered. To your right you see the lion-hearted Polymachos defending against an attack by multiple opponents and to your left you see a couple of Athenian soldiers who are being slaughtered by the Spartan attackers.\n\n\nAs you are about to lose all hope of winning this fight a huge soldiers comes into your view, wielding a large sword. As you watch him you think you recognize a highly decorated Spartan general named Dusmenecles, but then again, it is hard to recognize people who's faces are covered by bronze helmets. Unfortunately for you, the enemy general is heading straight to wards you.\n\n\nSeeing no other option, you storm the enemy general with your spear. But before you manage to hit him, he slices through your spear with his sword. Shocked by this turn of events you stand frozen to the ground as Dusmenecles raises his sword for the final blow...", "action_results": [{"action": "Block his sword with your shield", "result": "Just as the enemy is about to hit you, you raise your shield. But instead of being stopped by the wooden object, the sharp sword of Dusmenecles cleaves right through it, shattering it. This, however, isn't even the worse part. After dealing with your shield the sword carries on with it's swing and slices through your shoulder.\n\n\nYou fail to move as Dusmenecles, sacker of cities, thrusts his sword into your belly. You fall to the ground, bleeding from your mortal wounds.\n\n\nAs the life flows out of you you see a flash of golden light entering your field of vision. As you slowly bleed to death you wonder if all this fighting could have been prevented. The last thing you hear before your soul leaves your body to travel on to the realm of Hades is the evil laughter of Dusmenecles as he claims his next victim.", "action_results": []}, {"action": "Jump aside", "result": "You quickly come to your senses and jump aside, dodging the fatal blow. Unfortunately you drop your shield. As you fall to the ground you hit something hard with your elbow. As a sharp pain shoots through your arm you see the enemy preparing for another deadly blow. Fear grips your heart once again as you feel the cold touch of Hades on your shoulder. From utter despair you grope around on the floor, hoping to find anything that you can throw at the enemy general.\n\n\nYour hands find the object with which your elbow came into contact with. You throw it at Dusmenecles with all the strength you have left, closing your eyes, expecting the final blow to come any moment now. You feel like you have been sitting like this for minutes, though it must have been more like seconds, when you hear victorious shouting coming across the battlefield.\n\n\nYou open your eyes, surprised by this sound. And when you look around you see Athenian soldiers shouting and cheering. While you wonder what has caused this sudden turn of events you see the swift-footed Polymachos coming to wards you. 'You have my sincerest gratitude, soldier. Because you killed the treacherous enemy general his troops routed and victory was ours. Thank the gods!'\n\n\nYou killed who? Baffled you look at the spot where a few moments ago stood the manslaughtering Dusmenecles. Now you see his body lying on the ground, bleeding from a wound to the head, apparently caused by the broken sword that is sticking out of it. Did I really throw that?\n\n\n'I... I... I...'\n\n\n'Calm down great-hearted soldiers, you fought very bravely today. I am sure that the whole of Athens will commemorate your giant victory.'\n\n\nAll attention is just to much for you, although you are used to giant crowds of people, being a bard and all. You walk across the battlefield to a low hill, still baffled by the events of the day.", "action_results": [{"action": "When you reach the top...", "result": "When you reach the top of the hill you still haven't calmed down. You hear the cheering and shouting of the men behind you, mixed with another sound. A sound that is quite familiar, but this isn't coming from behind you, it is coming from in front of you. A sound like the sound of metal slamming against metal, which was sometimes audible at the smithies in Athens. As you look at the darkening horizon, dusk is setting in, your heart begins pounding in your chest.\n\n\nYou see an endless wave of enemies coming to wards the wounded city of Athens. You count thousands and thousand of men, all carrying weapons. You drop to the ground in utter despair. Athens will fall, it's soldiers and citizens slaughtered and there is nothing you can do to stop it. Just as the sun sinks beneath the horizon you see a golden flash of light. You wonder if this tragedy could have been averted.", "action_results": []}]}]}, {"action": "Block!", "result": "You manage to block the double attack with your shield. However, it isn't much worth after the damage done by the enemies spears. You throw your now useless shield at one of the attackers, startling him. The other, on the other hand, isn't that easily scared and attacks you once more.\n\n\nYou dodge the blow and return it with a thrust of your spear. As the wooden shaft pierces the armor of your opponent, the other manages to strike you with his spear. Luckily for you, it is only a flesh wound.  As he prepares you strike once more,  you...", "action_results": [{"action": "Counter-attack", "result": "You quickly thrust your spear at your opponent. Unfortunately for you, he is quicker. As your strength seeps away you drop your spear. When the enemy pulls his spear from your chest you can't find the strength to stand up anymore.\n\n\nYou feel your soul leave your body. You take one last look at the world around you. The sight isn't pretty. The lion-hearted defenders of Athens are being slaughtered by the Spartan soldiers. You see the swift-footed Polymachos fall to the sword of an enemy commander, you think you recognize the manslaughter, Dusmenecles of Sparta. As your soul travels to the realm of Hades you see a golden light. Your last thought in the mortal realm is: 'Could this slaughter have been prevented?'", "action_results": []}, {"action": "Dodge his attack", "result": "You duck aside just in time to dodge the fatal blow. As adrenaline rushes through your body you grab your opponents spear. You quickly pull it from his hands.The expression on his face changes from a self confident smirk to an expression of utter fear.\n\n\nYou quickly dispatch of the unarmed enemy with a quick slash of his spear. The battle rages on for a couple of minutes. After you kill a couple of soldiers you notice that the battlefield is getting quiet. The battle cries of the solders have died down. The shouts of agony from the wounded soldiers quiet down. You look around and see a group of soldiers standing around a body. At closer inspection you see it is the body of the lion-hearted Polymachos. Apparently he died, fighting an enemy general\n\n\nAthens doesn't rejoice at the fact that another wave of attackers has been repelled. Many brave men died and many more are wounded. The cries of widows can be heard around the clock and the smoke from the funerary pyres seems to block out the sun. You cannot stand the sight of this city of death any more. A few moments later you find yourself walking aimlessly across the battlefield. You have no idea how you ended up here. As you walk around the battlefield, occasionally startling one of the carrion eaters that now roam the lands, you think about the slaughter that has been done here the past couple of days. Suddenly a golden light shines from behind a nearby hill.\n\n\nYou quickly run to the top of the hill, hoping to see one of the immortal gods, who own the wide sky. However, you see a completely different sight. Thousands of footmen, carrying the swift bronze spears flood the nearby countryside. Hundreds of riders and their swift-hoofed horses pour from behind the enemy lines. Hordes of archers, pulling the strings on their bows flow from behind the horizon. At this sight your heart sinks with despair. How could the wounded city of Athens ever withstand a force like this. As you fall to your knees you once again spot the golden light, shining from behind the horizon. Could this tragedy have been averted?", "action_results": []}]}]}]}]}]}]}, {"action": "'It is not my right to doubt the decision of a god. I will do as you say.'", "result": "'Very well. Listen closely to what I have to say, great bard. You have to travel to the oracle at Thebes in the land of the Aegyptians. There you will have to ask for advice. However, she will test you first. Remember, whatever happens during your journey, don't ever mock the almighty gods. And always help those in need'\n\n\nAnd with that last warning Athena and the other gods slowly disappear from the sacred grounds of the acropolis. Leaving you behind, baffled and speechless.\n\n\nThat night you fall into a restless sleep. One-eyed monsters change into huge beast with multiple heads, sending ships and sailors to their doom. Beautiful women, with white arms, try to kill you and other men. And throughout your dream fires rage on in the background.\n\n\n ", "action_results": [{"action": "A week later...", "result": "The salt sea winds blow across the deck of the large ship. You stand on the deck, gazing at the distant horizon. How a mortal's life can change in the blink of an eye! A mere week ago you were telling stories in Athens' odeon and now you are leading an expedition to the oracle of Thebes!\n\n\nAfter that faithful night on top of the acropolis you left for the harbor of Piraeus. There, you found a mercenary who was willing to bring you to Thebes, for a steep price.  You tell your friends and family you are going to travel to distant courts to show off your knowledge of poetry. Then, nothing is left to hold you back from your journey, after a quick prayer to Athena, the patron goddess of Athens, you sail away on the mercenary ship.\n\n\n---\n\n\n'Sir, we are about to enter the Nile river, we will reach Thebes in a few days. There are a few complications, however. The trip has taken us more time then we originally planned and the crew is getting mutinous. To secure your... safety, we would like a couple of extra drachmas.", "action_results": [{"action": "'No. A deal is a deal, I won't give you more money.'", "result": "'Then I am truly sorry sir', he says as he spits on the ground, 'but I can't guarantee your safety anymore.' He grins as he speaks these last words. You back away from the mercenary captain as more crew members gather around him. You look around for your supplies, there's got to be a sword with them.\n\n\nThe ship's crew is closing in on you.\n\n\nYou are almost near the edge of the deck, and still no sign of your sword.\n\n\nThe captain draws his sword.\n\n\nYou finally spot your weapon lying about a feet away from you, just as you reach the edge of the deck.\n\n\nThe captain charges you and his crew follows. You quickly dodge aside, reaching for your sword. As your hands touch the cool bronze the captain prepares for another attack. Without another thought you sink your sword into his entrails. A look of horror passes his face as his soul passes on to the realm of Hades. The remaining crew members quickly lay down their arms.\n\n\nOne of them walks towards you. 'We are sorry to have disturbed you, noble mister. I don't know what we were thinking, we only acted on the orders of our traitorous captain. Our sincerest apologies.'\n\n\n'Very well, I accept your apologies. Now, go back to your posts, we continue our journey to Thebes.'\n\n\n'Let's just hope that I'll reach it alive', you mutter to yourself", "action_results": [{"action": "You carry on your journey on the Nile", "result": "The shining Eos rises once again to bring the day to the lands of the Aegyptians.\n\n\nThe crew has chosen a new captain and life moves on. No other attempts to kill you or steal your money has been made. You gaze with curiosity at the strange lands at the shores of the Nile, at the foreign people working the fields on the fertile banks on the river and at the strange animals that live in the water and on the shore. This scenery carries on for a couple of hours.\n\n\nSuddenly the ship turns away from the main stream, into a branch of the main river. Although you find this strange, you trust the guidance of the navigator and think no more about it. The scenery changes dramatically as time goes by, the fields and people disappear and the animals don't show themselves anymore. A strange silence falls over the lands.\n\n\nA crew member approaches you. 'Sir, I am sorry to report you that we took a wrong turn. However, the river flows to fast for our rowers to row upstream back to the main river. We will have to wait until the river calms down or we will have to follow this river and see were it takes us. I can't say for certain how long it will take before we reach...'\n\n\nHe stops abruptly as the most beautiful song fills the air. You all listen, hypnotized by the sweet sounds that come from no particular direction. However, the song has a strange, dark undertone, a chill runs down your spine as you remember tales about ships that were wrecked after the crew was hypnotized by the songs of mythical beasts.\n\n\nSuddenly alarmed you...\n\n\n ", "action_results": [{"action": "Plug the ears of the crew members with whatever you can find", "result": "You search the deck for... well anything that can plug the ears of the crew members. Eventually you find some wax-tablets. You scrape of as much of the wax as you can and run from crew member to crew member, plugging their ears and preventing them from hearing the tempting song.\n\n\nHowever, you can't but wonder about the beautiful sounds. So you order the crew to tie you to the mast, that way you can't do anything foolish, while you are still able to listen to the song.\n\n\nA few minutes later you pass a large rock, crowded with strange creatures. They look like women, but have bird wings and a fierce look in their eyes. As they spot your ship they lift up from the rock and circle above your ship, trying to tempt you to offer yourself to them. Their beautiful song fills you with the burning desire to jump in the water and surrender yourself to them, but the ropes prevent you from doing this.\n\n\nThe ship sails safely away from the sirens, with no casualties. As the song fades away, you are released by the crew members.\n\n\nYou stand on the rear of the ship, watching the sirens plunge themselves in the river. You remember tales saying that sirens can't stand people who hear their songs and live to tell the tale. They rather die than live the rest of their lives in shame.\n\n\n ", "action_results": [{"action": "As the hours pass, you slowly fall asleep", "result": "You are woken the next day by a crew member. 'Sir, I am happy to report you that we are back at the main river. After encountering some locals we have learned that we are mere hours away from the city of Thebes.'\n\n\nAbout three hours later you finally dock in the port of Thebes. The sun is at his highest peak and the heat is unbearable. 'How is it possible that people manage to live here?', you ask Cyrus, the new mercenary captain. 'I have no idea, but I'll be glad when we've returned to Greece.'\n\n\nWhile the crew unloads the ship you take a walk through the port of Thebes. Out of precaution you take your sword with you.\n\n\nThe far end of the docks are crowded with merchants selling strange and wondrous wares. Ivory from the south, silk from the east. tame crocodiles from the nearby Nile, even Greek pottery is for sale here.  You gaze with wonder at all of the stalls when you are suddenly approached by a beggar. 'Please sir, do you have a little money for a poor beggar? '\n\n\n ", "action_results": [{"action": "'Get lost, my money is my own.'", "result": "'But please sir, I am only a poor beggar, I don't have anything to eat and I have no money', the beggar replies.\n\n\n'I already told you, my money is my own. So get lost!' You feel a sudden anger setting in as the beggar won't leave.\n\n\n'Sir, have you no pity for a poor person like me?' The beggar says as he clamps on to you. 'The gods don't look kindly on people who don't care about their fellow men.'\n\n\n'I said get lost you old beggar!' You shout as you push the old bum away, 'so get lost!'. You give the beggar one last push and walk away.\n\n\n'So be it, stranger. I warned you the gods frown upon selfish mortals, but you didn't listen. Now you can consider yourself forlorn by the gods. No god will help you on this journey.' Having said this, the beggar disappears. Was this a trial of the gods?\n\n\nYou return to the ship, feeling confused and insecure. Cyrus immediately approaches you. 'Sir, we have finished unloading all of the stocks we were carrying on board, but it is too late to visit the Oracle, we will have to go tomorrow.' As you do not respond, Cyrus asks: 'sir, are you all right, you seem a little shaken, is the heat too much for you?'\n\n\n'No, I'm alright. I just need some sleep. I think I'll go to my mat early today.'\n\n\nThat night you have an uneasy sleep once again. You find yourself standing within a circle of immortal gods. Zeus, the highest god, father of gods and mortals, speaks to you:\n\n\n'Insolent mortal! Were you not warned to help the needy? Did you really think we gods would reward such selfish behavior? If you were not favored by my daughter Athena I would have killed you already. I will give you one last chance to prove yourself worthy of saving the Greek cities. However, you will find your journey to be harder than before.'\n\n\nSuddenly you are woken by a distant lightning bolt. The sky is darkened tonight by thunder clouds. You won't catch much sleep tonight.", "action_results": [{"action": "The next day...", "result": "You wake up the next day feeling terrible. Your eyes hurt as the bright rays from the Egyptian sun pierce your sleep-deprived eyes.  You let out a soft groan as you stand up and you realise that Cyrus already stands next to your sleeping mat.\n\n\n'Good morning sir. Are you feeling all right today?'\n\n\n'Apart from the incredible fatigue and the scorching heat, I'm alright. Is it possible for me to visit the oracle today?'\n\n\n'I took the liberty to arranging an appointment for you. The oracle is expecting you in about an hour. And don't worry: we won't ask for extra money for this service.'\n\n\nAbout an hour later you are standing in front of the shrine of the priestess of Zeus. The shrine is a large imposing circular structure made out of gleaming white marble. As you admire the building, the huge bronze doors open to reveal the priestess of Zeus. She wears a long white robe and a bronze necklace around her neck and she is of great beauty. She looks like one of the immortal gods, who own the great sky, herself. She doesn't look very happy, however. You slowly approach her to greet her and she speaks to you:\n\n\n'YOU! You are not welcome here stranger. The gods are angry with you, leave this place and don't return.'\n\n\n'I beg you, mistress, please give me...'\n\n\n'I told you to get lost! Go away right now or you will suffer the consequences!'", "action_results": [{"action": "'I'm not going until you listen to me.'", "result": "'You dare disobey the priestess of Zeus. GUARDS! Arrest these men, throw them into the deepest dungeons!'\n\n\nImmediately after she shouts this, guards appear from all sides.\n\n\n'Damn it!' Cyrus curses 'how are we supposed to leave this place, alive, with all these guards here? Oh well, I say we'll fight a way out. What do you think, traveler?'\n\n\n'I say fight them too. We need to find another way to prevent the Greek civil war and we won't be able to do that from a hot, Egyptian dungeon.'\n\n\nHaving said this you draw your sword, Cyrus does the same. About ten guards surround you, encouraged by the screaming priestess. However, they seem hesitant to fight against two armed opponents, the cowards.\n\n\nA group of four guards finally dare to attack you. They approach with drawn swords in their right hands and shields in their left. The rest of the guards watch as their colleagues attack you.\n\n\nHowever, you are fully prepared for an attack and so you:", "action_results": [{"action": "Block their attack and counter with your own", "result": "Your swords hit with a loud 'Clang' as the two swords collide.\n\nThe guard was unprepared for your block and he lowers his defence for a moment. You quickly dispatch him withing this undefended moment by slashing his throat with your sword. You hear a victory shout from Cyrus as he kills one of the guards too.\n\nHowever, the idle guards can't just watch on as two of their comrades have been killed. They quickly rush to the aid of their two remaining colleagues.\n\nNow it's eight versus two.\n\nThe remaining guards manage to gather in a kind of formation, linking their shields together to form a shield wall. Well, this is going to be fun.", "action_results": [{"action": "The shield wall", "result": "As you wonder how you are going to deal with this shield wall you notice Cyrus has disappeared.\n\n\nThe guards are slowly marching towards you, keeping their pace even to maintain the shield wall. Their glistening bronze swords stick out between the shields.\n\n\nYou back away as you realise that it is impossible for you to penetrate their wall without getting yourself killed.\n\n\nSuddenly you spot Cyrus creeping behind the enemies and you realise what he's trying to do. You quickly act like you're going to charge the enemy to create a diversion.\n\n\nSuddenly one of the enemies screams as his throat is slit by a fast movement of Cyrus' sword. However, now the enemies turn on Cyrus.\n\n\nIt's still seven versus two. And all of the seven enemies are now focusing on Cyrus. Now is your chance", "action_results": [{"action": "to run away.", "result": "'I'm truly sorry Cyrus', you whisper to yourself 'but we can't win this battle.'\n\n\nYou drop your sword and run away in the opposite direction of the battle. However, the priestess of Zeus is waiting for you, holding a spear. You can immediately see that she is untrained with weapons and so it shouldn't be hard to defeat her, if you hadn't dropped your sword.\n\n\n'Great and noble priestess of Zeus, the highest of rulers. Please listen to my pleads', you say as the priestess charges you with her spear.\n\n\nYou quickly dodge but the priestess seems unmoved by your words. 'I beg you, the Greek cities will fall if you won't help me.'\n\n\nThe priestess lunges again with her spear, cutting you across the chest. Luckily it's only a flesh wound. 'Mistress, please, thousands of people, innocents, will die if you won't help! Just listen to me!' You begin to scream with utter despair. You hear the shouts of Cyrus behind you as the bronze sword of a guard cuts through his chest and sends his soul prematurely to the realm of Hades, the underworld.\n\n\nThe death of Cyrus, although you knew was inevitable, shocks you and distracts you from the priestess. A few seconds later you feel a sharp pain spreading through your body. However, this feeling fades a few moments later. A blissful feeling of weightlessness enters your mind as your soul leaves your body to travel to meet Cyrus in the realm of Hades.", "action_results": []}, {"action": "to attack the enemy.", "result": "You quickly attack on of the guards in the middle of the shield wall. His back is unprotected as the guards turned on Cyrus.\n\n\nThe guards only notices you when it is already too late. His eyes widen as your sword pierces his vital organs. The other guards panic as the shield wall disintegrates now the middle guard is killed. Cyrus takes out one of the guards during this brief period. The five remaining guards are slowly retreating, panicked by the death of their comrades.\n\n\nCyrus prepares to chase them, killing all of them. But you stop him: 'stop, let them go. We are still on the sacred grounds of the oracle of Zeus. The last thing we should do is to once again insult the gods.'\n\n\nCyrus appears to calm down. 'You're right sir. Please forgive me, I was too caught up in the fight to think clearly.'\n\n\nSuddenly you see a flash of light in the corner of your eye. You manage to dodge the spear just before it hits you. You turn around and spot the enraged priestess, brandishing a deadly bronze spear. You immediately can see that she is untrained with the weapon.\n\n\nWith a quick feint you manage to disarm her. The priestess mutters curses as her weapon plunges to the ground and you hold your sword dangerously close to her throat. Eventually she calms down and speaks: 'Very well, you have defeated me. But I still can't help you. The gods are not pleased with you and so they have clouded my vision. I am not able to see your future, however, there is another way for you to find a solution for your problems. At the edge of the world there stands a rock, at the convergence of two great streams. There the world of the living and the realm of Hades cross-over. There you will have to sacrifice to the dead, for in the underworld a great seer resides, Teirisias is his name. But be careful, other souls will appear, wanting to eat and drink of your sacrifice, but you must fend them off until Teiresias has eaten from it. He will be able to assist you in your goal. I sincerely apologise for my earlier behaviour and I wish you the best of luck for the rest of your odyssey. Farewell.' And with these last words the oracle once again disappears into her temple.", "action_results": [{"action": "And so the journey continues...", "result": "The journey back across the Nile is quite uneventful. However, you do manage to spot some animals that don't live in Greece, like crocodiles and ibises.\n\n\nIt doesn't take many days before you once again reach the Mediterranean Sea. The weather is good, not a cloud in the sky, and the sea has a beautiful blue colour. As you gaze at the horizon you notice Cyrus standing next to you. 'Ah, the Mediterranean, how I've missed it in those bloody Aegyptian lands. Really, you can travel far and wide but you'll never find a sea like this one. But you look troubled sir. Are you troubled about the coming encounter with the dead?'\n\n\n'Of course, I mean are you looking forward to meeting the dead?'\n\n\n'Well, no. But let's deal with the problem at hand first. How are we even going to find that place? I mean, it's not like we have a map or something.'\n\n\n'I was thinking about that too and I have no idea how we are going to find that place. By the immortal gods! How am I able to do this if I don't even have an idea where we have to go!'\n\n\n'I know sir. Look, the sun has already sunk beneath the horizon. Let us go to sleep and think about this tomorrow.'", "action_results": [{"action": "'Very well, I'll see you tomorrow.'", "result": "Your dream that night is flooded with golden light.\n\n\nSuddenly a figure appears within the golden glow. A woman, wearing armor and a spear. You recognise the grey-eyed Athena. 'Noble bard, great teller of tales, I have come before you tonight to aid you in your journey. You have shown wisdom at your encounter with the oracle and I want to reward you. You seek an audience with the dead seer Teirisias, but you don't know where you can find him. Tomorrow fair winds will guide you on your path. However, the gods won't help you anymore if you anger them once again!'\n\n\nShe dissappears once again with this last warning. As your dream comes to an end you hear the sound of strong winds sweeping across the deck.", "action_results": [{"action": "You slowly wake up", "result": "You open your eyes and notice the whole crew working very hard. Everyone seems to be in a tense mood. After you stand up from your sleeping mat you grab one of the crew members by his wrist.\n\n\n'Tell me, what is happening? Why is everyone so tense?'\n\n\n'Well, ehm, sir, I really have to get back to my post, or captain Cyrus will flay me alive.' He is about to leave, but you grip his wrist tighter.\n\n\n'Look, Cyrus won't hurt you, but I will if I don't get an answer soon.'\n\n\n'O...okay sir. Well, a strange storm has suddenly turned up. Our sails are almost ripping and the current is too strong for our rowers to combat. We are at the mercy of the swift winds. However, we are trying our best to fight against these forces of nature.' The crew member now seems frightened. You let go of his wrist and he immediately walks away.\n\n\n'Fools!' you mutter to yourself. 'Everyone listen to me!' you shout across the deck, this seems to catch the attention of the crew. 'Stop fighting against the wind. The gods have blessed us with these fair winds, for they will swiftly take us to our destination. The first person who will defy these orders will be punished by the captain himself.' The crew immediately leave their posts and look around, wondering what they have to do.\n\n\nYou suddenly hear laughing behind you and notice Cyrus walking towards you. 'Traveler, I consider you my good friend, but you are not captain of my ship and my crew. I don't mind you giving advice to my crew or helping them with their work, but please, don't order them around. My authority will be undermined and I might have to copy some behavior from the former captain.' He winks at the last sentence. 'Alright you scum, you heard our guest. Everyone who tries to steer our ship or to hinder it in any way will be thrown will immediately be released from service. And there is no place on this ship for traitors.'\n\n\nHe turns to you once again. 'They are good people, but they still are mercenaries. Turn your back on them and you'll end up with a knife in your back. But why would we have this gloomy mood? Come on, let us... What the... What did I just say you ignorant nitwit?' You look around, trying to find the person Cyrus is shouting at. Then you spot a young crew member, who may just has reached adulthood, holding a oar. Cyrus grabs the oar from his hands. 'Let this be an example for everyone who defies my orders!' He lift the oar and lets it come come down on the back of the young man, repeating this motion over and over again.\n\n\nTears begin to well up in the eyes of the poor boy. 'Please sir, I was just frightened. I swear I'll never do it again.' Cyrus doesn't seem to take any notice of the boy and keeps hitting him with the oar. While you watch this process you shout at Cyrus:", "action_results": [{"action": "'Stop it at once, I think you have set enough of an example now.'", "result": "Cyrus seems impervious to your comment and he keeps on hitting the poor boy.\n\n\nYou can't stand the sight of your friend hitting the boy any longer and so you step towards Cyrus and hit him in the face with your fist. Like he wakes up from a waking dream, Cyrus comes to his senses. 'I'm sorry, I didn't know what I was doing. The gods must have blinded me. I am so terribly sorry.' His cheeks redden as he apologizes once again to the boy and retreats to his quarters.\n\n\nOnce everyone fully grasped what just happened, a man approaches you. You guess he is a member of the crew, although you have never seen him, and a strange sense of authority hangs around him.  While you observe the strange man he speaks to you:\n\n\n'Well done mortal. You have shown compassion for a person in need. You have regained the favour of the gods. But the warning of my daughter, the owl-eyed Athena, still stands. Help your fellow men and respect the gods, or you, and the rest of the Greek world shall be destroyed.'\n\n\nYou are briefly distracted by the cries of a nearby bird, but when you turn back to the stranger he seems to have disappeared. Who was this man?\n\n\n ", "action_results": [{"action": "The rest of the day is uneventful.", "result": "Days pass by and Cyrus slowly regains the confidence of the crew. The days pass by without any notable events. You enjoy the calm waves and the fair winds that carry you and guide you on your journey. You marvel at the animals that populate the vast, wine-coloured ocean and the wide skies. During these days you get better acquainted with the crew and you start to feel like you're on a holiday.\n\n\nBut then the skies grow darker and darker. The animals disappear and the moral of the crew grows sadder and darker. A week after you left Thebes you finally reach the place where you can consult the dead seer Teiresias. You ask Cyrus to fetch food from the cargo hold, to offer to the souls of the dead. With Cyrus and a couple of crew members in your rear and the food in your hands you set foot upon the strange island.\n\n\nThe air is dead silent, not a sound is heard apart from the easy wind. A chill creeps up your spine as you look around the barren land. Not a living thing appears in your vision, not even the lean trees or the though shrubbery survive in this harsh place. Silently and in anticipation you dig a shallow hole in the sand. You take the food and mix it with some red wine. Not long after you call upon the dead you hear a sorrowful moaning spreading through the air. A cold wind sweeps across the barren island and the crew members behind you shiver. A sense of fear and despair spreads across the hearts of the men as the souls of the departed rise from the realm of Hades.", "action_results": [{"action": "Suddenly, pale men and women rise from the ground...", "result": "Men and women with pale, blood-drained faces rise up from the realm of Hades. You hear the crew members behind cower with fear and retreat to the ship. You notice that only Cyrus remains behind.\n\n\nThe souls immediately close in on the sacrifice. With a flash you remember you can't let the other souls eat of the sacrifice until Teirisias has dined. You quickly pull out your sword.\n\n\nThe souls of the deceased keep their distance for a moment, but they still slowly creep up to the sacrifice.\n\n\nWith the greatest effort you manage to keep calm as hundreds of souls encircle you. Tightly clutching your sword you notice that the spirits of the dead keep creeping closer to you.\n\n\nThe sight of their hollow eyes and pale skin makes you despair. As the cold inhabitants of the underworld encircle you you drop your sword, waiting for their cold hands to drag you to the realm of Hades.\n\n\nSuddenly a golden light illuminates the island, startling the ghosts and filling you with the golden glow. You feel as if the goddess Athena has taken away the fear from your limbs and with a renewed courage you storm the bewildered souls.", "action_results": [{"action": "A fight is inevitable", "result": "Ghostly images of dead soldiers appear before you, their swords drawn.\n\nYou plunge you sword into their chests, but to your horror you notice that is of no use against the dead. Only briefly halted by your attack, the ghostly soldiers continue their attack. As you block their icy swords you feel like your energy is being drained.\n\nWeakend by this sudden loss you let your guard down and one of the soldiers manages to slash you across your chest. Luckily for you it is only a shallow cut and you are able to carry on your fight. Ignoring the stinging pain you...", "action_results": [{"action": "Boldy continue your attack", "result": "Gathering all your strenght you rush forward, towards you ghostly opponents. The souls try to strike youwith their swords, but with a quick move of your sword you manage to deflect their blows. As the spirits are recovering from the sudden move you swing your sword at them. Even though they manage to block your blow, the sheer force of the impact shatters their swords.\n\nAfter this the souls of the deceased soldiers quickly retreat. Although the souls of the dead have no physical body, their bones, muscles and flesh are all destroyed by the all consuming fire of the funerary pyres, they still have great respect for the valour and courage of the living.\n\nPanting, you shout at Cyrus: 'Cyrus, can you see Teiresias yet?'\n\n'Not yet, but I... Oh, wait there he is, he has almost made it to the sacrifice.'\n\nYou look in the direction Cyrus points at and you see the old and wise Teiresias. With a large swing of your sword you repel a couple of souls that tried to sneak up on you. After a couple more swings Teirisas finally reaches the sacrifice. After he eats and drinks from the sacrifice he immediately changes. The pale look disappears from his face and he begins to seem aware of the world around him.\n\nThe old man approaches you. 'Thank you, brave-hearted Greek. Your sacrifice has opened my eyes once again. Now please tell me, why have you, a mortal, come here to the realm of Hades?'\n\n'I have come to seek your guidance, o wise Teirisias. The Greek city states are on the brink of civil war. Only your advice can save my homeland.'\n\n'I see. Since you have given me sacrifice I shall offer you guidance. I see a great palace in the land of the Spartans. I see a king, betrayed by his courtiers and a great fire spreading through Greece. A darkness is spreading through the lands, but in this darkness I see a light. He will endure much hardship on his travels, but he is the one who is able to bring peace to the land of the Greeks. This is all I can offer you. Now go, you are running out of time!'\n\nWith these last words, Teirisias and the other souls depart once again to the realm of Hades.\n\nCyrus approaches you. 'Well, that was quite the experience. I've overheard some things that Teirisias said. It sounds to me like the solution to your problem lies in Sparta.'\n\n'Yes, I thought so too. Set a course for Sparta. Let's hope this journey is almost to an end, like Teirisias said: we are running out of time.'\n\n ", "action_results": [{"action": "But you are still a long way from Sparta...", "result": "A rough wind beats against the ship as it makes it way to Sparta. The unending torrents of rain spoil even the food that's stored below deck. The moral of the crew is on an all-time low as the last of the drinking water is wasted as the last jug of drinking water is thrown overboard by a large wave.\n\nExhausted by days of hardship and famine at seas, you reach an unknown island. From the deck of the ship you spot flocks of sheep jumping around the landscape and where there are animals, there's also water. You have a sloop prepared and head of to the shore with Cyrus and seven other men. 'Okay men, we have to collect as much food as possible, two of you are going to look for water. Be on your guard, remember, we are on an unknown island.\n\nA short time later the crew assembles on the beach, bringing a couple of goats, baskets of vegetables and fruits and sheep and enough drinking water for several weeks. As you investigate the day's harvest you are approached by a crew member. 'I'm sorry to interrupt you sir, but one of my friends thought I should tell you about something. While foraging for food we came across a large cave. We believe that it is inhabited, since it has a door and makeshift pens for animals. I don't know if this is of any interest to you, but we just thought that you might want to know.'\n\nHearing the words of the sailor you mutter to yourself:", "action_results": [{"action": "'Interesting, let us go to the cave. I would like to meet the inhabitant.", "result": "You order one of the crew members to fetch a sack of wine as a meeting gift for the inhabitant of the cave.\n\nTogether with Cyrus and seven men you make way to the large cave. When you get close to the cave you wonder at the makeshift pens, although there is no signs of the animals. Although the construction seems terribly shaky, you notice that it is more stable than it seems. But your biggest surprise comes when you step over the threshold of the ''house''. On the walls there are racks and shelves filled with cheese. Baskets of fruit litter the floor of the cave and buckets of milk fill one side of the cave. Whoever lives here, he is either very wealthy or very hungry.\n\nAlthough it is against your better judgment, you and your men take some of the cheese and drink some of the milk. After the scrumptious meal you hear thundering footstep closing in on the cave. Fear grips your heart and the hearts of your men as you imagine what kind of terrible beast produces such sound. You quickly hide in the shadows at the back of the cave, awaiting the inhabitant of the shelter.\n\nThen, the owner arrives. A large foot enters though the entrance, followed by a huge leg. A man, as large as three grown men, enters the cave. As you examine the stranger more closely you notice he only has one eye, right in the middle of his forehead. He is followed by dozens of sheep and goats. After he places the male animals into the pens outside the cave, he rolls a huge stone in front of the doorway, well there goes that escape route. Luckily for you, he doesn't seem to miss the cheese and milk that you took.\n\nToo afraid to approach the creature, you watch him care for his sheep with loving care. He carefully milks the animals. Afterwards he feeds them. As the huge man takes a seat on a flat rock you finally dare to step out of the shadows.\n\n'Greetings noble host. I would like to introduce myself to you. I am a humble bard from the city of Athens, sent on a mission by the gods themselves. I have traveled far and wide before I came here with my men, and we have faced many perils. I'm sorry to tell you, but as we awaited you return we took some cheese and some milk. I'd like to ask you if you could give us some supplies for our way back, after all it is our right, since we are your guest.'\n\nThe huge man examines you closer, scanning you from your head to your toes with his giant eye. 'Well, great bard, let me first welcome you to my home and let me thank you for your company, you see it is quite lonely here on this island. You mentioned you came here with your men, where exactly are they?'\n\n'Some of them are here, o noble host', and your men appear from the shadows 'but the rest of my crew is at the beach.'\n\n'I see. And may I ask how you reached our island. After all, the wide seas encircle it and you would need a well build ship to come here.'\n\nYou become quite suspicious of your host and so you answer him: 'our ship was wrecked at sea by high waves and strong winds. After our ship was completely wrecked by the god of the seas, we were thrown ashore on your island.'\n\n'Well, you're lucky that you ended up here and not on some uninhabited island. Please, make yourself at home, I was about to dine and you, as my very honoured guests, must join me.'", "action_results": [{"action": "Dinner is served", "result": "After he has spoken these words with his malicious heart, he picks up two of your men, like young dogs, and smashes their heads against the floor. The contents of their skulls wet the cold, dirt floor. After this atrocious deed he cooks your men and prepares a meal with them. Then he consumes them, their flesh, their inerts and their bones, full of marrow.\n\nAt this sight you and your men heave your arms to Zeus, crying. Desperation grips your hearts.\n\nAfter his huge stomach was filled by this meal of human flesh and he drank some of the milk from the buckets, he laid himself to rest between the sheep in the cave.\n\nWhile he is sleeping you conceive the plan to, after you pulled your sharp sword from your thigh, stab him in his chest, where the his liver is positioned. Slowly, the plan begins to form in your head.", "action_results": [{"action": "Quickly, execute your scheme", "result": "You slwoly approach the giant man, careful to produce as little sound as possible, afraid to wake him up. You gently grope across his chest with your hands and when you finally have found the right spot you draw your sword. Solemnly, as if you are offering sacrifice to the immortal gods, you plunge the blade into his chest.\n\nA river of red blood gushes out of the wound. The creature opens his eyes and all that they portay is fear and pain. You qioetly back away from the cyclops as he seizes his final death throes. You and your men rejoice at the sight of the slain giant and the sense of despair leaves your hearts.\n\n'Let's get out of this evil place'.\n\nWith these words you guide your companions through the dimly led cave, to the exit. As you reach it you remember that your  host has blocked the exit with a huge stone, not even twenty-two carriages with four wheels could move from it's place. No matter how much you try to move it from his place, no matter how hard you pray to the immortal gods, the stone doesn't move.\n\nThe final days of your life are filled with misery, locked within the cave the remaining crew members become mutinous, blaming you for all their troubles. After a short fight only you and Cyrus remain in the cave. Although your head is filled with plans you can't think of a plan to get out of your cold, dark prison. As a last resort, you pull out your sword. The last thing you see on this earth before your vision grows red is a golden flash of light. Was this misery avoidable?", "action_results": []}, {"action": "Wait, think about this a little longer", "result": "While you think about your plan to murder your host a thought comes into your mind. After the giant man entered the cave he blocked the exit with a high, immensly huge stone, not even twenty-two cariages with four wheels could move it from it's place. If you killed the cyclops now, there is no possible way for you to leave the cave.\n\nSighing, you and your men await the radiant dawn.", "action_results": [{"action": "The radiant dawn spreads her veil of red...", "result": "The following morning, the cyclops awakes. After he milks his sheep he prepares another meal, with two other companions of yours. After he finishes his dinner he drives his animals outside the cave. Afterwards he picks up the stone and puts it once again in front of the entrance, as easily as one closes a quiver with a cover.\n\nInside the damp, cold cave you you check your surroundings, devising a plan to bring demise to your one-eyed host, to punish him for his cruelty and to bring glory to Athens. Near one of the walls of the vaulted cave lay a pole, freshly cut by the Cyclops, which he uses to prepares fires for cooking when it's dried. It is about the size of the mast of a small ship. After finishing a sharp point to the pole you stick it in the glowing embers of his fire, to harden it. After the pole is sufficiently hardened you hide it in a pile of droppings in the back of the cave, a pretty big pile.\n\nThat evening your host returns. After he drives his cattle into the cave he once again seals of the entrance of the cave with the huge stone. Then he cooks two more men, now there are only you, Cyrus and one of the crew members remaining.", "action_results": [{"action": "Now is the time, strike!", "result": "As your host is occupied with his meal you quickly pull out the pole from the droppings. Wobbling beneath the weight of the large piece of wood you try to sneak up on the dining giant. However, he notices that something is wrong and he turns around, with a leg from one one your men still in his hands.\n\n'What are you doing? Are you really such cowardly men?'\n\nHe throws the limb of your crew member away and stands up from the cave floor. Frightened, you drop the pole and try to run away, only to be blocked by the giant stone in front of the exit. The cyclops approaches you with thundering footsteps. Fear grips your hearts as the last remaining crew member is smashed to death against the huge stone. You draw your sword in a futile attempt to stop the giant from causing any more harm.\n\nThe cyclops laughs as he crushes Cyrus with a single sweep from his arm. Enraged by this sight you charge the giant with your drawn sword, oblivious to the rest of the world.\n\nThe next thing you feel is a sharp pain shooting through your body as almost every bone is your body is crushed beneath the force of the cyclops's blow. A golden light fills your vision as your soul enters the realm of Hades.", "action_results": []}, {"action": "Wait until he finishes his meal", "result": "You watch in horror as the frighening giant finishes his macabre meal. After he wipes the last bloodstains from his chin you approach your host with the sack of wine you took as a meeting gift.\n\n'Most noble host. Please accept this peace offering.we brought with us as a meeting gift, it will taste good after your meal of human flesh. We came here, hoping that you were a kind and generous host who could help us to reach the island of Sparta. But why, do you think, shall people visit this island once again, after all the misery that you put us through.?'\n\nAfter you speak this words, the cyclops takes the sack of unmixed win and takes a large swig of it. He obviously likes the wine and answers:\n\n'This wine is amazing. Don't take me wrong, even in the lands of the cyclopses the gods send the rain from the skies which make the grape vines flourish, but this wine is like ambrozia, the nectar of the gods. Please, tell me who you are, noble guest.'\n\nAfter these words he once again puts the sack to his lips and he empties the sack of wine into his mouth. The wine immediately takes effect. Immediately you answer him with the winged words:\n\n'You ask me who I am? Well, I'll tell you. My glorious name is Nobody. Nobody is the name that my parents gave me and Nobody is the name that I am known by.'\n\n'Well then nobody. In exchange for your gift of wine, I shall give you a gift of my own. You will be the last one of your company that I'll eat. Let that be my gift to you. Yes, let that be my gift to you...'\n\nAnd with these last words the cyclops falls asleep. You and your companions rush to the pile of droppings and retrieve the sharpened pole from underneath. You quickly rush to the sleeping giant and stick the pole into his single eyesocket. You keep twisting the pole until the red blood flows from the wound.\n\nAn agonizing roar bellows through the vaulted cave. Frightenend, you and your companions run to the back of the cave. The cyclops stands up from the floor of the cave, still screaming and roaring, calling for the help of the cyclopses that inhabit the surrounding caves...", "action_results": [{"action": "A family visit", "result": "With a great effort he manages to reach the entrance of the cave. He uses his tremendous strength to remove the stone blocking the entrance. Almost instantly you hear thundering footsteps closing in on the cave. Booming voices speak outside: 'Polyphemos, what happened to you? Why are you disturbing the divine night with your cries for help? Has someone with great strength hurt you, or were you tricked by some malevolent scheme?'\n\nYour host, the brutish Polyphemus, answers his brothers: 'My brothers, Nobody is hurting me with his schemes, there is no violence.'\n\nThe others answer with the winged words: 'But if nobody is hurting you and you are there all alone, then why are you Disturbing our slumbers? If a disease or other affliction from the gods struck you, it is of no use to shout, for you can't take actions against the immortal Zeus, the cloud-gatherer. Try praying to our father, Poseidon, the god of the seas.'\n\nAfter they spoke these words his brothers left the grounds of the godlike Polyphemus. Smiling, you see how the cyclops, while feeling his way across the cave, positions himself next to the exit of his cave.", "action_results": [{"action": "Now is your chance, dash through the exit", "result": "You and your remaining companions cautiously walk towards the exit of the cave. You heart is pounding within your chest, one wrong move, one noise may be enough for the cyclops to determine your position. Carefully avoiding the sheep you manage to reach the exit, guarded by the savage giant.\n\nPressing your body against the wall you try to sneak past him, holding you breath. Unfortunately for you, the cyclops inspects everyone, sheep or guest, that tries to leave his home. Centimeters before you escape your dreadful host he grabs you with his giant hands. An evil grin appears on his face.\n\n'Were you about to leave already, cowardly Nobody? I was just about to thank you for the injury to my eye. Were should I begin, shall I disembowl you or should I rather... ARGH!'\n\nA cry of pain slips past the boundaries of his teeth as Cyrus stabs the hand that is holding you with his sharp, bronze sword. The cyclops' grip on you immediately loosens and you manage to escape his grip. As you try to unsheathe your sword you notice the huge arms of the giant flailing wildy towards you.", "action_results": [{"action": "You quickly jump aside...", "result": "With fear once again gripping your heart you jump aside in an attempt to dodge the arms of Polyphemos. However, the reach of his arm is too great for you evade with just one leap. You are immediately crushed by the brute force with which the cyclops swing his hand towards you.\n\nAs a sharp pain flows throughout your body, a golden light fills your vision. These are the last experiences in this realm before your soul travels to the realm of Hades.", "action_results": []}, {"action": "You quickly throw yourself to the ground...", "result": "You feel the flow of air passing through the space you were standing in just a minute ago, as the giant arm of the cyclops flies wildly over your head. You roll aside as one of his fists fly towards the ground with tremendous strength.\n\nAs the earth shakes under the force of the impact you stand up. You realise that you can't sneak past the raging giant as he block the only way out. You walk back towards the other end of the cave, keeping your eyes on the blind giant as he continues his tantrum. As you reach the end of the cave you shout towards him:\n\n'Blind fool, why are you attacking the tender air? Can you, as the son of a god, not even hit a mortal? You bring shame upon your father and your brothers.'\n\nHe rushes toward the sound of your voice in a blind fury, just as you expected. You quickly run in the opposite direction, towards the exit. The earth trembles once again as the giant body of the cyclops hits the wall of the cave. Leaving a bewilderd giant behind you finally reach the exit of your prison.", "action_results": [{"action": "Free at last", "result": "Blinking in the bright sunlight you stand outside the cave of Polyphemos and your heart is filled with joy.\n\nYou quickly make your way to the beach. As you reach the shore of the island you hear the happy shouting of men. As you look for the source of the sound you see three crew members on the beach. One of them runs towards you.\n\n'We are so happy to see you. After you didn't come back last night we were afraid that you were killed. We wanted to look for you, but the other men were too afraid to come near that strange cave. We were left here with this sloop to wait for your return', he now directly adressess Cyrus 'but pardon me for asking captain, but I thought you and the traveller left with seven men'.\n\n'It's a long story. we'll tell it to you and all of the crew members when we're safely back on the ship.'\n\nAfter telling everyone on board the story of your adventure with Polyphemos, the crew prepares to sail away.", "action_results": [{"action": "You turn towards the island...", "result": "The fury for your fallen companions fills your heart and clouds your mind as you shout towards Polyphemos: 'Foolish cyclops! Did you really think that you could keep me captive! If ever one of the mortal men should visit your island, tell them that a great bard from Athens was the one who injured you! And as they will leave your island too, they shall tell the whole of Greece of me, and everyone will know the name of...'\n\nYour speech is cut short by the lament of Polyphemos:\n\n'Woe is me, for an ancient prophecy is fulfilled. A great seer who lived here a long time ago told me that a Greek would rob me from the light in my eye. A Greek, who is skilled with words and has a noble heart. I always imagined him to be a true hero, with great strength and fitness. But now this puny wimp, with no strength at all, has blinded me. Not in an honorous fight, but cowardly, after he intoxicated me with strong wine. Come back here, o 'great' bard, so that I may honor you with my hospitality. My father, the earth-shaking Poseidon, will ensure your safe return home.'\n\nYou quickly answer him:\n\n'Did you really think that I would fall for such foolish words. But if you want, I'll come back to you, and then I won't only take your eye, but your life too. Maybe you should ask your father to give you a new eye, or better yet, you should ask for two. Maybe then, you'll be able to survive a visit from the next guests.'\n\nThe booming voice of Polyphemos answers you:\n\n'Hear me, o earth-shaking father of mine. If I truly am your son, please answer my prayer. Make sure that this puny coward never reaches the destination of his travels. Make sure that his ship sinks and that he suffer horrible pains before he dies. However, should his fate be to reach his destination, then make sure that he arrives there on someone else's ship, after losing his men, and wrecked by the seas. And after he reaches this place, let him suffer misery there as well.\n\nAfter the cyclops falls silent you turn back to the crew. 'Alright men, let's get out of this place.'\n\nNot long after you spoke these words, a huge boulder lands next to the ship. As fast as possible, the ship leaves the island of the cyclopses.", "action_results": [{"action": "At sea again", "result": "For days the endless wine-colored sea has surrounded your ship. No island has come into view since you left the island of Polyphemos. As the sun disappears behind the horizon to reveal the starry sky you once again sink away into a deep, restless sleep.\n\nYou are alone in an endless ocean, drifting on the waves. The skies above are filled with violent thunderclouds and terrible winds are sweeping across the sea. Far away, almost behind the horizon, an island is visible, a single light illuminates it.\n\nSuddenly the bright-eyed Athena, the daughter of Zeus, appears in front of you, walking on the loud-roaring waves. 'You have brought great honour upon yourself, son of Athens, but with that honour comes misery. You have mutilated the son of Poseidon, the god of the sea, and now he carries a heavy wrath. With your brave deeds you have regained your favor with some of the gods so heed this message well: it is your fate to complete this journey, but you will do this on your own. The seas will swallow your vessel and your men will drown. However, the daughter of Atlas will rescue you. Time is running out for Greece.\n\nA flash of lightning awakens you from your deep slumber.", "action_results": [{"action": "The skies roar as thunder rains down on the earth", "result": "The dark clouds in the night sky block even the stars themselves. Thunder roars as Poseidon unleashes his wrath upon your vessel. Your men's cries of fear are like a whisper compared to the sound of the waves crashing against your ship. Violent gusts of wind sweep across the deck like raging lions, taking everyone who is in their path.\n\nYou wander across the deck, helpless, trying to think of a way to avert this disaster. Two of the sailors are pulled to their deaths at the bottom of the seas by a large wave, three more are killed by falling debris. The planks of the ship crack and fracture underneath the might of the ocean. The sail is torn apart by the swift winds and a couple of men are caught by it, a moment later it drifts helplessly on the wine-coloured sea.\n\nYou manage to hold on to the broken mast as a large wave clears the deck of rubble and men. You look across the ship and to your horror only a few men are still alive. The moaning of the dying sends chills up your spine.\n\nThe howling winds become more and more violent. With all of your strength you manage to hold on to the broken ship. However, many men can't. You see many of your companions being blown away into the violent ocean. You cry out to the gods, begging them to stop this slaughter, but to no avail.\n\nYou hear a familiar voice next to you. As you turn you see Cyrus battling the winds and the sea. You try to shout to him, to tell him to have faith and to not give up fighting. But even before your words from in your mouth you see Cyrus being dragged of by the winged winds. The world around slows down as you see the horrified look upon your friend's face.\n\nSuddenly a sharp pain fills your head as you are hit by a flying piece of wood. You flash in and out of consciousness as the ship finally breaks beneath the thundering waves.\n\nThe cold ocean surrounds you...\n\nYou are flailing helplessly with your arms...\n\nA body drifts by...\n\nYour hand touches a large piece of wood...\n\nWith your last strength you manage to hold on...\n\nThe ship is nowhere to be seen...\n\nYou are alone...\n\n ", "action_results": [{"action": "The world fades away...", "result": "You are adrift in an endless void.\n\nThe world around you is dark.\n\nThe soothing nothingness takes away your fears, your despair and your sadness. Slowly all of your thoughts about your crew members and your friends fade away, leaving nothing behind but a comforting silence.\n\nEventually even your greatest worries about the fate of Greece are reduced to nothing, you are at peace...\n\nSuddenly a thought comes crashing into your mind with the strength of Zeus' lightning bolts. How can you rest while thousands of people depend on you? How can you rest when the world you know is about to be destroyed?\n\nTwo thoughts are battling inside your head, which one will win?", "action_results": [{"action": "'I am finally at peace. I will stay here.'", "result": "Your worries soon fade away like the rest of your thoughts.\n\nYou close your eyes, relieved that all of your suffering has come to an end.\n\nThe world around you is peaceful.\n\nThe comforting silence, the peaceful void, why leave all of this behind?\n\nHere, in the realm of Hades, your soul is finally at peace.", "action_results": []}, {"action": "'The fate of the world depends on me, I can't rest while many suffer. I have to get out of this place.'", "result": "The bright sunlight pierces your eyes. You can hear the sounds of waves breaking on the shores nearby. As your vision finally focuses you take notice of your surroundings. You are lying on a white beach, nearby the violet sea. Large forests border at the sands.\n\nYou guess this is an island, but how big is it exactly? Is it inhabited, and by who? The memories of your recent visit to the island of the cyclopes are still vividly present within your mind. You try to get up to explore your surroundings, but a sharp pain shoots through your limbs.\n\nClenching your teeth you try once again to stand up. With a great feat of determination you manage to stand up. Shaking with suppressed pain and desperation you mange to take your first step on this new-found land. Then follows a second step, and a third. And then your vision turns red. The white sands of the beach come crashing towards you as exhaustion takes control of your limbs.\n\n''''''''''''''''''''''''\n\n \n \nAs you slowly regain conciousness, you notice that the pain racking your body is fading away. You keep lying on the sandy ground, waiting for the pain to dissipate completely. As you lay there you notice sweet music in the distance, a woman's voice, a song.\n\nFar from his lands and far from his home\n\nA hero turns up, all alone.\n\nHis ship and his friend he lost to the sea\n\nBut now he is here\n\n Alone with\n\nMe\n\nAs this sweet song keeps repeating inside your mind you notice that keeping concious is getting harder and harder. The heavy sleeps once again presses down on your eyelids.", "action_results": [{"action": "You wake up a few hours later...", "result": "'Awaken, valiant hero. You are safe here.'\n\nYou slowly open your eyes and immediately notice that the pain has gone from your body. You feel like you are full of strength, like you could battle the titans themselves without falling.\n\n'I am glad that you fully recovered from your dangerous journey.'\n\nNow you notice the honey-sweet voice which speaks to you. You check your surrounding and see that you are in a vaulted cave, decorated with lavish furniture. Sculptures depicting the travels of Odysseus line the walls of the cave and golden oil-lamps illuminate it. Richly decorated musical instruments lay on a table with beautiful wood carving. A hearth fuelled by cedar wood spreads a pleasant heat throughout the room and fills it with a delightful scent. You only now notice the expensive couch next to your bed and the beautiful woman upon it. She has arms as white as snow and beautiful hair. Her face is caring and her dress is made from the finest silk.\n\nWhile the sight of all this splendour fills your head you ask the mysterious woman: 'noble mistress, honourable host, could you please tell me where I am and what kind of place this is?'\n\nThe woman lifts herself from her couch and speaks to you. 'I am the goddess Calypso, great teller of tales, I found you on my island Ogygia after your ship was destroyed and your crew perished because of the wrath of Poseidon. Here, on my island you will be safe.'\n\n'Radiant goddess, I thank you for your hospitality, but alas, I cannot stay here. The gods have burdened me with a heavy task. Many cities will be destroyed and many people will perish if I will not complete my journey. Please, with your consent, let me build a ship with the trees on your island, please provide me with food and drink, so that I may please the gods by fulfilling my journey.'\n\n'Dear bard, from far you came and far you have to go. I know of your quest and I know the gods approached you, for all the immortal gods are not unknown to each other, even when they live far apart. However, I cannot let you go. Forget your journey and your quest for Greece will fall, no matter what you try. Sweet traveller I will keep you here as my guest until you want to accompany me as my husband. I will bestow immortality upon on you and give you eternal youth, so we may live here until the end of time itself. Forget your worries about your home and the gods. Stay here, with me.'", "action_results": [{"action": "'Fair goddess. You have cared for me in my time of greatest need. You have spoken to me as an equal, as if I am one of the immortal gods myself. Love fills my heart as I speak these words to you: I will stay here with you.'", "result": "The face of Calypso immediately shows a wide smile.\n\n'My dear lover, joy fills my heart at the sound of these words. Are these really your intentions or are they just part of some elaborate plot? Please, promise me by the immortal gods that your heart is truy filled with love.'\n\n'My dear Calypso, by the immortal gods I vow that my heart is filled with love for you. Please, let me live here, by your side so that we may be happy together, until the end of time itself.'\n\n'Traveller, you have no idea how happy you have made me. Many years I have spent here alone on my island. The life of a goddess is not always pretty. Now that you are here my world has suddenly turned bright. I shall grant you immortality and eternal youth. Great bard, forget all of your troubles and doubts. Please, take my hand in marriage, so we may both live together, happy.''\n\n...\n\nMany years pass by and you and Calypso live happily together on Ogygia. You are now immortal and fear or pain are just fading memories to you. You no longer think of your journey or of Greece. Hermes, the messenger of the gods has only once visited your island to tell you that Greece had fallen into civil war.\n\nCenturies pass by until you and Calypso finally decide to leave the mortal realm altogether. You settle on mount Olympus, where the immortal gods all reside. The promises Calypso made you all those years ago were all true: you are both happy together, until time itself ends.", "action_results": []}, {"action": "'Fair goddess, you have cared for me in my time of greatest need and for that I thank you. But I cannot forsake the task the gods burdened me with. I cannot stay.'", "result": "The face of Calypso shows an understanding smile.\n\n'Great bard, in my heart I knew that this was the answer you would give me. But I will not give up my love so easily. I will keep you here on my island until you finally admit that you love me. Please, make yourself comfortable, after all, this will be you house too.'\n\n'Radiant goddess, what words escape the enclosure of your teeth? How can you take me captive here? How can you prevent me from making a raft from these trees under the shadows of the night, when the heavy sleep holds even you in it's sweet embrace?'\n\n'Traveller, how can you be so foolish? Even if you manage to leave my island, how can you survive your passage over the endless seas? What will you eat? What will you drink? Who will protect you from the wrath of Poseidon? You know just as well as I do that you will not reach Sparta alive, even with the help of Athena.'\n\nYou let out a loud sigh as you realise that Calypso is right, you cannot leave, unless you wish to travel to the realm of Hades. As your hopes of saving Greece are slowly shattered you leave the cave of Calypso. On the beach you drop yourself upon the white sands, praying for a miracle from the gods.", "action_results": [{"action": "Days pass by...", "result": "The radiant Eos once again rises to bring light of dawn to the earth.\n\nSeveral days have passed since you washed ashore on the island of Calypso. You are sitting once again on your spot on the beach, gazing at the horizon, wishing for a miracle to happen. Ever since you rejected Calypso she has been trying to seduce you with her sweet words and beautiful promises. She has given you the finest clothes and the best food, but your heart is still filled with worries about Greece.\n\nNo matter how sorrowful you feel here, on this island-prison, you can't help but notice that Ogygia is really an extraordinary place. The most majestic birds make their nests in the large trees that scatter the island and the sweetest fruits grow just within an arms length. The seas surrounding it are full of fat fish and the skies are always blue. However, not a day goes by in which you stop praying to the gods for a sign, a miracle to happen that will bring you to your goal so you can fulfil your journey.\n\nYou suddenly hear the sad voice of Calypso calling for you: 'Noble traveller, please join me in my home. You have a visitor.'\n\nCurious, you make your way to the cave of Calypso. Who, but the immortal gods themselves could make their way to the island of the goddess Calypso?\n\nAs you enter the lavishly decorated cave your attention is immediately caught by an unfamiliar man standing next to Calypso. He wears the hat of a traveller and he carries the staff of a negotiator. On his feet he wears winged sandals. You suddenly recognise him as Hermes, the messenger of the gods.", "action_results": [{"action": "What have the gods to say?", "result": "The sharp-seeing Hermes speaks to you: 'Noble traveller, the gods, who inhabit the wide skies, have spoken to you. You are the one person who can save the Greek cities from the fires of war. You have travelled far and you have accomplished many thing, but your journey has not yet come to an end. Athena, the protector of heroes, has persuaded the council of the gods to send me to this island, to order Calypso to release you. You are now free to go, free to continue your journey.'\n\nYou look at Calypso to ask if this is true, but her face, filled with grief, tells you enough. Her voice, filled with sadness speaks to you: 'Dear guest, Hermes speaks the truth. The gods have ordered me to let you go. But I ask you...no, I beg you to reconsider my offer. Stay here, with me. Forget Greece, forget your journey, stay here with me and be happy. If you knew what the future holds for you you would stay here. You will suffer, even after you reach your destination and the wrath of Poseidon will follow you across the sea. Stay here, be safe, accompany me as my husband, until the end of time itself.'\n\nYour heart is torn between your duty to the gods and the offer of Calypso. Your mind tells you to continue your journey, but your heart tells you to stay here. The gods have freed you and Calypso, even while she is in love with you, has obeyed them. In front of these two deities you have to make a choice that will shape the rest of your life.\n\nYou answer with a trembling voice:", "action_results": [{"action": "'Sharp-seeing Hermes, messenger of the gods, I thank you for bringing the message that set me free. As ordered by the gods I will continue my journey.'", "result": "The sharp-seeing Hermes speaks to you: 'You're welcome, great bard. Now you are free to continue your journey. Remember, the gods are always watching you. You have our blessing.'\n\nAnd with these winged words he departs, leaving you and Calypso alone. You turn to her but she immediately averts her gaze. She doesn't want to speak to you.\n\nYou leave the cave, leaving a weeping Calypso behind.\n\n...\n\nThree days later your ship is finally complete. You are standing on the beach, admiring your ''handy work''. It has become a small vessel, barely large enough to hold both you and your supplies. But it will suffice for the journey ahead, it's not like you've got a crew to worry about any more.\n\nThe radiant Calypso approaches you with her arms filled with food and water. 'My dear hero, sadness fills my heart because of you, for I have seen your future. You will suffer many suffering and you will feel great pains. But you must not give up. I know you are able to fulfill your destiny and save Greece. Please, take these supplies, so that you may reach your destination. I will always be here for you, on my island. Good luck and farewell.'\n\nFeeling a little guilty for all the sorrow that Calypso has been though these last days, she had been weeping for days after you decided to leave, you answer her: 'Radiant godess, I am sorry that I could not stay here, but the gods have ordered my departure. I hope that your love will be answered some day, by a noble man, I truly do. Before I go I wish to thank you once again for all the care that you have given me, but now I bid you farewell.'\n\nAnd with these last words you turn away from Calypso and push your boat into sea.\n\n ", "action_results": [{"action": "You once more continue your journey...", "result": "As the sun sinks beneath the horizon you look behind you one more time, the island of Calypso has vanished beneath the horizon, not a single light is visible any more. As the stars once again appear in the wide skies you go to sleep.\n\n\nThe endless ocean surrounds you, but the waves are violent. Heavy storms sweep across your ship. With a crashing roar a wave shatters the planks of your ship, leaving you to drown in the violet-coloured sea. Suddenly a figure appears in front of you, walking on the waves.\n\n\nYou call out to the barely visible figure: 'Bright-eyed Athena, please aid me. The violent sea is about to claim my life.'\n\n\nHearing your call for help the figure walks towards you. As it stands in front of you you suddenly recognize the earth-shaker Poseidon, the god of the seas. With his face filled with wrath he speaks to you the thundering words: 'Cowardly bard, shame of Athens, did you really think you could escape me? Did you really think I would ever forgive you for the blinding of my son, the godlike Polyphemos? You should have stayed on the island of that witch Calypso.  Mark my words, you will never reach Sparta. You will die a horrible death while Greece burns to ashes.'\n\n\nViolent thunder clouds begin to form over your heads as Poseidon speaks these words. As he finishes his speech, lightning strikes the spot were you are drifting helplessly in the ocean. The next moment you wake up with a violent head-ache.", "action_results": [{"action": "The wrath of Poseidon", "result": "The seas around you howl with rage as violent gusts of winds cause the seas to form huge waves. Your already weak ship cracks and breaks under the strain of the violence of the seas.\n\n\nHorrible memories of the day you lost your friends flood your mind as you once again find yourself in the cold waters of the dark sea. You struggle to keep afloat, to stay above the waves, but your strength fails you. You almost choke as the icy waters of the sea fill your lungs, preventing you to breath, trying to send you to the realm of Hades.\n\n\nDuring your epic struggle against the roaring ocean, you see a shining figure on the distant waves. The figure approaches you, has Poseidon come to gloat over your dying body?\n\n\nAs the figure has almost reached you you are blinded by a nearby flash of lightning.\n\n\nAs the icy water of the deep ocean engulfs your head you begin hallucinating.You hear the voice of the owl-eyed Athena, the protector of heroes: 'Rest now, great storyteller, all will be well.'\n\n\nAlthough you are fairly sure your mind is playing tricks on you, you feel comforted by the voice of the goddess. You close your eyes and embrace the cold darkness washing over you. Maybe you can finally rest after your long journey.", "action_results": [{"action": "All is quiet...", "result": "The darkness around you is lifting.\n\n\nYou are having a deja vu.\n\n\nAm I back at Calypso's island?\n\n\nNo, this feels different.\n\n\nI'm floating, moving on the waves.\n\n\nYet, I feel the soft ground beneath me.\n\n\nDistant voices... Am I in Hades?\n\n\nI can hear the wind blowing in the distance.\n\n\nBut why can't I see anything?\n\n\nCan't move either.\n\n\nHow did I get here?\n\n\nAh, my head, it feels as if I've been hit by Polyphemos.\n\n\nHmmm, the darkness is returning.\n\n\nMaybe I'll go back to sleep...", "action_results": [{"action": "Zzz...", "result": "You wake up, and quickly fall back asleep, a couple of times more. However, you never manage to get to know more about your surroundings apart from small, incoherent impressions.\n\n\nBut eventually you manage to gather enough strength to stay conscious for a longer period of time.\n\n\nAs you open your eyes with much effort you are amazed with what you see. You are aboard a ship, about medium-sized by the looks of it. You are lying in a ornately decorated bed which in itself must cost more than what you earn as a bard in an entire year. An array of bronze objects are visible on a nearby wooden desk: astrolabes, scales, even a small scale model of the solar system. Whoever owns this ship is either a trader or a scholar.\n\n\nYou hear stumbling in the room next to yours. The door separating them opens to reveal an elderly man, with grey hair wearing clean, white robes. When he speaks he sounds distracted, as if the affairs of the mortal world are not important enough to catch his attention. 'Welcome, stranger. I can see the questions in your face and I will answer them. My name is Angellios, and I am a priest of the bright Apollo.You might want to know why you are on my ship. Well, the short answer is: because I found you. The long answer is: the gods have sent me a vision, they told me to rescue you from the cold embrace of Poseidon and bring you to Sparta. To be honest, you are one of the few people I let aboard my ship. I use this vessel to completely separate myself from the civilized world, so I can completely focus on my study and the worship of the great Apollo. But since you have regained your strength it is almost time for us to say goodbye. We arrived at the docks of Sparta three days ago and too be honest, those have been three days too much.'\n\n\nAlthough he obviously tries to hide his annoyance of human contact, you reply that you realize that you have been a burden for Angellios and that you thank him for all his good care. You decline his offer of a strange meal consistent of an array of strange mushrooms and disembark after another thorough thank-you.", "action_results": [{"action": "Sparta... At last", "result": "You take a deep breath as you walk along the docks of Sparta. You have finally reached your destination, after many hardships and the death of your friends you've finally made it. Your moment of happiness is short-lived though, as you realize your real task has only just begun. Someone somewhere in this great city is going to be responsible for the civil war that will engulf Greece, and it is your task to stop it, Your short moment of happiness is thus replaced by desperation, you have absolutely no idea where to start looking.\n\n\nYou walk across the harbor, watching the ship come and go across the busy river and the people walk by. When you realize you won't find anything lingering here you walk to the city. You don't feel at ease in the warrior city. Sparta and Athens are almost complete contrasts of each other. Athens is a centre of art and philosophy and houses some of the most beautiful buildings in Greece, while the whole of Sparta is dedicated to the art of warfare, it's houses almost completely devoid of any decorations. While Sparta controls a large part of the Peloponnese it's theatre is smaller than most provincial towns and the city watch is acts ruthlessly against anyone who breaks the law. The Spartans themselves don't even work their own lands, the peoples they conquered have to work for them as semi-slaves.\n\n\nAfter an hour or so of exploring the city you decide to call it a day and enter a tavern. The dimly lit place if filled with people from all over Greece, traders from Syracuse, a couple of actors from Athens, you think you've seen them perform back in Athens once, in the back are some Spartan soldiers and half-hidden behind them are seafarers from Crete, pirates by the looks of them. As you order your drink you can't but help overhear a conversation:\n\n\n'Well, it has been a couple of years since the king died, it's about time she remarried, I mean, she isn't even past childbearing age.'\n\n\n'That's true, but Nelei musn't marry any one of her suitors. She needs a strong husband, one who can resist Akakios. Although Nelei is queen, she is still a woman and as such has nothing to say in politics, and her son has not yet come of age.'\n\n\n'What's wrong with Akakios, he's only a council member isn't he?'\n\n\n'Yes, but one who is bribing about half of the council of elders, and the other half consists of senile old fools.'\n\n\n'And yet most of those councilors are Nelei's suitors.'\n\n\n'Which is exactly my point. Everyone knows Akakios wants to steer towards war with the other city states.'\n\n\n'And why is that such a problem, everyone knows Sparta is the mightiest city state in the whole of Greece?'\n\n\nYour heart is pounding, this is the reason of the civil war, one of the councilors will marry the queen and as a result Sparta will go to war. You throw some coins at the innkeeper and rush out of the tavern, leaving baffled customers and a baffled innkeep behind.", "action_results": [{"action": "Continue...", "result": "The royal palace isn't exactly what you were expecting. True to the nature of the Spartans its decorations are sober, not much different from your average estate of a wealthy merchant in Athens. Fresco's depicting both war scenes and scenes of craftsmen adorn the outside walls. Cypresses shield most of the palace from sight, but you can still see that it's walls are much thicker than your average mansion. Its sturdy gate is made of iron, with gilded tips on top. Two hoplites, Greek spearmen, guard the gate.\n\n\nAs you approach the gates of the guardsmen approach you, pointing its spear at your chest. 'Halt, foreigner, what is your business here?'\n\n\nYou answer him as calmly as possible: 'I am a bard from Athens, I request an audience with queen Nelei.'\n\n\n'You can't see the queen', he rudely replies.\n\n\n'But it's important, I need to...'\n\n\nThe guard smashes you in the head with the flat end of the spearhead. You feel a little of blood run down your cheek. 'Now, do I haev to make myself any clearer or will you leave now?'\n\n\n'I would if I could, but I really need to see the queen, it is a matter of...'\n\n\nYou are rudely interrupted as the guard shoves you to the ground. 'Wrong answer.' He raises his spear, ready to thrust it into your chest and ending your life. Your life flashes before your eyes as you search desperately for a way to prevent the bronze spearhead from sending your soul to Hades. however, it is to no avail. the guardsman grins sadistically as he sees you cowering on the floor, he takes one, deep breath and...\n\n\n'Stop!' One word, yet it means the difference between life and death, your death. A woman's voice: sweet, yet filled with authority.\n\n\nYour heart is pounding loudly in your chest and so much blood is flowing through your ears you can hardly hear a thing. A woman walks through the gates, dressed in a simple, yet elegant white robe, a small golden circlet is resting upon her long, brown hair. Her face is soft, yet evokes respect. She yells to the guard, her hands reveal her anger. The guard looks like he will react, but then he decides to walk back to his post. The woman walks towards you, helping you back on your feet.\n\n\nYou see her lips forming words, yet you can't hear a thing.\n\n\n'Excuse me?' you yell louder than you meant to.\n\n\n'I asked you: who are you?'\n\n\n'Oh, excuse me, my heart was pounding so loudly I couldn't hear what you were saying. I am a bard from Athens, sent to request an audience with the queen of Sparta.'\n\n\n'Then you are in luck. I'm Nelei, queen regent of Sparta.'\n\n\n ", "action_results": [{"action": "Nelei leads you to her quarters...", "result": "The queen has led you into her private quarters, hardly the usual place for an audience. A couple of ornate wooden chair are placed around a roaring hearth fire. The remains of a meal are visible on a nearby table, you see two half-emptied plates and two empty bronze cups. A loom is tucked away in a corner, showing a half finished burial cloth. Apart from some tapestries the walls are barren.\n\n\n'Please, take a seat. I apologize for the sober setting, this isn't the place where I receive my usual visitors. Yet, you are no ordinary visitor, aren't you?'\n\n\n'You are right, my lady, but how did you know?'\n\n\n'This may sound strange, but my late husband came to me last night. He appeared in my dreams. He told me a great danger threatened me and my poor son, Kourio. You see, dark clouds are gathering above Sparta. My husband has died, leaving me alone to raise our only child, his heir. I believe he was murdered. You see, the council of elders, the advisors of the king, want us to declare war on the other Greek city states, claiming the supremacy over the whole of Greece. My husband was opposed to this. I believe Akakios, an evil man and the most influential of the elders was behind his assassination. Ever since my husbands death he has tried to persuade me to marry either him or any of the other elders. However, though I am a woman, I am no fool. Akakios wants the sole rulership over Sparta and I think he'll murder me and my son if that is was it takes. I only managed to win some time by telling my suitors I wouldn't be ready to marry anyone until I finish the burial cloth you can see over there. It's meant for my husbands fater, who has fallen gravely ill. The whole day I would work on it, only to undo all that work each night. But now the suitors found out about it and are demanding a marriage.'\n\n\n'That is a sad tale indeed, noble lady, but it does not explain how you knew of my coming.'\n\n\n'My husband told me a messenger was coming, sent by the immortal gods themselves. One who, despite his humble origins, would be able to put a stop to Akakios' malicious plans and bring peace to Sparta. It''s hard to explain, but when I saw you I knew you were the one my dear husband meant.'\n\n\n'You are right, I was sent by the gods to prevent a civil war between the Greek city states. However, I do not have the power, nor the knowledge to interfere in the politics of Sparta.'\n\n\n'Then we'll just have to work together', a youthful voice speaks.\n\n\nYou turn around and see a youth entering the room, about fourteen years you guess. He has the looks of his mother, the same brown hair and brown eyes and a fair complexion.\n\n\nNelei speaks to you: 'May I introduce you to my son, Kourio, rightful heir to the kingdom of Sparta, direct descendant to the great king Menelaos. Kourio, this is the envoy your father told me about.'\n\n\n'Then this must be a sign that we will finally be able to put a halt to the evil plans of Akakios. Together, we will be able to figure something out, a ruse, to eliminate these pests from our grand city once and for all.'\n\n\nThe three of you deliberate all night and eventually you come up with a plan that will hopefully prevent civil war.", "action_results": [{"action": "As the dawning Eos appears once more in the morning sky your plan comes into action.", "result": "As planned, all of them showed up, every single one of them. Why wouldn't they come, such a chance only presents itself once every lifetime. You and Kourio are sitting in a dark corner of the courtyard, listening while Nelei addresses the suitors. With a steady and authorative voice she speaks: 'My dear guests, I have summoned you to inform you of my decision: at the end of this day I will marry one of you.'\n\n\nYou watch the crowd, almost the whole council of elders is present. Kourio points out Akakios, sitting at the front of them. To you his face looks most like that of a rat, he has a big nose and has little eyes, heavy eyebrows cover most of his forehead. He smirks with his small mouth.\n\n\n'I have prepared a contest. The one who wins it shall become my new husband.' She grabs an ancient looking bow. 'This is the bow of my late husband, passed down to him by his father and his father's father before him. He had an original way to practice with this bow.' She points at six axe handles buried in the sand. 'The one who is able to shoot an arrow through all the six rings of these handles with one shot, like my late husband used to do, I will marry.'\n\n\nYou hear mixed comments coming from the crowd: 'Puh, is that everything, that's easy.'\n\n\n'It looks hard.'\n\n\n'I want to go first.'\n\n\nAs the contest commences you and Kourio watch anxiously, hoping and praying that everything will go as you planned. Suitor after suitor tries to win the contest, but none of the can even draw the string, let alone shoot an arrow with it through the rings. You laugh as Akakios tries again and again with a reddening face, but even he fails at this test.\n\n\nWhen most of the suitors have had their go Akakios yells furiously: 'This is ludicrous, what are you trying to proof, woman, that we are not as good as your late husband? Well, too bad, but he died. You are going to marry me today or both you and your son will die. Do you understand? Huh?'\n\n\nKourio steps out of the shadows and walks towards his mother. 'My dear mother, would you mind letting me have a go at it? Just to proof that it isn't impossible.'\n\n\nThe suitors laugh as Nelei hands over the bow to her son. Kouios takes an arrow and... shoots it towards Akakios.", "action_results": [{"action": "A fight ensues...", "result": "Akakios dodges the arrow, which lodges itself into the chest of the suitor behind him. He draws a sharp, bronze sword and the other suitors follow his lead. Nelei retreats into her chambers, locking the doors behind her. You quickly step forth, out of the shadows drawing your own deadly sword.\n\n\nYou are immediately attacked by two suitors, slashing at you with their sharp swords. However, you easily block their blows, finishing off one of your attackers with a quick thrust to his chest. The other suitor retreats, only to be replaced by three more attackers. Although you do your best trying to block their attacks, you still get shallow cuts along your arms and sides.\n\n\nSuddenly the head of one of your attackers explodes in a flurry of brain and blood as a feathered arrow sends another of the suitors to Hades. Taking advantage of the confusion you thrust your sword into the chest of another attacker, ending his life. The remaining attacker drops his sword and cowers away, but he too is slain by Kourio's swift bow.\n\n\nYou see a glimmer of bronze in the corner of your eye and you barely manage the deadly thrust of Akakios' sword. But as you try to regain your stance he already prepares another attack. As he once more unleashes a deadly thrust in your direction you have only a split second to take action. Acting more on instinct than on your wits you...", "action_results": [{"action": "counterattack.", "result": "Putting all your weight behind your thrust you try to end Akakios' life with a single blow. Yet Akakios is faster. A sharp pain erupts as the bronze sword pierces your intestine. You fall to the ground, coughing up blood. Akakios looms over you with a malicious grin. You manage to see the bronze sword flicker in the afternoon sun before it buries itself into your brains.\n\n\nYou have travelled a long and dangerous road. You braved many perils and have seen many new places. But although you were close to your goal you didn't make it. Greece is doomed and Athens will be engulfed by flames. Yet you won't notice any of this, as your soul is already on it's way to Hades. May you find peace there, while the world of the mortals is at war.", "action_results": []}, {"action": "try to dodge his attack.", "result": "The sharp bronze blade misses you by mere inches as you stumble out of its way. You barely manage to keep standing. you immediately go into the offensive, thrusting and slashing at Akakakios, sending him into the defensive. You are completely focussed on this one opponent, all of your surrounding fade into a blur, leaving only Akakios.\n\n\nThe ringing sounds of metal on metal echo across the courtyard as the both of you tries to land a blow on the other. Your travels have given you a tremendous amount of experience, yet you need all of it in your duel with your enemy. You feel your heart skip a beat as Akakios lunges at your head, just barely missing it. You use this small opening in his defence to strike at him, but you only manage to land a glancing blow.\n\n\nHowever, you manage to take the upper hand in this duel. You commence a flurry of attacks which leave no room for Akakios to retaliate, keeping him on the defensive and slowly maneuvering him to the wall, leaving him little room to dodge. In his desperation to attack you he launches a clumsy attack, missing you completely and leaving him completely open for an attack. You quickly make use of this opening and so you...", "action_results": [{"action": "thrust at his head.", "result": "You miss his head by inches. With this failure the tides of battle turn against you. Akakios regains the upper hand and sends you back into the defensive. Blow after blow you defend but eventually gaps begin to appear in your defence. In an unguarded moment Akakios manages to land a glancing blow to your head.\n\n\nDazed and confused you fall to the ground, dropping your sword. The last thing your mind registers is the malicious grin of Akakios as he plunges his sword into your brain.\n\n\nYou have travelled a long and dangerous road. You braved many perils and have seen many new places. But although you were close to your goal you didn't make it. Greece is doomed and Athens will be engulfed by flames. Yet you won't notice any of this, as your soul is already on it's way to Hades. May you find peace there, while the world of the mortals is at war.", "action_results": []}, {"action": "slash at his chest.", "result": "A red gash appears across Akakios' chest as your sword kisses his flesh. Roaring loudly Akakios goes once again in the offensive. However, his attacks are agressive and uncontrolled, leaving your opponent open for a final attack. Putting all your weight behind your attack, you thrust at his chest.\n\n\nTime seems to stop as you plunge your blade into the lying heart of Akakios. The fighting around you seizes as the remaining suitors stare astonished at the death of their leader. You see small eyes of your enemy close beneath his large eyebrows as you pull your sword free from his chest. Blood sprays from his chest and his breath leaves his lungs as Akakios fall to the ground. The great intriguer, the menace of Greece, is dead.\n\n\nAs time resumes its normal flow you hear the sounds of falling swords around you. You finally become aware of your surroundings again. The courtyard is littered with bodies, Kourio is dripping with sweat and bleeding from multiple superficial wounds. You now notice your clothes are wet with blood, the once white fabric now a dirty red. The remaining suitors have dropped their swords and have kneeled upon the bloody floor, their hands resting upon their heads.", "action_results": [{"action": "The next day...", "result": "You are standing inside the throne room of Sparta. Courtiers and servants alike have gathered near the edges of the rooms, whispering to each other. They are standing between graceful columns that support the heavy, stone roof. The room is decorated in the Spartan style, with scarce fresco's decorating the walls. The marble floor beneath your feet is inlaid with mozaics, depicting battles. A fitting scene, you think, seeing the events of yesterday.\n\n\nIn front of you are two thrones: a small, elegant one for Nelei, the queen regent; and an elaborately decorated throne for Kourio, the rightful king of Sparta. As the two enter you kneel before them.\n\n\n'Rise, noble hero.' you hear Kourio speak to you, 'you do not have to kneel before us. You are an honored friend of us and the whole kingdom of Sparta and we see you as our equal, even though you are a bard by trade. I cannot think of enough ways to thank you for the extraordinary deeds you have done for us and we will be for ever in your debt. I will give you enough gold to live the rest of your days in luxuries and will give you land in Sparta if you wish it; there will always be a place at our table for you whenever you are in the vicinity of our city and you will always have a place to sleep in our palace. But above all I give you my promise: Sparta will be at peace as long as I reign, no hostile action whatsoever will take place against any Greek city. You have my word, I swear it by the almighty gods, that inhabit the wide skies.'\n\n\nYou answer him, astonished by his generous gifts: 'Your honor, I am deeply grateful for this. But how could I ever accept your gifts, I only did my duty.'\n\n\n'I will not hear any excuses. You will accept my gifts, that is an order from the king of Sparta.'\n\n\nYou smile at him: 'Very well your grace. I thank you.'\n\n\nKourio smiles back: 'No, we thank you. But I have one last favour to ask you.'\n\n\n'What might that be your honor?'\n\n\n'Since you are a bard, could you recite an epic to me and my court?'\n\n\n \n\n---\n\n\nYou gaze at the white city of Athens, gleaming in the morning sun. As you stand at the wooden railing of the vessel given to you by king Kourio to bring you back home, you reminisce about your adventure. You see the faces of all those you've met before your minds eye and you try to remember all of the places you've seen. But now, as you look once more at the city in which you were born you realize how much you've missed your home. The golden image of the wise Athena appears upon the vibrant seas. She smiles at you and waves, before disappearing again in a golden flash. The gleaming white marble of the Parthenon burns with a golden glow in the light of the setting sun, welcoming you home after your long journey.", "action_results": []}]}]}]}]}]}]}]}]}]}]}]}]}, null]}]}]}]}]}]}]}]}]}]}]}]}, {"action": "Don't take any rash measures. Think about your next action first.", "result": "It is never wise to take rash decisions and so you wait while you observe Polyphemos. You notice that some of the sheep in the cave want to go out, but when they reach the exit, the cyclops first feels or pets them. If you were to make a run for the exit no he would surely discover you.\n\nAs you ponder on a way to get out a plan begins to take shape in your mind. You order your companions to gather the twigs on which the giant sleeps at night amongst his sheep. Some of the sheep in the cave have a very thick coat of wool. Your escape plan comes into action.\n\nYou bind three sheep together with the twigs. One of your companions holds on the fur of the middle sheep while he hangs underneath it, the other two sheep act as a distraction. When the sheep reach the exit, the cyclops pets them and lets them through.\n\nSeeing that your plan worked you use it to get yourself and your other companion out of the cave. Outside you untie the twigs that hold the sheep together.", "action_results": [null]}]}]}]}]}]}]}, {"action": "'Unfortunately we don't have time. We have to set sail tomorrow.'", "result": "Too bad, but we have to set sail immediately, time is running out for Greece. The crew sigh softly from relieve, apparently they had a bad feeling about that cave.\n\n\nYou and Cyrus stand at the bow of the ship, looking at the distant horizon. As you stand there you can't but wonder who inhabited that far-away island. But on the other hand, despite your curiosity you too were a little frightened by the cave.\n\n\nThe events of the day have left you tired and you quickly fall asleep. In your dreams you find youself floating above the wine-coloured sea. Violent winds blow right through you and the restless sea sends his waves to the clouded skies above. \n\n\nYou notice a glowing figure standing next to you. As you watch closer you recognize the bright-eyed Athena. She turns her head to you and speaks the winged words: 'Great bard, you have chosen wisely not to venture into the cave on the far-away island, for a terrible monster inhabits it, Polyphemos, the son of Poseidon. But your journey is not over yet and many dangerous fill the roads ahead.'\n\n\nShe points down to two distant shapes in the dark night, lining a narrow passage between two great patches of land. \n\n\n'On the left is the terrible Charybdis, a monster that spawns terrible currents. On the right is the dreadful Scyla, a beast with six heads that attacks all ships that passes it. Choose carefully, the way ahead is long and Greece counts on you.'\n\n\n ", "action_results": [{"action": "After these words, the wise Athena disappears...", "result": "The ship rattles and shakes as violent winds torture the sails and restless waves batter the hull. The obvious signs of looming disaster have not gone unnoticed by your crew. Even the most sturdiest sailors in your crew are praying softly to the immortal gods. \n\n\nDistant lightning illuminates the dark sky. \n\n\nCyrus approaches you, his hairs are wet and windswept by the violent weather. A look of horror is on his face. 'My friend, what will this day bring us? What are the almighty gods planning for us today? The crew is restless, everyone can sense that something bad is going to happen.'\n\n\nYou answer him with a slightly trembling voice: 'We are on a perilous journey and dangers await us every day. Keep your faith in the all-seeing gods, for they too want us to succeed.'\n\n\nCyrus answer you with a slightly calmer voice: 'But sir, how can you know for sure that the gods...'\n\n\nYou interrupt his sentence as you see two shapeless forms materialising at the horizon. You quickly tell Cyrus to send the men back to their stations and prepare for anything. \n\n\nThe two monsters are coming into clear view. You can see a large cave on the left of the narrow strait, a large whirlpool is forming at it's entrance. On the right you can see a beast with six dog-like head, connected to it's large body with long necks. \n\n\nYou can practically feel the fear of your crew hanging in the air. The moral drops and cries of fear and despair fill the air.\n\n\n'Zeus, protector of travellers, please keep us safe and...'\n\n\n'Ares, lord of war, shield us mercenaries from danger...'\n\n\nYou make your way to the centre of the ship. Trying the best you can to make your voice audible above the violence of nature you shout: 'Brave men, tamers of the wild seas, many dangers have we braved together, why should we die now, on this day? Don't let fear conquer your heart. Let us sail forwards with determined souls.'\n\n\nThe looks of utter fear are beginning to vanish from the faces of your men.\n\n\n'Now, with a brave heart, let us sail past the...", "action_results": [{"action": "Charybdis'", "result": "The skies howl and the seas roar as your ship sails towards the monstrous Charybdis. You feel the vessel shaking beneath your feet, as if it too is afraid of the coming confrontation. The islands that seemed so far away are now in front of you. To the far right of the narrow sea-strait you can see the dreadful Scylla. It's six heads almost look sad at the sight of it's lost prey. \n\n\nIn front of you you can see the cave of the Charybdis. It's pitch black entrance stands looming at the side of the sea. You see fear once again gripping the hearts of your crew, even Cyrus looks troubled. And to be honest, you yourself do not feel all too well either.\n\n\nSuddenly a high-pitched shriek sounds from the cave, piercing the hearts and minds of everyone on board, breaking your last mental defences.\n\n\nYou can feel your heart beating in your chest as the shrieking continues. You start to shake as the shriek reaches a climax and then...\n\n\nEverything is silent in what feels like an eternity. Neither the skies nor the seas make a sound and the shrieking from cave has silenced. You feel as if you and the ship are floating in mid-air. You see the crew moving around you in slow-motion, as if the Chronos, the god of time, himself has pulled your ship out of the normal stream of time.\n\n\nThen, as if nature itself is seeking to compensate the slowed down time, the world seems moving at double time. The sounds of the world around you return even louder. The waves are becoming more and more violent. And then the world seems to spin around it's own axis. You manage to take a quick look at the seas beneath the ship before you, like the rest of the ship, fall down on the deck. But the problem is, the sea has gone. Where once waves were crashing onto the hull of the ship, there is now a black nothingness, a looming darkness that bodes your imminent doom.\n\n\nCharybdis' shrieking seems much more triumphant now and you realise why. The ship is caught in a large whirlpool. A feeling of falling down accompanies your epiphany. The strange thing is, after all you've been through, you are not afraid of dying. You spend your last moments in the world of the living thinking of the people you've met, especially of your new friend Cyrus, the places you've seen and the choices you've made. But you think with regret of the people who will die because of you during Greece's civil war, which you couldn't prevent.\n\n\nYou enter Hades with a calm heart, accompanied by a golden light.", "action_results": []}, {"action": "Scylla'", "result": "An eary silence accompanies your ship as you sail forwards towards the dreadful Scylla. Two beams of light pierce the dark skies above, illuminating both your ship and the monster you are about to face. During this moment of peace you gaze at the narrow strait in front of you. On your left you can see the cave of the monstrous Charybdis. A faint shrieking can be heard coming from the entrance, as if it's inhabitant is weeping at the sight of it's lost prey. On the right you can see Scylla. It's six dog-like heads are looking directly at you, full of anticipation and hunger. It's huge body sits quietly at the shore, awaiting your ship with a rumbling stomach.\n\n\nYour moment of contemplation is swiftly cut short as the heavens above roar once more, an ominous sign for the coming encounter. The current which steers your ship towards the narrow strait is accelerating, as if the seas themselves can't stand the tension any longer and want to push you faster towards your destiny.\n\n\nThe crew members seem to hold their breath collectively as the ship is almost within reach of the Scylla. The white faces of your crew look like death has already struck your ship.\n\n\nAnd then it strikes...\n\n\nThe six heads of the Scylla pounce on the deck with a ferocious fury. White foam drips from the muzzles of it's doglike heads. It's fierce growling muffles the cries of fear and despair from your crew members. Although he even does an even better job at this when each of it's heads grabs a sailor and swallows it whole.\n\n\nAfter it's meal it returns to it's place at the edge of the sea-strait, looking rather content.\n\n\nYour ship quickly sails onwards, with it's crew mourning their deceased comrades.\n\n\n ", "action_results": [{"action": "It's been a long day...", "result": "It has been two days since you're encounter with the dreadful Scylla. The morale of the crew is at an all time low and occasionally you can hear people grumble about how 'since they agreed to accompany that crazy bard, all sorts of crazy beasts and monsters have attacked us'.\n\n\nThe shining Eos has sunk beneath the horizon hours ago, yet still you can't drift off to sleep. You keep thinking about the rebellious morale of the crew and the heavy weight of your objective pressing on your shoulders. The soft, ritmical breathing of the people around you remind you of the fact that you also carry a responsibility for the lives of the crew. You sigh softly, despaired by the seemingly impossible task the immortal gods appointed you.\n\n\nYou watch at the star lighted waves, listening to the soft blowing of the wind. Then the wind starts picking up speed, forming white foam on the tips of the waves.\n\n\nSuddenly you hear one of the boards of the deck creak softly right next to you. An old man carrying a large bag approaches you.\n\n\n'Brave adventurer, I greet you. My name is Aeolos, lord of the winds. The gods are watching your journey from atop of Olympus. I have been sent by the gods to inform you that time has almost ran out for Greece. That is why I have come to give you this.'\n\n\nHe gives you the bag.\n\n\n'To aid you in your journey I have locked up all of the winds in this bag. All but the western wind that will carry your ship to Sparta. But remember: do not, whatever happens, open the bag. I wish you good luck, noble bard.'\n\n\nAnd with these words he disappears in a whirlwind, leaving you bewildered behind. You think you see one of the crew members, Ericles, shifting in his sleep. Yawning, you remember that the night is almost over and Nox, the goddess of the night, will be relieved by Eos in a couple of hours.", "action_results": [{"action": "Finally you fall asleep", "result": "'I told you, some old man gave him that bag last night, I saw him.'\n\n\n'Yeah, right, and then the satyrs came and did a little dance.'\n\n\n'Then wait and I'll show you. That bag contains something precious. Why else would he be holding that bag even in his sleep?'\n\n\n'Don't you touch him, he is still our client and I, as you captain, command you to leave him alone.'\n\n\n'Right Cyrus, you wouldn't even be captain if it wasn't for him.'\n\n\nYou slowly open your eyes and the sight before your eyes surprises you, to say the least. Cyrus is standing in front of an angry mob of crew members, with his arms extended defensively. You recognise the leader of the mob: Ericles.\n\n\n'Hey look, our client is awake.'\n\n\nYou quickly jump to your feet, still guarding the bag Aeolos gave you. Facing the angry mob, you speak: 'Are you really going to believe a mischief-maker like Ericles? Yes, I was given a bag by the god of the winds, but it does not contain valuables. The gods have decided to help us, so Aeolos locked up the winds in this bag. Only the western wind, which will bring us to Sparta, he left unchecked.'\n\n\nEricles replies with his filled filled with contempt: 'Do you take us for fools, traveller? Do you think you can fool us with such a lame story? Give us that bag and we will continue your bloody odyssey. If you do not give it...', he shows you his dagger 'this dagger might just find it's way into your chest when you're asleep.'\n\n\nYou hear shouts coming from the angry mob: 'Yeah, tell him Ericles!'\n\n\nYou reply: 'I'm sorry, but I can't open this bag. You just have to believe me, bad things will happen if this bag is opened.'\n\n\nThis wasn't exactly what the crowd wanted to hear. They overrun you and Cyrus and grab the bag from your hands. You are in no position to oppose them when Ericles unties the cords that keep the winds locked inside.\n\n\nA violent whirlwind sweeps across the deck, pouncing on the crew, the ship and you. You hear the ship cracking and the sails tearing. And then everything is a big blank.", "action_results": [{"action": "On the beach", "result": "You concentrate with all your might on that one thought: 'The fate of Greece depends on me, I cannot stop here.'\n\nThe void around you seems to collapse, the darkness is lifting. A golden light shines through the crack in the endless void. The sounds of the mortal realm fill your ears. With a great feat of concentration you manage to disperse the nothingness for once and for all.\n\n...\n\nThe bright sunlight pierces your eyes. You can hear the sounds of waves breaking on the shores nearby. As your vision finally focuses you take notice of your surroundings. You are lying on a white beach, nearby the violet sea. Large forests border at the sands.\n\nYou guess this is an island, but how big is it exactly? Is it inhabited, and by who? The memories of your recent visit to the island of the cyclopes are still vividly present within your mind. You try to get up to explore your surroundings, but a sharp pain shoots through your limbs.\n\nClenching your teeth you try once again to stand up. With a great feat of determination you manage to stand up. Shaking with suppressed pain and desperation you mange to take your first step on this new-found land. Then follows a second step, and a third. And then your vision turns red. The white sands of the beach come crashing towards you as exhaustion takes control of your limbs.", "action_results": [{"action": "You are awakened by distant voices", "result": "The high-pitched voice of a young woman awakens you from your unconscious state. Softly grumbling from the pain that's still very much present in your limbs you manage to turn your head around to see where you are. But before you manage to even see past the white sands of the beach you hear another high-pitched shriek. Immediately after this you feel a pain in your legs as the feet of a young woman hit them.\n\nA moment later you are joined on the ground by the face of a young woman, just barely of a marriageable age. Her hair is blond and her arms and skin are white as snow and she wears expensive clothing. You close your eyes as the mouth of this young woman once again produces a high-pitched shriek. Afterwards she seems to relax a little, a faint smile even appears on her face.\n\n'I am sorry, stranger, I hope I didn't startle you too much. I was just surprised to see a traveller on this island, you see we are far away from the rest of the civilised nations and not many people know of us. I was just going to get my ball which landed in the sea over there when I found you, although I wish it would have been a more painless encounter.'\n\nShe gives you another faint smile.\n\nSmiling, you answer her: 'Well, it certainly is a sudden encounter, but I can't say it is an unpleasant one. But could you please tell me where I am and who you are and...' suddenly you realise that your friends and ship are not the only thing you lost in the ocean, you suddenly realise that you have no clothes on. As you cheeks get redder and redder you ask your new acquaintance: 'I am really ashamed to ask you this, but I suddenly realised that I lost my clothes. Do you perhaps have some spare clothes on you?'\n\nThe girl laughs loudly and speaks to you: 'Stranger, you are certainly one of the strangest people I have ever met. On behalf of my people I welcome you to the island of the Phaeacians, my name is Nausicaä, the daughter of the brave and noble Alcinoös and princess of these people. And you are lucky, I came here with my servants to do the laundry of my brothers, I have some clothes for you to borrow while you are my guest.\n\nAnd with these words she stands up, helping you up as well, and takes you to a nearby cart filled with clothes. Her servants avert their gaze as you don some clothes. Now fully clothed you follow Nausicaä and her servants to the capital...", "action_results": [{"action": "The city of the sea-farers", "result": "As you make your way towards the city you tell the princess about your travels and your destination. She listens fascinated to your stories, only occasionally interrupting you with some small questions. But although you have not yet finished your story as you reach the city gates she stops you. 'I'm sorry, traveller, but I am afraid we have to part our ways here for now. As the princess of these people I have a reputation to keep. If people spot me with a stranger, a foreign man, they are going to gossip. Our island isn't big and gossips spread fast here. However, I have enjoyed your company so far and so I ask you to visit me and  my parents in our palace. Every single citizen knows of it, the youngest child could point you the way. I also think that my father will be able to help you, we Phaeacians are a sea-faring people after all.'\n\nYou answer the young princess: 'young mistress, princess of the Phaeacians, I thank you for you hospitality and I am looking forward to seeing you again.'\n\nThe white-armed girl answers you: 'I am looking forward to seeing you again too, traveller. Before we part our ways I want to return this to you' she goves you your sharp bronze sword, 'one of my servants found this on the beach and she brought it to me. I believe this belongs to you.'\n\nAfter these words, Nausicaä enters the city with her servants, heading for her palace in which you will see her again soon.\n\nYou decide to explore the city on your own for a few hours before you head to the king's palace. The city itself is not really spectacular for someone who is used to the beauty and splendour of Athens. The island itself has, in contrast to most major cities in Greece, not been inhabited for a long time, only a few generations of people have lived here. Most of the buildings are only one- or two-stories high and there are little ornaments and decorations in the street scape. The people however, are very friendly. Everyone is nice to you, even though not many foreigners are seen here. Even though the people are not exactly the richest in Greece everyone is pleased with the live they've got.\n\nWhen the sun has nearly sunk beneath the horizon you make your way to the palace. As you walk through a less crowded part of the city you suddenly hear someone calling from a dark alley. 'Please help me! By the gods could someone please help me!'\n\nYour heart is torn between two thoughts. This could very much be a deceitful trap, to rob you of your few possessions, or worse... Or someone really is in need of help.", "action_results": [{"action": "''Maybe someone really is in need of help, I'll go and see.''", "result": "You slowly make your way in the dark alley. You expect a thief or robber behind every barrel, every cart that stands in the dark shadows. Eventually you reach the source of the cries for help. A young woman is huddled in a corner, brandishing what looks like the kind of knife butchers use to cut meat. Two robbers are bent over the frightened woman like two vultures on the battlefield; circling over their mortally wounded pray untill his soul finally leaves his body.\n\nYou try to sneak up on the two robbers, trying to reduce the distance between you and them, untill you can drive your sword into their dark hearts. However, the floor is littered with pebbles and shards of pottery. A crunching sound beneath your heels warns the robbers of the fate that is looming above them and they turn around, brandishing daggers in their hands.\n\nA look of terror passes their face as they realise that their new guest is not a helpless woman. One of them, the 'leader', charges you with his dagger while the other continues harrassing his victim.\n\nYou grip the hilt of your sword tighter as the dagger of your opponent has almost reached your chest.", "action_results": [{"action": "Block his attack!", "result": "You raise the blade of your sword, trying to block the impact of the robber's dagger. However, it takes too much time to lift it. You are barely able to deflect your opponent's blow and the dagger's deadly blow misses your chest by an inch.\n\nFear grips your heart for a brief moment as you realise that you could have been killed this very instant and within this moment your opponent strikes once again.", "action_results": [{"action": "Block!", "result": "You lift your sword once again. trying to block the deadly blow of your opponents dagger one more time. However, the sheer weight of your bronze sword, in contrast to the small, light dagger of your opponent, combined with your brief hestitation due to the fear gripping your heart prevent you from reacting quick enough.\n\nBlood erupts from your chest as the deadly bronze pierces your heart. A golden light appears as your lifeless body falls to the ground of the alley.", "action_results": []}, {"action": "Dodge!", "result": "Fear tightens the grip on your heart as the dagger of your opponent barely misses you head. You let out an involuntary sigh of relieve as you realise that you are not yet about to enter the realm of Hades. With all your strenght you kick the leg of your opponent. Surprised by this sudden move your assailant stands no chance against your blow, screaming with rage he falls to the ground. A quick blow with your sword silences him for good.\n\nAs your turn to see how the woman is faring you are met with the other robber. He falls towards you with a knife sticking out of his back. His victim stands behind him with a triumphant smile. You look at her with surprise. She answers calmy: 'What? Two robbers might have been too much, one isn't.'\n\nYou ask the woman for directions to the royal palace and after mutual words of thanks you continue your way.", "action_results": [{"action": "The royal palace", "result": "You have finally reached the magnificent royal palace of the Phaeacians. You instantly know why every single inhabitant of this city knows it. It is by far one of the largest buildings you have ever seen in you life, either in Athens or in any other Greek city. The outside is decorated with beautiful marble sculptures and richly decorated mosaics are laid on the ground. Small trees and different varieties of flowers separate the palace from the street. \n\n\nYou spot two guards in ornate armour standing next to the great wooden gates of the palace. Servants and citizens alike are passing through the entrance to the palace. You hide your sharp bronze sword beneath your clothes the best as you can, since you don't think the guards will let you enter the palace with a weapon. \n\n\nYou do your best mingling in with the citizens that enter the palace. Your breathing almost stops as you walk past the guards. You imagine them stopping you any moment now, slowly drawing their weapons as they close in on the citizen they do not recognise. You almost can feel the hand of the imaginary guard on your shoulder.\n\n\nYou slowly dare to exhale as you finally reach the courtyard of the palace. People of all ranks and positions mingle in here, as if there is no class difference at all, this is truly an unique sight! You make your way around the different groups, trying to find the throne room. You pass a group of statues depicting the brief history of the Phaeacians. They really are a remarkable people, the previous king, Nausitoös, led the Phaeacians to this island, founding everything you have seen today and more. You recognise one of the last statues as Nausicaä, the princess you met on the beach.\n\n\nNext to these statues is the entrance to the throne room. The high ceiling is supported by several high pillars. Lavish fresco's decorate the walls. Nobles and courtiers are gathered around a roaring fire in the middle of the room. You spot Nausicaä sitting next to her father in the middle of the room. As she sees you she speaks to her father on his well-built throne: 'My noble father, look over there, beneath the well-made archway. This man is my guest. He is a traveller from Athens, many miles from here. The high waves and violent winds smashed his ship and brought him to our shores.' \n\n\nHer father, the noble Alcinoös answer her: 'My dear daughter, any guest of yours is a guest of mine.' He turns to you, 'please, foreign traveller, come closer. You are our honoured guest today. My servants will make sure you will have a comfortable stay here. Please, join us at the dinner table when you are ready.' ", "action_results": [{"action": "After you refresh yourself in your room, you head towards the dining hall...", "result": "You are sitting in the large dining hall next to king Alcinoös. The heavy wood table is covered with the most delicious foods and in the center lies a large, fat swine, fresh from the spit. After a servant fills your plate, a bard enters the hall. The king himself announces him. 'My dear friends and family, I am pleased that our dear bard Demodokos is present here this evening. After all, should we not hold all bards in high esteem. For they received their trade from the gods themselves, either from the god Apollo or the muses themselves.' You smile a little after hearing these words.\n\n\nThe shining bard tells with great skill about the fall of Troy and the sufferings of the godlike Odysseus. After about three hours he conludes his story: 'That was the tale of the shrewd Odysseus. Who traveled far and wide after he destroyed the sacred citadel of Troy. But although he suffered much misery in his heart, at sea, he completed his destiny and returned to his home and his faithful wife.'\n\n\nHearing the story about Odysseus, you can't but compare yourself to him. For you too suffer much, far from your home. You feel tears well up behind your eyes. The noble king notices your obvious sadness and speaks with kind words: 'Great Demodokos, with your silver voice, you told a great story, but I think it was a little too much for our honoured guest. This is a feast in his honour, we should laugh, not cry. But tell us, noble traveller, who you are and where you come from.'\n\n\nThe gathered people listen fascinated to every single of your words as you tell about you journey thus far. You tell them everything: your encounter with the gods, the harpies in Egypt, the Oracle, the Scyla and Charibdis, the mutiny on your ship and eventually your adventures in the city.\n\n\nAlcinoös is visibly touched by your story and with his awe-filled voice he speaks to you: 'Great bard from Athens, valiant traveller, I, and the rest of my court, have listened to your story with great astonishment. I think I speak for all of the Phaeacians when I say that we will gladly bring you to Sparta with one of our swift ships.'\n\n\nYou answer him with great gratitude: 'Noble king, I thank you for this offer and I gladly accept it. You must have exquisite sailors, if they are able to navigate from here to Sparta.'\n\n\nThe king of the Phaeacians answers: 'I thank you for the compliment, traveller, but it is not completely true. You see, our ships are special. Tell them where you want to go and they will bring you there, without the need for guidance. Our swift ships will bring you in three days to Sparta.'", "action_results": [null]}]}]}]}, {"action": "Dodge!", "result": "You let out a sigh of relieve as the sharp bronze dagger of your opponent misses your head by an inch. After you ducked to dodge his attack he could not react fast enough to redirect his attack. You are now in the perfect position to strike.\n\nYou leave your lifeless opponent behind you with a large stab wound in his chest. As your turn to see how the woman is faring you are met with the other robber. He falls towards you with a knife sticking out of his back. His victim stands behind him with a triumphant smile. You look at her with surprise. She answers calmy: 'What? Two robbers might have been too much, one isn't.'\n\nYou ask the woman for directions to the royal palace and after mutual words of thanks you continue your way.", "action_results": [null]}]}, {"action": "''It probably is some ordinary robber. And besides, I really need to go to the palace.''", "result": "You quickly walk past the alley, it's probably safer that way and besides, you've got somewhere to go to.\n\n Suddenly you hear something behind you.\n\nSome pebbles on the street are swept aside by the feet of some pedestrian.\n\nThe rustling of the clothes of a person near you.\n\nThe sound of a bronze object being pulled from it's hiding place.\n\nYou quickly duck aside as if the lightning bolt of Zeus himself has struck you. The bronze dagger of the unknown assailant harmlessly flies through the space you just left. You draw your own sword within a split-second, ready to attack any mugger who tries to kill you again.\n\nFor the first time you see your attacker: it's a small man, just able to reach you shoulders with the top of your head, were it not for the patchy black beard that protrudes from beneath his dark hood you could have mistaken him for a child. You see his bronze dagger shaking in his hand and you manage to catch a glimpse of his nervous face beneath his hood. He had not expected that you would dodge his blow and not at all that you would draw a weapon of your own.\n\nAlmost unnoticeable he starts to back away, as if he prepares to flee at the first opportunity.", "action_results": [{"action": "''He's not going to get away so easily after attacking me, he will pay.''", "result": "Your mind is clouded with rage as you chase the cowardly mugger. Street after street you run after him, dodging people and animals alike. You notice that this journey has done wonders for your stamina, you are able to keep up with the coward with relative ease, while he is heavily panting.\n\nAfter he dashes in yet another alley he stops, realising that he cannot outrun you. As you enter the alley he has already drawn his deadly bronze dagger, inviting you to come near. You draw your sword in response...", "action_results": [{"action": "A battle ensues...", "result": "Although the robber lacks real skill he makes up for it with his utter fear of death. He lunges at you at the first opportunity, resulting in a shallow wound on your upper arm. You quickly recover and prepare your attack...", "action_results": [{"action": "Attack him quickly, while he is not prepared", "result": "You quickly jump to your opponent with your sword drawn. The coward is not at all prepared for your attack, as you anticipated, however, he still manages to stab you in your stomach as a reflex. A sharp pain erupts in your belly and you fall to the ground, clutching your stomach with both of your hands.\n\nThe robber immediately runs away, leaving you behind in the dark alley. The dirt ground turns red with your blood as your life force slowly flows out of your body. The pain does not fade away for some very long hours though. When the rose-fingered dawn is just about to dispel the black veil of night, death finally comes to you, not as a burden, but as a relieve. Your last moments on this earth are painless, filled with a golden light.", "action_results": []}, {"action": "Adopt a careful stance, you never know what might happen", "result": "You slowly approach the robber, you never know how a terrified opponent may react. Your caution is rewarded: just when you are within arms reach of the robber he tries to stab you as if by a reflex. However, you quickly block his attack with the flat end of your blade and subsequently counter it with your own...\n\n\nYour cowardly opponent falls to his knees, crying. 'Please stranger, do not kill me. I promise you I'll better my ways. I swear by the immortal gods, who own the wide skies. Please, I beg you, do not kill me. I'll do everything you say.'", "action_results": [{"action": "Let him live.", "result": "'Stand up, sniveling mugger! I'll let you live this time, but if you do not better your ways, Hades will still claim your soul. Remember, you've sworn it by the immortal gods. Now, tell me where I can find the royal palace...'", "action_results": [null]}, {"action": "Kill him.", "result": "The cowardly mugger falls to the ground with several holes in his chest. You wipe the blood of your sharp bronze sword and carry on towards the royal palace...", "action_results": [{"action": "Lost in the city", "result": "'It's really easy to find, the smallest child could point you the way. The smallest child could point you the way, where am I going to find a small child? This city is like a maze!' \n\n\nYou have been walking through the empty streets for an hour and still have not found the palace. All these streets look alike. You are walking through streets of locked doors and closed shutters. Muffled voices can be heard from the nearby houses. After walking through yet another street you have reached a crossroads. Trying you luck, you decide to...\n\n\n \n\n \n\n(The streets of the Phaeacian city are like a maze, it's even like they're designed to confuse strangers. For the traveler who is not able to continue his journey, the gods have left a map below.)\n\n\n \n\nA golden light reveals the follow letters written on the streets: LRAAA, you'd better remember them.", "action_results": [{"action": "Turn left...", "result": "You find yourself in yet another street. This time you have two options to choose from: ", "action_results": [{"action": "Turn right", "result": "You have reached yet another crossroads, you have three choices this time:", "action_results": [{"action": "Go straight ahead", "result": "Yet another crossroads cross your path. You have three options:\n\n\n ", "action_results": [{"action": "Turn left", "result": "You find yourself in a streets with only two options to choose from:", "action_results": [null, {"action": "Go straight ahead", "result": "You have only one option: turn the corner.", "action_results": [{"action": "Turn right", "result": "The streets are becoming wider and the houses are more and more richly decorated, you must be close to the royal palace.", "action_results": [null, null, {"action": "Turn right", "result": "You reach a street with only two options to choose from:", "action_results": [null, {"action": "Turn right", "result": "You have reached a street with only two directions to choose from:", "action_results": [{"action": "Go straight ahead", "result": "You have only one direction to turn to:", "action_results": [null]}, {"action": "Turn right", "result": "Yet another crossroads cross your path: ", "action_results": [{"action": "Turn left", "result": "You have reached yet another crossroads. You have three options to choose from:", "action_results": [null, {"action": "Go straight ahead", "result": "Yet another crossroads crosses your path. You have three options to choose from:", "action_results": [null, null, null]}, null]}, null, {"action": "Turn right", "result": "You can choose from two roads to follow:", "action_results": [null, null]}]}]}]}]}]}]}, null, null]}, {"action": "Turn left", "result": "You have two directions to choose from:", "action_results": [null, null]}, {"action": "Turn right", "result": "You have reached another crossroads. What direction will you turn to?", "action_results": [null, null, {"action": "Turn right", "result": "You have reached yet anther crossroads:", "action_results": [null, null, {"action": "Turn right", "result": "You have two roads to choose from:", "action_results": [null, null]}]}]}]}, {"action": "Go straight ahead", "result": "You are in a short street, there is only one option to go to:", "action_results": [null]}]}, null, {"action": "Turn right...", "result": "You reach a street with only two directions to go to:", "action_results": [null, {"action": "Go straight ahead", "result": "You have reached a street with only one direction to turn to:", "action_results": [null]}]}]}]}]}]}]}, null]}]}]}]}]}]}]}]}]}]}]}, {"action": "Quickly retreat", "result": "Overwhelmed by the sheer number of the souls and the attacks of the dead soldiers you retreat. But with every step you take the souls close in on you. Absolutely terrified you call out to Cyrus, but you get no response.\n\nThousands of souls envelop you as you make one final attempt to leave this place of the dead. The cold chill of death creeps through your body as the souls slowly take you with them to the realm of Hades. In your last moments in the realm of the living you can only see darkness. In the last split second before you enter the underworld a golden light fills your vision. Where did this journey go wrong?", "action_results": []}]}]}]}]}, {"action": "'Very good Cyrus, keep hitting him, set a good example for the crew.'", "result": "Cyrus keeps hitting the boy, holding the oar high above his head, encouraged by your shouts.\n\n\nYou are too absorbed in the 'disciplinary punishment' of the young boy to notice the growing resentment of the crew members. Behind your back, the disgruntled crew members gather. When you finally notice what is going on the first fist hits you in your stomach. You bend over as the air is forced from your lungs. You collapse as another fist hits you on your head.\n\n\nAs you wake up a few moments later you notice that you and Cyrus are tied together with your wrists. A big crew members towers over you. 'Wake up, wake up sleepy. It's time to play. Who is up for a little bit of swimming.'\n\n\nThe next moments pass by in a flash. The crew lifts you up and before you realise what exactly is going on you find yourself sinking beneath the waves.\n\n\nYou jerk at the ropes that are immobilizing your hands, trying to loosen them. But it is of no use.\n\n\nYour sight blackens as the last air flows from you lungs. The body of Cyrus grows limb as he too struggles for oxygen. The last thing you see is the last of your breath, leaving your body in a string of bubbles. The last seconds before your soul travels to the realm of Hades are filled with torment as you struggle against the cold embrace of the ocean surrounding you.", "action_results": []}]}]}]}]}]}]}, {"action": "Dodge their attack", "result": "You quickly fall to the ground and feel their swords pass over you.\n\n\nYou hear one of the guards curse as his arm is cut off by Cyrus' sword, however he quickly falls silent as another swing by Cyrus' sword sends his soul to the underworld.\n\n\nAs the remaining three opponents rush to their killed comrade you dispatch another one.\n\n\nHowever, the idle guards can't just watch on as two of their comrades have been killed. They quickly rush to the aid of their two remaining colleagues.\n\n\nNow it's eight versus two.\n\n\nThe remaining guards manage to gather in a kind of formation, linking their shields together to form a shield wall. Well, this is going to be fun.\n\n\n ", "action_results": [null]}]}, {"action": "'Very well, I will leave.'", "result": "As you turn to walk away Cyrus approaches you. 'For the sake of the immortal gods, what are you doing?'\n\n'I'm going away, can't you see that?' you reply 'it is no use arguing with the oracle, the gods are displeased with me and I don't want to agitate them any more.'\n\n'But sir, I thought you were on some kind of important mission.'\n\nYou sigh. 'Yeah, well maybe I'm not the right person for this job. Why did I agree to this foolish journey in the first place? Because of me Greece will fall.'\n\n'Well sir, if you don't mind me for speaking... Although I don't know what you're talking about I might know a solution to your problem. Many years ago I heard a tale about a place where the living can speak to the dead, a place where the world of the living and the realm of Hades collide. Oh well, just forget about it, it's just a foolish tale. Please forgive me for wasting your time. I'll prepare for the journey home, I'll be expecting you in...'\n\n'Hold a minute. What did you just say. About a place where I could speak with the dead.'\n\n'Sir, it's just a myth...'\n\n'Trust me, I have seen some very strong evidence that makes them sound a lot more credible then you would think.'\n\n'Very well then. At the edge of the world there stands a rock, at the convergence of two great streams. There the world of the living and the realm of Hades cross-over. In order to speak to the deceased you will have to sacrifice to the souls of dead at that place. But, even if it is possible, how are they going to help you on your journey?'\n\n'I have heard long ago about a great seer, Teiresias is his name. If I am able to speak to him, then he might be able to help me. It is a slim chance but it is the best I've got. Prepare the ship, we will depart the first thing in the morning.'", "action_results": [null]}]}]}, {"action": "'Of course, I always have money to spare for those in need.'", "result": "The beggar looks sincerely gratefully at you. 'Thank you, great and noble traveler. The gods will surely reward you for your kindness and generosity. If only more people were like you sir. I'll always be grateful.'\n\n\nAnd with these last words the beggar walks away. You turn around to ask him who he is but to your astonishment you notice that the beggar has disappeared. After you walk around Thebes for a couple of hours you return to the ship, feeling good about yourself for helping the lesser fortunate.\n\n\nAfter a light dinner you return to your sleeping mat and you quickly fall asleep. You feel a soothing sense of weightlessness envelop you as you drift through the world of your dreams. The world is flooded with golden light and as you slowly drift through the light you never want to leave this state again. Then you see figures emerging from the light. You recognize the wise and owl-eyed Athena.\n\n\n'Greetings bard, great teller of tales. You have passed the trial the gods set out for you. I am glad that you have proven yourself worthy for this journey. But you are not safe yet, many perils will await you as Greece is about to fall.  You are on the right way, but you still can't afford any mistakes. Don't mock the immortal gods!'\n\n\n \n\n ", "action_results": [{"action": "You slowly wake up...", "result": "You wake up the next day after a peaceful nights sleep.\n\n\nAs you slowly open your eyes, blinking from the bright morning sun, you notice Cyrus standing next to your sleeping mat. 'Good morning sir, I hope that you slept well. I have taken the liberty to arrange a meeting with the Oracle for you today. And don't worry, we won't charge you extra money for this service.' He adds with a wink.\n\n\nAbout an hour later you are standing in front of the shrine of the priestess of Zeus. The shrine is a large imposing circular structure made out of gleaming white marble. As you admire the building, the huge bronze doors open to reveal the priestess of Zeus. She wears a long white robe and a bronze necklace around her neck and she is of great beauty. She looks like one of the immortal gods, who own the great sky, herself. She approaches you very solemnly, holding an incense burner while muttering prayers to the cloud gatherer Zeus.\n\n\nYou hesitate to address her, afraid to interrupt a sacred ceremony. So you just keep standing on your spot, watching the priestess and waiting until she is finished. When the priestess has almost reached you notice a boy behind her, holding a honey cake. The priestess stops, but the boy approached you with the cake, offering it to you. As he leaves he says just one word: 'eat'.\n\n\nAfter you finish the sweet cake a girl approaches you with a bowl filled with water. She holds the bowl in front of you and says just one word: 'wash'.\n\n\nAfter having washed your hands the priestess of the almighty Zeus finally approaches you. She speaks with a kind voice, but you can hear she is used to speak with powerful men and you detect some hints of conceit. 'Welcome, traveller. The gods have revealed to me in an oracle that you would come to me. That is why you, a commoner are given this last-minute divination. You have powerful friends among the gods, I can tell you that. Now, listen closely to what the gods have chosen to reveal to you through me:\n\n\n'You have started a journey with dangers above your imagination. However, it is your fate to succeed. Stay true to your heart and refrain from angering the gods and you will reach your destination. In the lands of the Spartans there is a great palace. Is's inhabitant, the great king Agatos, has been betrayed by his courtiers. Now, the flame of war has ignited the hearts of the Spartans, the flame that will engulf the whole of Greece if left unchecked.'\n\n\nThis is what the gods revealed to me. I understand what a terrible burden the gods have placed on your shoulders and I wish I could relieve some of it. My servants will serve you a banquet before you leave, I wish you good luck.'\n\n\nWith these words she retreats into the temple.\n\n\n ", "action_results": [{"action": "After the meal you stock up on supplies and set sail towards Sparta...", "result": "Apart from some near-collisions with crocodiles and other inhabitants of the vibrant Nile, your trip back across is rather uneventful. Fair winds are guiding you towards Sparta and the radiant sun is spreading it's warm veil across the deck of your hired vessel. With such fair winds blowing in your sail, the oars have been stowed away and the crew is relaxing on deck. you find yourself gazing at the horizon, wishing that all days could be like this one. But then you remember your daunting task, and dark storm clouds gather in your mind.\n\n\nCyrus notices your worried face and approaches you. 'My dear friend, what could possibly be bothering you on such a beautiful day? Like my  dear mother always used to say: 'Life's to short to waste a sunny day. Save your worries for when it rains.' She also had some other sayings, but those are not really appropriate in, well actually all sorts of company.'\n\n\nYour mood instantly brightens, you even manage to produce a smile. Following Cyrus' advice you just fit back and enjoy the voyage.\n\n\n...\n\n\nAs the starry night drives away the shining day, you and the crew go to sleep. Only a few crew members stay on deck to act as sentries. the worries that clouded your mind have not returned. You twist and turn in your sleep as a sense of foreboding doom fills your dreams. You see flashes of images: a beautiful mansion on top of white cliffs, dozens of swines approach you, a bedchamber with a magnificently decorated bed. Then a golden figure approaches and pushes away all other images: Athena, the owl-eyed protector of heroes. 'Brave traveller, noble bard, you're journey has only just begun. Sparta is still far away, but tomorrow you will reach an island, the island of the goddess Circe, the daughter of Helios, the sun-god. You will have to be on your guard, for she is a powerful witch, expect the unexpected and don't lose your objective out of sight: saving Greece from the flames of war. I wish you good luck.'\n\n\nWith these words she leaves your dreams.", "action_results": [{"action": "You wake up the next morning", "result": "The dawning sun is obscured by grey clouds as you stand uo from your sleeping mat. The sea which was a bright blue colour yesterday has now turned to a drab grey. A thick mist obscures your view and you can see the anxiety on the face of the ship's navigator.\n\n\n'I'm sorry sir, but a thick mist has set in during the night. I cannot guarantee that we are still on the right course. And given the urgency of your 'quest' I am sure you would not have liked it if we suspended our voyage.'\n\n\n'But I'd rather had...'\n\n\n'Yes, I'm sure you had wished the mist wouldn't have set in, but we can't change the past, can we?'\n\n\n'No, but that's not what...'\n\n\n'I thought so, so we'll just sea where the currents take us. Hahaha, sea, get it?'\n\n\nAnd with those wise words he walks away, laughing maniacally to himself.\n\n\nCyrus approaches you with a smirk on his face. 'So you've had a nice chat with our navigator huh. Well, he is a kind of a nutjob, but you won't find a better one in the whole of Greece.' He leaves again, chuckling.\n\n\nAs hours pass, the fog thickens even more and eventually it is impossible to see more than 4 feet ahead of you. Even worse, the ship is mysteriously losing speed. The navigator is walking around like a confused chicken, walking in circles while making strange noises to himself.\n\n\nSuddenly you hear surprised chatter among the crew. Several crew members are pointing at something in the fog. You gaze at the fog but you can't see a thing. But then, just as you are about to turn away you see it: blinking lights pierce through the fog. As if an invisible hand wipes away the fog, it opens up, revealing a green island. What immediately draws your attention is a large house on a hill, gleaming as if made of solid gold.\n\n\nAfter a quick meeting with the crew you decide that, since your ship now has lost all speed, you will all go ashore in dinghies. Of course your curiosity also played a part in this decision.\n\n\n \n\n ", "action_results": [{"action": "Continue...", "result": "You feel the familiar feeling of sands shifting beneath your feet as you step out of the dinghy. Beautiful palm trees dot the beach, providing shade from the blissful heat of the sun. Playful fish approach you and scurry away, following the coming and going of the sea. The deep blue waves of the sea shape the sand in an elaborate pattern, both beautiful and enigmatic at the same time, much like the rest of the island. You can see a large mansion on top of a low hill about 300 feet inland, surrounded by large gardens. Some distance from the mansion you see some piggeries.As you and your companions walk along the beach you can't help but wonder who lives in such a beautiful place, surely such a place would be fit for one of the inhabitants of the wide skies.\n\n\n The soft sands give way to marble steps, which form a path that leads to the luxurious mansion. Without a single doubt in your mind you climb the steps, determined to meet the inhabitant of such a wondrous place. As you near the mansion you notice that fatigue does not even begun to grip your limbs, nor those of your companions, on the contrary, you feel a blissful sense of joy overcome you as you near the mysterious dwelling. You look at the mansion in more detail. The walls are made of gleaming white marble, decorated with gold and silver fresco's depicting a rural scene: a shepherdess herding groups of animals, like pigs but lions and wolves too. The grand oaken doors are decorated with gold leaf and the silver knockers are shaped like hourglasses.\n\n\nYou are about to grab one of the knockers when the door opens on it's own accord, revealing a beautiful woman. Her beautiful white robe is fastened around her waist with a golden girdle. She wears her golden hair in a long plaited braid and on top of her head she wears a golden circlet. Her face is unfathomable, but her skin is white as milk. She speaks to you and your companions in a voice as sweet as honey: 'Excuse me, noble visitors, but I was not expecting you. May I ask you who you are and why you have come here?'\n\n\nYou answer her: 'noble lady, me and my companions have been traveling far and wide. But the gods have not favored us. The winds, which are sometimes the sailors best friends, but sometimes their enemies, have been absent for a long time and we have not been able to reach our destination. Our supplies have run out and then, like a sign of the gods, we saw your island on the horizon.'\n\n\n'I see... Of course I will give you enough supplies to continue your journey, the gods have not given me riches only to keep them to myself, have they? But to be honest: you look like you're starving. Please, come inside and join me for diner. I was just about to...'\n\n\nSuddenly a pig bumps into her. It then turns to you, shaking it's head violently. Astonished by this sight you fail to produce any comprehensible words. The mysterious woman, straitening her dress, speaks to you again:' Please forgive me, but one of my pigs must have escaped it's pen. Would you like him for dinner tonight? As I was saying, I would love to share my food with you, please do join me at my table. Oh, did I almost forget to introduce myself: my name is Circe.'\n\n\n \n\n ", "action_results": [{"action": "'My lady, I would like to thank you for your hospitality, we would gladly join you at your table.'", "result": "The dining hall is breathtakingly beautiful. The tables are placed in a circle in the middle of the room, in the middle of the circle roars a great fire that fills the hall with a warm glow. The food is exquisite, food and delicacies from all over the world are represented: dates from the east, flamingo from Aegyptos, olives from Syracuse and more seafood than you can name, all served in Carthaginian glassware and Roman pottery More fresco's of pastoral scenes decorated the otherwise bare walls. The marble columns that support the roof are chiseled in a way that makes them look like they are revolving around their own axis, grape branches have winded themselves around their tops. A giant loom is tucked away in a corner.\n\n\nCirce speaks amiably to your crew men, speaking to each of them with civility, listening attentively to their every word en laugh at every joke. It seems your men have a great time. Yet you are not as talkative as you usually are, and the delicious food just barely registers in your mouth. Seeing such kindness and joy you realize just how far you are away from your family and friends in Athens. With a sigh you remember every single face and every single smile. And now you are here, who knows how far away from your home, traveling on some journey given to you by either the gods of figments of your delusional mind, as for that you still aren't certain. Even more depressing is the fact that there is a very real possibility that you will never see your beloved ones again.\n\n\nYou hardly notice the soft hand Circe puts on your shoulder. 'My dear guest, I can see that something is bothering you. Is there any way I can help you?'\n\n\nYou try to turn your face away from hers. 'My graceful hostess, I am sorry. Here, in your warm house I realize how much I miss my beloved ones. Far away I have traveled from them and I scarcely said goodbye to them. And now, I don't know, I am just a little bit depressed.'\n\n\nShe answers you with a kind smile, looking absent, as if gazing at something far away in the distance: 'My dear guest I know how you feel. My family is far away from here as well and the man who I loved most in the whole world has left me long ago. You kind of remind me of him. He too was a traveler, far away from his home after he got lost at sea. The god Poseidon cursed him and he and his men arrived at my island. They stayed for a year, but then they left again, taking my heart with them.' she shakes her head as if to bring herself back into the present, 'but now is not the time for sad reminiscence, let us drink and be merry and forget our troubles for a while. Here, let me refill your cup with this exquisite wine, it's almost magical.'\n\n\nShe pours a deep red wine into your cup. Trying to forget your sad thoughts you taste it. It is the sweetest, most delicious drink you have ever tasted. Like the honey that is made painstakingly by the smallest bees and is the sweetest thing known in the Greek world, and when one eats it one cannot but forget his troubles for a brief while. Even that cannot match the wine you are tasting right now. You quickly drain the cup.\n\n\nThe wine leaves the faint taste of herbs in your mouth and a drowsy feeling in your head. Your eyelids are becoming increasingly heavy and you feel your head drop. As you look across the table you can see the same thing happening to your men. As you look to her to ask for an explanation you see her grabbing a wand from a dresser. She can see your question in your eyes and she answers you with her sweet voice: 'But you won't leave me. You will stay here, with me, until the end of times, just like all other travelers that have come here since my love left me. But to make sure you won't escape I have to may a few arrangements.'\n\n\nShe gracefully walks towards you. You try to back away, but your limbs won't listen to the signals from your brains. She lifts her wand menacingly and you close your eyes. The pain you are expecting stays away and you only feel the gentle tap of Circe's wand upon your head. As you open your eyes with relieve you notice that something is wrong. You see your hands turn into hoofs before your eyes and a snout sprouts where your nose used to be. You fall of your chair, on all four of your legs. You are only able to make grunting sounds as you try to shout to your men.\n\n\nThe last thing you are able to register with your human mind are the kind words of Circe: 'Come, come little piglet. We'll have a great time together, until time itself seizes to exist.'", "action_results": []}, {"action": "'My lady, I would like to thank you for your hospitality, but I am not feeling well, I regretfully have to decline your invitation.'", "result": "Something just does not feel right. This whole island is just to perfect. The way Circe acts is too kind, she is too trusting and that pig must be a sign of the gods. You tell Circe you're going back to the ship to rest a little. When she asks you with a sad face if you could at least tell your other men about the dinner you promise her you will. As you walk back across the marble steps you spot docile lions and pigs in their respective pens. Something about the way they look at you doesn't feel right either. Their looks are not those of wild animals, on the contrary they almost look... human.\n\n\nYou neither saw nor heard him approach you but you suddenly feel a hand tapping you gently on your shoulder. As you turn you see the youthful face of Hermes, the keen-eyed messenger of the gods. 'Strange, aren't they, they have the appearance of animals yet they also seem human. Yet neither the one, nor the other. I can see you have questions and the gods have sent me to answer them.'\n\n\nYou don't know where to start and you ask him quickly, as if he'll withdraw his statement if you don't ask something quickly enough: 'Why are we here?'\n\n\n'The gods are testing you.'\n\n\n'Athena gave me a warning about a woman named Circe, was that her?'\n\n\n'Yes, Circe is a witch, she bewitches men with herbs and magic spells. Hear my words and heed them well: these animals you see before you weren't always animals. They were men who were stranded on Circe's island, castaways, merchants, anyone unlucky enough to set foot here is turned into an animal.'\n\n\n'What about my men?'\n\n\n'They too, will be enchanted, cursed to walk the earth as an animal until time itself seizes to exist.'\n\n\n'Isn't there anything I can do to stop her?'\n\n\n'There is a way. Circe bewitches men with the help of magical herbs. However, there is a way to make you immune to her vile witchcraft. Close your eyes.'\n\n\nAs soon as you close your eyes you feel the gentle touch of Hermes' staff on your forehead. Images of a strange plant float into your mind. It's flowers are white, yet it's roots are black and it's leaves are green, with small white stripes running across the length. You want to open your eyes to ask Hermes what kind of herb he is showing you but you cannot manage to open them.\n\n\nYou hear Hermes' soft voice, yet you could swear your ears don't register a thing: 'the herb you see is known by the gods as 'Moly', a powerful herb that counteracts any harmful effects done to the one who eats it. However, anyone who tries to pick them without the permission of the immortal gods will die on the very spot. Use it to stop Circe and rescue your friends, but remember: don't lose sight of your objective.'\n\n\nSilence falls after he spoke these words and after a minute or so you find you can once again open your eyes. The marble step upon which Hermes was standing a moment ago is now empty, bearing no trace or evidence that it was just treaded upon by a deity.\n\n\nRemembering Hermes' words you spend the next hour searching the island for this so called Moly.", "action_results": [{"action": "As you finally find the herb you quickly ingest it and make your way to Circe's mansion.", "result": "The scene you witness as you enter Circe's dining hall is... weird to say the least. The hall is magnificently decorated: the walls are covered with fresco's depicting pastoral scene, much like the ones that decorate the outside walls. The marble columns that support the roof are chiseled in a way that makes them look like they are revolving around their own axis, grape branches have winded themselves around their tops. A giant loom is tucked away in a corner. The dining tables are placed in a circle in the middle of the room, filled with delicacies from all over the known world: dates from the east, flamingo from Aegyptos, olives from Syracuse and more seafood than you can name, all served in Carthaginian glassware and Roman pottery. In the middle of the circle burns a great fire that fills the room with a warm glow.\n\n\nThe strange thing, however, is that Circe is sitting all alone at one of the dinner tables, surrounded by a herd of pigs. Half emptied plates and spilled cups of wine diminish the otherwise superb setting.  You approach her as if you are unaware of her malignant intentions. 'My graceful hostess, I hope I am not too late to attend to your dinner. I am feeling better after a quick rest and I would hate to leave without seeing you again. The rest of my men are tending to chores on board of my ship but they will join us in a while.'\n\n\nShe looks at you suspiciously, trying to gauge your intention, but you manage to fool her. 'Very well my noble guest, please join me at my table. Your companions are resting upstairs, I'm afraid that they have eaten a little but too much. but who can blame them, the food is delicious. Please, try some, I'll fill a plate for you if it pleases you. But first, let us drink to your health.'\n\n\nShe gives you a cup of wine. You accept it gracefully, acting as if you didn't catch her sly smile. As you raise your glass you proclaim: 'And to your health as well, fair hostess, that we may drink to your good intentions.'\n\n\nAfter these words you drain your cup. The wine is the sweetest, most delicious drink you have ever tasted. The honey that is made painstakingly by the smallest bees and is the sweetest thing known in the Greek world, and when one eats it one cannot but forget his troubles for a brief while. Even that cannot match the wine you are tasting right now. However, the sweetness of the wine cannot completely hide the taste of unknown herbs.\n\n\nCirce speaks to you with a sweet voice: 'Do you like the wine, my noble guest? Isn't it the sweetest thing you have ever tasted? I keep it specifically for my most valued guests. Too bad though that it bewitches the senses, making one unable to fight off the winged sleep. Unable to defend oneself.'\n\n\nShe rises from her seat and walks towards you, holding a wooden wand in her hand. She taps your head gently with her wand and backs away, awaiting the effects of her magic powers. When nothing happens she raises her hands to the heavens and speaks to you in an astonished voice: 'How is this possible? Why are you still a human?' she suddenly stops speaking, you can see comprehension in her eyes,'of course I should have known, it's HIM all over again.'\n\n\nWhen you try to ask her who she means she interrupts you, paying no attention to your presence whatsoever she continues her furious contemplation: 'A whole year he and his men stayed at my house. A whole year he passed with me, but he had to leave because he missed his home and his wife! His MORTAL wife! I would have given him anything, I would have even made him immortal! But he left me, taking my heart with him.'\n\n\nWhen you once more try to ask who she is talking about she sneers at you: 'Like you don't know him: that Ithacan, who stranded here when he sailed from Troy. The one cursed by the earthshaking Poseidon.' She bursts into tears. 'But you remind me of him, yes, you even look a but like him.'\n\n\nShe walks towards you, having a strange look in your eyes. You quickly stand up from your seat and walk away from her, keeping her inside your vision at all times. Circe extends her arms towards you. 'Please noble hero, please let me embrace you. I have just felt so lonely, all alone here on my island, with only these pigs to keep me company. Could you at least do me this honour? I promise I'll turn your men back to their human forms.'", "action_results": [{"action": "You just don't trust this witch, this could be a trick. You quickly back away and run back towards the ship, leavind a baffled Circe behind.", "result": "The remaining crew member ask you about their companions when you return to the ship alone. Since it's no use lying about it, you tell them the whole truth, all the things that happened in the accursed mansion of Circe, including your escape. You see the faces of your cew members twist as you tell them you left their friends behind, but they don't say anything about it.\n\n\nThe rest of the day you do your best to try to ignore the tense atmosphere on board of the ship. As the sun gives way to the starry night sky you curl up on your sleeping mat, feeling the emptiness of the ship pressing on your shoulders. Your dreams are troubled. Images of the events of the past day are flashing through your mind, bringing guilt along with them. The golden glow of a divine presence this time does not relieve you of your troubled thoughts. The angry image of the cloudgatherer Zeus pops into your mind. A crown made of lightning bolts rests upon his grey hair, twisting and contorting as a nest of angry snakes.\n\n\n'Cowardly bard, despicable craven, shame of Athens. Does it feel good, leaving your friends and comrades behind? You were chosen to rescue the people of Greece, yet you don't even try to rescue those you travel with. You despise me, coward.' you could swear he grows while he scowls at you and while you struggle to think of an answer his angry face looms over you. 'We, the immortal gods have decided upon your fate, and we have found you unworthy for the task we gave you. We have decided you will have to leave this world.'\n\n\nRoaring thunder appears over your head as the immortal kings walks away from you. You feel as if your burning up, as if a thousand knives plunge into your flesh. It feels as if your torment lasts for ages. The cold embrace of death finally relieves you of your agony.", "action_results": []}, {"action": "What harm could a simple embrace do? You decide to grant her this one favour, also for the sake of your men.", "result": "You feel Circe's hot tears falling upon your shoulders as you give her the embrace she desires. Between her sobs she speaks to you, still holding you captive in her embrace: 'You know, I really loved that man. But I realize that he won't come back. You are not him and you will never be able to replace him in my heart. At least he was clever, and you aren't. He would never have fallen for such a transparent trap.'\n\n\nYou see bronze glimmering in the corner of your eye. As you realize what Circe is planning to do you try to wrestle free from her grip, but it is to no avail. The love-maddened goddess has taken of of the knives from the dining tables and makes sure you never leave her mansion again. The marble floor feel cold against your skin as your red life force is being drained from your body, the beautiful white floor turning slowly red.\n\n\nBefore you trade in the mortal world for the underworld you see Circe playing with the bloody knife, muttering incomprehensibly to herself.", "action_results": []}, {"action": "You still don't trust her. She still remains a witch after all. On the other hand: you need to rescue your men. You decide to embrace her, after she swears by the immortal gods she won't harm you or your men.", "result": "She smirks at you. 'Hmpf, I guess you're not that foolish after all.' you see a bronze knife falling from her hand. 'You really are like him. But I guess you have to go too, huh? Why are the gods so cruel? But I'll keep my promise, I'll turn your friends back to their human forms. Although, to be honest: I like them more as pigs.'\n\n\nThe next half hour she goes through the big hall, tapping each and every pig on their heads with her wand and muttering incantations. Finally, all your companions are returned to their original selves. Afterwards, Circe approaches you. 'My noble hero I understand I've caused you and your friends a lot of trouble, and I am deeply sorry for it. Please, let me make it up to you by letting you stay here for a while, to rest and to regain your strength for the rest of your journey. I promise by the immortal gods that I won't harm any of you, else they may take my soul and lock it away in the Tartaros, the deepest pit of the underworld.\n\n\nAfter a quick decision with your men you decide to accept Circe's offer and spend some time on her island to regain your strength. Your men each get spacious rooms assigned, but you sleep in Circe's own chambers. You dine exquisitely each day (although you are never served pork) and Circe is the perfect host, with no intentions whatsoever of hurting anyone. The time between meals you spend with Circe, walking on her beautiful island, playing games beneath a pergola while enjoying the cool breeze from the sea or take a swim in the beautiful blue waves. Everything is just so perfect, you never want to leave.\n\n\nHowever, eventually the time comes when the gods have grown tired of waiting for you to resume your journey and they send Hermes to command you so. As you and Circe reach the top of the marble staircase that leads to her mansion you see the keen-eyed messenger of the gods standing before you. 'Noble bard, the immortal gods have sent me to bring you a message. You must continue your journey to Sparta or Greece will be destroyed by the flames of war. I advice you to do as they say.'\n\n\nYou look to Circe, ready to say goodbye, but when you see her sad but beautiful face you hesitate. Seeing the hesitation in your eyes she speaks to you despairingly: 'Please, my noble hero, you do not have to leave me. Stay here and live here with me until the end of days. You like it here, you said so yourself during one of our walks. Please... please consider it.'\n\n\nHermes speaks sternly to you: 'Remember your journey, mortal. Remember those who depend on you. You have to leave, now!'\n\n\nTorn between your duty and your newly found love for Circe you decide...", "action_results": [{"action": "to stay with Circe", "result": "You are standing on top of the marble stairs, watching your ship sail away in the distance. With a sad heart you said goodbye to the men you've experienced so much together with. Circe offered them to stay, but they declined. Like Cyrus told you before they left: 'However you put it, we remain mercenaries. The seas and the battle are our homes, we weren't made to stay put in one place.' Circe left you alone, to say your goodbyes and to reminisce about your past adventures, but now she walks towards you. 'Come, my love, please let happiness drive the sadness from your heart.'\n\n\nYou follow her advice and try to forget the sad goodbye. You are happy here, on this beautiful island with the woman you love, yet you keep this doubt hidden into the deepest parts of your heart that you should have continued your journey.\n\n\n---\n\n\nYears go by and you and Circe still live happily together on the island. One more time Hermes has come to you, pleading you to continue the task given to you by the gods but you just dismissed him. Athena visited you in your dreams once, telling you the largest part of the Greek States were engulfed by war, but wishing you good luck and much happiness none the less. Life has been blissful to you, you can't even remember the last time you were sad. You've truly left your past life behind you and you and Circe live happily together until the end of time itself.", "action_results": []}, {"action": "to continue your journey", "result": "You watch Circe's island growing smaller and smaller until it has finally sunken beneath the horizon. You said your goodbyes to Circe with a troubled heart, promising her you'll come back while deep down you knew you wouldn't. Circe has given you new supplies so you can resume your journey to Sparta.\n\n\nOn top of the white marble steps, with the sun setting beneath the horizon in the east, you gave each other your farewell kisses. The creeping chill of the evening marked your parting. Circe waited on the beach until your ship set sail, watching you as you watched her. But now you are both out of sight of each other. The dream has ended, your break is over, and now you have to continue your journey.\n\n\nThe winds are blowing again and the stars are clear, giving guidance to your crew. Shaking your sad thoughts away you walk towards the navigator: 'Set sail towards Sparta, don't make any stops until we've arrived at their docks.'\n\n\n ", "action_results": [{"action": "Of course, this is easier said than done...", "result": "Either the gods have not done testing you or your navigator is just really incompetent, but a month later you still haven't reached Sparta. The supplies given to you by Circe, which should have been enough to reach Sparta, are all but gone. Your crew is faced with near starvation. You hear the desperate prayers of the crew members, praying for food or rain, and it pains you that you are unable to aid them.\n\n\nEven Cyrus, who supported you throughout your journey is starting to doubt. He walks up to you with a worried face: 'Noble customer, and dear friend, I have stood by you during the hard times we've encountered on this journey but now I am starting to lose hope. I thought you were aided by the gods on this journey, you have those dreams, right? But what now, are the gods testing us, have they abandoned us and left us to die here on the wine-coloured waves?'\n\n\n'I wish I had an answer for you, I really do, but I just don't know. I wish I knew a way to get things right, but I don't. Our fate is now in the hands of the gods. I'm sorry, but my advice is: have faith in the gods, our journey is righteous and the gods will help us. Let us sleep for now, let our minds wander into the realm of dreams and forget about our horrible situation, at least for a moment.'\n\n\nAnd so you curl up once again on your sleeping mat, your belly rumbling and your mind troubled. But as you predicted before long your mind departs to the realm of dreams. You are walking across a shadowy island, inhabited by the shadows of oxen. The shadowy grass feel surprisingly soft beneath your ghost-feet. The shining image of Athena approaches you, accompanied by a solemn looking owl. 'Great bard, pride of Athens, you have come a far way since the day you first saw us. The immortal gods have always watched you on your journey and they always will. It pleases us to see you have not lost your faith in the immortal gods, even after so much hardship. However, your trials have not yet come to an end. Tomorrow you will reach the island of Trinacria, a sacred island belonging to the sun-god Helios. Whatever you do, do not disturb the cattle of Helios.'\n\n\nWith these words the wise Athena leaves.", "action_results": [{"action": "Trinacria", "result": "You are violently awoken by a crew member, shaking you enthusiastically. As you struggle to remember just where you are you hear him speak to you: '... 've arrived at an island, sir. No, but not just an island, a fertile island. Fertile, yes, with lots of oxen walking upon it. And fresh water! Lots of it.'\n\n\nYou grumble. 'Calm yourself down. Can someone please explain me what is going on, calmly?'\n\n\nAnother crew member, an older man with grey stripes through his hair, approaches you: 'Our prayers have been heard, sir. This morning our navigator spotted a large island, with lush meadows and filled with oxen! A small party went ashore and they reported seeing herds of oxen and pools of fresh water. We have been saved, sir, we have been saved!'\n\n\nYou quickly jump up from your sleeping mat and rush to the dinghies, trying to prevent the crew from leaving the ship. 'Listen to me, all of you. Whatever you may think, however hungry you are, do not, I repeat, do not harm these oxen. You may drink as much of the water as you like but the oxen must remain unharmed. They are the property of the sun-god Helios. Eating them will have dire consequences.'\n\n\nBut despite your attempts, the crew doesn't listen, your pleas get lost in the sea of gleaful shouts from the crew. Their ears plugged by hunger and thirst they slaughter the first oxen that catches their view, hardly taking time to roast the meat they gorge themselves, slaughtering even more oxen as their stomachs command them to. You despairingly gaze at this scene, fearing that this means the end of your journey, and possibly of your lives.\n\n\nCyrus approaches you, his chin gleaming with fat. 'Why the sad face, we finally have filled stomachs again?'\n\n\n'These were the sacred oxen of Helios, the god of the sun. the gods specifically, specifically warned me. But now all is lost.'\n\n\nYou sigh heavily and grab fistfuls of hair with your hands.\n\n\n'Not every dream is a true one, sir. How could something like this not be a sign of the gods. They heard us beg for food and so they sent us these oxen. You seem hungry yourself sir, I bet there is still some food left, why don't you try some? I promise you you'll immediately feel better.'", "action_results": [{"action": "Maybe he is right, what if your dream was just that: a dream? You decide to try some of the meat.", "result": "Cyrus was right: you do feel a lot better. After you tried some of the meat you couldn't control yourself and you ate as much as you could before your stomach was completely filled. Either it was due to the hunger or to the godly nature of the oxen but it was the best meat you have ever tasted in your life. After washing it down with some fresh water from a nearby spring you returned to the ship.\n\n\nNow you lie on your sleeping mat, gazing at the stars, feeling content about your filled stomach. Your attention is caught by a brightly shining star. Since you started your journey in Athens you have learned a lot about the stars from the navigator of the ship, since the stars guide ships at night sailors know a lot about the constellations. This star, however, you have never seen before. If you didn't know better you could swear it is shining brighter and brighter.\n\n\nAfter a couple of minutes your other companions notice this star too. You hear confused talk among the men, every one of them trying to guess just which of the countless stars it is. Deciding you'll won't find out any time soon you close your eyes, trying to catch some sleep. The strange thing is, however, that you are able to see it, even through your closed eyelids. When you open your eyes again the star has almost quadrupled in size and is almost shining as brightly as the sun. It's almost as if you can feel the heat coming off of it.\n\n\nWhen the truth about this star finally hits you it's already too late. Tons of flaming rock crash into your ship with a speed unlike anything in this world, even the swift eagle couldn't match it. Men and wood burn alike as the flaming wrath of Helios reaches them.\n\n\n ", "action_results": []}, {"action": "No matter how hungry you are you don't give in to the temptation. You go ashore, but you only drink some water to settle your rumbling stomach.", "result": "You are lying on your sleeping mat, trying to ignore the sounds coming from your stomach. You hear laughing coming from the crew members, contents men with filled stomachs are talking loudly to each other. You try to take your mind of food by gazing at the stars. Your attention is caught by a particularly brightly shining one. Since you started your journey in Athens you have learned a lot about the stars from the navigator of the ship, since the stars guide ships at night sailors know a lot about the constellations. This star, however, you have never seen before. If you didn't know better you could swear it is shining brighter and brighter.\n\n\nAfter a couple of minutes your other companions notice this star too. You hear confused talk among the men, every one of them trying to guess just which of the countless stars it is. Deciding you'll won't find out any time soon you close your eyes, trying to catch some sleep. The strange thing is, however, that you are able to see it, even through your closed eyelids. When you open your eyes again the star has almost quadrupled in size and is almost shining as brightly as the sun. It's almost as if you can feel the heat coming off of it.\n\n\nWhen the truth finally hits you you realize it's already to late. The heat from the flaming comet has already set fire to the sails. You close your eyes and wait for the end...\n\n\nAnd suddenly you feel as if an invisible hand smacks into your side, sending you flying through the air. You feel the cold waves of the seas crashing onto your body as you are thrown of the ship. As you open your eyes in shock you witness the destruction of your ship. Men and wood are burned alike as the flaming tons of rock smash into them. A piece of driftwood comes floating by and you grab it tightly. Desperation takes control of your heart as you see your companions burned before your eyes. The screams of the dying are terrifying. You try to block everything out, try to make everything leave, all misery and suffering, but it just won't work. Eventually all noises fade and the fires die out. You pass out from pure strain.", "action_results": [{"action": "You feel alone, drifting through darkness.", "result": "The darkness around me is lifting.\n\n\nAm I dead?\n\n\nWhat happened to the ship?\n\n\nWhere am I?\n\n\nWhat happened to my friends?\n\n\nI guess they all died...\n\n\nWhy have I survived?\n\n\nI'm floating, moving on the waves.\n\n\nYet, I feel the soft ground beneath me.\n\n\nDistant voices... Am I in Hades?\n\n\nI can hear the wind blowing in the distance.\n\n\nBut why can't I see anything?\n\n\nCan't move either.\n\n\nHow did I get here?\n\n\nAh, my head, it feels as if I've been hit by Polyphemos.\n\n\nHmmm, the darkness is returning.\n\n\nMaybe I'll go back to sleep...", "action_results": [null]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"action": "Tell the crew to ready their weapons", "result": "'Okay, we are about to be attacked by some kind of monsters. Prepare your weapons, we will not fall today!' However, the crew doesn't listen, they are still under the spell of the strange song.\n\n\nYour mind becomes clouded once again as the song fills your mind.\n\n\nYou struggle to keep a hold of yourself as the song becomes louder, you must be getting closer to the source.\n\n\nSuddenly the ships shakes and cracks as it hits sharp rocks that lie beneath the water's surface.\n\n\nThe skies darken as strange beast, half women, half bird, appear from the skies. The hypnotized crew members put up no fight as the women drag them of the deck of the ship. As one of the sirens sets it's eyes upon you, you are not able to draw your sword.\n\n\nThe last thing you hear before your soul is sent to the realm of Hades is her beautiful, bone-chilling song.", "action_results": []}]}]}, null]}]}, null]}]}]}