{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=58502", "context": "", "first_story_block": "“Are you sure we should be doing this?” the nervous voice of your best friend, Harlan, asks.\n\n“Of course. I can do whatever I want,\" you reply.\n\n“What if the King finds out?”\n\n“Ha! So what? I’ll deal with him. There’s not much he can do to me that he hasn't tried before.”\n\n\"It’s not you I’m worried about...”\n\nThough you wouldn’t admit it out loud, you know Harlan is right. Being the second-born prince of the Brelia Kingdom had its benefits. Unfortunately for Harlan, he wasn't afforded the same privilege and would likely be punished much more severely.\n\nYou both sat at the bar in one of the city’s shadiest taverns, The Dancing Goat. Lately, you've become somewhat of a regular. You always wore rugged attire, but its patrons somehow assumed you were nobility, probably because you never argued on price like most everyone else. Once a week, The Goat held fights and it wasn't uncommon for the matches to end in death. After weeks of being thoroughly entertained in the crowd, you were ready to test yourself in the ring.\n\n“Hey, pretty boy. Are you ready to pop your cherry?” the announcer’s ragged voice resonates over the bar noise.\n\nYou empty your cups contents.\n\n“If you have anyone skilled enough to challenge me.”\n\n\"The brash ignorance of youth!\" the announcer replies. \"You're not the first soft face to wander in here. Most don't leave as pretty as they come in.\"\n\n\"I intend to stay this good-looking for awhile, old man,\" you reply.\n\nA burly hand grabs your arm and drags you into the circle of a screaming mob. Looking around, you see the drunken faces of screaming gamblers. Standing your opposite and a full head higher, you instantly recognize your opponent. That’s the fucking champion, you think to yourself. His heavily muscled frame is marked with numerous scars. His eyes meet yours and upon sizing you up, the corner of his lip curls into a grin.\n\n\"Ladies and gentlemen! Our very own nobleman has finally grown a pair. I just hope he remembered to clean his fingernails for the occasion (the crowd laughs). Who will welcome him to the pit? A man that needs no introduction. A man that has never been defeated. The champion, Carthus!\"\n\nAt the mention of his name, Carthus lets loose a primal scream and beats his chest in pride. The crowd roars into a frenzy at the sight of the monstrous champion.\n\n“Fight!”\n\nCarthus rushes at you like a crazed bull. You're unsuprised by his tactics and quickly get a feel for the man's combat prowess. An untrained man of his size, he depends upon superior strength to compensate for lack of technique. You easily side step his mad charge, tagging him with a right hook on the way past. Angered by the blow, Carthus turns to you and starts a second charge.\n\nYou stand still until he’s almost upon you. Just before he reaches you, your arm underhooks his shoulder and you use his momentum to swing onto his back. You throw hard elbows to the back of his head to soften him up a bit. Dazed by your blows, you slip your arm underneath his chin and lock the choke with both arms. He bucks and grabs at you with both hands in attempt to throw you off. Holding with all your strength, you press your body into his and wrap your legs around his massive frame to keep your center of gravity even with his.\n\n“Arghh!” you yell as Carthus bucks and flails around the ring.\n\nAfter a few moments, the lack of air gets to him and you feel his body begin to go limp. His body falls to the ground with an earth-shaking thud. You're careful not to be squished by the falling giant.\n\n“Victory! Nobleman!”\n\n“Pour me another drink and bring on the next challenger!” you shout to the cheering crowd.", "action_results": [{"action": "The Next Morning", "result": "You feel the events of last night as you wake up. The massive bed, filled with pillows and silk sheets, offers little relief to your pulsing headache. Natalie sure as hell enjoys it though. You didn’t exactly plan for things with the house-servant to escalate this far. The two of you were childhood friends ever since her mother became a handmaiden to your mother, Queen Laurine.\n\n“Nat,” you gently nudge her awake. “Think you could scoot over a bit to give me more blanket?”\n\nWith a soft moan she shifts her weight, loosening slack on the covers. She finishes the movement by pressing her bare skin against yours. Overwhelmed by her soft skin and aroma, you briefly forget about your headache and parched throat. Just as you make your move, someone knocks on the door. You ignore it, but another knock echoes in the room. Cursing, you grab a robe from the floor and make your way to the bedroom door. The morning coolness stings your bare feet on the marble floor. Sunlight shining through the sheer, satin drapes reminds you again of the headache. Creaking the door open, you see one of the house servants.\n\n“Samuel, what are you doing here?” you ask.\n\n“Prince, you are required in the court,” he replies.\n\n“What do they want? They rarely ask for me.”\n\n“Not sure, prince. It sounds important though. All the upper nobility are there including Baron Reginald and Duke Kane.”\n\n“Fine. Inform them I'll be there shortly.”\n\nWith a nod, Samuel turns and walks down the hall. You slam the door shut, completely waking Natalie up in the process.\n\n“What — you’re already leaving me?” she playfully whines.\n\n“Sorry, Nat. It's a shame their precious first-born, Urijah, is away otherwise they’d summon him instead. It must be important if they’re not willing to wait for his return.”\n\n“Well don’t take too long. You and I have unfinished business here.”\n\nFully exposing herself, she slides out from beneath the covers. Her hair length is almost enough to conceal her chest. You smile, thankful it wasn't grown out more.\n\n“You must be on guard when approaching the court.” she warns gliding closer towards you. “Dangerous people seek to occupy places of power.”\n\nWith her final word she reaches for a dagger on the nightstand. The blade makes a shrill sound as its razor sharp edge is revealed. In a quick motion, she thrusts the point towards your throat. Despite your poor condition, instinct takes over. Ducking from the thrust, you grab her hand around the hilt and twist backwards, forcing the dagger from her hand and pinning her against the wall.\n\n“Dangerous people are everywhere,” you whisper from behind.", "action_results": [{"action": "The Royal Court", "result": "A little later you make your way to the throne room. Hopefully Nat's distraction didn't make you too late. You swing open the heavy double doors and instantly see Queen Laurine's scowl upon your tardiness. Figuring it would be better to draw less attention, you take the first open seat at the back of the room.\n\nKing Orson and Queen Laurine sit upon their thrones in front of rows of extravagantly-dressed noblemen and women. In the front row you eye the backs of Duke Kane and Baron Reginald. Both held incredible military might and seemingly endless wealth. It's no surprise they have the best seats as both were instrumental in the growth and defense of the kingdom.\n\nDuke Kane's Order of Knights were the best trained warriors in Brelia. More than a few times, King Orson called upon them to protect the kingdom. As far as you knew, the Duke was loyal to the throne. His son, Garrick, was highly regarded for his weapon mastery and dueling ability.\n\nBaron Reginald was more of a loose cannon. His background in politics and trade meant he relied upon his guile rather than raw physical strength. The Baron was a well-informed man. Nothing stayed a secret from him long. For that reason, you’ve always kept a safe distance away from his daughter, Caitlyn.\n\n“...they have grown too bold. We must show them the military might of Brelia!” the baron's voice rings out over the crowd.\n\n“Nonsense Reginald,\" Duke Kane interjects. \"Moving soldiers near to the border would look like an invasion force on Rath. We have been at peace for a decade now. We don’t need to give them cause for another war. Besides, Prince Urijah is on a diplomatic mission in Rath. We risk losing the heir to the throne if we assemble soldiers near the border.”\n\n“We can’t just allow our villages to burn! My King, we must act!” the Baron replies heated.\n\nKing Orson holds a hand up, silencing the crowd from growing louder. He stands from the throne and paces a few times back and forth as if in an internal debate. His fingers find his lengthy beard in thought. After a few moments, he looks up and addresses the court.\n\n“We must not act in a way that would appear aggressive to the Nation of Rath,\" he speaks. \"Many of our countrymen died in the war and I would not dare compromise their sacrifice—”\n\n“—but my King!” Baron Reginald interjects.\n\nOrson silences him with another wave of his hand.\n\n“Your King is speaking. You would remember your place, Baron,” the king icily spoke, “I will not forsake our citizens to invaders, bandits, slavers, or anyone else. I will send a small company of soldiers led by my own son to discover the threat at our borders. I will not put the heir in danger by sending a full battalion. My second born will scout and report back. Then we will decide the best course of action. If Rath has betrayed our peace treaty, then they will face the full might of Brelia. My son, step forward.”\n\nShaken by the King’s command, you rise from your chair and walk towards the front of the room. At this point, every eye in the room is fixed upon you.\n\n“My son. You have heard the trial placed before you. Along with a few of my elite soldiers, you will travel to the western border and discover the source of these attacks. I am taking a risk sending the second born while the heir is on a diplomatic mission, but there is no one I trust greater to accomplish this task. I will not be the only parent taking such a risk. Garrick, son of Kane, and Caitlyn, daughter of the Baron, step forward. You will accompany the prince. The court understands the threat of our border is something that cannot be ignored. You will depart at first light.”", "action_results": [{"action": "Journey to the western border", "result": "A small company of a dozen well-armed soldiers ride behind you in two rows of six. You ride in the lead with Garrick to your right and Caitlyn to your left. You do your best, unsuccessfully, to ignore the way she gracefully rides. Her blonde hair flows behind her as if soft waves rippling on the shore. The morning chill makes the journey’s start less enjoyable. Even more so when you imagine the warmth of Natalie in your bed. The soldiers ride stoic and alert, not telling jokes or sharing stories. Talking is kept at a minimum to limit distraction from potential threats.\n\nThe soldiers, donned with light leather armor, carry a variety of weapons between them. Each has a melee and ranged weapon. Some have bows strung over their shoulder with small bucklers on their back. Others carry throwing spears to compliment their battle axes. Though deadly, you were confident your combat skills surpassed theirs. Your father ensured you started training from the moment you could walk. There isn't much you remember of your childhood beyond the endless hours training with the weapon masters. They made sure you mastered every weapon, to always be deadly and effective no matter the circumstance. Complimentary to the physical training, your father brought in sages to teach history and battle tactics to train the mind as well as the body.\n\nYou have a long journey ahead of you. It might be beneficial to get to know Garrick and Caitlyn before arriving at the western border, although you always have the choice to ride in silence.", "action_results": [{"action": "Get to know Garrick", "result": "You ride up beside Garrick, noticing his perfect posture and stoic demeanor.\n\n“Your father really did a number on you, huh?” you ask.\n\n“What’s that supposed to mean?”\n\nRealizing that's probably not the best way to start a conversation, you reply, “I mean, I know all about growing up with a strict father. Hell, when your father’s the King, he doesn’t want his children to embarrass him, but you act like you never enjoy yourself at all.”\n\n“I have fun,” he answers.\n\n“Yeah? Like what?”\n\n“Sometimes after daily training, Hector and I will practice the lute.”\n\n“I always figured you for a softy. That rough exterior just screams compensation. Who’s Hector?”\n\n“Fuck you, man.”\n\n“Hey, I’m just trying to be friendly here. We have a long road ahead of us. Might as well make the most of it. I won’t tell the Duke you’re queer.”\n\nYour comment makes Caitlyn snicker in the background.\n\n“I’m not queer, you weaselly piece of shit.”\n\n“Now that’s no way to treat your prince…”\n\nGarrick stops moving and turns towards you.\n\n“You know as well as I that you can’t do anything to me. So why the fuck would you try to pull rank like that? The King knows that you aren’t interested in leading our people. Your consistent belligerent actions speak for themselves. You’ve never experienced discipline or tested your willpower like I have. Since I could walk, my father trained me personally and recruited the best instructors in the kingdom to mold me into the knight that I am today. I have never been bested in a duel and the King knows my worth. Surely, he knows that I am more valuable to the kingdom than your sorry ass.”\n\n“Those are bold words coming from an esteemed musician such as yourself. I’ll let it slide this time because I was having fun with you, but if you ever threaten me again you’ll have to rethink your title of 'Undefeated Duelist'. You think just because I don’t act uptight and walk around with a stick up my ass my life was any easier? Maybe my light demeanor and tendency to drink is because I understand life is more than training and stern lectures. Say what you want, but at least I’ll enjoy myself.”\n\nCaitlyn, overhearing your conversation, approaches the two of you.\n\n“Now boys, break it up.” She clicks her lips in a disapproving manner. “We wouldn’t want to make Hector jealous now, would we? Here take this and stop bickering like a couple of newly weds.”\n\nShe tosses a bottle of rum which you catch with one hand.\n\n“Sorry, Garrick. I hate to disappoint, but your company really doesn’t compare to a good drink.” You pop the cork and take a swig. “Looks like you’ll have to ‘play your own lute’ tonight’.”\n\nBefore he has a chance to reply, you ride back up to the front of the group leaving Garrick by himself.\n\n“Fucking princes,” he mutters under his breath.", "action_results": [null]}, {"action": "Get to know Caitlyn", "result": "Later that evening, you see Caitlyn sitting alone near the fire. You walk over and grab a seat next to her. The light emanating from the flames illuminate her bright blue eyes. She looks off into the night sky deep in thought.\n\n“Don't even think about it. I know what you want and I can assure you, you won’t get it,” she says.\n\n“What are you talking about?” you reply.\n\n“Oh come on, it’s been obvious since we were teenagers. Every time I would visit the palace, you’d stand there all googly-eyed. If you weren’t a prince, and not halfway decent looking, I’d already have my father deal with you. The last horny fool who stared too long at my ass got sold to a Naji Privateer.”\n\n“Don’t think too highly of yourself, Cait. I can tell it’s been some time for you, but I wouldn’t want my one night with you to ruin your experience with all men in the future. Once you have the best—”\n\nShe cuts you off before you can finish your sentence.\n\n“Oh don’t think too highly of myself, Prince? You should listen to yourself. I’ve heard the rumors about you and trust me, I am NOT interested.”\n\n“What sort of rumors would those be?\" you ask.\n\n“It’s a sad tale, really more cliche than anything. A second-born prince trying to earn the affection of his father, so he gets into as many skirts and trouble as possible. All for the attention of his dear wittle daddy.\"\n\n“Well you're definitely of strong opinion. What’s your story?”\n\n“My story?” she asks, surprised.\n\n“Yeah… like why are you this way? I mean, you used to visit the palace sometimes in our youth, but it’s been some time since we’ve talked. In fact, we haven’t even talked since our early teen years.”\n\nA flash of steel catches your eye. You notice that Caitlyn is dexterously flipping a throwing knife through her hand using different spinning techniques.\n\n“And that’s certainly a new skill you didn’t have when we were kids,” you comment.\n\n“Perhaps you’ll think twice before making a move,” she replies.\n\n“Ah, more of a challenge if you ask me! The higher the risk, the higher the reward.”\n\n“Are you never serious, Prince?”\n\n“Only on the rarest of occasions. Life is more than discussing war, politics, and economy. I rather enjoy myself than be weighed down by such meaningless things.”\n\n“Is a prince even allowed to do that?”\n\n“No. But I do it anyway. Besides, everyone is much happier to have my brother, Urijah, be the heir. I’m sure the kingdom will do just fine under his rule. Me, I’d rather enjoy the simple things: a pretty woman, strong drink, and a good fight.”\n\n“Can’t argue with that. I’m the same way minus the woman part.”\n\n“You sure about that?”\n\n“Ask me again in a few drinks. It’s getting late, Prince, and we have a long journey to ride. Get some sleep. I’m sure you have lots to dream about.”\n\nCaitlyn gets up from her seat. Her hand gives your shoulder a light squeeze and a gentle touch to your cheek as she walks off into the darkness.", "action_results": [null]}, {"action": "Resupply at Moorstead", "result": "A few days later, you arrive at the small village of Moorstead to resupply. While the rest of the company heads to the General Store, you visit the local tavern for a drink. Swinging open the door, you see the place is fairly deserted, save for a few figures huddled quietly in the corner.\n\n“Barkeep! you shout flipping a coin on the counter. “Give me a round of your finest.\"\n\nThe man behind the bar nervously eyes the corner and looks back to you saying, “I’m sorry, Milord, but our stores have run dry. We're all out.”\n\n“Run dry? Then what are those fellows over there drinking?” you question pointing to the figures in the corner.\n\nDrawing their attention, the largest of group stands and walks menacingly toward you. Judging by his size, he wasn’t someone many people disagreed with.\n\n“Didn’t you hear the man?\" he spits. \"He said 'run dry'. Now why don't you run along before things get ugly.\"\n\n\"Before things get ugly?\" you reply putting strong emphasis on \"before\". \"I think that ship sailed the moment you walked over here.\"\n\n“Boss, look how well-dressed this one is. Maybe we should ask him for a 'charitable donation'?” one of the thugs in the corner suggests. “He looks alone too...”\n\n“Gentlemen, please,\" you reply trying to diffuse the situation. \"Can’t we just enjoy our drinks in peace? I’m a bit weary from my journey and would much rather prefer to relax, rather than make you look like fools. Well, even greater fools I should say.”\n\n“Empty your pockets, noble shit, and you can leave unharmed. We’ll even give you a drink for the road since we are such ‘gentlemen’ as you put it,” the ringleader threatens.\n\n“(Sigh) Can’t I go anywhere without attracting the locals? And why does everyone assume I’m a nobleman?” you muse to yourself. “Alright, calm down. Let me see how much I have on me.”\n\nYou reach into your cloak pretending to look for your coin purse and pull your hand out with your middle finger raised. “Here’s my donation, fuck face!”\n\nIn the back corner, the gang kick down their chairs rushing towards you. The brute closest to you winds up his meaty fist and fires it towards your head. Sensing the blow, you slip underneath the punch and drive his face into the bar. Splinters fly in the air as you turn your attention towards the approaching mob. The first thug is met with a side kick to the gut, tripping the thug behind him. With three disposed, you take the offensive with a flurry of punches and elbows dazing the remaining attackers. Distracted by your sudden offensive attack, the thugs are hardly able to launch one of their own. You pick each one apart, exploiting the holes in their defense.\n\n“Who... are you?” the brute utters coughing and spitting blood.\n\n“I’m just a man who needs a goddamn drink,” you answer swinging over the bar to search the bottles.\n\nLight bursts into the room as the door flies open. Garrick and Caitlyn enter leading a group of soldiers with their weapons drawn.\n\n“What the fuck happened here?\" Garrick inquires. “You risk our entire mission pulling stunts like this.\"\n\n“I wouldn’t say that. It looks like the Prince can handle himself in a fight, though you’d never know by looking at him.” Caitlyn says with a wink. “I just wish you would include me during your little scuffles. It’s rather selfish not to share the fun.”\n\nOne of the soldiers steps forward twiddling his well groomed mustache. “My Prince, we best not tarry. Clearly you needed no help here, but I’m afraid we can’t afford to delay our mission. We are under a strict command from the King.”\n\n“Will is right. We already loaded the supplies. Let’s get moving,” Garrick says.", "action_results": [{"action": "Back to the road", "result": "You find yourself liking the road more than you would have thought. You didn’t mind the long riding days, food rationing, and sleeping outside. You’d been on small missions before, but nothing to this extent. Despite Garrick’s stoic personality, you caught glimpses of him laughing and telling stories with the soldiers. Caitlyn was by far your preferred companion. You and her had several inside jokes that got on the nerves of everyone else, which only added to your enjoyment.\n\nIn two days time you would arrive at Nastela. The fortress city was located on the western border of Brelia. The Governor of Nastela, Lucius, should be able to aid the mission.You look up from your bedroll to view the clear night sky. There are worse things to fall asleep to, you think before sleep overtakes you.\n\nTwo days later...\n\nYou arrive at Nastela. For years, Nastela has been the gateway in and out of the Kingdom of Brelia. The city, more fortress, has the only road across the western border. A massive wall lines the rest of the shared borderline. Due to its nature, security is always tight and people are refused entry at the slightest hint or suspicion. The war with Rath still registers fresh in citizen’s minds and the strong security is seen as a comfort. Recognizing your royal seal, the guards let you in without a problem.\n\n“Perhaps we should stick to business first,” the leader of your soldier escort, Will, suggests. He adds with a smile, “Afterward I’ll grab the first round.”\n\nMaking your way to the governor’s office, you notice that the city looks on edge. Iron-clad soldiers hustle about and your arrival doesn’t attract a large amount of attention. You realize that your company isn’t dressed in ceremonial armor, but in your experience citizens are always in a hurry to see your arrival. Even if they don’t recognize royalty initially, a guard escort usually attracts attention. By your perception, the people of Nastela look scared.\n\nThe Nastelian escort leads you into to the governor’s office. Inside, paper-pushers and scribes silently work while politicians clamor in heated debates. The arguments of frail old men lead to the death of young men, you think to yourself. Eventually you reach a set of sturdy double doors with poleaxe wielding guardsmen lining the interior. Each stands large and quietly confident. A lone man stands behind a massive mahogany desk. His skinny arms hold a scroll in one hand and a goblet in the other. His elegant crimson robe flows behind him like a waterfall.\n\n“Ah yes, the prince is here. The guards at the gate sent word you would be arriving soon. How can I help you?” he addresses you quickly and turns his attention back to his reading.\n\n“For starters, you can stop reading when we’re talking. Secondly, you can pour me whatever you’re having,” you answer.\n\nBehind you Caitlyn holds up two fingers.\n\n“Shit, this stuff is good. What is it? I’ve never had something like it before,” you comment, downing the cup.\n\nGovernor Lucius answers, “This, Prince, is the finest brandy from Rath. Despite the risk, there are benefits to being close to another nation. Namely, trade. We import a large number of goods from Rath as I’m sure your aware. Although these may be strenuous times, being the war and all, I find that trading and dealing is how you create ally from enemy. If you prove that you can work together with a simple transaction, you create the opportunity for more mutually beneficial deals.”\n\n“It certainly has a unique flavor… leaves quite a burning sensation.”\n\n“Say what you will about the Rathan people, they embrace the hard parts about life.”\n\nGarrick steps forward to speak, “Governor Lucius, I was unaware you hired outside security.” Eyeing the poleaxes he adds, “Wasn’t it only last summer that the King ordered a large number of my father’s knights to increase the defense of Nastela? I am unfamiliar with your personal guard. Where did the knights go?”\n\n“Garrick, son of Kane. You do possess the Duke’s direct questioning. Straight to the matter at hand then… I’m sure you’ve heard about the recent raids that have been targeting small villages along the border? Of course you have, that’s why you’re here. Well I can assure you, no Rathan raiders are making it through my city. Not a single person comes or goes without my knowledge, certainly not entire raiding parties.”\n\n“That did not answer my question, Governor,” Garrick answers narrowing his eyes.\n\n“I suppose we were going to find ourselves here one way or another,” Lucius muses. “Now!”\n\nAt his signal, the guardsmen in unison move into battle position. The clanking of armor echoes throughout the room as the heavily armed soldiers encircle your company.\n\n“Treasonous bastard!” Garrick shouts and charges the governor.\n\nLucius’ attention goes back to the scroll as he murmurs the remaining incantation of the spell. With his final word, Lucius vanishes and a blast of energy fills the room knocking Garrick off his feet. Papers fly aimlessly as the occupants of the room try to reorient themselves. Will and his fellow soldiers engage the governor’s guard. Their light leather armor offers little protection against the sheer might and brutality of the heavy poleaxes. They fight expertly, but circumstances are against them. Into the fray you join as more guards pour into the room. You begin to notice your sword hand growing heavy, each parry becoming more sluggish. Your eye catches a goblet on the floor. Drugged, you surmise. In the corner of your eye, you see Caitlyn has come to the same conclusion. She nimbly dodges several attacks before getting tagged by an iron gauntlet to the mouth. One by one, each of your soldiers are cut down. This is not how I imagined the end would come, you think just before your world turns black.", "action_results": [{"action": "Awaken", "result": "Your vision is a blur as you slip in and out of consciousness. They are transporting you somewhere, but your mind is too hazy to comprehend where exactly. You hear waves. The clasp of iron is heard distinctly through the background noise of bodies shuffling and a man yelling orders. You feel the the ground beneath you unsteady. They are transporting you by sea. You are unsure how many days it’s been since the encounter at Nastela. Your head is throbbing and you don’t know whether anyone from your company is still alive. A black hood is placed over your head preventing you from seeing your surroundings. Yep, definitely not how I thought that day would go, you think. You take some comfort in remembering that Cait was knocked out instead of killed. Maybe she’s on the ship with you.\n\n“Caitlyn!” you shout and promptly get backhanded.\n\n“Prince?” You hear the soft spoken voice of a female somewhere to your right. Then another smack fills the air.\n\n“No talking,” a grizzly voice bellows.\n\nHours later, the ship makes port. You feel the tug of your chains lead you from the boat into the back of a caravan. The hood is still over your head, but you can feel the hot, dry air of the environment. The ground beneath you is too loose to be dirt. It’s sand. Traveling over what you guess are cobblestones, the bumpy caravan takes you into a city.\n\n“Out,” the same voice commands.\n\nWaiting for the man chained in front, you climb out and stand in line at your captor’s direction. The hood is pulled from your head blinding your eyes in the sudden sunlight. Once you finally adjust to the light, you see a large dark skinned man standing in front of you. He’s holding a whip in his right hand and a wicked-looking scimitar in the other.\n\n“You are property of Lady Myrr. Whatever she wishes, you will do. If you disobey her, you will be punished. If you insult her name, you will be punished. If you even fucking look at her wrong—”\n\n“You’ll be punished?”\n\nChained a few bodies down from you, Caitlyn speaks out of turn.\n\nThe dark skinned man, Darius, walks up to her glaring into her eyes in evaluation.\n\n“It is unwise to speak over the man who holds your life in his hand.”\n\n“I thought Lady Myrr owns me. Not you,” Caitlyn retorts.\n\nDespite the truth of her words, she is met with a punch to the gut and doubles over in pain.\n\n“Lady Myrr owns your miserable lives and I am the instrument in which she commands! I am the one who will ensure you serve the Lady. Trouble makers and insurrectionists will meet unimaginable pain before leaving this world. Now walk.”\n\nFor emphasis, Darius cracks the whip at the ground close to where Caitlyn is kneeling. He leads the group of chained prisoners through a courtyard, down several staircases, and into the dungeon. Torches hanging upon the dimly lit hallways are the only source of light. The prisoners are divided three into a cell. Unfortunately, you aren’t placed with Caitlyn. You wonder what happened to Garrick. You didn’t see him among the others. You aren’t even sure if he’s alive. Out of the two other prisoners in your cell, only one looks like a fighter. His long unkempt hair hangs to his mid back and his beard is just as long. Several tribal tattoos line his thick arms. The other prisoner looks as if he spent more time in the library than the training grounds.", "action_results": [{"action": "Talk to them", "result": "“Well, we seem to have found ourselves in a shitty situation,” you break the silence. “Any idea how to escape this hell hole?”\n\n“Friend, you’re better off accepting your new life. Lady Myrr is the most powerful person in all of Miranna. And in Miranna, the powerful dictate the law,” the Librarian, Harold, answers.\n\n“What about you, big guy? Any ideas?” you address the hairy man.\n\nThe man stares off in the distance before responding, “There is no escape. Only suffering.”\n\n“Quite the couple of optimistic cellmates they put me with. For once I’m regretting not paying enough attention during history lessons. Care to inform me on Miranna?” you ask.\n\n“You’ve never heard of Miranna? It’s only the most notorious pirate island in the Daen Sea! There has never been an established government on this island because the pirate lords have always overthrown whoever tried colonizing it. Doesn’t matter which major superpower tries: Rath, The Jeika Dominion, even the Kingdom of Brelia hasn’t been able to control Miranna. Her land promises fortune and her seas bring destruction! Lady Myrr has the most influence and no one wants to be on her bad side. The last house that opposed her vanished in the night... The occupants did at least. The building is still there,” you see the excitement in Harold’s face as he gets to share his life study.\n\n“So let me get this straight, the island is run by pirates, but somehow the most powerful person is this ‘Lady Myrr’? Why hasn’t some bad mother fucker with a giant hat and peg leg taken charge?” you question.\n\n“Ah you mean Captain Myrr. Yeah, he used to be in charge. Before the Lady slit his throat in front of his crew, that is. She may be pretty looking and lady-like, but she’s bat-shit crazy. Don’t let her polite manners fool you. She’s a devil. She was royalty in some faraway land before getting kidnapped and sold by her usurping uncle. She spent years as a slave doing god knows what before catching the attention of a certain pirate lord. She’s a dangerous mix of noble intelligence and slave ruthlessness.”\n\n“She does sound the intriguing character.” you say. “I think I’d very much like to meet the Lady.”\n\n“Your funeral.”", "action_results": [{"action": "Sleep", "result": "You awaken to the splash of cold water hitting your face.\n\n“Fuck!” you shout.\n\n“Rise and shine, scum,” Darius answers with a cruel grin.\n\nSeveral armed guards pull you from your cell and march you and the other prisoners from the dungeon. They lead you into an open, sandy area surrounded by a massive wall. Guards with spears and bows patrol the top of the wall limiting any sort of escape. You notice a balcony overhanging part of the area filled with well-dressed and fair skinned people.\n\n“On your knees. Lady Myrr, your newest recruits,” Darius addresses towards the balcony while ‘helping’ the prisoners that are slow to kneel.\n\n“Any potential?” A clear, articulate voice rings out from above. You instantly recognize Lady Myrr. Her raven colored dress hugs tightly against her, leaving no wonder to the curve of her body. Her pure black hair would be lost in the silky shadow of her dress if not for the exposed back.\n\n“Just the usual shit,” Darius replies. “Perhaps we should give them the opportunity to show their value. Does the Lady desire a demonstration?”\n\n“Let them prove their worth.”\n\n“You heard the Lady. Swords!” Darius shouts.\n\nWhile slaves rushed to follow Darius’ orders, guards carefully unchained the prisoners and warned against any revolt upon penalty of death. Expecting wooden training swords, you were surprised when real steel was placed in your hand. At random you were separated into two lines facing one another. Luckily, you are on the same side as Caitlyn. One line was given red ribbons to wear signifying which \"team\" they’re on.\n\n“I can imagine you dumb goat fuckers need instructions, even though it should be fairly obvious!” Darius yells. “Last team standing wins. By any means necessary.”\n\n“What do we win?” you can’t help but ask.\n\nAngry that he’s interrupted, Darius gives you a look and continues, “Prove your worth to Lady Myrr! Oh and the winner will receive a full wine skin courtesy of the generous Lady Myrr.”\n\nDarius cracks his whip signaling to start. The two groups of slaves rush towards each other clashing with the ring of steel and barbaric screams. Men cry out in anguish as blades find their way into unprotected flesh. The white sand is dyed red as each man falls. You almost feel bad about cutting down the ill-trained slaves, but you remind yourself that they’d kill you if they could. Each swing of your blade causes destruction. The strength and quickness of your strikes easily passes through the feeble defenses you encounter. Only a few manage a single parry before you rip them apart. Your group wins easily, only losing a couple of lives in the process.\n\n“Give them their wine. Bring that one up to me,” Lady Myrr commands from the balcony motioning towards you.\n\nAfter giving Darius a wink, you follow the guards into the manor.", "action_results": [{"action": "Meeting Lady Myrr", "result": "The guards lead you through the manor passing by countless house slaves scrambling to fulfill their duties. Most of the female slaves are topless.\n\n\"Can’t say I disagree with the dress code,\" you comment.\n\nA forceful push in your back is your only reply.\n\n“Yeah like you aren’t staring too,” you utter softly.\n\nYou arrive at a lavish doorway draped with fine beads, silk, and an assortment of decorations. Entering into the room, Lady Myrr gracefully rises from her chair and strides in your direction.\n\n“Now what am I to think when I see one of my prisoners cut down multiple men without breaking a sweat?” Lady Myrr asks pouring two glasses of wine from a jewel-covered pitcher. \"Guards, leave us.\"\n\n“Tempt a man with a good drink and the company of a beautiful woman and he’ll accomplish anything,” you respond.\n\n“Heh, I don’t remember ever offering to meet with the victors of that fun little game.”\n\n“ Let's just say I had a feeling you'd want to meet the one who distinguished themselves above the rest. From what I hear, you’re a lady who appreciates someone who can get things done.”\n\n“I can’t say I don’t admire your confidence. By your showing on the sand, it’s obvious that you are skilled with a blade. Skills such as yours don’t just magically appear. Tell me, how did you come across such training?”\n\n“I had a very strict father.”\n\n“Son of a military man perhaps?”\n\n“Something like that.”\n\nLady Myrr waves her hand as if swatting away an idea.\n\n“Your background matters not. As long as you serve your lady without question. In any capacity I see fit. Do you have a woman?”\n\nShe takes a sip from her cup and places her hand against your chest.\n\n“Sort of,” you answer with a slight hesitation.\n\n“If you had one, you’d know. Come, I desire instruction.”\n\n“Of what, my Lady?”\n\n“You’ll find out.”", "action_results": [{"action": "Agree", "result": "“Do you notice my hip position as I thrust like this? That’s where your power comes from. If you don’t wind up, you’ll be more efficient with your energy too.”\n\nFor a few months, you have been teaching your sword techniques to Lady Myrr. She had been given some training as a girl, but nothing extensive. She was not unskilled, simply lacked proper refinement. Her determination to perfectly perform drills surprised you. You imagined someone with her status would only order people around. Lady Myrr takes a more hands on approach. On more than one occasion, she would not continue the lesson until the specific form was mastered. Luckily, she didn’t pry deeper into your past. You aren’t quite sure what would happen if she found out who you are and you really didn’t want to find out. No, you felt it was best to hide your identity.\n\n“Fucking hell! I always drop my guard when attempting that feint.” Myrr shouts in frustration.\n\n“That’s because you’re overcompensating with your leg power. It should be quick, without effort. Like this.”\n\nYou perform the technique to perfection as you’ve done countless times.\n\n“Show off. Alright that’s enough for today. I need you for something,” Lady Myrr says.\n\n“Something else than training?” you question.\n\n“Yes. Darius should be here any moment. Ah here he is.”\n\n“My Lady Myrr,” Darius bows. “Slave,” he mentions with obvious distaste in your direction.\n\n“Speak freely,” Lady Myrr commands.\n\n“Our contacts have reported Captain Kano is plotting with the Rathans against you,\" Darius says. \"They will aid him with firepower as long as he remains loyal to Rath.”\n\n“Are these contacts to be trusted?” Lady Myrr asks.\n\n“I trust them with my life, my Lady. We should strike Kano before he has the chance to grow in strength. Before he has the support of Rath.”\n\n“What do you think?” Lady Myrr turns to you.\n\n“My Lady, he is a slave! You would ask his advice when your entire manor is threatened?” Darius interjects.\n\nBefore Darius could think to react, Lady Myrr grabs his throat and trips him to the ground. Her vise-like grip prevents any air from his breath, her knee holding his body in place on the ground. Judging by his size, you don’t doubt that Darius could overpower the Lady off him if he really wanted to, but he continues to lay in obedience. You stand ready just in case.\n\n“YOU will fucking listen to ME. If I ask your opinion, I want to hear it. Don’t presume that I want to hear it all the time. Do you understand me?”\n\nDarius (coughing) does his best to nod and Lady Myrr lets him back to his feet.\n\n“So what do you think?”", "action_results": [{"action": "Attack Kano", "result": "“If you want to stay on top, you have to eliminate your competition. If people learn you have a rival, they'll assume you are equals. You must end it before it gets to that point,” you answer.\n\n“That’s what I like to hear. We’ll organize a small force and attack in two days. Darius, ready the men.”\n\nWith a swift nod, Darius leaves the two of you alone.\n\n“You have been in my manor for many weeks now. You have been granted the privilege of walking freely within my walls because you have shown you’re not a common slave. I have spent enough time with you to know you’re not stupid enough to attempt escape. This will be different. You will be beyond these walls, armed, and without guards. You have served me faithfully, even being enjoyable company. Before you get any ideas, know that should you betray me or this mission, you will be executed. You have spent enough time around here to know that would not be a quick process. I may value you, but the smallest hint of disobedience will be punished severely.”\n\n“Lady, I like my limbs attached and throat un-slit. You have nothing to worry about,” you reply. The thought pops into your mind, Although if I were to escape, this does sound like my best opportunity.\n\n“Good.”\n\nLater that night...\n\nYou fall back in your bed exhausted. Lady Myrr does the same beside you. It wasn’t the first time it happened during your months of training. Still, it complicated things a bit. You figured you didn’t have a choice in the matter. Lady Myrr always gets her way and this wasn’t exactly a difficult order to follow. The refusal of her advances would cause more problems, and even possibly your life. You felt a pang of guilt each time for Natalie’s sake, but you couldn’t help wanting more. She curls up next to you and gently runs her hand over your bare skin.\n\n“You know many men would kill for the position you have now,” she breaks the silence.\n\n“I doubt anyone would kill to put themselves into slavery.”\n\n“Besides that. You know what I mean.”\n\n“I know and I can’t blame them. You’re beautiful. Everyone at their very core desires someone to be intimate with. Someone who they can share their inner secrets to without fear of judgment or rejection. The luckiest people are the ones who find that early in their lifetime.”\n\n“Since you’ve arrived here, I’ve never heard you speak in such a way. Perhaps there is more to you than base animal instinct.”\n\n“Um, thanks?”\n\n“Take it as a good thing. There is more to life than drinking and fucking.”\n\n“That’s ironic,” you say, pouring another cup of wine.\n\n“People in my position don’t last long. The power hungry always desire to move up. It’s their nature. Every captain on this fucking island wants my head. Captain Kano is just the one foolish enough to try.”\n\n“It’d be foolish to try on his own at least, but he partnered with a strong ally. He’s not as foolish as you think.”\n\n“Fuck Captain Kano. He’s a soft cocked puppet. Tomorrow I’ll slit his throat myself and put his head on a pike to welcome his Rathan allies.”\n\n“You’re joining the raid personally?”\n\n“Of course! On this island, respect is earned. Fear works the same way. Either by respect or fear, they’ll all fall in line.”\n\n“Whatever it takes, I guess. Might I make a request?”\n\n“Not this again… some girls may find pleasure there, but I don’t.”\n\n“No, not that. Although we can revisit that conversation another time. I was talking about the raid. There is a prisoner that was transported with me. Caitlyn. She is deadly with a pair of daggers. Our success chances would greatly increase if she were accompany us. We were childhood friends. I’m sure you remember her from the ‘game’ we played.”\n\n“Yes… her. She was quite skilled. If she were any better, she might be the one laying next to me.”\n\n“You know, that’s not a bad idea…”\n\n“Don’t push your luck,\" Lady Myrr says. \"Very well, I’ll order Darius to bring her. Any attempt to escape by either of you will have fatal consequences. If even one of you runs, I’ll kill the other without hesitation. I don’t care that we’ve shared the same bed. Your fate will be the same as any disobedient slave.”\n\n“I do love your dirty talk,” you reply.\n\n“Prove it to me.”", "action_results": [{"action": "The Raid", "result": "You creep quietly among the outskirts of Captain Kano’s villa. From your vantage point, you see several patrol units on the perimeter. From a few open windows, it doesn’t look to be that heavily guarded on the inside. To the east of the villa you see his sloop, The Boar, docked with members of his crew playing dice and drinking outside. Lady Myrr leads the raid group. There were only ten of you total, way less numbers than you expected. When you brought it up she simply said, We will create more fear if Kano disappears during the night. The others will not sleep as easy.\n\nLady Myrr whispers her commands, “We’ll split into two groups. Darius’ will strike near The Boar cutting off reinforcements and my group will sneak into the villa, find Kano, and end his life. Once you see the building burning, we’ll meet back at the manor. Kill anyone who gets in your way.”\n\nEveryone nods in agreement. Unsurprisingly, Myrr puts you in her group. You are a little disappointed when Caitlyn is put in the other, especially since Darius was in charge. At first you’re afraid his hatred of you will cause problems for Caitlyn, but then you remember he hates her too. Myrr silently leads the way towards the villa. Staying in the high grass, you use the cover of night to sneak past the patrols undetected. One unlucky pirate chooses a spot near you to relieve himself. Lady Myrr takes advantage of his vulnerable position and greets him with knife to the throat.\n\nYour group reaches the villa with no other encounters. The inside is filled with mahogany furniture and oil paintings. You move stealthily through the hallways. Internally you comment on the decor, Captain Kano sure is a lavish man. Hmm, I would have assumed a pirate captain’s villa to be, well, more rambunctious, you think. It’s quiet. Too quiet… A whirling sound fills the air. Led by your acute senses, your blade automatically moves into a defensive position blocking the projectile that was aimed at your heart.\n\n“Ambush!” you yell.\n\nSeveral doors in the hallway swing open and men rush out with their scimitars and sabres raised high. You meet the first attacker, parrying his blade before countering with a deadly blow to the gut. The second doesn’t even get a chance to swing before your lighting thrust drops him. The narrow corridor allows your group to fight a few at a time, but each kill is replaced with another fresh body.\n\nFighting with her back to yours, Lady Myrr shouts, “Show yourself, coward! I know you’re here!”\n\n“Halt your advance!” a voice cries amidst the fighting.\n\nThe pirates halt their attack and stand aside for their captain. Kano, you presume, strides forward. His tall frame overshadows his men. His mouth twists into a crooked smile as he takes the pipe from his mouth to speak.\n\n“Well, well. What do we have here? A pirate queen out in the open? So unprotected. So exposed.” Turning to you he adds, “Ah, the prince that I’ve heard so much about. You’re a little more baby-faced than I was expecting. The tales of your swordsmanship made me think you were a seasoned man.”\n\n“Prince?” Lady Myrr asks.\n\nIgnoring her and putting the facts together, you reply to Kano.\n\n“I take it you and Governor Lucius have been talking. You are fools if you think aligning with Rath is in your best interest. They’ll turn on you in a second. You think Rath will just let you rule here without oversight? No, they’ll use you for their own gain and toss you aside once they have what they need.”\n\n“You’re a prince?” Lady Myrr asks again. Captain Kano also ignores her.\n\n“Ha-ha-ha! How dumb do you think I am? Miranna will survive as it always has. Rath is only a means to an end. There isn’t a nation that can rule Miranna. Miranna belongs to the free. If Rath decides to dishonor their agreement, they will meet the same end as every invading nation. Our ships will sink any attack force. Neither Rath nor Brelia has a navy that can defeat us. But that is none of your concern. I’m afraid your time is at an end. I would have preferred to ransom you to Orson, but Darius was very adamant about this part of the deal. He even refused a majority share in your would-be ransom. Can you believe that?”\n\n“Actually, I can. That guy hates me,” you respond.\n\n“Darius would never—”\n\nLady Myrr starts to speak before Darius enters with a bloodied Caitlyn bound and gagged. He pushes her to the ground in front of you. She looks up to you, eyes watering as if to apologize for getting captured.\n\n“I’m sorry, my Lady. I believed in you, I really did, but this prince has corrupted your mind and your ideals. I don’t know why you took so much interest in him. It should have been me at your side and yet you cast me aside for what? For an irresponsible fling? I’ve known you long enough to see the way you look at him. Why couldn’t it have been me? I’ve always done everything you’ve asked! Yet you treat me like one of your common slaves. I am more than that. We could have been more than that! Miranna deserves a strong ruler. I’m sorry it had to come to this,\" Darius confesses.\n\n“I’m sorry too,” Lady Myrr speaks softly. Louder she adds, “Sorry that I trusted a miscreant like you! The deepest levels of Hell belong to fucking traitors like you. You’re betraying me because I didn’t fuck you? I doubt your small cock would even get close to satisfying me. You’re despicable, you’re a bitch, and I will fucking kill you for this. One by one, I’ll remove your fingernails and then move to the fingers themselves next. I’ll break every bone in your fucking body. Then I'll show you your reflection in the mirror before ripping out your eyes, so the last thing you’ll see will be your fucked up, mutilated body.”\n\nVisibly hurt by her words, Darius replies to you and Lady Myrr.\n\n“I will miss that passion once you’re gone. This is all your fault, Prince. Everything was fine before you arrived, although I guess you didn’t really have a choice in that matter. Captain Kano filled me in. Perhaps you both were meant for each other having the whole betrayed thing in common. Before I kill you, I want to make you suffer so I’ll give you a choice. You can save one of your precious ladies here… you’ll just need to kill the other. You have my word, I’ll spare the one who you don’t execute. You’ll still die, of course, but at least you can save one of them. My final gift to you. So, Prince, who will it be?”", "action_results": [{"action": "Kill Lady Myrr", "result": "Although you did care for her, Lady Myrr was ultimately the one keeping you prisoner. Caitlyn was part of Brelia, part of your home. You are a prince of Brelia, and you will always choose the life of its noble citizens over a pirate. You are given a choice and you make what you believe to be the right decision. Before she can react, you drive your sword through Lady Myrr’s heart, catching her as she falls to the ground. Her eyes flash in anger for a brief moment before resolving in a visionless, peaceful gaze. You cradle her head as she lies dying in your arms. Tears wet your face as you try to comfort her during her last moment. Her hand reaches to touch your cheek before falling limp to the ground. You gently kiss her forehead and close her eyelids.\n\n“Ahh, interesting. That just lost me a handful of coins. I wagered you’d save Lady Myrr ughh—” Captain Kano starts to speak before the tip of a sword bursts through his chest, covering Darius in blood splatter. Standing over his corpse is a member of his crew.\n\n“Well, Little Brother, are you just going to sit there crying or are you going to help me escape?” a very unrecognizable Prince Urijah speaks.\n\nIn a rage, the rest of the crew attack in a vengeful manner. You grab a dagger from a fallen body and cut the bindings on Caitlyn. She immediately plucks the dagger from your hand and turns on Darius, striking with a frenzy of cuts too fast for him to block. Red streaks of blood start to appear at his arms, face, and chest. Seeing blood, Caitlyn attacks quicker and deeper. In a matter of seconds, Darius’ body is a mangled mess of open wounds. He doesn’t even get a chance to curse before choking on his blood. You join the battle alongside your brother, Urijah. The two of you work in unison, attacking while the other is defending and vice versa. You were taught by the same weapon masters and the similarity of your movement is proof. You know what the other is planning and how he will strike.\n\n“Cover me, Brother!”\n\nUrijah shouts and pulls at the amulet around his neck. Whispering an incantation, he finishes the final word of power. The entire hallway fills with a blinding light for a moment and then suddenly, the light vanishes, shooting into his floating body. Ripples of magic appear at his skin as he runs past you engaging the dazed pirates. Imbued by magic, Urijah’s sword cuts through blade and bone alike. Those quick enough to attempt a parry meet the same fate as those who didn’t. In a matter of seconds, the hallway is filled with the corpses of Captain Kano’s crew.\n\n“Urijah, how the fuck did you get here? And why didn’t you do that earlier?” you ask.\n\n“It’s good to see you too, bro. As always, it looks like you’re caught up in some weird love triangle.”\n\n“You could have saved Lady Myrr.”\n\n“Why would I risk saving her? She’s a pirate queen with no allegiance to Brelia. I’ve got to say, you did have me worried you might choose to save Myrr. That might have ruined my plan.”\n\n“I wasn’t worried. Thanks Prince,” Caitlyn chimes in hugging you. “But yeah seriously, how the hell did you end up here, Urijah?”\n\n“As you know, the King sent me to Rath. My task was to meet with their leaders and discuss how we might continue our peace treaty. I never made it that far. When I reached Nastela, I discovered that Governor Lucius was conspiring with the Rathans to overthrow the kingdom. Along with the knights provided by Duke Kane, we attempted to overthrow Lucius. We failed. He hired too many mercs for us to handle. Most of knights were killed and the rest of us were sold to slavers in Miranna. During the slave auction, I happened to spot an assassination attempt on Captain Kano, saving his life. In gratitude, he purchased and gave me the opportunity to work on his ship to pay off the amount he bought me for. I never told them who I was because I figured it’d make things worse, so I’ve just been here, biding my time waiting for a chance to escape. Then I overheard Kano talking about the unsuspecting prince in Lady Myyr’s employ. Knew that had to be you. Luckily, Darius was infatuated with the Lady and I used his jealousy to turn him against her. You really can’t go anywhere without causing drama, huh? There are a few knights left on Miranna, Garrick among them. I figure we have enough to crew The Boar. Come on, let’s go home.”", "action_results": [{"action": "Epilogue: The Disillusioned Prince", "result": "News of Nastela’s betrayal spread throughout the Brelia Kingdom. The entire army, led by King Orson himself, marched to Nastela. The city was no match for the full strength of Brelia. Rath dishonored their alignment with Nastela and didn’t offer any support in the purge. Governor Lucius took his own life before the city was taken.\n\nMiranna was left without a sole ruler. Many captains attempted to sieze control, but none with enough power to keep it for very long. Without a strong voice to keep order amidst the chaos, the island fell into a state even more lawless than before. Realizing this put Miranna at the mercy of an invading force, the pirate crews voted 5 captains to rule. ‘The Black Hand’ unified the pirate crews into one fleet terrorizing any ships that strayed too near.\n\nBrelia welcomed you home with a large parade. Citizens lined the streets and cheered for the return of their two princes; the future of their nation. Riding through the cobble streets of Brelia was surreal. Peasants, merchants, and nobility alike greeted you as heroes. King Orson was so overjoyed in having his two sons back that he threw a feast for the entire city. You tried to enjoy the abundance of food and drink, but something was different. Before your mission, you would have eaten and drank throughout the night. You think back to the words Lady Myrr spoke, There is more to life than drinking and fucking. You sat alone, sipping at your wine.\n\n“This is a rare sight. The Prince sitting alone drinking in melancholy. I thought you would be enjoying your reunion with Natalie.”\n\nYou look up to see Caitlyn. Her blonde hair, though tied back, has a few strands loose near her eyes. Despite most noble women wearing fine dresses, she wears light leather armor.\n\n“During our journey, her and Harlan got… involved. I’m not in the mood to discuss it. How’re you holding up?” you ask.\n\n“Me? I’m fine. I’m more concerned about you. It’s not like you to not enjoy a party. Did the death of that pirate queen really mess you up? Listen, I never did thank you for saving my life. I know the mission didn’t exactly go as planned, but it all worked out in the end. Brelia is safe and we have you to thank for it.”\n\n“It doesn’t feel as if I did anything special. At least nothing more than anyone else would have done in my position,” you reply.\n\n“But you did something. You didn’t let fear of failure bring you to inaction. I know you haven’t been the most responsible prince, but when faced with tragedy you determined what you thought was the right thing to do. That’s the best any of us can ever do.”\n\n“I suppose you’re right. I just can’t shake the feeling that there’s more to life than what I’m experiencing. I have everything I should want, but it still doesn’t feel like enough. I just feel like there’s more out there.”\n\nCaitlyn sits next to you and takes your hand.\n\n“I think you’re exactly where you need to be.”\n\nShe pulls near and kisses you. The restlessness inside you quiets for a brief moment as you lose yourself in the embrace.\n\n“Sorrow doesn’t look good on you, Prince. You can’t sit and wonder about the things you don’t have. Enjoy what you have or go chase what you desire. You can’t live a passive life. The choice is up to you.”\n\nShe gets up and leaves you alone. You pour another drink.", "action_results": []}]}, {"action": "Kill Caitlyn", "result": "Lady Myrr gave you her trust. There is no way you were going to betray that. She’s the one that rescued you. She’s the one who you owed your new life to. Taking a deep breath, you know there’s no going back after this. Even if you somehow managed not to get executed, you wouldn’t be able to face Brelia after this.Without hesitation, you draw your sword back with both hands towards Caitlyn’s kneeling body. The blade cuts through the base of her neck with ease. Her headless body falls limply to the floor. Try as you might, you can’t avoid seeing Caitlyn’s face as her head rolls to the floor. It’s a look of sadness as if disappointed her prince would choose an outlaw over her. Your boots are stained with blood. Her blood. The blood of your nation.\n\n“An unexpected choice. Again your actions fuck me,” Darius comments as he tosses a coin purse to Captain Kano.\n\n“Ha! Of course the Prince would side with the woman currently fucking him,” Kano points out.\n\n“You got what you wanted. Now kill me and let Lady Myrr go,” you say.\n\n“I suppose this is the end… for you,” Darius speaks as he drives his dagger into the unsuspecting Kano.\n\n“Wha— (gurgle) the fuck!” Kano cries out through his blood in surprise.\n\nLady Myrr briefly brings her hand to her mouth and whispers incoherent words into one of the rings on her finger. A piercing screech echoes within the hallway causing all it’s inhabitants to drop their weapons in order to cover their ears. As quickly as it came, the screech subsided. Disoriented, but still reflexive, you grab your sword from the floor, sticking it through Darius’ gut and slicing it wide open. You move on to the next target, while he doubles over in attempt to keep his organs inside. Frenzied by the madness of the situation, you lose yourself in a bloodlust cutting down man after man. The few cuts you receive in your reckless assault are disregarded. You only want more blood. You only want to end more lives. Lady Myrr and her remaining allies join the massacre. Only two members of Kano’s crew manage to escape with their lives.\n\n“Let them go. They will tell the island of our victory. No one will dare challenge me after this,” Lady Myrr says. “Thank you, Prince, for choosing me. You saved my life and that is a debt I mean to repay. You’re free. I mean it. If you want to leave, go ahead. I won’t stop you.”\n\n“How can you just expect me leave after this? I chose you over my own country. I would have nothing without you,” you say.\n\n“Then let’s go celebrate your decision.”\n\nShe takes you by the hand, but you pull yours away. You answer her quizzical look as she orders the raid team to disperse.\n\n“I’m not a fucking fool, Myrr. I know what you planned here. You played Kano by planting Darius in his midst. Darius is a piece of shit, but I’ve been around him long enough to know he’s not the traitorous type. You arranged this whole encounter. For what? Out of sheer jealousy and pettiness. When he stuck his dagger into Kano it all made sense. You gave him the fucking idea for the ultimatum because you wanted Caitlyn dead. You knew you couldn’t execute her with me around, so you schemed up this entire thing. You know what the worse part is? I had no fucking choice. I’m enslaved to you, whether you own me or not.”\n\n“My, my aren’t you the clever one, Prince? It’s time you forget your heritage. It’s holding you back from reaching your full potential. I knew who you were the moment you arrived here. You don’t belong in elegant castles wearing frilly clothing. You belong with me. The things you’ve told me about your past, though not the entire truth, made it clear that you aren’t suited for the throne. That’s Urijah’s responsibility, is it not? You may have hidden the full story from me, but I know you. Your heart longs for the freedom of Miranna. Forget Brelia. You and I will rule this island together. Only Caitlyn’s death would convince me of your undying loyalty. When you insisted she join the raid, I knew what had to be done.”\n\n“You manipulating bitch,” you curse grabbing Lady Myrr by the throat and throwing her to the ground. She rises to all fours to stand up to her feet. Your foot meets her gut, collapsing her back down to the ground. She rolls over, drawing her sword and lunges towards you. You easily parry her attacks. With ease, you block her advance, taking pleasure in her struggling, futile maneuvers. Lady Myrr thrusts forward into your trap. You slide back just out of range, taking her off balance in her attack. With too much weight in her front foot, you grab at her wrist holding the sword and twist it from her grasp. At the same time your foot finds the underneath of her knee, taking the weight out from under her. She lies at your feet. At your mercy.", "action_results": [{"action": "Kill her", "result": "Your mind wanders inside the prison cell to the words you first heard about Lady Myrr. She’s a devil. Her actions ruined your life. Her mad infatuation with you would only mean further manipulation. If she were willing to maneuver you to execute a childhood friend, there is no telling how far she would go to keep you under her spell. With an anguishing cry, you thrust your blade forward. It tears through her upper thigh and lodges deep within the wooden floor.\n\n“I… can’t,” you utter shaking with the realization. The sword drops from your hand.\n\nLady Myrr rises from the floor, “I know. We are destined for one another. Our fates are now intertwined. Killing me would be as if killing yourself.”\n\nShe picks up your fallen sword and places the hilt within your hand. Her fingers traverse the flat of the blade, staining them red. Then she lightly touches your face marking it with streaks of her blood.\n\n“You and I will rule together.”\n\nHer hand glides to your chest.\n\n“You will have everything you ever want.”\n\nHer hand drops lower.\n\n“That which is not freely offered, you take by force.”\n\nHer hand reaches the intended area causing a slight gasp to escape your lips.\n\n“Are you with me, King of Miranna?”\n\nLost in madness and overtaken by the moment, you answer her with with a grunt, grabbing her forcefully and throwing her back to the floor. Only this time, you join her. Covered in blood, surrounded by the freshly slain bodies of Kano’s crew, you consummate your commitment to Myrr.", "action_results": [{"action": "Epilogue: The Mad Pirate King", "result": "For years you prey upon ships in the Daen Sea. Word had spread throughout Kria of the ‘Mad Pirate King’ uninterested in treasure. Only blood. It didn't matter if the ship flew Rathan or Brelian colors. They all sank. Your piracy disrupted the flow of trade into Brelia. In order to prevent economic collapse, King Urijah surrendered Brelia to a new rising empire across the eastern sea. His surrender was conditional upon the destruction of Miranna. Their joint fleet littered the Daen with nimble schooners and heavily cannoned galleons. Only a small portion of captains remained loyal to you. The ones you didn’t execute turned to privateering. Upon the deck of your brigantine, The Lady’s Reaper, the armada sailed before you.\n\n“Captain! There are too many of them. Shall we turn course?” your first mate, Scully, shouts from the helm.\n\n“What good would that do?” you answer. “The entire Daen is filled with their ships. I will not run like a frightened child. I will end this on my own terms.”\n\n“But Captain, it’s suicide!”\n\nSuddenly, a pistol shot rings out over the deck. The bullet slams into Scully catapulting him backwards.\n\n“Anyone else have reservations about following orders? Good,” Lady Myrr speaks while casually reloading her flintlock pistol.\n\nWith the smell of gunpowder in the air, you address the crew.\n\n“For years you have served me faithfully. We have made both Rath and Brelia terrified of the seas. Terrified of you. I have given you wealth, freedom, and a life unrestricted by society’s rules. I ask now that you join me one last time. My fate will not be the gallows. I’m glad they sent an armada. Hunting is easier when the prey gathers before you. Let loose the sails! Bring me more ships to sink!”\n\nThe crew cheers and frantically run to their stations. The deck is organized chaos as crewman rush to ready their positions. A heavy wind lies at your back propelling the brigantine to top speed. You take the helm, Lady Myrr alongside you.\n\n“This is not how I imagined things would go when you were first brought to me,” she speaks staring at the multitude of ships before you.\n\nYou answer taking a swig of rum, “Urijah is a fool. He surrendered Brelia to an outside ruler. It’s despicable. He would clasp the shackles at his own wrists. For what? To defeat one man? Only a weak man surrenders. The strong man fights until he is physically unable. The body is harder to break than the mind. My brother, The King of Slaves, will learn that the hard way.”\n\nMyrr grabs the bottle from your hand and takes a long drink. Wiping her mouth she answers, “I only hope to take as many of these fucking cunts down. They will experience true pain with my blade at their throat. The last thing they’ll see before I send them to Hell will be my smiling face and their blood on my sword. The skills you taught me years ago will take many lives this day. How naive I use to be. I only regret we didn’t have more time to fuck and drink. The Brelians have robbed us of that and they will be punished for it.”\n\nCannon blasts echo across the sea. The front line of the armada fire their forward cannons as they move to engage The Lady’s Reaper. All but one miss, knocking an unfortunate crewman overboard with the impact. One of the galleons flies a family crest you recognize: Kane. Spinning the wheel hard to the left, you direct the brigantine towards The Paragon. The ram at your ship’s bow rips through the galleon's hull with a deadening crunch. Before your crew, or even Myrr react, you jump from the helm across to The Paragon.\n\n“Kane! You cock-sucking leech. Where are you?” you scream as your blade sweeps through the poor defense of sailors. Each kill increases your vigor as the blood frenzy continues. A pistol shot slams into your shoulder, only furthering your longing for blood. More enemy crewman gather around you. More lives for you to take.\n\n“I had heard tales of your madness and lust for blood, but seeing it with my own eyes is another thing.”\n\nAn older version of Garrick emerges from below deck. You recognize him instantly despite his finely trimmed goatee and grown out shoulder length hair.\n\n“It’s a tale of misfortune. A former prince, swayed by pussy, turned his back on his people. You caused the downfall of Brelia. You are a disgrace. I was there the night of Caitlyn’s death, did you know that? Your brother and I infiltrated Kano’s crew in attempt to rescue you and escape back to Brelia. But you killed her. You fucking killed Caitlyn, you piece of shit. I don’t understand how the royal family of Orson and Urijah could bear a decadent failure like yourself. Your life has been a whirlwind of chaos and it ends now,” he boldly says.\n\nSuppressing fire shoots from the deck of The Lady’s Reaper causing Garrick’s crew to scramble for cover. Lady Myrr lands next you, throwing the rope back to your ship. She gives you a wink, tosses a bottle of rum your way, and ignites the fuse of a grenade. The shrapnel finds unlucky sailors in it’s way. Through the smoke’s cover, you rush towards Garrick. Your sword is a blur as you feint and attack from unconventional angles. You didn’t forget the reputation of Garrick’s dueling ability, which is why you used untraditional sword forms. His defense is a wall. Not even your expertly disguised feints throw him off. His parries send entire shocks through your arm. By honor, mercy, or perhaps a little of both he does not toy with you. His counter-attack is swift, deflecting your sword aside and taking advantage of the opening. Garrick’s broadsword pierces through your chest, driving straight through the back. Dropping to your knees, you see the fallen body of Lady Myrr bleeding out on the deck. You don’t even try crawling her way. Garrick stands above you, resolute, a tinge of sadness at his face. His sword arcs high in the air. You meet his eyes. Finally, you think. Peace.", "action_results": []}]}, {"action": "Don't kill her", "result": "You just killed Caitlyn instead of Lady Myrr. Killing her now would mean Caitlyn died for nothing.\n\n“I’m sorry,” you mumble and offer a hand to help her up.\n\nShe grabs your hand and allows you to pull her up.\n\n“So this is what you’ve become? An apologizing, weak shell of a man. I thought we were fit to rule Miranna together. We were going to rule the seas! But I guess I was wrong. The ruler of Miranna apologizes to no one,” Lady Myrr replies.\n\nHer hidden blade pierces your stomach.\n\n“You may be deadly with a sword, but it takes more than that to rule here. You have to be cunning. You have to be smart. You must be willing to do whatever it takes with no remorse. You obviously are not fit for this life. It’s a shame really. You have taught me many things in the past few weeks. Think of this as my lesson to you.”\n\nOvertaken by grief and surprise, you don’t even fight back. Lady Myrr pierces the blade deeper before ripping it out. She departs, leaving you bleeding out on the floor. The last thing you see before you die is Caitlyn’s body on the floor. You feel disgusted by your actions before finally feeling nothing.", "action_results": []}]}, {"action": "Don't kill either", "result": "You will not take part in his ultimatum. Two options are placed before you, but that does not mean you have to take either. You care immensely for both Lady Myrr and Caitlyn. Each is a part of you. Caitlyn is testament to your heritage and Myrr is your future. With a cry, you take the offensive. Whirling your blade around, you scoop a dagger off the ground and flip it to Cait who catches it with her bound hands. As she works on cutting the rope, you attack Darius with a series of upper cuts and low sweeps. He is able to block a few of your attacks before you catch him with a deep cut to his side. He clutches the wound and with his defenses lowered, you crumple him with a knee to the temple. Captain Kano and the rest of his crew resume their charge. Caitlyn finally gets his hands unbound and joins you armed with the dagger. With the rest of the crew engaged, your assault is brought to a halt. Again, you are forced to fighting back to back to survive.\n\n“We can’t hold them much longer! Got any ideas?” Lady Myrr shouts as she parries and incoming blade.\n\n“I’m a little too busy to think of one now!” you shout back.\n\nA round object catches your eye on an incoming pirate. At his waist hangs a grenade. You quickly disperse the pirate in front of you and move towards it. Suddenly, Captain Kano blocks your way. He takes another puff at his pipe before swinging his cutlass at your head. Easily dodging the attack, you front roll forward and stab the pirate behind him in the gut. As he drops, you pull the grenade at his belt and turn just in time to block another attack from Kano. You parry a few more before directing his cutlass out of position. With Kano exposed, you bury your sword in his shoulder and rip the pipe from his mouth pulling a few teeth out in the process. Igniting the grenade with the pipe, you toss it into the mix of Kano’s crew. The blast knocks you from your feet. Blinded by the smoke, a hand grabs your arm and pulls you through the dark mist and outside the villa.\n\n“Holy shit! Did you see that?” you exclaim to Caitlyn whose hand just led you out.\n\n“Saw. And felt,” she replies. You notice a sizable wound at her side. The result of the grenade shrapnel.\n\n“Fuck, that looks deep. We need to get you medical attention.”\n\nShe waves you off.\n\n“I’ll be fine. Just need to find somewhere to rest for awhile. This whole place is in an uproar. More crew from The Boar is probably on their way. We need to move.”\n\n“Where’s Lady Myrr?” you ask.\n\n“Don’t know. Didn’t see her escape. She could be dead for all I care. Does she really fuck that good? Why didn’t you just kill her?” Caitlyn asks.\n\n“Now’s not the time, Cait. For all I know, he would have just killed everyone anyway. You can’t trust the word of someone who just betrayed their master.”\n\n“Fair point. Let’s get out of here.”\n\nYou aren’t sure where Lady Myrr is. She could be captured by Captain Kano. Going back and looking for her could mean your death, although she was very clear that attempted escape would be punished by death. You don’t think this would count as an attempted escape, but Lady Myrr has a vicious temper and you really don’t want to be on the bad end of it.", "action_results": [{"action": "Go back for her", "result": "There is a reason why you didn’t choose to kill Lady Myrr. Leaving her to die, or worse, would be going back on that decision. No, you had to save her.\n\n“Cait, I’m going back,” you say.\n\n“What? Why?”\n\n“I need to make sure Lady Myrr is ok. She could be Kano’s prisoner. I don’t even want to imagine what that sick fuck would do to her.”\n\n“Who cares? She’s the one holding us here. We’re free! Once I’m healed, we could earn enough money to charter a trip back to Brelia,” Caitlyn says.\n\n“I need to know she’s not dead.”\n\n“You know, Prince, I’ve never thought you were the smartest guy, but this is fucking dumb. After all we’ve been through, you’re just going to throw your life away for the bitch that’s holding your leash? Fine. Go ahead. Don’t expect any rescue on my part. If I even make it.”\n\nCaitlyn storms off into the darkness leaving you alone. The grenade in the villa caused a lot of damage. Part of the building is still on fire and you can see crew members rushing around with buckets of water. At least they’ll be distracted. Besides, they won’t expect the person who blew a hole in the wall to sneak back in, you reason. You make it past the scrambling fire fighters and make it to the villa. The inside of the building is a mess. Debris is scattered everywhere. The paintings that you first admired are torn and littered on the floor. Turning the corner, you see a bloodied Lady Myrr strapped to a chair in front of Captain Kano and his crew members.\n\n“Heh, bet you didn’t think your plan would turn out this way. Your attempt failed and your new toy of prince left you here to die. You have nothing left except your life. Which I intend to take shortly,” Kano finishes his taunt with a slap to Lady Myrr’s cheek.\n\n“Finish the deed then, swine,” she spits.\n\n“Oh, I’m about to. But it’d be a shame not to take advantage of such a beautiful creature before,” Kano’s says running his hand down the side of her face.\n\nYou burst into the room with a string of curses. Fueled by hate, you draw your sword to run Kano through. You never make it that far. A pistol shot tags your leg collapsing you to the ground. As you’re getting up, another shot hits you in the chest. A wounded Darius emerges from the shadows holding two smoking flintlock pistols. You lay in a pool of your own blood. The last thing you see is a cruel smile upon his face as he walks towards Lady Myrr.", "action_results": []}, {"action": "Escape with Caitlyn", "result": "There is no point in going back for Lady Myrr. You doubt she escaped the blast. Hell, you were lucky to even make it out. You and Caitlyn travel off the road to the center hub of Miranna. With an island full of fugitives and outlaws you figure it wouldn’t be that difficult to lay low. Even though it’s night, the place is still alive. The taverns almost never close. You and Caitlyn meander through the streets looking for a place to rest. Her skills must be remarkable because Caitlyn is even able to swipe a few coins from a passing by drunk to pay for the room. On the outskirts of the hub, you find a place: The Cove Inn. The place isn’t rowdy like the others you passed by. A few depressed-looking sailors sit at the bar milking their drinks. You pay for a room, not having to say much to the Innkeeper. The service providers on Miranna didn’t question wounded patrons. As long as they had coin. You help lay Caitlyn down on the bed and take a spot next to her.\n\nThe next morning…\n\nYou awaken with pain everywhere. The adrenaline from the night before had finally worn off. With a grunt you sit up to see how Caitlyn’s doing. Her face is white and the wound at her side looks to be infected.\n\n“Shit, Cait. Your side…” your voice trails off.\n\nShe barely manages to speak, “I’m sorry, Prince. I let Darius capture me and it’s all my fault. Thank you for saving me. I know you grew close to Lady Myrr.”\n\n“Don’t say that. It’s my fault. You’ll be fine. Just need to rest up a bit. I’ll go find us more money to pay for another night,” you say.\n\n“Ever the fool, Prince. Will you tell my father I fought bravely?”\n\n“Of course, Cait,” you say tears welling up in your eyes.\n\n“Thank you, Prince. I love—” her words cut before she can finish the sentence.\n\nYou press your forehead to hers feeling the weight of your actions. If you hadn’t grown so attached to Lady Myrr, you could have killed her and possibly escaped to Brelia with Caitlyn. Suddenly, you hear heavy footsteps coming from downstairs. You can’t fully hear the conversation with the Innkeeper, but you clearly hear one word in particular: 'Upstairs'. Not taking any chances, you hurriedly put on your sword belt and grab your things. You hesitate, wondering if you shouldn’t leave Caitlyn’s body on the bed. What does it matter at this point? She’s dead and you’ve lost everything. Every move stings as your bruises and open wounds remind you of the night before. It’s not as bad as Cait got, you think. You escape through the window and make your way through the back alley to avoid whoever is downstairs. Out of nowhere, two street thugs appear in front and another two to your back.\n\n“What do we have here? A lost nobleman?” the ugly one to your left says. To be fair, they're both ugly.\n\n“What? No, why does everyone call me that… I’m really not in the mood for this,” you reply.\n\nYou try to push past them, but they stop you. Angry at your circumstance, you take it out on the street thugs. Turning on the two behind you first, you whirl around pulling your sword from your belt in one decisive movement. Your sword drives into the gut of one and your fist meets the other’s face. As he’s dazed, you rip your sword out and slice in an upward manner through his throat. You sense the others drawing near and turn to face them. Hindered by your injuries, you parry a few blows before being overtaken by their fury. As you bleed out in the alley, you think of home. You think of Cait.", "action_results": []}]}]}]}, {"action": "Wait for more intel", "result": "“It would be foolish to act from just one report. I suggest you gather more information.”\n\n“My thoughts exactly. Darius, find out more. You have until the end of the week,” Lady Myrr replies.\n\nWith a bow, Darius exits and leaves you alone with Lady Myrr.\n\n“If Kano is plotting with the Rathans, he will have tremendous power backing him. I can’t believe no one’s tried to rule Miranna with help from a major nation. Seems like a good idea,” you say.\n\n“Oh they’ve tried. The partnership always falls through. It’s hard to keep a solid ally without trust. Ironically, one always ends up betraying the other out of fear of being betrayed,” Lady Myrr answers.\n\n“Has anyone tried to overthrow you since taking power?” you ask.\n\n“Two or three. It was one after the other as soon as my late husband died. They thought since I was a woman, I would be easy to assassinate. They were small time crews trying to seize an opportunity to gain real power. By the time I was done with them, no one dared oppose me,” Myrr speaks recalling the past.\n\n“No one until now.”\n\n“And it’ll be a while until the next fool tries. Kano's destruction will be a warning to them all. Enough war talk. I need you to fine tune my sword skills before we act,” Myrr says, unsheathing her blade.\n\nLater that week…\n\nYou fall back in your bed exhausted. Lady Myrr does the same beside you. It wasn’t the first time it happened during your months of training. Still, it complicated things a bit. You figured you didn’t have a choice in the matter. Lady Myrr always gets her way and this wasn’t exactly a difficult order to follow. The refusal of her advances would cause more problems, and even possibly your life. You felt a pang of guilt each time for Natalie’s sake, but you couldn’t help wanting more. She curls up next to you and gently runs her hand over your bare skin.\n\n“That was… exhilarating,” you break the silence.\n\n“Maybe for you,” Myrr replies.\n\n“You sure know how to hurt a guy’s feelings.”\n\n“I know how to hurt more than just feelings. Another performance like that and you’ll find out,” Myrr says, holding a straight face.\n\nYou stare in her eyes sensing if she’s messing with you. Finally, she breaks and grins, letting you know she’s joking with a playful grab under the covers. Suddenly, she recoils and clutches at her throat. Her body convulses, and her cough covers you in blood. You look up to see a masked figure dressed in black. You reach for the knife on the nightstand, but you’re too slow. The figure’s broadsword pierces your gut. You stumble out of the bed, tripping and clutching your wound. Naked and unarmed you attempt a feeble punch at the assassin before collapsing. Before your vision completely fades, you recognize the family crest on the broadsword. It’s Brelian.", "action_results": []}]}, {"action": "Refuse", "result": "“No.”\n\n“Did you just tell me ‘no’, slave? I don’t care how good your swordsman skills are, no one refuses me, especially not one of my slaves. Guards, dispose this stubborn animal. I will not waste my time on lost causes.”\n\nThe sudden crack of a whip distracts you long enough for several crossbow bolts to pierce your chest. The impact drives you back a few feet, but you remain standing. Darius’ whip tears the skin from your body as you struggle to find a weapon to defend yourself with. Not finding anything you desperately reach for Lady Myrr to use as a shield against the attacks. She easily dodges out of your way, cutting your arm in the attempt with a hidden blade pulled from her dress. Bleeding from several wounds, you finally collapse to the ground. Lady Myrr grabs your hair and pulls your head back exposing your throat.\n\n“Not so confident now, are you?” she taunts while bringing the blade to your throat.", "action_results": []}]}]}]}, null]}]}]}, null]}]}, {"action": "A Childhood Friend", "result": "Eleven years ago...\n\nIt’s that girl again. Lately you’ve seen her everywhere. Who is she? She has pretty hair.\n\n“My son, come here,” Queen Laurine calls from across the great hall. “This is Mary and her daughter, Natalie. You two look about the same age. How old are you Natalie?”\n\nThe girl shyly hides her face within her waist length auburn hair. Apparently that wasn’t enough because she moves behind her mother.\n\n“She’s seven, Your Grace,” her mother answers with a smile\n\n“Really? She looks older,” you interject.\n\n“Ha-ha Prince!\" your mother laughs. \"That’s not very nice. One day you’ll learn not to call ladies older than they actually are. Now why don’t the both of you learn to play together?”\n\nNodding, you move past Mary and grab Natalie’s hand. Leading her through the hallway, you head to the Queen's garden.\n\n“I like this place. There’s lots of colors and different smells,” you comment.\n\n“It’s pretty,” Natalie replies.\n\n“You know you don’t need to be afraid right? My mother is harsh sometimes, but she won’t hurt you.”\n\nNatalie nods.\n\n“You have pretty hair. It reminds me of this place… smelly,” you say with a smile.\n\n“That’s not very nice,” Natalie replies not catching your playful tone.\n\n“Sorry. I didn’t mean it like that.”\n\n“It’s ok. My mother warned me boys aren’t very smart.”\n\nIt's your turn to be offended. You start to correct her, but then see the grin appear on her face. You match it with one of your own.\n\n“Tag, you’re it,” Natalie hits your shoulder and take off down the garden path.\n\nYou admire her hair flowing behind her like waves as she runs. Then you take off after her.", "action_results": [null]}]}, {"action": "A History Lesson", "result": "Twelve years ago...\n\n“Why do I have to read this history book? It’s so boring,” the child, your younger self, questions.\n\n“It’s important, Prince. One day you may find yourself in a place where this knowledge could save your life,” the elderly Sage answers.\n\n“I thought that’s what the Weapon Masters are supposed to teach me.”\n\n“Knowledge is a powerful ally. People fear what they do not understand. Understanding is only gained after knowledge. With knowledge, you will know no fear.”\n\nNot a rare occurrence, the Sage assigned as your teacher struggles to keep your attention during the lesson. This time, however, his words found the mark. You pick up the history book and start reading A Journeyman’s Notes On Kria:\n\nThe Kria Providence is made up of three nations: The Brelia Kingdom, Rath, and the island of Miranna. Brelia and Rath have fought numerous wars since their founding. The two nations occupy most of the land mass in Kria and each is always trying distinguish themselves from the other. The last war, which ended 10 years ago, resulted in a massive wall built by Brelia. The wall stretches across the entire western border to protect against Rathan raiders. The King of Brelia, Orson, decided to build the wall in order to establish peace. The cyclical nature of the Rathan/Brelian wars needed to end, and the only solution in King Orson’s mind was to take preventative measures against rogue raiding parties. Orson has made it his life mission to keep the peace with Rath.\n\nThe people of Brelia view Rath as uncivilized barbarians. Although Rath doesn't possess the technology or engineering of Brelia, the Rathan people are sturdy. The average Rathan stands almost a head taller than the average Brelian. Dust storms and tornadoes plague Rath causing its people to adapt to the harsh environment. For that reason, Rath doesn't have the enormous cities and buildings that Brelia possess.\n\nMiranna is an island of cutthroats, lawlessness, and pirates. The island is north of both Rath and Brelia across the Cutter’s Channel. Many nations have tried to colonize Miranna and establish their rule. All have failed. Miranna is a place of organized chaos where the law is dictated by the strong. Whoever has the most power is in charge. It's not uncommon for the ruling pirate lord to be assassinated in the night by a rival. Merchant and naval ships know to navigate well away from Miranna. Ships that stray too near are pillaged. The crew is either killed or sold. It’s no secret there is tremendous wealth to be earned in Miranna. The opportunities are seemingly endless. If you can survive its anarchy.", "action_results": [{"action": "End Flashback", "result": "“Are you sure we should be doing this?” the nervous voice of your best friend, Harlan, asks.\n\n“Of course. I can do whatever I want,\" you reply.\n\n“What if the King finds out?”\n\n“Ha! So what? I’ll deal with him. There’s not much he can do to me that he hasn't tried before.”\n\n\"It’s not you I’m worried about...”\n\nThough you wouldn’t admit it out loud, you know Harlan is right. Being the second-born prince of the Brelia Kingdom had its benefits. Unfortunately for Harlan, he wasn't afforded the same privilege and would likely be punished much more severely.\n\nYou both sat at the bar in one of the city’s shadiest taverns, The Dancing Goat. Lately, you've become somewhat of a regular. You always wore rugged attire, but its patrons somehow assumed you were nobility, probably because you never argued on price like most everyone else. Once a week, The Goat held fights and it wasn't uncommon for the matches to end in death. After weeks of being thoroughly entertained in the crowd, you were ready to test yourself in the ring.\n\n“Hey, pretty boy. Are you ready to pop your cherry?” the announcer’s ragged voice resonates over the bar noise.\n\nYou empty your cups contents.\n\n“If you have anyone skilled enough to challenge me.”\n\n\"The brash ignorance of youth!\" the announcer replies. \"You're not the first soft face to wander in here. Most don't leave as pretty as they come in.\"\n\n\"I intend to stay this good-looking for awhile, old man,\" you reply.\n\nA burly hand grabs your arm and drags you into the circle of a screaming mob. Looking around, you see the drunken faces of screaming gamblers. Standing your opposite and a full head higher, you instantly recognize your opponent. That’s the fucking champion, you think to yourself. His heavily muscled frame is marked with numerous scars. His eyes meet yours and upon sizing you up, the corner of his lip curls into a grin.\n\n\"Ladies and gentlemen! Our very own nobleman has finally grown a pair. I just hope he remembered to clean his fingernails for the occasion (the crowd laughs). Who will welcome him to the pit? A man that needs no introduction. A man that has never been defeated. The champion, Carthus!\"\n\nAt the mention of his name, Carthus lets loose a primal scream and beats his chest in pride. The crowd roars into a frenzy at the sight of the monstrous champion.\n\n“Fight!”\n\nCarthus rushes at you like a crazed bull. You're unsuprised by his tactics and quickly get a feel for the man's combat prowess. An untrained man of his size, he depends upon superior strength to compensate for lack of technique. You easily side step his mad charge, tagging him with a right hook on the way past. Angered by the blow, Carthus turns to you and starts a second charge.\n\nYou stand still until he’s almost upon you. Just before he reaches you, your arm underhooks his shoulder and you use his momentum to swing onto his back. You throw hard elbows to the back of his head to soften him up a bit. Dazed by your blows, you slip your arm underneath his chin and lock the choke with both arms. He bucks and grabs at you with both hands in attempt to throw you off. Holding with all your strength, you press your body into his and wrap your legs around his massive frame to keep your center of gravity even with his.\n\n“Arghh!” you yell as Carthus bucks and flails around the ring.\n\nAfter a few moments, the lack of air gets to him and you feel his body begin to go limp. His body falls to the ground with an earth-shaking thud. You're careful not to be squished by the falling giant.\n\n“Victory! Nobleman!”\n\n“Pour me another drink and bring on the next challenger!” you shout to the cheering crowd.", "action_results": [null, null]}, {"action": "View Map", "result": "", "action_results": [null, null]}]}]}