{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=56742", "context": "", "first_story_block": "“Look at the birds, Mommy!” a child’s voice exclaims.\n\nYou snap awake, checking for your weapons automatically before you remember you’re on a civilian transport.\n\n“Bout time, Zee. We left underspace half an hour ago,” Hinsman says from beside you. “Smooth as butter. They have stabilizers set up here now, I didn’t know that. This system’s really had some work put into it since I was here last.”\n\nIn his fifties but not yet looking his age, he’s supposed to be dressed as an asteroid speculator out on holiday and is struggling in the narrow confines of his seat to tug his coat on. Hinsman’s on the short side, and the garment is a couple of sizes too big. All around you others, tourists, businessmen, and families, are starting to collect their things as well.\n\n“Anyway, just waiting on our transfer now.”\n\nYou unsnap your safety belt. “Okay.”\n\nHinsman’s got the aisle seat, just one more factor in his unspoken role in keeping you from too much direct contact with the public. Fine by you. Your job has always been to protect these people, not make conversation. Gazing out the window, you have a good view of the green planet. Camarov IV. It’s supposed to be beautiful, but it’s not like you’re here to sightsee. This is just your fastest route back to work.\n\nThe Order cruiser you’d been using got enough of a beating on your last mission it needed to be taken to a real shipyard for repairs, and meanwhile this transport was headed directly for Camarov and had two vacancies. There’s another Order ship en route to here which you’ll transfer to to be taken back to the Outer Rim. You’ll never even set foot on this planet.\n\nThere is a gentle thud as the landing ship locks on and the crew starts shepherding passengers towards the exit. Hinsman combs his dark hair and tends to the mustache he’s been cultivating. You just sit and wait.\n\nBoth of your wrist comms beep at the same time, and you see the Order ship has left underspace. There’s a little flurry among the crew when it requests to lock on, but Hinsman flashes a badge and his signature smile and the two of you transfer over without incident.\n\nOnce aboard, the ship unlocks and moves to a safe distance for a jump. Then there’s a delay as the pilot seems to have no intention of leaving until he downloads whatever media Camarov IV has to offer. Images of green hills and misty lakes and crystal spires and dancers on a stage and some sort of historical reimagining of Old Earth tumble across the viewscreen.\n\nThe pilot, Karoff, is middle aged, tall and with thinning blond hair just starting to shade to grey. His mustache however is much more impressive than Hinsman’s. You’ve worked with him before. You don't always get his sense of humor, but he's okay.\n\nThe next stop will be The Last Outpost for refueling, then you'll be taken along a scenic tour alternating between the most boring and dangerous parts of the Outer Rim as you go down the list fulfilling your various obligations there and being available to lend assistance in emergencies.\n\nYou lean against the wall and mentally check out until it’s time to strap in for the jump to underspace. Hinsman was right, the in system stabilizers do improve the experience quite a bit.\n\n\n*****\n\n\nThe Last Outpost is dark when you approach.\n\n“Well that’s not a good sign,” Karoff mutters. The station floats in place like a fat black spider against the pale backdrop of the system’s single barren planetoid. Karoff makes a few adjustments to make your approach less obvious and then starts running scans from a distance. It took you nearly a week to get out this far from Camarov and you’re all aware that if there’s trouble it’ll be just as long before you can find any backup.\n\nThe Last Outpost was once a research hospital on the edge of protected space. Now it’s a ways past the official line, although after the rollback it persisted as a stopover and fueling station for both the military and any junker the colony worlds could put together to evacuate in. Officially out of service and abandoned now as far as anyone outside the Order is supposed to know, it’s still got enough automated defenses that any scavengers looking for scrap will be sent packing in a hurry. Or it used to, anyway. Hinsman is frowning over the console now too.\n\n“That’s a lot of damage.”\n\n“Pirates?”\n\nHinsman shakes his head. “I don’t think so. The way some of the plating is buckled, this looks like a string of explosions from the inside. Mostly just in that one arm, but the defenses are offline and there’s no more than basic life support anywhere on the station.”\n\nThere’s a soft beep as a scan is completed.\n\n“One life sign,” Karoff grunts.\n\n“Even if they pulled out everyone on mission, there should’ve be at least three here for maintenance still.” Hinsman joins you at the window as he finishes speaking and stares across the distance. “But...I’ll hail them I suppose.”\n\n“You sure?”\n\n“Might as well. Doesn’t look like they have much left to shoot at us anyway.”\n\n“Let’s hope appearances aren’t deceiving.”", "action_results": [{"action": "Inquiry", "result": "Karoff looks tense as Hinsman tries to contact the station. There’s a long wait with no reply. He frowns and tries once again using Order passcodes.\n\nA green light blinks on, and then a moment later a haggard-looking blonde woman with high cheekbones and thin lips appears on the viewscreen with a crackling of static. “So someone finally did show up.”\n\nThe woman’s voice is flat and blank. She’s young and might have been pretty under other circumstances, but her eyes have dark rings under them, her face is sallow and her hair hasn’t seen a brush in awhile. She dips a spoon in a tub of drippy, melting ice cream while staring at the screen indifferently.\n\nKaroff pulls up her ID while Hinsman coughs and clears his throat. “Ah...you’re Matti Oswen, correct?”\n\n“Yeah.”\n\n“I’m Agent Hinsman. We were just stopping over on our way into the Rim, but it looks like you’ve had a bit of trouble here. Do you need assistance?” He keeps his tone light and injects a note of friendly concern.\n\nShe blinks at him owlishly a moment, then sets the ice cream aside and scratches lightly at the side of her neck. “I sent out a call, but the computer lost power and I’m not sure it went through. That was...almost a week ago, I think.”\n\n“You’re a maintenance worker, correct? What happened here, Matti? And where are the others?”\n\n“Inea and Markov? Oh, they’re dead.” Her voice is still flat and strangely disinterested.\n\nKaroff dutifully pulls up their IDs as well. Their new status as deceased hasn’t been updated in the Order database yet, anyhow, and as the three of you have heard nothing regarding the damage to the station or a rescue attempt you can only assume her distress signal never did make it out.\n\nOswen continues only after Hinsman prompts her again. “Inea had an accident while doing repairs and Markov killed himself and tried to take the rest of the station with him a couple of days later. I rerouted the power to redirect the blast just in time, but most of the generators still blew. I’ve been sitting around in the dark and trying to eat everything in the freezers before it all spoils, and then figuring I’d inject myself with something before the oxygen fails.”\n\nHinsmans voice is soothing. “Well I’m sorry you had to go through that Matti, but you’ll be safe now. We’re going to send out a request for help and then lock on to see what we can do about repairs in the meantime. We can route enough power over to make sure life support holds up, anyway.\n\n“Whatever.”\n\nOnce the call is cut, a distress signal is sent back to headquarters along with a short recorded message. The three of you briefly go over the situation.\n\nHinsman sums it all up. “It’ll be a few days before anyone can arrive to help, and we can’t leave until then. Even if no survivors were here, the station itself is vulnerable and hell, it’s probably more necessary to the Order than any of us, if we’re being honest. Although this Oswen woman...she might be in shock, or there might be something else going on there. Not sure we can trust her.”\n\nKaroff spits out the end of his mustache. “We’re gonna get in there and find out the bitch slit their throats and made bikini tops out of their skin. Seen it happen before.”\n\nYou look at him. “Really?”\n\n“Ahh, well not the skinning for bikinis part, but people get assigned to an out of the way place like this too long, they can just snap and start killing each other. Or there maybe was some kind of love triangle going on that turned nasty. And not the good kind of nasty,” he adds, apparently feeling the need to clarify.\n\n“Well I guess we’re just going to have to risk our skins then,” Hinsman says with a slight roll of his eyes. “Or you and I anyway, Karoff. But Zee, you were always going to be working alone anyhow. You won’t have us standing by in orbit if you go on by yourself, but there’s nothing stopping you from suiting up and taking a spare shuttle, if the job is urgent enough.”\n\n“Still may be awhile before we know exactly how bad the damage is to the Outpost,” Karoff points out. “She could be needed here.”\n\n“True, but...Zee, I guess this one is going to be your call. I don’t have details on the mission you’ve been requested for, so what’s protocol here?”\n\nThis would all be simpler if you could directly contact a commander, of course, but out here that’s rarely possible and having to make decisions like this on the fly is part of the job.\n\nORDER when it started out stood for Outer Rim Defense, Evaluation and Research. The joke everyone likes to make is how when the Hunger virus appeared on the scene the E stood for Evacuation, and then finally Eradication.\n\nOf course that’s the part you’re all still working on. And it’s not actually all that funny.\n\nThe Order is the peacekeeping force out past the edge of protected space, although not in any kind of official capacity anymore. A little over twenty years ago when the Hunger virus was at its peak and blazing from planet to planet, the border was rolled back and then rolled back again. Colonies and mining facilities, trading stations and outposts were cut off in the midst of the chaos and anyone who wouldn’t or couldn’t evacuate was left to fend for themselves.\n\nSome of the Order agents were recalled back to New Terra, but for many more this was their home, this was just what they did. Momentum and habit went a long way and the organization already had enough ships, stations and equipment out here to continue operating much as they always had. If anything they were more effective now that the bureaucracy and red tape had been stripped away, although that sometimes birthed its own kind of controversy.\n\nIndependent, isolated colonies and small time miners and traders had no one to protect them from piracy, not to mention the trade consortiums that amounted to a more organized version of the same thing. They welcomed the Order’s presence on one hand while resenting anything they perceived as meddling in their own affairs on another. In areas where the line between New Terra and frontier authorities blurred, certain parties also never failed to point out that the Order had no more jurisdiction than any other private organization; outside of the ancient one of might making right and the bit about possession and how it related to law, anyhow.\n\nAnd although on paper the organization kept to the same laws and standards they had from the beginning, they were just as on their own out here as anyone and had to see to their own people’s interests and protection as well. New blood could be hard enough to find as it was without asking it to spill itself simply because it was the right thing to do. About the only thing anyone could agree on was that the Order were the only ones equipped to really do anything about the Hunger virus and so they should be left to it, no questions asked.\n\nSo thankfully, politics and the rest of that nonsense aren’t anything you ever have to concern yourself with. All you do is your job, and all you worry about is doing it well. Right now that means making a judgment call on where you’ll be the most effective. And right now, that does seem to be here. Nothing you were given indicated anyone was in direct danger, and the Last Outpost is as valuable to the Order as any of the other facilities you were asked to check on, and far more strategically important. The refueling station is what makes these little forays out in this area of Rim possible in the first place.", "action_results": [{"action": "Secure the station.", "result": "You indicate to the others that you’ll stay for now and Karoff directs the ship on a route toward the station. It makes sense to at least do a cursory inspection of the damage and make sure that at least life support will hold up. And of course there’s the other issue of the alleged sabotage and personnel having been lost under circumstances still waiting to be confirmed. Leaving just two operatives to handle it all isn’t ideal.\n\nOf the station’s eight arms, the docking bay is luckily on the side that’s suffered the least damage. Karoff locks on without incident and the panels of the reinforced portal retract with a gentle whirring. Beyond, the station is dark and cold. You all file out and make your way out of the landing bay and down a hallway with the aid of flashlights. With what little power remains rerouted to life support, the portal to the central complex refuse to open. Attempts to contact Oswen on a short range channel fail, and so Hinsman finally gets the door moving with the aid of his gun; wiring the energy cell to the panel next to it, that is. At the jolt of power it snaps open with sudden speed, then begins to close again in slow motion and grinds to a halt about a third of the way. The three of you squeeze past and before long find yourselves in an open area, a kind of joint dining hall and exercise room with dead video screens lining the walls.\n\nThe kitchen area behind the dining hall is a disaster zone of empty plastic trays, overflowing trash bins and spoiled food. There’s no sign of Matti although you do find her abandoned ice cream bucket. The three of you begin to search area by area. Although reluctant to split up, you do move a bit faster than the others and take to checking into rooms and around corners ahead of them.\n\nA pool of vivid crimson against the polished grey tile is your first confirmation that something has gone wrong. You race forward to Matti Oswen’s crumpled form and check her pulse, clamping another hand down on the stub of her severed arm. Lifting the woman from the ground and calling out to the others, you splash your way through the blood, tracking it behind you while more soaks into your uniform.\n\nA medical station was one of the places the three of you had already searched, so you hasten to it and deposit her on a steel table, keeping your grip just above the wound while Hinsman activates the computer.\n\n“This nursing AI was obsolete fifteen years ago,” he grumbles, taking a protective suit from a persistently dinging open door and yanking it on over his clothes.\n\n“Isn’t that a bit of overkill?” Karoff asks, watching him.\n\nHinsman’s response is muffled through the breathing filter. “It won’t let me even proceed without it. This place was last used to quarantine evacuees exposed to Hunger, there’s no such thing as overkill as far as the computer is concerned. Just be glad the whole station isn’t set to self destruct the moment someone gets a paper cut.” He pauses a moment to apply a tourniquet. “Now...Zee, you step back, it hates you too.”\n\nKaroff looks at you and snorts. “I imagine so. You look like you just left the scene of an axe murder.”\n\nYou’d already moved away at Hinsman’s order, and now you ruefully wipe you face, hoping to achieve a clean spot. Karoff’s ensuing guffaw informs you you probably just made the situation worse.\n\n“I’ll go clean up the mess in the hall...and myself,” you say, turning to go.\n\n“Zee, wait, wait, Miss Oswen is going to need an arm transplant, don’t you think?”\n\nYou blink at Karoff. “Are you serious?”\n\nThis just provokes more laughter.\n\nHinsman, who has been preoccupied with the soothing voice of the medical AI and the use of instruments taken out of little drawers that have been popping open in sequence, now shakes his head at the two of you as he changes to clean gloves. “I’m not that good a doctor, I’m afraid. Zee, you go on.”\n\nHe snaps his fingers at Karoff and in the other hand produces an oversized needle, like a magician’s trick. “But I will need a blood donor, and guess who’s compatible?”\n\nAlready on your way out, you turn and get a glimpse of the pilot’s grimace as the door slides shut between you.\n\n\n\nCleaning up is a tedious but straightforward affair. You scrub yourself down and change into a plain grey jumpsuit you find before returning to the scene of the accident and getting to work.", "action_results": [{"action": "Dispose of the severed arm", "result": "It seems Oswen had been trying to unjam a door that leads to one of the station’s storage arms, in much the same way Hinsman had gotten you all into the central complex earlier. It was her misfortune that upon receiving a jolt from a maintenance tool the door had snapped shut, meaning it had been open to begin with.\n\nThere’s enough juice left to get it back to where it was and you carefully retrieve the severed limb on the other side, slipping it into a biohazard bag. Taking a moment to confirm with Hinsman there’s nothing he can do as far as reattaching it, you consider your options for disposal. An incinerator would the most straightforward, but those require an amount of energy that seems wasteful if not impossible to produce given the station’s current reliance on emergency backup power for life support.\n\nYou remember then the walk in freezer in the kitchen behind the dining hall. At least that would keep it from rotting if it takes longer that expected to get the power on full. The room isn’t able to maintain freezing temps anymore but it’s still noticeably colder than the rest of the station, and the rest of the station is cold enough. Placing the bagged arm on a shelf, you halt a moment as your gaze fixes on the two bundled forms in the back. So you weren’t the first one to have the idea to use the place as an impromptu morgue. These must be the bodies of the other two maintenance workers, Inea and Markov.", "action_results": [{"action": "Inspect the bodies", "result": "Opening the largest body bag first, you briefly examine Markov. Evidence of cuts, burns, and some bits of broken glass still embedded in the skin seem consistent with him having been in the vicinity of an explosion, although there were a lot of unanswered questions in Matti’s brief explanation. Further details will have to wait till she’s conscious again, you suppose.\n\nYou zip the bag back up and turn your attention to Inea. The dark haired woman’s cause of death is immediately obvious, her skull on the left side having been caved in just above and behind the ear. ‘An accident while doing repairs’ was how Matti had described her death. While you can’t yet find anything to contradict that, as you probe along the edges of the splintered bits of skull and cold globs of brain matter it seems to you it would’ve taken an awful lot of force concentrated in that one spot all at once to do that kind of damage.\n\nThen again, Matti had nearly managed to kill herself as well. You wonder what sort of accident it was supposed to have been. It’s almost incredible to you that three people so incompetent had been left in charge of such an important Outpost. It’s true that space is a big place and Order agents and personnel are stretched thin, but in your experience it’s rare for things to go this spectacularly wrong without someone being at fault.\n\nFinding nothing more of note, you close up that body bag too and then exit the freezer. Grabbing a mop from the corner of the kitchen and filling up a bucket, you make your way back to where you’d found Matti and go to work on the rapidly drying blood. The blood has begun to dry and it’s obvious this will take awhile so you clear out your mind and focus on the task.", "action_results": [{"action": "Back to the nursing station", "result": "Matti is asleep. Hinsman is seated at a table near the bed, freshly showered and changed into a grey jumpsuit identical to yours and looking exhausted. Karoff is nowhere to be seen.\n\n“He’s back on the ship seeing how much power we can spare,” Hinsman tells you, before you can ask. “This medical station’s about the only thing working as intended in this place right now. We need to at least get the computers up before we can figure out what all needs to be repaired and how. It’d be really great if we had a maintenance worker familiar with the place to talk to, but...” He inclines his head toward the young woman’s supine form and shrugs. The end of what’s left of her arm is neatly wrapped in bandages, but her face looks pale and strained even in her sleep and her eyes twitch restlessly behind her lids.\n\nBriefly you relate what you’d discovered.\n\n“The plot thickens,” he mutters, then gestures toward the computer. “Why don’t you see what you can find there as far as internal records on these three?”\n\nYou nod and take a seat, flashing your wrist at the sensor. The computer blips once and you’re in. You have a pretty high clearance. Higher even than Hinsman’s you suspect, although that’s not really a thing you’re supposed to ask anyone about. Retrieving sensitive data from wrecked Order ships or evacuated command stations is one of the things you need to be able to do with no fuss when required, and your superiors know this.", "action_results": [{"action": "Look up Inea", "result": "Name: Inea Banca\nEyes: brown\nHair: black\nHeight: 5’9”\nWeight: 145\nAge: 46\nOther: tattoo on right forearm\nOrigin: Camarov IV\nSkills: fringe space station maintenance\nYears service: 9", "action_results": [null]}, {"action": "Look up Markov", "result": "Name: Markov Carst\nEyes: blue\nHair: brown\nHeight: 6’3”\nWeight: 201\nAge: 41\nOther: left handed\nOrigin: Galton Station\nSkills: fringe space station maintenance\nYears service: 5", "action_results": [null]}, {"action": "Look up Matti", "result": "Name: Matilda Oswen\nEyes: green\nHair: blonde\nHeight: 5’3”\nWeight: 122\nAge: 26\nOther: stationed at The Last Outpost for completion of training\nOrigin: Camarov IV\nSkills: fringe space station maintenance\nYears service: 1", "action_results": [null]}]}]}, {"action": "Go finish cleaning", "result": "You come across no shortage of corpses in your line of work and so you have little curiosity about these two, morbid or otherwise. When Matti awakens, Hinsman will question her about the deaths, but aside from some practical knowledge in the area no one here is exactly a forensics expert. That’ll be the job of the team the Order will dispatch to deal with the situation out here.\n\nYou exit the freezer, pausing to grab a mop from a corner of the kitchen and fill up a bucket. Returning to where you’d found Matti, you go to work. The blood has begun to dry and it’s obvious this will take awhile so you clear out your mind and focus on the task.", "action_results": [{"action": "Back to the nursing station", "result": "Matti is asleep. Hinsman is seated at a table near the bed, freshly showered and changed into a grey jumpsuit identical to yours and looking exhausted. Karoff is nowhere to be seen.\n\n“He’s back on the ship seeing how much power we can spare,” Hinsman tells you, before you can ask. “This medical station’s about the only thing working as intended in this place right now. We need to at least get the computers up before we can figure out what all needs to be repaired and how. It’d be really great if we had a maintenance worker familiar with the place to talk to, but...” He inclines his head toward the young woman’s supine form and shrugs. The end of what’s left of her arm is neatly wrapped in bandages, but her face looks pale and strained even in her sleep and her eyes twitch restlessly behind her lids.\n\nThere doesn’t seem to be anything you’re able to help with here, so you start to head back to the ship to find Karoff and wind up meeting up with him in the arm of the docking bay. He’s got a hovering platform loaded with equipment next to him and is attaching a power node to a panel.\n\n“Oh, there you are Zee, perfect. I need you to distribute the rest of these EPNs around the central complex.” He gestures at the platform. “I’ll come along behind you in a bit and rig them up.”\n\nThe EPNs--external power nodes--can be linked in to bypass dead or damaged areas in the regular power system. It’s likely some trial and error will be needed but you doubt it will take more than a couple of hours if all he cares about is the main section and the docking bay. The other seven arms of the station can just stay sealed off until a proper repair team comes in.\n\nYou return to the central area of the station and begin setting down the EPNs near accessible panels and in a short while you’ve covered the perimeter and begin making your way back. All is quiet until just as you pass a narrow hallway you hear a voice. “Zani, get inside!”\n\nYou whirl, activating the short range laser weapon you always have with you. The voice had been a woman’s, sounding frantic and seeming to come from close by. But you see nothing. You shine your light down the hallway you’d just passed, revealing a row of half a dozen closed doors on each side.", "action_results": [{"action": "Search the hallway", "result": "You want to verify there’s a threat before you call anyone else in. Even though you’re not suited up at the moment you feel pretty confident in your ability to handle a few trespassers anyhow so there’s no point in risking the others if they prove hostile.\n\nYou ghost down the dark hall opening doors one by one and shining your flashlight around. The rooms all appear to be crew quarters and although you search any place anyone could hide, they’re all empty and only three show any recent signs of usage.\n\nRetreating back to the entrance the hall, you widen the scope of your search, but after another half hour are forced to admit to yourself there’s no one here after all. This wouldn’t be the first time you’ve had...hallucinations in the past. Or whatever the technical term would be for you. They have to get pretty bad before they impair your ability to work, but the woman’s voice had seemed so close and chillingly real. You’ll have to keep aware of the possibility of it happening again now. If it gets worse, you know you’ll have to report it, but for now you’re just glad you didn’t drag anyone else down here for no reason.\n\nYou return to the crew quarters to look once again at the rooms the current maintenance crew were occupying, although more out of curiosity about them than any expectation you’ll locate your phantom voices. The walls of Matti’s room are covered in projected images of performers and celebrities...you recognize many of them from the media Karoff downloaded from Camarov.\n\nInea’s room contains images of a family, presumably hers, and several empty bottles that indicate she had a minor pill habit. Nothing illegal enough for you to care about--even less so now that she’s dead--and most of them are expired anyhow and you suspect taken from the station’s abandoned medical arm.\n\nMarkov’s room is somewhat grubby with dirty clothes tossed carelessly around. Your eyes are drawn to his desk immediately as the only uncluttered spot in the room. After a moment you realize that’s because his personal computer is gone. Every other room, even the empty ones, had one of the devices built into the desk surface.", "action_results": [{"action": "Search for the missing computer", "result": "The crew quarters aren’t large. If the computer is in here there’s only so many places it can be, and a methodical sweep of the room, closet and bathroom finally turns it up--slid into a pair of brackets fitted to the underside of the nightstand drawer. Just as you slide it out, the lights flicker on. Karoff’s triumphant voice sounds over the intercom, followed a moment later by Hinsman congratulating him.\n\nYou however have your attention glued to the activated screen. It’s still an Order-issued computer so your wrist chip was able to get you in, and what you’re looking at is intriguing. Four days before Markov triggered the explosion that took his life--and nearly took out an infinitely more valuable outpost--he started sending and receiving a series of encrypted messages on a private frequency.\n\nWhat it all means or if it’s even related to his actions at all you can’t say just yet, but it’s obviously something to look into. You take the computer with you return to where you left the hover platform. The main computer room Karoff’s working in now is quite close so you take a detour to speak to him.", "action_results": [{"action": "Frequencies", "result": "“Interesting. What was he up too, I wonder?” Karoff peers at the coded messages thoughtfully. “The main computer should be able to unencrypt these though. We’ll just leave it hooked up here and let it do its thing. The damage report for the station is almost done compiling anyhow.”\n\n“How bad is it?”\n\nHe spins in his chair to face a new screen, chewing on a dirty thumbnail. “Hmm, let’s see. This would indicate The Last Outpost is...yup, it’s damaged all right. And needs repairs. From people who are not us.”\n\n“So nothing immediate needs attending to? There’s nothing wrong that would put you or Hinsman in danger if you waited here a few days?”\n\n“Well, unsealing some of the station’s arms would be pretty fatal. They took the brunt of Matti’s hack rerouting job and a couple lost atmosphere. The old medical wing itself is in real bad shape obviously, that’s where Markov set off the first explosion. But all we really need is life support and power here and in the docking bay. We don’t really have enough power for the rest of the station anyway as long as we’re siphoning from the ship. I’ll go and seal anything unnecessary off in a bit and then we don’t even need to worry about leaving them with life support.”\n\nGood. That means you can leave here and continue carrying out your orders just as soon as this mess with the dead workers is sorted out.\n\n“By the way, Hinsman is going to try waking Oswen up for a little while and then wanted us there afterwards to sort of put our heads together on how to handle all this,” Karoff adds, nearly reading your mind.\n\nYou step toward the door. “I’ll go now.”\n\n“Eh, what’s the rush? But I’ll be there after I finish a couple things. We’re all just gonna sit around till the relief team arrives either way.”\n\n“I could go and take care of my mission while the two of you wait. Hinsman suggested that earlier, remember?”\n\nKaroff snorts and shakes his head slowly as he turns his attention back to his screen. “Don’t you ever get tired of working so hard?”\n\nYou’re a little take aback by the question. “No?”", "action_results": [{"action": "Matti's Story", "result": "Matti Oswen is awake and speaking with Hinsman already when you enter. They pause and look up at the soft whoosh of the door, but you take up position in an unobtrusive spot next to it and stay quiet till they resume the conversation. Oswen’s words are hardly above a whisper. Her face is drawn and she’s clearly in pain. Hinsman in his usual way is breezily taking her mind off things while leading her along to a series of key questions and not making it obvious that’s what he’s doing.\n\n“...I don’t know what happened to Inea exactly. She was just replacing some conduits in the old medical wing...standard stuff, it’s got to be done every four years even in the areas no one uses anymore. Something fell and hit her on the head, he told me. But Markov was in shock, or something like it so he never really went into detail. He hardly left his room for two days, and after that he...” she swallows hard and then continues at his gentle prompting. “I mean, it never seemed that they were like, close close, but they’d worked together a long time, and I can’t think of any other reason he’d do what he did.”\n\n“Was a report sent in about Inea’s death?”\n\nShe nods. “We sent one, yes. Markov filled in the details of course, since I wasn’t there.”\n\nHinsman looks at her intently a moment, then begins asking her some simple questions about their routines around the station, listening patiently to her answers before coming back around to Markov. “So when did you first realize what he was doing?”\n\n“Like I said, I’d barely seen him in two days. That wasn’t unusual even when there were three of us if we happened to be working on different areas of the station, but I was worried enough about how he was taking things I even went and knocked on his door once. He wouldn’t answer. Although that day that...everything happened he turned the intercom on a couple of times.”\n\n“What did he say?”\n\n“Well...nothing. I could hear him breathing and got the idea he was about to say something, but then it would cut out. I was definitely on edge by that time and not sleeping well, but I kept telling myself a team would be here soon, they’d pick up Inea’s body and station someone else here and surely they’d notice what a wreck Mark was and do something to h-help.” She has to stop a moment, and draws a shuddering breath.\n\n“And then what happened?”\n\nI was taking a break in the main computer room...I’d decided to sit in a VR film actually, to take my mind off things. Then all of a sudden a bunch of alerts started sounding.”\n\nSomething crawls along your arm and you brush it away. An ant or something is your immediate assumption. A strong fragrance of freshly cut grass lingers in your nostrils.\n\n“Look at the birds, Mommy!”\n\n“Zani, get inside!”\n\nWith the interference of the audio hallucinations you come back to yourself. An insect of any kind would be highly unlikely to have hitchhiked this far, and the scent of grass is not something you're certain you've even encountered enough to readily identify. Not to mention your sense of smell is rudimentary at best.\n\nOswen has been describing how she counteracted Markov's attempt to destroy the station. “It's almost funny, covering that exact scenario was one of the last things we did in training before they sent me out here. And it just hadn't really sunk in even then that he would really do something like that intentionally. But it worked just like they said it would.”\n\nTouching your arm, you vividly remember the tickling, crawling sensation and look carefully at your clothes and the floor. There is no ant.\n\nYou shake your head to banish these distractions and refocus. You don’t want to miss anything important.\n\n“There was a critical overload there in the medical arm where Mark had started the chain reaction, but I was able to redirect the worst of the rest into the arms next to it, so the blown generators were the only damage to the central complex.”\n\n“And when did you recover Markov's body?”\n\n“Well he wasn't dead yet, is the thing. The emergency shields were still holding in that section and the computer showed a life sign so I put on a breathing mask and went to try and drag him out.”\n\n“That was risky.”\n\nShe gives another shaky laugh as she recalls the events. “The anti-grav was already down, and I had to cross this section where the wall and floor was just...gone, so I was terrified the shields would collapse and blow me right out into space. And then when I got to him he was covered in blood, almost unrecognizable. He was trying to unlock a cabinet but his hands were all torn up. There was broken glass and like, shrapnel, all in his skin. Some of it looked deep. And...the most difficult thing was he just wasn't himself.” Her expression darkens. “He'd completely lost it, really. He screamed at me to get away and struggled and fought me. I ended up slashing open my arm on a big piece of bloody glass--”\n\nShe falls silent a moment as her gaze drops to the bandaged stub. “Well. I guess that doesn't matter now, huh?”\n\nHinsman murmurs something sympathetic and she continues. “And then he just straight up tried to kill me. Grabbed for my throat, and I kicked him and...I don't know exactly, we got separated and I was trying to orient myself because I was panicking and, you know, the gravity. And then he was just dead. I wasn't really thinking at that point, I hauled him back to the central complex, I was thinking something could be done, like the nursing AI would help or he could be put in cryo or something, you know, like in the VRs...but then of course once we reached Central the gravity kicked back in and I couldn't move him anymore, plus I was bleeding all over everything. I made sure nothing else was going to explode and then went to treat my arm, and brought a platform to lift him later. I moved Inea's body then too...to, to the dining hall freezer.” She sounds momentarily embarrassed and lowers her voice for that, as if she thinks the New Terra health department might overhear and swoop in and shut the place down. “Since the power was out completely in that section and we still had it on low in parts of Central.”\n\nMatti stops herself and winces. “I mean...not we. It was just me at that point. The most useless person around so of course I survived.”\n\n“You handled all of that as well as anyone could have and I think better than most,” Hinsman reassures her. “The rescue attempt is probably more than I would've tried, and you had no way of realizing then how far gone he was.”\n\n“I just can't figure it out, why he would...” Matti trails off and shifts on the bed, closing her eyes and wincing. “I'm just so tired.”\n\n“Get some rest. You've been a great help and I think you've explained most of what I could think to ask.”\n\n“Why were you sealing off the door to the storage wing?” This time the question comes from you. Hinsman gives you an irritated look at the interruption. Perhaps your tone was too blunt for his liking, but it really is something that had seemed odd to when you were cleaning up.\n\n“Oh. Well I knew all of you would be boarding soon, so I thought I should try to pull myself together and...you know, do my job for once. The power would be easier to get back on in the central complex if all the arms could be sealed off, and the storage wing door was jammed open.”\n\nYou nod but say nothing.\n\nMatti rests her head weakly against the pillows. “I should've just stayed there with my ice cream. I could really go for some now anyway, damn...”\n\n“I'll heat up some dinner for you soon, from our ship,” Hinsman promises. “I don't know about ice cream, we don't travel quite that luxurious, but we may have something that can pass as dessert around.”\n\n“Thanks,” she gives him a wan smile and leans her head back against her pillow, her blonde hair spread out on the pillow to frame her strained face like a halo.\n\n“Zee, let's go outside. I've been needing to talk to you and Karoff...where is he, anyway?”\n\nYou'd already turned to exit with Hinsman stepping out into the hall behind you when you both spot the pilot coming down the hall.\n\n“Perfect,” Hinsman says.\n\n“I know I am.” Karoff replies with a wink. “But did I miss anything important?”", "action_results": [{"action": "Inference", "result": "“Miss Oswen gave me enough details on the cause of the damage to start writing a report, at least, but some things still don’t sit right with me. Even if Inea’s death made him suicidal I still don’t understand Markov’s motivation for trying to take out the entire station, for one...”\n\n“He had the space crazies!”\n\n“...I can’t put that in a report. But unfortunately Oswen had very little contact with him following Inea’s death. And we don’t even really know what happened to Inea herself other than Zee’s examination indicating blunt force trauma to the head.”\n\n“Ah, about that.” Karoff fishes something out of his pocket and taps a button. “Relevant?”\n\nA 3D image of an energy canister is projected into the air in front of you all. You recognize the type; the larger energy cells can be volatile, so the canisters are made with half an inch of steel and an interior enamel coating for protection. This one is about the size of a fire extinguisher, which is typical.\n\nWhat’s not typical about this one however is the is the dried blood and long strands of dark hair caught up on the outside of the sealing mechanism.\n\n“Where the hell did you find that?” Hinsman wants to know.\n\n“In the storage arm where Miss Oswen lost hers. There are a lot of spent canisters piled up in there, and I was looking for more power cables just now and stumbled across this one.”\n\nHinsman’s brow is deeply furrowed as he studies the projection. “That is just suspicious as hell. Has anyone had a look at the body yet?”\n\nYou and Karoff both shake your heads, and as Matti had just mentioned where they were stored, the three of you make your way to the dining hall.\n\nThe two bodies are on gurneys, zipped up in body bags in the back of the freezer. You open the bag holding the smaller form, ignoring Karoff’s inquiries as to whether letting restaurant kitchens rent freezer space to morgues could be a viable alternate source of income.\n\nUpon examination the dark haired woman’s cause of death is immediately obvious, her skull on the left side having been caved in just above and behind the ear.\n\n“Not a glancing blow, either. There’s no way that happens from a spent fuel canister falling on someone’s head. Not even a full one.”\n\nAfter a long moment he sighs and steps back. “All right, let’s go over what facts we have. About a week ago, Inea Banca was doing routine maintenance in the medical wing and had her skull caved in with an energy canister. Markov Karst then goes into seclusion for two days, at the end of which he goes to the medical wing and attempts to cause a power overload that will destroy the station; a major act of treason against the Order that will render a number of Outer Rim colony worlds and ships unable to receive emergency aid and also kill the young woman who remains here. A bit dramatic even for a suicide attempt, but I suppose not outside the realm of possibility. When it fails he become violent when Oswen attempts a rescue and dies moments after. Miss Oswen sends out a distress call that doesn’t seem to have gone through due to the failing power and waits here alone until we happen by. Does that all sound about right?”\n\nYou mull that over while he and Karoff discuss the details a bit longer.\n\n“I’m sure there’s more investigating we can do,” Hinsman is saying. “The medical arm, for instance. That’s where everything happened.”\n\nKaroff shakes his head. “Atmosphere and shielding has failed and there are holes blown straight through the plating. It’d be too much a risk just to satisfy our curiosity, even for Zee.”\n\n“Fair. It doesn’t feel right to just sit around and wait on another team, though. We need to get together as much info as possible. It might be useful to read over the personnel reports again, and...oh! There’s the report they sent in on Inea’s death.” Hinsman glances over at you. “And what about you, Zee? Let’s see that sharp analytical brain in action.”\n\n“My brain’s not any sharper than yours I’m afraid. And too bad, some kind of AI to analyze things might be more what you need right now.” But you’ve been following a particular train of thought, and at his prompting you decide to give it voice. “But they didn’t fill out a death report on Inea Banca. I don’t know why Oswen claimed that. Banca was still listed as alive in their database when Karoff pulled up her file, right before we boarded. So in fact, I believe that...”", "action_results": [{"action": "“Matti killed Inea and then Markov to cover her tracks.”", "result": "“What?” Hinsman seems taken aback. “Where are you getting that from?”\n\nKaroff scratches his head. “Uh, Zee, I know that was my original theory, but I’m not so sure now. Markov did try to blow up the station.”\n\n“Do we have any proof of that? Or of anything Oswen has claimed?” You wait. When neither is able to give a satisfactory answer, you continue. “It’s a possibility we have to consider, at least. All we really know is that Banca and Carst are dead and that someone damaged the station in a way that made most of the evidence inaccessible. And that Oswen tried to seal off the entire the entire wing containing the murder weapon right after we arrived.”\n\nA couple of times while you were speaking Hinsman looked ready to interrupt, and now he cuts in as you pause, raking his fingers through his dark hair. “Zee, you can't seriously...urgh, I guess you're always serious. But Matti isn't a killer.”\n\n“How can you be sure of that?”\n\n“Because dammit. I can tell when people are lying. Matti's not like that.”\n\nThe force of his protest surprises you. “Can people tell when you lie to them?”\n\nThat at least gets a short laugh. “No,” he admits. “But I've had a couple more decades practice don't forget. You can trust me on this one though, Zee. That little girl's not some cold blooded killer.”\n\nYou frown. “I'm not denying you're better at reading people than I am. But at least one murder occurred and serious damage was done to a vital Order refueling station. You know I'm not saying anything anyone at HQ won't bring up. We need to look at real evidence, and for now all we have is one person's word for it.”\n\n“We're not qualified for this legal crap,” Karoff complains.\n\n“It's the Outer Rim, buddy, we make our own law,” Hinsman replies. “Hell, nobody should've ever gone out this far at all.”\n\n“Well now you just sound like a dirty anti-frontierist. But my point is that according to their files, Inea and Matti are both from Camerov IV. Pop them both in cryo and aim them at the planet. They can sort out the murder and if Matti turns out to have done any of the damage to the station she'll be right there and handy to retrieve.”\n\nHinsman laughs at that. “You make it sound like we're such good friends with the Camerovs. They'd just love us dumping her off and then swooping in to grab her again I bet.”\n\n“Yeah well I've got a dozen fusion torpedoes that say they won't complain too hard.”\n\n“Jesus Christ, I'm definitely not getting a bonus this year if I let you start a war. Anyway, everything else aside, Matti's lost a ton of blood and is pretty weak still. A cryo pod would be too much of a risk.”\n\n“If there's anything to Zee's theory, she could be a risk to us, keep in mind.”\n\n“Yeah, I realize that.” Hinsman looks unhappy enough that you almost hope that you're wrong. You've been slowly losing your mind lately anyway, what's one bad theory?\n\n“Well...we can check for the report,” Karoff offers. “The one on Banca. Maybe it wasn't ever finalized and sent but we'll see if we can verify at least that much of her story. And if it exists it may have more details.”\n\nHinsman nods. “All right, let's do that.”", "action_results": [{"action": "Interference", "result": "“I can absolutely, definitely, factually say with complete certainty , all serious, and not the slightest hesitation...” Karoff twists in his seat to regard Hinsman as he speaks. “...that the report on Inea Banca's death does not exist.”\n\n“Are you serious? Are you sure?”\n\n“Hinsman, I don't feel like you heard me. Absolutely, definitely--”\n\n“All right enough. Dammit. Did you check to make sure it didn't get caught in the buffer? Maybe it's still trying to send. The power hasn't been back on for long.”\n\n“There weren't any problems with the power at the time the report would've been made. That was before Markov pulled his stunt,” you point out.\n\n“Just check,” he tells Karoff.\n\n“Checking, and...nothing. Wait.” He pauses and frowns. “Well none of these are the report, but it looks like a batch of personal letters Inea tried to send a day before her death never went through either.”\n\n“What do they say?”\n\n“Hinsman!” Karoff gives a mock gasp and assumes a scandalized tone. “They're personal letters!” He's already pulling the first one up, and you catch a brief glimpse of Banca's smiling face at the beginning of a video before he switches to the readout and scrolls rapidly past pages of text asking how various people, children and pets are, some jokes about a co-worker having a crush on her and discussion of a new VR film.\n\n“All pretty standard inane family garbage,” Karoff says in helpful summary.\n\nHinsman frowns. “Well, make sure they don't get lost. I'm sure the family will think more of them than you do, considering. But why didn't it send? Were they isolated from the network before the power went out? How would that happen?”\n\n“I'll tell you in exchange for a colorful parrot and a bottle of rum.”\n\n“You think so?”\n\n“Oh, I know so, now. You see...” Karoff twists the screen so Hinsman can see it. You shuffle around behind him to get a look too.\n\n“That's the same encryption the messages on Markov's computer used,” you say.\n\n“Right. Because it would appear that someone...can't imagine who...installed a little something to communicate with a probe somewhere. The probe in turn has been intercepting any outgoing messages, as of at least one day before Banca's murder. They’re getting a little fancier with their methods but cutting communication before an attack is the classic technique.”\n\n“So, we have pirates coming this way? Well damn. If they started out right after everything went down they’d be about right on top of us too if they went into underspace from any of the neighboring stars.” He considers that a moment and then shrugs. “But there’s three of us and what, maybe a couple dozen of them? We’ve all fought with worse odds. We can hold them off till help arrives.”\n\n“Oh, but precious, naive little Hinsman, it’s worse than you think. The probe has been intercepting all outgoing signals. There won’t be any help arriving for Miss Oswen or for the station or ourselves, because no one knows we need it. Also, don’t forget shielding and all defenses are down.”\n\n“Shit.”\n\nThere is an encouraging beep just then and all eyes turn to Markov's computer.\n\n“Well it’s not the blueprints for an anti-pirate device so don’t get excited or anything,” Karoff says, picking up the device and activating the screen. “And it’s not even finished yet, that was just the first run. Still, might be enough to give us a better idea of what the situation is.\"", "action_results": [{"action": "Markov's Secret", "result": "Most of the text Karoff scrolls past is gibberish, but a few of the messages are partially deciphered. Even these prove frustrating however as even the ones where you can make out sentences are delicately phrased with deliberate obliqueness. But as the messages near the end, they suddenly start dropping the pretense.\n\n“Ah, here we go. Well that’s right to the point, isn’t it?”\n\nYou peer over Karoff’s shoulder at the screen.\n\n^ou’ve al%ead^ killed ove% this. It’s too late to back out now. ^ou can take ^ou% mone^ o% a hole th%ough the skull--we’%e coming fo% the package eithe% way, so ^ou’d do well to think twice befo%e ^ou do anything ^ou’ll %eg%et.\n\nAs to ^ou% question, it ain’t nothing but sweet %evenge, Ma%kie bab^. The^ tu%ned us back du%ing the evacuations. We couldn’t ‘p%ove’ we we%en’t infected and what we%e we to them but a bunch of shitkicking fa%mers and %anchers? Well we didn’t have Hunge% but we got hung%^ ENOUGH limping a%ound the %im to find a new home and plent^ of us died of infection all %ight--just plain o%dina%y bo%ing Old Ea%th influenza that could’ve been cu%ed if we’d had even the most p%imitive aid. My wife and daughte% among them.\n\nThe o%ganization ^ou wo%k fo% has blood on its hands, and don’t even think it stops the%e. A lot of ou% people ma^ have gotten complacent once the^ %esettled, all this talk of ‘moving on’, but that’s just not fo% me and m^ f%iends. We won’t fo%get and we won’t allow them too eithe%. And I’ve made man^ mo%e f%iends %ecentl^. We’%e getting ou% %evenge, and I think ^ou know exactly how.\n\nSee ^a soon, Ma%k.\n\n--W. Ho%seman\n\n\n“So we’ve definitely got pirates coming this way.” Hinsman says with a rueful shake of his head. “Or terrorists, anyway. Even better, right? And so much for your theory on Matti, Zee.”\n\n“Any theories on what the package is?” you ask after a moment’s silence.\n\n“Carst is from Galton Station, isn’t he?” Karoff asks. “I think I saw it in his file. I’ve been there once or twice, and don’t ask for what. But they all but advertise they’re a black market.”\n\nHinsman nods, looking grim. “Most likely blueprints for illegal weapons tech, or an ethics-stripped AI. Something small Carst could easily smuggle back over here the last time he was on leave. And something valuable and risky enough he’d kill anybody who got in his way.”\n\nKaroff taps around on the screen some more. “Too bad he didn’t survive,” he finally says with a sigh. “Because I’d sure like to kill him myself right now. Scans found the probe by the way. Way out there on the edge of the system.”\n\n“Oh really? That’s something at least. Although it’ll take time to get to and disable, and I’m not sure we can spare that right now. We need to start thinking of how to defend ourselves.”\n\n“The sooner we get a distress call out the sooner we can put an end to all this,” Karoff says. “We’re nothing but a target right now, with the defenses down and if there’s enough of them they can wear us down eventually without much risk to themselves.”\n\n“Can the defenses be repaired?”\n\nKaroff winces. “I was afraid you were gonna ask that. And technically yes, but it’s a big job. The turrets are in every arm of the station and we’ll need to get power to all of them, which means cutting back here in the central area.”\n\nThey both sink into a grim silence for a bit, before Hinsman finally looks over. “All right Zee, I guess you get the tiebreaker. What are you most in the mood for right now?”", "action_results": [{"action": "Take out the probe", "result": "With no time to delay or hesitate, you’re moving toward the docking bay within moments of making your decision while Karoff hurries along behind you and hits you with a barrage of rapid-fire instructions and advice for piloting one of the ship’s shuttles.\n\n“Whatever you do, don’t get it blown up!”\n\n“I’ll try my best.”\n\nThe voices of your companions soon fade as you ease the shuttle out into the silence of space, aiming for the emptiest and coldest edge of the system and the coordinates Karoff pinpointed. You blink in and out of underspace a couple of times the way he showed you, or else the trip would take days. Risky in a populated or debris-filled system for someone without much training, but there’s nothing much to worry about colliding with out here.\n\nThe probe is right where it’s supposed to be. It’d be possible to target with a missile now, but your initial scan indicates it might be rather unusual in design. Retrieving it intact might lead to clues about its maker, certainly the sort of person the Order would want to shut down...or recruit.", "action_results": [{"action": "Retrieve it.", "result": "You ease the shuttle closer, and closer still. The viewscreen isn’t needed to get a visual on the probe now; you can just look out the window. It’s small, but the slender segmented form puts you in mind of a wasp, with a pair of satellites making up the ‘wings’. The design is sleek and something about it worries you. The longer you look at it the more you get the sense it’s dangerous somehow. But that’s just all the more reason to take it out of commission.", "action_results": [{"action": "Bring it on board.", "result": "The shuttle has a pair of grappling claws for specimen retrieval which you now deploy. Moving with utmost care so as not to nudge your target and send it spinning off into space, you grip the probe and draw it into the cargo hold.\n\nThe hold door slides shut, and the grappling claws fold themselves back into place. Glancing at the probe on the viewscreen, you see a red light blink on. Before you can even wonder what that means an explosion rips through the vessel, splitting the belly of it wide open and spilling you along with the rest of its contents out into the space. You tumble among the shattered remains of what used to be the shuttle, and the last thing you think before you’re vaporized by the detonating power core of the underspace drive is that Karoff will not be happy.", "action_results": []}, {"action": "Disable it with laser fire to be safe.", "result": "A precisely aimed laser from close range is a far cry from a fusion torpedo, and won’t harm the probe in any way that would prevent it from being studied. You target the spherical ‘head’ of the wasp and fire.\n\nA quick spit of green light burns a tiny hole through what you hope is the central processor. A moment later you realize your error however as the shot has not only failed to disable the probe, but triggered a response in return. The shield indicator on your screen blinks to zero for a split second, accompanied by a sound of metal clinking against the outside of the ship.\n\n“What the--”\n\nCrackling energy is suddenly crawling from every wall. The wave rips through you and your vision goes white, then black. You’re dimly conscious of hitting the floor, and then never wake up again.", "action_results": []}]}, {"action": "Just blow it up.", "result": "The targeting system only allows missiles to be fired from a certain distance, depending on the size and movement speed of whatever you’re aiming for. Given the threat a loose missile can pose flying unchecked through space, forever, the idea is to prevent anything that’s not a pretty sure shot. You’re right at the edge of that distance now. The probe is small and so you carefully line up your shot before launching the missile.\n\nIt takes a few minutes to reach its destination, during which you watch the little blipping light traveling on your screen and remember why you prefer ground combat.\n\nThe probe unleashes an inordinately powerful blast of energy when it explodes, the shockwave sending your shuttle tumbling into a backwards roll. You breathe in acrid smoke. From somewhere, shouts of fear and anger, pounding boots mingled with muffled explosions. You are underground but not deep enough to be safe. Striking desperately at the console, you halt your momentum and steady the ship. In a moment you reorient yourself.\n\nYour shuttle is fine. And a quick scan reveals your target has been reduced to cosmic dust. It must’ve been packing more than the average probe to trigger an explosion of that magnitude, but you’ll never know for sure now. There’s nothing left to salvage.\n\nBefore making your way back to the Last Outpost, you immediately transmit the distress signal Hinsman had prepared, although you know it’ll still take a week before anyone arrives. Anyone on your side, anyway.", "action_results": [{"action": "Repair defenses", "result": "Hinsman and Karoff are already ripping out most of the EPNs that were so recently installed by the time you finish suiting up. Your sleek one piece outfit is in the Order colors of dark blue and grey, and more than just a uniform. With the addition of your helmet with its built in breathing mask it serves as well in combat as any armor, and protects you in any climate and even for a time in open space. It feels good to be back in it. Between the detour through the Camarov system and then the stop here you’ve been running around without it for an unusually long time.\n\nHinsman charges by with a load of power cables draped over one arm, then checks himself mid-stride and comes back over to you. “Zee, question.”\n\n“Yes?”\n\n“Do you think we should put Matti in cryo and send her out of here?”\n\n“You’re asking me?” You’re a little surprised. He hadn’t seemed to like hearing your opinions on Matti very much a little earlier.\n\n“Not that I’m giving much credence to your theory about her. I’m asking you now, just as a matter of risk assessment, how putting an injured and weakened woman in a cryo pod would stack up to having her stay here with a hostile force on the way.”\n\nYou pause a moment to run over both scenarios. The cryo is a significant risk, but a one time thing. The possibility of attack is an ever evolving situation with the threat level varying from not worth mentioning to all of you dead and the station destroyed. Plus, even with Hinsman telling you to disregard the thought, there’s the possibility Matti might not be trustworthy. You know already that he won’t include any of your suspicions in the note to the Camarovians and they won’t investigate nearly as thoroughly as the Order would even if he did. But guilty or innocent, the rest of you may soon have your hands too full to pay attention to her if you do get company.\n\nFinally you reply.", "action_results": [{"action": "\"It's better to send her back to Camarov.\"", "result": "Hinsman nods in agreement. “Probably for the best now that we’ve got a target painted on us. I’ll explain things to her this evening and get her in the pod first thing in the morning.”\n\n\n\nYou both drag piles of equipment about while Karoff diverts more power from the ship, as much as can be spared, and even sacrifices most of the shuttles. Before long the equipment is in place and the three of you begin rigging up cables, energy cells, power nodes and anything you can find that can produce or transfer a charge down each of the station’s splayed arms to the laser and torpedo turrets mounted at their tips.\n\nFinally, the heavily damaged medical wing is the last that needs attention. That’s all on you.\n\n“Think we can get by without that one?” Hinsman asks.\n\nKaroff shakes his head. “Without the turrets that’s a biiiig area where they can get in close and freely maneuver and we can’t touch them.”\n\n“Figured. All right then Zee, off you go. Just hook up these cables and don’t slip and go floating off into space, it’ll be a pain in the ass to collect you again. One of us will keep in voice contact while you’re there.”\n\n\nYou stand in the airlock, the minutes ticking by while you wait for the atmosphere to slowly equalize with that of the absent one in the medical wing. You know you’re getting close when you begin to float in place.\n\nOnce the door opens and you drift into the entrance to the medical wing, you search for the panel Karoff told you about. It’s about the only one here that hasn’t had its conduits fried, and you remove a connector you’ll need. That and the EPN loaded with an energy canister you have strapped to your back should be all you need to power the turrets. After checking in on your wrist comm you start to make your way on down to the hall.\n\nYou carry a cable as well, meant to be attached to your suit. If you were following safety recommendations, one of the two clips along the length should always be anchored to something. You’re not entirely sure you need it however. The sides of this section have blown out in some places but you can just avoid getting too near the edge of those gaps. Using the tethered cable is fine when working in one place, but tediously slow when trying to move.", "action_results": [{"action": "Follow safety regulations", "result": "You begin to make your way slowly, carefully along. There’s a bar that runs along the side of the hall that you use for your tether. You fall into a rhythm of attaching one clip, then the other, then unclipping the first, move forward and repeat. Every so often there’s a crackle from your headset as someone checks on you, but the dark halls are otherwise eerily silent. Doors line the walls on either side of you, firmly shutting away their secrets. One door is hanging open and askew on cracked hinges, and you see the long room beyond it is filled with rusting rows of bolted down bedframes. An infirmary at some time in the past, now with the back wall now ripped open to expose them to space. You can see the pale face of the barren rock the station orbits through the gap.\n\nYou drift down an elevator shaft and after a measured distance begin cutting your way out with a laser torch. Gripping the handrail behind you, you kick the slab of metal free. It tumbles forward, and forward, and out into space. Where you expected to find more hallway, you’re now looking at a mostly missing wall, the blown out section large enough to pilot a shuttle through. You’ve drifted out a short ways, watching the metal slab diminishing in the distance, still moving from the momentum of your kick.\n\nIt’s then that you glance down and realize there’s nothing beneath your feet but the void of space and the twinkling of stars. Most of the floor in this section has also been blown away. You pedal your legs in a panic and shoot upwards a short distance until you’re suddenly snapped back. Grabbing at a projecting metal ledge, you steady yourself, realizing that if you hadn’t clipped the tether to the elevator’s handrail out of habit you might be in trouble right now.\n\nBelow, you can just see the edges of other rooms on other floors parallel to this one; the section beneath you has been ripped out clear through to the bottom of the station. But thankfully you don’t have to try to float down through the big hole to reach the turret. Just, across it.", "action_results": [{"action": "Leap of Faith", "result": "Well, no sense in putting it off. You remind yourself that if her story is to be believed, poor, stupid, terrified Matti made this jump not once, but twice, and carrying Markov’s bloody body behind her the second time. Aiming yourself carefully in the direction you want to go, an airlock that leads to the last section of this wing, you use your legs to launch yourself towards it in a single smooth motion. On instinct you’ve angled your body into an aerodynamic shape, legs straight behind and arms stretched out in front of you, although you know it doesn’t really matter. As you sail across the gap, you stare downward into infinity. You feel like you’re flying. You feel like...a bird...\n\nGreen grass. The smell of it.\n\nA long blade of green grass, striped by the horizontal bars of sunlight and shadow cast by its fellows. An ant crawls up the blade, in and out of the stripes. Another ant tickles your arm.\n\nNew shadows race across the sun. There are silver wings in the distance, and a beautiful white light.\n\n“Look at the birds, Mommy!”\n\n“Zani, get inside!”\n\nThe fresh smell of grass is replaced by acrid smoke. Screams and shouts. Muffled explosions in the distance. You are underground, but not deep enough. Boots thud overhead. Your sister is crying. You want to cry too. Everyone is afraid, even the adults. Especially the adults.\n\n“The Order!”\n\n“Oh my God, they’re killing everyone!”\n\n“We’re not infected! Listen to us, please!”\n\n“Zani, Nyla, run to the woods!”\n\nYou’re running hard, pulling your sister behind you. There is another explosion, not so distant. The force hurls you hard against the ground. The grass is gone, the earth is a scorched and blackened wound. You and the earth are the same now. Where is Nyla? The pain is incredible. Blackness. You--\n\n--you stare down into the blackness. You hit the wall on the other side hard but somehow instinctively grabbed the metal bar next to the airlock. The metal will surely bend, if you squeeze it any harder. Your eyes sting. Your chest aches like its simultaneously been hollowed out and is just about to burst. Physically you’re fine. But from your memory--and you know now for certain that it was a memory--you know now that this is what it feels like to want to cry.\n\nNo tears stain your cheeks, of course. Your brain may be human, but most of the rest of you decidedly is not. Still, you feel weak, shaky, and can’t bring yourself to continue on for quite some time. Unless you deliberately keep your thoughts focused elsewhere, your mind drifts again and again to the memories.\n\n“The Order!”\n\n“Oh my God, they’re killing everyone!”\n\nThose two sentences in particular, shouted at a near hysterical pitch by a voice that seems hauntingly familiar plague you the most. You don’t like the implications.\n\nAt some point you realize your communicator has been going off. Hinsman’s voice is speaking to you, sounding worried.\n\nYou take a deep breath. “I’m fine.” Your words are faint, barely audible.\n\n“Are you sure, Zee?” He sounds skeptical.", "action_results": [{"action": "Tell him about the memories", "result": "“I...started hearing some things. But, it’s more like, remembering some things, really. And they’re not...good things.”\n\nA sigh. “The hallucinations again? How bad are th--”\n\n“They’re not hallucinations! They’re memories! Of my life, from before! Are you even listening?” The words spit from your lips. That hadn’t been your intention, but, it appeases something dark and angry inside of you to let them out.\n\nThere’s a long pause on the other end. When Hinsman next speaks his voice is calm and careful. “That’s right, I’m sorry Zee, you did say memories. You might be experiencing a few, but, if it’s anything like last time, they’re presenting themselves in a disruptive fashion and mixing in invented details from elsewhere. You can’t rely on them one hundred percent.”\n\n“Invented? You mean like the Order purging my family’s colony? Are you saying that’s all invented?” You’re still angry. Not just at the questions the memories made you ask, but at the entire situation and what you know it will eventually lead to. You need to pull yourself together, you know this. If nothing else, this is an astoundingly bad time and place to be having a crisis. But Hinsman’s got his most soothing voice on and it doesn’t really have its intended effect when you know exactly what he’s doing.\n\n“I don’t know, Zee. I’m sorry but I genuinely don’t know the situation prior to your original activation. And...if it helps, you don’t have to think of it as ‘you’, you know. You are a trusted and capable Order operative, with people who respect and value you. You’re simply built around the brain of someone long dead who may have had a tragedy befall them.”\n\n“A tragedy the Order caused.”\n\nHinsman sighs again. “Y’know, Zee, the human brain is a complicated thing. We still don’t entirely understand everything about it. You need to consider the way dreams take real information and memories, and transpose them with--”\n\n“All right, all right,” you cut him off. “Spare me your horseshit. I need to get this turret activated.” Now it’s your turn to sigh. “Anyway, I’m guessing we’ve probably had this conversation before?”\n\n“A couple of times. ‘Fraid so. Now take care of yourself and stay focused, Zee. We need you.”\n\n“Yeah.”", "action_results": [{"action": "Staying focused.", "result": "Yanking on the handle of the airlock door, you hear the locking mechanism disengage with a satisfying clank. Once inside, you seal it behind you again before proceeding. This last segment of the medical arm lost gravity and life support with the others, but was never exposed directly to space. It seems likely the actual origin of the sabotage was the area you were just in, with the chain of explosions moving from there in the direction of the central part of the station.\n\nThere is quite a bit of floating furniture and assorted medical equipment and other clutter to maneuver through, but thankfully there are no major obstacles or...other distractions between you and the turret. You power and arm it, checking the status of the torpedoes and ensuring everything seems to be in working order before giving the others a call. Karoff confirms the gun is online and you begin to make your way back.\n\nYou still are struggling a bit to keep your head clear, and begin reading the labels on the doors you pass and counting them too to keep your thoughts from wandering back to the that same place, the stripes of sunlight across the grass, again and again.\n\nWhat should be door number twenty-eight is open, and when you shine your light inside it falls upon a long white cabinet inside. Particularly, upon the smears of dried blood upon it, one of them a near perfect hand print.\n\n“He was trying to unlock a cabinet but his hands were all torn up.”\n\nYou recall Matti’s words from a few hours ago, although with far less clarity and immediacy that that of the woman who so long ago shouted for Zani and Nyla to run to the woods. Is this the room where Markov died?", "action_results": [{"action": "Stop awhile to investigate.", "result": "The cabinet seems the immediate point of interest. You shine your light across it. It’s bolted in place and so it hasn’t joined most of the rest of the furniture and assorted lab equipment in hovering against the middle of the far wall. You realize immediately it’s not really a cabinet at all, but a bank of freezer compartments. Oddly, it still has power. A bit of searching reveals where someone has wired in an EPN behind it. The blood smears are concentrated in one area, and you scrape it away from a combination lock it seems especially thick on.\n\nIt’s a pretty standard lock. The combination possibilities are four alphanumeric characters, and Markov’s bloodied hands had set it as far as INE-.\n\nYou click over the last letter to A and unsnap the lock. Glass vials hover against the top of the compartment. You reach in and gently sweep them out for a better look. Each are full of a frozen yellowish liquid. One of the vials is broken, empty. It’s got smears of red on it too.\n\nThe vials tumble out of the freezer at your touch and float in a loose cluster just above you. You tilt your head and read the label clearly printed on each one:\n\n\nHUNGER 1A-4", "action_results": [{"action": "Protocol", "result": "You return to the central complex, making sure not to stare into the abyss this time as you cross it.\n\n“I’m fine,” you say in answer to Hinsman’s look when you enter, brushing past him. You actually do feel more relaxed and confident now. No longer uncertain, because protocol is very clear. You just need to verify something on your own first. It’s bad to cause a panic. Protocol is clear on that too.\n\nExcept for the monitors in the main computer room turned command center, the station is once again dark. Somehow this environment seems to magnify the echo of footsteps. Peering around the curve of a corridor, you see another oasis of light washing against a wall; the nursing station where Matti is resting.\n\nYou busy yourself the next several hours, putting equipment away, helping Karoff calibrate this or that and then doing your own work while he and Hinsman are sleeping.\n\nEarly in the morning, printouts of the results on hand, you stride to the nursing station. Hinsman is there clearing away Matti’s breakfast tray. “If it’s not too much trouble, could I get a couple more pancakes?” you hear her ask as you enter. “I’m kind of hungry still, I guess because I’m recovering.”\n\nHe gives her a good natured smile and starts to reply, and you drill a smoking hole through her head with your laser pistol.\n\n“Zee, what the FUCK?” Hinsman bellows, grabbing for his own gun and pointing it at you with a disbelieving stare. “Drop your weapon. NOW!”\n\n“She was infected.”\n\n“What? There’s no way! You’re losing it, Zee.” He takes a deep breath. You notice the hand that holds the gun is shaking. “You just committed a murder. I don’t want to shoot you but I’m not going to tell you again. Drop your weapon. We’ll put you in stasis until someone can fix you.”\n\nYou continue in the same matter-of-fact voice. “Markov Carst was storing vials of the live virus in the medical wing. Maybe he even found them there--they could’ve been left behind when the station was originally abandoned. Around the time he sabotaged the station, he infected himself, probably accidentally. And then Oswen infected herself when she tried to rescue him. He was covered in bleeding wounds, and she cut herself too, remember?” You hold out the printouts. “I have proof. Last night I tested the bodies in the freezer, and her arm.”\n\nStill eying you distrustfully and not yet lowering his weapon, Hinsman steps forward to snatch the papers from your hand and moves away to skim the results.\n\n“Goddammit,” he finally sighs, sliding his gun back into the holster. He stands over Matti’s bed a long moment looking down at her, shoulders slumped and head bowed. After a long silence he sighs again and straightens. “Sometimes I hate this job.”\n\n“Believe me, that I understand.”\n\n“She died because she was too damn kind. None of us would’ve suited up and gone to try and rescue that piece of shit after he blew the power.” He turns to face you, then frowns. “Zee, you can put the gun down already. I believe you.”\n\n“Yes, I know, but there’s one more thing. You need to test yourself for the virus. Karoff too. I can’t let either of you leave this station or interact with anyone else until you do.”\n\nHinsman stares at you, and you can see true extent of the situation finally sinking in. “Goddammit,” he breathes out again, then speaks into his wristcomm. “Karoff, I need you to come to the nursing station. It’s urgent.”", "action_results": [{"action": "The Test", "result": "“Clean. Both of you.” You snap the computer shut and the tension in the room evaporates amid sighs of relief.\n\nKaroff lets out a whoop. “Oh thank God. I was too pretty to die!” He stands and makes for the door. “Now if you’ll excuse me, I’m getting the hell out of this plague room.”\n\nHinsman lingers a moment, pausing at the foot of Matti’s bed. You’ve draped a sheet over her and will take the body and bedding to be incinerated once he leaves. “Well we got lucky I guess. The one to pick her up when she was bleeding was the only one who couldn’t get infected. And somehow I didn’t catch anything treating her, or afterwards being near her almost constantly. She got damn unlucky though. And here I am the complete bastard while she was the sweet girl with her life ahead of her. I still can’t believe it turned out this way.” With a shake of his head he exits the room, not looking at you.\n\nYou know Hinsman understands as well as anyone possibly could that you were just doing what you had to, but you suspect it’ll be awhile before he can bring himself to ever actually like you again.\n\nAnd then the moment arrives. An alert from the computer indicates something just emerged from underspace. Ahead of you the walk of the two men turns into a mad sprint down the hall. The three of you gather in the command center and Karoff quickly locates the ship.\n\n“No affiliation and armed to the teeth. Yep, we got a pirate.”\n\nHinsman drains his faux coffee and sets the cup aside. “Just one? Shouldn’t be too hard to handle.”\n\n“Yeah, there’s...dammit! You jinxed us. Now there’s two, three...eight on approach. And they’re hard to track.”\n\n“Sensors didn’t pick them up?” you ask.\n\n“The first ship was a carrier. It’s how you disguise the size of your force if for instance, you think someone may have an alert set for anyone exiting underspace.”", "action_results": [{"action": "Activate the shields and turrets.", "result": "If Karoff can’t track the ships there could be one lining up a shot even now. You’d installed a few shortcuts on your console and wristcomm last night, preparing for the possibility you’d be working alone, and now tap a key. The lights in the command center dim briefly as outside the station the massive shield generators hum to life and the turrets ready themselves. Whatever they’d been expecting, anyone approaching will know the station has people inside ready to defend it now, and that you’d been expecting them.\n\n“They’re hailing us,” Karoff says.\n\n“Oh good, let me talk to them. Maybe they’re going to surrender.”\n\nKaroff smirks at the comment and patches the call through to the viewscreen. An older man with steel-grey hair and a scarred face looks down at Hinsman and says in a gravelly voice. “I see you have a ship locked into the bay. Whoever you are, I suggest you use it. We won’t stop you from leaving peacefully, but we’re taking this station and anyone who tries to stop us will most certainly be killed.”\n\nHinsman looks unimpressed. “On the contrary, I think it’s you folks who’d better turn around and leave. The Last Outpost is an Order station vital to maintaining peace in the Outer Rim, and if you fire upon it it’s an act of war. We will hunt you down. There won’t be a single airless, lifeless rock left out there you can hide under.”\n\nThe man smiles. “Well aren’t you a big talker. But have it your way. I tried to make this easy, but I’ve never been afraid of a little work to get what I want, and I’m going to enjoy killing you even more now.”\n\nThe transmission cuts off and the first barrage of missiles collides with the central complex, shaking the whole station.\n\nYou steady yourself against the doorframe. “They know this area is shielded. I’m surprised they don’t go for the turrets.”\n\n“Think those were just showoff shots to let us know they mean business,” Karoff tells you. “Look, they’re deploying into new positions now. Easier to keep track of at this range, anyway.”\n\n“Off to a good start. I don’t object at all to them wasting missiles,” Hinsman says with a shrug. “They’ll run out soon and then have to get within range of the turrets to use their lasers.”\n\nKaroff has been tapping feverishly at a console, and suddenly interrupts. “And there go a few of my own. Two can play the torpedo game.”\n\nCrowding around the screen, you watch as the missiles spin through the formation the ships had been gathering up into. There are a couple of glancing hits that take one ship out of commission and force others to veer this way and that. Two more are hit but their shields hold. Shields are almost always going to be weaker on a ship than on a station, but you suspect they’d all been angling themselves to protect the weaker ships in the center while they made their first sweep at the turrets.\n\nThe missiles that are evaded by the pirates were lined up so that they exploded against the shields of the larger carrier ship waiting behind them. Again, no significant damage done, but the big ship does start moving to get more distance from you, meaning it won’t be so readily available to provide backup to the pirates.\n\nYou take a moment to send a torpedo tearing through the disabled ship, then frown at the screen. “Here they come again.”\n\nThe seven remaining ships come in at an angle, then just out of range of what would be a practical distance to take a shot at them they split into two groups, circling the station from opposite sides. The ships launch a series of missiles at the turrets as they swoop by, and while the lasers are able to take most of them out before impact, one does slip through and blow a gun into pieces spinning off into space.\n\nThe three of you exchange grim looks. You know that with every gun that goes down they’ll have a growing safe area to maneuver in.\n\nA moment later the ships begin another sweep. They concentrate their fire at the arms surrounding the one with the turret they cleared. Karoff takes another one out with a well timed missile that hits at the moment they drop their own, but two more turrets are taken out regardless. As you watch, a smaller ship moves in, aiming for the now unprotected arm housing the medical wing. It takes you a moment, but you come to a sudden realization. “They’re trying to board it!” you say, remembering the massive gap open to space there.\n\n“We can stop them, surely?” Hinsman asks.\n\nKaroff shakes his head. “At that angle, can’t really...wait! My ship! I’ve got a dozen torpedoes loaded still.”\n\n“You transfered so much of the power over, though. It won’t even have shielding. Let’s stay on the station and just take up positions near the entrance to that section, pick them off when they come through.”\n\n“We don’t even know how many they have, and we don’t have anything more powerful than a laser rifle. I really don’t like leaving the rest of the ships free to do whatever while we’re over there either.”\n\nYou’re all running out of time fast. They really can’t stand there arguing much longer. The situation being what it is, you decide to take the lead for once and just let them follow.", "action_results": [{"action": "Use Karoff's ship to take them out before they board.", "result": "“Twelve torpedoes? Then stay here. I’ll stop the boarders.” Before anyone can reply you race down the hall and towards the docking bay.\n\n“Careful with my ship!” you hear Karoff hollering after you.\n\nYou strap in an unlock in record time, gliding along the side of the docking bay arm opposite the one housing the medical wing, trying not to expose the profile of your ship to the enemy. Then when you’re lined up with the damaged section, you drop down just a short ways and rotate to get a clear view straight across to wear the smaller ship is hovering within the massive hole gouged from the medical wing.\n\nTheir back hatch is open, and someone in a bulky suit is in the process of exiting. Caught with their shields down? Your timing couldn’t be better. With a press of a button you send a fusion torpedo smashing into the exposed ship. The explosion rips right through it, and you wince a bit as it also engulfs the less damaged section of the medical wing beyond, reducing that entire tip of the arm into half-melted wreckage.\n\nBut, well, it was pretty messed up already. Maybe no one would notice.\n\n“Hey, great plan Zee, let’s just take out an arm for every ship. There were eight of both so now we’ll be even!”\n\nKaroff’s voice is joined by Hinsman’s. “Laugh all you want, but it looks like their buddies are retreating. You must’ve gotten someone important. Good work, Zee.”\n\n“Then that went better than I hoped,” you mutter to yourself, but move quickly to relock the ship to the docking bay. No sense in lingering out here without shields. Bad things can happen--just ask the other ship.\n\nRejoining the others, you see that indeed, the pirate ships are locking back into the carrier.\n\n“Could be a trick,” you point out.\n\nThe carrier slips into underspace a few moments later however, and after a short wait it becomes clear they’d have had to emerge by now if they were trying any funny business with blinking around inside the system.\n\nHinsman slaps you on the back. “Well that was a damn good shot, Zee. You might’ve got the captain.” He yawns and turns toward the door. “", "action_results": [{"action": "Aftermath", "result": "The Last Outpost is awash with light and humming with power and activity. Repair crews tromp through the halls day and night and from the newly cleaned and restocked dining area there’s friendly chatter, the clattering of plates, and laughter at the antics of some performer on the screen. It’s practically unrecognizable from the place the three of you fought for only a couple of weeks ago.\n\nAfter an unprecedented two weeks with no new orders, which you know Hinsman and Karoff haven’t minded at all, you’re sitting at the dining hall listening to them trade stories. Taking tiny sips from a glass of water, the closest you can get to having a meal with your friends, you notice three stern-looking people in uniform enter the room, two men and a woman. Their gaze falls on your table and they make a beeline for it. You nudge Hinsman, assuming something’s come up. “Another mission, you think? It’s been awhile.”\n\nHe clears his throat, looking uncomfortable. “I think they’re here in response to my report.”\n\n“What do you mean?”\n\nKaroff has become very engrossed in the contents of his glass, and that’s when you realize the officers are here for you.\n\nThey reach the table and introduce themselves to the other two, politely enough. And then, “Is this the android?”\n\nHinsman nods, not meeting your gaze.\n\n“What’s going on?” you ask. Although you believe you already know. You’ve been working on techniques to keep your memories, and the tantalizing fragments of new and sometimes even what seem to be conflicting ones from overwhelming you so suddenly and completely, but they’ve certainly not gone away.\n\n“You go by Zee, right? We’re going to need you to come with us.”\n\nHinsman finally speaks up, “They’re just here to help you out, Zee. You’re going to get some treatment so that those...memories, dreams, whatever they are can’t interfere with your work.”\n\n“I’ve...been working on that myself,” you tell him, almost pleadingly. “I can keep them under control.” You don’t know why you bother, honestly. The only thing he could have done to prevent this was not put it in his report, and it’s too late for that now.\n\n“The way they come on, it’s dangerous you know, and they always get worse. It’s not your fault of course, it’s just something that happens with your kind of android. A side effect of using an organic brain. I’ve done a lot of reading on it,” he goes on. “It’s not a big deal, and it’s easy to fix. You’ve had it done before.” As familiar as you are with the way he works, this sounds suspiciously like a memorized speech.\n\nIn the end though, there’s nothing you can do. The officers repeat their request, and however you feel, you can’t find it in you to openly defy an order. And Hinsman’s right; this has all happened before.\n\nHe and Karoff accompany you to the waiting shuttle. As you say your goodbyes and take a last look around the now bustling station, you wonder if you’ll remember any of this by the time they’re done with you.", "action_results": []}]}, {"action": "\"We don't need to stop them.\"", "result": "“They’re not coming here. They’re looking for the vials,” you reassure them. “And they won’t find them.” The first thing you’d done after finding Markov’s stash, before you’d done anything else, was melt every single vial along with its contents down to nothing with your laser torch. “Oh, and assuming they know exactly where to look, I left a little surprise for them.”\n\nThe lab had been full of all kinds of interesting chemicals, and the three of you aren’t waiting too long before the sensors trained on the medical wing register a sizable explosion. A moment later, the ship that carried them is careening away, clumsily enough that a laser turret can slice it in half before the shields have a change to reactivate.\n\n“Beautiful.” Karoff grins, then squints at the screen. “And I think...yes, looks like the others may be retreating. Or moving back toward the carrier, anyhow. You musta got somebody important. That grumpy old bastard from the viewscreen, I hope.”\n\nWell done, Zee.” Hinsman slaps you on the back. “Damn, will there be enough left in medical to scrape up some DNA, I wonder? There’s gonna be a hell of a manhunt on once we transmit this battle report. Hope none of you were planning a vacation.”", "action_results": [null]}]}, {"action": "Wait until they're closer.", "result": "Patience is everything out here. You all lapse into a tense silence as you watch the sweeping scans. The ships are visible on the sensors for only a fraction of a second at a time. They move erratically as they approach in a way that would be difficult to target, then seem to gain confidence and split into two groups, angling to sweep by each side of the station.\n\nYou’d installed a few shortcuts on your console and wristcomm last night, preparing for the possibility you’d be working alone, and as they come into range you now tap a key. The lights in the command center dim briefly as outside the station the massive shield generators hum to life. The turrets ready themselves and immediately begin spitting fire. To one of the groups the attack is devastating, leaving two of the ships smoldering wreckage and disabling a third. The four on the other side of the station take minor damage and one loses shields and has to retreat back towards the carrier.\n\nKaroff hasn’t been idle either, and once he saw you go into action he sent a barrage of missiles toward the carrier itself, which make contact a couple of moments later. They don’t pierce the shields, but apparently are enough of a bother that the big ship begins to move off further out of range, meaning it can’t provide backup to the rest of the pirates, even the unshielded one limping towards it.\n\n“Nice work, everyone. And I guess I’ll take janitor duty,” Hinsman says, firing another pair of torpedoes. One blows the disabled ship to shrapnel and another zips across the distance to take out the shield-less one.\n\nThe remaining three pull out of range. They continue to make slow circles around the station for a bit, launching a few torpedoes of their own, two exploding harmlessly against the shield of the central complex and the third doing some damage to one of the unshielded arms, but missing the turret. When Karoff manages to strike a glancing blow off of one of them with his return fire they seem to think better of lingering and retreat to the carrier. It jumps to underspace, and after a few seconds it’s clear they’re not trying any risky tricks with jumping closer to the station, while your sensor sweeps continue to not report them emerging anywhere else in the system.\n\nBattles in space tend to be that way. Hours of tense preparation and waiting, decided by a few seconds of actual weapon’s exchange. If one of the pirate ships had managed to get in close enough to line up a shot before you activated the shields, this all could’ve gone very differently.\n\n“As soon as we can get this data to the Order, there’s gonna be a hell of a hunt going on for the ones who got away,” Hinsman says later, while compiling the battle report and the information on the infection aboard the station. “Hope no one was planning a vacation.”\n\n“Eh, scouring a bunch of backwater planets for terrorists won’t be that bad,” Karoff replies with a shrug. “I just don’t envy whoever’s gonna be searching and sanitizing every centimeter of this station. So sorry about that, Zee.”\n\nYou can tell he’s joking for once, and just shake your head. “Nope, not me. Never been gladder they gave me a gun instead of a mop.”", "action_results": [null]}]}]}]}, {"action": "You don't care about any of this anymore.", "result": "Sorrow, anger, and pain still thunder just beyond the edge of your conscious thought. In your eyes, the major failing of the saboteur now was in not blowing this entire station to cosmic dust and sparing you from this brink of madness. You were content in your role before, happy to tirelessly devote yourself to the Order’s interests, and now? You no longer care about what was done here or why. Let someone else figure that out, or not. What difference does it make?\n\nYou return to the central complex, making sure not to stare into the abyss this time as you cross it.\n\n“I’m fine,” you say in answer to Hinsman’s look when you enter, brushing past him. Except for the monitors in the main computer room turned command center, the station is once again dark. Somehow this environment seems to magnify the echo of footsteps. Peering around the curve of a corridor, you see another oasis of light washing against a wall; the nursing station where Matti is resting.\n\nYou busy yourself the next several hours, putting equipment away, helping Karoff calibrate this or that and keeping watch while he and Hinsman sleep. In the end the power situation means the three of you will only able to get partial shielding up around the non vital sections, which are essentially everything but the docking bay and central complex. Hopefully that will be enough.\n\nHinsman has already seen to Matti and he and Karoff are having a quick breakfast and complaining about the coffee substitute when the moment arrives. An alert from the computer indicates something just emerged from underspace. The three of you gather in the command center and Karoff quickly locates the ship.\n\n“No affiliation and armed to the teeth. Yep, we got a pirate.”\n\nHinsman drains his faux coffee and sets the cup aside. “Just one? Shouldn’t be too hard to handle.”\n\n“Yeah, there’s...dammit! You jinxed us. Now there’s two, three...eight on approach. And they’re hard to track.”\n\n“Sensors didn’t pick them up?” you ask.\n\n“The first ship was a carrier. It’s how you disguise the size of your force if for instance, you think someone may have an alert set for anyone exiting underspace.”", "action_results": [null, null]}]}]}, {"action": "You're fine.", "result": "“Y-yeah, I just...had some trouble getting across this section with the worst of the damage. It’s bigger than it looked on the images we had. I’m fine now though, just had a close call.”\n\n“All right, well glad you’re all right, and be careful, Zee.”\n\n“Right. I’ll be at the turret soon.”\n\nYou cut the call and take a deep breath, telling yourself you’ve got to pull yourself together. This is an astoundingly bad place and time to be having a crisis. You’re unsure if that was your entire motivation in not telling Hinsman the truth, but you know you need to focus on getting the defenses up now. The memories, and the painful questions they’ve made you ask...you’ll dwell on that later when there’s no danger of attack.\n\nMeanwhile you’ll just hope that they don’t return, or at least not with such force that you can’t function. You need to stay focused.", "action_results": [null]}]}]}, {"action": "No time for that.", "result": "You drift down the dark hallway, propelling yourself forward in short bursts with the flat of your palm along the wall or the ceiling as you go.\n\nEvery so often there’s a crackle from your headset as someone checks on you, but the dark halls are otherwise eerily silent. Doors line the walls on either side of you, firmly shutting away their secrets. One door is hanging open and askew on cracked hinges, and you see the long room beyond it is filled with rusting rows of bolted down bedframes. An infirmary at some time in the past, now with the back wall now ripped open to expose them to space. You can see the pale face of the barren rock the station orbits through the gap.\n\nYou float down an elevator shaft and after a measured distance begin cutting your way out with a laser torch. Gripping the handrail behind you, you kick the slab of metal free. It tumbles forward, and forward, and out into space. Where you expected to find more hallway, you’re now looking at a mostly missing wall, the blown out section large enough to pilot a shuttle through. You’ve drifted out a short ways, watching the metal slab diminishing in the distance, still moving from the momentum of your kick.\n\nIt’s then that you glance down and realize there’s nothing beneath your feet but the void of space and the twinkling of stars. Most of the floor in this section has also been blown away. You pedal your legs in a panic and the motion sends your body shooting upwards. Struggling to reorient yourself in mid-air, you crack your elbow against a piece of metal railing and grab for it desperately.\n\nYou’re caught up now against a section of what used to be the roof, amid a forest of twisted metal spars and snaking black wires. You remain carefully still a long moment while you calm yourself, your back resting lightly against the jagged mess while you gaze down at the floor. It’s been ripped out clear through to the bottom of the station. You can just see the edges other rooms on other floors parallel to this one, and where the plating that held on the other side of the gap buckled like crumpled tissue, but thankfully you don’t have to try to float down through the big hole to reach the turret. Just, across it.", "action_results": [null]}]}, {"action": "\"Everything will be fine here once the defenses are up.\"", "result": "Hinsman hesitates. “I just worry something may happen to her. She’s so weak still, she needs care we may not be able to give depending on how things go.”\n\n“Pirates are a risk at any time, and this station was designed to be defended by only three people,” you point out.\n\nHe nods after a moment and flashes you a smile. “You know, you’re right. Thanks Zee. But I guess we better gets to work now before Karoff finds us just standing around talking.”\n\n\n\nYou both drag piles of equipment about while Karoff diverts more power from the ship, as much as can be spared, and even sacrifices most of the shuttles. Before long the equipment is in place and the three of you begin rigging up cables, energy cells, power nodes and anything you can find that can produce or transfer a charge down each of the station’s splayed arms to the laser and torpedo turrets mounted at their tips.\n\nFinally, the heavily damaged medical wing is the last that needs attention. That’s all on you.\n\n“Think we can get by without that one?” Hinsman asks.\n\nKaroff shakes his head. “Without the turrets that’s a biiiig area where they can get in close and freely maneuver and we can’t touch them.”\n\n“Figured. All right then Zee, off you go. Just hook up these cables and don’t slip and go floating off into space, it’ll be a pain in the ass to collect you again. One of us will keep in voice contact while you’re there.”\n\n\nYou stand in the airlock, the minutes ticking by while you wait for the atmosphere to slowly equalize with that of the absent one in the medical wing. You know you’re getting close when you begin to float in place.\n\nOnce the door opens and you drift into the entrance to the medical wing, you search for the panel Karoff told you about. It’s about the only one here that hasn’t had its conduits fried, and you remove a connector you’ll need. That and the EPN loaded with an energy canister you have strapped to your back should be all you need to power the turrets. After checking in on your wrist comm you start to make your way on down to the hall.\n\nYou carry a cable as well, meant to be attached to your suit. If you were following safety recommendations, one of the two clips along the length should always be anchored to something. You’re not entirely sure you need it however. The sides of this section have blown out in some places but you can just avoid getting too near the edge of those gaps. Using the tethered cable is fine when working in one place, but tediously slow when trying to move.", "action_results": [null, null]}]}]}]}, {"action": "Repair defenses", "result": "Hinsman and Karoff have already ripped out most of the EPNs that were so recently installed by the time you finish suiting up. Your sleek one piece outfit is in the Order colors of dark blue and grey, and more than just a uniform. With the addition of your helmet with its built in breathing mask it serves as well in combat as any armor, and protects you in any climate and even for a time in open space. It feels good to be back in it. Between the detour through the Camarov system and then the stop here you’ve been running around without it for an unusually long time.\n\nHinsman charges by with a load of power cables draped over one arm, and you have to jog after him a short ways to get his attention and instructions.", "action_results": [{"action": "Get to work!", "result": "You both drag piles of equipment about while Karoff diverts more power from the ship, as much as can be spared, and even sacrifices most of the shuttles. Before long the equipment is in place and the three of you begin rigging up cables, energy cells, power nodes and anything you can find that can produce or transfer a charge down each of the station’s splayed arms to the laser and torpedo turrets mounted at their tips.\n\nFinally, the heavily damaged medical wing is the last that needs attention. That’s all on you.\n\n“Think we can get by without that one?” Hinsman asks.\n\nKaroff shakes his head. “Without the turrets that’s a biiiig area where they can get in close and freely maneuver and we can’t touch them.”\n\n“Figured. All right then Zee, off you go. Just hook up these cables and don’t slip and go floating off into space, it’ll be a pain in the ass to collect you again. One of us will keep in voice contact while you’re there.”\n\n\nYou stand in the airlock, the minutes ticking by while you wait for the atmosphere to slowly equalize with that of the absent one in the medical wing. You know you’re getting close when you begin to float in place.\n\nOnce the door opens and you drift into the entrance to the medical wing, you search for the panel Karoff told you about. It’s about the only one here that hasn’t had its conduits fried, and you remove a connector you’ll need. That and the EPN loaded with an energy canister you have strapped to your back should be all you need to power the turrets. After checking in on your wrist comm you start to make your way on down to the hall.\n\nYou carry a cable as well, meant to be attached to your suit. If you were following safety recommendations, one of the two clips along the length should always be anchored to something. You’re not entirely sure you need it however. The sides of this section have blown out in some places but you can just avoid getting too near the edge of those gaps. Using the tethered cable is fine when working in one place, but tediously slow when trying to move.", "action_results": [null, null]}]}]}]}]}, {"action": "“Markov killed Inea and then went insane.”", "result": "“Why look farther than Occam's Razor on this? It's the simplest explanation,” you say. “Carst, his actions may have been...drastic, and there may be no logical explanation for his destruction of Order property, but before the station sabotage everything points to him murdering Banca.”\n\n“I think so too,” Hinsman says, “but we don't have any details at all on what happened to her. Certainly no evidence.”\n\n“That he would feel compelled to return to the medical arm where she died is a good indicator that he was emotionally compromised. If his goal had simply been to destroy the station he would've started in the central computer room. And who else could've killed Banca? Oswen?”\n\n“Well that was my original theory...” Karoff muses, stroking one end of his mustache.\n\n“You read the personnel files too,” you point out, cutting him off. “Matti Oswen is considerably shorter and lighter than Inea Banca was. It would take a lot to swing a canister at the back of Banca's head at that height, with that force. Furthermore, the damage was on the back of the left side of the skull. A right-handed person standing behind her would've struck the right side. And meanwhile there's only one left-handed person on this ship.”\n\nHinsman's eyes light up. “Markov Carst.”\n\n“Damn, I was hoping it was the girl,” Karoff complains.\n\n“What? Why?”\n\nThe pilot shrugs. “No reason really, I just like being right completely by accident.”\n\n“Anyhow, great job Zee,” Hinsman says, choosing not to respond to that. “But I just wish we had more evidence. It's really too damn bad we can't get at anything in the medical wing. At least one murder occurred and serious damage was done to a vital Order refueling station; everyone in HQ is going to be looking hard at this, and you know how they can sometimes be a little...overzealous. I don't want them demanding a bunch of answers from Matti that she can't give. The poor girl's already been through enough.”\n\n“Well...we can check for the report,” Karoff says. “The one on Banca. Maybe it wasn't ever finalized and sent but it has to exist if Oswen said they wrote it.”\n\nHinsman nods. “All right, let's do that.”", "action_results": [null]}, {"action": "“There’s something more going on...”", "result": "“I found Carst's personal computer in his room about an hour ago. It was well hidden, and he'd been using it to send and receive coded messages to someone outside the Order network.”\n\n“Really? Shit.” Hinsman sighs, running his fingers through his dark hair. “Now we've got that to figure out.”\n\n“Who would have a satellite out here aside from the Order?” you ask.\n\n“Traders, miners, colonists, pirates...?” Karoff ticks the list of anyone you might expect to encounter past the edge of the frontier off on his fingers.\n\nHinsman has a thoughtful frown. “Seems like it'd have to be pirates. Anyone else would have it registered so we could protect it. They'd have to be pretty organized, though. Damn, I don't like this at all.”\n\n“Oh, but what if it’s aliens!”\n\nYou and Hinsman both give him a look. Hinsman sounds a little exasperated. “Enough joking around.”\n\n“Whatever secret Carst had, Inea must've found out. Maybe something happened between them in the medical wing...he might've killed her on the spot, given the caveman tactics used,” you say.\n\n“The sabotage, though?”\n\n“Lots of people have it out for the Order. Maybe treason was always the plan and being found out screwed it up somehow. We need to find out what those messages said.” This last you direct at Karoff.\n\nHe explains to Hinsman. “I plugged them into the main computer when Zee brought it to me. Give it a bit more time, it should be able to crack the code.”\n\n“Let's go there then. Should shed some light on matters. And Kar, you can run a search for the report on Inea's death while we wait. I know we don't have a record of it but Matti said they wrote it, it's possible it was just never finalized and sent. I'd really love to see what load of crap Markov was planning to feed HQ.”", "action_results": [null]}]}]}]}]}, {"action": "You don't care what kind of weird porn he was hiding", "result": "You return to where you left the hover platform and then begin making your way back to see if there’s anything else you can help with. You can see Karoff has been busy here fiddling with the wiring, and indeed you’re only halfway back to the medical station when you the lights suddenly flicker on and a much-missed humming fills the halls as all systems come to life. Karoff’s triumphant voice sounds over the intercom, and a moment later Hinsman’s to congratulate him. Everyone seems to be much more cheerful and you’re relieved to see things returning to normalcy.\n\nThe main computer room he’s working in now is quite close so you take a detour to see if he’s pulled up anything about the damage to the station.", "action_results": [{"action": "Damage Report", "result": "“Ah, I see. No ‘thanks for getting the computers up so quickly’ or even ‘great job, Karoff’. Just more demands.”\n\nStartled, you begin to apologize before he waves you off. “Calm down, I’m not serious.”\n\n“Sorry.”\n\n“Jesus. You really need to work on not taking every little thing so seriously.”\n\n“That’s...not a skill I need very often, though.”\n\n“Good point. Well all right, you wanted the damage report. It just finished compiling.” Karoff spins in his chair to face the screen, chewing on a dirty thumbnail. “Hmm, let’s see. This would indicate The Last Outpost is...yup, it’s damaged all right. And needs repairs. From people who are not us.”\n\n“So nothing immediate needs attending to? There’s nothing wrong that would put you or Hinsman in danger if you waited here a few days?”\n\n“Well, unsealing some of the station’s arms would be pretty fatal. They took the brunt of Matti’s hack rerouting job and a couple lost atmosphere. The old medical wing itself is in real bad shape obviously, that’s where Markov set off the first explosion. But all we really need is life support and power here and in the docking bay. We don’t really have enough power for the rest of the station anyway as long as we’re siphoning from the ship. I’ll go and seal anything unnecessary off in a bit and then we don’t even need to worry about leaving them with life support.”\n\nGood. That means you can leave here and continue carrying out your orders just as soon as this mess with the dead workers is sorted out.\n\n“By the way, Hinsman is going to try waking Oswen up for a little while and then wanted us there afterwards to sort of put our heads together on how to handle all this,” Karoff adds, nearly reading your mind.\n\nYou step toward the door. “I’ll go now.”\n\n“Eh, what’s the rush? But I’ll be there after I finish a couple things. We’re all just gonna sit around till the relief team arrives either way.”\n\n“I could go and take care of my mission while the two of you wait. Hinsman suggested that earlier, remember?”\n\nKaroff snorts and shook his head slowly as he turns his attention back to his screen. “Don’t you ever get tired of working so hard?”\n\nYou’re a little take aback by the question. “No?”", "action_results": [null]}]}]}, {"action": "Alert the others to an intruder", "result": "You step back against a wall to have a clear view of anyone coming or going from any direction, and speak in hushed tones into your wrist comm to alert the others of the situation.\n\nIn moments Hinsman and Karoff have armed themselves and joined you. With Karoff taking up watch outside the hall, you and Hinsman methodically check each door. None are locked due to the power situation and all seem to be crew quarters, only three showing any signs of being lived in recently.\n\nFinding nothing, the three of you expand the search to the surrounding area until after half an hour you have to admit there really may be nothing to find.\n\n“I’ve got to go check on Oswen,” Hinsman finally says. He gives you a little swat on the back of the head. “Zee, you’re going bonkers again. Need to schedule you another trip to the doctor when we’re done out here, eh?” His tone is light and playful, but you don’t miss the worried glances he and Karoff exchanged.\n\nAlthough you don’t remember much about it, it’s true you’ve had...hallucinations in the past. Or whatever the technical term would be for you. They have to get pretty bad before they impair your ability to work, but the woman’s voice had seemed so close and chillingly real. You’re ashamed you dragged the others over here, and after an awkward apology you move to assist Karoff with the remaining power nodes, aware of him still giving you quick glances now and then when he thinks you’re not paying attention.\n\nAfter awhile he disappears, and then the lights suddenly flicker on and a low, much-missed humming fills the halls as all systems come to life. Karoff’s triumphant voice sounds over the intercom, and a moment later Hinsman’s to congratulate him. Everyone seems to be much more cheerful and you’re relieved it seems things will go back to normal now.\n\nThe main computer room he’s working in now is quite close so you take a detour to see if he’s pulled up anything about the damage to the station.", "action_results": [null]}]}]}]}, {"action": "Find a mop and bucket", "result": "The door here opens to one of the storage arms of the station. It seems as likely a place as any to find cleaning supplies and so you slip through the door, carefully stepping over the severed limb and making your way down the dimly lit hall. It becomes obvious this is more of an area for discarded equipment waiting for repair or recycling and you pass numerous discarded fuel and energy tanks as well as other assorted clutter before you come to a cleaning machine parked in an alcove. The energy cell is low but even if it only does the job halfway it’ll save you a lot of time.\n\nAs you’re pulling it free, there’s a clatter of metal and you see an energy canister was wedged behind it and is now rolling across the floor.", "action_results": [{"action": "Pick it up", "result": "Like the others this canister is spent, cool to the touch and quite heavy. It’s similar in size to a fire extinguisher, and since the larger energy cells can be volatile the shell is made with half an inch of steel and interior enamel coating for protection. What gets your attention about this one however is the dried blood and long strands of dark hair caught up on the outside of the sealing mechanism.\n\nThat’s...unusual, and worth keeping in mind.\n\nYou don’t want to disturb the others just yet since you doubt they’ve finished treating Matti Oswen, so you set the canister aside and leave the storage area, activating the cleaning machine to let the bristles and bubbles go to work on the drying blood while your mind rolls over just what may have happened here. Two maintenance workers dead and another seriously injured in circumstances that were odd to say the least. Just why had Matti been in such a hurry to close that door that she lost an arm over it? She hadn’t struck you as an especially self motivated type the few minutes you’d seen her on the viewscreen.", "action_results": [null]}, {"action": "Go finish cleaning", "result": "This section of the station is literally a junk heap. You roll the machine past the clutter without giving the canister a second thought and then climb on and activate it, cleaning bristles and bubbles going to work on the drying blood.\n\nMatti’s arm you toss into a non-functioning incinerator and hope the power situation is sorted out before it gets a chance to rot.\n\nThe cleaning machine holds out after all. You finish just as it dies and shove it into an out of the way corner before going to seek out the others.", "action_results": [null]}]}]}]}]}