{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=6823", "context": "", "first_story_block": "You are sitting in the pilot's chair of the starship Andromeda, on the edge of the Protherus star system, getting ready to make a Light Space Jump to your freighter's next destination. You hear a sound, like someone gasping in surprise, and look up from your console. Your co-pilot, Karl, is looking intently at his console, and doesn't seem to have heard anything unusual. You must have imagined the sound, for you and Karl are the only two people aboard this starship.\n\n\"Jump calculations are complete,\" Karl says to you, sitting in the co-pilots seat beside yours.\n\nBefore you, the transparent plasglass windows of the cockpit provide a view of the stars. Space stretches on infinitely before you. Directly in the middle of your foreward view, a star shines brighter than the others - it is your destination, the closest star to the star system you are currently in.\n\n\"Preparing to Jump to Light Space,\" you say, mentally going through your pre-jump checklist, as you press buttons and flick switches to the correct settings. You feel the ship beginning to vibrate as the interstellar propulsion system powers up, ready to activate.\n\n\"Activating LSJD,\" you say, pressing the final button. There is the usual flash of white light, and...", "action_results": [{"action": "Not Quite Right", "result": "You are sitting in your pilot's chair, in the cockpit of the Andromeda, and something is not quite right. Outside the windows, the darkness of space is gone, there is only light. You raise your arm to cover your eyes, but as you do, the light pales. Instead of searing your eyes like a thousand suns, the endless expanse of white outside the windows gives off a soft light, like looking at a white plaster wall that someone is shining a torch on.\n\nAs your eyes adjust to this strange phenomena, you hear a gasping, gurgling sound from behind you. Glancing to one side, you see the strangest thing. The right hand half of the cockpit is stretched out before and behind you. Your co-pilot, his chair and console, are now lines and blobs of horizontal colour, stretching through the room in streaks, like a motion-blurred, time-lapse photograph!\n\nYour head goes dizzy as your eyes and brain try to make sense of what it is you are seeing, then suddenly the strange warping of space stops, and the entire cockpit looks normal and whole once more. However, your co-pilot, his body restored to its correct physical form, sags forward in his chair, held up by his chest-crossing seatbelt buckle. Blood trickles from the corners of his mouth as his head drops forward, staring sightlessly down at his console.\n\nOutside the ship, the pale light - the endless expanse of whiteness instead of the blackness of space - tells you that something is horribly wrong here.", "action_results": [{"action": "Examine Karl's body.", "result": "You move from your console, over to beside your co-pilot. You lift up his head so you can look in his eyes. His head, fully illuminated by the pale light shining in through the windows, stares back at you, seeing nothing. You release him, letting his head drop back down again.\n\nLooking at his jumpsuit, you examine the body-monitoring device built into the suit. The device is supposed to monitor life signs, as well as the surrounding environment, and it tells you that his heart has stopped. Karl is clearly dead.", "action_results": [{"action": "Bring up a ship damage report on your console, and try to find out what is wrong with the ship.", "result": "Sitting in your chair, you bring up the ship status display, and look for signs of damage. For a moment you just look at the screen, unable to believe what it is saying. According to the screen, nothing exists behind the ship's cockpit. The rest of the ship is simply gone... vanished... non-existant!\n\n'How can that be?' you think to yourself. After all, the power generators at the rear of the ship must exist, because all the computer systems and life support within the cockpit is functioning just as it always does. The rest of the ship MUST exist!\n\nFrustrated, you turn off the status display.", "action_results": [{"action": "Check the ship's sensors, and see what it can detect.", "result": "You look at the ship's sensor screen. It shows your ship in the middle of the screen, but shows no signs of planets or stars in the vicinity. In fact, it shows nothing at all, in any direction. You look out the window again, at the vast expanse of whiteness that seems to stretch out endlessly in every direction. There's nothing out there but pale, white light.\n\nWhat is this place? Is this Light Space, the other dimension, that ships pass through when they jump? Did your ship somehow become stuck in this dimension, half-way through the jump procedure? If so, how are you supposed to get out?", "action_results": [{"action": "Open the cockpit door, and look into the central passageway.", "result": "Feeling a little uncertain as to what you might find, you nervously walk to the rear of the cockpit, and press the door release button. The rear door slides open and...\n\nThe central passageway that runs from the cockpit, through the ship, to the cargo bay at the rear, looks exactly as it always does. Lights in the ceiling illuminate the steel passage. Metal grating panels on the floor allow access to various wires and cables that run through the ship, beneath your feet. Door hatches are set into the passage walls at different points along its length, leading to various rooms aboard the ship. Far at the other end, you see a large hatch, that opens into the cargo bay at the other end of the starship.\n\nEverything looks completely - suddenly there is a shearing of light and form, as a section of wall about half way down the passage blurs outwards into the passage, in an array of colourful streaking lines - then suddenly flattens out again to look like a normal section of wall once more. Perhaps things aren't as completely normal as they seem...\n\nYou say a short prayer that the motion blurring phenomena won't happen anywhere near you.", "action_results": [{"action": "Start walking down the passageway.", "result": "You step out of the cockpit and into the passageway. As you move through the doorway, you feel a strange sensation, like stepping through a thin wall of water.", "action_results": [{"action": "Turn around.", "result": "Having felt like you stepped through an invisible wall, you turn around to look at the doorway you just came through. The doorway looks as empty as before, the air is clear and invisible as always. However, looking back through the doorway into the cockpit, you can't help but gasp.\n\nOutside the cockpit windows, you see space! Black space! Dotted with stars! You're back in normal space again! In fact... it would seem the ship is exactly where it was before it tried to jump - as you can see the single bright star in the middle of the window, the star you were going to jump to. Then you gasp again, blinking your eyes to be sure you can believe what you are seeing - for there are two people in the cockpit!\n\nOn the right sits Karl, your co-pilot, running jump calculations through the computer, and on the left is... it's you! You are in there, sitting in the pilot's chair, preparing the ship for jump! How is that possible?", "action_results": [{"action": "Rush back into the cockpit!", "result": "As you rush through the doorway, out of the passageway, and back into the cockpit, you feel the strange sensation again, the slight pressure against your body, as if you are passing through a thin wall of water. As your face passes through, the scene before your eyes changes!\n\nKarl's body lies dead in his chair, as you had left him, and your chair is empty again. Outside the windows is the shining expanse of pale, white light. What the heck is happening on your ship? It's almost as if... Yes, it's as if the cockpit and the passageway existed in two different places... Or rather, two different times!\n\nThe passage outside the cockpit was somehow before the jump took place, and here in the cockpit is somehow at the current time frame... Actually, you would only be guessing that you were in the current time frame - how would you even know what was the past. For all you know, the cockpit could be somewhere in the distant future, or - or who knows what?", "action_results": [{"action": "Start walking down the passageway, again.", "result": "You step out of the cockpit and into the passageway. As you move through the doorway, you feel a strange sensation, like stepping through a thin wall of water....", "action_results": [{"action": "Turn around, again.", "result": "Having felt like you stepped through an invisible wall, you turn around to look at the doorway you just came through. This time, you are prepared for what you see - outside the cockpit windows, you see space again, and both Karl and yourself are sitting in the cockpit chairs. You feel certain that if you tried to step into that cockpit, you would end up back in your version of the cockpit, surrounded by white space.", "action_results": [{"action": "Continue down the passageway", "result": "You decide to continue down the passageway. A few metres along, you reach door hatches on both sides of the passage. One is your sleeping quarters, the other is Karl's. An image of his dead face, blood trickling from the corners of his mouth, flashes before your eyes. You take a deep breath, and calm yourself. You know you will need to keep a level head if you are going to get out of this alive.", "action_results": [{"action": "Open the door to your sleeping quarters.", "result": "You press the door release button on the wall, and the door to your sleeping quarters slides open. Through the doorway, things look normal. Your bunk is up against one wall, the covers thrown aside - why make a bed if you're the only one who's going to look at it, or use it? Against another wall is a desk unit, with a few personal odds and ends inside and on top of it. A closet containing your clothing is up against a third wall.\n\nThe lights are on, and you don't see any strange blurring, bending or stretching of the universe.", "action_results": [{"action": "Go inside your sleeping quarters.", "result": "You step through the doorway, and instantly feel that sensation again - the feeling of walking through an invisible wall, like passing through a sheet of water. Your sleeping quarters are now quite different to how they had looked an instant ago...\n\nFirstly, the bed is made. You can't remember ever having made your bed. Secondly, and more disturbingly to you, the sheets are bright pink with little white bunny rabbits on them!\n\nYou suddenly hear footsteps behind you, and spin around to see a woman wearing a pilot's uniform, standing in the passageway, outside the room. She looks up from a clipboard she was reading, and her jaw drops as she sees you looking back at her. You can see the cogs turning inside her mind, as she tries to find words to say, and her first instinct is to shout, \"Get the hell out of my sleeping quarters!\"", "action_results": [{"action": "Quickly step back out into the passageway!", "result": "Blushing furiously, and stunned at whatever is happening - for only yourself and Karl were supposed to be aboard the starship - you step out into the passageway.\n\nAs you do, you feel yourself passing through an invisible wall again, and an odd thing happens - as your eyes pass through the wall, she vanishes from in front of you. As you stand in the passageway, looking about, she is nowhere to be seen. Looking back into the sleeping quarters, you see your sleeping quarters, with your personal belongings, and your unmade bed!\n\nThe woman in uniform is nowhere to be seen! How very, very strange.", "action_results": [{"action": "Slowly step back into your quarters.", "result": "Taking a deep breath, you step back through the doorway. As you pass the invisible wall again, you see the room, once more, clean and tidy, with pink bedsheets. Now though, the woman is inside the room with you. She is in the middle of the room, with her back to you. The clipboard lies where she dropped it on the floor, and she has drawn a pistol. She looks left and right, examining her sleeping quarters, holding the gun carefully, ready to fire. ", "action_results": [{"action": "\"Please, don't shoot! I'm unarmed!\" you say quickly, holding your hands up, trying to look non-threatening.", "result": "\"Please, don't shoot! I'm unarmed!\" you say, as she swivels quickly to face you, pointing her gun in your face.\n\n\"Who are you? What are you doing on my ship?\" she demands.", "action_results": [{"action": "\"Your ship? This is my ship, lady! These are my sleeping quarters!\" you shout back at her.", "result": "\"What are you talking about? I've run this ship for six years, now!\" she says incredulously, waving the gun about in front of you.\n\n\"The Andromeda has been under my command for twelve years,\" you growl back at her, \"It was my father's ship before me, and I don't recall either him, or myself, selling it to anyone else!\"\n\n\"The Andromeda wasn't your father's ship - it was my father's ship!\" she shouts back at you, waving her gun some more. \"And it was my grandfather's ship before him, and my great-grandfather's before him!\"\n\nSomething crazy is going on, and your brain is hurting just trying to work it out. A suspicion is creeping into your mind. \"My name is Michael Dobson,\" you tell her, hoping an introduction, and an attempt at being diplomatic, might stop her waving the gun in your face. If it accidentally went off...\n\nHer jaw drops, \"No, it can't be...\" She shakes her head in disbelief, \"No, that was just a crazy tale, just mad talk - none of it could be true!\"\n\n\"None of what could be true?\" you ask, not sure you like the sudden change in her.\n\n\"My... My grandfather's name was Michael... My name is... I'm Susan Dobson,\" she says, looking you up and down, and inspecting you properly for the first time. She lowers the gun, then drops it forgotten to the floor.\n\n\"You're saying you're my granddaughter? That's crazy! That's...\" you realise that maybe it is not so crazy after all. Something has happened to your starship. What if something had happened half-way through the jump, and your ship was indeed stranded in the extra-dimension of Light Space. Who knows how your ship, or even you, might be affected. Could this location on your starship actually take you to another moment in time - somewhere into the future?\n\n\"Tell me, why would you think you were my granddaughter?\" you ask, softly.\n\nHer eyes glaze over, as she loses herself to memories, \"My grandfather used to tell wild tales. No one really believed him, and by the time I was born, he wouldn't talk about it. My mother, though, she said that my grandfather was in a starship accident once. He used to say that he met people from the past and the future. Everyone thought he was crazy, but other than that, he was perfectly normal. People said that the starship accident did something to him, and that's why he would make those wild claims. People said he was just dreaming, or drunk. Once though, before he died, he asked me a strange question... 'Remember when we were aboard the Andromeda together?' he asked me. I guess if he was you, then this, here and now, is what he was talking about. He said he would never have made it back if it wasn't for me...\"\n\n\"So, I obviously get out of here alive then,\" you say as much to yourself as to her. \"Karl and I made a starship jump, but we didn't appear at our destination - I think I'm still trapped inside of Light Space somehow. Strange things are happening as I move about my ship. When I step through that doorway, I'm back aboard my version of the ship, and this is my sleeping quarters, but when I step back in here, it's your sleeping quarters - somewhere in the future...\"\n\nSuddenly the ship shudders, and you both grab hold of furniture so you don't fall over.\n\n\"What was that?\" you both ask at the same time. Suddenly a warning klaxon blares through the ship.\n\n\"I've got to get to the bridge!\" she shouts, forgetting about you and the whole 'mixed-up time' issue. She rushes out the door and down the passage. Instinctively you rush out the door to follow her, and suddenly pass through that invisible wall again. She vanishes from sight as you step into the passageway - and back into your own time.", "action_results": [{"action": "Quickly go back into the sleeping quarters.", "result": "You quickly step back into your  - that is, her - sleeping quarters. You can barely make out voices in the distance, probably your granddaughter and her co-pilot talking in the cockpit. You wonder what is going on. Then you hear the ship's computer's voice saying \"Intruder Alert! Closing All Doors!\"\n\nA light flashes above the door, and you realise that the ship's computer, in her future time era, is about to close and lock all the doors on her ship!", "action_results": [{"action": "Stay inside your sleeping quarters.", "result": "You decide to stay put. The door slams shut, and clicks as the locking mechanism moves into place. You are now locked inside your granddaughter's sleeping quarters, at some point in the future... It feels weird, mostly because according to her, you died years ago. However, she said you made it out of the starship accident alive.\n\nHowever... You know many people have tried to understand and hypothesise over how time travel works, and wether there is but one timeline, or many branching off, depending on people's actions. You wonder if it is certain that you will survive, or if perhaps you will die, and your granddaughter will never have existed. Just trying to work out how time works begins to give you a headache, so you decide to focus on the present.\n\nThe computer said there were intruders aboard. That must have been what the shuddering of the ship had been - a pirate's starship docking with the Andromeda. If pirates had come aboard, they would try to kill everyone, so they could steal the ship and its cargo.\n\nAs you realise that, you also realise that you are now locked inside a room, with no way out unless someone breaks in from the outside, or your granddaughter has the computer unlock and open the doors. Then you notice a gun on the floor - the pistol your granddaughter lost!\n\nYou can use it to protect yourself, however, you realise she must now be unarmed, and unable to defend herself against the pirates! If you hadn't appeared out of nowhere and surprised her, she would still have her gun! You curse yourself and the predicament you are in.\n\n(Click on the gun to pick it up.)", "action_results": [null]}, {"action": "Head back into the passageway.", "result": "You head back out into the passageway. Suddenly, that strange blurring phenomena takes place just in front of the cockpit door! The walls of the passageway around the doorway stretch out in lines of colour, twisting and blurring. Then the strange effect seems to move toward you, down the passage! In a few seconds, it will reach where you stand, beside the doors to your quarters, and Karl's quarters! You had best act fast!", "action_results": [{"action": "Dive back into your quarters!", "result": "You quickly dive through the doorway into your quarters, emerging through the 'time wall' into the future. You are once more inside your granddaughter's quarters. The intruder alarm is still ringing on her ship, and you hear another explosion as the pirates try to blast their way through the ship's interior hatches.\n\nYou are starting to freak out - if you step through the door, you will be back in your own time - but will the spatial warping, the blurring of matter that killed Karl, be waiting for you on the other side of the door? Yet, if you remain where you are, it will only be a matter of time before the pirates find this room. On top of that, what of your granddaughter? Is there some way you can help her? You remember her words - supposedly it is she who saves you, from being stranded in Light Space back in your own time... What can you do?\n\nThen you notice a gun on the floor - your granddaughter had dropped her gun! You quickly pick it up. (Click on it to pick it up)", "action_results": [null]}, {"action": "Quickly open the door to Karl's quarters!", "result": "You slam the button by Karl's quarters' door with your fist, and the door slides open. On the other side of the doorway, there is no floor, no walls - no room! Just an endless expanse of pale white light... The twisting, stretching, blurring phenomena is almost upon you!", "action_results": [null, {"action": "Dive through the doorway to Karl's quarters! Maybe you will enter a different time period - one where his room exists?", "result": "You steel yourself for whatever may come, close your eyes, and thrust yourself through the doorway at the whiteness beyond!\n\nYou stumble forwards, and trip onto something soft and flat, about knee height. Tumbling onto it, you open your eyes again, and find yourself on top of Karl's bed. With a sigh of relief, you find yourself in Karl's quarters, though you have yet to determine if it is in the present, the past, or the future...\n\nTurning to look out the door, you can see the passageway fine. Opposite Karl's open doorway, you can see the door hatch to your own sleeping quarters, and it is closed shut.", "action_results": [{"action": "Head back into the hallway, and hope the blurring phenomena has passed.", "result": "You take a deep breath, and step through the doorway, back into the passageway. To your relief, there is no blurring, twisting of physical matter, anywhere to be seen. The passageway appears normal - however, you are surprised to note that you are no longer at the forward end of the central passageway, instead, you have stepped into the rear end of the passageway. Looking behind you, you don't see the room you were in. Now, you see the door to the ship's galley, and beside you, at the rear end of the passageway, the large hatch that leads into the cargo bay area at the rear of the ship!\n\nThen, to your dismay, you see the strange warping phenomena bulge out from the middle of the passageway, between where you stand now, and where the doors to your quarters and Karl's are located at the other end of the passageway. The walls there twist and shear, blurring out into the air of the passageway, in coloured lines of light.\n\nFor a fearful moment, you watch it to see if the phenomena would move toward you, but the walls just swirl and shift through the air ten metres up the passageway.", "action_results": [{"action": "Open the door to the ship's galley.", "result": "You wonder what is behind the door to the ship's galley, since you got here by stepping out of sleeping quarters. Pressing the button beside the door, you watch the galley door swoosh open...\n\nThe galley is a large kitchen/storage area for the crew, with cupboards, dish cleaner, fridge, a table with two chairs, etc. However, the room is currently being pulled apart by two rugged, laughing men. The thick, muscular men look quite dangerous, as they open cupboards, pulling stuff out and tossing things about the room as they ransack the galley. Occassionally they stuff things into bags lying on the floor.\n\nSpace pirates! They're looting the ship! You can also hear the ship's Intruder Alarm blaring. That room must be in the future, in your granddaughter's era! You hope that the two pirates don't turn around and see you, as they are both holding large guns in one hand...", "action_results": [{"action": "Quietly step into the room, behind them. Perhaps you can subdue them somehow?", "result": "If you could grab a heavy object, and smash it over their heads, or something... You aren't completely sure what you will do, but you slowly, softly, walk into the galley behind the looting pirates. As you step through the doorway, you feel yourself passing through an invisible wall, and into their time - your granddaughter's time era, somewhere years into the future.\n\nHowever, seconds after stepping into the room, you hear a gasp behind you, and you spin around. Standing on the other side of the doorway, in the passageway (a copy of the passageway that exists in the future, in your granddaughter's time) you see another pirate! He is holding a rifle, and is pointing it at your chest.", "action_results": [{"action": "Leap towards him, back through the doorway, and hope you step back into your own time...", "result": "You leap toward him, and he instinctively takes a step backward, but as you pass through the doorway, he vanishes from in front of you. You are standing in an empty passageway again, back in your own time. However, through the open galley door, you hear the pirate, in that future era, cursing.\n\nTurning and looking back into the galley, you see a disgusting sight - the pirate steps through the doorway (in his own time era) into the galley, and as he passes through the doorway, you see him come into sight one layer at a time. You see his insides, his bones, as the front half of him passes through the doorway. Then he is fully through, and you see his back. He stands there, just a few steps in front of you, and you know that if he turns around, he won't see you. You don't exist in his time frame, this copy of the passageway you are standing in is in a different time!", "action_results": [{"action": "Thrust your fist through the doorway, through the invisible wall and into his time, and smash him in the back of the head, hoping to knock him out!", "result": "You pull your arm back, then thrust it forwards as hard as you can, smashing him in the back of the head. He stumbles forward, falling to the floor. His rifle slips from his hands to lay beside him. The pirate is unconscious on the floor just over a meter away from you, and the other two pirates have not noticed a thing - they still have their backs to you as they loot the galley!", "action_results": [{"action": "Slowly step through the doorway, into their time era, and take the rifle the pirate dropped.", "result": "Hoping the noise of the Intruder Alarm will hide your footsteps, you slip through the doorway. You feel the strange sensation of passing through an invisible wall of water, then you are in their time era. You quickly reach down and grab the rifle!\n\n(Click on the rifle to pick it up)", "action_results": [null]}]}]}, {"action": "Raise your hands and surrender to the pirate.", "result": "You raise your hands, but he pulls the trigger. A hail of bullets blasts through your chest, sending your body flying backwards, twisting and jerking to the floor.\n\n\"One crewman down,\" the pirate laughs, as you gasp for breath, choking on blood. Then, as you die, you see something strange happening. The pirate and the ship around him begin to go transparent. You see him looking confused, and panicking, but then your eyes close, and everything goes dark.", "action_results": []}]}, {"action": "Leave the pirates alone, and try opening the cargo bay hatch.", "result": "The pirates, being in a different time period to the passageway, can not harm you. You decide to make a move to the cargo bay. You press the button beside the hatch - but nothing happens. It makes noises like it is trying to open, but is locked - yet looking at it from this side, there is no lock mechanism in place.\n\nYou suspect one possible explanation, perhaps the other side of the door is in a different time frame - one where the door is locked, and somehow the door on your side is being influenced by that. Whatever the explanation, the door is not opening when you press the button...\n\nYou look back up the passageway, and the wall about half-way is still warped and twisting out into the air. There's no going back to the front of the ship. You look through the galley doorway again. The two pirates are still looting the place, and the noise from the Intruder Alarm blares at you through the doorway, from your granddaughter's time era.", "action_results": [null]}]}, {"action": "Open the hatch to the cargo bay.", "result": "You decide to make a move to the cargo bay. You press the button beside the hatch - but nothing happens. It makes noises like it is trying to open, but is locked - yet looking at it from this side, there is no lock mechanism in place.\n\nYou suspect one possible explanation, perhaps the other side of the door is in a different time frame - one where the door is locked, and somehow the door on your side is being influenced by that. Whatever the explanation, the door is not opening when you press the button...", "action_results": [null]}]}]}]}]}]}, {"action": "Open the door to Karl's sleeping quarters", "result": "You press the button set into the passage wall, and the door to Karl's sleeping quarters swooshes open. However, you just stand there stunned, looking through the doorway. Even with everything else going on, you did not expect to find this. Or rather, you expected to find at least something.\n\nOn the other side of the doorway is nothing - just whiteness. No floor, no walls, no room - just the endless expanse of pale white light that surrounds your starship.", "action_results": [{"action": "Close Karl's door.", "result": "You quickly press the button again, and watch the door slide shut. The last thing you'd need is to trip and fall outside the ship into that endless nothingness!", "action_results": [null, {"action": "Walk to the aft end of the passageway", "result": "If you are indeed trapped inside the Light Space dimension, then the only way of getting the ship back to real space that you can think of, would be to force the Jump Drive to reactivate, and hope that it completes the jump. The Jump Drive access chamber is at the rear of the ship, beside the cargo hold.\n\nFrom where you are standing, you can see the large hatch leading into the cargo hold, at the rear end of the passageway. You start walking down the passage towards the other end of it, when suddenly the walls halfway down the passage bend outwards in a twisting, blurred mass of warped matter! You quickly stop, and take a step backwards, watching the wall warping in all sorts of odd directions, blurring outwards with sparkling lines of light.\n\nAfter a few moments, the wall flattens out once more, and looks normal again. However, you feel completely freaked out. Perhaps, you decide, you will remain at this end of the passageway for a bit longer...", "action_results": [null, null]}]}, {"action": "Hope there is something else on the other side of the doorway, and step through...", "result": "You stick your foot through the doorway, and it vanishes from sight. You feel it passing through an invisible wall, like sticking your foot through a flowing sheet of water. However, when you pull your foot back to this side of the doorway, you can see it again, and it feels fine. You take a deep breath, and plunge through the doorway...\n\nYou stumble to a halt as you pass through. As your face passes the invisible wall in the doorway, the endless white expanse of nothingness vanishes from sight, to be replaced with Karl's sleeping quarters! You look around the room. There's a bunk against one wall, a closet with Karl's clothing against another wall, and a small desk unit with some of his various odds and ends.\n\nTurning to look out the door, you can see the passageway fine. Opposite Karl's open doorway, you can see the door hatch to your own sleeping quarters, and it is closed shut.", "action_results": [{"action": "Head back out into the passageway.", "result": "Well, you know that this location does exist aboard your starship, and is not, after all, an endless expanse of whiteness. You decide to head back out into the passageway. Stepping through the doorway, you feel yourself passing through an invisible wall again, and then look behind you. Where Karl's room had been was again a vast expanse of endless pale light. Very strange...\n\nYou press the button in the wall, and close his door.", "action_results": [null, null]}, {"action": "Wait around, and see if your granddaughter comes past this room.", "result": "Perhaps, you think, you might run into your granddaughter again? You sit on the bed, but then you realise that in this room, there is no blaring sound of the intruder alarm. Karl's room must not be in her era of time... Besides which, looking about the room, it looks like it is indeed Karl's room, and not being used by someone else.", "action_results": [null]}]}]}, null]}]}, {"action": "Tackle her to the ground, trying to get the gun out of her hands!", "result": "You dive at her back, and tackle her to the ground. She cries out in rage, as the two of you roll about, struggling for the gun. Suddenly, the gun goes off! It strikes her in the chest!\n\nShe goes limp, and you roll off of her, grabbing the gun. Suddenly, as she breathes her last, the gun fades out of existance! It just vanishes from your hands!\n\nThen, before your confused eyes, she slowly fades until she doesn't exist either! What's happening, you wonder, then with horror, notice your own hands turning transparent. Moments before you also vanish from existance, you can't help but wish you at least knew what she had been doing on your ship.\n\nThen you are gone.", "action_results": []}]}, null, null]}, {"action": "Ask what she is doing on your ship - and what did she do to your sleeping quarters?", "result": "\"What are you doing on my ship? HOW did you get on my ship? And what did you do to my sleeping quarters! I mean - bunny rabbits on the bed?\" you growl at her incredulously.\n\n\"Your ship? Your ship! What the blazes are you talking about! The Andromeda is my ship! I've run this vessel for six years now!\" she growls, stalking into your/her sleeping quarters, and brandishing a pistol, which she proceeds to wave in front of your face!\n\n\"The Andromeda has been under my command for twelve years,\" you growl back at her, \"It was my father's ship before me, and I don't recall either him, or myself, selling it to anyone else!\"\n\n\"The Andromeda wasn't your father's ship - it was my father's ship!\" she shouts back at you, waving her gun some more. \"And it was my grandfather's ship before him, and my great-grandfather's before him!\"\n\nSomething crazy is going on, and your brain is hurting just trying to work it out. A suspicion is creeping into your mind. \"My name is Michael Dobson,\" you tell her, hoping an introduction, and an attempt at being diplomatic, might stop her waving the gun in your face. If it accidentally went off...\n\nHer jaw drops, \"No, it can't be...\" She shakes her head in disbelief, \"No, that was just a crazy tale, just mad talk - none of it could be true!\"\n\n\"None of what could be true?\" you ask, not sure you like the sudden change in her.\n\n\"My... My grandfather's name was Michael... My name is... I'm Susan Dobson,\" she says, looking you up and down, and inspecting you properly for the first time. She lowers the gun, then drops it forgotten to the floor.\n\n\"You're saying you're my granddaughter? That's crazy! That's...\" you realise that maybe it is not so crazy after all. Something has happened to your starship. What if something had happened half-way through the jump, and your ship was indeed stranded in the extra-dimension of Light Space. Who knows how your ship, or even you, might be affected. Could this location on your starship actually take you to another moment in time - somewhere into the future?\n\n\"Tell me, why would you think you were my granddaughter?\" you ask, softly.\n\nHer eyes glaze over, as she loses herself to memories, \"My grandfather used to tell wild tales. No one really believed him, and by the time I was born, he wouldn't talk about it. My mother, though, she said that my grandfather was in a starship accident once. He used to say that he met people from the past and the future. Everyone thought he was crazy, but other than that, he was perfectly normal. People said that the starship accident did something to him, and that's why he would make those wild claims. People said he was just dreaming, or drunk. Once though, before he died, he asked me a strange question... 'Remember when we were aboard the Andromeda together?' he asked me. I guess if he was you, then this, here and now, is what he was talking about. He said he would never have made it back if it wasn't for me...\"\n\n\"So, I obviously get out of here alive then,\" you say as much to yourself as to her. \"Karl and I made a starship jump, but we didn't appear at our destination - I think I'm still trapped inside of Light Space somehow. Strange things are happening as I move about my ship. When I step through that doorway, I'm back aboard my version of the ship, and this is my sleeping quarters, but when I step back in here, it's your sleeping quarters - somewhere in the future...\"\n\nSuddenly the ship shudders, and you both grab hold of furniture so you don't fall over.\n\n\"What was that?\" you both ask at the same time. Suddenly a warning klaxon blares through the ship.\n\n\"I've got to get to the bridge!\" she shouts, forgetting about you and the whole 'mixed-up time' issue. She rushes out the door and down the passage. Instinctively you rush out the door to follow her, and suddenly pass through that invisible wall again. She vanishes from sight as you step into the passageway - and return to your own time.", "action_results": [null, null]}]}]}, null, null]}]}, null]}]}, null]}, null]}, {"action": "Remain in the Cockpit for a while, just to be safe - that is, if anywhere on this ship is safe...", "result": "After seeing what the strange warping phenomena did to Karl, and seeing the wall bulge in a similar way further down the passage, you are not too sure it would be safe to walk through the starship.\n\nHowever, as you stand in the Cockpit, wondering what to do, you realise a few things. Firstly, if you stay here, there's no guarantee that the air around you won't warp, and you won't be killed. Secondly, if you are stuck half-way between a Light Space Jump, then the only way out that you can think of, would be to reactivate the Jump Drive, and hope that it finishes the jump, and returns you to normal space.\n\nHowever, the Jump Drive Chamber is at the rear of the ship, to one side of the Cargo Bay. That means, if it is possible to reactivate the drive, you will have to travel through the ship to get to it... The fact that the rest of the ship doesn't even show on the ship's computer is in no way reassuring to you.", "action_results": [null]}]}]}]}, null]}, null, null]}]}