{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=6382", "context": "", "first_story_block": "What a weird dream. There was a policeman, a fireman, a... No, you can't remember who else was in the dream. It is slipping from your memory as you begin to wake up. Perhaps it is the bouncing, shaking and vibrating of your bed that is waking you up?\n\nWhen did you get a vibrating bed? Hang on, are you sitting up? Yes, it would seem so. You must be sitting in bed. Why is you're bed bouncing you about so much?\n\nYour sleepy head falls forwards, and hits something. Hard. Ah, that's good. Sleep again.\n\nHowever, the bouncing, shaking and vibrating causes you to wake up again. You feel so sleepy, so very sleepy. You open your eyes. No, you must still be asleep, this must be some sort of a dream. Trees are flying past you on both sides. The sky is clear and blue. You like the colour blue. It reminds you of water.\n\nYes, lots of water in front of you. It seems to stretch off to the horizon. You like the sea. Perhaps if you keep speeding towards it you might be able to go for a swim?\n\nYou bounce upwards and hit your head on something again. Hard. Time to sleep again.", "action_results": [{"action": "No! I want to wake up - now!", "result": "Maybe it is time to wake up, you think. After all, you'll be late for work if you keep dreaming. Surely your alarm clock will annoyingly start beeping at you soon and wake you up?\n\nMaybe you should turn it off. You sleepily reach about you, trying to find the Snooze button for your alarm clock.", "action_results": [{"action": "You reach out in front of you, trying to push something", "result": "Is your alarm clock in front of you, you wonder? You reach out a shaking hand, and touch something. You feel about. No, this object is round like a pizza. There is a sort of soft bubble in the middle of the plastic pizza. You push it and there is a loud honking sound. What a strange pizza! You do have weird dreams sometimes.\n\nYou smile sleepily. The sea seems to be getting bigger. What was it the man had said? Time to go swimming?\n\nPerhaps you should try something else?", "action_results": [{"action": "You reach down beside your bed", "result": "Perhaps your alarm clock is down low, beside your bed? You wonder again why you are sitting in your bed, but the thought slips away as your hand touches something. It seems to be jutting out beside your bed. You sleepily feel the object. It's is some sort of plastic rod or something. When you pull against it, it seems to move a bit. Weird.\n\nYou sleepily notice the sea is getting bigger. Maybe you're shrinking? You begin to giggle.", "action_results": [{"action": "Pull up the plastic rod", "result": "You pull against the plastic rod, but it doesn't move very far. Then your thumb feels a button of some sort on the plastic rod. Perhaps it is your alarm clock's snooze button? You press the button down, and the rod lifts up. As you do so, your dream changes. Now, instead of just bouncing, shaking and vibrating, there is a loud screeching sound, and you feel your seat jerking left and right with the screeching sound. You are now getting a bit dizzy on top of everything else you are feeling.", "action_results": [null, {"action": "Reach down at the other side of your bed", "result": "You sleepily reach down the other side of your bed. You hit a wall. That's strange? When did your bed become so thin? And why are you sitting on your bed? The thoughts slip dreamily away as your hand follows the wall, lower, reaching between the wall and your strange bed.\n\nYour hand touches a rectangular object. Some sort of strip of cloth seems to be coming out of the rectangular object. You realise that the cloth strip comes up and presses against your chest, holding you upright against your strangely shaped bed. Now why would it do that?", "action_results": [null, {"action": "Fiddle around with the rectangular object. Perhaps it is your alarm clock?", "result": "You sleepily decide to fiddle about with the rectangular object that the strip of cloth comes out of. Perhaps it is your alarm clock? You find a button and push it. Maybe it's your snooze button?\n\nSomething weird happens. The cloth strip that was pressed against you suddenly slides away. Where did it go? Now you are having trouble sitting in your strangely shaped bed, as nothing is holding you up anymore.\n\nThe sea is looming large in front of you. You realise there aren't any trees flying past you anymore, and briefly wonder where they went.", "action_results": [null, {"action": "Examine the wall", "result": "That's odd, you think, looking at the wall beside your strangely shaped bed. You can see through it! Or at least, you can see through part of it. You watch the world fly past you for a few moments, then your eyes begin to focus on what looks like a handle of some sort. Why is there a handle on the wall?", "action_results": [{"action": "pull the handle on the wall", "result": "You look through fuzzy eyes at the handle on the wall beside your strangely shaped bed. Without the cloth strap holding you in place, you keep shaking about, and it is hard to grab hold of it. You notice out of the corner of your eyes that the sea seems to be very close to your strange bed now.\n\nWith a maximum of effort, you manage to grab hold of the handle and pull on it. Suddenly the wall opens up! It swivels away from you, and the next thing you know, you are flung off your bed and through the opening!", "action_results": [{"action": "A near death experience", "result": "As you stike the ground, spinning and tumbling down a steep hill, you come to your senses. You realise that you have just fallen out of a car which was roaring down a steep incline, towards a cliff, looking out over the ocean.\n\nAs the car flies past you, and moments later sails out into the air, you start flailing around madly trying to stop!\n\nBushes and shrubs tear out of the ground in your fingers, and digging your heels into the ground does nothing but cause you to spin around, head first towards the cliff!\n\nHowever, having pulled the handbrake on hard, you managed to slow the car - and yourself - down long enough to give you the time you needed. Your attempts to slow yourself down work enough that when you reach the edge of the cliff, you manage to hook yourself on some tree roots jutting out of the ground.\n\nThe next thing you know, you are lying on your stomach, your head and shoulders jutting out past the edge of the cliff, watching the car strike the jagged rocks far below. You watch in awe as the car crumples and explodes, before being swallowed by the sea.\n\nFor a moment, you just lie there, gasping for breath. Then you slowly, and carefully, back yourself up, away from the edge of the cliff.", "action_results": [{"action": "What is happening?", "result": "Your head is pounding like a terrible hangover, your body is all aches and bruises. What is happening?\n\nYou try to recall your last glimpses of the car. It hadn't seemed familiar to you in any way. Your thoughts hadn't been, \"Oh no! My car is going off a cliff!\"\n\nHad you been driving someone else's car for some reason? You try to clear your mind, but your head feels all foggy for some reason, like you just can't wake up properly. Were you drunk? Drunk and behind the wheel of a stolen car?\n\nOr... Were you drugged. Had someone tried to kill you, push you down a hill and off a cliff?\n\nIt just didn't make any sense! Why would someone want to kill you? You're just a simple... A... A what? What was it you did for a living? You try to think. You can't remember!\n\nWait a minute - who are you? You try to remember your name, but your pounding head seems to drive away any familiar thoughts. Maybe you hit your head too hard. Then again, maybe you were drugged after all.\n\nYou just don't know.\n\nLooking back the way you had come, you see the ground rises up a fair way. There appears to be a road up there, dug into the side of the mountain, and you can see broken and bent railings where the car had crashed off the road.\n\nMaybe you hadn't been pushed down the hill after all. Or was it some sort of setup? You slowly, and unsteadily, stand up and begin the hike up the hill to the road.", "action_results": [{"action": "A winding mountain road", "result": "You are standing at the edge of a winding mountain road. The ground falls away steeply behind you, and rises up sharply on the other side of the road. The road barrier here is bent and twisted, probably from when the car you were in crashed off the road and down to the cliff.\n\nThe wind rustles through your hair, and you look out at the sea, which stretches uninterrupted to the horizon.\n\nWhere are you? You don't recall living anywhere near the sea. Then again, you don't recall where you lived at all...\n\nLooking both ways, you see the road hugs the side of the mountain, until it curves away, disappearing from view.", "action_results": [{"action": "Wait for a car, and try to hitch a ride", "result": "You stand about, then feeling unsteady, sit for a while. Surely another car would drive past eventually.\n\nTime seems to stretch on forever. Then, you hear a sound in the distance. An engine!\n\nYou stand back up again, and wait for the car to come into view. A topless sports car comes around a corner in the distance. You begin waving your arms wildly. When the car zooms around the nearest bend, the driver barely sees you, and then the car is passing you.\n\nFor a moment you groan in misery, and then you see the brake lights come on. The car slows down as it begins to go around the next bend, then stops. You hear the driver honk their horn and see a raised arm waving.\n\nGreat, you think, and do your best to hurry along the road.\n\nThe driver is a european looking woman, with flowing black hair and a head scarf. She looks at you over the rim of lowered sunglasses, and her jaw drops.\n\n\"What happened to you?\" she asks with concern, in a strong european accent.", "action_results": [{"action": "Tell her you were in a car accident", "result": "You tell her you were in a car accident, and barely managed to escape falling off the cliff. She is astounded, and praises your bravery. Opening her passenger side door, she motions for you to get in.\n\n\"I will take you to St.Mary's. It's a good hospital a few miles from here, in Seneriquez,\" she says.\n\nYou hop in, and do your best to keep your weary, aching body awake. The woman introduces herself as Adonica, and continues to chatter and talk about all manner of things while she drives you to the hospital.You try to listen to what she is saying, but find it hard to concentrate on anything. Your pounding head and foggy mind cause you no end of displeasure.\n\nEventually you come down off the mountain, to a bustling seaside town. The buildings are all whitewashed stonework, with sharp square and rectangular shapes. Driving through the town, everyone has tanned, olive skin. South america? Spain? Greece? You can't help but wonder where you are. All the signage is in two languages, english and something else you don't know.\n\nAdonica pulls into the hospital car park, and helps you to the foyer. You begin to feel dizzy and light headed, and the next thing you know, Adonica is calling for a doctor, and you are falling to the floor.\n\nThe last thought on your mind is this sudden question: You were not in an english country - why is it that when you met Adonica, she spoke to you in english and not a foreign language? How had she known you were english?", "action_results": [{"action": "St. Mary's Hospital", "result": "You awaken to find yourself in a real bed this time. Looking groggily around you, you can see that you are in a hospital ward. A doctor is nearby, reading your chart. He looks up, seeing movement, and smiles at you.\n\n\"Buenas noches, señor, you speak the english, si?\" he asks.", "action_results": [{"action": "\"Where am I?\"", "result": "\"Welcome, señor, to St. Mary's Hospital of sunny Seneriquez!\" he says with a smile, sweeping one hand grandly.", "action_results": [{"action": "\"Is this Spain?\"", "result": "\"Si, señor, you are in Spain. You did not realise this? You are perhaps forgetting things? You do not have any serious injuries, but you have been under great stress, and many hits to your head,\" he tells you. \"It is not uncommon for the memory problems to arise. You should remember in time. You need rest, señor.\"", "action_results": [null, {"action": "\"Has Adonica left? I wanted to thank her.\"", "result": "\"The señorita who brought you here? Si, she left a few hours ago. You have been sleeping a long time, amigo,\" he tells you, \"Many hits to your head.\"", "action_results": [null, null, {"action": "\"What happens to me now?\"", "result": "\"Rest, and do not worry about the money. The señorita who brought you here kindly paid for you before leaving,\" he tells you.\n\n\"Adonica paid for me? But she didn't even know me,\" you are amazed.\n\n\"Maybe you repay the favour sometime, señor,\" he winks.\n\nWhy would a complete stranger pay the medical bills for someone, and then leave without a trace?", "action_results": [null, null, null, {"action": "Rest", "result": "You lean back into the soft pillow, and your eyes begin to close. You still ache all over, but they obviously gave you medications. Soon you sleep peacefully.", "action_results": [{"action": "The Inspector", "result": "\"Señor, are you awake? The agente de policía would like to ask you some questions,\" the doctor says, pulling you from your sleep.\n\nYou sit up, and realise you are feeling much better than before. As your vision clears, you see a policeman at the foot of your bed.\n\nThe doctor leaves you alone, and the policeman walks over to beside you. He looks down at you, a pen and notepad in his hands. He looks at you oddly, as if waiting for something.\n\n\"Can I help you, officer?\" you ask him.\n\nHe gives a sly smile. You feel like you have missed something, but don't know what.\n\n\"I am Manuel de Cordoba,\" he tells you, and pauses. You just look back up at him and he smiles wider. You notice that the smile doesn't seem to reach his eyes.\n\n\"I would like to ask you a few questions,\" he informs you, \"What is your name, señor?\"\n\n\"I... I don't remember,\" you tell him.\n\n\"The doctor said you have hit your head many times. How did this happen?\" he asks.", "action_results": [{"action": "\"I don't remember. I have amnesia,\" you tell him.", "result": "You feel a strange sense of suspicion about this inspector. Something doesn't feel right.\n\n\"I don't remember. I have amnesia,\" you tell him.\n\nHis smile widens, showing numerous yellowed teeth. He obviously doesn't believe in brushing his teeth.\n\n\"So, you don't know who you are, or how you hurt yourself. What is the last thing you remember? The doctor mentioned a señorita brought you here. Who is she? How do you know her? What is her name?\" he asks aggressively.", "action_results": [{"action": "\"Her name was Adonica. She was just someone driving by, who gave me a lift,\" you say.", "result": "\"Her name was Adonica. She was just someone driving by, who gave me a lift,\" you say.\n\n\"So, you never met her before the accident?\" he asks.\n\n\"No, I've never seen her before,\" you tell him.\n\n\"Yet she paid for your medical bills, hmm?\" his grins again, but there is no friendliness in his face.\n\n\"I didn't ask her to. She was just being nice to a penniless stranger, I guess,\" you say. His eyes squint down at you, his lips pressed thinly, then he smiles again and says, \"Thank you, señor. We have your picture. If we find out who you are, we will let you know. Have a nice day.\"\n\nWith that, he leaves.", "action_results": [{"action": "Go to sleep", "result": "The doctor returns after the Inspector leaves you.\n\n\"You can sleep here tonight,\" the doctor tells you, \"You should be fine to leave in the morning.\"\n\nYou drift off again for a while, aided by the hospital's medications.", "action_results": [{"action": "The Next Day", "result": "The next day you are given a fresh set of clothing, apparently donated by a local church, and a quick breakfast.. The doctor recommends you find a way to Barcelona, and visit the british embassy - as you don't have an american accent. Perhaps someone there can help you?\n\n\"Señor! Señor!\" the doctor calls out to you as you are leaving the hospital.\n\nYou head back over to him.\n\n\"I forgot, the señorita dropped by again this morning before you were awake. She wanted me to give you this,\" he says, and hands you a business card.\n\nThe card tells you she owns an antique shop, apparently located in this town. She was kind enough to pay for your hospital fees - perhaps she could loan you some money, and help you get to Barcelona? Or at least let you use her phone to call the embassy?", "action_results": [{"action": "Finding Adonica's Antiques", "result": "You find a map of the town at a bus stop, outside the hospital. Adonica's shop is only a few streets away, so you do your best to memorize the way there and start walking.\n\nIt only takes about fifteen minutes to get there, and as you round a street corner, you see the policeman, Manuel de Cordoba, stepping out of a shop. You see him look at what appears to be a key, which he then slips into his pocket. Some instinct makes you freeze, and you watch him look about then head off down the street. He didn't appear to see you.\n\nThen you notice the sign above the door he had come out of. That was Adonica's Antiques! You guess the policeman had dropped in on her to ask her some questions about you.", "action_results": [{"action": "Go into the shop.", "result": "You walk up to the shop door, and notice a sign hanging in the door's window. It reads: \"CLOSED\".\n\nThat's odd, you think, and then you notice that the door is not shut properly. It is open just a fraction, the policeman obviously not pulling it shut behind him when he left. Perhaps Adonica was not at work yet?", "action_results": [{"action": "Go inside anyway.", "result": "You glance about. No one seems to be paying any attention to you, so you slip inside, closing the door behind you.\n\n\"Hello?\" you call out, \"Adonica?\"\n\nThere is no answer. You soon see why. The woman is lying on the floor near the shop counter, her neck very obviously broken. Her eyes stare up at the ceiling, seeing nothing.\n\nSomething breaks inside of you, some passionate, wrenching emotion that causes you to fall to your knees beside her, sobbing into your hands. You have no idea who Adonica was, but you feel like you have lost someone dear to you.\n\nYou regain your composure, and wonder for a second if you should call the police and tell them about the murder, then the face of the policemand comes to mind.\n\nThat policeman, Manuel de Cordoba - he must have killed her! You knew something was wrong with him the moment you saw him! The villain! The murderer!\n\nMaybe if you were fast you could still find him and follow him. He might lead you to some answers!", "action_results": [{"action": "Hurry outside, and follow the policeman.", "result": "Something strikes you as suspicious about the policeman. You suddenly have the strangest feeling that you might have met him before the car 'accident', somewhere.\n\nYou decide that now you have found Adonica's shop, you can always come back and talk to her later. You begin following after the policeman.\n\nHe walks the streets of Seneriquez for a while, and you begin to think he is walking quite aimlessly. In fact, around twenty minutes later, you swear you are walking down a street he had already walked along earlier. Then, quite suddenly, he slips through the door of a shop and disappears from sight!", "action_results": [{"action": "Look through the shop windows, and see what he is doing.", "result": "You decide to peer through the shop window, trying to appear casual, and see what he is doing. Walking down the street, you find that it is a jewellery store. Looking through the window, you see him head into a back room. Perhaps he is going to slip out the back?", "action_results": [{"action": "Rush into the side alley, and see if there is a back entrance/exit to the shop", "result": "You quickly head down the street, and into the alley beside the shop he went into. The alley bends around the back of the shop, and you see there is a back door. Just as you step around the corner, and see the door, it swings open!\n\nThe policeman, Manuel de Cordoba, who you are beginning to suspect is either a crooked cop, or not one at all, steps through the door. He sees you, and for a moment you both stand perfectly still.\n\nThen he thrusts his hand towards his holster!", "action_results": [{"action": "Run for your life!", "result": "You take a few steps, and hear the cracking retort of his pistol. Something punches you hard in the back, and you begin to fall. You do not know if you reached the ground or not, for everything grows dark with surprising speed.\n\nBetter luck next time! You can't outrun a bullet!", "action_results": []}, {"action": "Tackle him before he can draw his gun!", "result": "With instinctive speed, you throw yourself into action, diving for him. The gun comes out of his holster, but you grab it with one hand, as you tackle him to the ground.\n\nFor a few desperate moments, the two of you roll across the alley, fighting for your lives, and then...\n\nYou hear a muffled 'bang', and he goes limp. The gun went off, and it was luckily not yourself on the receiving end. You kneel beside him, breathing heavily. He is dead. Searching him, you find a wallet, six passports, but no police papers or badge. He also has a thick brown envelope full of local currency, and taped to it, a small numbered key.\n\nYou browse the wallet, and to your surprise, you find it does not belong to the dead man. It most likely belonged to you! It has a british driver's license, with your picture on it! It says your name is Michael Longsley!\n\nYou feel overcome with excitement for a moment. Michael Longsley! You have a name! It doesn't sound familiar to you, but that must be the amnesia. Now you know who you are! You look briefly at the money, you'll count it later. The passports, that could be interesting. It might tell you something more about the dead policeman.\n\nFlipping open the first passport, your emotions drop away. It is a picture of you, and a different name. You open the next passport to find another picture of you, and another name. They're all you! They're all alternate identities! Which one is the real you? Which name is your name? You angrily throw them to the ground, then slowly pick them back up again. They will probably be useful at some point.\n\nYou look at the key, and wonder what it might be for. Then, for no apparent reason, a thought begins to gnaw at you. You remember something about a train station lock-up box. Perhaps the number on the key is the box that it unlocks.\n\nYou look at the dropped gun for a while, wondering if you should take it with you or not. It could be useful to have a weapon, in case you run into more enemies, but then again, the gun would link you to the death of a 'policeman', and that might not be a good idea.", "action_results": [{"action": "Investigate the local Train Station", "result": "You find a bus stop, and look at the town map that shows the bus routes. You find the train station easily enough, and head there. It is an old, small structure, with two lines passing the platforms. You do your best to blend into the crowd, hoping that any other potential enemies had not seen you. It doesn't take you long to find a long wall full of numbered boxes.", "action_results": [{"action": "Try opening the box with the number from the key", "result": "You stand in front of the box, hoping your body will obscure the view for anyone watching, and insert the key. It turns easily, and the box opens. Looking inside, you are surprised by what you find.\n\nYou see a small ceramic bull, about the size of the palm of your hand, and a plane ticket to London.\n\nYou must know something about ancient artefacts, because you are instantly, positively sure that this item is from an archeaological dig, on an island off the south-eastern coast of spain. How you know this, or even why you would know this, is beyond you.\n\nYou also know that it is not a very valuable piece. In fact, you can even see that the piece is damaged. There appears to be cracks in the neck of the bull. Most people would not notice the damage, but somehow your eyes are brought to the cracks instantly. Someone tried quite successfully to mend the artefact, but your expert eyes spot the work right away.\n\nWhy would this lowly artefact be so important? And why the ticket to London? Was someone supposed to take the bull there? You notice a small letter 'A' on a foot of the statuette. Adonica? You know in your heart that the 'A' was carved there by her. You also suspect that the policeman had taken the key from her. That must be what he had been doing at her shop. Something tells you that he would not have left her alive.\n\nWhere to now, you wonder? You have an envelope full of cash. Perhaps you should follow the trail left by the bull and the ticket. Perhaps if you took it to London, following the ticket, you might find more answers. Perhaps there was an antique dealer in London? In fact, the more you think about it, the more you feel you know someone in London who might be interested in the bull, though you can't place a face or a name.", "action_results": [{"action": "Plan to travel by train to France, then by the Tunnel to London.", "result": "Time passes, and landscapes flash by, as you journey across the countryside on the long journey from southern Spain to London.\n\nYour thoughts turn to the last few days, and the trials you have been through. You have a room to yourself on board the train, and look often at the statuette of the bull, whose head was very carefully reattached, presumably by Adonica. A thought nags in your mind, is there more to the bull then merely a skillful antique dealer repairing a damaged artefact? Your suspicions grow, as you wonder if something might not in fact be hidden inside the statuette.", "action_results": [{"action": "Carefully detatch the head, and look inside", "result": "Your curiosity gets the better of you, and you 'borrow' some cutlery from the dining car of the train. A few bends of the fork, a little mashing of the bent fork spike with the thick, flat handle of one of the knives, and you have yourself a handy little tool.\n\nCarefully you work along the crack lines on the bull's neck, following the barely visible grooves, unworking the glue and eventually seperating the head.\n\nThere is indeed an opening in the neck, and the statuette has been hollowed out. Someone has stuffed tissue paper inside as a packing material. You jerk some of it out, and hear a tinkling sound as small shiny objects scatter onto the cabin floor!\n\nLooking down, and carefully picking them up, you realise they are diamonds! Someone had stuffed diamonds inside the statuette.\n\nInstantly some memories come flashing back to you. A smuggling ring, using almost worthless artefacts to slip diamonds into London. The only thing is, you don't know if you were doing the smuggling, or trying to stop it from taking place. What was your part in this scheme? Who were you? A crook? An undercover investigator?\n\nYou stuff the diamonds back into the hollow bull, and plug up the hole in the neck with the tissue paper.", "action_results": [{"action": "The Fireman", "result": "The door to your cabin suddenly slides open. Standing in the doorway is a face that you recognise instantly. An American man, an assassin. He goes by the name, 'the Fireman', a pyromaniac who enjoys blowing things up.\n\nHe grins at you, \"So, the forgetful englishman refuses to keep out of our business, huh? Or perhaps you aren't so forgetful at all? Perhaps you just faked it to get the slip on Cordoba?\"\n\nFear grips your heart. This man is a ruthless, cold blooded killer. You remember him clearly now. How is it you can remember someone else, and not remember yourself? And why would you know a man like this?\n\n\"I want the bull. Give it to me,\" he orders.", "action_results": [{"action": "Behind your back, slip the diamonds out of the bull and into your hand, then toss him the bull.", "result": "You feel a strange sense of calm. Somehow, you know you have been in situations like this before, where your life was at stake - but you also know that you handled them with skill and ease. Feigning fear, you hold the headless bull behind your back, and tip the diamonds out into your hand.\n\n\"Allright,\" you say, \"I don't want any trouble. I really don't know anything about all this!\"\n\nYou stuff the tissue back into the bull's neck, then bring your hand around and toss the bull at him. He looks surprised for a moment, that you are actually giving it to him, and lifts his hands up to catch it.\n\nAs he looks up, momentarily distracted, you lash out with the knife you obtained from the dining cart, stabbing him through the heart. He cries out once, then slumps to the floor. The empty bull lands on the floor, and rolls about harmlessly.\n\nRecognising the Fireman has brought back some more memories. Now the plan makes much more sense to you. Someone has been smuggling diamonds, hidden inside old, nearly worthless artefacts from the isles off the southern coast of Spain. You have dim glimpses of memories, you visiting those sites, even seeing some people packing diamonds into similar artefacts. Adonica then sealed them up. Both Adonica and yourself were clearly involved in the scheme somehow, but why then was Adonica killed, and why were you such a threat to them?\n\nHad you both tried to blackmail them, betray them, or were you undercover cops trying to expose them? You just didn't know. You would have to wait until London to find the answers.\n\nFor now, you hide the body in the cabin's toilet, shutting the door. You quickly wash up the blood on the floor, and prepare to change trains at the next stop, and continue your journey.", "action_results": [{"action": "London Arrival", "result": "You walk around the train station for a while. You thought about it long and hard on the long train journey, what you would do when you arrived in London, but now you are here, you still aren't sure what to do.\n\nYou could try to feel your way about London, see if you find any familiar places that spark any memories. You could call a few antique dealers, and see if anyone seemed overly interested in old spanish island artefacts. You could even try the local police, see if they can work out who you are, or just to tell them about what has been going on.", "action_results": [{"action": "Wander around London, trying to find anywhere that sparks memories", "result": "You decide to go for a long walk, take in the sights, and see if anything sparks your memories.\n\nHours later, you see a parking sign that catches your attention. It doesn't stand out, just one of a million stop signs, but for some reason, this particular one makes you stop, stand and stare. You feel a tingling sensation in the back of your head, and know that somewhere nearby is a place of importance.\n\nLooking every which way, you notice a small antique shop. A stylised bull is painted on a window. It bears a striking resemblance to the small statuette's profile. Gold print on the door reads: \"Bruno's Antiques\".", "action_results": [{"action": "Go inside Bruno's Antiques", "result": "You head inside Bruno's Antiques. An old man sits behind the counter, and looks up at you. There is something very, very familiar about this man.\n\n\"Ah, you have come back in one piece,\" he says. \"Last I heard, someone had tried to push you off a cliff. I'm glad to see you are okay, Michael.\"\n\nMichael! He called you by name. Yet... That name somehow doesn't sound right. Perhaps it is your name, or perhaps just another false identity.\n\n\"So, do you have the diamonds?\" he asks you.", "action_results": [{"action": "\"Diamonds? What diamonds?\" you say, playing on his knowledge of your amnesia.", "result": "\"Diamonds? What diamonds?\" you say, playing on his knowledge of your amnesia.\n\nHe looks startled for a moment, then say, \"Please tell me you brought the bull! You didn't leave it back in Spain, did you?\"", "action_results": [{"action": "\"I don't know anything about a bull. Adonica told me to come here before she died,\" you lie, hoping to find out more about the situation.", "result": "\"I don't know anything about a bull. Adonica told me to come here before she died,\" you lie, hoping to find out more about the situation.\n\n\"Damn those fools! I told them to take care of... things down there, I never told them to kill her! The bull was supposed to be brought here to me. Now I guess... Perhaps you could go back to Spain and collect it for me? I'll make it worth your while. You and I, we are good friends Michael, good friends. Do this favour for me, and I will pay you a lot of money,\" he says, and begins pulling wads of cash out of a box, throwing them onto the counter.", "action_results": [{"action": "\"Manuel and the Fireman, they both worked for you!\" you accuse him.", "result": "\"Manuel and the Fireman, they both worked for you!\" you accuse him.\n\n\"Everyone works for me,\" he angrily proclaims, \"them, you, Adonica, the others! I paid good money, and I expected good service. Then they said you worked for british intelligence. I didn't believe them, but they tried to take care of you. They tried to kill you - without my permission. I swear, Michael, we are good friends, you and I. I trust you Michael, don't you trust me anymore? Here, let me get you some more money to cover your expenses!\"\n\nHe reaches down behind the counter, for what may be another wad of cash.", "action_results": [{"action": "Is he going for a gun? Try to dive for cover!", "result": "He could be going for a gun! You dive for cover behind some shelves, just in time, as a gun goes off and a bullet smashes an artefact apart beside you!\n\nAs the gun goes off, the door to the shop suddenly bursts open, and six men rush in, guns blazing. Bruno shakes wildly as he is blown away, then collapses lifelessly to the floor.\n\nYou stand up, hands raised in surrendor in case someone is feeling trigger happy, but as you look at them, you recognise one of the men, and suddenly it all comes back to you! The training, the months of undercover work, leading up to your joining the smuggling ring. You are an agent of the British Intelligence services, and one of the men who just came in is your superior officer.\n\n\"Well done, Carlton,\" he says with a grin, while the other men round up Bruno.\n\nJack Carlton! That's your name! You know who you are!\n\nThe day ends back at headquarters, where you show them the diamonds, and tell them tales of your adventures in Spain. You recieve a medal, but of course, you will never be allowed to wear it or show anyone. After all, you are a secret agent, and as far as the government is concerned, you don't really exist.\n\nThey send you off on a holiday, with a nice big bonus, and after recovering, you return to London, ready for your next assignment.\n\nCongratulations!", "action_results": []}, {"action": "No, he wouldn't shoot me. He's going for money. Wait, and hope he gives a way more clues.", "result": "No, he wouldn't shoot me, you think. He thinks I've got amnesia, and he's just going for money. I'll wait, and hope he gives a way more clues.\n\nHowever, you are wrong. His hand comes up bearing a gun, and he fires it without a second thought.\n\nYour last thought is wondering what your real name was. You wish you had died at least knowing who you were.\n\nBetter luck next time!", "action_results": []}]}]}]}, {"action": "\"Yes, here they are,\" you say, and hand him the diamonds.", "result": "\"Yes, here they are,\" you say, and hand him the diamonds.\n\n\"Great! I knew someone would get them here eventually,\" he says, \"I'm so glad it was you, Michael. We're good friends, you and I.\"\n\nHe begins counting the diamonds excitedly, still talking, \"I'm sorry about Adonica, I know you were close. Those fools! I never told them to kill her, I just wanted to find out where she had put the diamonds!\"", "action_results": [null]}]}]}, {"action": "Call some antique dealers, using a nearby phone booth and directory.", "result": "You spend half an hour calling various antique dealers in the region, asking casual questions about selling spanish island artefacts. Not many seem interested in the bull, but two of them mention a shop called Bruno's Antiques. Apparently he might deal in such artefacts. They give you Bruno's phone number, but when you call, there is no answer. Luckily, you thought to grab an address off the second shopkeeper.\n\nThe store is only around a fifteen minute walk from the train station, so you set off to investigate.", "action_results": [null]}]}]}]}]}, {"action": "You decide you are probably better off not knowing what lies inside the statuette, and try to relax as you journey to London.", "result": "You put the statuette back in your pocket. You decide you are probably better off not knowing what lies inside the statuette, and try to relax on the journey to London.", "action_results": [null]}]}, {"action": "Plan to travel by bus to the nearest airport, and fly to London.", "result": "You use the money to purchase a bus ticket to the airport. As the bus pulls in front of the terminal, you notice a large number of police cars nearby. Policemen and obvious plainsclothes officers have converged on the airport.", "action_results": [{"action": "Try to slip past the hordes of policemen unnoticed, and purchase a plane ticket.", "result": "You step off the bus, amidst the other passengers, and try to walk past the police unnoticed, into the airport. Things go pretty well. You are able to purchase a ticket using the cash, but a nearby policeman looks at you twice. You suspect you had best hurry.\n\nAs you head for the airplane, you pass through a security checkpoint, where you are required to place all of your belongings through a scanner. Tension begins to build up inside you as you place the bull on the small conveyer belt, and watch it pass through the scanner.\n\nThe security guard's eyebrows raise as he looks at the monitor.\n\nHe says something to you in spanish.\n\n\"English?\" he asks you, \"Please step aside, señor.\"\n\nBetter luck next time!\n\nMore police gather to the scene, many of them holding printouts of your portrait. You are led to a small interrogation room, where you soon find yourself charged with smuggling Diamonds, hidden inside worthless artefacts, and put behind bars for a very, very long time. No friends step forward to identify you and rescue you. You manage to remember a few things as the years pass, but they are no help to you at all. For one thing you remember is that even inside the prison, your enemies can find you, and they do. You do not leave the prison alive.", "action_results": []}, null]}]}]}, {"action": "Take the gun", "result": "You decide a bit of protection is in order, and pick up the gun. You stuff it into your jacket pocket, then collect the other items: a key, an envelope full of cash, your wallet, and six passports.", "action_results": [null]}]}]}]}, null, {"action": "Wait for the policeman to come back out", "result": "You wait a few minutes, but he doesn't come back out. You feel the tension growing inside you. Perhaps you should do something...", "action_results": [null, null]}]}]}, {"action": "Change your mind, and head after the cop, Manuel de Cordoba", "result": "You have the feeling that you might have met him before the car 'accident', somewhere. Hurrying down the street, you look left and right at each intersection, trying to catch sight of him. Then you see him! Trying to remain casual and not attract attention, you slow down, and begin to follow him.\n\nHe walks the streets of Seneriquez for a while, and you begin to think he is walking quite aimlessly. In fact, around twenty minutes later, you swear you are walking down a street he had already walked along earlier. Then, quite suddenly, he slips through the door of a shop and disappears from sight!", "action_results": [null, null, null]}]}, null]}]}]}]}, {"action": "\"I told you, I have amnesia. I don't remember anything before waking up in this hospital,\" you tell him.", "result": "\"I told you, I have amnesia. I don't remember anything before waking up in this hospital,\" you tell him.\n\nHe grunts non-commitally, makes a few notes on his pad, then smiles again.\n\n\"That is all. We have your picture, if we work out who you are, we will let you know. Have a nice day,\" he says. With that, he leaves.", "action_results": [null]}]}, {"action": "\"I was in a car accident on the mountain road,\" you tell him.", "result": "\"I was in a car accident on the mountain road,\" you tell him. \"The car went off a cliff, but I fell out of the car before it went over. I must have hit my head on rocks and branches as I rolled down the hill.\"\n\nHis smile thins, \"So, you remember the car... Being in a car, and it went off a cliff, you say. How fortunate for you that you fell out of the car before it went over. You are a lucky man, señor.\"\n\n\"Tell me,\" he says, \"where were you going, in that car?\"", "action_results": [{"action": "\"I don't know. I don't remember anything before falling out of the car,\" you tell him.", "result": "\"I don't know. I don't remember anything before falling out of the car,\" you tell him.\n\n\"Good, señor... It is good that you fell out of the car... Before it went over the cliff,\" he says.\n\nSomething nags you in the back of your mind... Something about a policeman somewhere, but you can't work out what it was...\n\n\"The señorita who brought you here. What was her name? How did you know her?\" he asks, leaning down over you aggressively.", "action_results": [{"action": "\"Her name was Adonica,\" you tell him.", "result": "\"Her name was Adonica,\" you tell him, \"That's all I know.\"\n\n\"So, you never met her before the accident?\" he asks.\n\n\"No, I've never seen her before,\" you tell him.\n\n\"Yet she paid for your medical bills, hmm?\" his grins again, but there is no friendliness in his face.\n\n\"I didn't ask her to. She was just being nice to a penniless stranger,\" you say. His eyes squint down at you, his lips pressed thinly, then he smiles again and says, \"Do you have anything else to say? Anything that might help with my inquiries?\"", "action_results": [{"action": "\"No, I don't know anything else, Inspector,\" you tell him.", "result": "\"No, I don't know anything else, Inspector,\" you tell him.\n\nHe eyeballs you for a moment, then leans back and smiles. \"Thank you, señor, you have been most helpful. We have your picture, and if we work out who you are, we will let you know.\"\n\nWith that, the Inspector leaves.", "action_results": [null]}, {"action": "\"Actually, I think it might not have been an accident,\" you tell him.", "result": "\"Actually, I think it might not have been an accident,\" you tell him, \"Someone may have been trying to kill me!\"\n\nThe policeman's eyes widen, and he says, \"One moment.\"\n\nHe pulls a privacy curtain shut around your bed, \"Now we can talk without anyone else hearing. Speak freely.\"\n\nYou begin to tell him about how you felt drugged. You tell him how the road barried where the car had 'smashed' its way off the road and down the hill had looked like someone had just cut it open, rather than a car crashing through it.\n\nHe nods and makes notes, then suddenly his hand comes down over your mouth, pressing hard.\n\nIn your weak state, you struggle, but can not fight him! His other hand goes around your throat, squeezing tighter and tighter! You can't breathe!\n\nIn your final thoughts, you remember the policeman. You remember him saying, \"Time for a swim,\" as someone else injects you with something. You remember him putting you in the car and putting on the seatbelt.\n\nYou remember nothing more.", "action_results": []}]}, {"action": "\"I'm sorry, I don't know anything about the person who brought me here,\" you tell him.", "result": "\"I'm sorry, I don't know anything about the person who brought me here,\" you tell him.\n\n\"That is a pity,\" he says, looking a bit disgruntled, \"Thank you, señor, for your time.\"\n\nWith that, he leaves you.", "action_results": [null]}]}]}]}]}]}, null]}, null, null]}, null, null, null]}, null, null, null, null]}]}]}, {"action": "Start walking.", "result": "After a while of nothing but the roaring mountain wind, you decide to start wearily walking along the road. It has to lead somewhere, and any form of civilization would do.\n\nAfter an hour or so of walking along the mountain road, the stress and strain of your near death experience catches up with you. You stumble painfully to the ground, beside the road, draping an arm over the railing. Your vision blurs, and you slip into darkness.", "action_results": [null]}, {"action": "Examine the busted road barriers", "result": "Metal posts and railing lines the sea-facing side of the road. Here you can see where your car swerved off the road, crashing through the barrier, and down the hill. You look a bit closer at where the barrier is broken.\n\nThat's strange... There isn't any paint marks scratched off from the car onto the metal. On top of that, you realise there isn't any broken glass on the ground from shattered headlights. In fact, with growing concern, you realise that you can't see skid marks, or anything that would imply a 'crash' through the barrier. It almost looks like someone just cut a section of railing off, and bent the edges.\n\nOnce more, you wonder if your 'accident' was no accident at all.", "action_results": [null, null]}]}]}]}]}, null]}]}]}]}, null, null]}, null, null]}, null, null]}]}