{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=34193", "context": "", "first_story_block": "The symphonies of snoring and vigorous notebook writing fill your ears as you sit in class at Bridgeport High School.\n\n\nWhy can't this English class be over already? You think to yourself.\n\n\nSlowly, you pull out your phone and start checking your texts...\n\n\nHey! Do you want to go see Studio 5 tonight?\n\nIt's supposed to be an awesome movie! \n\nYour friend asks you.\n\n\nIs that the murder mystery? It sounds really good!\n\nI can't even imagine what it must feel like getting\n\nchased by a killer in real life!\n\nYou respond back.\n\n\nRING RING RING RING RING RING!!!\n\n\nThe sound of your high school's bell screams into your ears as you lift your head up from your cell phone. It looks like it's time to go home! You grab your belongings, throw everything into your backpack, and rush out of your classroom. \n\n\nFlooded in the halls are hundreds of students and faculty. You squeeze your way past the crowds to your locker and spin the lock for your combination. \n\n\n14-22-10...CLICK!\n\n\nYou swing the locker open and grab your books. Why does there have to be so much homework?! It's Friday!\n\n\nYou close the locker and make your tedious way down the stairs of the school to the exit. Outside, you see the same long row of six or seven school buses. Luckily for you, your home is walking distance from the school, so you don't have to deal with finding a seat or bullies. Although you do wish your parents would surprise you with a car. After all, your 16th birthday is coming up soon.\n\n\nYou follow the crowds out of the school grounds and cross the street. There are two paths you can take...\n\n\nThe Shortcut - Begin a new story\n\n\nAuthor's Note - Note from the author", "action_results": [{"action": "The Shortcut", "result": "You turn to take the shortcut through the woods. Surprisingly, not many people know about this shortcut. You stumbled upon it on accident while following a group of students that lived near you. The path remains pretty isolated for the most part.\n\n\nThe sound of cracking twigs and the wind hitting the trees becomes more apparent. The farther away you leave the school, the more silent with nature you get. \n\n\nSCREECH!\n\n\nThe sound of an animal's cry of pain fills your ears. You look around and don't see anything. You keep walking forward until you reach a cliff. Normally, you walk around the cliff and continue upwards. \n\n\nSCREECH!\n\n\nIt looks like the sound is coming from down below.\n\n\nImportant Choice: Do you risk climbing down the cliff to investigate the noise? OR Do you ignore the noise and continue your way home.\n\n\nYour decision will have consequences.", "action_results": [{"action": "Risk climbing down the cliff to investigate the noise.", "result": "You have made your decision. \n\n\nFor some reason, you feel different. You feel chills swing over your body, almost as if someone is watching you and your every move. You turn around. Nothing but the forest and trees. \n\n\nYou approach the cliff and see an old, wooden ladder. You've always been too afraid to approach the cliff, mostly due to your fear of heights. The ladder is fastened to the cliff, allowing for travel below. You grab on to it and slowly make your way down. Your hands begin to get sweaty at the climb. You must be several hundred feet in the air! Don't look down, don't look down, don't look down...you tell yourself.\n\n\nSCREECH!\n\n\nYou hear the sound of the animal's cries in pain. Your pace hastens as you continue your trek down the ladder. \n\n\nPOP...POP...POP...POP!!!!\n\n\nYou look up at the ladder. The weight of your body and backpack have caused it to unhinge! This old thing can't hold your weight much longer! Now what?! ", "action_results": [{"action": "Jump off the ladder!", "result": "\"Hyah!\" you scream as you jump off the ladder. You close your eyes. This must be the end. What a terrible way to go. You can see it in the newspapers now. \"Kid Jumps off old Ladder and Falls to Their Death\". Just as quickly, an eerie thought hits you in the face. What if everyone thinks you committed suicide? What if they don't find your body? What if you stay missing at the bottom of this cliff forever?!\n\n\nPLOSH!\n\n\nYou open your eyes. It looks like the drop down was only a couple feet. You smile and realize that you are safe. ", "action_results": [{"action": "The Bottom of the Cliff", "result": "SCREEEEECH!\n\n\nThe screeching sound gets louder and louder. You quickly turn around. The bottom of the cliff is pretty dark. You pull out your smart phone and slide the lock. Just as fast, you turn on the flash, revealing the darkness. \n\n\nThe bottom of the cliff feels more like a cave than anything else. You walk slowly, hoping that a bear didn't make its home down here. \n\n\nYou continue your way through the cliff until you come across...a fox?\n\n\nThe fox appears to be stuck. Its hind leg is trapped between two large rocks. You shine the light on the fox, revealing it's red eyes. It growls at you, but then painfully makes a screeching sound. You look down at the two rocks and see some blood. Perhaps the rocks fell from the cavern ceiling, pinning the fox's leg beneath it. You're not exactly a hunter or a fox trainer. Is it safe to free the fox from it's prison?\n\n\nImportant Choice: Do you move the two rocks and free the fox? OR Do you leave the fox to die and find a way out of the cavern?\n\n\nYour decision will have consequences.", "action_results": [{"action": "Move the two rocks and free the fox.", "result": "You have made your decision. \n\n\nYou grab one of the large rocks and push it aside with all your might. You can hear the fox wincing in pain, but it's no longer screeching. You grab the other rock and forcefully move it aside. The fox gets up and begins licking its paws, still crying in pain. \n\n\nFinally, the fox looks up at you and then turns to scurry away. \n\n\nYou exhale in relief that the fox is okay and didn't attack you. ", "action_results": [{"action": "The Way Out", "result": "You continue your way down the cavern. As you take each step, you fear that you may never see the sun ever again. \n\n\nYou shine your phone's flash on the ground and see a fork in the path. You try to investigate for signs and see one:\n\n\nDANGER!\n\nRight Path is Unstable\n\n\nWhich way do you go?", "action_results": [{"action": "Left Path", "result": "You make your way down the left path of the cave. The further you walk, the less dark it gets. It looks like you're finally reaching an exit! \n\n\nThe sun beats down on your face. You leave the cavern and realize that you have no clue where you are. You pull out your phone and enter the GPS app. Unfortunately, you don't have any reception from where you are. Better check later...\n\n\nYou start heading forward, trying to think where the cavern could've taken you in comparison to where you climbed down. You walk around the cavern opening and realize that there's way to many trees to see anything from above. \n\n\nYou continue forward, hoping you stumble home...", "action_results": [{"action": "Continue", "result": "You make your walk through the forest. Pulling out your phone, you look at the time, 4:15 PM. The bell at school rang exactly 1 hour ago. You've been traveling through this shortcut for 1 hour. If you just would have taken the long way home, you wouldn't be in this mess. \n\n\n\"Please don't do this! Please!\" \n\n\nYou hear the sound of a girl. You start running forward and come across a large boulder. From the opposite side of the boulder, you see the girl. Her wrists are bound. You can see a figure above her. The figure appears to be wearing a clown mask. \n\n\n\"I'll do anything you want, please don't kill me!\"\n\n\nThe clown mask figure grabs a long machete from his pocket and playfully wraps it around the girl's neck. You can hear the girl whimper in pain. \n\n\nImportant Choice: Do you risk trying to save the girl from the clown? OR Do you wait to see what happens?\n\n\nYour decision will have consequences.", "action_results": [{"action": "Risk trying to save the girl from the clown.", "result": "You have made your decision.\n\n\nCan this day get any worse?! First you lose your way home, and now you're about to fight a serial killer clown! \n\n\nYou look around nervously for something to fight with. The closest thing thing to you is a large rock. With one swift breath, you get up from hiding.\n\n\n\"Take that, you evil clown!\"\n\n\n\"What are you doing?!\" the girl turns around and screams at you.\n\n\nYou ram the rock into the clown's head. The clown falls backwards on to the grass. With all your might, you jump on top of the clown. You turn to the girl. \"Run away now!\"\n\n\nThe girl doesn't run away. She grabs you and pushes you off the clown. \n\n\n\"You psycho! That clown isn't trying to kill me!\" \n\n\nThe clown gets up and takes his mask off. It's just a normal guy. \n\n\nYou look at the two people very confusingly. \"Then what's happening?\" \n\n\nThe bound girl and masked clown guy look at each other. \"We're - we're role playing.\" \n\n\nAnd YOU'RE the psycho. \"Who role plays a serial killer clown kidnapping in the middle of the forest?!\"\n\n\nThe couple looks at you menacingly. \"Just stay away from us.\" They run away towards the cavern. \n\n\nYou look around and notice that the clown guy dropped his machete. Should you take it? \n\n\nTip: Click on the machete to take it. It will get added to your inventory. You do not have to click on the machete to take it if you don't want to. The decision is yours.", "action_results": [null, {"action": "The Off Beaten Path", "result": "The more you walk down the forest path, the less confident you feel about which direction you're going. You pull your phone out and check for a signal...still nothing.\n\n\nSNAP!\n\n\nYou turn around at the sound of a crack. What was that? Is someone following you? Is it that creepy couple again? \n\n\nYou turn back around and continue your way through the forest. Eventually, you reach a sign. The sign is wooden and very old. You doubt that anyone has seen this sign in a while. \n\n\nNatural Springs ---->\n\n\nThe sign would seem pretty normal...if there wasn't a hand print of blood on it! You're unsure about what to do. ", "action_results": [{"action": "Examine the Sign Further", "result": "You walk forward and look at the sign from a closer perspective. The hand print of blood looks old, as if someone left their mark here months ago. You look down at the floor and see a crumpled up flyer. \n\n\nYou pick up the flyer and read what it says. Apparently, it's dated over a year ago: \n\n\n\"Mother and Son Tragically Killed in Accident\"\n\n\nJoshua Matthews, 16 year old boy, and Christina Matthews, 35 year old mother, tragically died in a car accident last Saturday. According to witnesses on the scene, Joshua was driving the car. They lost control after swerving to miss a deer. The car pushed through a fence and flew off the Bridgeport Canyon. Witnesses say the explosion was so loud, they could hear it from miles away. The bodies of Christina and Joshua have not been recovered.\"\n\n\nClue Discovered!", "action_results": [null]}, {"action": "Follow the Sign", "result": "You decide to follow the sign. A couple minutes pass. You were not ready to walk in this forest today. Sporting jeans and a t-shirt, you couldn't feel more hot. The thought of ripping your jeans into shorts crosses your mind. You just really need water. Unlucky for you, you were so quick to leave school, you forgot to fill your water bottle. You suddenly begin to hear the sound of rapid water. You've made it to the springs! \n\n\nYou see one large body of water. There's a waterfall and cliff protruding high up above. You remember seeing on survival TV shows that spring water like this is safe to drink. Then again, you also remember some people getting sick of dysentery or worse... In fear of getting your clothes wet, you make your way to a more stagnant part of the spring. \n\n\nImportant Choice: Do you risk drinking the spring water? OR Do you hold off drinking the spring water. \n\n\nYour decision will have consequences.", "action_results": [{"action": "Risk drinking the spring water.", "result": "You have made your decision.\n\n\nYou drop down on your knees. You edge forward beside the spring and drink the water. The cold splash of water tickles down your throat. You feel invigorated to finally have something to drink. You wash your face and hands. Eventually, you get up. \n\n\nIt's time to find a way out of here. You think to yourself.\n\n\nHopefully that spring water won't come back to bite you later...", "action_results": [{"action": "The RV", "result": "You make your way past the springs. You can only hope that you are going the right way. \n\n\nGlancing at your watch, you notice the time - 4:50. It's been almost two hours since the final bell rang.\n\n\nAs you make your way down the forest, your eyes widen in surprise: A big, white RV? \n\n\nThe RV looks pretty old. As if it hadn't been driven in a long time. The front of the RV is completely smashed. Maybe someone drove down here and crashed it here on accident. You don't see any roads though. Rust and ivy cover most of the dilapidated vehicle. \n\n\nPerhaps someone lives there...maybe they can get you out of here!\n\n\nImportant Decision: Do you knock on the RV door to see if anyone is home? OR Do you hide and wait around to see if anyone comes back?", "action_results": [{"action": "Knock on the RV Door", "result": "You have made your decision.\n\n\nYou decide to knock on the RV door. After all, what if it's just a friendly hippie that lives out here and happens to know the way out? \n\n\nKNOCK KNOCK KNOCK!\n\n\nYou pound your fist on the RV door and wait for a response. \n\n\n\"Hello?\" you shout. \n\n\nNo response. You look around at the windows of the RV. Each of them have their curtains covered. You try to open the RV door, but find it locked. If you have a sharp enough object, you may be able to get inside.", "action_results": [{"action": "Look for an alternate way inside the RV", "result": "You walk around the side of the RV and notice a slightly open window. You may be able to squeeze through it if you try hard enough. You put your backpack down and start climbing through. Pushing slowly, you make your way inside the enclosed space. After a couple minutes, you successfully slide inside the RV!\n\n\nAs you go to close the window, a metal piece scratches your arm. The wound starts bleeding immediately. You try to put your hand over the wound, but no use. Blood is dripping everywhere. ", "action_results": [{"action": "Inside the RV", "result": "You find yourself in the main room of the RV. The driver and passenger seats are near the east side of the car. They seem archaic, as if no one has driven this vehicle in years. The far west side of the RV has a bathroom, a bedroom, and a full kitchen and table. ", "action_results": [{"action": "Examine the table", "result": "You walk up to the table. It's made of a cheap, white plastic. You see several red stains on it. Could it be...blood?\n\n\nOn the chairs below the table, you see duct tape, rope, and some gloves. \n\n\nYou suddenly feel very worried.", "action_results": [null]}, {"action": "Examine the kitchen", "result": "You approach the kitchen. Across from the table, the kitchen is pretty small. You notice a sink, a medium sized fridge, a microwave, and some drawers.\n\n\nYou look inside the sink and see several dirty knives and forks. You pick them up and see specks of red on them. You put them back and look in the drawers.\n\n\nMost of the drawers contain spices. \n\n\nYou decide to look inside the fridge. You see several zip lock bags of food. You can't distinguish what the food is. You decide to pull a bag out. Upon further inspection, you discover several human fingers inside the bag! Crap! What is this place?! \n\n\nYou put the bag back in the fridge and slam it shut.", "action_results": [null]}, {"action": "Examine the bedroom", "result": "You walk over to the bedroom and open the door. Just a single bed in the center of the room with two nightstands. The bed has a folder on top of it. \n\n\nYou pick up the folder and open it, revealing the contents. \n\n\n\"Patient #34 Log\n\nThe starvation test begins today! I have replaced the food rations with spoiled counterparts to see how the veterans will react. So far, they are all acting very angry and hungry. They have become more violent, reverting back to their war-torn selves. We'll see how much longer they can last. I intend on going as long as possible before I replace the food again.\n\n\nYou see a newspaper article:\n\n\n\"Missing Boy's Arm Found in Canyon!\n\nMissing person, Joshua Matthews, has been found at the bottom of the Bridgeport Canyon. His char burned arm was discovered several hundred feet away from the car. There are still no signs of Christina, Joshua's mother. Daniel Matthews, the father, was committed to the Bridgeport Sanitarium for major post traumatic stress issues after coming home from the war.\"\n\n\nYou're not sure what all this means, but you're scared. You put all the information away and leave the bedroom.\n\n\nClue Discovered!", "action_results": [null]}, {"action": "Examine the bathroom", "result": "You go inside the bathroom. It's pretty small: just a toilet, shower and sink. Besides the putrid smell of feces, you don't notice much of anything else. ", "action_results": [null]}, {"action": "Leave the RV", "result": "This was a mistake. You shouldn't have been in this RV. You walk over to the door to leave.\n\n\nCLICK!\n\n\nYou hear the sound of the door rattling. Uh oh! It looks like the killer is back!\n\n\nYou're going to have to hide!", "action_results": [{"action": "Hide in the Bedroom", "result": "Quickly, you dash to the bedroom door and hide inside. You crawl under the bed and stare at the door. The cracks beneath the door are large enough that you can see what's going on from the other room. \n\n\nBANG!\n\n\nThe RV door swings open. You see the boots of a large man, followed by the shoes of a girl. \n\n\n\"HELP! SOMEONE HELP ME!\" \n\n\nThe girl's scream sounds very familiar. It then hits you...the girl is the one from earlier. Where's her boyfriend?\n\n\n\"SIT!\"\n\n\nThe booted man throws the girl into a chair. He grabs duct tape and ties her to the seat. \n\n\n\"HELP ME!\"\n\n\n\"Do you want me to cook your tongue for lunch?\"\n\n\nThe girl becomes quiet and starts crying. \n\n\n\"Good girl.\"", "action_results": [{"action": "Blood Trail", "result": "The boots stop in front of the bedroom door. \"Someone's been in here.\" He opens the bedroom door. You hold your breath at the sound. \n\n\nThe boots get closer and closer to the bed. \"The blood breadcrumbs trail ends here.\"\n\n\nOh no! Your arm was bleeding and left a trail!\n\n\nYou keep your breath still as quiet as possible. ", "action_results": [{"action": "What's for Lunch", "result": "\"You keep your breath held in, hoping that you don't get caught by the killer. That is, until he looks down below the bed.\n\n\n\"Ah ha!\"\n\n\nYou see a masked face of the killer. He pulls you by the hair and gets you out from under the bed. \n\n\n\"Stop!\" you plead with the killer. He laughs and drags you across the floor. \n\n\nYou try to wriggle and fight, but it's no use. The killer sits you on the chair and duct tapes you as well. \n\n\n\"Now I have two lunch guests with me today.\"\n\n\n\"Please! You don't have to do this!\" \n\n\nThe killer looks at the girl and slaps her in the face. \"Only I get to talk.\"\n\n\nThe killer turns around and opens the fridge. \"I hope you like fingers!\"\n\n\nHe grabs a pot from under a cabinet and starts boiling the bag of fingers. The girl across from you starts crying harder. You try to remain calm, but it's no use. \n\n\n\"Hm, hmm, hmmm!\" the killer begins humming a song. You slowly start to shiver. \n\n\nAfter a couple minutes, the killer grabs a chair and sits next to the both of you. \n\n\nBAM!\n\n\nThe killer pounds his fist on the table, making you both jump out of your seats, that is, if you could jump out of your seats. \n\n\n\"Why are you in my RV?\" the killer asks as he looks at you. You can see his delirious face.\n\n\n\"I'm lost! I'm just trying to get home!\" \n\n\nThe killer looks at you and laughs. He then smiles and pulls a knife out from under the table.\n\n\n\"WRONG!\"\n\n\nHe slices one of the girl's fingers clean off. \n\n\nShe shouts out in pain, but the killer covers her mouth. \"That's going to be delicious!\" \n\n\nHe drops the finger in the pot. \n\n\nYou look at the killer with eyes of complete fear and anger. You need to get out of here. A few more minutes pass, and the killer turns off the pot. \n\n\n\"Lunch is ready!\" he grabs several plates and puts one finger on each one. He walks over to the both of you. \n\n\n\"Ah, where are my manners!\" He grabs several dirty forks from his sink and places them next to the both of you. \n\n\n\"Buon appetite!\" \n\n\nHe grabs a fork and takes a bite of the finger. He crunches it down and swallows it. He then looks at the girl. \"Now it's your turn.\" \n\n\nThe girl screams and cries, but it's no use. He grabs a fork, stabs the finger, and slides it in her mouth. \"Eat up!\"\n\n\nShe spits out the finger and keeps screaming. \n\n\n\"Now that's not very nice.\"\n\n\nHe slaps the girl again, this time knocking her unconscious.\n\n\n\"Let's see if your manners are better.\"\n\n\nThe killer grabs a finger and puts it in your mouth. The finger is soft and the texture is edible enough to swallow, despite how disgusting it is. In fear of getting killed, you eat it. \n\n\n\"Good! Now was that so bad?\" The killer gets up and walks to the bathroom. \"I need to use the room. When I get back, you'll LOVE dessert!\"\n\n\nWhen the killer is gone, you panic. Now what?! You have very little time to escape. ", "action_results": [{"action": "Wait around", "result": "With nothing to help you, you're pretty much useless. \n\n\nBANG!\n\n\nThe door to the RV swings open. You see the clown guy, machete in hand. \n\n\n\"Oh my gosh, Elizabeth!\" the guy runs to her and unties her binds. \n\n\n\"Charlie! You came to save me!\" she whispers. \n\n\nYou look at them and plead. \"Wait! Help me!\"\n\n\nCharlie looks at you and nods. \"We'll help you out.\" He grabs his machete and releases you from the duct tape.\n\n\nThe three of you escape the RV. As you're walking out, Charlie stumbles forward. \"Ahh - my side!\"\n\n\n\"What's wrong?\" Elizabeth screams. \n\n\n\"That killer stabbed me in the ribs.\"\n\n\nCharlie looks at you and then hands you his keys. \"Take my car keys and drive the car here. We can escape that way!\"\n\n\nYou see the car, several hundred feet away from the RV. You anxiously gulp and make your way to the car. When you get to the car, you put the keys into the ignition start it. You drive the car over to the RV. When you get there, the two are nowhere to be seen. You look inside the RV. The killer is gone!\n\n\nWhere did they all go?", "action_results": [{"action": "Now what?!", "result": "You find yourself standing outside the Killer's RV. Charlie's car is still running behind you. Where did they all go? They couldn't have gone far.", "action_results": [{"action": "Investigate the Camp Site", "result": "The campsite is relatively small. The Killer's RV stands in the far east corner. Charlie's car is also there as well. A picnic table and chairs are on the west corner. A metal garbage can stands in between these two corners. ", "action_results": [{"action": "Examine the Picnic Area", "result": "You approach the picnic area. It's pretty old and rusty. The picnic table is also the home to a beehive. Better be careful for that...", "action_results": [null]}, {"action": "Examine the RV", "result": "You don't want to go inside the killer's RV. You make your way along the sides of the RV and notice a secret compartment. You pull the compartment open. The smell of rotting flesh hits your nose.\n\n\n\"What the hell is that?!\" you scream. \n\n\nA body flies out of the RV's compartment. It appears to be the body of a man. The man is wearing a lanyard on his neck. Upon further inspection, you read the badge:\n\n\nDr. Craig Wilson\n\nPsychologist\n\n\n\nDid the killer kill his psychologist? There's something really sinister about all this.\n\n\nClue Discovered!", "action_results": [null]}, {"action": "Examine Charlie's Car", "result": "You sit inside Charlie's car. The car seems to have half a tank of gas left. \"Well, when I find Charlie and Elizabeth, we can definitely escape with their car.\" you tell yourself.\n\n\nYou decide to do some snooping. Apparently, Charlie and Elizabeth are both students at your town's community college. You don't see much else of anything to use. You turn the car off and take the keys with you.", "action_results": [null]}, {"action": "Examine the Trash Can", "result": "You examine the trash can. The can itself has various junk inside it. As you step near it, you feel hollow ground. \n\n\nYou push the can out of the way to discover...a secret passageway? Maybe the killer escaped through here!", "action_results": [{"action": "Go through the secret passageway.", "result": "You start making your way down the passage. When you get to the bottom, you land on a metallic floor. The area around you is dark. Is this a war bunker? \n\n\nYou shine your phone's flash on the area. The time - 5:45. Almost 3 hours until the final bell rang.\n\n\nYou continue making your way down the passageway. The hall is made of concrete. Whoever made this place was obviously keeping the outside out. \n\n\nEventually, you make your way to a large window. You glance at the window, but see nothing.", "action_results": [{"action": "Continue down the hall", "result": "Suddenly, a light comes on from the window in the next room. You see Charlie and Elizabeth, both tied up to operating tables. They both awaken and start screaming for help.\n\n\nIn front of you is a mechanical operation board. You then hear a speaker go off. \"Hello. Since you have all decided to play with me instead of having lunch, I have decided to play with you. In front of you, your friends are tied to my operating tables. On the ceiling...\"\n\n\nYou suddenly see large rows of sharp blades from above. \n\n\n\"You must choose who will suffer the fate of my blades. The person you choose will slowly get their limbs chopped so they can feel all the pain.\"\n\n\nYou shudder at the thought of having your body slowly chopped like that.\n\n\n\"Help!\" you hear Elizabeth scream from the table.\n\n\n\"Make your choice wisely.\"\n\n\nThe knives begin to slowly go down on Elizabeth and Charlie. If you don't decide fast, they'll both be chopped!", "action_results": [{"action": "Your stomach feels strange...", "result": "You feel your stomach churning in pain. Suddenly, the thought of you drinking the spring water hits you in the face. You feel your vision get blurry. Before you can do anything, you fall to the floor.\n\n\nThe last thing you hear before passing out is the screams of Charlie and Elizabeth.", "action_results": [{"action": "Wake Up from Passing Out", "result": "\"Ughhhh.\" you wake up on the floor of the window room. It looks like you passed out from poisoning of the spring water. \n\n\nYou get up and look at the window. The site is so gruesome, you start puking on the ground next to the window. \n\n\nThe knives from above have cut through Elizabeth's body cleanly. Each limb has been completely separated perfectly. \n\n\nCharlie, on the other hand, isn't so lucky. Due to his clown costume, the knives only partially cut his lower torso, leaving him in a half conscious state. You watch him convulse and die from blood loss.\n\n\n\"No! Why did this have to happen?! Why did I drink the spring water?!\" \n\n\nYou cry out for the couple. If only you could go back and save them...\n\n\nYou get up, with some difficulty, and keep moving forward to the next room.", "action_results": [{"action": "The Next Hallway", "result": "You walk into the next hallway of the bunker. The more you make your way down, the more you scared you get. \n\n\nWalking into the next room, you try to feel for a light switch. \n\n\n\nCLICK!\n\n\nThe sound of luminescent lights fill the room. It looks like some kind of office. You see a desk at one corner of the room and a book shelf on the other. You see a door near the opposite end of the office.", "action_results": [{"action": "Examine the Desk", "result": "You make your way over to the old desk. By the looks of it, it's pretty dusty. You sit down on the chair next to the desk. \n\n\nPLOP!\n\n\nThe chair breaks its hinges, causing you to come crashing down on the floor. As you're getting up, you spot several sheets of paper under the desk - \n\n\n\"Diary Entry #102: It was all supposed to be a Psychological Test. You know, like the Stanford Prison Experiment? Philip Zimbardo ring a bell? We tested veterans and PTSD, trying to find what triggers their issues. This War Bunker was designed to have fearful objects to test different scenarios, such as the operating tables, torture devices, and limited rations. We had a psychologist pretend to be a veteran to make sure that nothing got too out of hand...\n\n\n\nWe were testing the starvation experiment. The veterans were getting desperate. We were just about to end everything when...the men...they grabbed the psychologist, knocked him unconscious...and chopped him with the knives. They proceeded to eat his flesh. It was then that we realized that all of these veterans were too dangerous to be in the outside world. We locked the bunker and told the sanitarium that the test subjects had escaped. It was us all along. We did this to those men, to that poor psychologist. \n\n\nClue Discovered!", "action_results": [null]}, {"action": "Examine the Book Shelf", "result": "You make your way to the old book shelf. Each of the shelves have various, dusty old books. It would take forever trying to search through all of them. As you walk away from the shelf, a book falls from the floor. You pick it up, and out drops a locket?\n\n\nYou pick up the locket and look at it. The outside has a rose on it. Encrusted in the inside is a picture of a woman with a message. \"I love you, Daniel. Please come home safe. -Christina\"\n\n\nClue Discovered!", "action_results": [null, null]}, {"action": "Go through the other Door", "result": "You decide to walk over to the door across from the entrance. You open it with ease and walk inside. The dark room turns out to be a staircase leading up to something. You climb the stairs, hoping the exit will be at the top soon enough. \n\n\nOnce you get to the last step, you approach a hatch. You push open the hatch and climb out. ", "action_results": [{"action": "The Cavern", "result": "You find yourself inside the cavern that you saw from the beginning of your walk. You out and see the rusty ladder. \n\n\nMaybe you can climb the ladder and escape! Who cares how rusty it is! \n\n\nBefore you can do anything, a hand grabs you. You lose consciousness.", "action_results": [{"action": "The Forest Fire", "result": "You wake up in a mysterious cot. It looks like you're back inside the cavern. Your hands and feet are bound. You see a lantern several feet away from you. \n\n\nQuickly, you make your way to the lantern, only to be stopped by several chains on your legs. It looks like whoever knocked you out obviously wanted to make sure you weren't going anywhere. Just as quickly, your chains knock the lantern over, causing the cot to catch on fire! \n\n\nYou try to scream and shout for help, but no use. \n\n\nSquinting your eyes, you manage to see a key on the wall. You try to kick the wall. The key wiggles. You kick the hollow, stone wall again and the key falls. Unfortunately, it's way too far away from you.", "action_results": [{"action": "Fox For the Win!", "result": "\"Ahoooooo!\" \n\n\nYou see the fox that you saved earlier jump out at your. It's wagging its tail. Maybe it's feeling better. \n\n\n\"Hey there, little fella! Can you grab me that key over there?\"\n\n\nThe fox looks at you and tilts its head. It looks at the key and makes itself towards it. Grabbing the key with its teeth, it picks the key up and drops it in front of you.\n\n\n\"Good fox!\" you tell the creature as you pet its head.\n\n\nThe fox lays down next to you. \n\n\nYou untie your bonds and chains and quickly get up from the cavern. ", "action_results": [{"action": "The Outer Cavern", "result": "You make your way to the outer cavern. You keep walking forward until you see the RV again. You see Charlie's car.\n\n\nQuickly you make your way to the car. You unlock the door and put your keys in the ignition.\n\n\n\"Where do you think you're going?\"\n\n\nYou hear the killer from the backseat. You suddenly feel your neck being choked to death. You can't do much, except barely move your hands. ", "action_results": [{"action": "Press on the accelerator!", "result": "With all the power and might you have, you slam your foot on the accelerator. The car goes rushing forward. Instead of steering, you go a full, whooping, 50 miles into a tree. Your airbag immediately goes out. \n\n\nYou get out of the car completely fine. The killer on the other hand, is dead. You walk inside the car and see several gashing head wounds. \n\n\nYou're secretly glad that the killer is finally no longer a threat, but you feel as though the situation could've been handled differently.\n\n\nYou make your way to the path.", "action_results": [{"action": "Continue", "result": "When you get back on to the road, you sit there thinking about everything that's happened today. It was supposed to be just a simple walk home. None of this was supposed to happen.\n\n\nYou continue your walk down the road. Eventually, you reach a spot that has cellular reception. You call the police. Several fire trucks, ambulances, and police trucks make their way to your location. You are given fire blankets for support. Major news outlets come out and start reporting on the incident. They want to hear your story on what happened, but you refuse to tell them the story. \n\n\nEventually, the police come up to you. \"Can you tell us where this killer is?\"\n\n\nYou nod your head. \"Yes, he's over here in Charlie's car.\" \n\n\nThe police follow you to Charlie's car. As you walk over there, you stumble a few times. Eventually, you make it there. You gape your mouth open. \n\n\nThe killer...he's gone...\n\n\nThe police schedule a massive search team for the killer that same night. After several hours, no sign. \n\n\nAfter all this, you just wish you had some closure. Maybe if you would've done things differently. You don't know anymore...You wish you could've saved Charlie and Elizabeth. It's just not fair. You feel so lucky to be safe...and that's what matters.", "action_results": [{"action": "Choices", "result": "Welcome to the Choices Section\n\nHere you can see hints of what choices you made.\n\nYou will also find your collection of clues.\n\n\n\nClues Found: 0 of 7\n\n\nNumber 1 : Yes, you did that decision.\n\nNumber 0 : No, you did not agree to this decision/you did not do this.\n\n\n1. The Mysterious Sound 1 of 1. \n\nDid you go and investigate the mysterious sound below the cavern?\n\n\n2. In Balance With Nature 1 of 1.\n\nDid you save the injured fox?\n\n\n3. The Clown 1 of 1\n\nDid you stop the masked clown?\n\n\n4. The Unclean Spring Water 0 of 1\n\nDid you hold off on drinking the spring water?\n\n\n5. You're My Hero 0 of 1\n\nDid you escape the killer's RV with the girl?\n\n\n6. It's a trap! 4 of 4\n\nDid you save both Charlie AND Elizabeth from their gruesome fate?\n\n\n7. Ensure your safety. 0 of 1\n\nTo stay safe, you lied to the killer and said you weren't going to the police.\n\n\n8. Mystery Solved. 0 of 1.\n\nYou found all the clues and discovered the killer's secret.\n\n\nThanks for playing! Feel free to leave a comment and tell us which choices you made! ", "action_results": []}]}]}]}]}]}]}]}]}]}]}]}]}, null]}]}]}]}]}]}]}]}]}]}]}, {"action": "Hide and wait around to see if anyone comes back", "result": "You decide to hide around and wait until anyone arrives. A few moments later, you see a large figure in large black boots. He appears to be holding on to the girl that you saw earlier today. She's screaming for help!", "action_results": [{"action": "Wait a little longer.", "result": "How are you going to do anything if you can't defend yourself? \n\n\n\"Elizabeth!\" you hear the costume clown guy from the distance. \n\n\nThe figure stops and throws Elizabeth on the ground. \"Charlie! No! He's going to kill you!\"\n\n\nThe clown costume guy grabs his machete and stabs the figure. Angered, the figure stabs Charlie back, and then runs inside the RV. \n\n\nYou run up to the two of them. The girl looks up at you in surprise. \"You have to help us!\"\n\n\n\"I don't think that killer is done yet.\" you hear Charlie say from the ground.\n\n\n\"Charlie! Are you okay?!\"  \n\n\n\"No...the killer stabbed me in the ribs.\" Charlie coughs up blood. He looks at you and hands you his car keys. \"Please...take these keys and get the car over there.\" He points to his car several hundred feet away. \n\n\n\"I'll stay here with Charlie.\" you hear the girl say.\n\n\n\"No Elizabeth! Go with them!\" Charlie responds. \n\n\n\"I'm not going anywhere without you.\"\n\n\nYou start making your way to the car. You put the keys into the ignition and drive to the RV. When you get back; however, there's no one to be seen. You make your way into the RV. Nothing. \n\n\nWhere did they all go?", "action_results": [null]}]}]}]}, {"action": "Hold off drinking the spring water.", "result": "You have made your decision.\n\n\nIf that spring water has parasites or other unclean chemicals, that could mean a really bad sickness later...or worse. You decide to stay safe and not drink the water. \n\n\nYou pull out your empty, plastic water bottle from your backpack. Slowly, you fill the water into the bottle. If you manage to find something hot, you can boil the water and clean out anything bad. \n\n\nTime to figure out a way out of here.", "action_results": [null, null]}]}, {"action": "Don't Follow the Sign", "result": "You look around, trees all over. The path to the Springs seems like the only logical place to go. If you go through these trees, you may be even more lost than you are now. Maybe it's best to follow the sign...", "action_results": [null]}]}]}, {"action": "Wait to see what happens.", "result": "You have made your choice.\n\n\nYou don't have a single chance against a clown with a machete. You crouch down and hope that something can happen.\n\n\n\"Please! I beg of you! HELP SOMEBODY HELP!\"\n\n\nThe clown grabs the mouth of the girl with his bare hands. She screams in his palm but you can't hear her. You turn around and close your eyes, hoping this could all end quickly. \n\n\n\"Get your clown tongue in my mouth right now!\"\n\n\nYou open your eyes. What just happened? You turn around and see the girl. She's still tied up. The clown guy is on the ground, his mask is still on. They appear to be making out. \n\n\n\"How did you like this little sexcapade? Don't you just love role playing?\" you hear the girl say to the clown. She takes the clown's mask off, revealing a teenage guy. He nods and continues making out with the girl.\n\n\nSo this wasn't a real serial killer clown? Something's up...\n\n\nYou walk around the boulder and approach the couple. \"Excuse me...is everything okay over here\"\n\n\nThe girl looks up at you. \"Oh my God! It's a pervert! Were you watching us?!\"\n\n\nYou look at the girl in disbelief. \"I thought you were going to die!\" \n\n\nThe clown guy takes his mask off. \"Yeah, everything's fine. We're just...role playing.\" \n\n\nYou look at the couple in disbelief. Who role plays a serial killer clown kidnapping in the middle of the forest?! \n\n\n\"It's about time we start leaving anyway, right honey?\" the clown suggests.\n\n\n\"Yeah, I don't want any pervs watching us.\" the girl gives you a menacing look. They both get up and start heading back towards the way you came.\n\n\nYou're still in disbelief at what just happened. You take a deep breath and continue your way home...you hope...", "action_results": [null]}]}]}, {"action": "Right Path", "result": "You ignore the sign and push forward, hoping that it might just be old or something. As you make your way down the cavern, you see a light shrouded in darkness.\n\n\nWhat is a light doing in the middle of this cavern? You think to yourself.\n\n\nYou follow the light and finally get to it. It's a gasoline lamp. You turn the corner where the light is and notice that you are in some kind of bedroom. \n\n\nIn one corner of the room is a cot on the floor. Beside the cot is a fire with a cooking pit above it. You see several newspapers and toilet paper on another side. Next to the lantern, you see a crumpled piece of paper. \n\n\nYou unfold it and realize that it is a newspaper clipping. \"Killer Escaped From Sanitarium\" The article is too old to read. Could the killer be living here? \n\n\nYou shudder and decide to make your way back to the left path.\n\n\nClue Discovered!", "action_results": [null]}]}]}, {"action": "Leave the fox to die and find a way out of the cavern.", "result": "You have made your decision. \n\n\nYou look down at the big rocks. If this fox gets free, surely it will attack you and rip your face off. Better to just let it die. \n\n\nYou give the fox one last look. It stares into your eyes, pleading for help. Better safe than sorry. \n\n\nYou continue your way down the cavern.", "action_results": [null]}]}]}, {"action": "Continue your pace down the ladder", "result": "POP...POP...POP!\n\n\nThe screws on the ladder begin to fall off, almost hitting you in the face. You slowly and cautiously continue your way down the ladder.\n\n\nPLOSH!\n\n\nLuckily for you, your feet hit the grass at the bottom of the cliff. You look up and notice that the ladder is definitely not going to be your way back up.", "action_results": [null]}]}, {"action": "Ignore the noise and continue your way home.", "result": "You have made your decision.\n\n\nSCREECH!\n\n\nThat screech is way too scary to investigate. What if it's bear? Or what if it's a mythical creature like Bigfoot? \n\n\nYou turn around and cross your arms. What's worse, that ladder looks way too old to support your weight. It's time to get home. You make your way back to the path, hoping that you'll get home soon. \n\n\nA couple minutes pass, and you find yourself still walking along the valley. \n\n\nPLOP!\n\n\nAre you serious?! You look at your shoulder and see a large wad of bird poop! This seriously can't be happening right now. You take off your backpack and look inside it for some tissues. Looks like you forgot your tissues at home. \n\n\nYou pick your backpack back up. \n\n\nSNAG!\n\n\nYour backpack gets stuck on a tree branch! You pull it with all your might. Not budging. First the bird poop and now this?! \n\n\nYou pull harder and finally the back pack goes free...that is, until you lose your balance. \n\n\n\"Woah!\"\n\n\nYou fall backwards and start tumbling down the valley. You try to grab branches of trees or anything, but it's no use. Finally, you land at the bottom. You cough out some leaves and get up. You look at your body, realizing that you could pass for a hobo or a zombie. You look around and notice the opening to the cavern. You're definitely NOT going in there.\n\n\nYou turn around and pull out your phone to check the GPS app. No reception?! Are you serious?! You put your phone away and follow the trail, hoping you'll stumble home soon.", "action_results": [null]}]}, {"action": "Author's Note", "result": "Welcome to \"The Shortcut Home\", the newest and latest story from me, AppDude27.\n\n\nThank you for taking the time to play this storygame! I would appreicate it if you could leave a rating and comment after your experience. Any feedback will help me a lot!\n\n\nBefore you begin your walk home from school, I must let you know that there are several branching paths that you can take. Every choice that you make, even the smallest, will have consequences. (This includes social, physical, grabbing or not grabbing items, and even which way you go.)\n\n\nSome tips:\n\n\n- You don't have to grab every item you come across. It's entirely up to you.\n\n- Try to make honest decisions, it will make the story much more meaningful to you.\n\n- Very important choices in the game will look like this. Those choices will change the course of the story. Any choices that are not blue will still change the story, as well, but not with as much gravity as the blue choices. \n\n\n\nThere are several endings to this story. There is also a \"Secret Ending\", depending on your choices...and if you survive...", "action_results": [{"action": "Continue", "result": "The symphonies of snoring and vigorous notebook writing fill your ears as you sit in class at Bridgeport High School.\n\n\nWhy can't this English class be over already? You think to yourself.\n\n\nSlowly, you pull out your phone and start checking your texts...\n\n\nHey! Do you want to go see Studio 5 tonight?\n\nIt's supposed to be an awesome movie! \n\nYour friend asks you.\n\n\nIs that the murder mystery? It sounds really good!\n\nI can't even imagine what it must feel like getting\n\nchased by a killer in real life!\n\nYou respond back.\n\n\nRING RING RING RING RING RING!!!\n\n\nThe sound of your high school's bell screams into your ears as you lift your head up from your cell phone. It looks like it's time to go home! You grab your belongings, throw everything into your backpack, and rush out of your classroom. \n\n\nFlooded in the halls are hundreds of students and faculty. You squeeze your way past the crowds to your locker and spin the lock for your combination. \n\n\n14-22-10...CLICK!\n\n\nYou swing the locker open and grab your books. Why does there have to be so much homework?! It's Friday!\n\n\nYou close the locker and make your tedious way down the stairs of the school to the exit. Outside, you see the same long row of six or seven school buses. Luckily for you, your home is walking distance from the school, so you don't have to deal with finding a seat or bullies. Although you do wish your parents would surprise you with a car. After all, your 16th birthday is coming up soon.\n\n\nYou follow the crowds out of the school grounds and cross the street. There are two paths you can take...\n\n\nThe Shortcut - Begin a new story\n\n\nAuthor's Note - Note from the author", "action_results": [null, null]}]}]}