{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=25548", "context": "", "first_story_block": "Your name is Arakhan.\n\n\nFor years, you have dreamed of becoming Captain of the Guard, and protecting your small hometown of Lyestra. Fortunately for you, your wildest dreams came true just last week. You finally received your long overdue promotion, and now you are the official Captain of the Guard!\n\n\nLyestra is a quiet enough village, so the first few weeks were rather uneventful. However, two days ago, you received a tip that a group of goblin warriors had been spotted camping out in the woods not far from Lyestra. Goblins rarely come so near to a village, so you and a handful of other men have gone to scope out the situation. So far, you have found nothing. You are running low on supplies, and the men have requested to return to Lyestra.\n\n\nHowever, you told them you would like to make one last sweep of the area before you return home. You and your men have split up to search the area for any sign of the goblins.\n\n\nYou are on your own, in a dense area of the woods. You are searching for any sign that the goblins were here.", "action_results": [{"action": "Search behind a nearby bush", "result": "You get on your hands and knees, hoping to find a clue underneath a nearby bush, but alas, all you get for your trouble is a dirty uniform. There is nothing to be found under the bush. You stand up quickly, trying best as you can to brush the filth from your clothes.\n\n\nWhat now?", "action_results": [{"action": "Inspect the oak tree", "result": "As you stare at the tree, you notice something that had escaped your search before. There appears to be an arrowhead embedded in the trunk of the tree. You yank it out. It seems that it was once attached to an arrow, but someone has snapped off the shaft, leaving just the arrowhead. There is a small white feather attached to the arrowhead. You pull it off. It appears to be decorated with a strange symbol, the likes of which you have never seen before. A red, two headed cobra has been painted onto the feather. The symbol fills you with dread.", "action_results": [{"action": "Place the feather in your pocket", "result": "You feel that you've seen all you can here. You turn, ready to go back to your camp, when suddenly you hear a quick rustling in the bushes. You feel sweat instantly bead on your brow. Someone is coming towards you, and they're moving quickly. What will you do?", "action_results": [{"action": "Wait to see who it is", "result": "You stand at the ready, but keep your sword sheathed. A good thing, too, because at that moment, Adonis, official messenger of Lyestra, comes hurtling through the bushes.\n\n\n\"Arakhan!!\" He nearly collapses to the ground with relief and exhaustion. \"Thank the gods I've found you!\"\n\n\nAdonis is panting heavily. He bends over, trying to catch his breath.\n\n\n\"Calm down,\" you say, \"What seems to be the problem? What are you doing so far from Lyestra?\"\n\n\n\"Lyestra?\" Adonis gets a hollow, far off look in his eyes. \"Lyestra is...now don't take this too hard, but--\" he swallows. \"Lyestra is gone.\"\n\n\nYou nearly sink to your knees. Lyestra? Your home town, gone?\n\n\n\"What do you mean? Tell me, NOW!\" You are barely able to choke back your panic and grief. Your village needs you now more than ever. Now is the time to keep a cool head.\n\n\n\"Goblins came in the night---we---we weren't ready for them,\" Adonis chokes, \"And so many of them! They just kept coming! In hordes! I barely got out with my own--I mean--I fought off at least half a dozen, of course--but---even for someone like me, I knew the odds were hopeless--\"\n\n\n\"Get to the point,\" you growl, \"How many are dead?\"\n\n\nAdonis stares down at the ground.\n\n\n\"....Hundreds,\" he mumbles.\n\n\nNow, you really do fall to your knees. How could you have let this happen? You've failed Lyestra, and nearly a hundred people have paid for your carelessness with their lives. You've failed your guards--your guards! You have to find them. They must be scattered around the woods--somewhere nearby. You have to find them before a troop of goblins finds them first!\n\n\n\"We've got to get back to Lyestra,\" Adonis continues, \"There might be a few survivors left. And we have to find out who was responsible for the attack!\"\n\n\nYou weigh your options. If you go with Adonis now, the two of you could conceivably make it back to Lyestra in two hours. However, there are still a few guards doing their final sweep of the area. They could take care of themselves, surely, but you would feel much better knowing that they are safe in this uncertain time.\n\n\nAdonis looks at you expectantly. What will it be? Find your guard regiment? Or go back to Lyestra and search for survivors?", "action_results": [{"action": "Return to Lyestra with Adonis", "result": "You decide to return to Lyestra with Adonis.\n\n\"The smart choice,\" Adonis nods.\n\nYou feel awful about abandoning your guard regiment, but time is of the essence. And, after all, your friends are trained warriors. You hope they will be able to find their way back on their own.\n\nYou follow the winding path, Adonis tagging along, until at last you reach the town gates.\n\nAnd there, your blood runs cold.\n\n\nYou reach the Lyestra gates, and stop in abject horror. The town has been completely gutted.\n\nSmoke billows from the wreckage of houses. You hear wailing in the streets.\n\nCorpses line the streets, and a few wanderers roam freely, searching and crying out for their loved ones.\n\nNever before have you felt like such a failure.\n\n\"HALT!\" A voice cries, \"Who goes there?!\"\n\nYou raise your head and see a short, stocky man in a helmet approach you.\n\nIt's Quent, one of your guards.\n\n\"Quent!!\" You cry, \"It's me, Arakhan.\"\n\n\"And me!!! Adonis!!!\" Adonis screams.\n\n\"We've returned,\" you say.\n\nQuent lowers his spear and begins to cry, his brave front completely lost.\n\n\"Oh, Arakhan,\" he sobs, and wraps his arms around you. \"You're back!! It was---it was a living nightmare....\"\n\n\"Where are the other guards?\" you ask, gripping him by the shoulders. \"Where are the others we left posted here?\"\n\nHe sobs, choking.\n\n\"All dead, Arakhan,\" he cries.\n\n\"Brutus? Carissa? Andrey?\" You ask.\n\n\"All of them!! They were cut down, every last one. Killian forced me to hide so someone would be left to tell you what happened. I ran, only to see him get shot down as well. Arakhan, they came at us like a wave of death.\"\n\n\"Stand tall, Quent,\" you say. \"I've come to kill the one responsible for this.\"\n\n\"I'm so glad you're back,\" he sobs. \"Please, head into the town and see what you can do for the villagers. They need someone. And maybe you can find some of the answers you need in there.\"\n\nYou nod, and release Quent to return to his patrol duties.\n\nAdonis approaches you.\n\n\"Well, I hope you're satisfied,\" he grumbles, \"Some protection.\"\n\n\"Move along, Adonis,\" you growl, and he yelps.\n\n\"Erk! I--uh--right, then. I'll be on my way,\" he mumbles, and shuffles off into the city.\n\nYou glare, watching him go.\n\nAfter a moment, and a chance to catch your breath....you enter the city gates as well.\n\nAt long last, you are home.", "action_results": [{"action": "Enter Lyestra", "result": "Home.\n\n\nOr what remains of it.\n\n\nYou wander through the streets of Lyestra, barely even recognizable after such brutal destruction. There is the old tree that you used to swing from as a child, burned and splintered into nothing more than a husk. The mayor's house looms in the distance, black smoke plumes rising from it and lifting into the sky.\n\n\nWorst of all are the bodies.\n\n\nYou cannot tear your gaze away from the corpses lining the streets, the sobbing that wracks every alleyway, and the stench of hot blood and fire that fills the air.\n\n\nYou see not a few familiar faces among the dead, and, nearly choking on your grief, you press on.\n\n\nEventually, you find that you have traversed the length of the entire village, and you now stand at the North Gate.\n\n\nThe great wall that surrounds your village has been cracked, and furniture and lumber has been haphazardly barricaded into the broken sections.\n\n\nThe Gate itself is wrapped deeply in chains, with an enormous bronze padlock sealing the chains tight.\n\n\nA man staggers over to you, his eyes glinting malevolently. It's Joad, one of the older guards on your force. He holds a pitchfork, and is staggering towards you.\n\n\n\"ARAKHAN!\" he shouts. You feel a flutter of nervous fear.", "action_results": [{"action": "Draw your Sword", "result": "You draw your sword, and hold it out protectively.\n\n\nJoad snorts.\n\n\n\"Useless AND stupid,\" he mutters. \"Who would have guessed?\"\n\n\nYou lower your sword, feeling a hot rush of embarrassment. Joad sneers, his pitchfork falling to his side.\n\n\n\"Welcome back, Captain,\" he grunts. You feel his hatred wash over you like the tide. \"Have a nice walk out in the woods, then? Don't mind us, we were just out here, fighting for our lives while you hid in the bushes.\"\n\n\n\"Calm down, Joad,\" you say, \"I'm back now, and I swear to you, I will have revenge on these miserable creatures.\"\n\n\nJoad spits.\n\n\n\"Fat lotta good that'll do us now,\" he mutters, \"Now that near the whole village's dead and killed.\" He sighs, and you see weariness crease his brow.\n\n\n\"If you want to go and play the hero....and get your damned self killed--be my guest,\" Joad grumbles, \"we were barely able to fight them back. They left for the woods---we thought to go find you. But just an hour or so ago, our scouts saw them returning. They've made camp just north of here, probably planning their next move.\"\n\n\n\"Do you see who is out there?\" you ask.\n\n\n\"We didn't see nothing,\" Joad growls, \"You prob'ly know more than we do. All we know is that we was having a normal day, when suddenly a horde of goblins tear through this town like wildfire, killin' and maimin'. We barely fought 'em back.\"\n\n\nYou reach for the padlock on the North Gate. \"I'll bring you their leader's head,\" you growl, gripping your sword.\n\n\n\"Ah, ah, ah,\" Joad says, staying your hand. I'd love to see you go out there and get killed much as the next man. But that lock ain't comin' off. Not 'less you get a key for it.\"\n\n\n\"You don't have a key?\" you ask.\n\n\n\"Not me,\" Joad says, \"we gave out keys to people we trust, people who were here.\"\n\n\n\"I get it,\" you say.\n\n\n\"Go on and explore the town a bit. See what you left behind. Find a key. When you get one, come back here, and I'll let you through. But not a moment before.\"\n\n\nYou nod. \"Very well,\" you say.\n\n\nYou turn and leave the North Gate behind, heading for the Lyestra Town Square. Your mission is clear.\n\n\nFind a key.\n\nThen, take your vengeance.", "action_results": [{"action": "Go to the Lyestra Town Square", "result": "You stand in the Town Square of Lyestra.\n\n\nThe enormous stone fountain of Lyestra stands before you. It is cracked down the center, and stained with blood. At this time of day, it would normally be gushing happily, but now, it stands still and silent, like an enormous gravestone.\n\n\nYou think for a moment. Your mission is to find a key, exit through the North Gate, and take your revenge on the monsters responsible for this attack.\n\n\nBut perhaps you should explore the town a bit. Not only will you be likely to find a key, you may also find more information you can use to defeat the mysterious attackers.\n\n\nYou consider your options. There is the Morgan's bar--a popular (well, really the only) tavern in town. The few survivors of the attack are almost certain to be holed up there.\n\n\nThe Mayor's house is smoking in the distance. It might be a good idea to check there, to see if he or any of his family survived the attack.\n\n\nAnd lastly, there is the Lyestra Library. The Library is rather large for such a small village, and the Librarian is a good friend of yours. Perhaps you will find some information on your attackers there.\n\n\nWhere to go first?", "action_results": [{"action": "Go to the Morgan's Bar", "result": "You weigh your options, and decide the best course of action is to head to the esteemed Morgan's Bar.\n\n\nYou head down the winding pathways of Lyestra, until you have reached the swinging double doors of the Bar.\n\n\nYou push through the door, and there, as you expected, you see several dozen villagers, all crowded about within the dimly lit tavern.\n\nThey are gathered around the small wooden tables, drinking at the bar. A few children are huddled in the corner, smeared with dirt and playing a card game in grim silence.\n\n\nThe Morgan's Bar, being the largest building in town, was always designated as the survival shelter in case of attack. It had almost been a sort of joke. 'We'll drink til' the invaders get bored,' people used to say, laughing.\n\nAfter all, who would ever want to attack a town as tiny and insignificant as Lyestra?\n\n\nYou shake your thoughts away, and stride into the Bar.\n\n\nEveryone freezes for a moment at your approach, and all eyes turn to stare directly at you. You feel their gazes burning into you.\n\n\nAnd then, quickly, the villagers all turn aside, quickly absorbed back into whatever menial tasks had been consuming them.\n\n\nYou feel a hot rush of shame, but force it down. You have a mission--you must find a key to unlock the door.\n\nSomeone in here is sure to have it.\n\nYou survey the room.\n\nThere are the children, of course, playing their game in the corner. Morgan himself, the Barkeep, is washing a glass and avoids your gaze. There is an incredibly muscular man in the corner, picking at his teeth with a dagger, and wrapping a gauze bandage around the his arm. And in the corner, there is a tall, gaunt man in a purple cloak. His hood is up, so you can't make out his face in the dimly lit room.\n\nAnd of course, you could always have a drink.", "action_results": [{"action": "Speak to Morgan, the Barkeep", "result": "\"Morgan!\" You call, and start walking towards him.\n\n\nHe sees you out of the corner of his eye, and turns away from you, to help a customer.\n\n\n\"And how can I help you, miss?\" he asks, pointedly ignoring you. Your hand falters, and you turn away from him.\n\n\nClearly, he is none too happy to see you. Time for a different approach.", "action_results": [{"action": "Give Up", "result": "You are standing in the middle of the Morgan's Bar, surrounded by the few survivors of the attack.\n\n\nThere are some children, playing a game in the corner.\n\n\nMorgan stands behind the bar, washing glasses.\n\n\nA muscular man is bandaging himself near a table.\n\n\nThere is a cloaked man in the shadows.\n\n\nAnd you are pretty parched.", "action_results": [null, {"action": "Speak to the Muscular Man", "result": "You walk towards the Muscular Man.\n\n\nHe sneers as you approach.\n\n\"Wellll, well, WELL!\" he rumbles, his scarred face leering down at you, \"Look at the little guard captain, come snivlin' back.\"\n\n\nHe is wrapping a gauze bandage around his arm. He appears to have sustained a nasty cut along his bicep.\n\n\nYou recognize the man as soon as you approach. It's none other than Riker, local mischief maker and brawler. You've had a few run-ins with him before.\n\n\n\"Riker,\" you say, curtly.\n\n\n\"Thought you'd never show your face 'round this town again, runt,\" Riker growls, \"Or worse, I was tellin' evry'one I figgered YOU were in league with them goblins.\"\n\n\n\"They tricked us all,\" you say, \"But they're going to pay for what they've done.\"\n\n\nRiker lets out a wet, throaty laugh.\n\n\n\"I'll bet they will!!\" he croaks. His voice sounds like a bag of wet marbles. \"You go'wan and get your head cut off by 'em, thank a lot, then, cap, that'll show 'em, yeah.\"\n\n\n\"I plan to face them,\" you say, \"But I need a key to open the North Ga--\"\n\n\nRiker spits.\n\n\n\"Well bloody well good luck with that,\" he says, \"cause you ain't gettin' no help from me.\"\n\n\nHe turns away, finished with the conversation, and goes back to his bandage.", "action_results": [null]}, {"action": "Speak to the Cloaked Man", "result": "You walk over to the strange man in the purple cloak.\n\n\nAs you get closer, you see that it is no stranger at all, but your good friend, and second-in-command, Lodan!\n\n\nHe stands as you approach.\n\n\n\"Ah, Captain,\" he says, nodding serenely, \"I see you've finally made it to the Bar. Have a seat.\"", "action_results": [{"action": "Embrace Lodan tightly", "result": "You wrap your arms around Lodan, and pull him in tightly, nearly crushing him in a bear hug.\n\n\n\"Captain, I--er---ah--erkkkr,\" he says.\n\n\nYou don't let go.\n\n\nEveryone in the bar turns to stare.\n\n\nIt gets uncomfortable, but you've committed to this, and it would be even more awkward to end it now.\n\n\nFinally, you release him. The two of you stand there in silence for a few moments.\n\n\n\"Please do not do that again, sir,\" Lodan says.", "action_results": [{"action": "Take a Seat", "result": "You take a seat across from Lodan, and the two of you have a long conversation about the invasion, and where to go next from here.\n\n\n\"I've been searching town, and neither Glusen nor Anaria have shown up yet,\" he mutters. \"I fear that they might still be out in the woods somewhere. Or worse. The sun is already about to set. They should have been back by now.\"\n\n\n\"Actually, Lodan, about that--\" you say, but you are suddenly interrupted by an incredible crashing sound coming from behind you. You both turn, and see the muscular man in the corner screaming at a young woman for having knocked over his beer. She has begun to cry, and spit is flying from the man's mouth.\n\n\n\"Riker,\" Lodan sighs, shaking his head, \"Of all villagers, of course HE had to be one to survive.\" Lodan looks up. \"Apologies, that was cruel,\" he says, \"I suppose we must all be allies now.\"\n\n\n\"I'm going to need as much help as I can get,\" you say, \"especially since I've got to find a key to the North Gate.\"\n\n\n\"A key?\" Lodan asks. He points at Morgan, who is working behind the bar. \"You mean like that one there?\"\n\n\nYou double-take. Morgan clearly has a key tied around his neck. You can't believe you didn't notice it before! What's more, it looks exactly the right size and shape to fit the North Gate.\n\n\n\"That's got to be it,\" you say, \"I'd better go get it.\"\n\n\n\"Careful, there,\" Lodan says, \"Morgan was none too friendly to me, and I doubt he will be any different to you.\"\n\n\n\"What shall I do?\" you ask.\n\n\n\"Well, Morgan has never turned down a paying customer, even one he despised,\" Lodan says, \"Keep that in mind.\" He stands up.\n\n\"Well, I'm going to be off,\" he says, \"Maybe I'll find more of our friends.\"\n\n\nYou nod, and say your farewells to Lodan. He exits through the Tavern doors.", "action_results": [{"action": "Return to the Bar", "result": "You are standing in the middle of the Morgan's Bar, surrounded by the few survivors of the attack.\n\n\nThere are some children, playing a game in the corner.\n\n\nMorgan stands behind the bar, washing glasses.\n\n\nA muscular man is bandaging himself near a table.\n\n\nAnd you are pretty parched.", "action_results": [null, null, {"action": "Have a drink", "result": "A drink, maybe that's what you need.\n\n\nYou take a few steps towards the bar, and stop instantly.\n\n\nYou have no money on you.\n\n\nEmbarrassed, you return to the bar.", "action_results": [null]}, {"action": "Speak to the Children", "result": "You wander over to the kids. They seem to be playing some strange sort of card game.\n\n\nA boy with dark eyes and darker hair stares up at you as you approach. The other children look to him as though he were their leader.\n\n\n\"Hello, children,\" you say, extending a hand in what you hope is a friendly way.\n\n\n\"Hello,\" the little boy says.\n\n\n\"I'm looking for something,\" you say, \"And I'm wondering if you could help.\"\n\n\n\"Mum says not to talk to strangers,\" a little girl hisses to the boy.\n\n\n\"Yeh, well, where's your mum now?\" the boy asks.\n\n\nThe girl looks down at the floor, and tugs at the hem of her dress.\n\n\n\"That's right,\" the boy says, \"we ain't got no more rules to follow, now.\" He looks back up at you. \"What you want, then?\"\n\n\nYou inhale slowly.\n\n\n\"I'm looking for a key,\" you say.\n\n\n\"Ain't got no key,\" the boy says, but then he reconsiders. \"But on the other hand, I DO got this.\" He holds up a shiny copper coin.\n\n\n\"A coin?\" you say.\n\n\n\"It's lucky,\" the dark-haired boy says solemnly. \"I'll play you for it, if'n you want.\"\n\n\n\"Hm,\" you say, \"Well, I don't have anything to play for. I've got no money on me.\"\n\n\n\"Yes you do,\" the boy says, and he slowly points a finger at your sword, hooked onto your belt. \"I'll play you for that.\" He looks up slowly, giving you a toothsome grin. \"What say ya?\"", "action_results": [{"action": "Accept the Bet", "result": "\"Alright,\" you say, ignoring your better judgment. \"Let's play.\"\n\n\n\"Ha!\" the boys says, \"Alright then. Here's how we do.\"\n\n\nHe lays out a row of cards, seven in total.\n\n\n\"You gotta win three rounds if you want the coin.\"\n\n\nYou are facing the boy.\n\n\n\"From your left to right, the cards are---1, 2, 3, 4, 5, 6, 7.\" He says. He lifts the cards to show you the numbers. \"Got that?\"\n\n\nYou nod.\n\n\n\"Alright,\" he says. \"Now I'm gonna mix 'em up.\"\n\n\nAnd he does.\n\n\nHe takes the third card, and moves it two spaces to your right.\n\nThen, he moves the seventh card two spaces to your left.\n\nNow, he moves the new seventh card all the way to position 1, making it the farthest card on your left.\n\nHe takes the new seventh card, and moves it two spaces to his right.\n\nThen, he takes the second card, and moves it one space to your right.\n\n\n\nHe looks up at you.\n\n\"Now tell me,\" he says, \"In which position is the card with the number '5' on it?\"", "action_results": [{"action": "Card 1", "result": "\"Oooooh, bad luck, then!\" he laughs, and flips up the card, showing you that you've made the wrong choice.\n\n\nYou sigh deeply.\n\n\n\"Alright, now,\" he says, \"Give me my prize!!\"\n\n\n\"Absolutely not,\" you say, \"Swords are not for children.\"\n\n\n\"Liar!!! No fair!!\" He starts to cry, and the other children start to cry as well. It's causing a scene.\n\n\n\"Oh, alright!\" You say, \"You can hold it, for a minute, at least.\" You hand him your sword.\n\n\n\"Whoa, COOL!\" He says, he whirls around with the sword, spinning faster and faster as he grows more excited.\n\n\n\"Now careful,\" you say, \"Swords are very--\"\n\n\nThat's all you can get out before the sword slips from his grasp, flies through the air and severs your head instantaneously.\n\n\nThe children all scream as your headless corpse sprays blood everywhere.\n\n\nWhat a dumb way to die.", "action_results": []}, null, null, null, null, {"action": "Card 6", "result": "\"That one,\" you say, pointing at Card 6.\n\n\nHe lifts it, showing you the number \"5.\" He sticks his tongue out at you.\n\n\n\"Lucky,\" he whines. \"But that's just the first round.\"\n\n\nHe reaches in his pocket and takes out another deck of cards.\n\n\n\"This is my lucky deck,\" he says, \"we'll see how good you are now.\"\n\n\nHe lays out seven cards.\n\n\n\"From your left to right,\" he says, \"The cards are: Phoenix, Monkey, Snake, Dragon, Troll, Ogre, and Goblin.\"\n\n\nYou nod. \"I'm ready,\" you say.\n\n\nHe starts to shift the cards.\n\n\nHe moves the first card three spaces to his left.\n\nThen, he moves the second card two spaces to your right.\n\nHe takes the seventh card and moves it five spaces to your left.\n\nHe takes the fourth card and moves it one space to your right.\n\nHe takes the sixth card, and moves it two spaces to his right.\n\nThen, he takes all seven cards, keeping them in a row, and spins the entire row clockwise, so the row is now upside down.\n\n\n\n\"Which card has the dragon?\" he asks.", "action_results": [null, null, null, null, {"action": "Card 5", "result": "\"Card 5,\" you say.\n\n\nThe dark-eyed boy's eyes grow darker.\n\n\nHe smolders as he lifts the card, showing you the face of the Dragon.\n\n\n\"Fine,\" he says, muttering, \"But now you have to win the third round, and it ain't gonna be easy.\"\n\n\nHe lays out seven cards.\n\n\n\"This time I'm gonna mix decks,\" he says.\n\n\nHe shows you the cards. \"From your left to right, they are, Card 2, Dragon, Ogre, Card 6, Card 1, Monkey, and Card 5.\"\n\n\nHe slams the cards down in front of you.\n\n\n\"Ready?\" he asks. You nod.\n\n\nHe moves the first card three spaces to your right.\n\nHe then moves the sixth card two spaces to your left.\n\nHe moves the new first card one space to his left.\n\nHe takes the entire row, and flips it clockwise, then counterclockwise, then clockwise again.\n\nHe moves the fourth card two spaces to his left, then one to your right, then two to his right.\n\nHe covers the cards with his arms and moves them around a little bit. He doesn't let you see.\n\nHe realizes there are now eight cards, and takes one of them off the ground at random, ripping it up.\n\nHe moves the second card one space to your left.\n\n\n\"Where is the Ogre?\" he asks.", "action_results": [null, null, null, null, null, null, null, {"action": "Point at his sleeve", "result": "You point at his sleeve.\n\n\n\"You think I would cheat??\" he asks. He shows you his sleeves. Empty. He sticks his tongue out at you.\n\n\n\"Nyeh. So there,\" he says, \"Now pick a real card, dummy.\"", "action_results": [{"action": "Pick a real card, dummy", "result": "Embarrassed at being bested by a child, you randomly pick a card without really thinking about it.\n\n\n\"Um, card 4 I guess?\" You say.", "action_results": [null]}]}, {"action": "Point at the Girl next to him", "result": "You point at the little girl sitting next to him.\n\n\nShe immediately burst into tears.\n\n\n\"I told you, Joffa!!\" she says, \"I told you we shouldn't cheat!!!\" She hands you the Ogre card, which had been secretly tucked inside her dress pocket the entire time.\n\n\nJoffa, the dark-haired boy, slams a fist into the ground angrily.\n\n\n\"And I told YOU not to give the game away, Leesey!!\" His face is red, but he reluctantly hands over his copper coin.\n\n\n\"There you go, sir,\" he says, frowning.\n\n\nYou take the coin.\n\n\nYou now have one (1) copper coin.\n\n\nUnbelievable riches are now yours.\n\n\nYou head back to the main bar area.", "action_results": [{"action": "Back to the Bar", "result": "You are standing in the middle of the Morgan's Bar, surrounded by the few survivors of the attack.\n\n\nMorgan stands behind the bar, washing glasses.\n\n\nA muscular man is bandaging himself near a table.\n\n\nAnd you are pretty parched.", "action_results": [null, null, {"action": "Have a drink", "result": "The bar is pretty crowded, but you find an open seat and quickly snag it.\n\n\nBefore Morgan can say anything to you, you've laid your copper coin down on the table.\n\n\n\"Pour me a drink, eh Morgan?\" you ask.\n\n\nAs he gets closer, you can see a key tied around his neck on a string. It has to be the North Gate key, you're sure of it.\n\n\n\"What'll you have?\" he grumbles. He's clearly angry with you.\n\n\nWhat will you have?", "action_results": [{"action": "A West Aradin Pilsner", "result": "\"Comin' right up,\" Morgan says. He reaches under the bar, and pours you a drink.\n\n\nAs he leans forward, the key around his neck swings enticingly.\n\n\nNow is your chance--and it may be your only chance.", "action_results": [{"action": "Grab the key and bolt", "result": "You yank the key from around Morgan's neck. The string snaps instantly, and the key is in your hand!!\n\n\n\"Hey!!\" Morgan shouts, but it's too late. You start to run, away from the bar, towards the double doors!\n\n\nThey get closer--closer---\n\n\nThen---\n\n\nBAM!!\n\n\nYou've slammed into a full blown mountain of meat, stopped dead in your tracks, inches from the door.\n\n\nIt's the muscular man with the arm wound--Riker, local troublemaker and scoundrel.\n\n\n\"Well, WELL,\" he says, \"A Coward, AND a thief!\"\n\n\n\"Please,\" you say, \"I have to get out of here. I'm going to avenge us all.\"\n\n\n\"HA!\" Riker sneers, \"fat chance.\" He raises a fist. \"How about I POUND YOU INTO THE GROUND, instead?!?!\" He raises his beefy arm in the air, and the entire bar cheers loudly, excited for your demise.\n\n\nNo choice, looks like you're gonna have to fight!", "action_results": [{"action": "Fight Riker!", "result": "Riker circles you, angrily, his bloodshot eyes watching your every movement.\n\n\nHe's determined not to let you leave this bar, and you're going to have to incapacitate him.\n\n\nYou watch him as he strafes you, and get the sinking feeling that taking on a bear might have been a wiser option.\n\n\nYour mind races. Is it better to wait for him to lunge? Or should you strike now, try to catch him off guard?", "action_results": [{"action": "Attack Riker!", "result": "You move quickly. Riker is a mountain of a man, but you're much lighter on your feet. You strike hard, going straight for his gut.\n\n\nYou grin as your blow connects!\n\n\nUnfortunately, the blow is practically absorbed by his granite-hard abs.\n\n\nHe laughs down at you.\n\n\n\"That was your best shot?\" He sneers. He grabs you by the hair and hoists you up. \"My turn.\"\n\n\nGrabbing you by the hair and neck, he hurls you across the bar!\n\n\nThe onlookers gasp in shock as you go crashing into a table, smashing it to splinters.\n\n\nYou're dizzy but you pull yourself back to your feet, and soon you're sprinting towards him at full force.\n\n\nRiker readies himself for your next attack.\n\n\nWhat will you do?", "action_results": [{"action": "Strike at Riker's face", "result": "You slam a fist towards Riker, but he's prepared and protected for your attack.\n\n\nHis hands quickly rise, blocking your attack. You wince in pain as your fist slams against his blocked arms.\n\n\n\"Enough of this nonsense,\" Riker spits. \"I thought you might be some kind of CHALLENGE. Guess I was wrong.\"\n\n\nAnd then he rears his fist back and socks you in the face.\n\n\nYou feel like you got trampled by a wild stallion. Your world spins, you take several stumbling steps to the left, then to the right, before falling to a heap.\n\n\nYour head bangs against a nearby table as you go down, and the world goes dark.\n\n\n\"Heh. Take THAT, Arakhan,\" Riker leers, coming over to your still form. He looks down at your body, and notices a pool of blood spreading from beneath your unmoving figure.\n\n\n\"Uh,\" Riker says, grimacing, \"Arakhan?\"", "action_results": []}, {"action": "Sweep Riker's legs out from under him", "result": "You use your momentum to slide across the floor just as you reach Riker.\n\n\nHe was preparing himself for a blow, and is thrown off guard as you hit the ground. Your legs sweep out, utilizing an attack you learned in your guard training--an attack specifically designed to topple larger foes.\n\n\nRiker howls as your legs smash into his ankles, and he goes down, hard.\n\n\nThe glasses on the shelves rattle as Riker slams into the floor.\n\n\nHe swears and shouts, quickly trying to pull himself onto his feet.\n\n\nThe two of you are on the floor, both quickly scrambling for purchase.\n\n\nQuick, what now?!", "action_results": [{"action": "Try to stand up before Riker does", "result": "The two of you scramble to your feet, panting heavily, trying to gain the upper ground.\n\n\nHowever, the two of you are evenly matched, and soon, you are both standing at opposite points of the bar--circling and staring each other down.\n\n\nLooks like you've just ended up right back where you started. Gonna have to try another tactic to take this guy down.", "action_results": [null]}, {"action": "Grab a nearby table cloth to pull yourself up", "result": "You see a low hanging table cloth and wrap your hands around it, attempting to yank yourself upwards.\n\n\nYou failed to realize, however, that the table was fully set.\n\n\nAs soon as you grab the table cloth, everything--glasses, cutlery, plates, bowls--and a large iron kettle--go flying.\n\n\nRiker pulls himself to his feet, just as the kettle arcs through the air, smacking him directly in the forehead.\n\n\n\"AGHH!!!!\" He screams. The kettle left an angry red gash across his head, and blood is leaking down into his eyes. He stumbles wildly, grabbing at anything, before losing his balance and crashing into a wall.\n\n\n\"YOU LITTLE CHEAT!!\" Riker shrieks.\n\n\n\"Now, then,\" you say, \"If you'll just surrender, I think we can all--\"\n\n\n\"SURRENDER THIS!!\" Riker says, running at you with a knife.\n\n\nOh dear.", "action_results": [{"action": "Things are escalating....", "result": "Riker is running towards you with a knife!\n\n\nThings are looking pretty dire.\n\n\nQuick, do something!", "action_results": [{"action": "Draw your Sword", "result": "You try, but you aren't fast enough. Riker's knife plunges into you, and the world goes red.\n\n\nPeople are screaming, and your last, faint hope is that Riker will receive justice for his madness.", "action_results": []}, null, {"action": "Strike Riker's right arm", "result": "You only have just enough time to jab two fingers into Riker's right arm as he slashes--\n\n\n--And your fingers strike right into Riker's arm wound.\n\n\nIn agony, he drops the knife, gripping his arm in pain.\n\n\nYou notice that Riker's bandage--the one tightly bound around his right arm--is slowly unraveling. Interesting.\n\n\nRiker is going for his knife, a few feet away from him on the floor.\n\n\nYou've got to do something, and fast.", "action_results": [{"action": "Try to grab the knife before Riker", "result": "You and Riker both sprint towards the knife, each lunging at the same moment--!\n\n\nBut Riker just barely beats you to it, grabbing it and raising it malevolently.\n\n\nYou are very close to Riker now--you might be able to do something before he attacks again.", "action_results": [null, {"action": "Grab the loose end of bandage", "result": "You yank the loose end of Riker's bandage and it gives a bit. Riker recoils in pain, giving you the chance to put some distance between the two of you.\n\n\nYou are now holding the end of Riker's bandage.\n\n\nIt stretches out across the bar, still connected to his arm.\n\n\n\"Hey!\" He shouts, \"Give that back!!\"\n\n\nWhat will you do?", "action_results": [{"action": "Pull on the bandage as hard as you can", "result": "You attempt it, but Riker sees your attack coming.\n\n\nHe slashes at the bandage with his knife, leaving you holding nothing but a useless scrap of fabric.\n\n\n\"Nice try,\" Riker says.\n\n\nThe next target his knife finds is you.", "action_results": []}, null, {"action": "Taunt Riker and run", "result": "\"Oh,\" you say, dangling your end of the bandage tauntingly, \"You mean this old thing?\"\n\n\nRiker runs at you in a fury, not even caring that he is still connected to you.\n\n\nThe two of you sprint around the bar. You make sure to get the bandage tangled around small tables, chairs, and shelves.\n\n\nFinally, you are too winded to run anymore.\n\n\nRiker corners you.\n\n\n\"LET'S FINISH THIS, PIPSQUEAK!!\" he screams, showering you with spit.\n\n\nHe raises his knife high into the air........", "action_results": [{"action": "Tie the loose end of the bandage around a sturdy table", "result": "Riker swings his arm--\n\n\n--Forgetting that his arm is now tangled across the entire bar.\n\n\nAs he lunges at you, the bandage becomes taut, and he is yanked backwards by the force of his own inertia. He goes down hard, clocking his head against the hard wooden floor.\n\n\nYou stand over his unconscious body, looking down at him.\n\n\nHe's out cold.\n\n\n\"Order up,\" you say, quietly.\n\n\nEveryone in the bar is confused for a moment, then they all burst into cheers.\n\n\n\"Riker sucks!\" Somebody yells.\n\n\nYou grin as everyone cheers for you, even Morgan, who is only mildly upset that a good portion of his bar was destroyed in the brawl.\n\n\n\"Go ahead and keep that key,\" Morgan says, \"I'd say you've more than earned it.\"\n\n\nEveryone gives you high fives on your way through the doors.\n\n\nAs you exit the bar into the dying twilight, it is with the proud knowledge that you have fought well.\n\n\nAnd yet--your true fight has not even begun.", "action_results": [{"action": "Prepare yourself", "result": "You finally have a key that will open the Northern Gate.\n\n\nThere's no time to delay. You've promised to avenge your village, and avenge it you shall.\n\n\nYou know that the ones who destroyed your town--the goblins, and their leaders--are all camped just beyond the Northern Gate.\n\n\nIt might be suicide to try to face them alone, but you know you have no choice.\n\n\nIf you don't assassinate their leader tonight, they will surely regroup and finish the job of destroying Lyestra tomorrow.\n\n\nYou steel your courage, and then head towards the Northern Gate to face Joad.", "action_results": [{"action": "To the Northern Gate!", "result": "You grip the key firmly in your hand, and approach the Northern Gate, just as the sun sets over the horizon.\n\n\nJoad is leaning against the wall, and watches you coolly as you approach.\n\n\n\"Well?\" he asks.\n\n\nYou hold up the key. Joad nods.\n\n\n\"Well, well,\" he acquiesces, \"looks like you got one, after all.\"\n\n\nJoad takes the key from you and slides it into the heavy iron padlock that keeps the gate seal.\n\n\nWith a K-THUNK, the padlock falls away, and the chains loosen. Joad tugs on the chains as he speaks.\n\n\n\"I don't know who you convinced to give you that key,\" Joad says, \"But I'm going to tell you the truth.\"\n\n\nThe chains fall away, and the wrought iron Northern Gate swings open with an ominous creeeeak.\n\n\nJoad points out, through the Gate.\n\n\n\"Out there,\" he says, \"Out there is the northern hill country. We know that the goblins are camped out in a huge horde out there, somewhere in the hills. Figure their leader is out there, too. They've been quiet since the morning, so they must be biding their time for something. None of us are dumb enough to think they've had their fill of destruction.\"\n\n\nJoad suddenly grabs your arm, as though he's pulling you back from the brink of a cliff.\n\n\n\"Are you really planning on going out there alone?\" he asks, \"I want you to know. It's suicide.\"\n\n\n\"What choice do we have?\" you ask, \"With the exception of you, me, and three or four guards, everyone else who could defend this town is dead. And like you said, it's suicide. I'm not putting anyone else in danger. Maybe it's futile. Maybe not. But either I go out there and fight, or I wait here to be killed. And I choose to fight.\"\n\n\nJoad releases your arm, and you can see something like a glimmer of admiration in his eyes.\n\n\n\"Well, I'll never let it be said that Arakhan of Lyestra was a coward.\" He chuckles. \"An idiot, maybe. But not a coward.\"\n\n\n\"Goodbye, Joad,\" you say.\n\n\n\"Goodbye, Arakhan,\" he says, \"Until we meet again.\"", "action_results": [{"action": "Exit through the Northern Gate", "result": "Alright. This is it. Everything you've done up to this point has led up to this moment.\n\n\nThe sun has set, blanketing the hill country in a cover of darkness.\n\n\nThe clouds are thick in the sky, blocking the stars. You're thankful for small favors.\n\n\nEven though the sun has only just set, nearly everything is in pitch darkness. You can make out the shapes of the hills before you. The ground curves up and down. Wind whips the grass at your feet. Everything feels ominous.\n\n\nThis is crazy, you think to yourself, Absolutely insane.\n\n\nYou shake yourself out of it, pulling your thoughts together. You go over your plan, crude as it is.\n\n\nFirst, you'll sneak your way through the tall grass, and through the northern hills. Goblins are loud, clumsy, and messy, making them incredibly easy to track, particularly for someone as skilled in tracking as yourself.\n\n\nYou figure you'll be able to find their encampment quite easily.\n\n\nOnce you've found their base, you'll be able to figure out more. And then you'll wait, hidden, outside their encampment. They may be a large force, but you've played and lived in these hills since you were a little boy. You know all the hiding places that they would never find.\n\n\nAnd then you'll wait, hidden outside their encampment, as long as it takes--all night, if need be--until their leader shows his miserable face.\n\nAnd then you'll put an arrow right into his heart.\n\n\nIt's a crude plan. You'll die, of course---but your one hope is that without leadership, the goblins will fall apart and leave Lyestra alone.\n\n\nAlright. Time to go.", "action_results": [{"action": "Crawl through the grass towards the goblin camp", "result": "You crawl stealthily through the hills.\n\n\nWind whips through the tall grass.\n\n\nYou can see the glimmer of torchlight to the north. Could it be the goblin camp?\n\n\nYou'll have to decide on a plan of action.", "action_results": [{"action": "Go North, towards the torches", "result": "You crawl through the thick grass and reach the entrance of the camp!\n\n\nThere is a crude, makeshift wall surrounding the encampment. It was clearly built in a day, from mud and packed stone. Goblins are fast workers, even if they are sloppy.\n\n\nAt the entrance of the camp, there is a gap in the wall, an entryway that leads to and from the inner camp.\n\n\nAnd through that opening, you can see details of the camp itself. Dozens of goblins mill about, sharpening weapons and grunting in their weird goblin language.\n\n\nIn the center of the camp, there is a stone chair. A blue-skinned man sits on the chair, examining his nails smugly. He wears a long, flowing cape.\n\n\nGuarding the entryway are two goblin sentries. They're both small, about three feet, armed with spears and wearing rusty helmets and cheap armor.\n\n\nYou might be able to take them on....but without raising the alarm?", "action_results": [{"action": "Shoot an arrow at one of the goblins", "result": "You swiftly raise your crossbow, and fire a bolt at one of the goblins!\n\n\nThe bolt pierces him in the neck, and he goes down with a gurgle.\n\n\n\"GNGHHHGHRG GHRHG!!\" The other goblin shouts. \"INTRUDER!! TO ARMS!!\"\n\n\nYou try to run, but you've given your position away. You're overwhelmed by goblins in seconds.\n\n\nAnd they don't take you prisoner.", "action_results": []}, {"action": "Sneak closer and take them out at close range", "result": "You slither through the grass, drawing your knives.\n\n\nThe goblins are sleepy, and don't pay much attention to you at all as you get closer....closer...closer.....\n\n\nSHIIIINK!\n\n\nSHINK!\n\n\nWith twin slashes, you pierce both of the goblins with your daggers before they have the chance to utter a squeak.\n\n\nThey both hit the ground like twin sacks of flour.\n\n\nThe gateway is clear.", "action_results": [{"action": "Enter the Camp", "result": "You are now inside of the goblin camp. You quickly find a tent to hide behind and consider your options.\n\n\nYou are now in the very heart of danger. There is no way that you're making it out of this camp alive.\n\n\nBut--you can try to take the leader down before you're killed.\n\n\nYou assumed the goblin leader is the man on the stone chair. If you can just make it to him....\n\n\nBut how?\n\n\nYou weigh your options. There are several siege towers not far from your location. You might be able to climb one and get a bird's eye view.\n\n\nOr you could try to use the tents in the camp as cover.\n\n\nBoth options seem risky, but you have no choice now.", "action_results": [{"action": "Climb the Siege Tower", "result": "Alright.\n\n\nYou sprint madly over to the nearest siege tower, and miraculously, no one sees you.\n\n\nYou begin to climb the tower. A long, rickety ladder leads to the very top. From there, you might have a good shot at the general himself.\n\n\nYou are halfway up the ladder, when you look up and see a goblin.\n\n\nHe hasn't noticed you yet--he's climbing down the ladder, yawning, not paying any attention.\n\n\nHe's only a few rungs away from you......", "action_results": [{"action": "Climb back down the ladder quickly!", "result": "You try it, but the goblin sees you!\n\n\n\"INTRUDER!! STOP HIM!!!\"\n\n\nThe call goes through the entire camp like wildfire. In seconds, you are surrounded by goblins.\n\n\nAnd they don't take you prisoner.", "action_results": []}, {"action": "Stab the goblin before he gets to you!", "result": "You draw your knife, and plunge it into the goblin's back!\n\n\nHe squeals, and loses his grip on the ladder.\n\n\nHe falls several feet to the ground, where he lands with a hard SPLAT.\n\n\nYou hold your breath. Did anyone hear that?\n\n\nWell, either way, you'd better hurry.\n\n\nYou finish the climb, and reach the very top of the siege tower. From here, you can see the entire camp.\n\n\n\"HEY!\" A scratchy voice shouts.\n\n\nA goblin stands at the top of the tower. He has a mottled appearance, and one of his eyes is swelled shut.\n\n\n\"What are you doing here??\" He demands. His fingers clutch at a horn, attached to his belt.\n\n\nYou'd better think quick.", "action_results": [{"action": "Shoot the goblin!", "result": "\"Screw this,\" you mutter, and fire an arrow at the goblin.\n\n\n\"Grrrhh!!!\" he howls, as the arrow pierces his shoulder.\n\n\nHe stumbles backwards, but before he falls, he raises the horn to his lips.\n\n\nBRRRRUMMMMMMMMM\n\n\nThe horn is LOUD, WAY louder than you thought it could be.\n\n\nYou look down in horror.\n\n\nGoblins are streaming out of their tents like a wild river.\n\n\nThey surround the tower. You can see them below, pointing up at you, gabbling wildly, aiming arrows at you.....\n\n\nAnd then the arrows start flying.\n\n\nYou last about ten seconds.", "action_results": []}, {"action": "Shoot the horn!", "result": "You shoot the horn!\n\n\nGood thinking, too. The arrow pierces the horn, and the goblin shrieks in pain as the arrow clips his hand as well.\n\n\nYou lunge forward, and give the goblin a mighty shove!\n\n\nHe stumbles backwards, plunging over the edge of the tower.\n\n\n\"Ahhhhhhhh--!!\" he screams, and then hits the ground with a tremendous THUD.\n\n\nAlright, that's him taken care of. But now you've got to get to the center of camp somehow.", "action_results": [{"action": "Descend the Tower!", "result": "The goblin's cry has awakened the camp.\n\n\nGoblins stumble out of their tents, confused, still a bit sleepy, trying to figure out where the cry came from.\n\n\nThey're going to find you any minute.\n\n\nYou cast your eyes about the top of the tower, looking for anything that can help you, anything--\n\n\nYou see a thick coil of ropes, in one corner of the tower.\n\n\nGreat. That should help. You collect them.\n\n\nYou'd better think of something fast! The goblins will find you any minute.", "action_results": [{"action": "Think Fast", "result": "You are standing at the top of the siege tower.\n\nThe goblins are searching for you.\n\n\nYou have a coil of ropes.", "action_results": [{"action": "Descend the Ladder", "result": "You start to climb down the ladder, but you stop once you've climbed a few rungs. If you go any lower, the goblins will see you for sure!\n\n\nYou climb back up.", "action_results": [null]}, {"action": "Look for more Supplies", "result": "Nope. Nothing here but dust. You got everything of value when you grabbed the ropes.", "action_results": [null]}, {"action": "Fire an Arrow into the Center of Camp", "result": "You aim carefully.....\n\n\nYou fire an arrow straight and true into the center of camp!\n\n\nIt hits a wooden post, where it sticks hard and fast. You can barely see it, sticking out of the post.\n\n\nThe blue-skinned man in the chair looks around, confused.\n\n\nNow what?", "action_results": [null]}, {"action": "Tie the Rope to an Arrow", "result": "Okay, great. You tie the end of the rope to an arrow.\n\n\nNow what?", "action_results": [{"action": "Climb down the ladder", "result": "You've been too slow.\n\n\nThe goblins find you!\n\n\nIn seconds, they're swarming up the tower, murder in their eyes.", "action_results": []}, null, {"action": "Fire an Arrow into the Center of Camp", "result": "You fire the rope into the center of camp.\n\n\nIt fires into a wooden post, taking the rope with it.\n\n\nHuh. So much for your rope.\n\n\nThis is not gonna go well.", "action_results": [null]}, {"action": "Tie the Rope to the Tower", "result": "Great!\n\n\nNow you have one end of the rope tied to the arrow, and the other end tied fast to the tower.\n\n\nThe goblins look up! They've seen you!!\n\n\nHurry!", "action_results": [null, null, {"action": "Fire an Arrow into the Center of Camp", "result": "The arrow flies hard and true, where it lands with a THUNK in a wooden post at the center of camp.\n\n\nThe blue-skinned man looks confused. He gazes about, searching for the source of the sound.\n\n\nMeanwhile, the goblins have started swarming up the tower!\n\n\nYou see the first one poke his head over the edge of the platform.\n\n\nGo!! NOW!!!", "action_results": [{"action": "Slide down the rope to the center of camp!", "result": "You grab the rope, in your hands, and begin to slide down it, just as the goblins reach the top of the tower!\n\n\nTheir hands clutch at you, swiping at your back and missing you by inches.\n\n\nYou zip down the rope, zooming towards the center of camp. You can see tents whooshing by as you hurtle towards the center, you can see the blue-skinned man on his throne look up in shock and surprise, as you careen wildly towards him....\n\n\nThen you let go of the rope, and go tumbling into the center of camp.\n\n\nYou bolt to your feet, crossbow already drawn, already pointed at the general's heart.\n\n\nDozens of goblins surround you, their weapons outstretched, but you don't care.\n\n\nYou made it.", "action_results": [{"action": "Threaten the General", "result": "\"NOBODY MOVE!!\" you scream. You hold the crossbow steady.\n\n\nThe blue-skinned man raises an eyebrow.\n\n\n\"Well, well, well,\" he hisses. His eyes are serpentine. A forked tongue flickers from his lips. As he rises from his stone chair, his cape swirls dramatically.\n\n\n\"So you've come to face me, hm? Me. LARCASSIO?!\"\n\n\nWhat is it with this guy and saying his own name?\n\n\n\"Yeah, that's right,\" you say, grimly. \"I've been dying to meet you. And now you're gonna be dying. But not to meet me. Just the regular kind of dying.\"\n\n\nDangit. That was your one chance to say something cool.\n\n\n\"Oh, my dear boy....\" Larcassio says, \"You do realize you'll be dead half a second after you pull that trigger...don't you?\"\n\n\n\"Of course I know that,\" you say, \"But I don't care. Maybe with you dead, Lyestra will have a fighting chance. It's not much, but it's all I can do.\"\n\n\n\"Dear me,\" Larcassio says, \"So you don't care if you live or die. How noble. But....what about.....\"\n\n\nHe lazily raises a finger towards the sky. You follow his gaze.....looking up.....and your heart sinks.", "action_results": [{"action": "Look Up", "result": "High, high above the camp, attached to one of the siege towers, a cage swings freely in the open air.\n\n\nAnd in that cage....\n\n\n\"Arakhan!!\" A pair of gloved hands grip at the bars of the cage. \"You're alive!! You made it!!\"\n\n\nYou feel sick. You recognize the green cloak of your friend and fellow guard--\n\n\n--It's Anaria.\n\n\n\"So....I, uh....caught the trail of this Larcassio creep,\" Anaria shouts down at you, \"I--uh, I almost had him! But he--um, kinda got the jump on me.\" She grimaces. \"Sorry, boss.\"\n\n\nLarcassio chuckles.\n\n\n\"If you shoot me with that bolt, that cage goes crashing to the ground,\" Larcassio says smugly, \"And do you think your dearest friend Anaria could survive such a drop? I think not.\"\n\n\n\"HEY! Boss! What's he saying down there?!\" Anaria shouts down at you, \"Whatever it is, don't listen to 'im! Kill the slimeball!!\"\n\n\nYour hand falters. You don't know if you can do it.\n\n\n\"Oh bother,\" Larcassio says. His forked tongue flickers. \"It seems that we're at a bit of a stalemate now, aren't we? I can't kill you, because then I might end up dead. And you can't kill me, because you're a sad excuse for a man. Whatever shall we do?\"", "action_results": [{"action": "Offer another solution", "result": "\"Alright,\" you say. You point at him. \"Let's make a deal. You. Me. One on one. A duel of honor.\"\n\n\nLarcassio cocks his head.\n\n\n\"A pretty desperate attempt...\" he says, \"I have you surrounded, you know....\"\n\n\n\"Yeah, and that's SO brave of you, isn't it?\" you say, \"You're the mighty Larcassio, right? Pretty tough when you've got a hundred goblins backing you up. But if you're too scared...\"\n\n\n\"SCARED??\" Larcassio bellows. He marches forward, and his cape swirls across the ground. He gets so close to you that the tip of your crossbow bolt digs into his chest. He's face to face with you. \"I'm not scared of ANYTHING!\" he proclaims.\n\n\nHe holds his hands high in the air.\n\n\n\"I burned your puny little village to the ground! And I will kill you easily, boy!\" He extends his arm. \"My fencing sword, if you please!\"\n\n\nThe goblins scramble.\n\n\n\"NOW!!\" he roars.\n\n\nFinally, a wizened goblin hands Larcassio an elegant sword. The hilt is flamboyant, encrusted with diamonds and pearls. The blade itself gleams brightly, reflecting the torchlight.\n\n\n\"Let's end this embarrassing display of resistance, shall we?\" Larcassio mocks, and slashes his sword at the ground. \"And then, we'll get what we really came for....\"\n\n\n\"Fine,\" you say, \"But if I win, Anaria and I go free.\"\n\n\nLarcassio laughs hysterically.\n\n\n\"En garde!\" he cries.", "action_results": [{"action": "Fight for your Life", "result": "You grab a fencing sword from the ground and defend yourself awkwardly.\n\n\nLarcassio paces back and forth, watching you and smirking.\n\n\n\"This will be even easier than I thought...\" he mutters.\n\n\nThe goblins have encircled the two of you, and they are cheering Larcassio on.\n\n\nYou frantically try to remember everything you know about fencing.....it isn't much.", "action_results": [{"action": "Assume a defensive position", "result": "You and Larcassio square off.\n\n\nA moment passes, both of you waiting to see what the other will do.\n\n\nThen, Larcassio lunges at you, blade outstretched!", "action_results": [{"action": "Attack", "result": "Larcassio's blade plunges into you.....\n\n\nThe world is spinning.\n\n\nYou see a pair of snake like eyes, and a sharp-toothed grin, and everything fades away......", "action_results": []}, {"action": "Parry", "result": "A *clink* as Larcassio's blade is parried away. He grunts and retreats quickly, defending himself.\n\n\n\"Good,\" Larcassio said, \"Let's keep this interesting.\"\n\n\nLarcassio is very near, defending himself.", "action_results": [{"action": "Attack", "result": "You swiftly attack Larcassio!\n\n\nHe bats your sword away with an expert parry.\n\n\nHe circles you, and then lunges at you, aiming for your neck.", "action_results": [null, null, {"action": "Parry", "result": "You parry the blow once more, but this time, Larcassio is thrown slightly off balance, opening up for just a millisecond--", "action_results": [{"action": "Attack", "result": "You try to set up an attack, but you're not in the right position to do that!\n\n\nLarcassio regains his footing, and circles you once again.", "action_results": [null]}, {"action": "Ward", "result": "You assume a defensive position.\n\n\nThe two of you hold your defensive stance.\n\n\n\"Come ON,\" Larcassio says, and you see his blade flash out towards you--", "action_results": [null, {"action": "Ward", "result": "Assuming a defensive stance was the right call.\n\n\nLarcassio didn't plan to attack, he only wanted to scare you.\n\n\nFortunately, you didn't fall for it.\n\n\n\"Thank goodness,\" Larcassio says, \"At least I'm not dealing with a total amateur.\"", "action_results": [null]}, {"action": "Parry", "result": "You try to parry, but it was a trick!\n\n\nLarcassio was merely feinting towards you, and now you're off balance.\n\n\nYou stumble backwards, trying to put as much distance between him and you as you can.", "action_results": [null]}, null, null, null, null]}, {"action": "Parry", "result": "You attempt to parry, but since Larcassio hasn't attacked you yet, you end up looking foolish.\n\n\nLarcassio bursts into laughter.\n\n\n\"What do you think you're doing?\" he asks.\n\n\nThe two of you go back to circling.", "action_results": [null]}, {"action": "Riposte", "result": "You riposte, and slash your sword across Larcassio's arm.\n\n\n\"GAH!!\" Larcassio screams, as he watches the blade strike across his flesh. Blue blood begins to pool and run down his arm, staining the blade.\n\n\nHe looks at you with hatred in his eyes.\n\n\n\"Oh, so you'd like to play ROUGH, huh?\" he says.", "action_results": [{"action": "Watch Larcassio", "result": "Larcassio is sweating a bit. He watches you carefully.\n\n\n\"Come on, HERO!\" he says, \"Let's see you FIGHT!\"\n\n\nLarcassio lets loose with a flurry of attacks.\n\n\nLooks like you're on the defensive--if only you'd paid better attention in fencing class!!", "action_results": [{"action": "Defend Yourself!", "result": "Larcassio stabs with a quick, sharp attack at your left shoulder.\n\n\nAssume a defensive position, quick!", "action_results": [{"action": "Prime", "result": "You knock Larcassio's sword away.\n\n\nHe follows up with another violent attack, this one aimed at your right leg.", "action_results": [null, {"action": "Seconde", "result": "You knock Larcassio's blade away.\n\n\n\"That was NOTHING!\" you shout.\n\n\nLarcassio swears and slashes straight down, right at your head!", "action_results": [null, null, null, null, {"action": "Neuvieme", "result": "You raise your sword high and block his attack a third time!\n\n\nThen you follow it up with a blow of your own. You swing the hilt of your sword forward, bashing Larcassio in the face with it.\n\n\nHe reels one step backwards, stumbling and cursing.\n\n\nNow's your chance! Go on the offensive!", "action_results": [{"action": "Attack", "result": "You attack, but Larcassio had a parry ready for you. He blocks your attack and drives forward, plunging his sword towards your right lung.\n\n\nDefend!", "action_results": [null, null, {"action": "Third Position", "result": "*Clink!*\n\n\nYou block the sword, and smash Larcassio in the face again. He staggers back a step, swearing and spitting.\n\n\nThis might be your only chance.", "action_results": [{"action": "Attack", "result": "You attack again, but this time Larcassio is wise to your moves.\n\n\nHis sword is stabbing up into your chest before you even reach him.\n\n\n\"Good riddance,\" Larcassio hisses, and throws your body to the ground.", "action_results": []}, {"action": "Lunge", "result": "You lunge at Larcassio, but unfortunately you overshoot the mark. He's too close for that!\n\n\nHe dodges you easily, and slips his sword into your ribcage.\n\n\nYou grip your side as you collapse to the ground.\n\n\nEverything goes dark.....", "action_results": []}, {"action": "Feint", "result": "You feint, and Larcassio falls for it!\n\n\nHe tries to parry your nonexistent attack, and throws himself even more off balance. He staggers backwards a few more steps, trying to put distance between you.", "action_results": [null, {"action": "Lunge", "result": "You lunge, putting as much force into the blow as you can.\n\n\nLarcassio is unprepared for the blow, and your momentum carries you straight forward, directly into his left shoulder.\n\n\nThe blade drives home, through his shoulder and out the other side. Dark blue blood gushes from his wounds.\n\n\n\"AGHHH!!!\" he howls. \"Who trained you?! Why aren't you dead yet?!\"\n\n\n\"I'm just naturally lucky, I guess,\" you say.\n\n\nWith an inhuman howl, Larcassio drops his sword and tackles you. Your sword goes flying, and clatters to the ground.\n\n\nLarcassio pins you to the dirt.\n\n\nHe starts punching you in the face viciously.\n\n\nAmid the blows, you notice your crossbow, lying just barely within reach. You might be able to grab it....", "action_results": [{"action": "Stretch your hand towards the crossbow.....", "result": "Your fingers crawl across the dirt, ever closer to the crossbow.\n\n\nYou try to maintain consciousness as Larcassio keeps hammering away at your face.\n\n\n\"I will NOT be humiliated by you,\" Larcassio swears, \"Not by some TWO-BIT, BACKWATER human!!\"", "action_results": [{"action": "A little further......", "result": "You stretch just a little more....success! Your fingers curl around the crossbow.\n\n\nYou have one shot!", "action_results": [{"action": "Shoot Larcassio", "result": "You swing the crossbow up and shoot at Larcassio's head.\n\n\nWith lightning reflexes, he dodges the bolt, and it goes sailing harmlessly off into the stratosphere.\n\n\n\"One last desperate attempt, hm?\" Larcassio says, \"Well, I'd be disappointed if you didn't try otherwise. Now, I must say....all this fighting has really worked up my appetite.\"\n\n\nThe last thing you see is Larcassio's mouth splitting open like an anaconda's, and then you feel razor sharp teeth dig into your neck.", "action_results": []}, {"action": "Shoot a nearby torch", "result": "Your fingers are trembling and bloodstained.\n\n\nLarcassio twitches for a minute when he sees the crossbow, ducking his head....but you don't aim it at him.\n\n\nYou swing it around and point it at a nearby torch, burning brightly.\n\n\n*click*\n\n\nThe crossbow bolt fires, splitting the wood of the torch neatly.\n\n\nThe torch plummets to the ground, quickly igniting a nearby tent.\n\n\n\"Wha--?\" Larcassio says. His attention is briefly turned from you.\n\n\nYou knee him in the chest.\n\n\n\"Ufffhhh!!\" he croaks, and you shove his weight off of you. He collapses to the ground and lies still.\n\n\nGoblins begin to sprint about, gabbling and shrieking. The flames are spreading rapidly. Tents ignite in seconds. The goblins scream and try to put out the blazes, but the camp is rapidly turning into an enormous bonfire.\n\n\nYou look around rapidly, and you see the siege tower that Anaria is hanging from. The flames have spread to the tower, and are starting to lick the base of the wood.\n\n\n\"Don't worry about me, boss!' Anaria cries, \"You did your job! Get outta here!\"\n\n\n\"Not a chance!\" you call up to her.", "action_results": [{"action": "Rescue Anaria", "result": "You sprint to the base of the siege tower. The goblins, for the most part, are wildly scrambling, and pay little attention to you. You hoist yourself up the wooden ladder.\n\n\nYou reach the top of the tower. Anaria's cage is tied to a jutting wooden outcropping. You get on your belly and shimmy along the outcropping.\n\n\nYou finally reach the cage, and swing your weight down. You start kicking at the door.\n\n\n\"You came back for me,\" Anaria says.\n\n\n\"Never leave a guard behind,\" you say. \"Stand back.\"\n\n\nAnaria retreats to the far end of the cage. You rear back, and give a tremendous kick to the door.\n\n\nIt explodes open. You extend your hand.\n\n\n\"Alright, come with me!\" you shout. Anaria grabs your hand, and the two of you scramble back up to the wooden outcropping, balancing on it precariously.\n\n\nIt's no wider than a tree branch. You breathe deeply.\n\n\nImagine that it's solid ground, you will yourself, don't think about the height...\n\n\nLike an idiot, you look down. From this height, the goblins look like a mass of green ants, scurrying to and fro as they flee the camp in a panic.\n\n\n\"Anaria!\" you shout. The roar of the goblins below is deafening, and the billowing smoke and heat is causing you to tear up. \"Let's get back to the siege tower before...\"\n\n\nOut of the smoke, you see a thin figure emerge.", "action_results": [{"action": "Larcassio.", "result": "\"Everything was going so well today,\" Larcassio says.\n\n\nHe's covered in scratches, sweat, and his own blue blood. He's breathing heavily, and his snake eyes flicker in the smoke.\n\n\n\"And then YOU happened.\" He strides forward, walking on the wooden beam as though it were a paved road. He has tremendous balance. You wobble slightly.\n\n\nLarcassio draws his rapier and prods you backwards, towards the edge of the outcropping. Even from this height, you can see the glint of your weapons, lying uselessly on the ground below.\n\n\nYou look back for Anaria--but she's gone.\n\n\nYou hear the groaning creak of wood.", "action_results": [{"action": "Attack Larcassio", "result": "You lunge at Larcassio, but you have no weapons. He simply laughs and pokes at you with his rapier.\n\n\n\"You have NOTHING, boy,\" Larcassio says, \"You just keep backing up, now. Or, you can end it quickly and jump.\"\n\n\nYou catch a glimpse of green. Anaria's cloak.\n\n\nShe's UNDERNEATH the wooden beam, crawling upside down like a monkey, getting closer to Larcassio with every second.\n\n\nYou lock eyes, and she motions you to be quiet.\n\n\nLarcassio takes another step towards you, his hair slick with sweat.\n\n\n\"Go on....\" he says.", "action_results": [{"action": "Stall", "result": "\"Tell me something, Larcassio,\" you say, \"Have you ever heard of the Stone Lions of Trapper's Glen?\"\n\n\n\"You're stalling,\" Larcassio says, \"Stop wasting my time...unless you'd rather die by the sword?\"\n\n\n\"No, give me this,\" you say, \"It's important. See, the Stone Lions are a bit of a legend in these parts. They worship riddles. They think that a riddle can tell you which person is the better man.\"\n\n\n\"We already know which of us is the better man,\" Larcassio sneers.\n\n\n\"Do we? Cause up to now, it seems like sort of a tie. Wouldn't you like to know for sure?\"\n\n\nYou flick your gaze down, and see Anaria, closing in on Larcassio. She's only inches away, but if he were to look down.....\n\n\n\"So you want one last challenge?\" Larcassio muses. The flames are billowing ever higher. It's going to be a miracle if any of you make it out of this alive.\n\n\n\"That's right!\" you yell, trying to keep his attention on you at all costs, \"I ask you a riddle. If you guess it, you're better than I am.\"\n\n\n\"EASY,\" Larcassio roars, \"Give me your best shot.\"", "action_results": [{"action": "Ask the Riddle", "result": "You close your eyes and take a deep breath.\n\n\nYou can picture Anaria, crawling across the beam, positioning herself under Larcassio's feet....\n\n\nYou open your eyes.\n\n\nI am the glue that binds heaven to earth,\n\nSea to shore,\n\nAnd raindrop to soil-\n\nChallenge me, and I shall always prevail\n\nDefy me, and I grow deadlier still.\n\nFor I bring all men down to the same level.\n\nWhat am I?\n\n\nLarcassio's eyes flicker wildly.\n\n\nHe doesn't know, you think. You catch a glimpse of Anaria. She's made it! She's directly underneath Larcassio. His cape billows around him, flickering just in and out of Anaria's grasp.\n\n\n\"All men...the same...\" Larcassio gnashes his teeth. \"The same--gah!! I--\"\n\n\n\"Time's running out, Larcassio,\" you say, \"What am I?\"\n\n\nLarcassio grips the sides of his head and howls in frustration.\n\n\n\"I---I DON'T KNOW!!!\" he screams.\n\n\nAnaria's hand clamps around the end of Larcassio's billowing cape.\n\n\n\"Gravity,\" you say.\n\n\nAnaria yanks once, hard.", "action_results": [{"action": "Gravity does the rest", "result": "\"AHHHHHHHHH!!!!\" Larcassio's final scream is a peal that echoes throughout the entire camp.\n\n\nYou watch his body pinwheel through space, falling down the length of the siege tower until landing with a thud on the earth, thirty feet below.\n\n\nAnaria swings her body up, as smoothly as a gymnast, and balances on the top of the beam.\n\n\n\"Sorry, boss,\" Anaria says, \"I guess I stole your revenge, huh?\"\n\n\n\"No time to worry about that,\" you say, \"We gotta get off this tower!!!\"\n\n\nThe two of you link hands and, using each other for balance, sprint across the beam.\n\n\nYou've only just made it across when the beam splinters and cracks, falling to the earth below in a shower of wood and smoke.\n\n\n\"Run--\" you say, panting for breath. The siege tower has gone up in flames. Keeping low to the ground, the two of you slide down the ladder, burning your hands on the wood.\n\n\nA few feet from the bottom, the siege tower begins to collapse, and you both leap to the earth, rolling and thudding across the ground.\n\n\nThe tower collapses in a magnificent display. Ash and flame burst into the sky.\n\n\nYou and Anaria clamber to your feet.\n\n\n\"Not bad for a day's work,\" Anaria says.", "action_results": [{"action": "Leave the Camp", "result": "You and Anaria stumble through the camp, often leaning on each other for support.\n\n\nYou're both coughing wildly from the smoke that fills the air. Everything is smokey confusion. The goblins nearly trip over you in their haste to find safety.\n\n\nThey've stopped caring about either of you long ago.\n\n\nFinally, you and Anaria clear the boundaries of the camp.\n\n\nTogether, you traverse the hills back to town, leaving the wreckage of the goblin camp far behind.\n\n\nYou've journeyed halfway across the hills when you see a cluster of villagers, running over the hills to greet you!\n\n\nFriendly faces, smiling, arms outstretched.\n\n\nJoad leads the pack, smiling for the first time in ages.\n\n\n\"We saw the smoke, captain,\" he says. He lets you lean your weight on him. You take a load off your ankle, which feels much better. You must have twisted it back at the camp.\n\n\nYour friend Lodan rushes towards Anaria, catching her and keeping her steady.\n\n\n\"Alright, easy does it, you two,\" Joad says, \"Let's get you back home.\"\n\n\nIn less than an hour, you and Anaria are back in the town of Lyestra.\n\n\nEverything is foggy. You feel hands tucking you tightly into a warm bed, and then the world goes dark.\n\n\nIt's been a long day.", "action_results": []}]}]}]}]}, {"action": "Reason with Larcassio", "result": "\"Listen, Larcassio,\" you say, \"This whole siege tower is about to go up in flames. And that means we go up in flames, too. You're just going to die with me unless we both escape right now!\"\n\n\n\"Do you think that MATTERS?\" Larcassio spits, \"I'm dead already. Gremgrawler will dice me into pieces when he finds out I let you burn this camp to the ground.\"\n\n\n\"Who?\" you ask, but Larcassio waves your question away. \"March,\" he says, \"Or you can save time and jump.\"\n\n\nYou catch a glimpse of green. Anaria's cloak.\n\n\nShe's UNDERNEATH the wooden beam, crawling upside down like a monkey, getting closer to Larcassio with every second.\n\n\nYou lock eyes, and she motions you to be quiet.\n\n\nLarcassio takes another step towards you, his hair slick with sweat.\n\n\n\"Go on....\" he says.", "action_results": [null]}]}]}]}]}]}]}]}]}, null, null]}, null, null]}]}, {"action": "Tierce", "result": "You protect your right shoulder, but that's not where Larcassio was aiming!\n\n\nLarcassio's blade plunges into you.....\n\n\nThe world is spinning.\n\n\nYou see a pair of snake like eyes, and a sharp-toothed grin, and everything fades away......", "action_results": []}, {"action": "Quinte", "result": "You protect your lower inside region, but that's not where Larcassio was aiming....\n\n\nLarcassio's blade plunges into you.....\n\n\nThe world is spinning.\n\n\nYou see a pair of snake like eyes, and a sharp-toothed grin, and everything fades away......", "action_results": []}]}, null, null, null]}]}]}, null, null, {"action": "Feint", "result": "You feint forwards, doing a 'fake attack,' but Larcassio isn't fooled. He continues to watch you carefully.\n\n\n\"You'll have to do better than that...\" he says.", "action_results": [null]}]}, null, null, null, null]}, null, null, {"action": "Riposte", "result": "You can only attempt a riposte after you've succesfully parried!\n\n\nYou end up looking foolish. Larcassio chuckles.\n\n\n\"This is going to be too easy....\" he smirks.\n\n\nThe two of you go back to circling.", "action_results": [null]}, {"action": "Remise", "result": "As you're flailing, you recall that a 'remise' is a follow-through attack, which can only be attempted after a lunge.\n\n\nYou end up looking a bit silly.\n\n\nLarcassio rolls his eyes.\n\n\n\"Please, give me some sort of challenge,\" he demands.\n\n\nThe two of you go back to circling.", "action_results": [null]}, null, null]}, null, null, null, null]}]}]}]}]}]}]}]}]}, {"action": "Tie the Rope to the Tower", "result": "Okay. The rope is firmly tied to the tower.\n\n\nNow what?", "action_results": [null, null, null, null]}]}]}]}, {"action": "Tell him you're here for a routine safety inspection", "result": "\"Well, buddy, I'm not gonna mince words,\" you say, confidently. \"Gruk, gruk's your name, right?\"\n\n\n\"Yes, my name Gruk.\" The goblin says, confused, \"How you know that?\"\n\n\nYou decline to mention that almost ninety percent of goblins are named Gruk.\n\n\n\"Name's Arakhan. Routine safety inspection,\" you say, extending your hand.\n\n\nGruk stares at your outstretched hand.\n\n\n\"Look, lemme tell ya, pal,\" you say, \"These siege towers are not up to code. You see this?\"\n\n\nYou stand near the edge of the tower and wave your arms.\n\n\n\"That's a thirty foot drop, pal. You're gonna need safety railing for all of these bad boys. Or I'm gonna have to shut down this whole operation. And don't think I didn't notice you're not wearing a hard hat. We take safety seriously on these big siege operations.\"\n\n\nGruk scratches his head, confused.\n\n\n\"Hm....\" he says. He's clearly thinking very hard. Then he snaps his fingers, triumphantly.\n\n\n\"Hold on second,\" Gruk says, smiling craftily at you, \"If you safety inspector....where your inspection permit?\"", "action_results": [null, {"action": "Make up a lie", "result": "\"Oh, uh,\" you pat at your body frantically. \"I must have left them in my....my other trousers.\"\n\n\n\"You try good,\" Gruk says, raising his bow, \"But you forget one thing....Gruk not know what trousers are.\"\n\n\nYou only have a second to feel infuriated at the illogicality of this moment.\n\n\nAn arrow pierces your heart.\n\n\nThis is probably the silliest way to die, you think, and that's really saying somethi-", "action_results": []}, {"action": "Pull Rank on him", "result": " \n\nYou storm forward, putting on your best show of blustering confidence.\n\n\n\"Well, I never!\" you shout, \"In thirty-five years, I have NEVER come across anything like this.\"\n\n\nGruk backs down, cowed.\n\n\n\"Oh, um,\" he says, \"Gruk am sorry.\"\n\n\n\"To think, I'm getting questioned by a grunt like you! The sheer nerve. You know, I could have your hide. Worse, I could have your JOB.\"\n\n\nGruk gulps.\n\n\nYou gesture to the edge of the siege tower, and Gruk toddles over to where you're standing. He peers down at the ground below.\n\n\n\"Now, I'm glad we had this little talk,\" you say. You smack Gruk on the back triumphantly.\n\n\n\"Whughh--whuh---\" the momentum of the smack sends Gruk pinwheeling forward.\n\n\nHe loses his balance and tumbles over the edge of the tower!\n\n\n\"Aggghhhhhhh---\" he screams, until his cry is cut short by a hard thud. You look down at the ground far below, and wince.\n\n\n\"Hm. Should've invested in safety railings,\" you say.\n\n\n ", "action_results": [null]}]}]}]}, {"action": "Sneak from Tent to Tent", "result": "Alright. Time to put your stealth skills to the test.\n\n\nYou quickly duck behind a plain brown tent.\n\n\nYou're gonna have to move fast and quietly. You scan the area.\n\n\nYou're surrounded by multicolored goblin tents. A ways north of you, you can see a clearing, just beyond a Black Tent. If you could make it to the Black tent, you're sure you could reach the goblin leader.\n\n\nYou're going to have to move fast and think quickly.\n\n\nThere's an orange tent to your right, and a yellow tent ahead of you. Both are silent.", "action_results": [{"action": "Go to the Yellow Tent", "result": "You are huddling behind a Yellow Tent.\n\n\nThere is a Green Tent up ahead of you.\n\n\nA Purple Tent to your right.\n\n\nAnd a Brown Tent behind you.\n\n\nThe Purple Tent is rustling.", "action_results": [{"action": "Go to the Green Tent", "result": "You are hiding behind a Green Tent.\n\n\nThere is a Black Tent to your right.\n\n\nAnd a Yellow Tent behind you.\n\n\nThe Black Tent is rustling.", "action_results": [{"action": "Go to the Black Tent", "result": "As you walk near the tent, a goblin explodes out of the tent flaps.\n\n\n\"GRAHHHH!!!\" he howls, and suddenly every tent explodes into action.\n\n\nIn seconds, you are overwhelmed.", "action_results": []}, null]}, null, {"action": "Go to the Brown Tent", "result": "You are standing behind a Brown Tent.\n\n\nThere is an Orange Tent to your Right.\n\n\nAnd a Yellow Tent up ahead of you.\n\n\nBoth tents are silent.", "action_results": [null, {"action": "Go to the Orange Tent", "result": "You are hiding behind an orange tent.\n\nThere is a Brown Tent to your left.\n\n\nA Purple Tent up ahead.\n\n\nA White Tent to your right.\n\n\nThe Brown Tent is rustling.", "action_results": [null, {"action": "Go to the Purple Tent", "result": "You are standing behind a Purple Tent.\n\n\nThere is a Silver Tent to your Right.\n\n\nAn Orange Tent behind you.\n\n\nA Yellow Tent to your left.\n\n\nAnd a Black Tent up ahead.\n\n\nThe Silver and Black Tents are rustling.", "action_results": [null, {"action": "Go to the Orange Tent", "result": "You are huddling behind an Orange Tent.\n\n\nThere is a Brown Tent to your left.\n\n\nA Purple Tent up ahead.\n\n\nAnd a White Tent to your right.\n\n\nThe White Tent is rustling.", "action_results": [null, null, null]}, null, null]}, {"action": "Go to the White Tent", "result": "You are hiding behind a white tent.\n\n\nThere is an Orange Tent to your left.\n\n\nA Silver Tent up ahead.\n\n\nBoth are silent.", "action_results": [{"action": "Go to the Silver Tent", "result": "You are huddling behind a Silver Tent.\n\n\nThere is a Purple Tent to your left.\n\n\nAnd a White Tent behind you.\n\n\nBoth tents are silent.", "action_results": [null, null]}, {"action": "Go to the Orange Tent", "result": "You are hiding behind an Orange Tent.\n\n\nThere is a Purple Tent up ahead.\n\n\nA Brown Tent to your Left.\n\n\nAnd a White tent to your Right.\n\n\nThe Brown Tent is rustling.", "action_results": [null, {"action": "Go to the Purple Tent", "result": "You are hiding behind a Purple Tent.\n\n\nThere is a Silver Tent to your Right.\n\n\nAn Orange Tent behind you.\n\n\nA Yellow Tent to your Left.\n\n\nAnd a Black Tent up ahead.\n\n\nThe Silver and Black Tents are rustling.", "action_results": [null, null, {"action": "Go to the Yellow Tent", "result": "You are hiding behind a Yellow Tent.\n\n\nThere is a Purple Tent to your left.\n\n\nA Brown Tent behind you.\n\n\nAnd a Green Tent up ahead.\n\n\nAll three tents are silent.", "action_results": [null, null, {"action": "Go to the Green Tent", "result": "You are huddling behind a Green Tent.\n\n\nThere is a Yellow Tent behind you.\n\n\nAnd a Black Tent to your right.\n\n\nBoth Tents are silent.", "action_results": [null, {"action": "Go to the Black Tent", "result": "You huddle behind the Black Tent.\n\n\nWait--can it be?\n\n\nThere, just ahead of you, you can see the center of camp!\n\n\nYou've made it!!", "action_results": [{"action": "Approach the Center of Camp", "result": "You load your crossbow and enter the camp center confidently.\n\n\nThe blue-skinned man is sitting on his stone chair, and he half rises as he sees you approach.\n\n\nYou keep your crossbow aimed steadily at his heart. Goblins have taken notice of you, and they start to move in, their weapons drawn...but none of them dare to strike.\n\n\nThey all know that you could fire your crossbow at any moment, ending their general.\n\n\nYou made it.", "action_results": [null]}]}]}]}, null]}, null]}]}]}]}]}, null]}]}]}, {"action": "Eavesdrop on the two goblins", "result": "\"Grbble grunkr?\"\n\n\n\"Grbn grrg gr.\"\n\n\n\"Ghr bgh grrg grkungkhgr grhrg!\"\n\n\n\"Ghrng ngrh grhnghk ghkrhgn gkrhgk.\"\n\n\n \n\n \n\nThis is very enlightening.", "action_results": [{"action": "Create a plan of action", "result": "You're standing just outside the entrance of the goblin camp.\n\n\nTwo goblin sentries are chatting and guarding the way forward.", "action_results": [null, null]}]}]}, {"action": "Go East, higher into the hills", "result": "You ascend the hills to the east.\n\n\nFrom this high vantage point, you can see the goblin camp!\n\n\nIt lies below, at the base of the valley. Hundreds of goblins are milling about, grabbling with each other and preparing for war.\n\n\nAnd there, in the center of the encampment, there is a stone chair. A thin, blue-skinned man sits in the throne, looking smug. He wears a long billowing cape.\n\n\nYou hit the ground suddenly as you hear the thud of heavy footfall. A MASSIVE goblin, almost seven feet tall, clomps within inches of your hiding place.\n\n\nHe's heavily armored and nearly three hundred pounds.\n\n\nThis is bad.\n\n\nThink quick!", "action_results": [{"action": "Leap on the Goblin's back and slit his throat", "result": "You jump onto the enormous goblin's back!\n\n\n\"HRNK???\" The goblin roars.\n\n\nHe plucks you off of his back as easily as if you were a tiny insect.\n\n\nHe throws you to the ground, and you slam painfully on your back.\n\n\n\"HGGGG.\" The goblin says, and then raises his club over your head.\n\n\nThe last thing you see is a club the size of a tree trunk rushing towards your face.", "action_results": []}, null, {"action": "Hurl a stone to the east as a distraction", "result": "You grab a stone and toss it as hard as you can to the east, the opposite direction from the goblin camp.\n\n\n\"Hnnnrhg?\" the giant goblin queries. He clomps off in the direction of the stone. He's gone for now!\n\n\nYou'd better move fast.", "action_results": [null]}]}]}]}]}]}]}]}]}, null]}, {"action": "Try to distract Riker", "result": "\"Hey IDIOT!\" you shout, waving your arms, \"Come and GET ME!\"\n\n\nRiker grabs the knife from the floor and runs at you, charging like a bull.\n\n\nYou quickly duck under a nearby table as Riker slams the knife down, missing you by a hair and lodging the knife in the wood of the table's surface.\n\n\nHe struggles with the knife for a few seconds, his loose bandage dangling just within reach.\n\n\nWhat will you do?", "action_results": [null, null, null]}]}, null, null]}]}, null]}, null]}, null]}]}, null]}, null, null, null, null, null]}]}]}]}, null, null]}, null]}, null]}]}]}]}, null]}, null, null]}]}, null, null, null, null]}, null, null, null]}]}, null]}]}, null]}, null]}]}, null]}]}