{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=16577", "context": "", "first_story_block": "This story takes place long ago, in the kingdom of Mystigar.\n\n\nThe King has recently passed, leaving his daughter, the beautiful winged-princess Marmalade, as the only heir.  The Princess is not yet of age, so she is left under the guardianship of the the unscrupulous Marques Jacques Pierre. Unsatisfied with being a mere Marques, he has conspired to marry her and seize the throne. \n\n\nIt is declared that a great fair and a tournament of archery shall be held in Marmalade's name. The victor will win her hand in marriage. The tourney is open to all, but the game is fixed, for everyone knows that the Marques is the greatest archer in the land.\n\n\nThe day of the fair is upon us! You play the part of a humble baker's apprentice who, unbeknown to all, is destined to be king!", "action_results": [{"action": "Act I", "result": " \n\nAct I:\n\n\nThe Fair", "action_results": [{"action": "The baker's apprentice", "result": "Today is the day of the fair!\n\n\nThe sun is not even fully up, but already your chores are done. The oven is lit, the dough kneaded, the bread pricked, the floor swept, and the pots scrubbed. You even had a chance to chop a little morning-wood, if you know what I mean.  Surely now your master will let you spend the rest of the day at the fair. You have thought of nothing else since it was first announced.\n\n\nYou are busy day dreaming about Princess Marmalade, again, when a shout comes down from the loft; \"Boy!\" Your cantankerous master is finally awake. The ladder strains under his bulk as he climbs down to the kitchen. \"Get off your ass, boy, and warm the ovens,\" he says.\n\n\n\"Master, the ovens are already warm. All of my chores are done. I thought perhaps I could go to the fair?\" you reply.\n\n\nA meaty hand strikes your face. \"The fair! The fair's for minstrels and dandies. Which one are you, boy? Or did you fancy you'd win the tourney and marry the Princess?\" he says, doubling over with laughter. \"Long live King Baker's Boy! Forget that lot and go fetch me some milk.\"\n\n\nHe hands you a copper and sends you out the door with another smack.\n\n\n\"And if I find out you've gone to the fair, boy, I'll chain your face to the oven!\"\n\n\n\"Bastard,\" you curse under your breath while rubbing your swollen lip. One of these days you will chain his fat face to the oven. You head towards the Milkman's stand. He always has a bottle of spirits to share with the young apprentice boys, and his daughter Bessa has the biggest milk jugs you've ever seen.\n\n\nYou reach his stand but no one's there. \n\n\n ", "action_results": [{"action": "Go to the Milkman's house", "result": " \"Hello?\" you call as you knock on the Milkman's door. There is no reply but the door is open, so you step inside.\n\n\n\"Great Gods put out that light and stop all this hollerrin'. Can't a man rest his achin' head?\" the Milkman says from his bed. He pulls the covers over his head, spilling several clays jars to the floor. He has had a long night of drinking with the thatcher's boys. \"If you want milk you'll have to get it yourself. Bessa's gone to the fair and I sure as hell ain't doing it in my condition.\" Just your luck, both the spirits and Bessa are gone.\n\n\nYou can hear the cow lowing from the shed, begging to be milked. You grab a pail and sit down on the milking bench.", "action_results": [{"action": "Milk the cow", "result": "You milk the cow while dreaming of Bessa's heaving udders. You are in the shed for much longer than it takes to milk a cow. \n\n\nYou heft the pail and walk back to the house. The Milkman has slipped back into his stupor. You can hear him mumble something about the thatcher's boy and soft hands. There is really no need to pay him. He probably won't even remember you've been here. Screw the Milkman and screw the Baker! It's the day of the fair, you have a copper in your pocket, and you're going to enjoy yourself! You drink deep from the milk bucket before casting it away. You are the master of your own destiny!\n\n\n--\n\n\nThe fair is everything you had hoped. Highborn ladies and goodly knights recite poetry outside of colorful silk pavilions. Naked urchins chase each other about playing tag and brown-fingers, while drunken minstrels belt green sleeves at the top of their lungs. Vendors call their wares from various carts and stands. \n\n\nA fat pastry chef with a pox-marked face yells \"Hot pies! Two coppers!\" while a dwarf cries her ale. You are hungry but cannot afford a pie. The Dwarf, however, will let you drink yourself stupid for a copper. \n\n\nYou look around the crowd hoping to catch a glimpse of the Princess. You spy her in the royal box above the tourney field, framed by a pair of guards who look more jailor than escorts. For one moment your eyes meet and she smiles. \n\n\nA herald cries out below her. \"Gather all yee who would compete in the tourney of archery\" he proclaims. \"To the winner shall be awarded a golden bow and the hand of the beautiful Princess Marmalade. Any man of Mystigar may enter for a single copper.\"\n\n\nA copper for a chance to marry the Princess? What luck!", "action_results": [{"action": "Enter the tourney", "result": "\"Each of ye shall havith three arrows\" says the herald. \"If one of these touchith the bulls eye, you shall advancith to the next round.\" Only one? Piece of cake.\n\n\nA trumpet blows, signaling the start of the round. You nock your arrow, take careful aim, and release. The arrow soars into the air well above the target. Undismayed, you nock your second arrow. This one buries itself in the dirt halfway to the target. Archery is harder than it looks.\n\n\nThis is your one chance to be more than a baker's apprentice. Everything rides on this last arrow. You close your eyes, and imagine your life with the Princess. You see yourself perched between her magnificent wings, your face hidden amongst her golden locks as you soar above the castle. You fly higher and higher, throwing rocks down upon the screaming peasants below. You release the arrow.\n\n\nA perfect bulls eye!\n\n\nRound after round your arrows strike the mark as other contestants are eliminated. The Princess takes notice of your success. Eventually, only you and a single opponent are left; The Marques Jacques Pierre.\n\n\n\"My hat is off to you, good sir\" he says cordially between rounds. \"Tell me, who are you and where did you learn to shoot so well?\"\n\n\n\"I'm just a baker's boy,\" You mumble to him.\n\n\n\"Surely you jest. Never have I heard of a baker's boy with such skill, a true prodigy. You must come hunting with me sometime, I fear the beasts won't stand a chance! But lo, look at this string! it is worn thin and ready to snap. Please change it out for one of mine. it is of the finest make. I won't have it said I took advantage of a poor baker's boy.\"\n\n\nWhat a fine fellow is the Marques. You change out your string and promise to take him up on his hunting offer.\n\n\nYou are summoned to the Princess's private box. \"Baker's boy, you have given me hope for the first time since my father passed,\" the Princess says. \"Defeat the Marques and you will have my heart as well as my hand.\" Wow, no pressure there.\n\n\nThe trumpet sounds to signal the final round. \"For the last and final round, each man shall shootith a single arrow, and the better mark shall win the hand of Princess Marmalade!\" announces the herald. The targets are moved back one hundred feet.\n\n\nThe Marques offers to shoot first. He makes a good shot with his golden arrow just touching the edge of the bulls eye. You approach the mark and prepare to draw, conscious that the Princess is watching you.", "action_results": [{"action": "Draw your bow", "result": "Snap! The new string breaks under the strain, slashing open your cheek. Your arrow does a lazy summersault before landing at your feet.\n\n\n\"The Marques is the winner!\" declares the herald.\n\n\nThat filthy cad, he tricked you! He knew the string would break. You brandish your bow like a club and charge the Marques, but by now the tourney field is overrun with spectators and you cannot reach him through the press. For a moment your eyes catch those of the Princess and she gives you a plaintive look before her and the Marques are carried away. \n\n\nSome hours later you sit at the Dwarf's stall, attempting to drink away your sorrows. You rub the fresh scar on your face, swearing revenge.\n\n\nThere is a tap on your shoulder. You turn to find a mysterious hooded figure behind you. \"A gift,\" she says, \"from the Princess, for her true champion. Please help her before she is forced to marry.\" She hands you a bundle, and disappears into the night. Could it be true? Does the Princess really need your help?\n\n\nA small bone harp without any strings is wrapped with in the bundle. What the hell are you supposed to do with this? Sing your sorrows? You ask the dwarf how much beer the harp will buy, hopefully enough to give you alcohol poisoning.\n\n\n\"You drunk fool! That's no ordinary harp,\" she shouts, \"it's the Harp of Dreams! If you string this harp with the mane of a unicorn and sing the Song of Wishes your greatest wish will come true.\" \n\n\nThat makes sense.\n\n\n\"Take this seed\" says the dwarf, handing you a small pearl. \"The tree which grows from it is the Unicorn's favorite food. Plant it in the Enchanted Forest and he will come to feast upon it.\"", "action_results": [{"action": "Travel to the Enchanted Forest", "result": " \n\nAct II:\n\n\nThe Song of Wishes", "action_results": [{"action": "Now things start to get weird...", "result": "The story resumes with you hopelessly lost in the enchanted forest.\n\n\nHungry and tired, you sit on a log to rest and get your bearings. A delicious looking mushroom is growing from the end of the log. You recognize its shiny white cap and blue spots as an edible Dwarf's Finger, then again, it could be a clown egg for all you know, you're not a doctor. ", "action_results": [{"action": "Eat the mushroom", "result": "Delicious! A single bite and you feel completely refreshed. You set off through the Enchanted Forest with an extra swing in your step. \n\n\nSome while later you come upon a dappled glen. A waterfall throws a thin cloud of mist across the clearing and fireflies dance among the rich green leaves. This spot looks as good as any to plant the magic seed. You dig a shallow hole and gently cover the seed with rich brown earth. \n\n\nA magnificent tree shoots forth from the soil. Higher and higher it twists, growing upward. Hundreds of white flowers sprout from its tender shoots, filling the air with their nubile fragrance. Somewhere off in the distance, you hear a horse's neigh. ", "action_results": [{"action": "The unicorn appears", "result": "A majestic white stead gallops out of the mist in slow motion, and stops at your side. You reach for its opalescent mane when your sphincter suddenly loosens. The unmistakable smell of diarrhea fills the air. Your back arches in agony, and your stomach fills with fire. The unicorn screams and runs back into the mist, while blood and puss pours from your belly button... \n\n\n--\n\n\nThe clown looks down at your shredded body for a moment before slithering after the unicorn. I guess it was a clown egg after all.\n\n\n \n\nYou've Died", "action_results": []}]}, {"action": "No way, that's obviously going to kill me", "result": "You sensibly leave the mushroom alone. Better to be hungry than dead, you always say.\n\n\nSome while later you come upon a dappled glen. A waterfall throws a thin cloud of mist across the clearing, and fireflies dance among the rich green leaves. This spot looks as good as any to plant the magic seed. You dig a shallow hole and gently cover the seed with rich brown earth. \n\n\nAn enormous tree shoots forth from the soil. Higher and higher it twists, growing upward. Hundreds of white flowers sprout from its tender shoots, filling the air with their nubile fragrance. A magnificent opalescent unicorn gallops out of the mist and kneels at your feet.\n\n\n\"Long ago it was foretold that the true king of Mystigar would plant the sacred tree of the unicorn in this glade,\" says the unicorn. \"Take the hair of my mane as a token of-\" A golden arrow sprouts from his neck before he can finish his sentence.\n\n\n\"Capital shot sir!\" comes a shout from behind you. The Marques and his lackey, Wendell, come riding across the glade, bows in hand. \n\n\n\"Great gods, if it isn't the baker's boy. I thought I had seen the last of you,\" says the Marques. \"Now stand aside. That unicorn's horn will make the perfect wedding gift for the Princess.\"", "action_results": [{"action": "Run and hide", "result": "You run blindly into the forest, tears streaming down your face and urine streaming down your leg. What a fool you were to think you could help the Princess.\n\n\nHours pass and you are hopelessly lost. You notice a melodic humming in the distance, like the muffled song of a beautiful maiden. Perhaps it will lead you to safety. The song enchants you, and you follow it deeper into the forest.\n\n\nEventually you find the song's source. The humming emanates from a small clay jar perched upon a toadstool. The melody changes, as if to say \"open me,\" and you are unable to resist. You raise the lid and hundreds of angry siren wasps swarm from the jar. Their relentless stings paralyze you, and you lie helplessly while they lay their eggs in your swollen tongue.\n\n\n \n\nYou've Died", "action_results": []}, {"action": "Stand and fight", "result": "You plant yourself in front of the unicorn, fists bared. You've had enough of this pompous Marques. The Marques shrugs and then draws his golden sword. He charges. You duck the blow and kick his horse squarely in the taint. The horse reels, throwing the Marques to the ground.\n\n\nThe Marques is quickly back on his feet and after you again. Defenseless, you are driven backwards. You stumble and the Marques's sword bites deep into your side.\n\n\n\"Sorry it kneads to end like this, baker's boy\" he laughs. He raises his sword for the final blow. \n\n\nThe unicorn, seeing your peril, summons his last bit of strength. A magnificent light radiates from his horn. Blinded, the Marques drops his sword and falls to his knees. You seize the moment and grab the sword. The time has come for your revenge.\n\n\nThe light goes out.\n\n\nWendell stands over the dying unicorn, triumphantly holding the severed horn. Blood loss overcomes you. The sword slips from you hands and you collapse.\n\n\n\"It seems your plan has gone a-rye, baker's boy,\" the Marques quips. He retrieves his sword and picks up the harp. \"Look, Wendell, I'm a little baking minstrel singing songs about pastries on my ugly little harp,\" he sings, capering around you before tossing the harp away derisively. \"Too bad you won't have time to compose a song for my wedding. Come, Wendell, we must get back in time to pick out invitations.\"\n\n\nYou catch one last piece of their conversation as they ride off: \"Explain how this works again, Wendell. Where do I strap the horn?\"\n\n\n\"Your Majesty,\" the unicorn says softly. You crawl to his side as the life flows from your body. \"You must drink of my blood, it is the only way to heal your wounds.\" There is probably another way, maybe a bandage or some salve. Not one to argue with a mythical being, you cup a handful of turquoise blood and bring it to your lips. It tastes like rainbows and dreams. The blood courses through your body, healing you.\n\n\n\"You are the true king of Mystigar. Take the hair of my mane and string the harp. Now, you must go to the crossroads and seek the wise sage. Only he can teach you the Song of Wishes.\" The unicorn begins to fade. \"Don't let the harp fall into the wrong hands. Its powers can be used for great good, or great evil. I must depart from this world, but do not fret for you and I are now one. My spirit will always watch over you. Always...\" The unicorn disappears. From that day on you get the uncomfortable feeling he's watching you whenever you go to the bathroom. \n\n\nYou resume your journey with a heavy heart.", "action_results": [{"action": "The journey continues...", "result": "The forest path eventually leads you to a quaint cottage. A centaur stands out front, raking leaves. The centaur stops raking as you approach. \"Good morning traveler, will you help me tend my garden?\" asks the centaur. \"In exchange I shall give you my daughter's hand in marriage.\"\n\n\nA deal like that is too good to pass up, but how would that even work, you wonder. Perhaps there a special stool or something. You are struggling for a polite way to ask when his daughter trots from the cottage. Her beauty rivals that of Princes Marmalade. She bashfully plays with her long golden braid, and paws the ground playfully with her silver hoof. \n\n\nIt would be impolite to turn down his offer, but you are on a quest. The centaur knows much about quests and the Enchanted Forest, perhaps he can help with your journey.\n\n\n ", "action_results": [{"action": "Tend the centaur's garden", "result": "That night you find yourself in the cottage, alone with the centaur's daughter. She throws you to the ground with incredible centaur strength. She tears off her leather vest, and towers over you in a dominating fashion.\n\n\n\"Tickle my udders, human!\"\n\n\nYou fall hopelessly in love and are married at once. You spend your days raking the centaur's garden and your evenings serenading the centaur's daughter with your harp. At night you lie in her stall, curled up as little spoon, wondering how many legs your children will have. \n\n\n \n\nThe End\n\n\nSure, things worked out fine for you, but how could you abandon the Princess? And seriously, how does that work?\n\n\nYou've found an N. Discover more letters to solve the Legendary Riddle.", "action_results": []}, {"action": "Ask about the sage", "result": "\"They say the sage is a thousand years old and can see another thousand years into the future. Of course, they also say us centaurs can't wipe our own asses,\" the centaur says. \"Anyway, no one has ever seen the sage, or if they have, they didn't live long enough to talk about it. Travel east across the river to the Crossroads. A spirit guide will appear there and guide you to the sage.\"\n\n\n\"But beware of the Haunted Castle!\" he cautions. \"It is ruled by an evil demon and she is not to be trusted.\"\n\n\nYou take one last look at the centaur's daughter before heading east down the forest path. The centaur calls after you: \"It's not true you know! We can wipe our asses just fine!\"\n\n\n--\n\n\nThe sun is high overhead when you reach the river.\n\n\nThe river is too wide and too strong to ford. If you had a wagon, you might be able to caulk it and float across. The Haunted Castle stands ominously on the river's edge, guarding the only bridge across. It exudes an evil aura.  Luckily, there is also a ferry docked on the near shore.", "action_results": [{"action": "Take the ferry", "result": "The ferry is manned by an old leper, draped in shapeless brown rags. His skin is hard and gray, giving him a reptilian appearance. The right side of his body is a misshapen mess of boils and warts. He seems friendly, despite his appearance. \n\n\nYou climb aboard and he begins to pole you across. \"What soft, pink skin you have,\" the ferryman says. \"I bet your worm wiggles like a fish on a string when you walk around. My poor gray balls look like a blueberry stuck to a grapefruit. I can't hardly fit them in my britches, let alone a woman.\"\n\n\nA scaly hand shoots from the water and grabs your arm, interrupting the leper's graphic description of his genitals. The ferryman smacks the arm away with his pole before it can drag you from the boat. Hundreds more rise from the depths. They grab at the boat, churning the river water in a feeding frenzy.\n\n\n\"The River Hags are hungry today.\" The ferryman says. He rises and corners you in the bow of the boat. \"Now, hand over that harp or I will toss you overboard.\"", "action_results": [{"action": "Give him the harp", "result": "The ferryman rips the Harp from your grasp.\n\n\n\"Long ago I foresaw this day. How patiently I have waited here for you!\" he exclaims. \"Now all the world shall know my suffering.\"\n\n\nHe strums the Harp and sings the Song of Wishes. His leprous boils fade as he sings, and his skin becomes supple and pink. Your skin erupts with gray boils as his curse is transferred to you. Your foreskin twists up like a balloon animal and warts fill your throat. You start to choke...\n\n\n \n\nYou've Died", "action_results": []}, {"action": "Leap from the boat", "result": "Your leap causes the small boat to capsize and the ferryman is thrown into the water with you.\n\n\nThe leper has been working this river since before you were a stain on your mother's thigh, and the River Hags have been waiting patiently to get their hands on him. They converge upon him and you are momentarily forgotten while they satiate their blood lust. His gargled screams are barely audible over the sound of tearing flesh. \n\n\nYou quickly swim to shore while they are distracted and resume your journey.\n\n\n--\n\n\nThe forest path gradually becomes a lane, and the lane becomes a road. Eventually, it leads you to your destination. A stone pillar rises phallicly from the Crossroads, marking the spot were a dozen paths meet like spokes on a wheel. Three animals step from behind the pillar: a frog, a raven, and a fox. \n\n\n\"Welcome your majesty,\" says the fox.\n\n\n\"We are the spirit guides,\" says the frog.\n\n\n\"We have waited long for you,\" says the crow. \n\n\nYou can tell this is going to get annoying really quickly.\n\n\n\"I am the regrets of man,\" says the frog.\n\n\n\"And I am the sorrows of man,\" says the raven.\n\n\n\"And I am the wiles of man,\" says the fox.\n\n\nYou have no idea what they're talking about. All you care about is which one can lead you to the sage.\n\n\n\"Maybe all of us\" says the crow.\n\n\n\"Maybe none of us,\" says the frog.\n\n\n\"You'll have to trust your heart,\" says the fox.", "action_results": [{"action": "Follow the Fox", "result": "You follow the fox for some distance through the forest when he stumbles. \"Ah I've stubbed my toe. You're going to have to carry me,\" says the fox. \"Please, it really, really, hurts. Carry me and I can tell you where to go. Pretty please.\" His toe looks fine, but you reluctantly pick up the spirit fox. \"Oh you have such strong arms,\" he says.\n\n\nYou travel many miles and the forest becomes dark and ominous. The trees are decorated with shrunken heads and human bones which dangle from their branches like wind chimes. You enter a rocky clearing and deep voice booms from the forest, \"Who dares seek the great sage?\"\n\n\n\"That's my cue,\" says the terrified fox. He hops from your arms and quickly scampers away. It seems his toe has been miraculous healed. \n\n\nA massive lion leaps onto the rocky outcrop ahead of you. He is so large a horse could ride down his gullet. Skulls and bones are tied in his mane like trophies. \"If you wish to see the sage you must answer my riddle. Answer wrong, and I will add you to my decorations\n\n\n\"What rises tall and hard in the morning, showers its golden rays down upon the children, and then, exhausted, hangs its head between the stones?\"", "action_results": [{"action": "The sun", "result": "\"Hmm that's not what I was thinking, but now that you mention it, it could be the sun. You have proven your worth. You may enter.\" The lion opens his enormous mouth and beckons you inside.\n\n\nInside the lion is quite spacious. His ribs form an elegant vaulted ceiling. Goblin skulls, troll bladders, and other magical odds and ends line the wall. A unicorn horn lies discarded next to a pile of furs which serve as the sage's bed.\n\n\nThe sage is a bent old man cloaked in a rat-skin robe. He is balding and barefoot, and a single tooth protrudes from his bottom jaw. \"I've been waiting for you,\" he says. \"You are the chosen one who will learn the Song of Wishes. But first you must be cleansed by a bath in witch's blood.\"\n\n\nYou undress and climb into a large stone tube. The sage pours buckets of thick witch's blood over your head. It runs down your face and into your mouth. \"Hard to believe that witch fills one of these buckets every month. Now about that song. Close your eyes.\" The sage sheds his robe and slips into the tub with you. His tooth cuts sharply into your nipple. A melody fills your mind as he sucks away your life force. It is the Song of Wishes.\n\n\n\"Well that's the song,\" the sage says, wiping his lip. \"You can only sing it once, so use it wisely. Now enough business, lets play tub fountains!\" You leap from the tub and hastily dress. \"Suit yourself,  I'll play a solo match. If you're gonna leave you'll have to use the backdoor. Should put you just outside of town.\"\n\n\nAs you crawl out through the lion's colon, your thoughts turn to the Princess.", "action_results": [{"action": "You return to town", "result": "The town is quiet now, the pomp of the fair forgotten. You swagger down the empty street like a cockerel. You found the unicorn, fought the Marques, met the wise sage, learned The Song of Wishes, and you still have time before the wedding. But what are you waiting for? You could sing the song right now and be probing the Princess by nightfall.\n\n\nYou pluck the silky strings of the harp and clear your throat. Before the words can leave your lips a meaty hand falls on your shoulder.\n\n\n\"Hello boy.\"\n\n\nIt's the Baker! He grabs the harp from your hands and gives it a derisive pluck before throwing it over his shoulder. \"I knew you'd run away and become a dandy minstrel. But you're still my apprentice, boy, and I warned you what would happen if you went to the fair...\"", "action_results": [{"action": "Act III", "result": "Act III:\n\n\nThe Wedding\n\n\n ", "action_results": [{"action": "Meanwhile back at the castle...", "result": "Wendell walks down the muddy street with a list of errands in his hand. He stops in front of the florist's shop when a small bone harp lands at his feet. There is a commotion out in the street; the town baker has just thrown a portly little boy over his shoulder. \n\n\n\"The baker's boy is still alive,\" Wendell says to no one in particular. \"I must warn the Marques!\" He tucks the harp under his arm and races back to the castle. \n\n\n--\n\n\nThe Marques slams closed the tower door. A red, hand-shaped welt mars his face. The Princess hasn't taken the news well.\n\n\n\"The Princess and I are to be married immediately,\" he tells Wendell. \"See that everything is ready. Arrange a special welcome for the Baker's Boy in case he decides to join us. Come to my chambers when you've finished. I need to be fluffed for my wedding night,\" the Marques says, loosening his belt. \n\n\n--\n\n\nInside the tower cell the Princess weeps. She runs to the window, as if to throw her self from the tower, but iron bars prevent her.\n\n\nA small white dove comes to rest on the sill. \"My faithful servant,\" sobs the Princess. \"The Marques has the harp and now I fear the Baker's Boy shan't save me in time. Please, you must find him. I will die before I marry that wicked Marques!\"\n\n\nThe dove flies away with the Princess's last hopes.", "action_results": [{"action": "The denouement", "result": "The Baker makes good on his threat and chains your face to the oven. \"I'm going to the castle to delivery some pastries for the wedding. You'll be nice and crispy by the time a get back.\" The door slams as he leaves. The oven is already warm against your skin.\n\n\nYour face grows hotter every second. Sweat rolls down your body, basting your coin purse in your own grease. You struggle to escape, but the chains are too tight. You cry out for help, but the only one around to hear you is a tiny white dove perched on the window sill.\n\n\nIn response to your cry, the dove transformers into a beautiful cloaked woman. You recognize her as the mysterious woman from the fair, though now her belly is swollen with pregnancy.  \"Come Baker's Boy, you must hurry, the wedding is taking place as we speak,\" she says. Lightning bolts fly from her fingertips, shattering the chains.\n\n\n\"But what can I do without the harp? How can I even get into the castle in the first place?\" you ask.\n\n\n\"The castle is expecting food delivered for the wedding,\" she says. \"You can bake a cake and hide inside. The guards will wheel you right up to the chapel.\" What a clever idea. You roll up your sleeves and start to bake.\n\n\nWhen the cake is finished, you hollow it out and climb inside.\n\n\n\"I have a final gift for you,\" the cloaked woman says. She spreads her legs wide and squats down. An egg falls heavily to the floor. \"This egg contains the last of my power. Cracking it shall grant you immense strength.\" Bloody afterbirth trickles down her leg. She begins to fade.\n\n\n\"My dearest Marmalade,\" she says softly. \"How I will miss the sweet taste of your nectar.\" There is a flutter of wings and the woman is gone.\n\n\nSurrounded by confection, you realize you haven't eaten anything in a while and this cake looks almost as tasty as that mushroom back in the forest. Surely a tiny taste won't hurt.", "action_results": [{"action": "Try a tiny bite", "result": "The cake is delicious, perhaps the best you've ever made, but it is too rich for your empty stomach. Your bowels turn, rejecting the sweet frosting. Clench as you might, you cannot prevent the inevitable and your bowels release like a spouting whale. The stench is overwhelming in the confines of the cake. You are both proud and disgusted.\n\n\nArrangements had been made for the thatcher's boys to deliver the cake to the castle. There, a portly guard runs his greasy finger through the frosting to sample the cake. \"What the hell?\" he shouts, spitting out the cake. \"What'd you put in this? It tastes like sewage. Take it away.\"\n\n\nYou and the cake are unceremoniously thrown onto the garbage heap. The foul, garbage-air is refreshing after hotboxing in your own stink.\n\n\nYour arrival has startled a filthy beggar picking through the refuse. He squints at you with one good eye before cracking open a pigeon bone and sucking out the marrow.\n\n\nThe heap offers you a commanding view of the castle. The chapel bells are tolling across the courtyard, but the chapel door is heavily guarded. How will you get in?\n\n\n ", "action_results": [{"action": "Change clothes with the beggar and sneak in", "result": "The beggar is happy to take your clean clothes in exchange for his rags, even if your pants are a bit crusty. \n\n\nThe guard stops you as you approach the chapel. \"What do we have here? A dirty scrounger at the royal wedding?\" laughs the guard. \"Wait a minute, I recognize you. You're that thrice-damned Baker's Boy!\" he shouts, drawing his sword. \"Wait, no, my mistake. He's a chubby, pimply fella' who smells like onions. You smell like sewage and garbage. Go on inside.\"\n\n\nYou are about to step inside when he grabs your collar. \"I recognize you now. You're One-Eyed Dan. You're that rascal who broke into the smithy and stole the blacksmith's shoes. And then you set fire to the orphanage and raped all those innocent children while they burned alive.\"\n\n\nThe laws of Mystigar take shoe thievery very seriously. The guards seize you, and drag you to the dungeon.\n\n\n--\n\n\nRows of cells line the dungeon walls. They are all empty except for one. In the last cell a diminutive man sits hunched over a pale, eating greedily. He turns to you as the guards march you passed. Excrement stains his face like brown clown makeup. He is clearly mad.\n\n\nThe guards escort you to the torture chamber at the end of the hall for execution, but it seems you will have to wait your turn. \n\n\nA screaming prisoner is strapped upright on a board with a funnel in his mouth. A powerful lodestone hangs before him. The gaoler stands on a stool with his back to you, pouring nails down the funnel. He then pulls the lodestone close to the prisoner's stomach. The iron nails are drawn upwards by the stone's attractive power. The prisoner screams. \n\n\nThe gaoler is none other than Wendell, the Marques's lackey! You must pay him back for what he did to the unicorn.\n\n\nYou slap your apron pocket, breaking the magic egg within. The cool yolk runs down your thigh. A tingle of electric energy races across your skin, standing all of your hairs on end while your scrotum fills with arcane energy. The power is overwhelming. Lightning flies from your fingers, striking the guards. Their armor glows red hot, cooking them alive inside. \n\n\nWendell is no match for your powers. He tries to run but the bolts catch him. His skin sizzles and cracks like a hot dog too long on the fire. You strike him with bolt after bolt until their is nothing left but ash. \n\n\nThe spell fades and your scrotum retreats into your body like a scared snail. You pull the funnel from the prisoner's mouth. \"Thank the gods! I am Sebastian, Prince of Cecum, betrothed of Princess Marmalade,\" he says. \"I know a way into the chapel, release me and together we shall save the Princess.\"", "action_results": [{"action": "Free Prince Sebastian", "result": "\"Thank you. I'm not looking forward to using the privy tonight, that's for sure,\" Sebastian says.\n\n\nThe Prince presses on a false stone in the dungeon wall, revealing a hidden passage. \"They brought me in this way. The tunnels are like a maze. Stay close so you don't get lost,\" he says.\n\n\nHe leads you through a tunnel carved in the back of the dungeon. Your path twists and turns through the maze-like tunnels. \"The Princess and I have been promised since birth. When the king passed, I received a letter from the Marques inviting me to the castle to choose wedding invitations, but it was a trap. He had me locked away so I couldn't interfere with his plans.\" \n\n\nYou come to a fork in the tunnel. The sound of distant music fills the left-hand tunnel, a septic odor emanates from the right-hand one. \"Say chap, why exactly do you want to save Princess Marmalade?\"", "action_results": [{"action": "\"Because I love her, and I'm going to marry her!\"", "result": "The right-hand path leads deep below the dungeons. You move cautiously through the darkness with Sebastian following close behind. The tunnel ends abruptly at the edge of a wide chasm and Sebastian maliciously shoves you over the edge.\n\n\nYou land waste deep in the castle septic pit. The chasm is one hundred feet across and hundreds deep. Pipes stick out from the walls at various angels, delivering waste from all over the castle. A thin film of urine and peanuts coat the pit's surface. It smells awful.\n\n\n\"Sorry chap, but that slut Marmalade drips like a sink, and I won't be a cuckold king,\" Sebastian shouts down to you. The echoes of his parting words are interrupted by the pitter-patter of fresh feces falling into the pit.\n\n\nSomething stirs in the depths. The filth bubbles as the segmented body of a giant tapeworm rises before you. \"A thousand yearsss I have waited here for you, baker'sss boy,\" the tapeworm hisses. \"Once I have consumed you, the curssse will be broken and I shall be free of thisss pit.\"\n\n\nThe parasite's square maw distends impossibly wide. The last thing you see is a kernel of corn stuck between its pointed teeth. \n\n\n \n\nYou've Died\n\n\n ", "action_results": []}, {"action": "\"I don't know, some chick gave me a magic harp.\"", "result": "You and Sebastian rush up the left-hand tunnel, and soon burst out into the light of the chapel. Princess Marmalade stands upon the altar, her hands and wings tightly bound. \n\n\n\"Jacques Pierre! You have Marmalade's hand,\" shouts Sebastian. \"I will die before that day comes!\" He snatches a decorative sword from the wall and charges the Marques. \n\n\nThe Marques draws his golden sword. \"Then we duel,\" he says.\n\n\nThey rush together and the sound of clashing steel fills the chapel. You untie the Princess while your betters are preoccupied. \"I knew you would save me,\" she cries, throwing her arms around you. \"You're such a good friend.\" \n\n\nSebastian delivers the Marques a fatal blow and then struts up and grabs the Princess about the waist. They kiss furiously, while the Marques bleeds out. When Sebastian finally dislodges his tongue from Marmalades' throat, he slaps her ass and gives you a knowing wink.\n\n\nThey are married immediately and the Princess names you both royal baker and maid of honor.\n\n\n \n\nThe End\n\n\nIf you're a really, really good friend it could eventually turn into something more, right? You're pathetic.\n\n\nYou've found an O. Discover more letters to solve the Legendary Riddle.", "action_results": []}]}, {"action": "Screw him, he's your rival", "result": "A faint sound catches your ear. It is the muffled, but unmistakable sound of organ music coming through the walls. There must be a hidden passage. You search the dungeon walls, looking for the source of the sound. The Prince, afraid of losing his only leverage, sings at the top of his lungs.\n\n\n\"There's no room here for you, the Innkeeper said, but I know the Innkeeper's daughter, and there's always room in her bed!\"\n\n\nHis efforts are in vain. Your search uncovers a false stone in the wall, and pressing it reveals a hidden tunnel. You can follow the music all the way to the chapel. Looks like you will not be needing the Prince's help after all.\n\n\n\"Wait! You can't just leave me like this,\" the Prince pleads.\n\n\nHe's right. You casually kick the lodestone to him. Its attractive force tears the nails through his bloated stomach.  His corpse reminds you of a blowfish on its period. You race down the tunnel towards the wedding chapel.\n\n\n--\n\n\nA magnificent stained glass window bathes the chapel in rainbow light. Guests fill every pew and more stand in the balcony above. Gifts are piled high on a table in the center of the room. Among them is the gold bow the Marques won at the fair.\n\n\nThe Princess and the Marques stand on an altar with their backs to you. He is about to place a ring on her finger. You shout Marmalade's name and are immediately surrounded by guards. Crossbowmen emerge from the balcony. The organist stops playing. It is an ambush.\n\n\n\"Well well, the guest of honor has finally arrived,\" says the Marques, laughing. He reveals the harp of dreams from beneath his cloak. \"I want to play you a tune our mutual friend, the Sage, taught me.\" He plays the Song of Wishes more deftly than you ever could. Your heart sinks when he reaches the final line:\n\n\n\"Harp of Dreams, punish this knave. Turn the Princess into my slave.\"\n\n\nThe harp shatters and the Princess falls to her knees screaming. When she stands again she has changed; she has lifeless eyes, black eyes, like a doll's eyes. \n\n\n\"Give me a kiss, darling,\" the Marques commands. She gives him a long, passionate kiss. \"Now, kill the baker's boy.\"\n\n\nThe Princess takes flight with a piercing shriek. She circles the chapel once and then dives down and attacks. The guards and guests scatter in fear. You dash under the gift table, narrowly avoiding her wrath. The Princess circles again, building up speed for a second dive. You grab the golden bow, knowing you will only have one shot. You nock an arrow, close your eyes, and draw the bow.", "action_results": [{"action": "Shoot the Princess", "result": "Snap! The string breaks and your arrow falls impotently to the floor. The Marques doubles over with laughter. You have fallen for the same trick twice.\n\n\nThe Princess swoops down and seizes you in a raptorial embrace. Slowly she climbs, struggling to lift your bulk. She will drop you to your death once she gains enough altitude. That magic egg sure would have been handy right about now. There must be another way out. It cannot end like this.\n\n\nTrue love.\n\n\nOf course! The Harps's curse can be broken by true love's kiss. You plant a big wet one on the Princess's pulsating cold soar. She bites through your lip in reciprocation and spits it out to the floor below. Blood fills your mouth.\n\n\nOr not.\n\n\nThe Princess reaches the ceiling and releases her grip...\n\n\n \n\nYou've Died\n\n\n ", "action_results": []}, {"action": "Shoot the Marques", "result": "The arrow strikes the Marques in the heart. He stumbles once, like a roofied school girl, and then falls from the altar. The spell controlling the Princess is broken with his death. She drops from the sky like a bird striking a plate glass window. \n\n\n\"What have I done!\" she exclaims. \"I have attacked my own subjects whom I am sworn to protect. I am not fit to be Queen, so I must leave Mystigar tonight in penance. You will rule in my stead baker's boy.\"\n\n\n--\n\n\nYour reign is consumed by a single thought: the Baker. He disappeared on the day of the wedding, and was never seen again.\n\n\nYou pour all of the resources of Mystigar into searching for him but the trail is cold. You are unyielding. Bakeries are destroyed, bakers hanged, and ovens outlawed. All other duties are forgotten and the kingdom withers, bankrupted by your single-minded quest.\n\n\nParanoia eats away at you. You know he is out there somewhere, plotting against you. You will find him.\n\n\n \n\nThe End\n\n\nYou really went off the deep end there. Who knew you were so high strung? Better try again, but this time don't leave any loose ends.\n\n\nYou've found a G. Discover more letters to solve the Legendary Riddle.\n\n\n ", "action_results": []}]}, {"action": "Free the mad man instead", "result": "You open the prisoner's cell. \"Thanks mate,\" the mad man says. He shoves a bone shank between your ribs when your back is turned. \"You have such pretty skin my sweet angel, and plenty of it too. I think I'll sew it into a new raincoat, perhaps a hat and a nice pair of slippers too. But first, I need to finish my lunch.\"\n\n\n \n\nYou've Died\n\n\n \n\n ", "action_results": []}]}, {"action": "Use the egg and storm the gates", "result": "You draw the magic egg from your pocket and crack it over your head. Power surges through your limbs. Your manhood swells to thrice its size and curly black hair sprouts from your chest. The guards are no match for your immense strength. You crash through the chapel door in a shower of splinters. \n\n\nA magnificent stained glass window bathes the chapel in rainbow light. Guests fill every pew and more stand in the balcony above. The Princess and the Marques stand on an altar at the head of the chapel with their backs to you. He is about to place a ring on her finger. You shout Marmalade's name and are immediately surrounded by guards. Crossbowmen emerge from the balcony. It is an ambush.\n\n\nThe guards take one look at your pendulous manhood and flee screaming. The Marques, equally impressed, grabs the Princess by her shoulders and throws her through the stained glass window and then runs for the exit. You chase him up a twisting staircase and onto the chapel roof.\n\n\nCornered at the edge of the roof, the cowering Marques cries out for mercy, but you have none. You raise a gargantuan fist and... the power suddenly fades. Your manhood shrivels back to its normal size. The Marques is quick to capitalize. He draws his golden swords and takes the offensive. \"The tables have turned, baker's boy. Too bad you couldn't rise to the occasion,\" he quips. \n\n\nHe drives you back to edge of the roof. Your foot slips and you tumble down the angle of the roof. You catch the gutter, and dangle between the buttresses like the last anal bead. The ground is a long ways below. Your sweaty hand cannot hold on for long. You lose your grip and fall.\n\n\n--\n\n\nThe Marques sheaths his sword and turns away. \"Perhaps I was a bit hasty with the Princess. I can't marry her now if her face is all cut up.\"\n\n\nThe sound of wings fills the air and you rise above the roof, riding on Princess Marmalade's back, triumphantly hold the Harp of Dreams.\n\n\n\"Impossible!\" the Marques shouts in surprise.\n\n\nHarp strings resonate with energy as you play the Song of Wishes. \"Jacques Pierre shall reap what he's sown. Harp of Dreams, turn him to stone!\" you sing.\n\n\nThe Marques tries to run but, but no one can out run magic. The spell catches him at the edge of the roof, where he still stands today, a gargoyle frozen in mid stride. They say you can hear him cry out on stormy nights when the rain runs from his mouth.\n\n\n--\n\n\nYou and the Princess are married at once, and at long last you find yourselves alone in bed. Your stare into her disfigured face, trembling, searching for the right words. She breaks the silence first. \"Say, could you do that thing were your grow huge again?\" she asks. \"Pretty please?\"\n\n\n \n\nThe End\n\n\nBoy is she going to be disappointed. You did well for a mere baker's apprentice, but some of the bad guys got away. \n\n\nYou've found an S. Discover more letters to solve the Legendary Riddle.", "action_results": []}]}, {"action": "Stop trying to get me killed!", "result": "You wisely decide not to eat your disguise.\n\n\nArrangements had been made for the thatcher's boys to deliver the cake to the castle. There, a portly guard runs his greasy finger through the frosting to sample the cake. \"Delicious!\" he exclaims. \"Take it to the kitchens at once.\"\n\n\nYou are deposited in the kitchen where you hear a familiar voice: \"Careful with those pastries, boy! Drop one and you'll feel the back of my hand.\" Even though the voice is muffled by the cake, there is no mistaking the Baker. \n\n\nThe urge for revenge is almost as strong as your desire to save the Princess. You fondle the magic egg in your apron pocket.", "action_results": [{"action": "Kill the Baker", "result": "You crack the egg over your head. Power surges through your limbs. Your manhood swells to thrice its size and curly black hair sprouts from your chest and back. You explode from the cake and smash a giant fist into the Baker's face, shattering bone and rupturing white heads. The spit boys and scullery maids run screaming.\n\n\nYou ram the Baker's broken face into the side of the oven again and again, searing his flesh. When there is nothing left but the empty rind, you fold him in half and stuff him into the oven. The magic fades and with it your blood lust. You run for the chapel.\n\n\nA magnificent stained glass window bathes the chapel in rainbow light. Guests fill every pew and more stand in the balcony above. Gifts are piled high on a table in the center of the room. Among them is the opalescent horn of the unicorn.\n\n\nThe Princess and the Marques stand on an altar at the head of the chapel with their backs to you. He is about to place a ring on her finger. You shout Marmalade's name and are immediately surrounded by guards. Crossbowmen emerge from the balcony. It is an ambush.\n\n\n\"Well well, the guest of honor has finally arrived,\" says the Marques, laughing. He reveals the harp of dreams from beneath his cloak. \"Your meddling has gotten stale baker's boy. It ends here.\" He strums the strings and a tremor runs through the hall. The power of the harp should not be taken lightly.\n\n\nThe room shakes violently. Columns crack and the floor twists beneath your feet. The guests panic and stampede for the exit. In the confusion you are able to break free from the guards.\n\n\nThe Marques must be stopped before he brings down the entire chapel. You dash towards the alter but Wendell blocks your way. The stained glass window explodes, showering the hall with colorful razors. You must act quickly.\n\n\nWendell draws his sword. You back pedal, narrowly avoiding his thrusts, until you hit the gift pile and can retreat no more. You desperately grope for a weapon and your hand finds the unicorn horn. You drive the horn upward, penetrating Wendell like a tavern-whore. His expression changes from triumph to bewilderment. The sword falls from his grasp and he collapses. You hear the unicorn's voice whisper \"my spirit will always watch over you.\" \n\n\nThe Marques, sensing defeat, leaps through the window to his steed below. You rush to the Princess and throw your arms around her. \"There is no time!\" she shouts. \"We must retrieve the harp before it brings down the whole castle. Climb on.\" You climb onto her back. She spreads her wings and flies through the window in pursuit.", "action_results": [{"action": "The chase is on", "result": "Flying with the Princess is every bit as thrilling as you had imagined. You cannot conceal your excitement. \"Quit poking me, I'm trying to fly,\" she complains. \n\n\nThe fairgrounds appear below you. They are empty and quiet now. You chase the Marques to the archery grounds. The Princess folds her wings and begins her attack dive. \"Hold on we're-\"\n\n\nA golden arrow sprouts from her throat. The Marques has retrieved his bow and arrows from the tourney and loosed a fateful shaft. The Princess cartwheels uncontrollably and you tumble form the sky.\n\n\nYou barrel into the Marques, breaking your fall. He is knocked out cold. You crawl to the Princess and cradle her lifeless body. Tears stream from you eyes. \n\n\nHow could this happen? Everything has been in vain. She loved you, she needed you, and you failed her. A ragged scream tears from your throat, and then you see the harp. Of course! The power of the harp can revive her. You play like you have never played before. You put everything you have into the song. You reach the last line:\n\n\n\"Powers of magic, hear my cry. Harp of Dreams...\"", "action_results": [{"action": "Don't let the Princess die!", "result": "The Princess is revived by the power of the harp. The harp shatters, its purpose fulfilled. The Marques is quickly apprehended and thrown into the dungeons for treason. \n\n\nYou and the Princess are married at once. Your coronation follows all of the boring traditions and ceremonies like the vigil, the rites, and the human sacrifice.\n\n\nAt long last the moment you have been waiting for arrives; you find yourself alone with the Princess. She sits naked upon the bed, her delicate wings covering everything but her blushing face. Her violet eyes say everything her mouth is afraid to. ", "action_results": [{"action": "Kiss her", "result": "After a brief and dutiful consummation you lie in bed with your arms around the Princess. You tell yourself \"it happens to every man\" but you know it's a lie. \n\n\n\"I can't wait to spend the rest of our lives together, but will you still love me when I'm old?\" The Princess asks.\n\n\n\"Of course,\" you reply.\n\n\n\"Would you still love me if I was fat? Would you love me if I went bald? Would you love me if I was in a wheelchair? Would you still love me if all of my skin fell off and my bones had chickenpox...\"\n\n\nGreat gods, what have you done?\n\n\nThe End\n\n\nSuch womanly nonsense. Quickly, go back and tickle her udders!\n\n\nYou've found a D. Discover more letters to solve the Legendary Riddle.\n\n\n \n\n ", "action_results": []}, {"action": "Tickle her udders", "result": "The sun is high in the sky when you awake. The Princess still sleeps beside you amidst the satin sheets, bowlegged with a fresh black eye purpling her pretty features. You rise and fill the basin on your nightstand and wash the urine from your hair. What a night! A Princess for your first time, where do you go from here?\n\n\nAll hail the king of Mystigar!\n\n\nCongratulations! You win! My favorite part was when you rode the minotaur-hydra. What was yours? \n\n\nYou've found a U. Can you solve the Legendary Riddle: \"What did the baker's boy give the Princess on their wedding night?\"", "action_results": []}]}, {"action": "Kiss the Marques good bye!", "result": "The harp transforms into a wickedly twisted knife; its power fills you with unimaginable strength. \n\n\nWith one hand you lift the broken Marques by his blonde locks. His eyes are filled with fear. He whispers \"please,\" but there is no mercy left in your heart. You drive the blade into his eye socket so hard the hilt breaks his nose and the tip protrudes from the back of his skull. You hurl his dead body into the gutter where the rats and the hobos can take turns defiling it.\n\n\n--\n\n\nThe rain pours down as you turn to take one last look at the castle. The people of Mystigar had begged you to stay and be their king, but only sorrow remains for you there. With a heavy heart you leave Mystigar behind and head into the unknown. Someday, you will have your own kingdom, your own queen. But that is another story...\n\n\n \n\nThe End?\n\n\nKilling the Marques won't bring Princess Marmalade back, but it sure felt good, didn't it?\n\n\nYou've found an H. Discover more letters to solve the Legendary Riddle.", "action_results": []}, {"action": "Send me a delicious pie!", "result": "The pie is delicious.\n\n\n \n\nThe End\n\n\nThere is nothing like a freshly baked pie.\n\n\nYou've found a T. Discover more letters to solve the Legendary Riddle.", "action_results": []}, null]}]}, {"action": "Stay hidden and wait for the ceremony", "result": "Inside the cake is dark, and stiflingly hot. The thick confection muffles all sound from the outside world. It only takes a few minutes for you to fall asleep. \n\n\nThe wedding ceremony concludes and the guests gather around the Marques and his crying bride. He draws his golden sword and slices the cake into pieces with a flurry of swordsmanship. The guests gorge themselves, remarking on the cake's delicious filling. Even the Princess smiles as she takes a bite. \"This is the best cake I've ever had,\" she says.\n\n\n \n\nYou've Died", "action_results": []}]}]}]}]}]}]}, {"action": "It's your, um you know, manhood...", "result": "\"I don't understand,\" the lion says.\n\n\nYou know, the ole sword and stones. Your little wizard. Your widow-splitter. Ham-weasel. Stink-diver. Turkey neck?\n\n\n\"Enough! You are not worthy, so you must perish,\" roars the lion. You try to run, but you are a fat little apprentice boy and he's a one hundred foot magic lion.\n\n\n \n\nYou've Died", "action_results": []}]}, {"action": "Follow the Crow", "result": "The crow leads you to a land of mountains and fire. A single round hill lies amongst the jagged peaks. Thousands of clamorous birds flock around its crown. It is to there that you must climb. The crow leaves you to join the flock.\n\n\nWhen you finally crest the hill you find it is not a hill at all.  You have mounted the belly of an enormous cyclops. Her horned head towers five hundred feet above you, where the birds nest as if she was a seaside cliff. They take turns diving down into the crevices of her nether regions to fill their gullet before returning to feed their young. Her ancient breasts roll listlessly from her belly, resting on the ground one thousand feet below. \n\n\n\"What gift have you brought me in exchange for my knowledge?\" the cyclops booms.\n\n\nNo one told you anything about a gift. You have nothing with you except your clothes and the harp. The harp! What a brilliant idea you could serenade her. Then again, honesty is the best policy.\n\n\n ", "action_results": [{"action": "I have brought you the gift of music", "result": "You clear your throat and strum the harp to find the key.\n\n\n\"Oh I know the innkeeper's daughter...\" \n\n\nYour song is interrupted by a tremor running through the Cyclops's gut. Geysers of sulfur erupt from beneath her prodigious bulk, scattering the flock of screaming birds.\n\n\n\"Enough!\" the cyclops thunders. \"You are not worthy of my knowledge!\"\n\n\nHer belly fat ripples and ungulates, tossing you about like waves on the ocean. You lose your footing and slide down the curvature of her belly towards certain death. At the last moment you grab hold of a pubic hair as thick as a ship's cable, but it is slick with sweat. Her huge crevice gapes open below you, waiting to swallow you whole. The hair slides from your hand and you fall into the darkness.\n\n\n \n\nYou've Died", "action_results": []}, {"action": "I have no gift", "result": "\"Nothing!\" Booms the cyclops. She fixes her gaze on you, but her eye drifts lazily down and to the left.  \"Then you must do something for me.\" Several birds separate from the flock carrying a fluffy pink dress...\n\n\n--\n\n\n\"Dance prettier! 1 2 3, 1 2 3, and turn. Yes!\" the cyclops giggles. Her clapping hands sound like thunder. \"Now tell me who's a precious little baker's girl? Uh oh, I see something poking out from under that skirt.\"\n\n\nEnough is enough. You stop dancing and cross your arms defiantly. It's time you learned the song.\n\n\n\"Very well.\"\n\n\nOne by one screeching birds descend from the flock. They peck and claw at the cyclops's nipple, tearing it to bloody ribbons. Her single eye rolls back in her head as a quiver of ecstasy runs through her flesh. The birds draw an ancient scroll from the ruin of her nipple. The scroll is made from tanned griffin foreskin and covered in mysterious runes. A song fills your mind as you read it. \n\n\n\"Now you know the Song of Wishes. The song can only be sung once, so sing it wisely, my pretty girl.\" A sudden wave of exhaustion overcomes you. You curl up in the cyclops's naval and fall asleep.\n\n\nYou awake alone, on the road just outside of town.", "action_results": [null]}]}, {"action": "Follow the Frog", "result": "For a day and a night you follow the frog. At long last you come to the edge of a vast morass. The water is filled with a churning mass of thick, red eels. This is the swamp of the ancient sage.\n\n\nYou wade for miles, waste deep in eels, before reaching a reed hut hidden in the mist. After a prolonged farewell, the frog dives beneath the eels and disappears. You timidly knock on the hut door. \"Come in!\" comes the reply from within.\n\n\nThe sage sits in the center of the hut, her prodigious bulk resting on a nest of reeds. Her skin is blue and hairless. A pair of tiny flippers twitch with delight as dragonfly servants drop spotted mushrooms down her enormous gullet. An endless stream of red eels pours from her backside, falling through a hole in the floor, to the swamp below. \n\n\n\"I have been expecting you, baker's boy,\" she says. \"You have come to learn the Song of Wishes. I will teach it to you in exchange for a kiss.\"", "action_results": [{"action": "No thank you", "result": "You politely decline. The sage makes a face of such hideous dejection you almost feel sorry. Almost. \"Very well. Give me the harp and I shall teach you the song.\" \n\n\nHer fins move deftly along the strings as she plays. The song is oddly soothing until she reaches the final line. \"This song was merely a ploy, to receive a kiss from the tender baker's boy.\"\n\n\nA strange desire takes hold of you. You're lips are drawn to her slimy skin. \"I will have my kiss one way or another, baker's boy,\" she laughs.\n\n\nYou kiss her turgid lips, her smooth scalp, the dark place beneath her flippers. Eels slither down your throat as you give her the most sensual kiss of all. If you still had a gag reflex, you might have been saved. Instead, the eels fill your lungs and you slip into darkness.\n\n\n\"Kissy kissy!\" squeals the sage.\n\n\n \n\nYou've Died", "action_results": []}, {"action": "Kiss the sage", "result": "You close your eyes and plant an openmouthed kiss on her turgid lips. Her tongue tastes like violation. \"Mmmm choke me,\" coos the sage. It takes two hands to squeeze her blubbery throat. \"Ahhh, now I will teach you the song you desire.\"\n\n\n\"Slaves! bring me the box,\" she shouts. A dragonfly delivers her a small, intricately carved box. She raises the lid and a tiny beetle flies out. It lands on your shoulder and crawls into your ear. You feel a wriggle, a pinch, and then an electric shock. A song grows in your mind like the threads of a chrysalis.\n\n\n\"Now you know the Song of Dreams, but be warned, the song can only be sung once, so sing it wisely. And don't worry about the beetle, he'll find his way out eventually,\" says the sage. \"The path north of this hut leads back to town. Now, they say a parting kiss is sweetest.\"\n\n\nYou quickly thank the sage and head down the path before she can kiss you again.", "action_results": [null]}]}]}]}, {"action": "Take the bridge", "result": "The castle door swings open before you can knock.\n\n\nAn old woman greets you. Her skin is wrinkled like that of a dried apple. Her curled blue hair is tucked up under a bonnet, and her time-ravaged breasts are tucked into the belt of a robe. She squints at you through thick spectacles. \"Oh a visitor! How exciting. Come in. Come in,\" she says. \"You smell like a centaur's stable. I never cared for centaurs. Lying sluts.\"\n\n\nInside the castle is unremarkable, except for the pervasive old person smell and the abundance of decorative plates. You feel none of the evil presence you experienced before.\n\n\n\"You youngsters are always in such a rush. I insist you stay and rest for the night. It gets so lonely here. I would appreciate the company. Would you care to join me for dinner before turning in?\"\n\n\n ", "action_results": [{"action": "Join her for dinner", "result": "A long table spread with wondrous food and drink fills the dining room. The old woman takes a seat at the head of the table, and you saddle up at the far end, fill your goblet with wine, and slice off a thick piece of foot-meat from the nearest roast. \n\n\n\"Everyone, I would like you to meet our guest, the Baker's Boy,\" the old woman says. You look around, but the remaining seats are all empty. \"Gerald, sit up straight. Isabelle dear, don't smell your fingers at the table. Its rude,\" she says to no one. \"I'm sorry. Ghosts have the worst table manners. Tell me, what are you doing way out here?\"\n\n\nYou excitedly tell her and the ghosts all about your adventures so far. \n\n\n\"Oh, my poor child,\" the old woman says. \"That strumpet has already forgotten all about you.\" She draws a crystal ball from beneath the table and waves her hand over it. A picture forms inside. You see the Princess in bed with the Marques and the Baker. Impossible! She would never... Would she?\n\n\n\"I've always wanted a son like you. Why don't you forget about that tart Marmalade and stay here with me?\"", "action_results": [{"action": "Stay and be her son", "result": "\"You are mine now,\" the old woman says.\n\n\nYour body starts to tingle and your vision changes. The room grows darker and one by one the ghosts come in to view. Isabelle waves her sticky fingers at you in greeting. Hundreds of ghosts fill the hall, each a weary traveler like yourself.\n\n\nYou can see the old woman's true form now. She is a benevolent demon with blue skin and four arms. \"Come feed, my children,\" she beckons, opening her robe and revealing a dozen swollen teats. You nestle in beside Gerald and fill yourself with mother's love.\n\n\nYou are home.\n\n\n \n\nThe End\n\n\nThe bottled stuff just doesn't compare to the real thing.\n\n\nYou've found an I. Discover more letters to solve the Legendary Riddle.", "action_results": []}, {"action": "Decline her offer", "result": "\"How dare you refuse me!\" the old woman screams.\n\n\nHer skin sloughs away revealing a matte of dirty black fur, a long naked tail, and a pointed snout with curving incisors. Her true form is that of a rat-succubus which feeds on the souls of lost travelers. Black blood pours from his beady, red eyes. \"I will have you one way or another!\"\n\n\nYou run from the table, one step ahead of the demon. Angry ghosts follow her like wisps of smoke. She is almost upon you when you step out onto the bridge and she slams into a magical barrier like a bird hitting a picture window. Ghosts and demons are unable to leave the castle.\n\n\nThe demon's frustration is palpable as she paces the barrier, staring at you and salivating. She hurls herself against it repeatedly, checking it for weaknesses. You hurriedly resume your journey before she can break through.\n\n\n--\n\n\nThe forest path gradually becomes a lane, and the lane becomes a road. Eventually, it leads you to your destination. A stone pillar rises phallicly from the Crossroads, marking the spot were a dozen paths meet like spokes on a wheel. Three animals step from behind the pillar: a frog, a raven, and a fox. \n\n\n\"Welcome your majesty,\" says the fox.\n\n\n\"We are the spirit guides,\" says the frog.\n\n\n\"We have waited long for you,\" says the crow. \n\n\nYou can tell this is going to get annoying really quickly.\n\n\n\"I am the regrets of man,\" says the frog.\n\n\n\"And I am the sorrows of man,\" says the raven.\n\n\n\"And I am the wiles of man,\" says the fox.\n\n\nYou have no idea what they're talking about. All you care about is which one can lead you to the sage.\n\n\n\"Maybe all of us\" says the crow.\n\n\n\"Maybe none of us,\" says the frog.\n\n\n\"You'll have to trust your heart,\" says the fox.", "action_results": [null, null, null]}]}, {"action": "Go to bed early", "result": "The old woman leads you to a small tower bedroom, helps you out of your apron, and tucks you into bed.\n\n\nThere is a strange black candle on your nightstand. \"The castle can be a spooky place at night,\" the old woman says. \"This candle will keep the ghosts away, but be careful it doesn't go out.\"\n\n\nShe kisses you on the forehead and takes her leave. No sooner has she closed the door, than you hear the ghosts. Terrifying wailing and moaning fill the hall outside your room. There must be hundreds haunting the castle. \n\n\nIt is impossible to sleep with a ghost orgy going on in the next room, so you slip under the covers for some fun of your own. You are so deep in your geriatric fantasies, that you fail to notice a small draft extinguish the candle.\n\n\nThe bedroom door bursts open. You throw off the covers expecting a ghost, but it is only the kind old woman. \"I warned you not to let it go out,\" she cackles. Her mouth opens wide, and then wider, and wider still, like a snake deep-throating a rat. Smoke like apparitions crawl from her gullet and float towards you. They envelop you and drag you towards her waiting jaws...\n\n\n \n\nYou've Died", "action_results": []}]}]}, {"action": "Ask about unicorn blood", "result": "\"Gross! I can't believe you drank that!\" laughs the centaur. \"Classic Unicorn. A joker until the end. That reminds me of the time he and I snuck into the waterfall and stole the mermaids' Swallow Stone. We said we wouldn't give it back until they had each... well this isn't a story to tell in front of my daughter. You should probably go brush your teeth. Any other questions?\"", "action_results": [null, null]}]}]}]}]}]}, {"action": "I said give me more ale!", "result": "You awaken in a pool of vomit on the floor of a dark cave. Your head hurts so badly that even the faint light is unbearable.  Where are you? What did you do last night? Why is it so cold?\n\n\nYou search yourself and your surroundings for clues. You find a severed horse leg tied around your neck, your apron pocket is stuffed with birdseed, your pants are missing and you might be wearing lipstick, but you can't be sure. If you ever find your way out of this cave you're going to find that dwarf and shake her hand, she makes damn good beer.\n\n\nYour thoughts are interrupted by a voice echoing from the far reaches of the cave: \"Finger puppets. Finger puppets.\" Although it is faint, it is clearly not human.\n\n\n\"Finger puppets. Finger puppets!\"\n\n\nThe voice grows louder. Something is coming and you need to escape.  \n\n\n\"Finger puppets!\"\n\n\nIn the distance you can see a dim light. \n\n\n\"Finger puppets!\"", "action_results": [{"action": "Run for the light", "result": "The light grows as you run towards it. Behind you the shouts have become a frantic wale; \"Finger puppets! Finger puppets!\" It is not just a light at the end of the tunnel, it's a hole! You can see the sky beyond, but the voice is right behind you now. \n\n\nYou leap for the opening, but it is too small, and you get stuck halfway through. Something grabs you. You kick and struggle but you feel yourself slipping backwards...\n\n\n\"FINGER PUPPETS!\"\n\n\nThe ground gives way beneath you and you tumble out into the open sky. You land with a splash in a bog. High above, a giant hand retracts into the gaping cave mouth, holding the severed horse leg.\n\n\nThe world around you is not the one you left. You are at the base of a mountain surrounded by an endless jungle. Bone spires reach thousands of feet into a blood red sky. You have come to the land of dragons. Just how much did you drink last night?\n\n\n \n\nThe End\n\n\nI'm sorry, did you want to battle dragons? When I was a kid I wanted a puppy, but I didn't get it. Life is disappointment. Learn to handle your ale.\n\n\nYou've found an H. Discover more letters to solve the Legendary Riddle.", "action_results": []}, {"action": "Stand and fight", "result": "Bravely you brandish the severed horse leg. \"Finger puppets!\" The voice is so close now that you can hear the shuffling of giant feet. A shadow falls across you...\n\n\nA hideous giant stands in the mouth of the tunnel. Its shrunken, rotting, head scrapes the ceiling high above you. Its immense belly drags along the floor between his legs like a field plow. Most terrifying of all, a corpse covers each of its grotesquely long fingers; every finger but one. The corpse arms dances about as it reaches for you...\n\n\n\"FINGER PUPPETS!\"\n\n\n \n\nYou've Died", "action_results": []}]}]}]}, null, {"action": "Steal a pie", "result": "The pie is delicious.", "action_results": [null, null, {"action": "Steal another pie", "result": "You grab a particularly delicious looking pie. Your anus puckers with anticipation as you bite through the flaky crust. The pie is delicious. You devour it greedily and the warm ambergris filling drips down your chin. But during your binge, you fail to notice the pie is cursed.\n\n\nYour bare toes grow into long, twisted roots. Leaves and branches sprout from your head, spiraling skyward. Your skin becomes hard and gnarled. You are a mighty beech tree.\n\n\nFor three hundred years you tower above the fair grounds. Each day, dirty peasant children play brown-fingers amongst your branches, and at night the dryads water your thirsty roots.\n\n\nOne morning, a mighty wizards arrives. He measures your circumference and nods approvingly. \"You should have quit while you were ahead, you greedy little shit.\" He draws a saw from his sleeve and begins to cut.\n\n\nYou've Died", "action_results": []}]}]}, {"action": "Tickle her udder", "result": "The cow is not amused. The last thing you ever see is cloven hoof flying towards your face with surprising speed. Bessa eventually finds your broken body sprawled in a heap of cow dung. Never tickle the udder.\n\n\n \n\nYou've Died...\n\n\nHold on! Wait a minute. Mystigar is a dangerous place. You need to be more careful. You can't go around grabbing whatever you please. This is your only warning. Now, go be a good boy and milk the cow.", "action_results": [null]}]}, {"action": "Screw this, go to the fair", "result": "Screw the Milkman and screw the Baker! It's the day of the fair. You have a copper in your pocket, and you're going to enjoy yourself! You head off down the street with a jump in your step.\n\n\nMain Street is unusually crowded this morning. It seems you were not the only one who got an early start. You push your way into the throng and fall in step behind three farmers, who appear well past drunk despite the hour. They sing ribald songs like \"Two Old Dogs\" and \"The Wobbly Widow\" as they stumble down the street together. \n\n\nYou are about to join in on the chorus of \"The Innkeeper's Daughter\" when a sign catches your eye. It reads: \"The Broken Bodice.\"  A woman with a generous supply of cleavage calls to you from the doorway. \"Hey there baker's boy, got time for a tumble?\" ", "action_results": [{"action": "Go to the brothel", "result": "The inside of The Broken Bodice is dim and moist. The decor is a garish mixture of red velvet, gold tassels, and over sized pillows. An overwhelming aura of perfume chokes your nostrils, but it cannot cover the stench of wet crackers. Beautiful women lounge about the room in various stages of undress, doting on eager patrons. Most of the patrons are wealthy old men, some so ancient they probably jizz dust. \n\n\nThe woman with the rolling hills stuffed into her corset is the madame of this fine establishment. \"Oooh I bet this is your first time\" she coos. \"Leave it to my girls to make a man of a baker's boy.\"\n\n\nYou hand her your copper and ask for one of the pretty girls. She tucks the penny into her cleavage and scoffs. \"A copper ain't gonna buy you no princess, but I think we can find some dough for you to prick.\" ", "action_results": [{"action": "Sleep with Grizzela", "result": "The madame escorts you to a dark room in the farthest recesses of the brothel. \"Good luck\" she says, closing the door behind you. You hear a bolt slam down.\n\n\nA baritone voice calls to you from the shadows, \"Ooo I love me a young one.\"\n\n\nA light stubble covers Grizzela's square jaw, and a velvet scarf hides the lump in 'her' neck. \"Don't be scared sugar. I'm gonna show you things you've only dreamed of.\"\n\n\nHer embrace is like iron. ", "action_results": [{"action": "Tickle her udder", "result": "You grab something that looks like an udder and tug with all your might. Grizzela's bald spot glows bright red as she lets out a guttural moan. Your efforts are rewarded by a serving of heavy cream.\n\n\nShe collapses on the straw, gasping for breath. In her fifty-five years as a whore no one has ever given her so much pleasure. \n\n\nWhen the madame finds out what you've done, she hands you a bag of silver and insists that you work for her. You try to decline, but Grizzela's iron grip brooks no arguments. It's not the life you imagined, but the money is good. Men travel from the far corners of the kingdom to lie with the supple Baker's Boy.\n\n\n \n\nThe End\n\n\nThis is not what I had in mind. When I said you were destined to be a king, I didn't mean king of the whores. Perhaps you should try again...\n\n\nYou've found a U. Discover more letters to solve the Legendary Riddle.", "action_results": []}, {"action": "Let her try something called the \"Iron Unicorn\"", "result": "With trepid anticipation you give yourself up to her.  At first the iron is cold, and the leather chafes your skin, but soon you are overcome with unbridled pleasure. You cry out in delight, but the ecstasy of your first prostate orgasm is cut short by an awful tearing sound.\n\n\n\"Not again,\" Grizella says in despair, \"I just can't stand the sight of so much blood.\"\n\n\n \n\nYou've Died", "action_results": []}]}, {"action": "Sleep with Satin Jane", "result": "The madame escorts you to a dark room filled with scented candles. \"Have fun,\" she says before closing the door.\n\n\nYou find Satin Jane laying seductively on a straw mattress, wrapped in a red blanket. Her skin is like the palest milk and her hair is a brilliant cinnamon. She spreads her chalk white legs revealing that the rushes match the tapestries. Her beautifully wide face spreads in a gap tooth smile. The Princess and Bessa are forgotten. You burry your face in her pillowy breasts and knead her like the bread dough. \n\n\nThree minutes later you're back on the street, grinning like a fool. Huzzah! A copper well spent. \n\n\nYou step into an alley to relieve yourself, but a horrible burning sensation tears across your shriveled member. Black spots spread from your crotch and crawl up your chest. The pain is blinding and you collapse into the filthy gutter. If only you had put a helm on your soldier!\n\n\nYou've Died", "action_results": []}, {"action": "Sleep with Bessa", "result": "You excitedly follow her down the back hall and out into the yard behind the building. Could it really be Bessa, the Milkman's daughter? The same Bessa you have spent years drooling over at the market each morning? Bessa with the thunderous skin bags, so wondrous the gods cried they day they made them?\n\n\n\"No refunds,\" the Madame says as she closes the door and locks it behind you.\n\n\nThere, chained in the middle of the yard, stands Bessa. This Bessa is not the Milkman's daughter, but an old she goat who looks a little worse for ware. The goat wiggles her backside at you and flexes her mutton-button flirtatiously. You are tempted, but no. There is a line even you will not cross.\n\n\nThat dirty old swamp-donkey swindled you out of your copper, but you have an idea to pay the Madame back. A talented goat like this is worth a pretty penny and you know just where to sell her. You untie Bessa and lead her through the gate and out of the yard. \n\n\n--\n\n\nThe wharf is bustling with crusty old sailors loading cargo onto a galley. Bessa bleats to the men and excitedly dribbles a few drops of milk. You find the ship's steward and offer to sell him the goat. \"Isn't she a site t' raise your mizzenmast,\" he says. \"She'll keep the men happy on a long voyage. I'll give ya one copper for her.\"", "action_results": [{"action": "Take the copper and go to the fair", "result": "The fair is everything you had hoped. Highborn ladies and goodly knights recite poetry outside of colorful silk pavilions. Naked urchins chase each other about, playing tag and brown-fingers, while drunken minstrels belt green sleeves at the top of their lungs.\n\n\nVendors call their wares from various carts and stands. A fat pastry chef with a pox-marked face yells \"Hot pies! Two coppers!\" while a dwarf cries her ale. You are hungry, but cannot afford a pie. The dwarf, however, will let you drink yourself stupid for a copper. \n\n\nYou spy the princess in the royal box above the tourney field. She is framed by a pair of guards who look more jailor than escorts. For one moment your eyes meet and she smiles. \n\n\nBelow her a herald speaks. \"Gather all yee who would compete in the tourney of archery\" he proclaims. \"To the winner shall be awarded a golden bow and the hand of the beautiful Princess Marmalade. Any man of Mystigar may enter for a single copper.\"\n\n\nA copper for a chance to marry the princess? What luck!", "action_results": [null, null, null]}, {"action": "Demand more money", "result": "\"Ya drive a hard bargain, but a gal like that is worth more'n a copper. Climb aboard and I'll fetch ya a silver piece,\" the Steward says. You turn to mount the gangplank when something heavy strikes the back of your head and the world goes dark.\n\n\n--\n\n\nYou awaken in the depths of the galley, far out to sea. You are chained to an oar between two large, swarthy galley slaves. They have been here a long time. \"Middle seat is bad luck, little boy. You row twice as much,\" the slave to your left laughs in broken English. The slave to you right smiles and spits in your hair. Drums pound and you begin to row.\n\n\nAll day you pull the galley oar without rest, and all night you row your bench mates while they take turns spitting on you. In the brief moments before dawn when you are allowed to sleep, you dream of storms and shipwrecks. \n\n\n \n\nThe End\n\n\nIt seems it is the Steward who drives a hard bargain. Throw your back into it, land lubber, or you'll end up with the goat.\n\n\nYou've found an S. Discover more letters to solve the Legendary Riddle.", "action_results": []}]}]}, null]}]}]}]}