{"tree_id": "apoc_seed1", "context": "Long ago the bombs fell and the world ended. You are one of the few who is still alive. You are trying to survive by scavenging among the ruins of what is left behind. ", "first_story_block": "You are standing outside an old rundown gas station at the edge of town. There are old broken cars surrounding the gas station and on the road. You are extremely hungry and haven't eaten in a few days. ", "action_results": [{"action": "look in the gas station for food. ", "result": "You search the gas station for food, but find nothing you can eat.", "action_results": [{"action": "search the cars for food.", "result": "You search the cars for food, you search three without success, but in the glove compartment of the fourth you find a box of crackers.", "action_results": [{"action": "eat the crackers.", "result": "They remind you of when you needed to eat a bland diet after your operation. You pat yourself on where you remember the incision was made. The scar healed long ago, but the brain remembers. The crackers weren't very nutritious, but some fuel in the tank is better than none.", "action_results": [{"action": "Continue to look for food in the building up ahead.", "result": "You find a moldy sandwich and some peppered beef jerky in an old lunchbox.", "action_results": [{"action": "Snack on the jerky while searching for more food.", "result": "The jerky is so hard your tooth falls out.", "action_results": [{"action": "look for a mirror to assess the damage", "result": null, "action_results": []}, {"action": "use pliers to pull the rest of the tooth", "result": null, "action_results": []}]}, {"action": "Scrape the mold from the sandwich, taste a bite to see if it is edible.", "result": "The sandwich is stale.  You throw it away and hope you don't get sick.", "action_results": [{"action": "Look for more food.", "result": null, "action_results": []}, {"action": "Take some medicine you saved.", "result": null, "action_results": []}]}, {"action": "Eat the peppered beef and throw the sandwich to the side", "result": "You discovered the peppered beef had gone bad when you developed cramps and diarrhea just hours after eating it.  Fortunately, the food poisoning will pass and you will be all right.", "action_results": [{"action": "Look for water.", "result": null, "action_results": []}, {"action": "Look for more food.", "result": null, "action_results": []}]}, {"action": "Continue to search for food", "result": "There is no more food around, and you start feeling hungry.", "action_results": [{"action": "Fast, its good for you", "result": null, "action_results": []}, {"action": "Yell and hope someone is around", "result": null, "action_results": []}]}]}, {"action": "Look for water for hydration and to fool the stomach until ore food can be found.", "result": "No water can be found in the cars, and suddenly you regret eating salted crackers: you can feel your tongue swelling up, begging for some hydration.", "action_results": [{"action": "Look for a different water source in the vicinity.", "result": "You hear running water nearby.  You walk around the area and find a small creek.", "action_results": [{"action": "Drink the water.", "result": null, "action_results": []}, {"action": "Take a bath in the creek.", "result": null, "action_results": []}]}, {"action": "Keep walking to see if you can find a supermarket anywhere.", "result": "You see a building in the distance.  You continue walking and see a sign in front of it.  Luckily it is a supermarket.  You hope that you will find something to drink there.", "action_results": [{"action": "Go inside.", "result": null, "action_results": []}, {"action": "Look around to see if anyone's watching.", "result": null, "action_results": []}]}, {"action": "Calm the mind to extend search for hydration.", "result": "You know it recently rained. You look outside to see if there are any containers that might have rainwater in them.", "action_results": [{"action": "drink from an old bucket", "result": null, "action_results": []}, {"action": "find water in a gutter", "result": null, "action_results": []}]}, {"action": "Look for puddles of water around the area.", "result": "You walk around trying to find pools of water.  Eventually, you find a small puddle of water.  You kneel next to it and take a sip.", "action_results": [{"action": "Fill your canteen.", "result": null, "action_results": []}, {"action": "Wash your body.", "result": null, "action_results": []}]}]}, {"action": "Search the cars for clothing.", "result": "There is no clothing in the car.", "action_results": [{"action": "Search the car for water.", "result": "You find there is a bottle under the seat, but it is not a water bottle.  It is Jack Daniels and is only half full.", "action_results": [{"action": "take a swig of Jack Daniels", "result": null, "action_results": []}, {"action": "save the alcohol for a future antiseptic", "result": null, "action_results": []}]}, {"action": "Look for a store that has clothing.", "result": "There is a moldy coffee cup below the register and money in the till.", "action_results": [{"action": "Leave the money and look for clothing", "result": null, "action_results": []}, {"action": "Try on different clothing and shoes", "result": null, "action_results": []}]}, {"action": "See if the car runs for temporary transportation and shelter.", "result": "The engine starts with a roar: the car is still working!", "action_results": [{"action": "Drive the car", "result": null, "action_results": []}, {"action": "Check the fuel level of the car", "result": null, "action_results": []}]}, {"action": "Cut the fabric cloth from the seats to create clothing or blankets.", "result": "You start feeling warmer with that makeshift blanket: that might do, for the night.", "action_results": [{"action": "Check for gas", "result": null, "action_results": []}, {"action": "Lock car and sleep to regain strength", "result": null, "action_results": []}]}]}, {"action": "Begin to walk towards the nearest town.", "result": "You arrive and, despite the state of things, many store lights seem to be functioning. The first store you encounter is a gun shop. You decide to step inside.", "action_results": [{"action": "Take a gun and some ammo.", "result": "You are now protected against anyone who would try and do you harm, you step out into the street to search the supermarket next door", "action_results": [{"action": "Look around to see if anyone is watching", "result": null, "action_results": []}, {"action": "Make sure gun is loaded", "result": null, "action_results": []}]}, {"action": "Go into a different store to look for food.", "result": "Too your luck, you find a store a couple blocks away that has non perishable items in it.", "action_results": [{"action": "go into store and pack as many cans as you can", "result": null, "action_results": []}, {"action": "Search fro something to carry back food", "result": null, "action_results": []}]}, {"action": "Look for a weapon to hunt any animals with.", "result": "You bypass the firearms thinking of possible ammo shortages later on. Instead you choose a crossbow.", "action_results": [{"action": "Go inside store and see if there are bows and arrows", "result": null, "action_results": []}, {"action": "Go inside store, grab crossbow and try hunting", "result": null, "action_results": []}]}, {"action": "See if theres any extra food anywhere stored in the shop.", "result": "You open a desk drawer and find snacks stored away.  Hopefully they aren't stale.  You take them with you in case you find nothing else.", "action_results": [{"action": "Hold on to the snacks", "result": null, "action_results": []}, {"action": "Grab some guns and ammo to kill food", "result": null, "action_results": []}]}]}]}]}]}]}