{"tree_id": "apoc_seed2", "context": "Long ago the bombs fell and the world ended. You are one of the few who is still alive. You are trying to survive by scavenging among the ruins of what is left behind. ", "first_story_block": "You find a car with the keys in the ignition and try to start it. Nothing happens. You keep looking and find another car that looks like it might work. You manage to get the engine started. ", "action_results": [{"action": "drive around looking for any people or stores that might have supplies.", "result": "You drive around the town and see many boarded up buildings, but no people. Eventually you find a store that you think might have supplies.", "action_results": [{"action": "go inside the store and see if there are any supplies.", "result": "It looks like the store has been ransacked and all the shelves are empty. You manage to find a package of granola bars and a flashlight behind the counter.", "action_results": [{"action": "eat a granola bar.", "result": "It tastes just like a granola bar you enjoyed when you were younger. In an instant, you are transported to a school hiking trip. Your mind is awash by the mountain air and the bundles of sticks and leaves that formed the trail. Those days seem so long ago now...", "action_results": [{"action": "Look for other doors inside the store.", "result": "You find the store manager's door, with a set of keys hanging off the lock. The door, though, seems to be blocked from the inside.", "action_results": [{"action": "Push the door to uncover what is blocking it from the inside", "result": "You hear a scream from the inside: \"Go away! I have a gun!\"", "action_results": [{"action": "Continue to push the door.", "result": null, "action_results": []}, {"action": "Try to talk down the person behind the door.", "result": null, "action_results": []}]}, {"action": "Knock on the door, while being prepared for what is inside.", "result": "You swing the door open and find nothing there.  You let out an audible sigh of relief.  The door was only jammed.", "action_results": [{"action": "Search the manager's desk.", "result": null, "action_results": []}, {"action": "Look at the coat rack by the door.", "result": null, "action_results": []}]}, {"action": "Attempt to break down the door with something heavy.", "result": "You look around and find a piece of wood.  You take the wood and ram it against the door.  Eventually, it starts to give.", "action_results": [{"action": "Keep ramming.", "result": null, "action_results": []}, {"action": "Take a break.", "result": null, "action_results": []}]}, {"action": "Use the keys to try to unlock a different door.", "result": "The storage room door opens up, and it's filled with shelves stacked with canned food.", "action_results": [{"action": "Find can opener", "result": null, "action_results": []}, {"action": "Move food to other area to prevent others from taking it", "result": null, "action_results": []}]}]}, {"action": "Check to see if there are any batteries in the flashlight.", "result": "There are batteries in the flashlight but they are dead.", "action_results": [{"action": "Shake the flashlight and see if the batteries might begin to work.", "result": "The flashlight flickers for a second, but then it dies again. At least you know it's working, you only need fresh batteries...", "action_results": [{"action": "Look for batteries.", "result": null, "action_results": []}, {"action": "Throw it away - it's dead weight.", "result": null, "action_results": []}]}, {"action": "Look through the rubble and see if you can find any new batteries for the flashlight.", "result": "You look through the rubble, but there is nothing but papers and trash.  You trudge on, disappointed.", "action_results": [{"action": "Bend down when you see something glinting in the rubble ahead.", "result": null, "action_results": []}, {"action": "Take a right turn.", "result": null, "action_results": []}]}, {"action": "Tuck the flashlight into your pocket.", "result": "The flashlight some how turns on by itself. You take it out of your pocket", "action_results": [{"action": "Explore the surroundings with the flashlight.", "result": null, "action_results": []}, {"action": "Turn off the flashlight immediately.", "result": null, "action_results": []}]}, {"action": "Look around for fresh batteries.", "result": "You can't find any more batteries, but you find a box of matches in a drawer.", "action_results": [{"action": "Light a match", "result": null, "action_results": []}, {"action": "Look around for something to use as a torch", "result": null, "action_results": []}]}]}, {"action": "Check to see if the flashlight works.", "result": "You push the soft, mushy rubber button and a faint light emerges. You are familiar with this brand of torch and consider keeping it in case you find a better battery.", "action_results": [{"action": "put in jacket pocket", "result": "The battery doesn't fit in your pocket.  You have to carry it around.  You wish you had some kind of bag to carry it in.", "action_results": [{"action": "Take off jacket and wrap it around you like a sling and put the battery in it.", "result": null, "action_results": []}, {"action": "Put the battery to your arm or leg and wrap your jacket around it to hold it in place.", "result": null, "action_results": []}]}, {"action": "look for dry twigs and kindling", "result": "Gather the kindling into a pile and light it up for a cozy fire", "action_results": [{"action": "Search for blanket material", "result": null, "action_results": []}, {"action": "Take off boots and dry out feet", "result": null, "action_results": []}]}, {"action": "Turn off the light to conserve what battery it has.", "result": "You walk out of the store and back to the car.  Looking around in the low light there is a column of smoke to the west.  No sound but the wind playing with some leaves.", "action_results": [{"action": "Head towards the smoke.", "result": null, "action_results": []}, {"action": "Go in the opposite direction.", "result": null, "action_results": []}]}, {"action": "Search for more batteries and flashlights.", "result": "You find 2 more flashlights in a drawer in a back room, there is also another pack of batteries there.", "action_results": [{"action": "Check operation of new flashlights", "result": null, "action_results": []}, {"action": "Take batteries and put them in pocket", "result": null, "action_results": []}]}]}, {"action": "Check the storage rooms for tools and supplies.", "result": "It's clear that whoever ransacked the store, was someone really organized and with a means of transport: even the storage rooms are completely empty.", "action_results": [{"action": "Look in every corner for any possible tools and supplies.", "result": "There is nothing left: the only use for the storage room is as a safe place to sleep in.", "action_results": [{"action": "Leave the storage room.", "result": null, "action_results": []}, {"action": "Lay down for a nap.", "result": null, "action_results": []}]}, {"action": "Look underneath all large items for tools and supplies.", "result": "Hidden away under a shelf you find a hammer, screw driver, and a first aid kit.", "action_results": [{"action": "take the tools and hide them in your bag", "result": null, "action_results": []}, {"action": "leave the tools incase someone else needs them more", "result": null, "action_results": []}]}, {"action": "Keep travelling to find a different storage room.", "result": "You walk to a different door and try to get in but it is locked.  You look around to see if you can find the key.", "action_results": [{"action": "Check the under the mat for key", "result": null, "action_results": []}, {"action": "Make noises to see if someone is inside", "result": null, "action_results": []}]}, {"action": "Look for the person who cleaned out the storage room.", "result": "You look around, but see no one.  You try calling out, but no one responds.", "action_results": [{"action": "Leave the store, see if you can spot tire tracks", "result": null, "action_results": []}, {"action": "Make as much noise as possible", "result": null, "action_results": []}]}]}]}]}]}]}