{"tree_id": "apoc_seed4", "context": "Long ago the bombs fell and the world ended. You are one of the few who is still alive. You are trying to survive by scavenging among the ruins of what is left behind. ", "first_story_block": "You walk for two hours and take a break. You've left the town you were in and are now in a more rural area. There's a farmhouse to your right and a forest on your left. ", "action_results": [{"action": "go in the farmhouse and look for food.", "result": "You try to open the farmhouse front door, but it's locked. There's a broken window on the right and a shed behind the house.", "action_results": [{"action": "go through the window into the farmhouse. ", "result": "You break the rest of the glass in the window and try to carefully crawl through. You cut yourself on the edges as you're climbing in, but you make it inside. ", "action_results": [{"action": "search the farmhouse for food. ", "result": "You find meat in the fridge that looks like it's gone bad. You also find a can of peas in the bottom of the pantry.", "action_results": [{"action": "Search the farmhouse for tools and utencils.", "result": "You find a broom in the closet and a wooden spoon in the cupboard.", "action_results": [{"action": "Open the van of peas and use the wooden spoon to eat.", "result": "You get the can of peas open and use the wooden spoon to take a bite of them.  They taste horrible, but you are so hungry that you hardly notice.", "action_results": []}, {"action": "Sharpen the broom handle into a weapon for protection and use the broom head as a fire starter.", "result": "You put the broom into your bag and carry it around in case you need to protect yourself.", "action_results": []}, {"action": "take the spoon and the broom", "result": "A man appears from another room in the house.", "action_results": []}, {"action": "examine the spoon", "result": "There's a name carved in the wood: Paolo.", "action_results": []}]}, {"action": "Search the farmhouse for other usable supplies.", "result": "You find a medikit, and a flashlight with no batteries.", "action_results": [{"action": "Examine medikit.", "result": "The medikit is very basic.  Still it can come in handy.  You decide to take it with you.", "action_results": []}, {"action": "Take flashlight.", "result": "You go back outside, and you notice the sun is setting: it's a bit darker already.", "action_results": []}, {"action": "Take the medkit.", "result": "You put the medkit in your bag.  You know you will probably need it.", "action_results": []}, {"action": "Take the flashlight and keep looking for batteries.", "result": "You find batteries in an old rusty box, but they are the wrong size.", "action_results": []}]}, {"action": "eat meat", "result": "Nausea sets in immediately.", "action_results": [{"action": "Try shoving fingers down throat to force vomiting.", "result": "You throw up the rotten meat on the floor. You feel awful and are more dehydrated and hungry than before.", "action_results": []}, {"action": "Find a good place to rest until the nausea passes, or sickness worsens.", "result": "You lay down on the floor and fall asleep", "action_results": []}, {"action": "Expel the rotten meat from your body.", "result": "You put the can of peas in your backpack, right now you're feeling too sick to eat them.", "action_results": []}, {"action": "Try to eat the peas to alleviate the nausea.", "result": "You take a bite of the peas, but your stomach turns.  You look away as you empty your stomach out on the ground.", "action_results": []}]}, {"action": "eat peas", "result": "The peas were delicious.", "action_results": [{"action": "Consider eating the meat too.", "result": "You do not eat the meat because you don't want to get sick and not be able to scavenge.", "action_results": []}, {"action": "Leave the meat and look for food elsewhere.", "result": "You know the meat was probably bad, but your stomach still rumbles.  You hope that you can find some more food elsewhere.", "action_results": []}, {"action": "Examine meat.", "result": "The meat is smelling bad, but you decide not to throw it away: it may be useful as bait, or for something else.", "action_results": []}, {"action": "Look behind fridge.", "result": "You look behind the fridge and find several other cans.  You wonder if the cans may have fallen behind the fridge.  You stuff them into your bag.", "action_results": []}]}]}]}]}]}