{"tree_id": "apoc_seed2", "context": "Long ago the bombs fell and the world ended. You are one of the few who is still alive. You are trying to survive by scavenging among the ruins of what is left behind. ", "first_story_block": "You find a car with the keys in the ignition and try to start it. Nothing happens. You keep looking and find another car that looks like it might work. You manage to get the engine started. ", "action_results": [{"action": "drive around looking for any people or stores that might have supplies.", "result": "You drive around the town and see many boarded up buildings, but no people. Eventually you find a store that you think might have supplies.", "action_results": [{"action": "go inside the store and see if there are any supplies.", "result": "It looks like the store has been ransacked and all the shelves are empty. You manage to find a package of granola bars and a flashlight behind the counter.", "action_results": [{"action": "eat a granola bar.", "result": "It tastes just like a granola bar you enjoyed when you were younger. In an instant, you are transported to a school hiking trip. Your mind is awash by the mountain air and the bundles of sticks and leaves that formed the trail. Those days seem so long ago now...", "action_results": [{"action": "Look for other doors inside the store.", "result": "You find the store manager's door, with a set of keys hanging off the lock. The door, though, seems to be blocked from the inside.", "action_results": [{"action": "Push the door to uncover what is blocking it from the inside", "result": "You hear a scream from the inside: \"Go away! I have a gun!\"", "action_results": [{"action": "Continue to push the door.", "result": "You yell: \"So do I!\"  and feel the door give a bit more.", "action_results": []}, {"action": "Try to talk down the person behind the door.", "result": "explains that he is a good person, and tries to approach slowly", "action_results": []}]}, {"action": "Knock on the door, while being prepared for what is inside.", "result": "You swing the door open and find nothing there.  You let out an audible sigh of relief.  The door was only jammed.", "action_results": [{"action": "Search the manager's desk.", "result": "You find a note that was written by the last owner. You open up the note.", "action_results": []}, {"action": "Look at the coat rack by the door.", "result": "You find a hat, which will help a little when it gets cold at night, but not the warm coat you were hoping for.", "action_results": []}]}, {"action": "Attempt to break down the door with something heavy.", "result": "You look around and find a piece of wood.  You take the wood and ram it against the door.  Eventually, it starts to give.", "action_results": [{"action": "Keep ramming.", "result": "need to enter that room", "action_results": []}, {"action": "Take a break.", "result": "Sitting in the quiet, suddenly you hear a scratching noise coming from the other side of the manager's office door.", "action_results": []}]}, {"action": "Use the keys to try to unlock a different door.", "result": "The storage room door opens up, and it's filled with shelves stacked with canned food.", "action_results": [{"action": "Find can opener", "result": "You open a can of tuna and notice it has a rancid smell.", "action_results": []}, {"action": "Move food to other area to prevent others from taking it", "result": "This is a huge treasure trove. You have enough to eat and plenty to trade as well. But you have to get it out of here first, and that means finding a vehicle. Just then, you hear the engines approaching. Raiders!", "action_results": []}]}]}, {"action": "Check to see if there are any batteries in the flashlight.", "result": "There are batteries in the flashlight but they are dead.", "action_results": [{"action": "Shake the flashlight and see if the batteries might begin to work.", "result": "The flashlight flickers for a second, but then it dies again. At least you know it's working, you only need fresh batteries...", "action_results": [{"action": "Look for batteries.", "result": "batteries or batteries here is a new purpose now the night will come soon and we need light", "action_results": []}, {"action": "Throw it away - it's dead weight.", "result": "But you realize, fresh batteries will be a hard thing to come across.  You hide the flashlight under a shelf for now.  If you do happen upon batteries, you can come back for it when it's worth carrying.", "action_results": []}]}, {"action": "Look through the rubble and see if you can find any new batteries for the flashlight.", "result": "You look through the rubble, but there is nothing but papers and trash.  You trudge on, disappointed.", "action_results": [{"action": "Bend down when you see something glinting in the rubble ahead.", "result": "It is a large knife. You take it with you because you are sure it will come in handy.", "action_results": []}, {"action": "Take a right turn.", "result": "There's a dim light at the end of the corridor.", "action_results": []}]}, {"action": "Tuck the flashlight into your pocket.", "result": "The flashlight some how turns on by itself. You take it out of your pocket", "action_results": [{"action": "Explore the surroundings with the flashlight.", "result": "You come across a book. You open the book.", "action_results": []}, {"action": "Turn off the flashlight immediately.", "result": "Instead of shutting off, the flashlight begins to vibrate, and projects an image onto the ground.", "action_results": []}]}, {"action": "Look around for fresh batteries.", "result": "You can't find any more batteries, but you find a box of matches in a drawer.", "action_results": [{"action": "Light a match", "result": "who has no dog hunting with cat, but little by little I see the environment", "action_results": []}, {"action": "Look around for something to use as a torch", "result": "Matches will only last so long, so you break off some wood and from a nearby chair to use as a torch.", "action_results": []}]}]}, {"action": "Check to see if the flashlight works.", "result": "You push the soft, mushy rubber button and a faint light emerges. You are familiar with this brand of torch and consider keeping it in case you find a better battery.", "action_results": [{"action": "put in jacket pocket", "result": "The battery doesn't fit in your pocket.  You have to carry it around.  You wish you had some kind of bag to carry it in.", "action_results": [{"action": "Take off jacket and wrap it around you like a sling and put the battery in it.", "result": "The battery is leaking, and acid soaks into your skin.", "action_results": []}, {"action": "Put the battery to your arm or leg and wrap your jacket around it to hold it in place.", "result": "The battery slips out of your improvised bag fashioned out of a jacket and falls to the ground.", "action_results": []}]}, {"action": "look for dry twigs and kindling", "result": "Gather the kindling into a pile and light it up for a cozy fire", "action_results": [{"action": "Search for blanket material", "result": "You are able to find a old table cloth", "action_results": []}, {"action": "Take off boots and dry out feet", "result": "You notice when you remove your boots that your feet are blistered and the heat of the fire makes the blisters more painful.", "action_results": []}]}, {"action": "Turn off the light to conserve what battery it has.", "result": "You walk out of the store and back to the car.  Looking around in the low light there is a column of smoke to the west.  No sound but the wind playing with some leaves.", "action_results": [{"action": "Head towards the smoke.", "result": "You come across a campfire. You see a woman around the fire.", "action_results": []}, {"action": "Go in the opposite direction.", "result": "You begin to wonder whether you made the right decision. It is lonely out here and the smoke indicated a sign of life. You stop in your tracks and consider turning back around.", "action_results": []}]}, {"action": "Search for more batteries and flashlights.", "result": "You find 2 more flashlights in a drawer in a back room, there is also another pack of batteries there.", "action_results": [{"action": "Check operation of new flashlights", "result": "The first flashlight is dead, but the second flickers, then projects an eerie greenish glow onto the floor.", "action_results": []}, {"action": "Take batteries and put them in pocket", "result": "Look for anything else to aid in your survival and find a first aid kit.", "action_results": []}]}]}, {"action": "Check the storage rooms for tools and supplies.", "result": "It's clear that whoever ransacked the store, was someone really organized and with a means of transport: even the storage rooms are completely empty.", "action_results": [{"action": "Look in every corner for any possible tools and supplies.", "result": "There is nothing left: the only use for the storage room is as a safe place to sleep in.", "action_results": [{"action": "Leave the storage room.", "result": "You continue on and head outside. Down the road you see another building and decide to check it out.", "action_results": []}, {"action": "Lay down for a nap.", "result": "just as your about to fall a sleep you hear a sound of voices in the background. You know you need to get out before the men find you. You frantically look around for another exit, but there isn't one except for a narrow ventilation shaft. You hear the men begin to enter the store and rummage around. you pop open the shaft even and begin your tight escape to the unknown", "action_results": []}]}, {"action": "Look underneath all large items for tools and supplies.", "result": "Hidden away under a shelf you find a hammer, screw driver, and a first aid kit.", "action_results": [{"action": "take the tools and hide them in your bag", "result": "You tend to your cuts and bruises with the first aid kit and using the hammer, screwdriver and scraps from the ruins begin to construct a shelter.", "action_results": []}, {"action": "leave the tools incase someone else needs them more", "result": "The tools are heavy, and you don't have any use for them right now, so you grab a few bandaids from the first aid kit and move on.", "action_results": []}]}, {"action": "Keep travelling to find a different storage room.", "result": "You walk to a different door and try to get in but it is locked.  You look around to see if you can find the key.", "action_results": [{"action": "Check the under the mat for key", "result": "There is a key there. You use it to open the door and the room is fill with supplies.", "action_results": []}, {"action": "Make noises to see if someone is inside", "result": "Just in case, you bang on the door loudly before listening for any rustling behind it, to see if someone might be waiting for you.", "action_results": []}]}, {"action": "Look for the person who cleaned out the storage room.", "result": "You look around, but see no one.  You try calling out, but no one responds.", "action_results": [{"action": "Leave the store, see if you can spot tire tracks", "result": "You see tire tracks leading over the hill, towards the ruins where you've seen strange lights at night.", "action_results": []}, {"action": "Make as much noise as possible", "result": "A person comes running out. She scares you to death.", "action_results": []}]}]}]}]}]}]}