{"tree_id": "apoc_seed3", "context": "Long ago the bombs fell and the world ended. You are one of the few who is still alive. You are trying to survive by scavenging among the ruins of what is left behind. ", "first_story_block": "As you leave the store you notice movement out behind your car. A man steps out with a hungry look in his eyes. His clothes are in tatters and he is carrying a crowbar.", "action_results": [{"action": "run at the man and attack him.", "result": "You run forward to attack the man. His crowbar crashes into your chest and you fall to the ground. He kicks you a few times and then grabs your granola bars and runs off.", "action_results": [{"action": "go after him.", "result": "You go after him. As you try and stand up though you realize you're in extreme pain. You think one of your ribs is broken. You manage to get yourself on your feet, but realize catching him is impossible. ", "action_results": [{"action": "look for something to wrap your chest with.", "result": "There's nothing around, so you resort to taking off your pants and wrapping it around your chest. There's a mild draft right now...", "action_results": [{"action": "Check for other injuries.", "result": "There are some superficial cuts on the arms, but nothing else seems to be broken.", "action_results": [{"action": "Search for clothes or blankets for warmth.", "result": "There are boxes on shelves on the wall.  You check them for supplies and eventually come across a tote full of blankets.  You take one of the blankets out of the tote.", "action_results": [{"action": "Wrap it around yourself.", "result": "You are starting to feel warm again. You can feel your fingers.", "action_results": [{"action": "Count your fingers just for fun.", "result": "You warm up for a bit before collecting more supplies.", "action_results": []}, {"action": "Turn the boxes into shoes.", "result": "You remove the boxes from the shelves, placing two on your feet as makeshift shoes. Your feet begin to warm up.", "action_results": []}]}, {"action": "Stuff it in your bag.", "result": "Your bag is now too full to hold anything else so you remove the other contents so all you are carrying is the blanket. You look around for something to use as a second bag.", "action_results": [{"action": "Make a rucksack out of a dirty blanket.", "result": "The blanket has too many holes, and will not hold anything.", "action_results": []}, {"action": "Create a backpack out of the cardboard box.", "result": "While the cardboard box is uncomfortable, it serves its purpose to carry your supplies.", "action_results": []}]}]}, {"action": "Find water and rinse the exposed limbs to help clean cuts.", "result": "The water is freezing cold, but at least it helps you recover from the shock of being so brutally attacked.", "action_results": [{"action": "Dry off and build a fire.", "result": "The fire comforts you for a brief moment.", "action_results": [{"action": "Watch as the fire comes to life and begins to chase you.", "result": "You decide to go look for food and water after regaining strength.", "action_results": []}, {"action": "Fall asleep by the fire.", "result": "You stay warm throughout the night and wake up to begin the day.  Hunting for food and water is on your agenda.", "action_results": []}, {"action": "i go to the store", "result": "I am unable to find anything valuable to scavange.", "action_results": []}, {"action": "go to the store", "result": "You reach the long abandoned store hoping that you might find food or other supplies still left inside. The windows are shattered, probably from previous scavangers.", "action_results": []}]}, {"action": "Dry off and keep moving.", "result": "It is starting to get dark. You must find shelter soon. As you come up over the hill you see a cave. Looks like a good place for shelter.", "action_results": [{"action": "Walk into the cave.", "result": "You walk into the cave and quickly look around to make sure that the cave is safe.", "action_results": []}, {"action": "Keep walking, leave the cave behind.", "result": "You end up sleeping outside unprotected.", "action_results": []}]}]}, {"action": "Look around you", "result": "There's a small river on your left, running along the road. On your right you can see a huge building a couple of miles away.", "action_results": [{"action": "Stop to take a closer look at the river bank.", "result": "There must be animals near the river, looking for water, so you sit quietly near the bank in the hopes of fresh meat.", "action_results": [{"action": "Find something to use as a weapon.", "result": "You look around for a weapon.  You pick up a large stick from the ground.", "action_results": []}, {"action": "Refill your water bottle from the river.", "result": "You bring the bottle to your mouth.  The water is muddy, but it's refreshing.", "action_results": []}]}, {"action": "Pass by the river and head for the huge building.", "result": "You need water, but the river is probably contaminated.  You decide to search for bottled water in what looks like an office building ahead.", "action_results": [{"action": "Stand outside the building with raised hands.", "result": "Nothing is accomplished by raising your hands.  You put them back down and look around.", "action_results": []}, {"action": "Stand outside the building and yell \"Is anyone in there?\"", "result": "You don't hear any response, so you cautiously approach the building entrance.", "action_results": []}]}]}, {"action": "Lie down and groan", "result": "There is no response and no sound except the sound of the wind blowing.", "action_results": [{"action": "Try and get back up.", "result": "You manage to get up, but you feel faint.", "action_results": [{"action": "Feel the back of your head to see if you're bleeding.", "result": "AS you look at your hand there is only a glimpse of fresh blood.", "action_results": []}, {"action": "Look around to see what attacked you.", "result": "You see no-one but you feel distinctly uneasy. You get up and tentatively walk a few steps.", "action_results": []}]}, {"action": "Start crying.", "result": "A dirty and emaciated dog appears in answer to your cries.", "action_results": [{"action": "Scratch behind it ears.", "result": "The dog seems to like that.  You decide to keep him.  You'll name him Mr. Fluffy.", "action_results": []}, {"action": "Follow the dog to water and food.", "result": "The dog shows you where the food and water is.  You collect as much as you can in your bag.", "action_results": []}]}]}]}, {"action": "Look around for ways to make the room warmer.", "result": "At that moment Someone runs in yielding a blanket and lantern.", "action_results": [{"action": "grab gun", "result": "You take the gun and aim it.  You recognize the person that is walking in, so you put the gun down.", "action_results": [{"action": "Ask what their business is", "result": "You tell them that this is your place, and there isn't much to share.  You ask if they plan to stay, while glancing at your gun.", "action_results": [{"action": "Wait for their answer.", "result": "They tell you they are hungry and ask if you have any food to spare.", "action_results": []}, {"action": "Put the gun back into the holster.", "result": "The other person brandishes a knife, and lunges at you.", "action_results": []}]}, {"action": "Ask what supplies they have", "result": "The grizzled trader does not have much to offer. Except, he says, with a wily smile, for an old map that you might be interested in. Not just any map, but one that might lead to a major survival cache, if you survive the trip.", "action_results": [{"action": "Ask how much the map is", "result": "The man tells you the map is not for sell.  You will have to find something else to trade for it.", "action_results": []}, {"action": "Take out your gun and threaten the trader", "result": "The man raises his hands in alarm.  He gives you the map and runs away.", "action_results": []}]}]}, {"action": "yell \"who's there\"", "result": "You listen, but no one answers.  You look around to see if there is a place for you to hide.", "action_results": [{"action": "Hide and wait to see what the person does.", "result": "The person finds you, runs up to you and hits you on the head with the lantern.", "action_results": [{"action": "Pass out.", "result": "You awaken in the dark. Your vision is blurry, but you make out the shapes of two human-like figures illuminated by candelight.", "action_results": []}, {"action": "Scream in anger and fight back.", "result": "You wreste a few moments and see your opening for an attack.", "action_results": []}]}, {"action": "yell \"I'm armed! Don't come any closer!\"", "result": "You chamber one the precious 5.56 rounds into your scarred but reliable rifle. You don't want to shoot if you don't have to, and try one more time to get a response.", "action_results": [{"action": "yell again aiming the shotgun where the noise came from", "result": "The shotgun blasts through the air.  You hear someone yell.", "action_results": []}, {"action": "shoot up", "result": "Find an animal that I can now eat for dinner.", "action_results": []}]}]}, {"action": "Take the blanket and lantern from person", "result": "You feel a lot warmer, the light from the lantern glints against a piece of metal in the corner of the ruins. You pick it up to find a can of tinned tuna.", "action_results": [{"action": "Eat the tuna.", "result": "look for more stuff", "action_results": [{"action": "Check the expiration date on the tuna.", "result": "The tuna expired 11 years ago. God, how the world has moved on.", "action_results": []}, {"action": "Put your matches in the old tuna tin.", "result": "Take off your shoes and try to relax.", "action_results": []}, {"action": "You find some evaporated milk", "result": "look for people", "action_results": []}, {"action": "You find a torn piece of paper", "result": "You try to read what is written but it appears to be in a foreign language.  You put it in your pocket in hopes someone else can understand it.", "action_results": []}]}, {"action": "Put the can in the backpack.", "result": "Your stomach begins to grumble as you think about the tuna in your bag but you have no can opener.", "action_results": [{"action": "look for a something sharp to cut the can open.", "result": "You find a rock that you could use to smash the can open.", "action_results": []}, {"action": "Continue walking looking for more food.", "result": "You come across an abandoned backpack and reach inside to find a box of crackers", "action_results": []}]}]}, {"action": "Ask to use the blanket and lantern the person has", "result": "The newcomer looks shocked to find you there, and runs back out, screaming for help.", "action_results": [{"action": "Follow them and explain I am not a threat", "result": "right now everyone is afraid but they need help", "action_results": [{"action": "Jump behind some bushes to determine if there is danger.", "result": "You watch from the bush.  You are able to see everything that is going on.", "action_results": []}, {"action": "Throw hands in the area to signify that there is no threat.", "result": "You slowly approach into the camp, talking in a pleasant, reassuring voice, your empty hands up.", "action_results": []}]}, {"action": "Sit and wait", "result": "Suddenly, six more newcomers arrive. They look angry.", "action_results": [{"action": "Pull out the gun.", "result": "The six newcomers stop and eye you cautiously.", "action_results": []}, {"action": "Smile and pull up your open hands.", "result": "One of the men walk up to you and take your bag.  You die a little inside, but want to stay on their good side.", "action_results": []}]}]}]}, {"action": "Check for other injuries.", "result": "You're severely bleeding from the right calf: taking off the pants exposed the deep cut, and the blood is pouring down into the shoe. Moving around won't be easy, nor pleasurable.", "action_results": [{"action": "Try to find a kit to stop the bleeding.", "result": "You open the kit and try to find bandages.  You find the bandages and open the package and begin wrapping it around your wound.", "action_results": [{"action": "Eat some food to regain strength.", "result": "The food leaves you feeling more energized and the wounds do not hurt quite as much.", "action_results": [{"action": "Search the area for firewood.", "result": "You obtain firewood and begin to set up camp for the night", "action_results": []}, {"action": "Search the area for a comfortable place to rest for the night.", "result": "You find a place nestled in the trees.  You'd rather stay in a building, but the trees will offer enough shelter.", "action_results": []}]}, {"action": "Take a nap to regain strength.", "result": "You wake up hours later, feeling much better.", "action_results": [{"action": "Reach for the first aid kit.", "result": "You open the kit.  There is nothing in there that you can use.", "action_results": []}, {"action": "Unwrap your wound to take a look.", "result": "You tenderly remove your wound coverings to see how your wound is healing. You gasp from the pain.", "action_results": []}]}]}, {"action": "Bandage your calf with your pants and keep moving.", "result": "Every single step sends painful shockwaves through your body, but you need to get off the road immediately.", "action_results": [{"action": "Find Pain Med's", "result": "crawl to survive and find destiny", "action_results": [{"action": "Lay on the ground, waiting for the end.", "result": "You wake up hours later covered in your own vomit.  You look around wondering how you are still alive.", "action_results": []}, {"action": "Slap yourself to avoid fainting.", "result": "Ouch!  That hurt.  At least you are awake now.", "action_results": []}]}, {"action": "Look for survivors that possibly have medical experience", "result": "There is no one around, and you feel worse and worse.", "action_results": [{"action": "Find the closest area that will provide shelter for you to rest and gain some strength to look for medical supplies.", "result": "You begin your search the next day to look for food, medicine and water.", "action_results": []}, {"action": "Start searching for anything that can aid you in providing first aid to your injury before expending the little energy you have left.", "result": "Exhausted from the search, you fall over and gasp for air.", "action_results": []}]}]}, {"action": "Find materials to make a tourniquet to stop the bleeding.", "result": "You look around and see a medical kit.  You open it up and find bandages.  You use those to wrap around the wound.", "action_results": [{"action": "look for more supplies that can be used to further wrap the wound", "result": "Next to the medical kit is a stack of towels.  You try to tear them into strips to wrap your wound further.", "action_results": [{"action": "Put some extra towels in your bag.", "result": "Gather belongings and stand up. Head out to search for food.", "action_results": []}, {"action": "Use the other towels as a pillow and lie down to rest your wound.", "result": "You wrap up the other towels into a makeshift pillow. You put your head down to rest.", "action_results": []}]}, {"action": "take a nap and rest", "result": "Rest to recover, but you haven't eaten anything yet and you're kinda weak", "action_results": [{"action": "Chop off your leg for something to eat.", "result": "Arrrrrgh!  The pain is unbelievable.  You hack a piece of meat off of your leg and try to eat it.  Unfortunately, you vomit and are in a worse predicament.", "action_results": []}, {"action": "Set up a snare to catch an animal.", "result": "It worked!  You have a rabbit in the net.  You think it will make a fine meal.", "action_results": []}]}]}, {"action": "Clean and dress the wound with items available.", "result": "The wound feels better.  You wrap some material around your leg to protect it even more.", "action_results": [{"action": "continue to search for supplies", "result": "There's some pieces of hard wood that could be used to splint the leg.", "action_results": [{"action": "Creat a makeshift crutch.", "result": "It's easier to walk using the crutch.  You try to keep the weight off of your leg.", "action_results": []}, {"action": "Pick up the wood.", "result": "You pick up the wood. It feels brittle to your touch.", "action_results": []}, {"action": "Instead of using the wood for a splint it is better used as a fire to keep warm for the night so you begin trying to gather anything around that will help keep the fire going.", "result": "Your leg feels even sorer the next morning.", "action_results": []}, {"action": "The wound feels better so you skip the leg splint and keep searching for other supplies- you find a lighter and a few canned goods.", "result": "You decide to start a fire and cook some of the food you found.", "action_results": []}]}, {"action": "lay down and rest", "result": "You do not want to get up because your calf is throbbing so you decide to stay put until morning.", "action_results": [{"action": "sleep peacefully", "result": "When you awake there is a loud bang outside.", "action_results": []}, {"action": "stay alert all night", "result": "You manage to stay up all night.  However, now you feel more tired than ever.", "action_results": []}]}]}]}, {"action": "Look around for ways to make the room warmer.", "result": "You look around but you're starting to get faint and light headed. Your last thought in the split second before you pass out was to wonder if you'll have enough air by the time you hopefully wake up.", "action_results": [{"action": "Stay calm to not waste oxygen.", "result": "You wake up and are in another room. You have been saved by a girl.", "action_results": [{"action": "it should be saved my batchmate", "result": "My batchmate and I join forces.", "action_results": [{"action": "Develop a plan for survival together.", "result": "You begin to scout locations for a stronghold and divide remaining supplies to be shared equally.", "action_results": []}, {"action": "Spy on the girl to make sure that she is trustworthy.", "result": "You see that she is making a deal with your sworn enemy.", "action_results": []}]}, {"action": "thee must be last surivor so she helped me", "result": "You team up with this girl to increase chance of surviving.", "action_results": [{"action": "Ask your new partner if she has any special skills.", "result": "The girl explains to you that her father was locksmith before the bombs fell, and he taught her everything he knew. She can pick or bypass almost any lock. She can even hotwire cars, if you should be so lucky to find one that still has a working battery.", "action_results": []}, {"action": "Tell her that you are grateful that she saved your life.", "result": "She gives you a knapsack filled with survival supplies.", "action_results": []}]}]}, {"action": "Look for an escape route while simultaneously looking for clothing.", "result": "There's a room with a light on a few yards away and it looks warm. You try to find the strength to pull yourself up.", "action_results": [{"action": "Go into the room with the light", "result": "You see a candle burning on a small table. You walk over to the table.", "action_results": [{"action": "Look around the room.", "result": "There are many items in the room.  You look at them carefully.", "action_results": []}, {"action": "Pick up the candle.", "result": "The candle breaks in your hands.  You drop it back down to the floor.", "action_results": []}]}, {"action": "Pass out somewhere where you can hide", "result": "Vivimos en un mundo maravilloso que está lleno de belleza, encanto y aventura. No hay fin a las aventuras que podemos tener, si sólo las buscamos con los ojos abiertos", "action_results": [{"action": "Knock on your skull and question why you suddenly know spanish.", "result": "You have faint memories of a childhood long forgotten. Your mother knew spanish, at least you think that is correct, your memories are a bit hazy. Perhaps you should try to trigger these memories.", "action_results": []}, {"action": "Search for the power source of the light.", "result": "You walk toward the light.  As you get closer, the light gets brighter.", "action_results": []}]}]}, {"action": "Quickly find a place where you can get fresh air.", "result": "You crawl towards the door and manage to prise it open using the little strength that is still available, you reach fresh air just before you suffocate.", "action_results": [{"action": "Take the deepest breath ever", "result": "You are overcome with relief and feel a surge of energy after breathing the air in.", "action_results": [{"action": "Sit there breathing in oxygen for a short while.", "result": "You feel better after you take in the air.  You slowly get back up.", "action_results": []}, {"action": "Head back into the suffocating building to keep looking.", "result": "You go back down into the building's basement, and your old Maglite flashlight catches a faint reflection on the wall. It is an old sign, coated with years of dust. It reads \"Fallout Shelter.\"", "action_results": []}]}, {"action": "Use flashlight to hold door open to regain strength", "result": "You are able to get all the way out the door. You see a guy walking toward you.", "action_results": [{"action": "keep head down and hope you are not seen", "result": "You keep walking, but the guy introduces himself.  He seem friendly and you have a conversation about what to do next.", "action_results": []}, {"action": "raise head and ask for help", "result": "You call for help but the man looks away.  You yell louder to get his attention.", "action_results": []}]}]}, {"action": "Find a cool washcloth and some water to help you from fainting", "result": "You put the washcloth on your neck.  It's cool and it perks you up right away.", "action_results": [{"action": "Stand up and keep moving.", "result": "You move through the corridor, desperately looking for a way out. You come to an intersection.", "action_results": [{"action": "turn right at the intersection.", "result": "Their is no clear sign of what direction you should be going. You know you are lost. You come to a second intersection.", "action_results": []}, {"action": "turn left at the intersection.", "result": "You notice a number of doors lining this hall of the corridor. One hangs partially open.", "action_results": []}]}, {"action": "Take a break and catch your breath.", "result": "A light gust of wind hits your face, coming from the North.", "action_results": [{"action": "Pump your fist in the air and head off into the wilderness to find some food. he", "result": "When you get into the woods, you find a berry bush.  You try one hoping that it isn't poisonous.", "action_results": []}, {"action": "The smell of smoke lingers in the air, go investigate its source.", "result": "You discover the remains of a recently extinguished campfire.", "action_results": []}]}]}]}]}]}]}]}