{"tree_id": "apoc_seed1", "context": "Long ago the bombs fell and the world ended. You are one of the few who is still alive. You are trying to survive by scavenging among the ruins of what is left behind. ", "first_story_block": "You are standing outside an old rundown gas station at the edge of town. There are old broken cars surrounding the gas station and on the road. You are extremely hungry and haven't eaten in a few days. ", "action_results": [{"action": "look in the gas station for food. ", "result": "You search the gas station for food, but find nothing you can eat.", "action_results": [{"action": "search the cars for food.", "result": "You search the cars for food, you search three without success, but in the glove compartment of the fourth you find a box of crackers.", "action_results": [{"action": "eat the crackers.", "result": "They remind you of when you needed to eat a bland diet after your operation. You pat yourself on where you remember the incision was made. The scar healed long ago, but the brain remembers. The crackers weren't very nutritious, but some fuel in the tank is better than none.", "action_results": [{"action": "Continue to look for food in the building up ahead.", "result": "You find a moldy sandwich and some peppered beef jerky in an old lunchbox.", "action_results": [{"action": "Snack on the jerky while searching for more food.", "result": "The jerky is so hard your tooth falls out.", "action_results": [{"action": "look for a mirror to assess the damage", "result": "Blood is pouring from your mouth and the pain is unbearable.", "action_results": [{"action": "Press your tongue into the abscess to stop the bleeding.", "result": "A foul odor rushing into your nostrils and the pain becomes even worse.", "action_results": []}, {"action": "Look for cloth or paper towel to stuff the gaping wound with.", "result": "You find a cloth on the floor. It looks like a used bandage, and is crusted with dried blood.", "action_results": []}]}, {"action": "use pliers to pull the rest of the tooth", "result": "Passes out from the pain. Falls to the floor", "action_results": [{"action": "Check your things for alcohol or antiseptic.", "result": "You find a bottle of alcohol in your bag.  You take a swig from the bottle.", "action_results": []}, {"action": "Search the area for medical supplies.", "result": "You find a bottle of Tylenol and struggle to open it.", "action_results": []}]}]}, {"action": "Scrape the mold from the sandwich, taste a bite to see if it is edible.", "result": "The sandwich is stale.  You throw it away and hope you don't get sick.", "action_results": [{"action": "Look for more food.", "result": "There is no more food around, but there's two bottles of beer.", "action_results": [{"action": "Drink one beer.", "result": "You drink the beer, but it tastes funny.  You hope you don't get sick later.", "action_results": []}, {"action": "Put the beer in your bag and walk towards the next store.", "result": "You grab the beer, leaving the building and heading toward the next store. You are hungry.", "action_results": []}]}, {"action": "Take some medicine you saved.", "result": "It wasn't enought, you are food poisoned.", "action_results": [{"action": "take more medicine", "result": "The medicine does little to improve your upset stomach.", "action_results": []}, {"action": "ride  out the food poisoning", "result": "I try to drink some milk.", "action_results": []}]}]}, {"action": "Eat the peppered beef and throw the sandwich to the side", "result": "You discovered the peppered beef had gone bad when you developed cramps and diarrhea just hours after eating it.  Fortunately, the food poisoning will pass and you will be all right.", "action_results": [{"action": "Look for water.", "result": "You find a dirty puddle. You know it is likely contaminated but you are so thirsty you bend down and lap it up.", "action_results": [{"action": "It tastes horrible and within a half hour your stomach begins having awful pains.", "result": "You feel nauseous and begin to vomit loudly.", "action_results": []}, {"action": "You change your mind and make yourself throw up the water. You gather the dirty water in a container and search for a way to boil or purify it.", "result": "You see something that looks like a lighter sticking out of a fanny pack caught on a tree, but it looks like you'll need help to get it down.", "action_results": []}, {"action": "Get on your feet and keep walking.", "result": "You walk on.  Hopefully, you can come across more water and food.", "action_results": []}, {"action": "Consider the new lows you're hitting, lapping from a dirty puddle.", "result": "You decide it would be better to boil the water before drinking.  You fill a container and proceed to start a fire.", "action_results": []}]}, {"action": "Look for more food.", "result": "You find some rotten vegetables, and nothing more.", "action_results": [{"action": "Throw the rotten vegetables against the wall, in anger.", "result": "Slime from the rotten vegetables bounces back, and some gets in your mouth.", "action_results": []}, {"action": "Exit the room.", "result": "Locate new room.", "action_results": []}]}]}, {"action": "Continue to search for food", "result": "There is no more food around, and you start feeling hungry.", "action_results": [{"action": "Fast, its good for you", "result": "You fall down on the ground. You close your eyes.", "action_results": [{"action": "Wake up and forage for mushroom and berries, and hope that they're not toxic.", "result": "You eat one of the berries and immediately feel a wave of nausea.", "action_results": []}, {"action": "Wake up and construct a trap for catching any rodents or animals that come through.", "result": "The trap manages to catch a large rat.  You grimace looking at it, but it is meat.", "action_results": []}]}, {"action": "Yell and hope someone is around", "result": "The silence from the darkness is deafening.", "action_results": [{"action": "Start crying.", "result": "You hear a noise.  This causes you to stop crying.  You are scared.", "action_results": []}, {"action": "Sit down and consider the options.", "result": "You sit and think about what to do.  You wish there were someone to talk to.", "action_results": []}]}]}]}, {"action": "Look for water for hydration and to fool the stomach until ore food can be found.", "result": "No water can be found in the cars, and suddenly you regret eating salted crackers: you can feel your tongue swelling up, begging for some hydration.", "action_results": [{"action": "Look for a different water source in the vicinity.", "result": "You hear running water nearby.  You walk around the area and find a small creek.", "action_results": [{"action": "Drink the water.", "result": "finally found water, should take some water next time", "action_results": [{"action": "Look for a container to hold water.", "result": "You find a canteen on the shelf.  You reach up and take it.", "action_results": []}, {"action": "Pee in the creek.", "result": "It feels good to pee.  You let it all out and take off again.", "action_results": []}]}, {"action": "Take a bath in the creek.", "result": "Swimming in the creek feels amazing. It is the first time in days that you don't feel like you are on fire.", "action_results": [{"action": "Create a fishing pole with nearby materials and catch some lunch.", "result": "You search for other people in the river.", "action_results": []}, {"action": "Wash clothes and supplies in the fresh water.", "result": "You notice small specks in the water darting from left to right. The small specks you realize are actually biting insect that have created a rash on your legs and forearms.", "action_results": []}]}]}, {"action": "Keep walking to see if you can find a supermarket anywhere.", "result": "You see a building in the distance.  You continue walking and see a sign in front of it.  Luckily it is a supermarket.  You hope that you will find something to drink there.", "action_results": [{"action": "Go inside.", "result": "The entire supermarket is ransacked, scavenged by wild dogs and other creatures.", "action_results": [{"action": "Go back outside.", "result": "Feeling disappointed by the carnage inside the ruined market your head hangs low with dispair. Then you think to yourself, \"I must keep searching.\"", "action_results": []}, {"action": "Look for locked doors.", "result": "You check each door.  Most of them are locked.", "action_results": []}]}, {"action": "Look around to see if anyone's watching.", "result": "As you head towards the building you check for others with the same idea.  At this point, competition might become violent, but your quick, thirst-distracted search shows no one.", "action_results": [{"action": "Enter the supermarket through the main entrance.", "result": "The supermarket is very dark.  You take out a flashlight to see inside.", "action_results": []}, {"action": "Go to the back of the supermarket.", "result": "You notice some unopened bottles of water, and begin to head towards them", "action_results": []}]}]}, {"action": "Calm the mind to extend search for hydration.", "result": "You know it recently rained. You look outside to see if there are any containers that might have rainwater in them.", "action_results": [{"action": "drink from an old bucket", "result": "The water has a nasty oily flavor to it, but helps to assauge your thirst. But you need more water, and soon.", "action_results": [{"action": "Pour some water from the bucket into your water bottle.", "result": "You try to pour the water into your bottle, but it spills out.  Now you need water more than ever.", "action_results": []}, {"action": "Take two empty buckets to the river to fill them with fresh water.", "result": "You fill the buckets. You know that river water is often dangerous to drink, the risk of illness is very high. But perhaps you can do something about the collected water later.", "action_results": []}]}, {"action": "find water in a gutter", "result": "You notice a house with leaves overflowing its gutter. After the recent rain, you know water should still be up there, so you start to climb up the nearby tree.", "action_results": [{"action": "Clear the gutter of leaves after placing a container under the gutter to collect water.", "result": "The container quickly fills up with water.", "action_results": []}, {"action": "Drink water straight from the gutter.", "result": "The water tastes like dirt and is full of leafy pulp, but it is still refreshing. Then you notice the dead bird mixed in with the leaves in the gutter, and your stomach does a flip-flop.", "action_results": []}]}]}, {"action": "Look for puddles of water around the area.", "result": "You walk around trying to find pools of water.  Eventually, you find a small puddle of water.  You kneel next to it and take a sip.", "action_results": [{"action": "Fill your canteen.", "result": "The water tastes horrible, and you feel like throwing up.", "action_results": [{"action": "light a fire to sterilize contaminated canteen", "result": "The water sizzles and a small black smoke oozes from the canteen.", "action_results": []}, {"action": "see a canteen and hope it is clean.", "result": "You look into the canteen and take a drink.  It tastes delicious.", "action_results": []}]}, {"action": "Wash your body.", "result": "Your skin begins to burn and you realize the water was contaminated.", "action_results": [{"action": "Throw up the water you drank a minute ago", "result": "Walk further away to find other pools of water that might not be contaminated.", "action_results": []}, {"action": "Use what you can from your clothes and wipe off as much of the water as you can off your body", "result": "Your tongue begins to swell, and your quickly reach for some supplies to help numb the swelling.", "action_results": []}]}]}]}, {"action": "Search the cars for clothing.", "result": "There is no clothing in the car.", "action_results": [{"action": "Search the car for water.", "result": "You find there is a bottle under the seat, but it is not a water bottle.  It is Jack Daniels and is only half full.", "action_results": [{"action": "take a swig of Jack Daniels", "result": "After drinking the rest of the bottle, still in pain, I decide to rest to continue the journey.", "action_results": [{"action": "Start daydreaming while you walk.", "result": "While you're walking you stumble over some bricks on the road, as you are not paying attention to what is around you.", "action_results": []}, {"action": "Go to your local Alcohol Anonymous meetings.", "result": "you become free from your gripping alcohol addiction, and gain a new addiction, candy.", "action_results": []}]}, {"action": "save the alcohol for a future antiseptic", "result": "I nick my knee on a metal post and disinfect it with the saved alcohol.", "action_results": [{"action": "Find something to wrap your wound with.", "result": "You find a medipack on the shelf.  You open it, but there are no bandages in it.", "action_results": []}, {"action": "Put the rest of the Jack Daniels back in your bag.", "result": "As the sun rises, it starts getting very hot inside", "action_results": []}]}]}, {"action": "Look for a store that has clothing.", "result": "There is a moldy coffee cup below the register and money in the till.", "action_results": [{"action": "Leave the money and look for clothing", "result": "money has no value in this situation", "action_results": [{"action": "Keep the money as fire fodder.", "result": "Continue to search for clothing, as the money is kept away for later use.", "action_results": []}, {"action": "Throw the coffee cup against the wall in anger.", "result": "The cup breaks as it hits the wall.  You begin to cry.", "action_results": []}]}, {"action": "Try on different clothing and shoes", "result": "new clothes but still a lot to discover", "action_results": [{"action": "stay and explore", "result": "You find a half eten chocolate bar in the trash.", "action_results": []}, {"action": "be satisfied with what was has been  found and leave", "result": "As you walk, you notice something in the toe of one of the shoes that looks like a gold nugget, but you wonder if gold has any worth in this new world.", "action_results": []}]}]}, {"action": "See if the car runs for temporary transportation and shelter.", "result": "The engine starts with a roar: the car is still working!", "action_results": [{"action": "Drive the car", "result": "a tire bursts", "action_results": [{"action": "Pull over and inspect the burst tire.", "result": "You pop the trunk and start to get the spare from it. When you pause for a moment, you hear the distant rev of another car engine.", "action_results": []}, {"action": "Check the trunk for a spare tire.", "result": "You open the trunk and gag as a stench so thick it is almost tangible hits your face. The trunk is filled with several corpses in various states of decay. Some of the bodies are partially butchered. This was a cannibal's ride, and you just stole it.", "action_results": []}]}, {"action": "Check the fuel level of the car", "result": "In the summer of last year, I was driving towards Paris and it seemed I was distracted because I did not sleep enough and at one moment I found myself in a serious traffic accident. The car overturned and rolled several times. I had several fractures in my legs and my hands are good. Myself surrounded by my wife and children, despite all that hit me I was grateful that I am still alive", "action_results": [{"action": "Pay attention to the road ahead.", "result": "I pull in near a rest stop to decide on how to move forward.", "action_results": []}, {"action": "Look for a road map.", "result": "You find a road map on the sidewalk near where the car was totaled.", "action_results": []}]}]}, {"action": "Cut the fabric cloth from the seats to create clothing or blankets.", "result": "You start feeling warmer with that makeshift blanket: that might do, for the night.", "action_results": [{"action": "Check for gas", "result": "The car still has half a tank, enough to turn on the heating for the night to further warm you up.", "action_results": [{"action": "Decide to conserve the gas and only turn on the heat if it becomes too cold to survive with just the blanket.", "result": "You check outside one last time before trying to get some sleep before another day. At least with the car you might be able to get a bit further tomorrow.", "action_results": []}, {"action": "Use the car to drive to another location that may offer more shelter or ways to keep warm.", "result": "You find a shelter.  There are others there.  You are offered a bed and food to eat.", "action_results": []}]}, {"action": "Lock car and sleep to regain strength", "result": "Feeling more secure and warm, you nestle into the hole in the cushion of the car seat you stripped, and start to dream of your old life.", "action_results": [{"action": "Wake up and check your surroundings.", "result": "You realize you are now in a location that is not the same as the one you were in when you fell asleep.  Your heart starts racing and you feel very faint.", "action_results": []}, {"action": "Wake up in the night to ensure you're alone and safe.", "result": "After looking around and checking the locks, you are able to fall back asleep in only a few minutes.", "action_results": []}]}]}]}, {"action": "Begin to walk towards the nearest town.", "result": "You arrive and, despite the state of things, many store lights seem to be functioning. The first store you encounter is a gun shop. You decide to step inside.", "action_results": [{"action": "Take a gun and some ammo.", "result": "You are now protected against anyone who would try and do you harm, you step out into the street to search the supermarket next door", "action_results": [{"action": "Look around to see if anyone is watching", "result": "You see eyes in the window across the street.  You lift your gun higher to hopefully scare them off before entering the supermarket.  You don't want competition.", "action_results": [{"action": "Enter the supermarket.", "result": "There is nothing left in the supermarket.  Looters must have hit it earlier.", "action_results": []}, {"action": "Fire off a warning shot.", "result": "Suddenly, a flock of birds disperse off of the roof of the supermarket, startling you.", "action_results": []}]}, {"action": "Make sure gun is loaded", "result": "Search the supermarket for supplies. clear the store of any threats.", "action_results": [{"action": "Search for a safe place to hideout.", "result": "You find an abandoned vehicle that should provide cover and keep you safe from others who would do you harm.", "action_results": []}, {"action": "Search the liquor store next door in case of future injuries.", "result": "You put some liquor in your bag and proceed onward with your day.", "action_results": []}]}]}, {"action": "Go into a different store to look for food.", "result": "Too your luck, you find a store a couple blocks away that has non perishable items in it.", "action_results": [{"action": "go into store and pack as many cans as you can", "result": "Lucky you, you find Bottled Water Packages, way too many of them.", "action_results": [{"action": "Take what you can and come back later.", "result": "You stay hydrated.", "action_results": []}, {"action": "Drink as much water as you can.", "result": "You feel very refreshed and satisfied.", "action_results": []}]}, {"action": "Search fro something to carry back food", "result": "You find 5 can of BBQ beans. Beans have always been your favorite ever since your mom made them for you as a child.", "action_results": [{"action": "there are also cans of fruit", "result": "You take the cans of fruit.  You can never be too prepared and you don't want to starve.", "action_results": []}, {"action": "no room in backpack for more.", "result": "You look in the store for a larger backpack so you can carry more supplies.", "action_results": []}]}]}, {"action": "Look for a weapon to hunt any animals with.", "result": "You bypass the firearms thinking of possible ammo shortages later on. Instead you choose a crossbow.", "action_results": [{"action": "Go inside store and see if there are bows and arrows", "result": "Towards the back, you see a picture of a crossbow on the wall.  Full of hope you head towards the aisle you think might have bows and arrows.", "action_results": [{"action": "there are arrows on the floor but  do not pick them up", "result": "You leave the arrows where they are.  You walk past them, careful not to touch them.", "action_results": []}, {"action": "pick up the arrows that are scattered all around the store.", "result": "You pick up the arrows and put them into your bag.  They may come in handy later.", "action_results": []}, {"action": "scan aisle to find crossbow", "result": "Locate crossbow at the end of the aisle.", "action_results": []}, {"action": "walk quietly toward aisle without making noise", "result": "The aisle does indeed contain bows and arrows but they are behind glass.", "action_results": []}]}, {"action": "Go inside store, grab crossbow and try hunting", "result": "You search for something to kill for food but there is no sign of life.", "action_results": [{"action": "Pull out some of your precious food to use as bait.", "result": "You hide in a nearby tree, watching your precious bait, hoping to lure another starving creature to it.", "action_results": []}, {"action": "Eat your rations you found earlier.", "result": "You curb your hunger for now, but barely. You are very thirsty.", "action_results": []}]}]}, {"action": "See if theres any extra food anywhere stored in the shop.", "result": "You open a desk drawer and find snacks stored away.  Hopefully they aren't stale.  You take them with you in case you find nothing else.", "action_results": [{"action": "Hold on to the snacks", "result": "You put the snacks in your backpack and close it.", "action_results": [{"action": "close the drawer", "result": "With the drawer closed you turn turn to the cupboards to search for additional supplies.", "action_results": []}, {"action": "see what else is in the drawer", "result": "You try to find a knive to cut the meet.", "action_results": []}]}, {"action": "Grab some guns and ammo to kill food", "result": "After getting weapons and groceries, I'm looking for a car or something to look for more survivors.", "action_results": [{"action": "Find a run down car in the next field over.", "result": "The car has been used recently, somebody kept it running condition. The girl slides in under the dashboard and starts fiddling with wires. The engine cranks once, twice, three times. On the fourth crank it catches and fires up.", "action_results": []}, {"action": "Begin walking further out of town to look for a car.", "result": "You find one broken down a little ways down the road.", "action_results": []}]}]}]}]}]}]}]}