{"tree_id": "upwork6", "context": "", "first_story_block": "To your right you see jars filled with preserved fruits and vegetables. To your left you see more jars but can make out the contents clearly.", "action_results": [{"action": "eat some preserved fruits and vegetables", "result": "You delight it some pickled okra and some peach preserves. You think about bringing some food with you, but it will be too heavy for travel. So you try to eat as much as you can now. You decide to have some for the morning as well. It's getting late and with your full belly you are feeling quite tired. You can reenter the farmhouse or sleep in the shed.", "action_results": [{"action": "stay in the shed", "result": "You remembered the noise you heard early and decide to holed up in the shed.", "action_results": [{"action": "find a place in the shed to relax", "result": "You use your hands to guide you around the space. Just past the preserved goods on the shelves there seems to be a small rug that is folded. ", "action_results": [{"action": "adjust the rug to lay on it", "result": "As you kneel down to adjust the rug your hand touches something cold and metal-like.", "action_results": [{"action": "access the metal object", "result": "It seems to be a large metallic ring connected to the floor. ", "action_results": [{"action": "pull the ring", "result": "The floor lifts slightly and a dusty smell wafts out.", "action_results": [{"action": "shut the hatch back", "result": "It seems to be a hatch that leads to an underground area like a cellar or bunker.", "action_results": [{"action": "open the hatch again", "result": "You open up the hatch again but a little wider and stick your head in a bit. It's too dark to see anything. All you can do is smell the muskiness of whatever is below.", "action_results": [{"action": "close the hatch and resume to try to sleep", "result": "You lay on the small rug and try to get comfortable. You hold yourself and try to get a grasp on reality before fading to sleep.", "action_results": [{"action": "wake up", "result": "You awaken to some sunlight beams leaking in through the shed. You stretch and yawn as you look at the jars of preserves.", "action_results": []}]}]}]}]}]}]}]}]}]}]}