{"tree_id": "upwork11", "context": "", "first_story_block": "You open the back door into the house and go inside. You're in a combined kitchen and living room. You see several cupboard doors are hanging open, a fridge and several couches around a TV.", "action_results": [{"action": "check the kitchen", "result": "You go through cupboards and find a few cans of beans. You pull the them out and place them on the counter. You hear the other guy rummaging through things upstairs.", "action_results": [{"action": "check the refrigerator", "result": "You open the fridge and are greeted by a magnificent mold colony. However there are three bottles of water that can be saved.", "action_results": [{"action": "put water on the kitchen counter", "result": "As you place the water on the counter you hear a shuffle and crash from upstairs. Muffled yelling from the man you entered the house with.", "action_results": [{"action": "check on the man", "result": "You quickly head up the stairs and enter the room with the open door. You the man cradling his hand and cursing.", "action_results": [{"action": "ask him what happened", "result": "\"Was some sort of freaky looking rodent!! It bit me on my hand when I reached under the bed. I think it's still under there...\" I tell him that i'm gonna lift up the bed if he will ready his crowbar to kill it. He nods in agreement.", "action_results": [{"action": "lift the bed up", "result": "You lift up the bed and wait for him to have some reaction. You watch him crouch down and use the crowbar to hit some boxes and bags.", "action_results": [{"action": "ask him if he can see it", "result": "\"I would say something if I did\" he sasses back at you. Maybe it's in one of the boxes or bags trying to hide. You are starting to get tired holding up the bed.", "action_results": [{"action": "ask him to hurry", "result": "He scoffs at you and begins to wail the crow bar on the boxes and bags. We don't hear anything or see anything.", "action_results": [{"action": "tell him you need to place the bed back down", "result": "He pulls the boxes and bags out with the crowbar and places them to the side. He nods at you.", "action_results": [{"action": "put the bed down", "result": "You both slowly look through boxes and bags. You find a hanger and use it to poke through things.", "action_results": []}]}]}]}]}]}]}]}]}]}]}