{"tree_id": "", "context": "G22", "first_story_block": "have some preserves for breakfast", "action_results": [{"action": "You eat some green beans, carrots, and applesauce. You figure this will be enough nutrients for now.", "result": "look around", "action_results": [{"action": "You look back to the other shelf and see it has some weird contents. Some sort flesh and meat compositions that repulses you. You don't wanna know if its animal or...something else.", "result": "check the hatch", "action_results": [{"action": "You the hatch door wide open and look down into it. You see a few more shelves and notice that room leads further back. You feel a draft coming from that direction.", "result": "exit the shed", "action_results": [{"action": "Deciding against jumping down into a creepy underground room, you open the shed door. As you eyes san the area, you recall generally where you need to go to get to Bright Meadow.", "result": "get back on the road to Clayton", "action_results": [{"action": "You walk down the country road and slowly scan your surroundings. Everything seems so silent. It's almost unnatural and surreal. ", "result": "continue down the road", "action_results": [{"action": "It's been roughly an hour now and the sun is really shining down you. You are becoming a little parched and in need of refreshment.", "result": "scan your surroundings", "action_results": [{"action": "To the right there are fields that use to hold crops that are currently in decay. To the left there is a slightly decaying forest. ", "result": "walk left into the forest", "action_results": [{"action": "You walk into the woods and sit on a rock between a group trees. You wonder if there is some form of running water somewhere in here. You notice there are small pebbles at your feet.", "result": "pick up a pebble", "action_results": [{"action": "You pick up the pebble and notice the ground if very dry. This makes you uncertain a water source could be nearby. You could try to go further into the forest or suckle on the pebble to create saliva to help your body sustain a bit longer.", "result": "suckle on the pebble", "action_results": [{"action": "You roll the pebble around in your mouth and your mouth begins to salivate.", "result": "H8", "action_results": [{"action": "jump down into the hatch", "result": "You jump down into the underground room and a little bit of dirt spreads when your feet it the ground. It isn't extremely dusty, so it may have been used within the last few months.", "action_results": [{"action": "look around", "result": "It's rather dark, but the some of the sunlight streams through the hatch opening. You squint your eyes to see your surrounds. You remember there is one more match left.", "action_results": [{"action": "strike the match", "result": "The match illuminates and you slowly look around you. On the closest wall you see what looks like an oil lantern.", "action_results": [{"action": "light the lantern", "result": "You see there is still some oil left in the lantern and it seems to be functioning properly. You can tell it's also been used before.", "action_results": [{"action": "search the room", "result": "You move slowly around the room with the lantern. You see some old wooden tables, stacks of old shackles, and a random assortment of clothes for all genders and ages. ", "action_results": [{"action": "look in the back of the room", "result": "You head back towards where a draft comes from. There seems to a be a tunnel that you can't see the end of. It is dark and damp.", "action_results": [{"action": "head down the tunnel", "result": "You walk down the tunnel. It's a little damp and you can hear a water drip coming from somewhere. That might be a good sign, as you are quite thirsty.", "action_results": [{"action": "continue down the tunnel", "result": "You walk a good fifthteen more minutes down the tunnel till you reach a fork in the passage. It splits into three ways. Right, middle, and left.", "action_results": [{"action": "go to the right", "result": "You head down the right passage and don't have to walk too long before coming into a room with a pile of bones in it. There seems to be both human and animal bones here, this frightens you.", "action_results": [{"action": "head back and go down the middle", "result": "You run back and head down the middle passage. Your lantern is starting to go flicker in and out. You reach a huge room that has a heavy air to it. You are filled with dread. As you walk further into the room a deep voice bellows, \"We've been waiting for you\"", "action_results": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}