{"tree_id": "upwork5", "context": "", "first_story_block": "You try to open the farmhouse front door, but it's locked. There's a broken window on the right and a shed behind the house.", "action_results": [{"action": "head towards the shed behind the house", "result": "You notice there is a padlock on the shed. Maybe you can find a key or a tool to get in.", "action_results": [{"action": "head back towards the broken window of the farmhouse", "result": "You have to go through the window to look for tools. You careful break the window more to go inside.", "action_results": [{"action": "go through window", "result": "You cut yourself on the edges as you're climbing in, but you make it inside.You find some thick sturdy shirts and there are rusted scattered tool scattered throughout. There doesn't seem to be any food around, however you wonder if there is a tool or key to open the shed. ", "action_results": [{"action": "search the farmhouse", "result": "You're Not the best educated when it comes to tools but you have an idea of what kind of tool you need to use. You see lots of shovels, rakes, and pitchforks. You notice something that looks like big pliers...maybe that can work? ", "action_results": [{"action": "grab bolt cutter", "result": "You could go back out to open the shed but it is starting to get dark. You think about resting in the farmhouse or going to check the shed out.", "action_results": [{"action": "go back to shed", "result": "Dusk is setting and you climb out the window unscathed. You walk over to the shed and begin to attempt cutting the lock off. Your stomach growls as you place the bolt cutter on the lock. In that moment you think you hear rustling behind you. You turn to look and nothing is there. so you resume cutting the padlock off.", "action_results": [{"action": "enter the shed", "result": "You remove the padlock and slowly open the door. With the sun setting, it's a bit difficult to see the contents of the shed.", "action_results": [{"action": "search the shed", "result": "You can make out that there are some storage shelves and a few tables. You see something that looks a tin pot or jug to some sort. You check it and it has nothing inside. Next to it on a table you see a matchbox. You take the matchbox because it's likely to help you see.", "action_results": [{"action": "strike a match", "result": "The first match goes dull quick. The second and third match break as you try to strike them. There are only two matches left. You try to relax a bit to keep yourself from breaking another match. You strike the match and it stays lit.", "action_results": [{"action": "search the shed slowly", "result": "To your right you see jars filled with preserved fruits and vegetables. To your left you see more jars but can make out the contents clearly.", "action_results": []}]}]}]}]}]}]}]}]}]}]}