{"tree_id": "", "context": "H22", "first_story_block": "head back to road", "action_results": [{"action": "You continue down the road for another hour. You finally see a road sign saying \"Clayton 5 Miles\". This sparks a bit of joy in you. By this rate you'll definitely be there within an hour and half. Then to Bright Meadow within two to three hours.", "result": "move forwards faster", "action_results": [{"action": "Your energetic boost pushed you further down the road. In the distance you spot an abandoned car.", "result": "search vehicle", "action_results": [{"action": "You look through the windows and don't see much left in the car. One of the side windows was broken open.", "result": "get into the car", "action_results": [{"action": "You immediately check for keys and they aren't in the ignition. You decide to search the car more.", "result": "check the glove box", "action_results": [{"action": "You open the glove box and it has papers in it. Mostly car insurance and information. ", "result": "check the backseat", "action_results": [{"action": "You notice a dried blood stain on the back car seat. There is also some trash.", "result": "check the floors", "action_results": [{"action": "You scan underneath the front car seats and the floors. You find the car keys were just out of sight under the driver's seat. ", "result": "start the car", "action_results": [{"action": "You try to start the car several times and nothing happens. You think of the possibility it needs gas and maybe they had spare gas in the trunk. ", "result": "pop the trunk", "action_results": [{"action": "You press the button to unlock the trunk. It slowly lifts open.", "result": "check the trunk", "action_results": [{"action": "You get out of the car and walk towards the trunk.", "result": "I22", "action_results": [{"action": "check trunk", "result": "When you get to the back of the vehicle you begin to notice a strange stench. You slowly peak around into the trunk to see the alarming sight of a decayed carcass laying there.", "action_results": [{"action": "step back in shock", "result": "You stumble backwards and fall onto the ground. What could that have been? You need to check for gas so you must look into the trunk again.", "action_results": [{"action": "reluctantly check the trunk ", "result": "You stand up and look into the trunk to examine the carcass. You realize it is one from an animal. You quickly look for any useful items, but there seems to be nothing but the carcass.", "action_results": [{"action": "close the trunk", "result": "Despite being unable to find gas you decide to try getting the car going anyway.", "action_results": [{"action": "try to start the car", "result": "You attempt to start the car several times and you are consistently unlucky. ", "action_results": [{"action": "get out of the car", "result": "You check the car one more time. To make sure there isn't anything useful left behind.", "action_results": [{"action": "head towards Clayton ", "result": "Even without the car, you know if won't take too long for you to reach Clayton then head towards Bright Meadow. You try to stay optimistic despite being a bit dehydrated and also starting to get hungry again.", "action_results": [{"action": "continue down the road", "result": "As you continue down the road you notice a movement in the sky.", "action_results": [{"action": "look up at the sky", "result": "You see there are few birds of prey circling an area at the end of the forest. there could be something there that has taken there interest. However you aren't too far from entering the Clayton limits.", "action_results": [{"action": "continue towards Clayton", "result": "You approach a sign that says the road exit to Clayton is up ahead. You're pace picks up as you steady closer to the exit ramp.", "action_results": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}