{"tree_id": "upwork3", "context": "", "first_story_block": "The man shakes his head. \"Hardly enough food for one person. I've only lived this long by looking after myself.\" He turns and starts walking away.", "action_results": [{"action": "leave the store and get back in your car.", "result": "You think about what the man said. How is this possible? Why were you in that hospital and what should you do now?", "action_results": [{"action": "drive back to the hospital to see if you can find any clues. ", "result": "As you pull in to the hospital parking lot the car sputters and dies. It's out of fuel an slows to a halt. ", "action_results": [{"action": "go back to the room you woke up in.", "result": "You get to the room. It's the same as how you remember it. Broken equipment everywhere. But there's also a small notebook that you didn't notice before lying on the floor. ", "action_results": [{"action": "read the notebook.", "result": "It looks like a journal. As you flip through the pages you see drawings of the death and destruction. The journal talks about someone's horrific experiences during the aftermath of the war. ", "action_results": [{"action": "try to see if anything in it sparks your memory.", "result": "you read for a while hoping this will give you some clue. None of the events written about spark anything, but you do read someone's name that you feel like you should know. \"Sarina\". It says she heard about a community called \"Bright Meadow\" that was safe and had food and was leaving to find it. ", "action_results": [{"action": "see if you can find out where Bright Meadow is from the journal. ", "result": "You look through the journal to see if there are any clues about where Bright Meadow is. You find a crude map that shows Bright Meadow to the north of a town called Clayton. ", "action_results": [{"action": "go to Clayton.", "result": "You don't know where Clayton is. But maybe if you found a map you could figure out where it is.", "action_results": [{"action": "look for a map somewhere in the hospital. ", "result": "You start looking around for a map. You find an administrator's office that you think might have one.", "action_results": [{"action": "search the office for a map.", "result": "You look through the filing cabinets for a map. You find a bunch of patient records in a filing cabinet. In the desk you find a map that shows other hospitals in the region. It says Clayton is 15 miles to the West of here. ", "action_results": [{"action": "leave the hospital and start heading towards Clayton.", "result": "As you're walking to to Clayton you start getting hungry. You remember that you have few granola bars in your pocket. ", "action_results": []}]}]}]}]}]}]}]}]}]}]}