{"tree_id": "", "context": "D22", "first_story_block": "eat a few granola bars.", "action_results": [{"action": "You finish off the rest of your granola bars. You're full now, but are worried about what you'll eat when you get hungry again.", "result": "keep walking towards Clayton.", "action_results": [{"action": "You walk for two hours and take a break. You've left the town you were in and are now in a more rural area. There's a farmhouse to your right and a forest on your left. ", "result": "go in the farmhouse and look for food.", "action_results": [{"action": "You try to open the farmhouse front door, but it's locked. There's a broken window on the right and a shed behind the house.", "result": "go through the window into the farmhouse. ", "action_results": [{"action": "You break the rest of the glass in the window and try to carefully crawl through. You cut yourself on the edges as you're climbing in, but you make it inside. ", "result": "search the farmhouse for food. ", "action_results": [{"action": "You search around the farmhouse for food. You find some thick sturdy shirts and some rusty tools but no food. It's getting dark outside. You think it might be a good idea to sleep the night here.", "result": "sleep the night in the farmhouse.", "action_results": [{"action": "You wake up in the middle of the night sweating from a nightmare. In it you saw a woman screaming in some dark place. You feel like you need to rescue her and that you're the only one who can help her. ", "result": "go back to sleep till the morning.", "action_results": [{"action": "You try to go back to sleep, but can't shake the feelings from your dream. You decide you might as well get up and see if you can do anything productive. ", "result": "look around the farmhouse for anything else useful.", "action_results": [{"action": "You look around the farmhouse for anything else useful. You don't find anything else useful.", "result": "leave the farmhouse and continue walking towards Clayton.", "action_results": [{"action": "You get back on the road and continue your journey. After a few hours you realize how starving you are. You' really need to find a food.", "result": "look around to see what's around me.", "action_results": [{"action": "There's an old warehouse and a few mechanics shops. ", "result": "E22", "action_results": [{"action": "check warehouse", "result": "Uncertain you'd find anything of need at the mechanics you head towards the warehouse. You're not certain what kind of warehouse it is though.", "action_results": [{"action": "open door", "result": "You go straight for the front door and its locked. The windows are too high to break in to.", "action_results": [{"action": "check the back of the warehouse", "result": "It takes you a minute to walk along to backside of the building. There you find several loading docks for semi trucks. You see on of the loading gate open just enough for to squeeze through.", "action_results": [{"action": "access the loading gate", "result": "You check the loading gate before going under it. It seems pretty stuck.", "action_results": [{"action": "squeeze through the gate", "result": "You sit on the ground and put your legs through the open. You laying down fully you pull your body through the opening.", "action_results": [{"action": "look around", "result": "The warehouse looks slightly undisturbed. There are some boxes that have tipped over and scattered pallets in messy piles.", "action_results": [{"action": "check some boxes", "result": "You grab the top of a box and pull it down. The box shifts forward and a bunch of doll heads spill. This startles you and causes you to gasp loudly.", "action_results": [{"action": "examine the rest of the warehouse", "result": "You begin walking down the aisles and assume this a warehouse for toys or just parts of dolls. Then you distantly hear a playful voice say, \"This way...come this way\". They don't sound harmful.", "action_results": [{"action": "go in the direction you heard the voice come from", "result": "\"Hey, over here...\" you hear the playful voice say from a short distance away.", "action_results": [{"action": "walk towards the voice", "result": "You head in the direction you heard the voice come from. After passing a few aisles of stacked boxes you see an old man stand holding a doll. He beings to cackle.", "action_results": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}