{"tree_id": "upwork13", "context": "", "first_story_block": "You delight it some pickled okra and some peach preserves. You think about bringing some food with you, but it will be too heavy for travel. So you try to eat as much as you can now. You decide to have some for the morning as well. It's getting late and with your full belly you are feeling quite tired. You can reenter the farmhouse or sleep in the shed.", "action_results": [{"action": "go back to farmhouse", "result": "You head back to farmhouse and begin climbing through the window again. You hear a slight movement inside.", "action_results": [{"action": "stop moving to listen", "result": "You don't hear any more movement or sounds so you continue through the window.", "action_results": [{"action": "look around the farmhouse again", "result": "Since you heard the noise you are a bit cautious and want to scan the area the best you can. You remember you have one match left.", "action_results": [{"action": "strike match", "result": "From the tiny glow of the match you can see bails of hay, tools, and ladder leading up to a secondary lofted area.", "action_results": [{"action": "go up the ladder", "result": "You figure the lofted area would be safer for you to sleep. Your match flickers out as you make your way up.", "action_results": [{"action": "move slowly towards the back wall", "result": "You could make out that there is more hay up here but everything else is quite hard to see. As you make your way forward towards the hay you hit your head on something cold and metal-like. ", "action_results": [{"action": "use your hand to access the object", "result": "It seems to be thick old hook connected by chain link. When you touch it, it creaks a bit. You hear another slight movement that happens in reaction to the chain creaking. The sound seems to have come from the hay you were heading towards.", "action_results": [{"action": "continue towards the hay bales", "result": "You're not very certain what the sound could have been but whatever it is didn't sound too large.", "action_results": [{"action": "approach the hay bales", "result": "You stand in front of the hay bales and squint your eyes to try to see something. After a few minutes without hearing any movement or sound you lay down on the hay. It's a little prickly but it's better than a cold floor.", "action_results": [{"action": "try to sleep", "result": "Your mind races as you try to process what exactly is going on in the world. With very little memory of yourself and your surroundings, you try to meditate and access memories. After an hour you feel as if you know before you were heading somewhere, or there was a destination in mind at least. However, why or when you entered the hospital is still a mystery to you. You fall asleep amongst your thoughts.", "action_results": []}]}]}]}]}]}]}]}]}]}]}