{"tree_id": "upwork7", "context": "", "first_story_block": "You awaken to some sunlight beams leaking in through the shed. You stretch and yawn as you look at the jars of preserves.", "action_results": [{"action": "have some preserves for breakfast", "result": "You eat some green beans, carrots, and applesauce. You figure this will be enough nutrients for now.", "action_results": [{"action": "look around", "result": "You look back to the other shelf and see it has some weird contents. Some sort flesh and meat compositions that repulses you. You don't wanna know if its animal or...something else.", "action_results": [{"action": "check the hatch", "result": "You the hatch door wide open and look down into it. You see a few more shelves and notice that room leads further back. You feel a draft coming from that direction.", "action_results": [{"action": "exit the shed", "result": "Deciding against jumping down into a creepy underground room, you open the shed door. As you eyes san the area, you recall generally where you need to go to get to Bright Meadow.", "action_results": [{"action": "get back on the road to Clayton", "result": "You walk down the country road and slowly scan your surroundings. Everything seems so silent. It's almost unnatural and surreal. ", "action_results": [{"action": "continue down the road", "result": "It's been roughly an hour now and the sun is really shining down you. You are becoming a little parched and in need of refreshment.", "action_results": [{"action": "scan your surroundings", "result": "To the right there are fields that use to hold crops that are currently in decay. To the left there is a slightly decaying forest. ", "action_results": [{"action": "walk left into the forest", "result": "You walk into the woods and sit on a rock between a group trees. You wonder if there is some form of running water somewhere in here. You notice there are small pebbles at your feet.", "action_results": [{"action": "pick up a pebble", "result": "You pick up the pebble and notice the ground if very dry. This makes you uncertain a water source could be nearby. You could try to go further into the forest or suckle on the pebble to create saliva to help your body sustain a bit longer.", "action_results": [{"action": "suckle on the pebble", "result": "You roll the pebble around in your mouth and your mouth begins to salivate.", "action_results": []}]}]}]}]}]}]}]}]}]}]}