{"tree_id": "upwork9", "context": "", "first_story_block": "You walk back into the store and find a few shirts that you tear and wrap around your chest. It helps you feel slightly better. But you're still in a lot of pain.", "action_results": [{"action": "take a quick rest", "result": "You slouch down to the ground and try to breathe steadily. The pain beings to magnify. You wonder what has happened to the world and if there are more hostile people out there like the guy who attacked you.", "action_results": [{"action": "move further to the back of the store", "result": "Worried there are more hostiles around, you drag yourself to the back corner of the store.", "action_results": [{"action": "access the area", "result": "The corner is a bit dark as the natural light hardly reaches there. There also seems to be some rubbish on the floor. ", "action_results": [{"action": "lay down the corner", "result": "You feel a little dizzy so you bring yourself to the dark corner to rest a bit.", "action_results": [{"action": "take a short rest", "result": "You awaken to the sound of some footsteps nearby. Being a bit startled you pull yourself more into the dark corner. A sharp pain goes rings up from your ribcage.", "action_results": [{"action": "listen for the footsteps", "result": "After you moved you couldn't hear the footsteps anymore. You try to steady your heart rate and your breathing. After a few minutes you hear the footsteps again.", "action_results": [{"action": "stay quiet", "result": "A back door opens to your right and it startles you. You feel a cough well up inside you.", "action_results": [{"action": "hold in the cough", "result": "You place you hand over your mouth as you see a women cautiously come inside. She doesn't really look harmful but who knows what could be on her mind.", "action_results": [{"action": "stay hidden and attempt to escape", "result": "The woman looks around and beings to check the materials and rubbish scattered around on the floor mostly in the well lit areas. Your cough lets out.", "action_results": [{"action": "make a run for the back door", "result": "You dash out the back door and hear the woman scream, \"Wait! Watch out!!\". You take a few steps forward through the door and suddenly fall down into a hole. You are knocked unconscious.", "action_results": []}]}]}]}]}]}]}]}]}]}]}