{"tree_id": "upwork12", "context": "", "first_story_block": "There's an old warehouse and a few mechanics shops. ", "action_results": [{"action": "check warehouse", "result": "Uncertain you'd find anything of need at the mechanics you head towards the warehouse. You're not certain what kind of warehouse it is though.", "action_results": [{"action": "open door", "result": "You go straight for the front door and its locked. The windows are too high to break in to.", "action_results": [{"action": "check the back of the warehouse", "result": "It takes you a minute to walk along to backside of the building. There you find several loading docks for semi trucks. You see on of the loading gate open just enough for to squeeze through.", "action_results": [{"action": "access the loading gate", "result": "You check the loading gate before going under it. It seems pretty stuck.", "action_results": [{"action": "squeeze through the gate", "result": "You sit on the ground and put your legs through the open. You laying down fully you pull your body through the opening.", "action_results": [{"action": "look around", "result": "The warehouse looks slightly undisturbed. There are some boxes that have tipped over and scattered pallets in messy piles.", "action_results": [{"action": "check some boxes", "result": "You grab the top of a box and pull it down. The box shifts forward and a bunch of doll heads spill. This startles you and causes you to gasp loudly.", "action_results": [{"action": "examine the rest of the warehouse", "result": "You begin walking down the aisles and assume this a warehouse for toys or just parts of dolls. Then you distantly hear a playful voice say, \"This way...come this way\". They don't sound harmful.", "action_results": [{"action": "go in the direction you heard the voice come from", "result": "\"Hey, over here...\" you hear the playful voice say from a short distance away.", "action_results": [{"action": "walk towards the voice", "result": "You head in the direction you heard the voice come from. After passing a few aisles of stacked boxes you see an old man stand holding a doll. He beings to cackle.", "action_results": []}]}]}]}]}]}]}]}]}]}]}