{"tree_id": "upwork14", "context": "", "first_story_block": "sleep the night in the farmhouse.", "action_results": [{"action": "wake up", "result": "Warm light streams through cracks of the old farm house you open your eyes and stretch. As you lean up to sit something warm and fuzzy rolls down your arm.", "action_results": [{"action": "jump up", "result": "You spring off the hay the and turn to look at a slightly alarmed cat. It stares at you solemnly.", "action_results": [{"action": "pet the cat", "result": "You slowly reach out to pet the cat. It's a bit hesitant but allows you to pet it. ", "action_results": [{"action": "cuddle the cat", "result": "It's been awhile since you've been able to give and receive some affection. The cat is so sweet and kind. You notice it has some patches of fur missing and only has three legs. Although it has no open wounds. You then hear your stomach growl.", "action_results": [{"action": "head to the shed to eat", "result": "You begin to walk towards the ladder to go back to the bottom floor. You avoid the old hook and climb down the ladder. As you begin to head towards the window you hear the cat meow. It looks down at you from above.", "action_results": [{"action": "tell the cat to come down", "result": "You make encouraging noises and words at the cat so it will come with you. It doesn't move. It watches you stoically from above.", "action_results": [{"action": "leave the through the window", "result": "You climb out through the window and head towards the shed. When you enter the shed you notice there are some jars missing. ", "action_results": [{"action": "scan area", "result": "You step out the shed for a moment and look around. You don't see anyone or anything. Maybe your mind is playing tricks on you.", "action_results": [{"action": "head back to the shed", "result": "You turn around and the lovely three-legged cat approaches you. You pet it and head back into the shed.", "action_results": [{"action": "eat some preserves", "result": "You open some preserved pumpkin and begin to eat it. The cat meows at you. It must be hungry too. You place some pumpkin on the ground for it to eat. It makes delightful eating noises. You get back to eating and suddenly you hear some shuffling coming from somewhere... beneath you?", "action_results": []}]}]}]}]}]}]}]}]}]}]}