{"tree_id": "upwork10", "context": "", "first_story_block": "The man shakes his head. \"Hardly enough food for one person. I've only lived this long by looking after myself.\" He turns and starts walking away.", "action_results": [{"action": "He's right. You look around at the everything and realize that taking care of yourself might be the best bet.", "result": "get back in your car", "action_results": [{"action": "You are uncertain of where you are, but at least you have this car for now. You ride down the main road and look for a bigger city.", "result": "You pass a farm house and you approach what looks like a warehouse and a mechanics shop just across from it.", "action_results": [{"action": "pull up to the mechanics shop", "result": "You figure its possible to find more gas at the mechanics shop so you pull up to the garage.", "action_results": [{"action": "check the garage door", "result": "The door is locked and the windows to get in are too high to reach. Maybe there is a key in the front desk area.", "action_results": [{"action": "check the front desk office", "result": "You check the front and back door, they are both locked. However there are several windows you can break through.", "action_results": [{"action": "break window", "result": "Thinking on it, you wrap your shirt around fist and bust the window open. You clear off as much debris as you can.", "action_results": [{"action": "crawl through window", "result": "You pull yourself through and find yourself in a small bathroom. There doesn't seem to be anything important here.", "action_results": [{"action": "open door to front desk area", "result": "You slowly open the door and see the front desk area is mostly untouched.There's lots of dust  flying around.", "action_results": [{"action": "search the desk area", "result": "You begin to scan the desk, there are lots of papers and receipts. You open the first drawer and find some keys.", "action_results": [{"action": "take keys", "result": "You walk over to the front door and the keys on them. They don't seem to work.", "action_results": []}]}]}]}]}]}]}]}]}]}]}