{"tree_id": "", "context": "B16", "first_story_block": "ask the man what he wants and where everybody is.", "action_results": [{"action": "He looks at you confused. \"What are you stupid? This is the end of the world man!\" he says.", "result": "say \"What do you mean? I just woke up in a hospital with no memory. What happened?\"", "action_results": [{"action": "He responds \"Like I said, the end of the world. When the bombs starting falling three years ago we thought we could pull through. But then the skies turned black, crops started dying and everyone went crazy. Most people died in the first couple months.\" ", "result": "ask him how he managed to survive.", "action_results": [{"action": "He tells you that he was away hunting when it all started happening. He managed to live off the land for the first little while. But after the animals started dying he ran out of food and came to the city.", "result": "ask him if you two can work together. ", "action_results": [{"action": "The man shakes his head. \"Hardly enough food for one person. I've only lived this long by looking after myself.\" He turns and starts walking away.", "result": "run after the man and tell him you'll both do better together.", "action_results": [{"action": "He stops and thinks about it for a second, then says, \"Fine. I guess there might be advantages to working together.\" ", "result": "ask him where he thinks we should go next.", "action_results": [{"action": "He tells you there is a house on the road that looked undisturbed that might be worth checking out. ", "result": "start going towards the house. ", "action_results": [{"action": "You are walking towards the house. You reach an intersection. There is a police station on one corner an office building on another. The house is another half mile down the road. ", "result": "keep going towards the house. ", "action_results": [{"action": "You keep walking and eventually reach the house. You see a two story house that looks fairly undisturbed. There's a garage on the right and a path to the backyard on the left. ", "result": "go around the house to the backyard.", "action_results": [{"action": "You go to the backyard of the house. There's a dirty grill and an overturned slide. There's a door to the house on the back porch.", "result": "open the back door into the house.", "action_results": [{"action": "You open the back door into the house and go inside. You're in a combined kitchen and living room. You see several cupboard doors are hanging open, a fridge and several couches around a TV.", "result": "C10", "action_results": [{"action": "He's right. You look around at the everything and realize that taking care of yourself might be the best bet.", "result": "get back in your car", "action_results": [{"action": "You are uncertain of where you are, but at least you have this car for now. You ride down the main road and look for a bigger city.", "result": "You pass a farm house and you approach what looks like a warehouse and a mechanics shop just across from it.", "action_results": [{"action": "pull up to the mechanics shop", "result": "You figure its possible to find more gas at the mechanics shop so you pull up to the garage.", "action_results": [{"action": "check the garage door", "result": "The door is locked and the windows to get in are too high to reach. Maybe there is a key in the front desk area.", "action_results": [{"action": "check the front desk office", "result": "You check the front and back door, they are both locked. However there are several windows you can break through.", "action_results": [{"action": "break window", "result": "Thinking on it, you wrap your shirt around fist and bust the window open. You clear off as much debris as you can.", "action_results": [{"action": "crawl through window", "result": "You pull yourself through and find yourself in a small bathroom. There doesn't seem to be anything important here.", "action_results": [{"action": "open door to front desk area", "result": "You slowly open the door and see the front desk area is mostly untouched.There's lots of dust  flying around.", "action_results": [{"action": "search the desk area", "result": "You begin to scan the desk, there are lots of papers and receipts. You open the first drawer and find some keys.", "action_results": [{"action": "take keys", "result": "You walk over to the front door and the keys on them. They don't seem to work.", "action_results": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}