{"tree_id": "", "context": "C10", "first_story_block": "leave the store and get back in your car.", "action_results": [{"action": "You think about what the man said. How is this possible? Why were you in that hospital and what should you do now?", "result": "drive back to the hospital to see if you can find any clues. ", "action_results": [{"action": "As you pull in to the hospital parking lot the car sputters and dies. It's out of fuel an slows to a halt. ", "result": "go back to the room you woke up in.", "action_results": [{"action": "You get to the room. It's the same as how you remember it. Broken equipment everywhere. But there's also a small notebook that you didn't notice before lying on the floor. ", "result": "read the notebook.", "action_results": [{"action": "It looks like a journal. As you flip through the pages you see drawings of the death and destruction. The journal talks about someone's horrific experiences during the aftermath of the war. ", "result": "try to see if anything in it sparks your memory.", "action_results": [{"action": "you read for a while hoping this will give you some clue. None of the events written about spark anything, but you do read someone's name that you feel like you should know. \"Sarina\". It says she heard about a community called \"Bright Meadow\" that was safe and had food and was leaving to find it. ", "result": "see if you can find out where Bright Meadow is from the journal. ", "action_results": [{"action": "You look through the journal to see if there are any clues about where Bright Meadow is. You find a crude map that shows Bright Meadow to the north of a town called Clayton. ", "result": "go to Clayton.", "action_results": [{"action": "You don't know where Clayton is. But maybe if you found a map you could figure out where it is.", "result": "look for a map somewhere in the hospital. ", "action_results": [{"action": "You start looking around for a map. You find an administrator's office that you think might have one.", "result": "search the office for a map.", "action_results": [{"action": "You look through the filing cabinets for a map. You find a bunch of patient records in a filing cabinet. In the desk you find a map that shows other hospitals in the region. It says Clayton is 15 miles to the West of here. ", "result": "leave the hospital and start heading towards Clayton.", "action_results": [{"action": "As you're walking to to Clayton you start getting hungry. You remember that you have few granola bars in your pocket. ", "result": "C22", "action_results": [{"action": "check the kitchen", "result": "You go through cupboards and find a few cans of beans. You pull the them out and place them on the counter. You hear the other guy rummaging through things upstairs.", "action_results": [{"action": "check the refrigerator", "result": "You open the fridge and are greeted by a magnificent mold colony. However there are three bottles of water that can be saved.", "action_results": [{"action": "put water on the kitchen counter", "result": "As you place the water on the counter you hear a shuffle and crash from upstairs. Muffled yelling from the man you entered the house with.", "action_results": [{"action": "check on the man", "result": "You quickly head up the stairs and enter the room with the open door. You the man cradling his hand and cursing.", "action_results": [{"action": "ask him what happened", "result": "\"Was some sort of freaky looking rodent!! It bit me on my hand when I reached under the bed. I think it's still under there...\" I tell him that i'm gonna lift up the bed if he will ready his crowbar to kill it. He nods in agreement.", "action_results": [{"action": "lift the bed up", "result": "You lift up the bed and wait for him to have some reaction. You watch him crouch down and use the crowbar to hit some boxes and bags.", "action_results": [{"action": "ask him if he can see it", "result": "\"I would say something if I did\" he sasses back at you. Maybe it's in one of the boxes or bags trying to hide. You are starting to get tired holding up the bed.", "action_results": [{"action": "ask him to hurry", "result": "He scoffs at you and begins to wail the crow bar on the boxes and bags. We don't hear anything or see anything.", "action_results": [{"action": "tell him you need to place the bed back down", "result": "He pulls the boxes and bags out with the crowbar and places them to the side. He nods at you.", "action_results": [{"action": "put the bed down", "result": "You both slowly look through boxes and bags. You find a hanger and use it to poke through things.", "action_results": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}