{"tree_id": "upwork1", "context": "", "first_story_block": "The hospital seems to be completely empty. You wake up in an old rundown hospital with no memory of how you got there. You look around and see broken equipment lying around the room. ", "action_results": [{"action": "leave the hospital and see if there is anything outside.", "result": "Outside the hospital you see a worn down road and empty cars. Everything is strangely quiet and you start getting worried. You feel hungry and wonder when the last time you ate was.", "action_results": [{"action": "try to find a working car.", "result": "You find a car with the keys in the ignition and try to start it. Nothing happens. You keep looking and find another car that looks like it might work. You manage to get the engine started. ", "action_results": [{"action": "drive around looking for any people or stores that might have supplies.", "result": "You drive around the town and see many boarded up buildings, but no people. Eventually you find a store that you think might have supplies.", "action_results": [{"action": "go inside the store and see if there are any supplies.", "result": "It looks like the store has been ransacked and all the shelves are empty. You manage to find a package of granola bars and a flashlight behind the counter.", "action_results": [{"action": "eat a granola bar.", "result": "You feel a little bit better. But you're still hungry.", "action_results": [{"action": "eat another granola bar.", "result": "You feel better. You should probably save the rest of your food though.", "action_results": [{"action": "leave the store and get back in the car.", "result": "As you leave the store you notice movement out behind your car. A man steps out with a hungry look in his eyes. His clothes are in tatters and he is carrying a crowbar.", "action_results": [{"action": "run at the man and attack him.", "result": "You run forward to attack the man. His crowbar crashes into your chest and you fall to the ground. He kicks you a few times and then grabs your granola bars and runs off.", "action_results": [{"action": "go after him.", "result": "You go after him. As you try and stand up though you realize you're in extreme pain. You think one of your ribs is broken. You manage to get yourself on your feet, but realize catching him is impossible. ", "action_results": [{"action": "look for something to wrap your chest with.", "result": "You walk back into the store and find a few shirts that you tear and wrap around your chest. It helps you feel slightly better. But you're still in a lot of pain.", "action_results": []}]}]}]}]}]}]}]}]}]}]}