{"tree_id": "upwork4", "context": "", "first_story_block": "As you're walking to to Clayton you start getting hungry. You remember that you have few granola bars in your pocket. ", "action_results": [{"action": "eat a few granola bars.", "result": "You finish off the rest of your granola bars. You're full now, but are worried about what you'll eat when you get hungry again.", "action_results": [{"action": "keep walking towards Clayton.", "result": "You walk for two hours and take a break. You've left the town you were in and are now in a more rural area. There's a farmhouse to your right and a forest on your left. ", "action_results": [{"action": "go in the farmhouse and look for food.", "result": "You try to open the farmhouse front door, but it's locked. There's a broken window on the right and a shed behind the house.", "action_results": [{"action": "go through the window into the farmhouse. ", "result": "You break the rest of the glass in the window and try to carefully crawl through. You cut yourself on the edges as you're climbing in, but you make it inside. ", "action_results": [{"action": "search the farmhouse for food. ", "result": "You search around the farmhouse for food. You find some thick sturdy shirts and some rusty tools but no food. It's getting dark outside. You think it might be a good idea to sleep the night here.", "action_results": [{"action": "sleep the night in the farmhouse.", "result": "You wake up in the middle of the night sweating from a nightmare. In it you saw a woman screaming in some dark place. You feel like you need to rescue her and that you're the only one who can help her. ", "action_results": [{"action": "go back to sleep till the morning.", "result": "You try to go back to sleep, but can't shake the feelings from your dream. You decide you might as well get up and see if you can do anything productive. ", "action_results": [{"action": "look around the farmhouse for anything else useful.", "result": "You look around the farmhouse for anything else useful. You don't find anything else useful.", "action_results": [{"action": "leave the farmhouse and continue walking towards Clayton.", "result": "You get back on the road and continue your journey. After a few hours you realize how starving you are. You' really need to find a food.", "action_results": [{"action": "look around to see what's around me.", "result": "There's an old warehouse and a few mechanics shops. ", "action_results": []}]}]}]}]}]}]}]}]}]}]}