{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=31014", "context": "", "first_story_block": "You're a murderer.\n\n\nRunning head first into that place and blasting everything to hell. Raiding the detention center just to get a few kills on those who raped and pushed your crush to suicide doesn't seem like a good idea after all. You're not even her type to bother, you should just have left them rotting in jail instead. Now you got yourself rows and rows of police forces chasing after you and there is no such thing like a way back. You're brown bread to the eyes of your loved ones now, and you gotta make a run for it. Whenever you see a turn, you can only hope that it doesn't lead to a dead end.\n\n\nThat phone call should have never reached you. Crazy love, you blame all the things you've done to it. It forced you to flee your office, turned your mind into a madman and put that thing on your hand. After that, it was only chaos. You were gonna going to end your life when the flame inside died out...but didn't...and you still can't find the courage.\n\n\n\"PULL OVER!!! PULL OVER NOW!!! DO YOU HEAR ME?!! I'M GOING TO SHOOT YOU!!!\"\n\n\nThey finally talk with bullets huh? Maybe you should focus on stepping on the gas instead of having random flashbacks.", "action_results": [{"action": "Shoot them, it's self-defense!", "result": "You're not surrounded so it'll be a real pain in the ass for them to even get a clear shot on you unless you stick your head out like a sore thumb. The tires though, immediately get your fingers fondling over to the stockpile of mass bloodshed you got straight from market. Unlocking the safety, you sprayed a barricade of piercing bullets with the friendly-user Uzi towards them. You don't dare to look, too nerve-retching and you can't afford to waste your focus on the road.\n\n\n\"THEY'RE FIRING AT US!!! CALLING FOR SUPPORT!! CALLING FOR SUPPORT!! HOLD THEM UP!!!\"\n\n\nSo they think there are accomplices involved? Man, that would have been very comforting at a time like this. This stuff is the thing that you can only see on movies, not experiencing it in real life and you can't have the fortune to share it with anyone...at least you'll have everyone wanting you in custody till death after this, a nice bonus for a loner like you.\n\n\nIt looks like your firepower struck them as the deadly stuffs, they pull over and start to station in one place, aiming solely at your buggy and throwing rounds as you speed up to oblivion. You're safe...at least for now. From a runaway, you've became a wanderer. The future ain't going to got any lights for you but you'll have to bear with that, you just have to. You don't want to die. No matter how much the world spy on your fear or judge you, you will not die on this small world.\n\n\n... Looking through the door and feeling all the wonderful sensations the wind let you enjoy, you seize your mind back in its origin, a calm and successful mind.\n\n\n\"Ha...Haah hah hahh! A hahahahaHAHAHAHAHAHAHAH!\" You fake the laugh of a psychopath to let all the tears built up inside fly along, waving your brows in every fit. \"...hahaha...damn...\"\n\n\nYou had sat there, laughing exactly like this just 2 hours ago, it more likely was belonged to a maniac, the one who put a bullet through a helpless person and cracked up in awe as his lover guided him towards the next targets. Revenge is never meant to be sweet, but it sure feels great afterward! Rocking the flow of blood in your veins, you drive through the clearing, followed by rains of falling leaves marking your exit.", "action_results": [{"action": "You need a smoke after all of that first...", "result": "You are John Namour, 28 years old, a normal secretary from some wealthy company which tries so hard to maintain its image that you have to question if all of your hard works really paid off working there. It's only thanks to Laura that you could enjoy your days signing sheets.\n\n\nA real beauty, she was...she was so naive, the things she could do sometimes. The opportunity of you getting to hold a conversation with her was like the Solar System lining up straightly. 21 vs 28, you thought you'd had your chance someday, assuming you could improve yourself into a braver, better man to give her the ring. You tried your best to understand her mind, her standing, her habits...by yourself. Hell! You even bought and gave expensive jewelries to her mother and her sister. Winning your soon-to-be-lovely-wife's family is your first...and your last affection.\n\n\nYour boss just couldn't allow it, could he?  What a friendly bunch of meatdrops he had in store for young women. You knew something was wrong when you saw that fucker's smug sweep at her. Just when things could have gotten any worse, Laura hung herself in her room. The moment her mother read the first word of her suicidal note to you over the phone, you were downright demonic. Instead of assuaging her, you scared her and everyone off with your sudden loud tone, demanding a clear explanation. The rest of the writing was about you, how you've cared for her and her family. You drew your first blood afterward.\n\n\n\"...hahhhh...\" You blow a few smoke off your lungs, a burning nicotine stick between your fingers. \"Useless...doesn't do a damn thing...\"\n\n\nYou are not made to love her, you're a hot-headed psychopath and you cringe at the thought of you abusing her. Before, you were writing paper and now, those fingers nearly mark you as a dangerous crackshot, an inspirational killer to the news and an idea living target practice for weapon maniacs.\n\n\n'Now is a good time to quit.' You think, looking at the remains of the cigarette before throwing the entire pack down to the road. '...I-I can't...I don't want to die.'\n\n\nA place where you can temperately settle down for a bit and hide from the eyes of media is crucial to you. Speaking of media, you have a thought of buying a mini TV to keep an eye on your case. You can bet your life on the police shooting you on sight right now. Mass shootout at the local and getting out alive, how much luck can you have?\n\n\nOne thing for sure, a trip to another country even though it seems like a good idea, you're not sure about the possibility of you getting on one without asking for an arrest. You don't even know if it's safe to buy some breads from a mere bakery. The more you think about it, the more you realize how deep the grave you have dug for yourself.\n\n\nKilling some rapists bastards...You should never expect society to forgive them or you. What a terrible crime you've committed!...You miss your home, your family. But you can't contact them, the cops will track your location, too risky and certainly isn't worth it. They probably are cursing themselves for having raised a murderer right now.\n\n\n...Besides, you can't even call for anyone if you want anyway.", "action_results": [{"action": "Drive to another town", "result": "TV...checked.\n\n\nSunglasses...checked.\n\n\nTrench coat...Unnecessary but you couldn't just leave your skinny bones out, it has doubled your luck and your appearance to be unique...Also checked.\n\n\nGood thing your face hasn't really hit the mark of any media type out there yet, but your time is running out. Lying low will have to be in another place, a safe and secure one far away from here.\n\n\nYou check the plate covering your gas meter and see that it still got 2/3 left. You have to stock on some large litters to cross the border. The nearest place to refill would be...about 15 miles from here, not really hard to come by and if they try something funny, your guns will do the job. You decide to go there.\n\n\n...Hmm? It's nearly night time. Anytime now...\n\n\nYou have arrived at a gas station. There are only a few local houses and shops nearby, an empty place and probably not in any urban business. ", "action_results": [{"action": "Buy it legally", "result": "You carefully stopped your car in an isolated place and quickly wrap your firearms inside a bag, not forgetting to cover it with a large blanket and hide it in the corner of you before driving straight into the yard. The lights are starting to shine the area.\n\n\n\"A full refill! And I'd like to have 5 cans of fuel please.\" You speak to the one who is cleaning the equipment from your seat, a middle age man comes to you.\n\n\n\"Wow, you are a big spender, aren't you?!\" He says, opening the cover. \"May I ask where ya going?\"\n\n\n\"That..depends.\" You response, already prepared for a conversation. \"I'm heading to a friend and I heard that there are many byways so I think I'll stock some before I depart.\n\n\n\"Yeah, that's about right.\" He says, pumping your gasoline. \"You'd better step it up if rocks on the road found yer.\"\n\n\n\"Rocks on the road?\"\n\n\n\"You haven't heard?  Apparently there has been a bunch of fools riding their bikes and hijacking any car they find around these places. Drop a few prices at Black Market I bet.\"\n\n\nWhat kind of joke is this? Escaping the police chase and having a biker gang waiting for you in your next run, your life can't never be anymore playful than now.\n\n\n\"It's nearly dark too.\" The man snaps you out of your thinking. \"Maybe ya should stay the night here, it's too dangerous to travel at this hour.\"\n\n\n\"Has there been anyone dealing with this gang?\" You ask in hope for a safe route. \"Anyone at all?\"\n\n\n\"Nope. Bastards got busted a few times but another just raises and repeats like generating task. That's that then, they will never be done.\"\n\n\nWell, aren't that just the thing you need? Turn back now and the cops might not let you go again, advance and take the risk of losing four wheels may cost you your life also. You cannot afford to wait here either, the news is going to spread and letting your guard down at a time this...So much mayhem for you to take.\n\n\nChallenge the law enforcer or the nasty gang? You're in deep trouble, a really, really deep trouble.", "action_results": [{"action": "Stay the night", "result": "Tick...tick...tick...\n\n\nYou've been staring at your watch for nearly an hour and there isn't any sign of stopping. Normally you'd take a shot to calm your nerve since you deciding to enter the bar but the mood here failed to meet your taste. It's too quiet, too eerie at the time. Maybe it has something to do with the place itself as the bartender doesn't particularly enjoy any conversation with visitors just like you.\n\n\nWho designed this place? No wonder why there are so few people setting their boots here. You cannot find any positive point except for the waitress, a hot brunette who unfortunately doesn't appear to be working properly, she nearly spilled the entire claret on another customer without apologizing. Good thing kindness is still among some people these day.\n\n\n\"Oh, Laura...\" You sigh at yourself, pulling your forehead. \"Why did you have to leave?\"", "action_results": [{"action": "Get out of here", "result": "You're slowly deteriorating and you need a fresh bite to eat. Without any hesitation, you make your way towards the food stall across the street. It will take more than a cheap meal to satisfy your hunger.\n\n\n...\n\n\nHmm, the inside is not so bad, better than the shitty bar for sure. They got clean table clothes, beautiful decoration and most importantly, more people. You'd give it an above average rating if it wasn't for the space in here, a bit too narrow to move. You quickly come to the counter and order your dinner. A pancetta with fried eggs covered in hot sauce and an applepie as dessert seem like a great stomach filler for you.\n\n\nYou find a seat and make yourself comfortable as you wait for your meal. You silently hope that this wouldn't become your last time eating outside.\n\n\n\"Wah HAH!!\"\n\n\nThat sudden loud and squeaky yell from behind nearly scares you to death. How can you be so defenseless at a time like this? You turn around to see a school-grader boy who is focusing on your mini device.\n\n\n\"A mini TV! It's just like in the game!!\" Very enthusiastic and eager, he says while searching inside her bag and then shoves a small looking object to you. Upon looking, you see that it's a Nintendo DS. \"Are you a Pokemon instructor?\"\n\n\n\"...Wa-what? What the...?\" You start to sprout nonsense at the flashing screen before you as it changes to a different one with each button the boy is pressing. It's one of those Pokemon games for the DS, been selling high among youngsters and does not have any sign to stop.\n\n\n\"Mr?\"\n\n\n\"Uhh...\" You have put up with a lot of things today but for the first time, you're actually speechless at this.\n\n\n\"Pip! Pip! You found someone?\" And now it's the girl, who is also a school grader, to join the little trainer pestering around your coat. Goodness! Now you've realized that the light giving off by the portable TV inside the coat is attracting their curiosity, you have been hearing it constantly to check the news. And from what you can see from the boy's 2 screens machine, you can see what has grabbed his attention.", "action_results": [{"action": "Pokemon...sounds nice", "result": "You are not particularly into video games nowaday but it sure doesn't hurt to relax and play with them for a bit. You haven't played any of their Pokemon games but you still remember the show you were always watching as a kid.\n\n\n\"What's this game, little fellow?\" You get your glasses out and casually ask the game's name from the boy, interested.\n\n\n\"Poom!\" He spat an unnecessary but delightful slang before speaking. \"It's Pokemon FireRed! My favorite of any kind!!\"\n\n\n\"Everyday you just want to play it all the time!\" The girl adds to his statement, making a quality prospectus for this game.\n\n\nThey seem so happy when it comes to this subject, you have the thought that you might be the only person in this town who has ever spoken openly to them. Considering how empty it is, not a surprise.\n\n\n\"Do you want to see my collection?\" She says sitting down right next to you, not bothered by the fact that she's with a stranger, a creepy stranger you might add. \"Come on Pip! You too.\"\n\n\n\"So, what's all about, your collection?\" You say, eager to know about them.\n\n\n\"Hold on...Here!\" The girl put a bunch of colorful cards from that orange bag of hers on your table and continues. \"Straight from the show and the game, I got them all!\" The cards are all fully organized and you can almost see the light reflecting on the surfaces, a nice deck of Pokemon cards.\n\n\n\"It's a nice deck. May I see them?\"\n\n\n\"Please, mister!!!\" Aww! How could someone not wanting to talk with these little darlings? They're so full of life and adorable. \n\n\nHaving the owner agreement, you reach for the deck and...Wow! you can still recognize most of them! You actually feel something warm inside you when you pick one by one and tell them the name of each Pokemon, the feeling from your innocent days, the love you've had for what you enjoyed. You are still a normal human being like everyone else.\n\n\n...You've just realised something. You, a shade-wearing man cloaked in trentcoat, are catching most of the few attentions and you clearly do not want that to happen. A friendly stranger who wants to have a little chat with some random kids, that'll raise some eyes. You'd better have to act like a Pokemon maniac in this situation. Man, how you really want to have your food be right here for you, the sooner the better.\n\n\n\"Hey mister, do you collect Pokemon cards?\" The boy, Pip is what she called, asks you out of the blue while you are trying to drive yourself completely into those Pocket Monsters.\n\n\n\"No...Not right now at least.\" You mumble, not really knowing what to say.\n\n\n\"Eh?! Why not?\" Both of them speak up, they have caught you red-handed. Ok...What can you tell them? You cannot tell them that it's just for kids, that's ridiculous but hey! Maybe that will give them the sign to stop now.", "action_results": [{"action": "Tell them it's for kid", "result": "\"Young master!...And miss Jenny! What are you two doing??!\" Just when you're about to say something, a grumpy yet elegant voice comes to you across the dining place. You turn around to see a huge guy tucked in a classy black tuxedo dragging himself towards your table. \"Please stay away from that man!\" Finally, someone with common sense and willingness to act in this forsaken town...and he doesn't seem to be the type you want to mess with.\n\n\n\"Eww! Manny the Orge, what??\" The girl who now known as Jennifer nearly gives a shriek at the sight of him. \"Let's go to another room!\" Alongside with her, Pip is already fleeing.\n\n\n\"Who are you?! You didn't do anything to them, did you???\" Wow! This guy is fast, completely contradicted to his mountainous figure. And his voice has gone into a raging fit waiting to release on you. He grabs your collar and shouts directly at your face, nearly giving you a heart attack. \"You prick!!! What did you do???\"\n\n\nThen without waiting for an answer, he throws a punch at you!", "action_results": [{"action": "Block with your hands", "result": "You try your best to get your butt off the chair as quick as possible to stand but the blow is still making contact when you raise both of your palms! You manage to drive his punch to your forehead by just an inch. The force is somehow absorbed but still knock your balance.\n\n\nYour body pulls along the chair with you and you fall to the  floor with an unbearable pain and crazy tingles. Seem like you grab the table cloth with you too, flying cards are flickering around between you and the dangling light bulb on the ceiling.\n\n\nYou also hear a loud thump falling after you are on the ground...Look like your legs trip this monster down too, good thing he didn't fall on you.\n\n\n\"Manny!! What did you just do??!!\" This is your chance to get up! You only heard a little bit of the girl yelling before your legs carry you out of the diner.\n\n\n...\n\n\nWell, that went quite bad but at least it's not worse than ending up on the hospital bed.\n\n\nYou put on your shade and the earplugs on and hit the street, waiting to hear your wanted public display. After that event on the diner, you have to resort to feeding on street food. Applepies, pancakes, disgustingly sweet desserts...You'll just have to endure those if you don't want to sleep with a growling stomach.", "action_results": [{"action": "Later that night", "result": "<At 4:23 this afternoon, there was a shootout at the Police Detention Center caused by an ET employer, John Namour, 28 years old with 7 criminals, 2 security guards dead and 9 officers were heavily injured during the fire-> The mini TV says in its demonic sound, you can actually feel the devil's tongue making out with your ears passionately as you sit inside your vehicle. <He was driving brown buggy, 2D74->\n\n\nThe doom train has came and it is waiting for you. As fearless as you can get, it only takes 1 second before your head starts making up shit and panic settles in. You hitch the blanket which has been covering your weapons and throw it on top of the trunk to cover the number plate. After that, it's the car seat that will make you comfortable for the night. You lock the handle tight and lie down, making sure there is no light remain while you tune up the TV and cover your face with the trentcoat, watching your case.\n\n\nTo be alone and surrounded by silent cars and motorbikes under the darkening night, it's not a good feeling...not a good feeling at all. Good thing that the weather is nice, you could never hope to sleep inside a car like this in your hometown...Such a hot and busy place. Hiding, living on the run and evading attentions from people, what a fantastic life you've gotten yourself into! Throwing your humanity away to fade and becoming a criminal.\n\n\nOh well, shit happens. You only did the right thing. You set everything you've bought from the shops to the front seats. Mostly basic things like medical stuffs, sweet toasts and water bottles,...but right now, they are packs of gold to you. Who know how much magic that could happen in your travel? It's always better to be careful.\n\n\nYou decide to switch channel to something else, something that can cheer you up in this gloomy moment, a TV or music shows. You turn down the volume and close your eyes, trying to sleep and listening to the entertainment that tonight might provide. It doesn't take long for the snooze to hit you, you are so tired from all that running and you need the most of full sleep. You have to wake up early and leave this awful place before anyone can get a bite out of you.", "action_results": [{"action": "Midnight", "result": "Oh! something is dropping on the car. Rain? How appropriate, you really need some lullaby right now. It's kind of cool to be free and alone for once, taking up shelter by yourself and sleeping in piece. You must enjoy it while it still lasts.\n\n\n...Hmm, it has became a little cold in here. You begin to shiver as you get yourself up and look through the glasses. Everything seems to be quiet around here. Man, you would kill to have a smoke right now.\n\n\nYou suddenly think of the metal brick which has been hiding in the compartment the whole time. You head to the dashboard and hold the broken cell phone to your view. 'It has been out since the hit, what a waste...' This thing has taken 3 bullets for you and still, it refuses to die.\n\n\nBut it has to be gone now, such a tragedy...You throw the phone away, finding it unbelievable that you forgot to get rid of it earlier. No use in keeping the potential tracking device for the police.\n\n\nThe rain is falling quite heavily. That biker gang would have to be the most hard-working thugs of the Earth if they still wanted to run their business in this state. You start the engine and get out of the parking line-\n\n\nAnd the first sight that greets you after you turned on the light is a bloody cloth which looks like it is wrapping something inside too, lovely! You step on the gas and speed up like a madman, driving towards the exit of the garage. Watch out!!!\n\n\n...\n\n\nIt never turns out well for you, isn't it? Hell of bullets are unleashing directly on the street, right under this heavy rain! What is going on with this place?? You can't drive through the danger zone out there that's for sure, you can't even see clearly what's ahead. Uh oh! Bad turn!!! Someone has noticed your light and they don't waste any second to get rid of you.\n\n\n\"Get the hell out of here, shithead! OFGG!\" You shoot him dead before he could do anymore damage to your car and drive its tail back to the parking section while trading fire with the attackers who are on his side.\n\n\nYour day now has officially gone further beyond the worst. There is some serious conflict going on between these punks and they are powering their own dominance through the use of lethal firearms. You have to avoid getting nabbed in these.", "action_results": [{"action": "Break through the rear", "result": "You decide to bust through the rear entrance with your car and drive as fast as you can out of the harm way. With excellent handling reflexes, you manage to hit the road and onto the escape. To stay inside your precious vehicle over night was indeed a good choice. You blend into the rainfall and drive under the darkness...And a giant mosquito get splashed by your windshield in the process.\n\n\nPeaceful time has ended and the Dark Lord is coming to spread chaos on humanity, starting with you.\n\n\n\"What the...\" You have to yell out word of confusion at the brownish liquid remained on your sight before attempting to wash it away. It's just then, you notice something is scratching on the top of your car. You are surrounded!!! It doesn't take long for them to show their abomination form to you, gigantic mutated bloodsuckers. Why so many of them???\n\n\nJust when things can't get any more cute, your car now is totally decorated in black and you hit straight to a tree, breaking your cheap windshield and allowing several tubes of death inside to harass your veins.\n\n\nY.O.U  F.A.I.L\n\n\n\"What has killed them?\" You, now have became a spooky skeleton, fold your bones into the Thinker pose and sit on the pile of dead mosquitoes. \"Hmmm...They looked completely zoned out around me, like they were possessed by something.\"", "action_results": []}, {"action": "Wait until it's clear", "result": "A Shotgun, an Uzi and a mere shitty handgun are the only things capable of fending them off you have and you don't want to waste them. The stupidest thing is that you don't have a freaking clue on how to reload the Uzi and the Shotgun so you just bought them off without any ammo...It's gonna go to shit if you have to resort to them. Weapons of mass destruction at its finest state right here, what a load of shit your head must have been. On the bright side, you got yourself a huge piles of clips for the pistol so at least you won't have to worry about running out of option in a gunfire...which is happening right now.\n\n\n\"Kill him!\"\n\n\nIt's not a good idea to stay in one place. You quickly get out of your car and crawl to another with bullets flying directly above your head and drilling noises of them to your side. It's a total death zone out there and you can only hope that they didn't intend on flaring the place up. Peaking from the bottom park of a brown car, your eyes set on their sexy legs and with them flapping around, you can easily mark your route to avoid any crossfire coming for you.\n\n\nYou begin to wait...\n\n\n...\n\n\n...\n\n\nToo far away or has it ended? You realise that you have been backing yourself to the corner, isolated from any opening fire. They don't aim at you anymore. No sounds of yelling or projectiles ejecting can be heard anymore, just your breath and the drop of rain water.\n\n\nWith caution, you slowly move to the front and the sight before you is...quite a gory piece to add to your nightmare. The rain has created a stream of red blood along with guts and organs. You can almost see a healthy beating heart flowing by. It's too dark to make out anything else so you can't be too sure about this but...Is that a pair of cockroach's legs that is stuck inside someone's neck? And it's moving, slightly but it's still making a scene of itself.", "action_results": [{"action": "Investigate", "result": "You find it unbelievable that even in this scenario, you can still find excitement over something like this. What can you say? Danger is scary yet so alluring at the same time.\n\n\nYou carefully step over to the scene with a gun in hands, never manage hold it properly but still. Let's see here...The thing is jerking in and out the neck of the corpse as if it was trying to get itself out of the meatload. You can safely assume that it is stuck and there is nothing around resembling it.", "action_results": [{"action": "Shoot it", "result": "\"A mosquito, what the hell??!\" You burst a drop of water aside while taking aim at the abomination before you. A big black winged creature with a redish tumor sticking out of its groin area, it's a giant mosquito! Is this some kind of illusion trick your brain is playing with you? The thing is sucking his blood through its tube and thanks to your welcoming speech, it has now been aware of another human being, you.\n\n\nYou blast it open instantly with your pistol, not a really threatening creature to be scared of. It's screaming in pain and that hellish reaction just want you to end it. Oops, overshot!! Now it's just a big giant mess dripping yellow liquid to the bloody stream. You can't make out any of its original shape anymore.\n\n\nYou stare blankly at a random corpse before you as the rain starts beating it harder. He was so twisted and dried up that you almost consider it is a thick rag that you're seeing if it weren't for the clothes and the hair.\n\n\nSomething has seriously gone wrong...You suddenly remember the bloody cloth that was right under your car before this madness started and the mere thought of it overflows your mind. You-you have to get out of here as fast as possible! Every wrong decision right now might turn out to be your last.", "action_results": [{"action": "Go check it out", "result": "You decide to go back into that place to check it out yourself. It's no use standing in the rain and you have this weird hunch that something would go horribly wrong if you escaped. But it's mostly curiosity that guide your legs to find the thing which had scared you nearly to death.\n\n\nYou unreval the fabric mess to reveal a badly beaten up human being that you cannot recognise anymore, just a few drops of dried blood and ichor remained on the body, probably having been put under your vehicle before it started raining. A victim of those monster too? You put away your shade to have a clear look at the corpse.\n\n\nDamn! The smell is messed up, you have to keep a distance from it to stand the stench. From what you can tell. This one had pretty much been clubbed to death before those things slurped their fluid. So aside from the risk of those violent thugs and the police, you got yourself a nice threat from obscenity of hell too. Why he or she was beaten to death before they got fed to those, that you don't know. What you do know is, this terror will soon end your life if you don't get out of here.\n\n\n'Is there more?' You start to wonder. 'I can't be alone in this.' Before long, you find another poor soul being stuffed under another vehicle, this one...has undergone some heavy decaying and yet strangely clean at the same time. From what you can tell, the corpse was reserved pretty well and no one would have any trouble identifying the owner.\n\n\nThere is one another thing that now you have noticed .There are a large rows of motorcycles parking in here. You didn't recall seeing that many when you were hiding in the car. And they have those crazy marks and decoratings that make no sense, almost look like one of the symbol you usually came across in a bar or something.\n\n\n 'Rock on the road?...Nah, a biker gang can not be this polite.' You quickly discard the thought of them storming this place. 'Unless the roads were blocked, they would never do something like this...Or could this awful place be their hideout and I've been fooled the whole time???'\n\n\nYou take a quick look at the parking lot under the rainy night. !!! You should have realised this sooner, this area has been nearly surrounded by cruisers and baggers, those types that you never want to ride on. That's it! You don't care if it's even true or not, you're getting out of here!\n\n\n\"Helllpppp mmee!!! Help!!\"\n\n\nJust when you're about to start the engine, a mixed screams of both men and women get through the glasses and into your hearing. With this heavy drop of rain water, it must have taken a lot of people to pull that off.", "action_results": [null, {"action": "Save them", "result": "\"Goddamn it! Those stupid fools!\" You spat a curse of filth before loading your pistol. Why your hands are disobeying your mind, you don't even care anymore.\n\n\nYou run through the main entrance over the dead bodies into the street and head for the scream. Immediately, you spot a group of people being bombarded with dozens of mutated mosquito larvaes onto their bodies as some unfortunate ones fall down to their deathes only to be step on by another. Wow! You never expect this small town to have this many people living here...It seems like they are going to head for the parking lot and they sure will be very happy to have one car available for them right now. A middle aged man stops in his track when he sees your vehicle and run towards you.\n\n\nHey! It's that nice mister who filled up your gas...He is not going to steal your car, is he?", "action_results": [{"action": "Ask him what is happening", "result": "Been a little while off the danger and you now have doomed yourself. With one swift motion, he grabs you by the collar by surprise and throws you out of your seat before driving away.\n\n\nUntil your life is over, you will never give up!!!...Had it not been for the sticky germs invading your body and slowly turning you to a lifeless carcass for the mosquitoes to devour completely. You can not have a comfier death, safe for the environment and all.\n\n\nY.O.U  F.A.I.L\n\n\nYou're exhausted, let's rest for a bit. Fold your arms and sleep peacefully in memories...until next time.", "action_results": []}, {"action": "Shoot him", "result": "You draw your pistol and shoot him through the side door square in the chest. The ACP bullet pierces his ribs and kills him in one goes, not in a violent manner but still very effective. Now that has been taken cared of, let's save them!\n\n\nOh no! Just when you are about to get back inside, a tube from above ruthlessly impales your nape, a direct hit that has missed your vital part...but prolonging your suffering while the blood of a killer is drained.\n\n\nY.O.U  F.A.I.L\n\n\n\"Aggg..eeeerrr......\" Your mouth weeps out wet saliva as you try to savor your last breath in torturing pain. \"Fuc...Fuck you!!\" You politely spat to the face of death. You hold up your aim and blow it to pieces, saving yourself with the last effort.\n\n\nSuddenly you no longer feel the pain as your nerves begin to grow numb and the gun slips out from your grip. Your veins are totally dried out and your heartbeat has ceased its pace.\n\n\nPretty sure you are already a dead man by the time it sticked that thing inside you. Just stay dead next time.", "action_results": []}, {"action": "Run him over", "result": "With your expert driving, you have no trouble ramming right in his junk and make him do a double frontflip before smashing his head nicely. Your action sends a clear message to the others that you are not in any mood for foulplay. Now that has been taken cared of, let's save them!\n\n\n...Wait, there is nothing to save here besides your own shell! It is an outbreak of monsters and you can't possibly think of fighting them alone. It's lucky that there are fresh living human for them to feed on...Shit! What are you thinking? You have to crack your brain open at time like this. Come on! All those years sitting behind desk can't be for nothing. ", "action_results": [{"action": "Shoot all of them down", "result": "Just when you are about give them your blessing, a tube from above ruthlessly impales your nape, a direct hit that kills you immediately.\n\n\nY.O.U  F.A.I.L\n\n\nRemember, this is man vs monster, you can't put normal method into this.", "action_results": []}, {"action": "Turn on the gas", "result": "You speed up your car and manage to drive them away from the people for a little bit, allowing some of them to get to the parking lot. You are not a good driver but when it comes to make crazy curves or stunts on the road, you are unbeatable...in driving school at least. Each time joiting the wheel, you try as best as you can along with the brake to emit diesel exhaust, immobilize their flights. And when they are in your sight, you tear their beauty apart.\n\n\nIt's all fine and dandy before they decide to gang up on you and tear your limbs apart one by one.\n\n\nY.O.U  F.A.I.L\n\n\n\"Damn it! What kind of monster are these??!\" Roaring in anger and pain, you burst the last one down with your remaining arm before slumbering to defeat. \"...They seem to be more violent than before...and stronger too. Howw--\" Your luscious lips get impaled right after that.", "action_results": []}, {"action": "Call the cops", "result": "...\n\n\n...\n\n\n...\n\n\nY.O.U  F.A.I.L\n\n\nAre you hitting the bongs right now? You just threw your phone away not too long ago.\n\n\n\"Consider that someone got a working cell phone.\" You talk to yourself in shame. \"They might have called the cops already. Woohoo...haha, the sky above is so dark. Maybe I should have stayed at the start.\"", "action_results": [null, null]}]}]}, {"action": "Hide in the shadow", "result": "Under the moonless night, you step into the shadow and become one with them as you try to ignore the shriek, the plea for help and the suffering of your kind. With each breath you take, a person's life goes away...Like the fallen leaf flying off the ground to seek their demise, and you are their only observer. Or...to put it more simply, you are playing hide-and-seek with sudden death. There is no gunshot in your range, it must be the mosquitoes that are looking for their idea victims.\n\n\nYou can hear, you can feel that they are out here massacring everyone without any remorse. If you escaped just now, you would be chased to the end of your life, bad case! Going into withdrawth is the best plan you can put up with right now.\n\n\n\"Help!\"\n\n\n\"No!!!\"\n\n\n\"Aggggghhhhhh!!!\"\n\n\nSo far, no mosquitoes. You check the clip of your firearm...Good.\n\n\n\"Kiiiillll....itt!\"\n\n\n\"NNNOOOO!!!!\"\n\n\nYou slam it into the slot and slightly pull the slide towards you...letting it create the satisfying sound of a bullet readied to fire before adjusting it back. \"Hnnnn...This is not good, not good at all!\" Mumbling in fear, you clutch the pistol tighter and aim it toward the noise of someone placing their shoes on the dried ground.\n\n\n\"Let's get out of here, come on!!\" A man yelled to another figure smaller than him, opening one of the car panel. \"Get in there!\"\n\n\nLook like someone got over it, hopefully more and more could be as lucky as this guy. You watch as the LED lights start to illuminate before he drives away through the rear entrance.\n\n\nAnd after a few seconds, more people have come to claim their escapes. You feel somewhat relieved by this. Maybe the things aren't as bad as you have made it up to be.\n\n\n\"OOgggg GHHooooo!!!\" You cough your lungs out at the scent of diesel exhaust filling this parking lot. \"Grrrr....\" 5 or 6 vehicles have ran away in peace, it's time you join them!", "action_results": [null, {"action": "Wait for a little more", "result": "'3 more and I'll go.' You think without letting your eyes off your surroundings. 'Why have they followed them here yet?' With these people, you thought they'd driven more of them in here.\n\n\nAnd then...A surprising turn of event quickly comes into place. When one of the cars is letting its steam out, 4 mutated bloodsuckers from the outside suddenly fly towards it and process to beat the cover with all they got. They are going nuts!\n\n\n\"AAAHHHHH!!!! Someone! Someone help!!\"\n\n\n\"Just get away you moron!\" You roar at their idling before banging every single one of them. You put them down with your blaster in an instance. \"Go!\"\n\n\nWithout any comeback, they speed up and into the safe distance they go. You quickly run back behind your buggy and look for any open attack from the outside.\n\n\n\"AHH! Get away! Get away from me!!\"\n\n\n\"Oh SHIT!!\"\n\n\n\"What the...\" It doesn't take you long to see that something has gone wrong with those monster's activities. This place is filled with diesel exhaust and that stuff can wipe away any insect or any bug which dare to come close. However, that doesn't apply for these giant bastards, you have to get out of here before an army of them coming right at you!", "action_results": [null, {"action": "Run bitch, RUN!", "result": "You run away from the black forest that is growing rapidly into where the smoke has spreaded and left a trace for them to follow and chase after their fat preys, leaving the most nutritious meal that is you. That is just ridiculous! Vehicle exhausted steam is now the next best thing to pure liquidized blood for them at this time?...Great idea, you don't know how someone could get away from that. Had it not been for your incredible luck, you would have ended up on the street, dried up to the feet.\n\n\nSince they are tracking targets with that method, escaping by vehicle is impossible. You have to either get rid of them or find something fast enough to outrun those fast farts which you highly doubt that you can find in here.\n\n\nThe quiet silence of the night and the amusing rhyme of raindrops, so lovely and eerie...You didn't seem to mind the rain beating down on you as you step on the redish streams scattering around the way to the town. Everything is messed up beyond believe, anything can happen to you and anything can even put you back to the beginning. You have to bring yourself forward, and that is to find the cause of this madness and destroy it!...And try to make sense in the process if you could.\n\n\nOn the edge of your confusion, you find yourself alone outside one of the residential houses, a place that away from the danger that is lurking from the outer road. You took a look at the drained lifeless body lying on the side of the road before going in.", "action_results": [{"action": "Search for supply", "result": "You locked every entrance and helped yourself with a glass of water before searching for anything handy that you can use. This house is pretty neat and pretty to look at, such a shame that the owners are so unfortunate. Aside from some fried chicken legs for you to chew in the fridge, there is nothing useful in here. Seem like the bikers got them pretty rough these days.", "action_results": [{"action": "Call your enemy aka the cops", "result": "Suicidal idea but what else can you count out besides the police force to deal with this shit. You head to the telephone on the wall.\n\n\n... ... ... ... ... ... ... ... ...Hmm ASMR... ... ...Beautiful... ... ... ... ... ... ... ...\n\n\nThe dial line has been cut...No! Someone is causing a wave interference around these parts.\n\n\nYou put the phone back into its place, considering every possible worst thing that could happen.", "action_results": [null]}, {"action": "Get outside", "result": "'But where to go?...' You begin to weigh that option as you find no reasons to do so. 'Unless I found some way to avoid those creatures, it'd be better if I wait for the morning to come.'", "action_results": [null]}, {"action": "Go to the 2nd floor", "result": "You get into the 2nd floor. 3 bedrooms and a restroom can be seen along the hallway, with a refreshing wind flowing over the curtain from the balcony to your right which you immediately seal the door leading to it. Outside, the rain is still falling. You can smell the mud sweeping up here. There is nothing occupying the roads.\n\n\nNothing out of place except for the opened doors and the aroma of dried blood. Thanks to the lightning, you can still make out what situation you have gotten into. Anxiety starts to form and dwell as you unwittingly take a step back at the sight of the dark hallway.\n\n\n2 doors at the left side and 1 on the right, the one stinks the most is the right one.", "action_results": [{"action": "Check the left side", "result": "Which one?", "action_results": [{"action": "The 1st", "result": "An ordinary bedroom with everything a person need after a hard day, a female to be exact. The bed is messed up but the cushion and the blanket suggest that she has just gotten out of bed. Judging by the state, you can see that she was woken up very suddenly in the middle of the night, by the mosquito or the gunfire?", "action_results": [null]}, {"action": "The 2nd", "result": "A classic bedchamber for the gentleman. The bed is a giant mess, the cushion and the blanket are thrown aside and still have a warm heat to them. Judging by the state, you can see that he has just been woken up very suddenly in the middle of the night, by the mosquitoes or the gunfire?", "action_results": [null]}]}, {"action": "Check the right side", "result": "Broken windows allowing the drizzle to come in, 2 beaten up adults and a headless child in the center of the place. A collection of stuffed toys and elementary books scattered everywhere along with plashes of gore. Down in the arms of the woman is a tiny head with no eyeballs remained in his sockets, the neck was twisted off his body, revealing a violent method of decapitation. All of them has been sucked droughtly, embracing each others with their limbs separated from the bodies.\n\n\n\"Dear...god!\" You blurt out, looking the room throughly. \"The windows is broken to pieces...Took one family down and flied off without a scratch, these fucking things.\"\n\n\nNever engage those mosquitoes with bare hands, they love blood and anything that release CO2, including high toxic...and one can become extremely aggressive and daunting when in the range of their preys.\n\n\n'Their son was the first one to go...poor kid.' Looking at the kid's head with digust, your lament for the family. It was too brutal. 'They went through here and tore everything apart like it was nothing...This view leads to the center of the main road. They appeared in this town?'\n\n\nThen out in the corner of your eyes, you see a shadow across the street inside the house in front of you by the windows' glass. Look like someone got off this time. Well, since this windows is broken, you wonder if they are still inside. To put it simply, you won't be enjoying yourself in this place if you don't do something.", "action_results": [{"action": "Set up a barrage and stay until morning", "result": "It's too much of a risk to let yourself expose to the eyes of those reapers, you have decided to stay in here until the morning. You broke all the left over glasses and started to fill that space with hard and thick blankets from the other rooms before flip the bunk bed over and block it, adding a bookshelf for good measure.\n\n\nIt's nearly 1 AM. The rain is still going strong, washing, laving the poor unfortunate souls off the ground. Sometimes you can hear the cry of another one being feed on and getting shot to death. Your heart is calling you...yet you refuse to hear it.\n\n\n*KNOCK*   *KNOCK*   *KNOCK*\n\n\n\"Help me please!!!\" A girl has been pounding on your front door while crying in agony. \"Help! Aggggggrrre!!! Aggg!!\"\n\n\n...You don't need anyone, it's only your life that they are after. You have to endure it.\n\n\n...\n\n\nIt doesn't take long for the entrance to be bombarded with blows and shotgun shells.", "action_results": [{"action": "Hide!!!", "result": "...\n\n\nA mosquito blows you and you cry in pain as you become the laughing stock of those masked wearing men who has been having fun searching for you.\n\n\nY.O.U  F.A.I.L\n\n\n'It's no use to hide when those monsters are in range. Next time, I'll have to break my way out!' You think. 'Although I doubt that I have made the right decision when I decided to stay here.'", "action_results": []}, {"action": "Defend yourself", "result": "You aim at the door while staying behind a couch, waiting for them to be visible to your watchful eyes. It was a mistake that they didn't torch this place down, you'll make them pay.\n\n\nYou stand up when you hear the door broken down and blow a few heads off before rolling into another couch, avoiding the shotgun blast sweeping over.\n\n\n\"Motherfucker!!!\"\n\n\n\"Aggg!!\" Reloading... \"Uggg!!!\"\n\n\nYou peek over from the kitchen counter and process to fire a round of ACP, killing those masked wearing men without any difficulties. Just when you're changing clips, those mosquitoes start to fill up the small space in the room, forcing you to keep a distance while making those targets...become your death.\n\n\nY.O.U  F.A.I.L\n\n\n'I can't fight like this.' Your thought fades away. '...Not in this house. I need a bigger place to move freely.'", "action_results": []}]}, {"action": "Call them", "result": "\"Hey!! Anyone in here? Answer me!\"\n\n\n...No answers. They must be ignoring you, unless they are deaf. With a distance this short, you doubt that they wouldn't be able to hear it. Good lord...You have to drag yourself outside again?", "action_results": [{"action": "Get to the other house", "result": "Crazy or not, you don't care! You just want to have someone to talk to right now, damn it!\n\n\n\"Locked...figured. Open the door!!!...\" You knock as hard as you could and still there is no sign of them being inside to help you. It must have been your imagination. You heave out a tired sigh, running back into your place before the mosquitoes could get to you. \"Shit! Gotta block that windows somehow.\"\n\n\nYou went back to the 2nd floor and started to fill that space with hard and thick blankets from the other rooms before flip the bunk bed over and block it, adding a bookshelf for good measure.\n\n\nYou don't know why you didn't do this sooner. It's just your forgetful mind or...is it company that you are longing in this dire situation? In the time of danger, loneliness has had such a deep impact on you.\n\n\n*Knock*   *knock*   *knock*\n\n\n\"Help me please!!!\" Someone is performing fury attack on the poor front door while yelling like they were being stabbed. \"Help! Help! Whoa wow whoa!!!\" Then process to raise up his arms at you pointing your gun at him.\n\n\n\"Shut up and keep that stance.\" You order him with a stern tone, forcing him to do so without any comeback. A good fellow is what you need to get through this nightmare. \"Get in!\" You open the door for him to rush inside and then slam it close so fast that he trip over to the floor and give it a bloody tooth...Yeah, he seems harmless enough.\n\n\n\"Stay still on the ground, will you? And hands on your head, now!\"\n\n\n\"Thanks...Thanks man, I own you one.\" He utters a painful snort and thanks you despite the situation he is in. \"Holy shit, nearly lost my life out there...Oww fucking hell! I'll do it, don't hit me!\" And with gun on his head, you begin to search him and his bag for any dangerous tool...and find nothing aside from bug repellants. You'd kill him if he was some kind of punk who tried to shoot you back there.\n\n\n...\n\n\nMathew Meslia, an out-of-luck ranger who happened to stumble into Weeve town and got his life spared by the mosquitoes thanks to some poor souls before running away as well.", "action_results": [{"action": "Talking time", "result": "\"So are you from here, James?\" He asks, addressing to the skinny guy who isn't on a wanted list, James Kendley.\n\n\n\"Just happened to be stuck like you, same case. Got this pistol from one corpse out there.\" You respond. \"How the hell did you manage to stay alive until now?\"\n\n\n\"Uhh...Staying in the background and this too.\" He pulls out a spraying can. Upon looking, you can see it is a bug repellant. \"First thing to pick up in the store. Sorry man, I must be reek of the smell.\"\n\n\n\"Take that raincoat off then I might smell it. Relax...\"\n\n\n\"Oh...\"", "action_results": [{"action": "Ask about the mosquito activities", "result": "\"I actually don't know too much about this except the fact that they love CO2 and a type of acid contained in our sweat. But it's for certain that those creatures still have some traits of their origin left. God knows who did this to them...One thing for sure though, they're most active at dawn and dusk so I would be leaving in the early morning if I were you.\"\n\n\nWell, now it's your turn to inform him about what has happened in here.\n\n\n\"My...god! That's horrible!\" His drink has gone cold in his hand since hearing you fill him in about the incident on the 2nd floor. \"Never thought about mosquitoes that way but...holy fuck that is just so messed up!!\"\n\n\n\"Want to take a look?\"\n\n\n\"...No thanks, I'm not crazy.\" He put the can of juice down, not bothering to drink anymore. \"So what is your take on this? What are we going to do now?\"", "action_results": [{"action": "Seek a way to fight back", "result": "\"No way man!\" He nearly snaps at your idea. \"I'm not going out there again!\"\n\n\n\"Yeah...I kind of going crazy there for moment.\" You calmly take a breather. \"It's a bad idea to go out in this rain...Damn, I wish we could at least do something. Aside from the mosquitoes, we still got some crazy fuck to watch out for. And in the morning, they'd blast us to hell.\"\n\n\n\"...You don't suppose. We can't run?\" He freaks out at the sight of you pulling out a gun after getting hopeless for a second. \"Whoa there!!! What are you doing?\"\n\n\n\"No need to pretend that we never have a chance anymore, mate.\" You say. \"Washing the dread away is pretty much what we have been doing until now, is it not? You got your sprayers and I got this baby.\"\n\n\n\"But...\" He stops at that word. \"Never mind. So, any suggestion?\"", "action_results": [{"action": "Stay here until the morning comes", "result": "\"Mathew, you've been giggling like a school girl for nearly an hour now. What of it?\" You ask. To sit on the couch and hear this guy rustling to himself in front of your face while knowing nothing outside is not really a good idea, it's making you feel bad and making you just want to go out and give them a piece of your mind.\n\n\n\"Eh...Well. I guess it's no harm telling you.\" He shrugs, shaking his phone lightly. \"My girlfriend sent me a bunch of mails last night and I haven't yet to read all of them. It's bad enough that I got into this mess and now I'm making her worry. Goddamn it! Those fucking insects must have been playing with the line.\" Poor guy, getting a tantrum fit over a list of love mails. Kind of similar but not   nearly as hardcore as you. Oh! How much you wish for the sun to come up quickly, you cannot deal with this. Although in this rain you doubt it would happen, damn thing hasn't stopped since shit hit the fan.\n\n\nLet's take a moment to recap before you lose your cool. First thing first is the corpses' appearance in the parking lot. Secondly, the shootout. Third is the dead family. And finally, you got this lover boy here whose communication is cut away from his sweetheart.\n\n\n\"Hey, Mathew!\" You call, getting his eyes towards you. \"Since we'll be stucking here for a while. Why not discuss this over? There are so many weird things happened here and I think it'd be better if we could somehow make sense of this.\"\n\n\nHe stares at you for a moment as if you were talking nonsense but immediately understand your idea and quickly follow along. \"Hmm, you have a point. Although I'm not sure if I would be much help to you.\"\n\n\n\"Let's hear your story again, shall we?\"", "action_results": [{"action": "Let's find an answer!", "result": "\"I was driving from Prostye to Prime CK to visit my professor when the night came and I decided to book a bed in the inn near here. At around midnight, people suddenly started going nuts and I woke up seeing a giant mosquito flying by the windows. Nearly lost my shit there but...damn.\"\n\n\n\"So in other words, they caught you by surprise and it's the sprayer that has kept them away?\"\n\n\n\"Pretty much it. After that thing broke into the inn, I had to run for my life, not only from them but those crazy son of a bitch out there shooting left and right too! Has this place gone crazy???\"\n\n\n\"...I think I have the answer to those question.\" You say, tilting your head to the side. \"Unlike you, I slept in my car last night.\"\n\n\n\"Huh?\"\n\n\n\"I'm in a hurry to meet a friend and I wanted to get going as soon as possible. Besides, it's quite comfortable I tell you.\"\n\n\n\"Oh okay. Where are you going?\"\n\n\n\"Sun 3.\"\n\n\n\"That's like an entire day driving. It must have sucked for you.\"\n\n\n\"Never mind that. In the middle of my sleep, a gun fight broke out near the parking lot and I had to bail. Have you ever heard of the gang Rock on the road before?\"\n\n\n\"No.\"\n\n\n\"Let's just say they're the trouble makers around here and I had a hunch that they had this town surrounded so I decided not to stick my neck out to them. After a while, they got near into the parking lot so I had to crawl under my car.\" You lie with a straight face. As long as he gets the idea, you could be careless. \"And that when I saw it, a corpse lying under a cheap Chevy Aveo.\"\n\n\n\"A corpse under someone's car?\"\n\n\n\"Yeah, beaten up pretty badly too.\" You decide to leave out the wrapping part as you don't want him to question your insanity. \"And combining to what I have found, I got myself an idea of what is happening here.\"\n\n\n\"Really?\" Mathew becomes a lot less tense when he hears that. He quickly jumps to the question without asking about how you managed to survive that gun fight. \"So you know why there are corpses there?\"", "action_results": [{"action": "Someone was used as an experiment", "result": "\"The bodies in the parking lot and in this house have one thing in common, being beaten up to death before becoming mosquitoes' livestocks.\"\n\n\n\"...Yeah\"\n\n\n\"This house didn't appear to be locked when I got here, quite strange for a couple who was going to bed. Chance of someone breaking in is there and there are 3 bodies for them to hide.\" You start to explain it to him. \"I'm not sure about mutated mosquitoes being able to carry someone but there would be a huge risk of someone seeing the flight so it's unlikely for them if they don't want to be found out. Since seeing that they can beat people up to a pulp with legs and wings, they might be the culprits who commited the murders and it was left to some sick fuck human beings to do the cleaning.\"\n\n\n\"...So someone is behind this?\"\n\n\n\"No one would ever go through this much trouble if they wanted to kill a person by themselves. It might have been an experiment.\"", "action_results": [{"action": "Onto the next subject", "result": "\"But...why there though? I mean, they could have picked a more secured place instead of a full on sight one like that.\"\n\n\n\"...Nice thinking. But the fact that they decided to leave the bodies out of plain sight by hiding it under the vehicles still remains.\"", "action_results": [{"action": "It's near the dropoff", "result": "\"Pretty self-explanatory. With a simple truck, it would be a piece of cake to dispose them to somewhere else...Although I didn't remember anything like that back there. So far I have seen 2 victims, there might be more at the scene. I wonder how they were gonna explain about the disappearance of the resident.\" You say.\n\n\n\"Yeah. Somehow I can think of something like that happening right under everyone's nose.\"", "action_results": [{"action": "Continue to the next", "result": "\"The family...\" Trying to get over the gory thought, he mumbles loud enough for you to hear. \"Do you have any idea why they were killed?\" ", "action_results": [{"action": "They were near the parking lot?", "result": "'Choosing the nearest targets. Is this the first time they began to use this killing method?' You recall back to the broken windows. 'No, that can't be it. The family's death must have happened after the mass release. They would never break the glasses in a 2nd floor in the middle of the night from outside unless they wanted to show off their favorite bloodsucking pet...Shit!' You curse in your mind as you realise your mistake. 'That contradicts the theory of this house being trespassed. I'm missing something here. What can it be?'", "action_results": [{"action": "Go back to the scene", "result": "\"Ehh! Where are you going?\"\n\n\n\"Checking the crime scene one more time to be sure.\" You plainly say, it's no use getting him to come with you. \"Watch the front door. I'll be right back.\"\n\n\n\"...O-kay?\"", "action_results": [{"action": "Check the boy's room", "result": "Few, very few glasses shards found inside the room. The windows was forced opened from the inside, not the other way around. Your brows grows wider as you look at the corpse of the father.\n\n\n\"Taking it out with bare hands. Now I know why.\" This must have been what has hit the alarm and blew the secret skyhigh. They underestimated the strength of a human and now they live to pay the price.\n\n\nIt's possible that these were killed because of their locations. The view outside looking from the windows is now unrelated to the main subject. The mosquito for some unknown reason managed to get inside the house with no disruption to the environment, suggesting that their owners pretty much had tamed them and had full control over their action.", "action_results": [{"action": "Some questions answered", "result": "This town has been picked as a testing place for a new man killer created by someone who is also responsible for clearing any evidence remained due to an error. And there is a group of them outside to search for survivors due to the gunshot you sometimes caught on.\n\n\nThe mosquitoes are most dangerous in the time between dawn and dusk so going outside unequipped now equals suicide. This type got a new special method is to detect man-made vehicles. It's entirely possible for human to manipulate them to their will. Scared of regular mosquito repellant...and something else. When in range of preys, it's hard to imagine what they are capable of.\n\n\nAll communicating connection has been interfered, no hope of getting help from anyone.\n\n\n...There are still many things you don't know but it is pretty clear that the threat you're facing isn't going to fade away by itself. You have to do something about it.", "action_results": [{"action": "Tell Mathew about what you have gathered", "result": "\"This...sucks major ball.\" One comment from your only companion doesn't seem to have much spirit in it, he is desolating himself in thoughts. \"To think someone is behind all of those deaths, playing with us like toys. It's driving me fucking nuts!\"\n\n\nAfter getting your thought sorted out, you stand idly staring at the front door with mixed feelings. It's time to make a plan to overcome this fear and get out of here alive.", "action_results": [{"action": "Calm him down", "result": "You and Mathew spend your sweet time sitting by the couch, checking each others' signs of movement. Now you have taken a good chunk of time looking at him, you feel that the hunch which has been rising in your mind is true.\n\n\n\"Mathew.\"\n\n\n\"Yeah, what is it?\"\n\n\n\"Are you a girl?\" With the bluntest way possible, you speak your mind. \"Excuse me if I'm wrong.\"\n\n\n\"...\" He looks at you like, dumbstrucked, then opens his mouth to curve up a light smirk. \"You're the first one to see that.\"\n\n\nThat statement makes you feel somewhat confused. Sure she looks exactly like a teenager boy but it's not like it's difficult to tell her apart from a group of men.\n\n\n\"Hell yeah dude! You were right all along, took long enough to figure that out.\"\n\n\n\"...Then why did you tell me that you were looking at your girlfriend's mails earlier?\" You ask. \"Or is it just something that I'm missing?\"\n\n\n\"One of my friends.\" She looks away from you to the side, saying. \"She is my roomate at my dorm...Man, I talk with her like there was no tomorrow. Poor girl nearly fell asleep. \"\n\n\n\"So...girlfriend?\"\n\n\n\"Dude, you don't get out much, do you?\" She cracks up at your clueless face. \"We don't have anything resembling that in the slightest. It's just a normal way to call my friends, kay?\"\n\n\n\"...I see.\"\n\n\n\"You know? I have always been told that I lack every woman quality and I kinda see that is right. Since entering nursing school, I'm the hot stuff of the girls there so many people mistook me for a guy.\"\n\n\n\"Nursing school? I thought you were a ranger?\"\n\n\n\"Still in school learning the rope...I kind of lie about being a full on ranger...cuz I thought you might do...might do something.\"\n\n\n\"What and why would I do that?\"\n\n\n\"I-it's just...I have a feeling, okay? You pushed me onto the floor and threatened to kill me, I don't know what is it anymore!\"\n\n\n\"...Then why are you telling me about it now?\"\n\n\n\"Hmm...Uhh..\" She looks flushed when your eyes are tracing over her. \"You seem like an okay guy and...it's not like I can hide anything from you anymore.\"\n\n\n\"...\"\n\n\n\"Why are you looking at me like that?\" She curls up at your sight, uttering a cute sound. \"Oh right! How did you know I'm a girl?\"", "action_results": [{"action": "By looking at her", "result": "\"Really?\" She asks in disbelief. \"What did you see?\"\n\n\n\"Your hip is a free giveaway. And your unusual high pitched tone.\" You answer her with little effort. \"You tend to look higher up and I see no recognizable sights of a laryngeal lump so you were either a under developing boy or a girl. You seem to avoid eye contact or strike a conversation with me as a normal man, you act like someone you aren't so I have been keeping watch on you. Eventually everything points to you to be a girl. I just want to make sure.\"\n\n\n\"Wow, James!\" She gasps in awe, although she doesn't seem to like the fact that she has been being stared at. \"Is it that difficult?\"\n\n\n\"Not really. I had my doubt when I first saw you. You have like the most girly face around here, all I have seen is a bunch of...\"\n\n\n\"Huh?\"\n\n\nYou suddenly remember about the Pokekids and their bear. Damn it! People deaths you can bear but children? You feel anger boiling up inside you. Is it the rage of humanity that you're experiencing?\n\n\n\"James?\"\n\n\n\"...I'm okay.\"", "action_results": [{"action": "Continue the talking", "result": "To have someone to talk to, especially a cute girl now that you have acknowledged it. The talk seems like taking forever but you feel somewhat heartwarming and excited about her personality. Look at you! Laura would murder your grin right now, what a man you are!\n\n\nWell, it has been a bad day for you. And the noises of breaking applied to the poor front door are here to make it worse.\n\n\n\"Hide somewhere upstair!\" You shout, seeing no point to hide from those monstrous insects. \"I'll hold them off!\"\n\n\n\"How could I do something like that!!\" She yells at your face, tugging your coat with a handknife in her hand. \"I can use a knife! Let me at em!\" Where does this bravery come from? She seems like a totally different person right now.\n\n\nThe door bursts opened and a wave of shotgun shells flies directly towards you two. Her blood and saliva bedews your face as you and she falls to the hard surface.\n\n\nY.O.U  F.A.I.L\n\n\n...\n\n\nYou sit quietly right besides Mathew, killing everything that butts in with your moment by your remaining functioning arm. When the last bullet pins into whatever creature's brain, it is also the time you leave this world...alone.", "action_results": []}]}, {"action": "By searching her earlier", "result": "\"Yeahhh, should have expected.\" She says, disappointed of something. \"Have a fun time with my body, champ?\"\n\n\nYou don't know how to answer that question as you have no experience with a woman you just have gotten to know. It's not an usual day to hear a girl asking you straight out like that, a flat girl no less.\n\n\n\"Ummm...Was that too direct?\"\n\n\"You bet it is.\"", "action_results": [null]}]}, {"action": "Ignore him", "result": "You decide to leave him alone as you search for the boxes of ammo and the clips remained in your coat. What is going to come, you do not know. But your pistol is going to make your way around. With one swift movement, you sort out the fully loaded magazines and the empty ones side by side onto the table in front of you two.\n\n\nIt's a killing party outside and you are not invited. However, you're sure as hell you don't want them to end it before you go and ruin it yourself.\n\n\n\"What are you doing, James?\" He asks, confused by your action. \"Where did you get that many?\"\n\n\n\"I'm going out.\"\n\n\n\"What?! Are you crazy? You want to be pumped with bullets left and right in the middle of this?\"\n\n\n\"Are you worrying...\" Without stopping your work to look back at him, you speak out. \"...about not making out of here alive?\"\n\n\n\"...H-how can I know about that?!\" He raises his voice. \"Unlike you. I don't have a damn thing to defend myself!\"\n\n\n\"If I die then you can keep the gun. Rather than waiting for them, why not blast them out first?\"\n\n\n\"But you can't be serious about going outside right now! That's suicidal!\"\n\n\n\"Not if I have your sprayer. By staying in the background, or rather should I say, under a shelter then we should not worry about the rain.\"\n\n\n\"But what about the punks outside?\"\n\n\n\"Since they're freely shooting people, they must be safe from the mosquitoes. Don't you think it would be great if we got a hand on them?\" You state your idea while carefully loading every bullet into an empty magazine. \"Give me a hand with this thing, will you?\"\n\n\n\"...Can we do this in the morning? I cannot see anything good coming from this. We can use the sprayer when we escape. It might-\"", "action_results": [{"action": "Shut him up", "result": "\"No might! Morning came and we'd stick out like sore thumbs! And do you honestly think that they would stop if we were lucky? Not to mention again that those mosquito can make a trail of our path!\"\n\n\n\"We might make it if we go on by foot!\"\n\n\n\"Heh! What?\" You crack up at his speech. \"If you could do that then why didn't you just do it right in the beginning, ranger?\"\n\n\n\"...I-I panicked, okay? And I thought that I could get back to my car and drive the hell away!\"\n\n\n\"And then instead of disappearing into the wood, you came here. Why? You could just have left sooner alone with all those sprayers, idiot!\"\n\n\n\"B-Because, because of...\" He mutters trying to think of something to say.\n\n\n\"Whatever, it doesn't matter now.\" You sigh, finding that silly conversation going nowhere. \"Look, I'll have to take them out by surprise, right now! It's the only way to stay undetected while they are also murdering people. Each shot must have a delay time so I'll have to get close and personal to land a kill. If a gunfight broke down, they'd know immediately that someone was fighting back and popped our asses with ease.\"\n\n\n\"Wait a minute! Our?\"\n\n\n\"I need an eye for my back. You hide in the dark and yank my ass out if I happened to overlook something.\" You say with vigor. \"And in the worst case like I said before. Grab my gun!\"\n\n\n\"...I. How could I...\"\n\n\n\"Make up your fucking mind before I leave you here!\"\n\n\n\"....Okay fuck!\" Finally he gives in. \"You go first and I'll stay where it's safe. You have to make sure everything is clear before moving out...okay?\"\n\n\n\"Worry about yourself.\" You spat. \"Dry your raincoat. I need something to cover my head when I'm out moving.\"", "action_results": [{"action": "Let's go!!!", "result": "Congratulations! You have made it to the end of the first chapter. I decide to end this early because I'm gonna have to put all of my time into schoolwork soon. Hope you enjoy this shitfest!", "action_results": []}]}, {"action": "Listen to him", "result": "\"It might be possible to get away before they notice us.\"\n\n\n\"In the morning? What chance are we talking about here? You think my or your shitty car could outrun them, an organization that is testing their experiment on human life? And besides, I doubt that they'd leave the parking lot unguarded.\"\n\n\n\"We might make it if we go on by foot!\"\n\n\n\"Heh! What?\" You crack up at his speech. \"If you could do that then why didn't you just do it right in the beginning?\"\n\n\n\"...I-I panicked, okay? And I thought that I could get back to my car and drive the hell away!\"\n\n\n\"And then instead of disappearing into the wood like a normal ranger would rather do, you came here. Why? You could just have left sooner alone with all those sprayers.\"\n\n\n\"B-Because, because of...\" He mutters trying to think of something to say.\n\n\n\"Whatever, it doesn't matter now.\" You sigh, finding that silly conversation going nowhere. \"Look, I'll have to take them out by surprise, right now! It's the only way to stay undetected while they are also murdering people. Each shot must have a delay time so I'll have to get close and personal to land a kill. If a gunfight broke down, they'd know immediately that someone was fighting back and finished us with ease.\"\n\n\n\"Wait a minute! Us?\"\n\n\n\"I need an eye for my back. You hide in the dark and make a sign if I happened to overlook something.\" You lower you tone. \"And in the worst case like I said before. You need this pistol to stay alive, am I right?\"\n\n\n\"...\"\n\n\nSilence fills the air as not a single line is given until-\n\n\n\"....F-fine!\" Finally he gives in. \"But it's not like I agree with you or anything. If you think I'm gonna help you with this crazy idea then you are completely wrong! I just want the damn gun, got it?!!\"\n\n\n\"Oh boy, here we go.\" You say, unamused. \"Dry your raincoat. We're gonna have to share this if we want to make it with the sprayers.\"", "action_results": [null]}]}]}]}]}, {"action": "Check the parents room", "result": "You spend your sweet time screwing everything up, from the bedsheet to the make-up table,...nothing escaped your wrath but none led to anything useful about the mosquitoes either. After many times failing to get access to their computer, you decide to give up. 'I'll have this theory kept in mind just in case.'", "action_results": [null]}]}]}, {"action": "They knew something?", "result": "'...I don't have enough clues to prove that. Seem like a check is neccessary.'", "action_results": [null]}]}]}, {"action": "To stack the bodies in an underground pathway", "result": "\"This town is in an pretty awful state, I doubt it has one.\" Mathew disagrees with certainties. \"If they are aiming for that then they should have picked the infirmary or some place out of sight.\"\n\n\n\"Hmm, good point. Then it only left to that option.\"", "action_results": [null]}]}]}, {"action": "A result of gangfight", "result": "You discard that thought.\n\n\n'Getting the vital fluid and reserving the bodies are quite unlikely related to each others. Unless the biker gang had some way to manipulate the mosquitoes into doing the work for them...which I'm sure went pretty badly for them.' You remember the one you shot before. 'No, that's not it...' ", "action_results": [null]}, {"action": "Someone was killed by the mosquito and got carried there by them", "result": "'That's one obvious way for the people to release what was going on. If they were gonna go full berserk on everyone, why bothered to hide the bodies? It's not the mosquitoes that do the cleaning!'\n\n\nMathew is looking at you waitingly and he would be cheering for you even if you were wrong since he didn't know anything. It's crucial that you get your thought throughly.", "action_results": [null]}]}]}]}, {"action": "Let him suggest something", "result": "You run a finger across your forehead for a moment before saying. \"I don't know yet. What about you?\"\n\n\n\"...\" His silence lasts nearly till your next question. \"Should we hide or run, man? I think we should stay here until the hour is right.\"", "action_results": [null, null]}]}]}]}]}]}]}]}]}]}]}]}, null]}, null]}, null, null]}]}]}]}, {"action": "Try to get out of the way", "result": "You pull you head backward and OW!!! Right at the sweet cheek! This dude must have been participated in some serious boxing championships, that fist would make a double KO in one swift swing. Your teeth is certainly doomed and your new look is going to make a useful disguise against the police. Unfortunately, you don't have the mind to think about all of that as you are in for a deep slumber.\n\n\nY.O.U  F.A.I.L\n\n\n...\n\n\nYou wake up to see a ceiling fan spinning far away from your view. Damn, this place sucks! Even the thing looks like it came from the last century, not a pleasant sight to see after having a good sleep. But soon you're greeted with the face of an angel so that's not so bad. Your eyeballs snap open at the presence of a beautiful woman looking down on you.\n\n\n\"Hold on...\" She gloomily speak as you try to sit up. \"You are still in a daze, it's better if you lie down for a bit more.\" Her tone suggests she is in between 25 and 30, the voice is so serene. You have a feeling that this woman was the one who has been taking care of you.", "action_results": [{"action": "Her name", "result": "\"Who are you?\" You ask, eyes opened on the comfortable sheet. \"And where am I?\"\n\n\n\"You are inside the dispensary and I'm your doctor, Rudy Hills.\" She says, emotionless while carefully adjusting the bandage to your cheekbone. \"You got quite a blunt injury from a fight but you should be fine. Although your jaw will need more time to heal back to normal, you still are able to eat. Just don't crush fast food.\"\n\n\n\"How long was I out?\"\n\n\n\"...About half a quarter, I think?\"\n\n\nThat's relieved, you weren't busted while unconscious. The news hasn't broadcasted anything about you yet, your face is still remained unknown to the country. But for how long though? You need to get your gear back before anything bad happen. You feel a little disappointed that you have to say goodbye to another gorgeous babe.\n\n\n\"I have to go. How much is the treatment?\" You say, sitting up despite her warning earlier.\n\n\n\"...Fine.\" Surprisingly easy enough, she frowns a little bit but agrees. \"Your fee is already covered by your friend so don't worry about it.\"\n\n\nWait...what? You have friends in this god forsaken place? \"Friend? Who is he?\"\n\n\n\"A fellow tucked in a fine suit called himself Manny. You and him are good friends, right?\"\n\n\n\"...Yeah, whatever. Where is my coat?\"\n\n\nYou quickly get your trentcoat back and everything inside is still in place, even the damn gun! Are they too lazy or just too kind to do a quick search on a patient? Hey! Where did this cash come from? You find a thick bulge of money lying in one of the pockets, that amount could give someone a heavy dinner. It might have came from some poor sucker who mistook your coat for their own. Smirking, you shamefully hide it before they could come and find you. Well, lady luck sure has fell for your charm in the previous life.\n\n\n\"Oh that's right!! Do you have any good medical supplies here that I can get?\" With the newfound cash, your greed has triumphed over you.\n\n\nYou put on your shade and the earplugs on and walk out to the street, waiting to hear your wanted public display. After that event on the diner, you have to resort to feeding on street food. Applepies, pancakes, disgustingly sweet desserts...You'll just have to endure those if you don't want to sleep with a growling stomach.\n\n\n ", "action_results": [null]}]}, {"action": "The Hundred Crack Fists!!", "result": "ATATATATATATATATATATATATATATATATATATATATATATATATATA!!! ATATATATATATATATATATATATATATATATATATATATATATATATATA!!! ATATATATATATATATATATATATATATATATATATATATATATATATATA!!!!!! WACCHAAAA!!!!!!\n\n\n...\n\n\nDarkness, the only thing that you can only feel...can't you? You try to open your eyes but couldn't...In fact, you don't have any sensational feeling at all!\n\n\nCome on!\n\n\nWake up!\n\n\nDamn IT!\n\n\nFinally after struggling with your brain, you manage to get a feel of your skin contact and snap your eyes opened.\n\n\n!!! You're being chained to a plastic surgery table, naked with only the boxer! The cold from it is killing your back. Numberous cords and tubes are sticked into your arms and your legs! To add up the creepy formation, 2 large sized needles are injecting some weird-colored liquid into your body. With each and each of those flowing before your eyes, your skin sensation slowly fades away.\n\n\nWhat the fuck is going on??!\n\n\n\"Oh!...You can still be alive?\" You turn your neck to the speaker and see a beautiful, gorgeous blondie looking at you. \"Admirable...Stay still! Let's chat for a bit, shall we?\"\n\n\nYou try to open your vocal cord but find no strengths or air to do so, you can only glare at the beauty in front of your face, grinning slyly at your misery.\n\n\n\"Can't talk? That's too bad.\" She is teasing you, and she is enjoying the look you're giving. \"Umm, yes! You'd make a fine work out of this. Let's see...\" She checks your chest for a bit and then speaks the murderous words on your decaying breath. \"It's a bother but I guess you need another method. Be ready for it.\"\n\n\nRudy Hills, her nameplate inprints itself into your brain after she has left. Well, her C-cups were quite a feast to the eyes at least.\n\n\nY.O.U  A.R.E  A.L.R.E.A.D.Y  D.E.A.D\n\n\n'Is this it?' You ponder, looking at the dead bodies hanging on top of you. 'I wish I could chill out, this is so surreal. Maybe next time I should consider what world I'm living in before doing something stupid again.'", "action_results": []}]}, null]}, {"action": "Ignore them", "result": "No, nope, nope! Not the kind you want to be involved. Ignorance is pure bliss in this situation, you continue to listen to the TV. No matter how much they try to pester you into this Pokemon stuff, you stand...you sit on your chair without giving them even a glance. Perhaps because of your hardcore coolness, they leave you as fast as they arrive. Kids, adorable but so simple sometimes. You have to crack a smile at the sight of them asking another customer.\n\n\n<DUN DUN DUN!!! Who is ready to become another winner in our contest today?> A gameshow is on and it is blasting your eardrums, killing your rare happy mood instantly. You turn down the volume and lazily get back to the waiting game.\n\n\nBefore long, your lovely meal has arrived. You're starving so even if the quality is shit, the quantity will fix it. You pick up the fork and start with the eggs first.\n\n\n\"Hello sir! Where are you going?\"\n\n\nHmm, sunny today sure is hot and delicious, not bad for a small size, the hens here are healthy you can tell. And now bacon...with extra steak sauce too?! You grab a slice and shove it in your mouth.\n\n\n\"Do you like this?\"\n\n\nEhh!!! What is this? Where does this stuff come from?? You swear you can almost taste the bitter ashes in this, did they put them on the stove? Not to mention the sauce is terrible, you find no traces of the sweet and fat juice of the meat. They're pretty soft and easy to swallow though so you can forgive that. After spending time savouring the eggs while cringing at the main meal, you move onto the applepie.\n\n\n\"Uuu...He's so mean!\"\n\n\n...Uggrr! Sugar rush has no brake in this one. Sweet, soft and creamy pie, pretty good! Not the best but certainly not the worst, you can enjoy this one more time if you have to. You leave the cash down onto the table and prepare to walk out. When you are nearing the exit, you see a mountainous man in a black tux turning his back to you. Just as you're about to head for the door...\n\n\n\"Oh, excuse me.\" The man turns to you and speaks up, looking at you with quite a non-friendly manner. \"I'm looking for a boy and a girl going together, they are both in grade schools. Have you seen them?\"", "action_results": [{"action": "Ignore him", "result": "\"No, I haven't.\" You say, fixing the earplugs as if to show him that all you have done is just listening to music. These types are something you do not want to stay with for too long.\n\n\n\"...\" A disdainful look towards you, he clearly doesn't take a trentcoat wearing man's words. He and you have unintentionally started a stare battle against each others.\n\n\nWith a tired sigh, you shove him out of the way before he could beat you. \"What are you, some kind of their guardian?\" You spat without wanting an answer, annoyed by this man's action. Some people these days...If it wasn't for your safety right now, you'd never need to hesitate pointing the gun at this orge.\n\n\nYou step out of the diner with the man's hateful glare following behind.", "action_results": [null]}, {"action": "Say yes", "result": "\"Yeah. They were just here pestering people about Pokemon or something.\" You respond with an uncomfortable frown, you feel an annoying feeling around you that they and this man have created.\n\n\n\"Oh!...Do you know where they've gone to?\"\n\n\n\"Don't know.\"\n\n\n\"...\" A disdainful look towards you, he clearly doesn't take a trentcoat wearing man's words. He and you have unintentionally started a stare battle against each others...And you're slowly losing.\n\n\nBut then suddenly, he bows his head to you. \"Please pardon me.\" With that said, he runs ahead of you and leaves the diner. You've not ever met anyone weirder than that these days. What the hell was that? That was completely out of nowhere.\n\n\nWith nothing else to ruin your day, you hit the street outside.", "action_results": [null]}]}]}, {"action": "Finish your drink", "result": "Might as well do what you were going to do. Even though the taste is so horrible, you gulp it down in one goes, hoping for your stomach to hold up any retching urge.\n\n\nYou feel sober as you carelessly put the glass and a bill down. Then immediately...Frowning at the sourness, you run out of the bar and vomit everything inside out like a loosen water hose.\n\n\nYuck! Maybe you should find something to eat, you feel absolutely terrible.", "action_results": [null]}, {"action": "Flirt", "result": "The alcohol in your blood is kind of getting out of control right now. You need to sto-\n\n\n\"Hey there, ~hotness!\" You say, trying to force yourself not sounding like a manwhore.\n\n\n\"...You called me, sir?\" She looks at you expectantly...no, confused is more likely to describe her stunning expression right now. Maybe you're being too forward! ", "action_results": [{"action": "Slow down, no ladies are gonna run away", "result": "You straight up your sitting and then...a dreamy glance escapes your eyes through the thickly shade to enters her own.\n\n\n\"Sir? Do you want something?\"\n\n\nIt doesn't work. What?!! You should get a blush and an embarassing bow to the side from her, not a speech line! You try your best to come up with an answer. Maybe you shouldn't have thought so highly about yourself, that would be a start.\n\n\n\"Can you help me find a name to put on the angelic painting before me? I'm helpless just by looking.\" You do your dirty tongue smoothly, making it sound like a sore one.\n\n\n\"Hmmm.\" She smirks, such a pair of delicious lips she got. \"Sir? Are you trying to ask me out?\"\n\n\nThis is some seriously sticky situation you've gotten yourself into, you just can sit there hopingly. A mature woman might not be very easy but at least you can live with that. No big trouble.\n\n\n\"Obvious flirting like that will get you no where, that's all I can say, big boy.\"\n\n\n...\n\n\nShameful...Too shameful. A grown man being looked down by a lady, younger than him no less.\n\n\nY.O.U  F.A.I.L\n\n\n\"Too much stimulation to try and not a single one worked out, guess I am not fit to be with another.\" You wailfully groan, stepping out of the bar.", "action_results": [null]}, {"action": "Charge right in, she is in your hand", "result": "\"You want to hang out?\" You put so much confidence in yourself that you can't help but flash a dirty grin at her.\n\n\n\"...Please, I'm working sir.\" She says, glaring at you hatefully.\n\n\nUh oh! You hit the wrong desk this time. This girl was well-educated alright, you've been fooled! But the rat has been out of the bag, you have no choice but to go with the flow.\n\n\n\"Whatever you want will be yours, sweet cheeks. The only thing I can ever hope to see is the shimmering body under those garment.\" Being a giant pervert, you nearly lick your mouth at the sight of hers.\n\n\n\"No.\"\n\n\nOhhkaa...Wait what? What?\n\n\n\"You will not get anything from me, you dirty bastard!\" Her looks she's giving can pass for a hard slap right now. \"I'm not a whore!!\"\n\n\nYou are...not gonna walk out of here without receiving a few bruises from her, you freak. You sprint out of the bar before some pretty remarks could be thrown at you.\n\n\nY.O.U  F.A.I.L\n\n\n\"I'm...Why am I such an idiot? Damn!\" You blame yourself and your forcefulness with a scratch to your block head...and a feel to your empty stomach. \"Stay away from good-looking woman when you are drinking I guess...If I run into her again, better be prepared for the pain.\"", "action_results": [null]}, null]}]}, {"action": "Risk your life", "result": "You should never have chosen this road, it's the worst possible trail you've ever seen in your life. Roadkilled animals, full of dead ends leading to the falling death or harsh mud slowing you down and it's dark like your unlit office. \n\n\nBut those are nothing compare to what you're avoiding right now. There is a biker gang risking their pitiful lives to steal your goods and might even kill you in the process. Due to the condition of the road, you can't seem to find a way to lose these experienced robbers who are familiar with this area.\n\n\nYou pull out your repeater and start to spread deadly painful yelps and fresh blood among them. They're criminals, right? Wiping a few scums is just the same work you've done.\n\n\n\"Fuck! A gun, he got a gun! AGGHRRR!\n\n\n\"A fat loot! Fire away, boys!\"\n\n\nYour opening fire has started a shootout between a lone car and packs of bikers. Each shot traded equals a body part of someone rendered useless and you can only pray that you're not the next one.\n\n\n\"Let's see if you like THIS!!!\"\n\n\n\"AGGGGGRRR!!!\"\n\n\n\"GET OUT OF THE WAY, FOOLS! ROCK ON THE ROAD!\"\n\n\nA rounds of bullets start to fly towards you and shriek their destruction power into your ears. A gatling gun! And they're not afraid of using rapid-fires even with the front row being in the way, they want your life!\n\n\nYou have to think of a way!", "action_results": [{"action": "Use one of the cans", "result": "To be suggestive, that's one suicidal way to use the fuel.\n\n\nYou grab one of the cans and wait for the fires to clear. Your car will have to endure for just one round and you'll have to be precise with the timing too. This is probably the stupidest idea that you can imagine but in the nick of time, no one can really blame your failure on this.\n\n\nWhen biker gang hit, they really hit profusely. There seems to be no signs of that gun and the screams from their own men stopping, it's so brutal just to hear this while trying to make your way through this. Aren't they aware of how many poor squirrels and vixens they just squashed?...It's unbelievable that you're thinking about that while being chased to death!\n\n\n\"LOCK AND RELOAD! BABY WHHHooooooSSSSEEE!!!\"\n\n\nThere! 1...2...3! You throw the gas can through the windows. If you miss, there is a good chance they might slip on those.\n\n\nIt takes about a mere second before an entire area is suddenly beaming with light. Old-schooled blue flame of death caused by gasoline...so beautiful, so serene yet so traumatic with their bodies being burned and their bikes getting imploded. As wonderful as it sounds like, you cannot bear to watch. You just set the forest on fire, man...You have to get out of here quickly.\n\n\nYou know...Getting away with murders is really becoming more like something belonged to you. Was it luck, or your actual skill that you had in store that has given you the state of a cold-blooded killer?", "action_results": [{"action": "Alright! Enough daydreaming!", "result": "You are dead if you think you could escape from the infamous biker gang.\n\n\nY.O.U  F.A.I.L\n\n\n\"I don't know if risking my life or being a criminal led me into this.\" You say directly to the scattering and burnt corpses lying in your way. \"But know. I will take any life to ensure my own...even THIS!\" You put the gun inside your mouth and pull the trigger, ending the pain from numberous bleeding holes in your body.\n\n\n...If it has to be taken, then let's just do it like you has intended to right in the beginning.", "action_results": []}]}, {"action": "Aim for the holder", "result": "You suddenly has this urge just to stick your head out and aim for one who is firing at you. Hearing all those screams from their fellows being used as targets practice by the shooter slowly boil the anger inside your heart, you're always despite these kind of scumbags, coward and lack any responsiblity whatsoever. Strange...you of all people should be thankful by this. After all, is the fact that they're literally decreasing their own numbers down a good thing to you?\n\n\n\"LOCK AND RELOAD, BABY!!!\"\n\n\nMaking use of their obvious free shot giveaway, you decide to risk your life. What's a better way to protect yourself other than being a badass while at it too?\n\n\nOh hoh, you're cute...a batshit crazy type of endearing actually. You seriously need some help when you go to hell.\n\n\nTaking a good look at the shooters thanks to the motorcycle's light reflecting on them, you quickly pinpoint the huge crank-driven bastard. Without wasting any precious second, your tongue jingles by itself 3 times and both your hands join in the harmony.\n\n\n\"He is there! Bastard's sticking out!\"\n\n\nThe bullet comes out flying and...It would be a real wrench for you if this missed.\n\n\n\"AHGHGGGGG!!!\"\n\n\n...It seems like you hit your target's...jaw or something, you can hear him screaming and some of motor's engines dying down, the gunfire has been ceased too.\n\n\n\"BOSS! Boss got shot!!\n\n\nHoly...What the...\n\n\n\"Shut the hell up! Chase after that son of a bitch!\"\n\n\n\"BOss! Boss!...Boss??!!! Don't scare the group like that!\"\n\n\nA gentle and pleasant feeling sweeps over your inside, to think you actually did it, you, a normal average Joe who hasn't received any training on how to operate or shoot a gun. You have cleaned another despicable piece of shit off the world!\n\n\nYou drive far away with terrific handling skill, your car is like aviating through the roughness of the terrain. The odds of you surviving yet another chase wasn't very much but you have actually passed it with flying colors!", "action_results": [null]}]}]}, {"action": "Sophisticated stealing", "result": "At least you know how to reload a basic handgun while totally clueless about anything else. What is there to blame besides yourself? You were nuts, and you still are right now. You load the inside the barrel of your pistol with a fresh clip and proceed to approach the gas station slowly. You park the car just behind the wall surrounding the place and sneak into the yard on foot. Before the employer, a man in mid 40 can sense you, his hands have already raised behind his head as you hold him up at gunpoint.\n\n\n\"Sorry for this.\" You say, looking frantically side by side. \"Get me 6 litters of gasoline. Try anything funny and I will torch this place down in an instant.\"\n\n\n\"A-Alright.\" He answers your order by slowly walking towards the container to grab the cans. \"Here...just chill out, okay?\"\n\n\n\"Good. Grab those and go forward.\" You demand, wanting to be sure of your position to the eyes of any people outside. \"Turn around now.\"\n\n\nYou lead him back to your vehicle, the poor man is struggling to carry the fuel one by one.\n\n\n\"Open all of the covers, I want to see them.\"\n\n\nHe does so and backs away to the wall, allowing you to have a look at the containers...Yep! It seems like all of them are pure gasoline alright.\n\n\n\"Good. Now go back to your place and I swear if I see the cops hogging the horn anytime now, I'll mark all flammable stuffs inside that place my practicing target. Are we clear on that?\"\n\n\n\"Yeah...I see your point.\" He says, throwing a dirty look behind you as you get in your car.\n\n\n\"Nice doing business with you, mate.\" You crack a smile at your victim. \"Good bye.\"\n\n\nYeah, screw all of that moral bullshit. You got the gun, you are the winner.", "action_results": [null]}]}]}]}, {"action": "Okay, turn on the gas. No need to get touchy now.", "result": "The pedal is being extremely abused by you as your vehicle blows off blindful storms of broken leaves and dirt back to your pursuers. Every turn you make equals a nightmare, your eyes cannot keep up with what in front of you anymore. You pray for the safety of the tires as well as yours. Nothing but speed and gunshot keep you stay intact with the world.\n\n\nShreeekkkk!!! The glass door from behind has gone down!\n\n\n'These cops!...This some kind of game to you???' You think, making a zic-zac move to dodge another straight shot. You can't afford to panic, anything but that. Hot and cold sweats mixed together run along your forehead and down to your lip, a salty taste quickly dominate your saliva. *Gulp*\n\n\nThe tires are still normal, that was just a lucky shot...but a warning that you should step up pass the limitation!!", "action_results": [null, {"action": "Keep going, man!", "result": "If the cops caught you, you would spend your whole life in prison. No, you would have the honor to fry your ass on the chair instead! With that thought in mind, you stop at nothing to get a straight pass in your line of view. Eventually, you start to crash into one of the trees and cast them aside.\n\n\nYou've gotten very deep into a strange place, the risk of hitting dead ends is throttling your head and your hands're getting worse at keeping the steering wheel stable. It doesn't take very long for you to start losing your mind. And the glass-busting pistol they use is pretty damn good at fucking up your car. Oh baby, right now the tires are your hope and dream. You've forgotten all about your crush, the only thing you care about now is your life, your own life!!! And your damn buggy! Depressed and giving up on life? You would never!\n\n\nUnfortunately, you should never...never ever speed your car in an unknown territory. In about 4 minutes, you end up screwing yourself by rolling over to an impassible hill...and then cliff. The fireworks are very astounding.\n\n\nY.O.U  F.A.I.L\n\n\n\"...I really can't concentrate well today, maybe next time.\" You speak to yourself as you enjoy the nice view hanging from a lovely branch, such an odd behavior for a lucky guy.", "action_results": []}, {"action": "Pull over and turn yourself in.", "result": "What if the tires got hit and you ram yourself into something? You'd be lucky if you still got all of your limbs.\n\n\nIn the off chance of you speeding up uncontrollably like this, you'd probably get your car beaten up and lost the chase with the police.\n\n\nYou've been playing with Death once...and he is not someone anyone'd like to get themselves into. You're not crazy enough to keep this up anymore longer, you've got to stop. NOW!\n\n\n\"THE SUBJECT'S VEHICLE HAS STOPPED!!! PULL OVER!!! Be careful, guys!\"\n\n\nWith little anticipation, you and your heartbeat nearly stop dead in their track when one of the officers gets closer and hold you at gun point. Good thing you didn't have the suicidal thought to start a shoot-out with them.\n\n\n...\n\n\nYou got 1st Degree Murder, a death penalty, no hopes of relieving that sentence from your parents or your friends. You got a lot of supporters on the Internet though, but you don't mind anything about that. There have been a lot of flowers and blooming moments  in your life, now is a good time to stop and think.\n\n\n...Think...about your family, loved ones, your growth, your birth...the revenge...your undying love for her...and...your...your...\n\n\nNo...\n\n\nNothing, nothing...In the end, you still haven't gotten anything by your own.\n\n\nDeath perhaps? You still can have the pleasure of slowly and painful agony on the electric device they've prepared solely for a dangerous criminal like you. \n\n\nY.O.U  F.A.I.L\n\n\n\"...Next time, I'll shoot.\" You mutter up courageous words as you lean your back against the darkening cell, the special kind.", "action_results": []}]}]}