{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=28838", "context": "", "first_story_block": "", "action_results": [{"action": "Spy Mission", "result": "\"Another day, another dollar,\" you think as you trudge out the door from your job. You really don't like working there, but at least they pay you...a little. Finally you've made it to the weekend, so you at least get to look forward to a couple days off from work.\n\nYou get in your car and drive out of the parking lot at work only to come to an almost immediate stop as you hit the traffic. It is like this every day, but Fridays are always the worst. You reach to turn the radio on, but then remember that you still haven't had time (or money) to get that fixed. You look out the window and just see the line of cars moving slowly...\n\nFinally you get home, and you're hungry. You should have stopped for something on the way home, but you just wanted to get out of that traffic and out of the car. When you arrive at the apartment parking lot, you sigh when you realize that you're late, so everyone else will be parked in the good spots. You circle the building once before you give up and park in the \"remote\" lot. Hey, at least you're home and work is over.\n\nAs you trudge towards your apartment building, you see a small brown box sitting on the edge of the sidewalk, right near where you parked. Looking around, you don't see anyone else at the moment. You can't tell if the box was left there on purpose, or if someone accidentally left it behind.", "action_results": [{"action": "Ignore it and head home...", "result": "You walk across the sidewalks and towards your apartment. You can feel the heat coming off all the cars that got to park closer to the building than you did because of that traffic. Most of the cars here are older cars, some with dents and cracked windows, just like yours. You'll earn enough one day to get a better car, you're sure of it, just not any time soon.\n\nYou start up the stairs to your apartment. When you rented this place, the $200 discount for taking the fourth floor apartment seemed like a good idea. Of course, that was before you found out the apartment above you had kids, and you still had to walk up all these stairs because the elevator was at the other end of the building. Maybe you would win the lottery, then you could build your own house where you wanted it to be: and you weren't going to have any stairs in the entire house!\n\nYou unlock your apartment and step inside. The air is pretty stale, since the management makes you pay if you leave the A/C on all day. You know without looking that the refrigerator has nothing but some old catchup. But hey, you did get paid today, so you're going to order some take-out! Just before you get to the phone to place an order, the phone starts ringing.", "action_results": [{"action": "Ignore the phone...", "result": "You make it through the regular take-out for your dinner and realize that you ended up spending way more of your paycheck than you should have. Now you're full, so maybe you won't go out tonight...well, at least not yet. Sitting around for a bit, it's Friday night, so you're sure something good will be on TV. Later on you can worry about going out.\n\nYou flip the channels and start to realize that even though you have something like 1,000 channels, there's really nothing on...nothing at all. You finally stop on some supposed reality show that's just made for laughs and embarrassing people. It's pretty bad, but you watch it all the same because it's better than watching re-runs of a game show from 20 years ago.\n\nAs you zone out, suddenly you hear a tapping on your window. Yes, you're on the fourth floor, but one of your living room windows faces the walkway/balcony that loops around the outside of one side of the apartment building. You figure it was probably just the kids from upstairs messing with you, but then you hear the tapping once again. You could just turn the TV up, but you could go see who it is.", "action_results": [{"action": "Ignore It...", "result": "Your eyes blink open and you look at the ceiling. It is a boring white, like all these apartments, but you're pretty sure it hasn't been painted in 10 or more years. You blink and sit up. At least you don't have to go to work today. Instead, today is relaxation day. First you need to head to the store to stock up on some food, then all bets are off!\n\nYou open the door to head downstairs. The day does not match your mood: it is cloudy, cool, and windy outside. In fact, the clouds are getting darker and rolling across the sky as you watch them. You better hurry and get your supplies and get back, or you're sure this storm will catch you. You trot down the stairs and head into the back lot to your car.\n\nYou start to pull out and slam on your brakes when another car starts to back out in front of you. That was close. This is a big apartment building, but you recognize that giant car as that of the old lady who lives on the first floor and does everything slow. You slowly follow her out of the parking lot and are glad when she turns the other way.\n\nYou are headed towards the grocery store, but when you take a right in the middle of town, you hear a loud \"pop\" and feel the car slide underneath you. You limp the car over to the sidewalk and get out to see that yes, you now have a flat tire. That's the second one this year, and you just remembered that you didn't replace your spare since the last time.\n\nFortunately, you have AAA, and you can call them to help you. The overly nice AAA guy on the phone tells you that it will take about an hour, but they'll be there. You sigh and lean against the hood, thinking about all the food you were going to buy, but will now have to wait.\n\nAs you're sitting there, a black four-door car slams it's brakes on next to you in a squeal of tires. The back door pops open and you can see a skinny man inside in a dark suit and dark glasses on the far side. He calls out to you, \"Get in.\"", "action_results": [{"action": "Get in the car...", "result": "You get in the vehicle and take a seat. Before you have time to put on your seat belt, the vehicle starts moving quickly. As you are pressed back into your seat, you get a whiff of the car: it smells new. It looks completely new, like the plastic had just been taken off the seats this morning. You start to sit up and look out the windows, but then you realize the rear windows are not just blacked out from the outside, you cannot see out them from the inside.\n\nYou look towards the windshield as a large panel appears from the floor, sliding up to completely obscure your vision. You cannot see out the front window at all. Instead, you sit back, slightly disoriented, as the vehicle bounces through traffic and along the roads. You have no idea where you are going, or even what direction you are traveling.\n\nSuddenly you start to get sleepy and find that you are having trouble keeping your eyes open...", "action_results": [{"action": "Continue...", "result": "The first thing that you notice when you start to wake is that you are lying down on something hard. The next thing you notice is how much your head hurts. If feels like your head has been in a pinball machine. As you reach up to touch it, you hear a deep voice say, \"Oh, sorry about that headache. It will go away soon, but until then it's going to hurt quite a bit. A minor side effect of the drug, you know.\"\n\nYou open your eyes and start to sit up. It feels like a horse has kicked you in the head as you manage to start to sit and open your eyes. You find that you are sitting on the floor of the black van and the side door is open. You spin around and put your legs out the door but don't stand right away as you press your hands against your head to try and reduce the pain. Fortunately, opening your eyes doesn't seem to make the pain any worse and you take in the man outside the van.\n\nThe man is short, bald, and dressed in black pants and a tight black tee shirt. You can see cargo pockets on the pants that hang down as if they are not empty. The tight tee shirt reveals that the man has more than a few muscles. He has small, dark eyes that are set deep into his head and a strong forehead. He has a dark stubble around his chin. When he smiles, you can see he is missing at least one of his teeth. He smiles and nods as you take him in.\n\nHe crosses his bulging arms in front of his body and continues, \"So yeah, we had to knock you out because you didn't need to see where we are just yet. You know, secret and all that stuff. And before you ask, no, I don't know why you were selected. That's above my pay grade. They tell me you're coming, and I take it from there. So you ready to get started?\"\n\nYou look up with confusion on your face and think of any number of different responses from one-word responses, to anger, to being incredibly sarcastic. Before you can put the words together to respond, the man continues.\n\n\"Okay, you're confused. I get it. Sometimes people are prepared for this, sometimes they're not. And some people can't make it through the training, while other times they can. I don't feel like giving you the long story, so you're getting the short story. Here it is: \"You're in training be a spy. You get to decide the best way for you to do that. The training starts as soon as you get up off your lazy rear end. And at any time if you decide this isn't for you, you can go home. Of course, we will wipe your memory and you likely won't remember any of this, but that's your choice. Your other options? In this facility we teach stealth, charm, and weapons. So you pick one and we get started, or you choose to go home and I zap you. Got it?\"\n\nYou look around and past the man and you can see that you are in a large warehouse with a high ceiling. There are a few doors along the far wall that appear to lead into smaller offices. Off to the right is a garage door, obviously where the van came in. The space off to the left is wide open, but there are some obstacles and the floor and some chains and rope hanging from the ceiling. The man snaps his fingers as you look around and says, \"Hey, you with me here? We don't have all day.\"", "action_results": [{"action": "Tell him to forget it, you want to go home.", "result": "You look around the space and make a decision. You tell the man, \"No way. This isn't for me. I might have a crappy job, but at least I'm not getting beat up and killed every day.\" You shake your head and continue, \"My crappy apartment is crappy, but at least it's safe. I don't know who you are and I don't want to know. I just want to get back to my safe life. Now, mister.\"\n\nThe man shrugs his shoulders and pulls out a small bottle. Before you can react, he presses a button on the top and a fine mist sprays into your face. You reach up to wipe away the mist, but as you do, the garage around you is already starting to get out of focus. You try to look at your hand, but it almost seems to be moving on its own. You close one eye to try and focus, but then your other eye closes as well. You only have a moment to think about that before you just stop thinking...\n\n\nYou wake up and open your eyes, but immediately regret doing so. Above you is clear, blue, bright sky. You squint and realize that you really have a pounding headache. From the view of the sky you put two and two together and realize that you're lying on your back on the ground. You gingerly move to sit up and close your eyes as your head pounds. You can't remember the last time your head hurt this much. You squint again, trying to get your bearings and realize that you're sitting on the sidewalk outside your crappy apartment. You don't really remember how you got here, but you wonder if there is any pizza leftover from last night...", "action_results": []}, {"action": "Agree to stealth training.", "result": "Whump! You bend over in pain as the main punches you hard in the stomach. Your eyes open wide and you gasp as you try and get air inside your suddenly collapsed lungs. The man says, \"I see you. You suck at hiding. Want to try again?\"\nYou aren't sure that you like this method of training. You assume that you're supposed to do something, but you don't really know what. You figure if you're going to continue this training that you need to at least move away from this crazy man who is attacking you. But then maybe that is the point -- to learn by doing. This seems a little odd because you haven't actually been given, well, any instruction at all, but you don't have a lot of choice at this moment. You don't have a lot of options here in the open space of the warehouse, but you do have some choice...", "action_results": [{"action": "Try and run behind the van and hide from the man.", "result": "You move quickly around the van, thinking that this is just stupid. Even a kid from grade school can watch you run away from them and see where you are. You get around the other side of the van and stop. The man is in front of you. He says, \"You need to work more with the shadows and the light.\" He points out the different ways the light move and the shadows are formed in an around the van. He shows you many other ways you can blend into the shadows by using your body, the light, and natural lines.\nThe man looks at you and says, \"We have time for just one more training session. I can teach you more details about what you already know, or I can teach you a different skill, the choice is up to you. And yes, there is going to be a test at the end of this. It will be a real test, and you might not survive. But I hope you do. So what do you select for you final training?\"", "action_results": [{"action": "Stealth training", "result": "The man leads you over to a large table along the wall of the warehouse. Spread out across the table are a number of different types of gadgets and devices. He takes the time and shows you how to use some simple items to pick a lock and how to disable a security system. He shows you how you can use some of the gadgets to help you distract people and allow you time to move about without being seen or heard. He shows you simple ways to break into place and more difficult ways to bypass security systems and other types of systems designed to keep you out.\nThe man looks at you and says, \"We are out of time. You are either ready or you are not ready. And that is what we will determine now.\" He turns and walks over to a door in the rear of the room and disappears through it. You are alone in the large warehouse, wondering if you were supposed to follow the man.\nYou have trained the following levels of skills:\nStealth: 3\nCharm: 0\nWeapons: 0", "action_results": [{"action": "Continue...", "result": "A moment later, another door in the wall opens up behind you. You turn quickly and see a rather well-dressed man enter the room. He holds the door open for you and gestures into the room. You walk towards the man and the door, but before you can enter the room, the man holds his hand up, stopping you short of seeing past the door.\n\nHe speaks with a British accent and says, \"This is your final challenge. You will enter through this doorway and you may not return. This is no longer training, this is real. There is a man inside this room that will kill you. I don't mean that you get another chance, that he's trying to scare you, or that you'll get saved at the last minute. I mean that if you fail, you will die.\"\n\nHe clears his throat and continues, \"That is not to say that we wish for you to die. Quite the contrary, we would like you to succeed. But if you are not prepared, then you will fail and in this case failure is death. Your death, in case that was not clear.\"\n\n\"Inside this room there is a table. On that table is a small box. Your job is simply to go to the table, retrieve the box, and return it to me. That is all. But, of course, it is not that simple. Also inside this room is a man whose job is to guard that box and prevent anyone from taking it. And that man has been authorized to use deadly force to protect the box.\"\n\nHe gestures again into the room and says with a bow, \"Would you be so kind as to retrieve the box for me?\"", "action_results": [{"action": "Continue...", "result": "You step to the doorway and look into the room. It is a very dimly lit room, so you have to look carefully to see the contents. There is a spotlight shining on a small brown box in the center of a table on the far side of the room. Most of the rest of the small room is in darkness, other than what is lit by the light coming from the main warehouse. You can see through the door it is exactly as the British gentleman had described.\n\nThe entire room is about 15 feet square. There is a man standing, arms crossed in front of him, in front of the table. He has a large knife in one of his hands and you cannot be sure in the shadows, but perhaps a firearm strapped to his waist. He is staring off into the distance and is facing the wall to the left, so that you are looking at his left side. You cannot see anything on that wall where he is looking, but he does appear quite focused. The floor of the room is in darkness and you cannot really see anything else in the room. The box on the table is quite clear at this point...", "action_results": [{"action": "Attempt to sneak around, along the walls, and grab the box...", "result": "You quietly and slowly enter the room. You watch the guard but he does not move and does not appear to hear you enter the room. You watch the ground and carefully move into the darkness around the side of the room, trying to work your way to the table...", "action_results": [{"action": "Continue...", "result": "You make your way to the table and the guard hasn't moved yet. You slowly and carefully reach out for the box and lift it from the table, moving as slowly as you can so the guard doesn't see any movement. After what feels like an eternity, you pull back and into the shadows. You slowly trace your steps back the way you have come, moving back to the door and slipping out of the room.\n\nYou had a 90 percent chance of winning that battle.\n\nYou hold the box out to the man with the British accent and say, \"I believe this is what you requested?\"\n\nThe man nods and replies, \"Indeed, that was sufficient.\" He closes the door to the examination room as he continues, \"Now we shall have to see about our guard there, as he just failed his test.\" There is a yell, then a loud thump from the room, but the man ignores the sounds and walks away from the room, clearly expecting you to follow.\n\n\"You have passed the test, and that is good. You are now working for us.\" He holds his hand up before you can say anything. \"Ah, no questions yet. You do not need to know who we are. Simply accept that we are working for the U.S. government, and we aren't listed in any of the directories. It won't matter anyway, because it's not like we're going to be issuing you a paycheck and withholding taxes for you.\"\n\nHe laughs as he leads you to a set of stairs in the corner of the warehouse. He stops at the bottom of the stairs and points up the stairs. \"There, you see that door at the top of the stairs? This is where your service begins. Head up these stairs and into that room. There you will receive your mission briefing. Should you survive your first mission, we will see what else you can do, where you are needed, and what other information you may need to know. Now off with you!\"\n\nWith that, he makes a dismissive gesture with his hand. He turns and walks away from you, apparently heading back to the testing room. He does not look back as he leaves you, clearly expecting you to follow his directions. You realize that you still don't know where you are, so you really don't have any options here.", "action_results": [{"action": "Head on to the mission briefing.", "result": "You head up the stairs to the indicated room on the second floor. You've seen the door there while you were training, but you had never seen anyone go out or into that room. You're not really sure what to expect. With a last look back at your trainer on the floor of the warehouse, you turn the doorknob and walk inside.\n\nThe first thing that greets your eyes is bright light! The far side of the room is all glass and the sun is setting in that direction, really bathing the room in bright sunlight. You raise your hand to block the light and blink your eyes. At the same time you brace for an attack, realizing this is probably a setup, as you try and look around the room.\n\nYou move to your right in a defensive position and blink your eyes again. As the room comes into focus, you realize there is a couch in the middle of the room facing a small desk. On the far wall, behind the desk to the left is a white board of some kind. There is a projector on the ceiling and a nondescript man sitting behind the desk. He says, \"Oh, is that too bright?\"\n\nHe presses a button underneath the desk and the windows immediately shift to a tint and the light is quickly reduced. The man gestures towards the couch, inviting you to have a seat. He says, \"There are drinks there in the fridge if you need one.\" Taking another look, you see a small cube refrigerator on the floor next to the couch. You move towards the couch, not really sure that you know what is going on, or whether to trust this fellow. He watches you as you sit on the couch.\n\nWithout any introduction, he presses two more buttons on his desk. The projector lights up and the white board screen is filled with the face of a man with dark skin and a short, almost smashed-looking face. The man at the desk speaks, \"This is el Martillo. He is a drug lord that has really caused a great deal of trouble recently. We want to eliminate him, but we cannot get to him. He has a great fortune and he uses it effectively to keep himself alive.\"\n\nThe man pauses, then looks directly at you as he continues, \"He is a very dangerous man. Stay away from him. He is NOT your target. I repeat, stay away from him at all costs.\"\n\nHe looks back at the screen and the slide advances to show a smaller, thin man that is starting to bald, but has a dark, even tan. The man says, \"This is Jack Kauffman. He is an accountant for el Martillo. He is currently in control of an SD card that has a bitcoin account worth over ten million dollars. The SD card is your target. We need el Martillo to not have that money. We don't really care if you steal the card and bring it back to us, or if you destroy it. Your mission is to ensure that el Martillo and Jack Kauffman do not have that card.\"\n\n\"Jack Kauffman moves about and has some protection, but our intelligence has let us know where he will be shortly and when he will be moving. They change plans all the time, but we think this is the time to strike. There is a plane waiting outside to take you to Cuba now. When you arrive, there will be a car waiting for you at the airport. You will need to drive, the keys will be in it. A contact will meet you at Cafe Quinta Avenida with final details when you arrive.\"\n\n\"We do not trust the locals and el Martillo's tentacles run deep in the area. To identify yourself to the contact, you will ask, 'Is the coffee any good here?' He will reply, 'It is good, but not as good as Kenyan.' To confirm, you must reply 'Ah, but Kenyan is too expensive.' If there are any deviations from that code, the contact will not reveal his information. The abort word is 'tea.' If you or he say any phrase with the word 'tea' in it, you immediately abort the mission and return to the airport.\"\n\n\"Remember, stay away from el Martillo and steal or destroy that SD card. That is all.\" He gestures towards the door in the glass wall. For the first time you notice that there is a door there, and there is a small runway outside. As you stand up, you can see a small private plane sitting near the bottom of the stairs outside the door with the airplane door open.", "action_results": [{"action": "Go to the waiting airplane.", "result": "You head towards the door. The man has started to pull some papers out of the desk and is reading them. He ignores you as you open the door only to be assaulted by the sunshine once again. There is a wave of heat coming off the runway that catches you by surprise, but it is quickly washed away with a gentle breeze.\n\nYou walk down the stairs and towards the plane. As you approach, a man dressed in a uniform steps from around the side of the plane and gestures towards the entrance, welcoming you to the plane. You move up the steps and into the plane. Inside the plane is clearly a luxury craft designed for the rich. There are four swiveling captain's chairs, wood grain cabinets, and a number of flat screens. You take a seat and sink into the soft leather of the chair.\n\nThe man in uniform steps onto the plane behind you. He says, \"Sorry, but due to secrecy, there will be no flight attendant on this flight. You can sit anywhere, and I suggest you keep your seat belt on at all times.\" It then that you notice there are seat belts in the leather chairs. The man continues, \"The flight should be over in a couple hours. I would announce when we're landing, but it will be pretty obvious. Enjoy your flight.\"\n\nWithout pausing for questions, the man pulls up the stairs, closes the door, then steps into the cabin. The door to the cabin closes with a click and you are alone in the plane. A few moments later you hear the jet engines start up. You wait for the announcements that never come and the plane starts moving. A minute later you are pressed back into your seat as the plane speeds up down the runway.\n\nYou sit back and relax in the seat, planning to get up and explore the plane soon. Before you know it, you are out cold, enjoying the comfort of the seat. You awake with a start when the wheels of the plane touch down onto the ground once again. You look around quickly, trying to re-orient yourself as the plane taxis to a terminal. Looking out the window you see a small shack at the side of what looks like a very new runway. The plane moves towards the shack and in no time the captain comes out of the cabin. Without a word he opens the door and puts down the steps. He stays on board the plane and gestures you towards the exit.\n\nStepping outside, you feel the humid heat wash over you. The sun is shining brightly, and you can only assume that you are in Cuba. Blinking in the sun, you can see an old sedan parked next to the hut. You start walking towards the car and you hear the door slam shut behind you. The plane is already in motion before you make it to the car. You shrug and figure that it's too late to back out now.\n\nThe gravel crunches under your feet as you walk towards the car. There are bits of dust in the air and you can see a long dirt road headed in two directions from the small hut. Walking past the hut, you don't see anyone in the building at all. In fact, it looks like it has been abandoned for some time now. When you arrive at the dark blue car, you look inside and can see a set of keys sitting on the seat. Next to the keys are a map with four locations circled in red. You can tell that one is a runway, apparently where you are now. The second is in town, so that must be the coffee shop. The third looks like an estate on a hill, which must be el Martillo's house. The last is a large building and the only one labeled on the map, and it is labeled, \"Hotel Melia Habana.\"\n\nYou open the door and get in the car. The keys do indeed fit the ignition and the car starts up easily. The gas tank indicator shows full and you have to decide what to do next.", "action_results": [{"action": "Take a run past el Martillo's place and check it out first.", "result": "You decide that the best way to approach this situation is to head for the heart of the matter -- el Martillo's. You drive down the road and quickly find your way to the massive mansion of the drug lord. The mansion is high on a hill and there is only one road that leads to the top of the hill. You follow the winding road up the hill and notice a number of different fences and walls. You even spot a video camera following your movements on the road.\n\nYou reach the top of the hill and there are two men standing near a large gate with what look like small machine guns. They stare at you as you approach the gate and do not move to the side. The road continues along past the gate and you quickly move to keep the car moving. One of the men moves with his gun and looks like he might start shooting at you. You quickly accelerate and the tires squeal as you take a turn heading back down the hill.\n\nYou realize this was not a great idea -- you didn't get a look at the mansion or the drug lord, and now they know you are here and have a picture of you. You look in the rear view mirror and see the men watching you drive away. You continue down the hill and away from the men, back towards town. You can consult the map and see the way towards the center of town and to your hotel.", "action_results": [{"action": "Head on towards the Melia Habana Hotel.", "result": "Inside the hotel room you can see that this is indeed a luxury suite. This is the top of the line for the hotel and the city. There are top quality furnishings and a large Jacuzzi tub in the bathroom. There is a large king bed in the middle of the room and the room is large enough to also have a lounging area with a leather recliner and a large desk. Next to the desk is a sliding glass door that leads outside to a large balcony with chairs and a small table as well.\n\nOn the desk you see a legal-sized folder. You go over to the folder and open it up. Inside you can see a picture of Jack Kauffman meeting with el Martillo. There are a couple of additional photographs of Jack from different angles so you can recognize him easily. On a second page are two addresses listed as his home address and a work address. There is a map with the locations circled and they are both near the hotel. There are also two envelopes in the folder.\n\nInside the first envelope are two first-class tickets on a flight from Havana to London and a second pair of first-class tickets from London to your home. These are dated for tomorrow, so to use them you will have to complete your mission today or tonight. The second envelope includes a folded piece of paper. The text of the paper is hard to read, but you can see that it indicates that Jack Kauffman takes the item home at night with him every night.\n\nLooking out the window, you see the sun is now beyond the peak of the sky -- it is after noon and you do not have that much time left in the day. If you are going to deal with the accountant at his office, you will have to make a move quickly. If you decide to wait until night, you have a little more time to prepare.", "action_results": [{"action": "You will move now and attempt to break into the office during a break and steal the card.", "result": "You are very suddenly interrupted by a loud banging on the door. You hear, \"¡Abrir! ¡Policía! Abre esta puerta ahora!\" The banging continues and you hear, \"Policia!\" The sturdy door is shaking in the frame and you know that you only have a moment to decide what to do...", "action_results": [{"action": "Move quickly and quietly and attempt to escape out the window of the top floor of the hotel.", "result": "You turn and check out the window. The window does not open, surely some kind of safety device. The banging on the door continues as you run to the balcony. The glass door slides to the side silently and the wind catches you by surprise. You step out the door and survey the area. There are balconies below this one and down to the road. You turn and move quickly over the edge of the balcony to try and maneuver down from one balcony to the other...", "action_results": [{"action": "Continue...", "result": "Your feet find the balcony below yours as you hear the men ransacking the hotel room above. You wonder briefly is the police are going to pay for the damage, or if the hotel will try and bill your cover. It doesn't really matter to you as you swing onto the next balcony and then quickly scramble over the edge to reach the next lower floor. As you swing down again, you hope no one is out enjoying the afternoon on their balcony. As you move down, you are happy to find that the area appears quite abandoned on each floor.\n\nFinally you reach the bottom floor and easily drop to the ground. You look around the alley and see no appears to have noticed you dropping in from above. You casually straighten your clothes and head down the alley away from the front of the hotel where you can see red and blue lights flashing. In a few moments, you are away from the hotel and in the clear.\n\nNote: You had a 85 percent chance of winning that battle.\n\nYou walk around the streets of Havana a bit, taking in the sights and watching to see if you see anyone following you. You don't notice anyone, most people here seem to be minding their own business. There are a few tourists here and there, and they are mostly obvious with their fancy, upscale clothes and the fact they are taking pictures with their cell phones.\n\nAfter a bit of time, you take a seat at one of the many coffee shops. You wave the waiter away when he offers you a drink and you survey the area. You remember the maps from the room and wonder if you were supposed to take them with you. You realize that since you did not, your mission may be compromised. At this point you do not have a lot of options. You can either continue on your mission and try to complete it, or you can take the tickets you grabbed and make an exit from this country.", "action_results": [{"action": "Continue your mission.", "result": "You decide that the best way to deal with this situation is head-on...but perhaps with a little subterfuge mixed in. You head for the office listed for the accountant. When you find the location, you see it is a small, but relatively busy small office front. From the outside, it looks like there is a common area and then a few different offices off in different directions. It look like there is more than one accountant here and perhaps some consultants, lawyers, or other professionals that all share the common front office.\n\nYou remember where the accountant parks his car, so you decide to use that information. You walk in the door quickly and rush over to the attendant. She is a middle-aged woman who looks like she is going to be happy to tell you, \"no.\" Pretending to be out of breath you say, \"Please, quickly! I need to see Mr. Kaufman right away!\"\n\nThe woman frowns at you and looks down her nose at you as she says, \"Indeed. Do you have an appointment?\"\n\nExpecting this you continue, \"This is not about...\" You take a quick look around and say, \"There's police involved. They are going to come here. Something about Mr. Kaufman's car.\"\n\nThe woman does not look impressed and makes no move to help you. You try harder to convince her of the danger of the police and imply that Mr. Kaufman himself may be in danger. You know that you've got to make this work or you're never going to see that SD card...", "action_results": [{"action": "Continue...", "result": "You gesture towards the door and in the direction of the parking area. You step back out the door in look in that direction, coming back into the room with fear on your face. You implore the woman, \"You have GOT to tell Mr. Kaufman! Don't you understand that the police are coming here now?\" The woman simply stares as you. Finally she says, \"If you would like to make an appointment to see Mr. Kaufman, I would be glad to help you.\"\n\nYou slam your hands on the desk and yell that the woman. You realize that you are starting to lose control and are losing this battle. You take a deep breath as the woman looks at your hands. You see her reach her hand under the desk. You step away from the desk and again explain that the police need to see Mr. Kaufman about his vehicle. At this point even you realize that you are just repeating yourself and this woman is not going to budge.\n\nYou move towards the door and suddenly one of the doors to the other offices opens up. Two short, but very wide men shove their way through the door. You turn and hold your hands up to show them that you mean no harm, and they quickly approach you and one grabs each of your wrists. In a second they are painfully twisted behind you and they are guiding you out the door.\n\nThey drag you out the door and you expect to be shoved to the ground, but instead they shove you around the corner and into an alley. You find your face shoved roughly into the solid stone wall. You hear a crack and feel incredible pain in your jaw. Then you slide down the wall with some assistance and you can feel skin being torn off your face. As you hit the ground, one of your wrists is released, but the other is twisted and pulled around behind you. There is another loud pop and you scream in pain as your shoulder is yanked out of its socket. Before you can turn, a foot slams into your chest and knocks the breath out of you. You are gasping, trying to get enough air into your lungs to scream out in pain when another foot slams into your head, thankfully knocking you out cold.\n\nNote: You had a 10 percent chance of winning that challenge.\n\nI'm sorry, it appears that you have lost. Please be sure to try again, as there are many different paths to this story. As a tip, if you're seeing low percent chances of winning, you might want to try selecting options where you have trained for that skill. Thank you for reading!", "action_results": []}]}, {"action": "Head for the airport and abort the mission.", "result": "You decide that by leaving the papers behind that you cannot complete the mission. Surely el Martillo will be notified and he will quickly move some extra protection in for Jack Kauffman. You hail a cab and tell him to take you to the airport. You step out of the cab and head for the airport entrance, taking out your tickets.\n\nYou step up to the security gate and hand them your first class tickets. The security person scans the tickets, but instead of the green light, a red light shows up. The bored security person scans the ticket again, but again the red light shows up. You try not to look nervous as the agent calls over another airport security person.\n\nThey speak for a moment in Spanish, then the new arrival tries to scan the ticket. Again the ticket shows up red. The new arrival gestures for you to come with him. He leads you to a small door near the security area and opens the door for you, gesturing for you to enter. As soon as you do, the door slams behind you. You find that you are in a small room with a little table and two chairs on opposite sides. There is another door on the far side of the room. Checking the door behind you, you find that it is locked, so you take a seat in the chair.\n\nA moment later, the door on the far side opens up. A heavyset man smelling of cigarettes enters the room and looks at you. He has a gun and a badge on his belt. He says something in Spanish that you do not understand, so you shrug. He smiles and says in broken English, \"You try to leave with no ticket?\" You're not really sure how to respond to that because you don't know anything about your tickets, so you shrug again. The man nods his head and smiles again. He says, \"el Martillo sends his greetings.\"\n\nYour eyes grow wide and dart about. Before you can make any plans for escape, the man has drawn his gun and is pointing it at you. You jump to your feet and hold your hands up, but the man does not wait and fires. The bullet catches you in the chest and you can hear your lungs sucking in air as you drop to your knees, trying to hold onto the chair. You can hear the man laughing as your world fades to black...\n\nI'm sorry, it appears that you have lost. Please be sure to try again, as there are many different paths to this story. As a tip, if you're seeing low percent chances of winning, you might want to try selecting options where you have trained for that skill. Thank you for reading!", "action_results": []}]}]}, {"action": "Open the door and attempt to talk your way out of the situation, even though you don't speak Spanish.", "result": "You take a deep breath and step towards the door. You look down and brush a little dust from your chest as you reach out for the door handle. You press down the handle and pull the door open. Three very angry looking policemen stand at the door, looking surprised that you opened the door. One has his pistol in his hand. You smile and take a last breath as you prepare to try and explain that you are not who they are looking for...", "action_results": [{"action": "Continue...", "result": "You show the police your biggest smile and start to explain that you are not who they are seeking. Instead of listening to you, they slam you to the side as one man runs past you into the room. They continue to yell at you in Spanish and you cannot understand them. When you try and speak, one of the policemen punch you in the face. The one from inside the room calls out something else in Spanish and the other two draw their guns. As you attempt to turn around to explain, they both fire into your chest. You look at them, still not understanding, as your life slips away from you.\n\nSorry, it would appear that you have lost. Please do try again, especially if this is your first time. There are lots of different options and possibilities. Be sure to try acts that you have trained, as you will have a much better chance of success if you do!\n\nYou had a 10 percent chance of winning that battle.", "action_results": []}]}, {"action": "Take a stand, open the door, and attack. The police!", "result": "You decide that if they are going to take you down, you are going to go down in a blaze of glory. You take a moment to rig a quick explosive on the back of the door and step away from the door. You take cover behind the corner of the bathroom and wait. When they strike the door one more time, the explosive goes off, blowing the door off the hinges and towards the hallway. You step around the corner, staying low, gun at the ready to fire at anything that moves...", "action_results": [{"action": "Continue...", "result": "Looking over at the door, it takes a moment for the dust to clear. You don't see anything moving, so you stand up and stare into the dust. You step towards the door, trying to make out the figures in the dust cloud when suddenly guns open up firing in your direction. You turn and twist and attempt to get back under cover as a bullet finds your back, spinning you around. A second round hits you in the chest and you crumble to the ground, as everything quickly fades to black.\n\nSorry, it would appear that you have lost. Please do try again, especially if this is your first time. There are lots of different options and possibilities. Be sure to try acts that you have trained, as you will have a much better chance of success if you do!\n\nYou had a 10 percent chance of winning that battle.", "action_results": []}]}]}, null, null]}]}, {"action": "Go to the coffee shop and try to find your contact.", "result": "You decide to follow the map towards the contact and the coffee shop. From the airstrip, you drive around a few hills and in the direction of Havana. Driving down the hills, you see the city start to unfold in front of you and can easily follow the map towards the coffee shop.\n\nWhen you arrive, you notice there is plenty of parking and not that many cars around. Instead there are a number of people on mopeds and motorcycles and a few older cars. There are a few small delivery trucks driving around as well. You find a space on the side of the street and park the car.\n\nYou wait in the car for a few moments and watch the people around you. Most of the people around appear to be in a hurry, or at least have a purpose. Across the street there are a number of round tables with umbrellas outside the coffee shop where you are to meet. There are two couples sitting at tables there, drinking coffee and a single man with blonde hair and a bushy mustache sitting by himself. You guess that he must be your contact.\n\nTaking one last look around, you step out of the car. You pause to let a mule pulling a wagon travel along the road before you cross towards the coffee shop. It appears that there is no one else watching as you make your way across the street. You walk up to the blonde man sitting alone.\n\nYou say:", "action_results": [{"action": "How's the coffee?", "result": "Very suddenly, the man jumps to his feet, knocking the chair he was sitting in to the ground behind him. As it clangs into the ground, his hands rise up, one with a fork and one with a dinner knife. You turn your hips and move quickly to avoid the very sudden slash with the knife across your midsection.\n\nThe man moves cautiously with his knife held out in front of him. As his feet shift on the ground, you realize that he looks quite skilled with the improvised weapon. Your mind travels back to your training in the warehouse and you carefully watch the knife, his arm, and his eyes. You are not sure what he will do next, but he is clearly watching you carefully, looking for an opening.\n\nThe two other couples at the cafe get up and scramble away from the tables and chairs. You do not take your eyes from the now armed man in front of you. A serving platter crashes to the ground as a waiter appears and then quickly runs back into the restaurant. You know it will not be long before he summons help in the form of the local police, who you probably do not want to meet right now. The man circles and moves towards you and you can tell he is about to make another strike with the knife.", "action_results": [{"action": "Wink at the man and try to talk your way out of this fight!", "result": "You look at the man and try to calm him down. You speak in a soothing tone, like you have been taught. You try and show him that you are no threat to him. You even back up a little, trying to show him that you're not out to kill him...at least not right now.", "action_results": [{"action": "Continue...", "result": "The man continues to sweat and you see his face redden as you speak to him. Instead of moving away from you, as you back up, he slowly moves up and closes the distance with you. You continue to hold your hands up and attempt to talk him down. Very suddenly he moves in and stabs your hand! The pain startles you and you move your arm, giving up your defenses. The man sees this and before you can react, he drives through your arms and stabs you in the chest. He lets go of the knife as you slip to your knees. He turns and runs, disappearing into an alley next to the coffee shop.The world around you gets dimmer as you drop to the ground. You can hear sirens in the distance, but they are getting more quiet as you decide you will close your eyes and rest, just for a moment. I am sorry, but it would appear that you have died.\n\nYou had a 10 percent chance of winning that battle.\n\nPlease do feel free to try again. To increase your chance of success, be sure to use a skill that you have trained or have items to help you.", "action_results": []}]}, {"action": "Dodge the attack and try to move through the furniture to avoid the man.", "result": "As the knife comes towards you, you duck and turn. You quickly scramble under the nearest table, hoping to get out of his reach and to the far side. You roll around a downed chair and jump to your feet, ready to avoid this fight at all costs.", "action_results": [{"action": "Continue...", "result": "You roll and jump to your feet on the other side of the table. Unfortunately, the man was anticipating your move, and he has come around the table. As you scramble to your feet, moving away, you feel a sharp pain in your back. You reach around, but cannot reach the location -- the man has stabbed you in the ribs. You try to get to your feet, but the strength is quickly leaving your body.The world around you gets dimmer as you drop to the ground. You can hear sirens in the distance, but they are getting more quiet as you decide you will close your eyes and rest, just for a moment. I am sorry, but it would appear that you have died.\n\nYou had a 10 percent chance of winning that battle.\n\nPlease do feel free to try again. To increase your chance of success, be sure to use a skill that you have trained or have items to help you.", "action_results": []}]}, {"action": "Stand and take the hit, then punch the man in the throat.", "result": "You see the blade coming, and you move towards it, hoping to surprise the man. By cutting off his expected flow, you imagine that he will not be able to slide into you where and when he expected. You cock your arm back, ready to knock him to the ground when he misses.", "action_results": [{"action": "Continue...", "result": "The man stabs with his knife and his face shows surprise when you move towards him. Instead of stabbing you, the knife hits nothing but the space behind you as his arm strikes you. You react quickly and punch the man in the throat. You hear the knife clatter to the ground behind you as the man gasps for breath. You move quickly and pick up the knife. When you turn back you see the man has run off and has headed down an alley next to the coffee shop.\n\nLooking around, you see that there is no one else in the area, others have cleared out. In a second-story window you see a woman staring out the window at you, her arms crossed. You hear the sound of sirens in the distance and figure you should get moving. There is an alley near the coffee shop and you take off down it at a run, deciding the only place you can head now is the hotel.\n\n\nNote: You had a 90 percent chance of winning that battle.", "action_results": [null]}]}]}, {"action": "Is the coffee any good here?", "result": "The man replies, \"It is good, but not as good as Kenyan coffee.\"\n\nYou say:", "action_results": [{"action": "But I like Kenyan tea.", "result": "The man looks nervous at your response and you can see sweat suddenly break out on his forehead. He looks around at the street and quickly glances up and down the street. He slowly slides his chair back from the table and continues to glance around. He looks back at you and rises to his feet. He fiddles with his cup and his napkin for a moment, looking down, then moves suddenly.\n\nHe shoves his cup off the table and it crashes onto the floor. He makes a move in your direction and you tense up in defense. Then he shifts and moves to the side, quickly running past you. He knocks a chair over as he reaches the street and takes off at a run down the street before you can stop him. The two couples at the other tables look over at you, as if waiting for you to explain the man. You look after him and shrug your shoulders.\n\nIn a moment his has vanished from sight. After a pause, the two couples go back to their conversations, ignoring the man and you. Looking around, you don't see anyone else that appears interested in you or the man. With your contact gone, you are not sure what you should do next. You look at the man's abandoned table, but then decide to go back to your car.", "action_results": [null]}, null, {"action": "Ah, but Kenyan is too expensive.", "result": "The man looks around and gestures to the seat across from him. He makes a motion for the waiter and the waiter quickly shows up with some Cuban coffee. The man takes one more look around and then speaks, \"We should be safe here, but you never know. Our target's employer has many friends in many places. Do not speak anything other than what you have to. Use no names at any time.\"\n\nHe says, \"I know few details. It is best that way. I know little of why you are here, but I know some. I do not know your mission, so do not bother asking me any questions. Instead, I am here to offer you assistance. I cannot help you with the mission itself, I do not know the details. I am simply here to offer you an item to aid you with, well, whatever it is that you're going to do.\"\n\nHe pauses once more then, continues, \"I can provide you with a suit. Not just any suit, but a top-notch, custom-fit Italian suit. They already know your size, so that can be provided quickly. It might help you should you try and talk your way past anyone or anything. I also have a box of, well, gadgets. It contains a number of different items that might help you with alarms, locks, and other such things. Or, if you would rather, I can get you a few weapons.\"\n\nHe checks to be sure no one else has approached and continues, \"Not a great deal of weapons, as these are hard to get here, but enough to do what you need. Don't tell me what you need them for, just let me know if that's what you need.\"\n\nHe gets to his feet and drops money on the table to pay for the coffee. He says, \"Tell me what you need and I will ensure it is at your hotel room. Do not delay, the longer you are here in the open, the more likely it is that the secret police will spot you and decide they want to know more about you. So what do you want?\"", "action_results": [{"action": "Tell him that you want the suit.", "result": "You tell the man what you want. He nods and quickly moves away from you, hailing a cab and disappearing into the cab before you have a chance to ask him any additional questions. With no other clear options, you decide to head to the hotel Melia Habana. You head in the entrance of the luxurious hotel and head to the counter. As you approach, the bellhop runs up to you and says, \"Ah, Mr. Smith, you have been expected.\"\n\nHe leads you to the counter where the hotel attendant hands you a key card for a room on the top floor. As you turn to head to the elevator, the bellhop says, \"Yes, and there was a package left here for you as well. I will bring it up and meet you at the room.\"\n\nYou enter the elevator and ride to the top floor. As promised, the bellhop has somehow arrived on the floor of the hotel before you. He leads you to the room and opens the door for you. Before you can enter, he hands you a package.\n\nThe package contains a quality suit, just as your contact had described. You step into the room and then into the bathroom to put the suit on. As he promised, the suit fits you perfectly. Looking in the mirror, you can tell that anyone who sees you in this suit will be impressed.", "action_results": [null]}, {"action": "Tell him that you want the gadgets.", "result": "You tell the man what you want. He nods and quickly moves away from you, hailing a cab and disappearing into the cab before you have a chance to ask him any additional questions. With no other clear options, you decide to head to the hotel Melia Habana. You head in the entrance of the luxurious hotel and head to the counter. As you approach, the bellhop runs up to you and says, \"Ah, Mr. Smith, you have been expected.\"\n\nHe leads you to the counter where the hotel attendant hands you a key card for a room on the top floor. As you turn to head to the elevator, the bellhop says, \"Yes, and there was a package left here for you as well. I will bring it up and meet you at the room.\"\n\nYou enter the elevator and ride to the top floor. As promised, the bellhop has somehow arrived on the floor of the hotel before you. He leads you to the room and opens the door for you. Before you can enter, he hands you a package.\n\nThe package contains a briefcase. You set the briefcase down and open it. Inside you find a number of gadgets that look like they came from the set of James Bond. Certainly these tools will help you with locks, security, or any other such activities.", "action_results": [null]}, {"action": "Tell him that you want the weapons.", "result": "You tell the man what you want. He nods and quickly moves away from you, hailing a cab and disappearing into the cab before you have a chance to ask him any additional questions. With no other clear options, you decide to head to the hotel Melia Habana. You head in the entrance of the luxurious hotel and head to the counter. As you approach, the bellhop runs up to you and says, \"Ah, Mr. Smith, you have been expected.\"\n\nHe leads you to the counter where the hotel attendant hands you a key card for a room on the top floor. As you turn to head to the elevator, the bellhop says, \"Yes, and there was a package left here for you as well. I will bring it up and meet you at the room.\"\n\nYou enter the elevator and ride to the top floor. As promised, the bellhop has somehow arrived on the floor of the hotel before you. He leads you to the room and opens the door for you. Before you can enter, he hands you a package.\n\nThe package contains an ammo box. Opening it up, you see a small .22 caliber pen gun, a small concealable pistol, ammunition, and a small radio-controlled bomb. Certainly these things will help you if you need to bring violence on anyone.", "action_results": [null]}]}, null]}, null, null]}, {"action": "Search the vehicle, just to be safe.", "result": "You climb out of the car and head for the rear of the vehicle. You fumble with the keys a moment, then find the one that appears to open the trunk. The key fits and the trunk opens with a loud thump. The springs are old, so you have to push the trunk lid up to get it to open.\n\nInside the trunk is old and quite dusty. Most of the inside is covered with dust and the spare tire looks like it doesn't have any air in it. There are three items that look brand new without a drop of dust: a clothing bag with an elegant black suit, a briefcase that is full of a number of different mechanical and electrical parts, and a large ammo box with weapons and ammunition.\n\nBefore you can start looking through the items, you catch some movement out of the corner of your eye. Looking back down the long dirt road, you can see a dust trail rising. The sound of a military Jeep can be heard echoing across the runway. The Jeep is headed down the road towards you and there doesn't appear to be anywhere else it could be going, except where you are. You have only a moment before you need to get away, so you can grab one item from the trunk now, and then you must get into the car and drive.", "action_results": [{"action": "Grab the clothing bag so you can have the fancy suit.", "result": "You jump back into the car and turn the key. The car starts right up again and you back out of the parking space. The Jeep continues to head in your direction, you're not sure if they have spotted you yet. You take off the in car and head in the opposite direction, down the dirt road. As you drive, you leave a large cloud of dust and you realize the occupants of the Jeep have seen you!\n\nYou speed up and hope the road isn't a dead end. The dirt road is mostly straight, but starts to turn after half a mile or so. The road leads through some brush and low trees and heads for the buildings of a city. You struggle to keep the car on the dirt road as it twists and turns, but you stay on the road. You are glad when you see the dirt road turns into pavement as it nears the town.\n\nYou slow down a bit when you read the pavement and the small buildings and houses, partially to stay on the road and partially to ensure you don't hit any of the people in the area. Looking back you can see the Jeep is farther behind you than you thought it would be. The tires on the car squeal as you take the turns on the road, putting more distance between you and the Jeep.\n\nYou slow down some more and continue to make a number of different turns passing houses and small businesses. There are a few people sitting around on the sides of the road that watch you as you pass. After a number more turns, you realize you have lost the Jeep. You pull over to the side of the road and consult the map.\n\nYou are somewhere nearing the center of downtown Havana. You can see the markings on the map for hotel Melia Habana. After a few moments, you can tell about where you are on the map now and you can see the roads that will lead you to downtown.", "action_results": [{"action": "Drive to the hotel Melia Habana.", "result": "You arrive at the hotel and take the suit with you as you head into the hotel. Looking at the suit, you can see that it is truly a quality suit. You know that you will look good in the suit and others will surely notice that as well. When you tell the counter help your cover name, they provide you with a key to a suite on the top floor. You take the elevator to the room and step into the bathroom to put on the suit. You do indeed look good and the suit fits perfectly.", "action_results": [null]}]}, null, null]}, null]}]}]}]}, {"action": "Walk up to the guard seductively and wink...", "result": "You move into the room and step to the left, trying to stay in sight of the guard. You smooth your shirt and nod in his direction. He spots you and tenses up. You raise your hands to show that you are not a threat to him and start complimenting him on his size and ability to guard...", "action_results": [{"action": "Continue...", "result": "You wave to the guard, holding your hands up. As you do, he unfolds his arms and holds the knife out in an attack posture. You talk to the man and attempt to keep him off-guard. You nod often, trying to get his to nod with you, to get him on your side. As you speak, you attempt to casually work your way around to the table. You compliment the guard as you reach behind your back and pick up the box. As you attempt to move back to the door, he steps in front of you. You work to talk your way past him, but as you move, he stabs out with the knife, splitting your ribs. You feel the pain as the knife goes through your chest and the tip stabs into your heart. You hear the box drop from your hands as you fall to your knees, your life quickly draining from your body.\n\nIt would seem that you have failed your challenge. In the high stakes world of spy vs. spy this means that you have been killed. This is not the best way to end this story, but sadly, this is how your story ends. Sorry about that! Thank you for reading! Feel free to try again.\n\nYou had a 10 percent chance of winning that battle.", "action_results": []}]}, {"action": "Run up to the guard, take the weapon and kill the guard...", "result": "You pause at the door, but then move quickly. You head straight at the guard. He spots you before you reach him and he starts to turn towards you. You reach out for the knife, attempting to take it from him before he can strike out at you...", "action_results": [{"action": "Continue...", "result": "You dash straight at the guard. He turns as you reach him, but before he can get the knife around, you grab his wrist. You both struggle for the knife and twist and turn. You grab his wrist with your other hand and pull, trying to twist the knife out of his hand. It is then that you feel a sudden pain in your back! The guard had another knife, and now that knife is stuck in your back. You let go and reach back for the knife and the guard stabs you in the ribs with the larger knife. You don't know whether to reach for the knife in your chest or your back, but it doesn't matter as your life quickly drains from your body.\n\nIt would seem that you have failed your challenge. In the high stakes world of spy vs. spy this means that you have been killed. This is not the best way to end this story, but sadly, this is how your story ends. Sorry about that! Thank you for reading! Feel free to try again.\n\nYou had a 10 percent chance of winning that battle.", "action_results": []}]}, null]}]}]}, {"action": "Charm training", "result": "The man takes you to a wardrobe that sits in the corner of the warehouse. He starts pulling out different types of clothes and shows you how and why they are different from one another. He shows you different types of materials and styles of shirts and suits and explains when and where the different types should be worn and who they will impress. He spends some time showing you how you send messages non-verbally and how to focus those messages so you are more clearly communicating with someone, even when they don't realize it.\nThe man looks at you and says, \"We are out of time. You are either ready or you are not ready. And that is what we will determine now.\" He turns and walks over to a door in the rear of the room and disappears through it. You are alone in the large warehouse, wondering if you were supposed to follow the man.\nYou have trained the following levels of skills:\nStealth: 2\nCharm: 1\nWeapons: 0", "action_results": [null]}, {"action": "Weapons training", "result": "The man leads you to a table along the side of the wall of the warehouse. The table has a number of small weapons on it and some other devices that you cannot recognize. He shows you how the smaller weapons work and how you can make them on your own. He shows you a number of the other devices and how they can be combined to make different types of explosives that can be used for different purposes. He explains how to focus and aim both the improvised devices and the explosives so that you do not get hurt yourself.\nThe man looks at you and says, \"We are out of time. You are either ready or you are not ready. And that is what we will determine now.\" He turns and walks over to a door in the rear of the room and disappears through it. You are alone in the large warehouse, wondering if you were supposed to follow the man.\nYou have trained the following levels of skills:\nStealth: 2\nCharm: 0\nWeapons: 1", "action_results": [null]}]}, {"action": "Put your hands up and compliment the man.", "result": "You brace yourself for another slap, and open your eyes when you see that he's not going to slap you right away. The man says, \"That's a good start. Always work with compliments, because nearly everyone, even trained spies, respond to compliments.\" He spends a bit more time telling you different ways to give the compliments and how to really sound sincere. He gives you some tips on what kinds of compliments tend to work in different situations and how you can talk yourself out of nearly any bad situation.\nThe man looks at you and says, \"We have time for just one more training session. I can teach you more details about what you already know, or I can teach you a different skill, the choice is up to you. And yes, there is going to be a test at the end of this. It will be a real test, and you might not survive. But I hope you do. So what do you select for you final training?\"", "action_results": [{"action": "Stealth training", "result": "The man leads you over to a large table along the wall of the warehouse. Spread out across the table are a number of different types of gadgets and devices. He takes the time and shows you how to use some simple items to pick a lock and how to disable a security system. He shows you how you can use some of the gadgets to help you distract people and allow you time to move about without being seen or heard. He shows you simple ways to break into place and more difficult ways to bypass security systems and other types of systems designed to keep you out.\nThe man looks at you and says, \"We are out of time. You are either ready or you are not ready. And that is what we will determine now.\" He turns and walks over to a door in the rear of the room and disappears through it. You are alone in the large warehouse, wondering if you were supposed to follow the man.\nYou have trained the following levels of skills:\nStealth: 2\nCharm: 1\nWeapons: 0", "action_results": [null]}, {"action": "Charm training", "result": "The man takes you to a wardrobe that sits in the corner of the warehouse. He starts pulling out different types of clothes and shows you how and why they are different from one another. He shows you different types of materials and styles of shirts and suits and explains when and where the different types should be worn and who they will impress. He spends some time showing you how you send messages non-verbally and how to focus those messages so you are more clearly communicating with someone, even when they don't realize it.\nThe man looks at you and says, \"We are out of time. You are either ready or you are not ready. And that is what we will determine now.\" He turns and walks over to a door in the rear of the room and disappears through it. You are alone in the large warehouse, wondering if you were supposed to follow the man.\nYou have trained the following levels of skills:\nStealth: 1\nCharm: 2\nWeapons: 0", "action_results": [null]}, {"action": "Weapons training", "result": "The man leads you to a table along the side of the wall of the warehouse. The table has a number of small weapons on it and some other devices that you cannot recognize. He shows you how the smaller weapons work and how you can make them on your own. He shows you a number of the other devices and how they can be combined to make different types of explosives that can be used for different purposes. He explains how to focus and aim both the improvised devices and the explosives so that you do not get hurt yourself.\nThe man looks at you and says, \"We are out of time. You are either ready or you are not ready. And that is what we will determine now.\" He turns and walks over to a door in the rear of the room and disappears through it. You are alone in the large warehouse, wondering if you were supposed to follow the man.\nYou have trained the following levels of skills:\nStealth: 1\nCharm: 1\nWeapons: 1", "action_results": [null]}]}, {"action": "Run to the van and look for a weapon, maybe a tire iron.", "result": "Your ears are still ringing as you run around the rear of the van and do indeed find a tire iron right inside the back doors. You grab it and turn around to see the man standing there, nodding his head. He reaches out and adjusts your grip on the tire iron, explaining why holding at the different location can give you better leverage. He also shows you a number of other different, common items in the back of the van that could be used as quick, improvised, and deadly weapons. He shows you a few places to strike people that will work better to stun or disable them long enough for you to escape, should the need arise.\nThe man looks at you and says, \"We have time for just one more training session. I can teach you more details about what you already know, or I can teach you a different skill, the choice is up to you. And yes, there is going to be a test at the end of this. It will be a real test, and you might not survive. But I hope you do. So what do you select for you final training?\"", "action_results": [{"action": "Stealth training", "result": "The man leads you over to a large table along the wall of the warehouse. Spread out across the table are a number of different types of gadgets and devices. He takes the time and shows you how to use some simple items to pick a lock and how to disable a security system. He shows you how you can use some of the gadgets to help you distract people and allow you time to move about without being seen or heard. He shows you simple ways to break into place and more difficult ways to bypass security systems and other types of systems designed to keep you out.\nThe man looks at you and says, \"We are out of time. You are either ready or you are not ready. And that is what we will determine now.\" He turns and walks over to a door in the rear of the room and disappears through it. You are alone in the large warehouse, wondering if you were supposed to follow the man.\nYou have trained the following levels of skills:\nStealth: 2\nCharm: 0\nWeapons: 1", "action_results": [null]}, {"action": "Charm training", "result": "The man takes you to a wardrobe that sits in the corner of the warehouse. He starts pulling out different types of clothes and shows you how and why they are different from one another. He shows you different types of materials and styles of shirts and suits and explains when and where the different types should be worn and who they will impress. He spends some time showing you how you send messages non-verbally and how to focus those messages so you are more clearly communicating with someone, even when they don't realize it.\nThe man looks at you and says, \"We are out of time. You are either ready or you are not ready. And that is what we will determine now.\" He turns and walks over to a door in the rear of the room and disappears through it. You are alone in the large warehouse, wondering if you were supposed to follow the man.\nYou have trained the following levels of skills:\nStealth: 1\nCharm: 1\nWeapons: 1", "action_results": [null]}, {"action": "Weapons training", "result": "The man leads you to a table along the side of the wall of the warehouse. The table has a number of small weapons on it and some other devices that you cannot recognize. He shows you how the smaller weapons work and how you can make them on your own. He shows you a number of the other devices and how they can be combined to make different types of explosives that can be used for different purposes. He explains how to focus and aim both the improvised devices and the explosives so that you do not get hurt yourself.\nThe man looks at you and says, \"We are out of time. You are either ready or you are not ready. And that is what we will determine now.\" He turns and walks over to a door in the rear of the room and disappears through it. You are alone in the large warehouse, wondering if you were supposed to follow the man.\nYou have trained the following levels of skills:\nStealth: 1\nCharm: 0\nWeapons: 2", "action_results": [null]}]}]}, {"action": "Agree to charm training.", "result": "Whap! The man slaps you in the face and your cheek stings. You blink your eyes as you consider what just happened and the man says, \"Well? Now what? How do you react? What are you going to say next?\"\nYou aren't sure that you like this method of training. You assume that you're supposed to do something, but you don't really know what. You figure if you're going to continue this training that you need to at least move away from this crazy man who is attacking you. But then maybe that is the point -- to learn by doing. This seems a little odd because you haven't actually been given, well, any instruction at all, but you don't have a lot of choice at this moment. You don't have a lot of options here in the open space of the warehouse, but you do have some choice...", "action_results": [null, null, null]}, {"action": "Agree to weapons training.", "result": "Blam! Your ears ring as the man fires a gun right next to your head, striking the van behind you. His lips move, but you're not quite sure you can hear what he is saying, all you can hear is the ringing in your ears from the shot.\nYou aren't sure that you like this method of training. You assume that you're supposed to do something, but you don't really know what. You figure if you're going to continue this training that you need to at least move away from this crazy man who is attacking you. But then maybe that is the point -- to learn by doing. This seems a little odd because you haven't actually been given, well, any instruction at all, but you don't have a lot of choice at this moment. You don't have a lot of options here in the open space of the warehouse, but you do have some choice...", "action_results": [null, null, null]}, {"action": "Agree to nothing and demand more answers.", "result": "The man's eyebrows rise as you refuse to cooperate. He takes a step back and looks you up and down. He says, \"You sure do think highly of yourself, don't you? Why don't you take a look around.\" He gestures around the large, empty, blank warehouse before continuing, \"Do you know where you are? No, you don't, do you? You have no idea where you are, no idea how you got here, and no idea who I am. I don't think you are in a position to be making demands.\"\n\nHe walks up to you and pokes you in the chest, hard. He says, \"I'm in charge here. You are no one. You are nothing. And this isn't about you, anyway. This agency is charged with making people safe, and we're going to make people safe, no matter the cost. And getting rid of you won't bother me in the least, we'll go find someone else who can help us.\"\n\nHe crosses his arms and looks at you one more time, saying, \"So here's your choice -- you either agree to get some simple training before we send you out where you might get killed, or you get out now. This isn't the police, you don't have any rights. You simply have a choice to decide to cooperate with me and get a few skills, or I'll give you one last chance to wimp out and go home. Make your choice now.\"", "action_results": [null, null, null, null]}]}]}, {"action": "Wait for the tow truck...", "result": "You are standing in town next to your car with a flat tire. A car drives past every now and then, but there's not a lot of activity going on right now. The clouds have started to break up, but it would be a stretch to call it a sunny day yet. At least it's not hot.\n\nThere are two store fronts here where you are standing, a Mailboxes, etc., and a local coffee shop. There is no one in the Mailboxes store, but there are a few different people wandering in and out of the coffee shop, like any other day in any other town.", "action_results": [{"action": "Go into Mailboxes, etc...", "result": "You find yourself inside the lobby of a 24-hour Mailboxes Etc. store. At the moment, there appears to be no one here. There is a counter with a number of ads and hand-written papers advertising discounts for various types of mailboxes and terms. There is even a scale for weighing mail. On the side wall is a slot labelled \"Outgoing mail.\"\n\nThe floor here is, well, old. It looks like the linoleum floor was once white, but it is a strange grey-brown at the moment, and near one corner is a pile of something that, well, you don't even want to think about what it might be.\n\nOn all the other walls of the room are various mailboxes from very tiny boxes that appear to only hold a letter or two; up to boxes that look so large that you think you might be able to climb inside.", "action_results": [null]}, {"action": "Go into the coffee shop...", "result": "As soon as you walk inside the coffee shop, the aroma of fresh coffee assaults your senses. There is a long counter along the left side of the small shop and a few small tables to the right. There are a few round tables along the right side of the room, not all of them empty. There is a small man with a thin beard typing at an old laptop computer, ignoring the room around him.\n\nBefore the door shuts, you hear the squeal of tires. A taxi has pulled up outside and the passenger door swings open. The driver is gesturing at you to get inside. You look around to see if he is talking to someone else, but there is no one else looking at him, he is clearly trying to get you to go in the taxi with him.", "action_results": [{"action": "Get in the taxi...", "result": "The taxi accelerates quickly away from the coffee shop before you have time to put on your seat belt or even close the door. The door slams as the cab turns left in another squeal of tires. Looking around, you see the cab looks used and smells used, too. As the car turns another corner at high speed you notice that the place for the cab driver's name is empty.\n\nAny attempts to speak with the driver of the cab are completely ignored as the driver concentrates on the road. You spend most of the trip trying to stay in your seat as the car accelerates, turns corners, and slams the brakes on faster and more often than any car you've ever been in.\n\nSuddenly the car stops, almost throwing you on the floor. The driver does not turn around. Your door is opened from the outside by a red cap. A red cap? Yes, as you step outside of the cab you realize that you are at the airport. The red cap talks to the driver a moment, then the cab speeds away.\n\nWith no idea what else you are to do, you head inside the airport with the flow of people. You can see baggage checks and ticketing lines, but you have no bags, and you are sure you don't have enough money to pay for a ticket. You wander around a little, but then realize the entire place is focused on getting on a plane, so you are eventually pushed towards the TSA security area by the crowd.\n\nLooking around, you realize you do not have a lot of options here. You can try and sneak past these TSA agents, knowing that many of them barely have a high school education; or you can just stay in the line with the rest of the people moving slowly towards the security check.", "action_results": [{"action": "Continue and attempt to board the plane...", "result": "You walk up to the TSA guard, your hands empty. He looks up at you, finally realizing that something is wrong. \"Hey, what the hell? What are you trying to pull here?\"\n\nHis tone of voice attracts a few more of the blue-gloved guards. They gather around you quickly and one says, \"Hey, do you want me to search him good?\" They look from one to the other, unsure of what to do. Finally, a taller man, clearly the one in charge comes over and says, \"What are you morons doing standing around? We need to keep this line moving. You know the rules. Anyone who doesn't have a ticket doesn't get through.\"", "action_results": [{"action": "Continue...", "result": "You are quickly shoved and pushed. Before you can react, your hands and arms are grabbed by half a dozen pairs of blue gloves. Your hands are pulled behind your back and zip ties are quickly put in place, locking your hands behind you. \"Let's go,\" you hear, as you are shoved from behind almost hard enough to knock you over.\n\nYou stumble forward and keep your feet as you are led to an elevator. Six TSA guards get on the elevator with you like they expect you to attack one of them and create a national security incident. They look smug, like they are proud to have captured you. The elevator moves down into the ground for a few floors -- more than you thought were in the airport. When the door opens, you see nothing but old grey walls all around the plain hallways.\n\nThey walk you down the hallway underneath bare light bulbs and exposed pipes. One guard walks ahead of you and open a large steel door on the right hallway. He roughly shoves you in the room and says, \"Welcome to TSA jail.\"\n\nThe door slams behind you and you sit in the dimly lit room. There is a bare metal toilet here and a simple bench for you to sleep on.\n\nSorry, but that's all there is for this path! You're stuck in TSA jail.", "action_results": []}]}, {"action": "Attempt to sneak past the TSA guys...", "result": "You wait for the right moment, then move to sneak around the outside edge of the TSA security check area. You move slowly, then try to look like you know what you are doing. You manage to make it around the inattentive guy checking IDs of people and start to get past the shoe checker when you bump into a metal pole that makes the pathways, and it clangs to the ground, the ringing echoing along the hallways.\n\nOne of the bored TSA guys barely looks over and says, \"Hey, that machine is closed, you need to come over this way.\"", "action_results": [null]}]}, {"action": "Stay where you are...", "result": "You take a seat inside the coffee shop and the taxi drives away. You wonder what it could have wanted, and why you are suddenly seeing so much attention. As you look around the shop, a fellow typing on his old laptop looks up at you and glares at you before putting his nose back in the machine, the old keys clicking away as he types.\n\nThere is little traffic in and out of the coffee shop today, and you wonder when that tow truck will show up. Sometimes you think those tow truck drivers are on their own times and really don't want to help you out. Then you start to think about how much the tow is going to cost and you realize you really need to buy two tires now: one to replace the flat and another to replace the spare that you haven't had time to replace. This is really going to cost you.", "action_results": [{"action": "Continue...", "result": "The barista at the coffee shop glares at you since you have been there for some time and have not ordered any coffee. Yes, there are plenty of empty seats around, but that barista clearly doesn't want any freeloaders in the shop.\n\nFortunately for you, about that time the tow truck shows up. The diesel engine clatters and clanks as the bright orange lights spin on the top of the truck. The middle-aged man with the stained white t-shirt steps around to your car and quickly hooks it up to the flatbed of the truck. You head over towards him, but he gestures you back without a word. You ask if you can at least ride in the truck, but he spits on the ground near you and says, \"Company Policy.\" He climbs back into the truck and drives away, your car sitting firmly on his truck.\n\nYou look around the sudden silence and realize that now you're stuck in town with no car and no life. Then you realize that you're not even quite sure where the tow truck took your car. Just then there is a sudden boom of thunder and it starts raining. The rain is cold, so you turn up your collar and start walking home. At least you get to go to work again in a couple days...", "action_results": []}]}]}]}]}, {"action": "Check it Out...", "result": "You look out the window and you see a man standing there in a long coat and dark hat. He stands in the shadows -- you swear there used to be a bright light there outside your window. He gestures for you to come to the door and waits.\n\nYou open the door a crack, and you hear an old, cracked voice say, \"I came to pick you up. You're supposed to come with me.\" He turns and starts walking towards the stairs.", "action_results": [null, null]}]}, {"action": "Answer the phone...", "result": "You trudge over to the phone and pick it up. You say, \"Road-kill grill: You kill 'em we grill 'em\" (like you usually do). There is a moment of silence, then you hear a clearly computerized voice:\n\n\"Now is the time. The location is 841 South Dergible Road. Do you copy?\"\n\nYou pause for a moment and wonder what this could be about. Finally you stutter, \"I'm sorry, I think you have the wrong number.\"\n\nThe computerize voice replies, \"No. This is a direct line. The message is clear: now is the time. The location is 841 Dergible Road. Again, do you copy?\"\n\n\"I... I... I don't know what you're talking about.\"\n\n\"Repeating for the final time: now is the time. The location is 841 Dergible Road. Out.\"\n\nThe line immediately goes dead. You are standing in your living room, staring at a dead phone. You try to get the last number off the phone, but it doesn't show having received any call in the last two days. The address that was mentioned is only a few blocks from your apartment...", "action_results": [null, null]}]}, null, {"action": "Open up the box and look inside it...", "result": "You open the box and find a few items in it. There is nothing else in the box identifying the owner or source of the items.", "action_results": [null, null, null, {"action": "Throw away the box...", "result": "You are outside your apartment building.", "action_results": [null]}]}]}]}