{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=6376", "context": "", "first_story_block": "You look through the window from the observation room, down onto the Object placed at the heart of the chamber. Protruding from the walls are all manner of scientific gadgetry, so that the tests can be carried out remotely, and hopefully more safely, from the observation room.\n\nIt has been two and a half months of all manner of tests, such as bathing the Object in various forms of radiation, scanning it with all manner of sensors, trying tests in normal air and in a vacuum, and that sort of thing. So far, the Object has just sat there. It could continue to do nothing at all. It could just be a solid chunk of lifeless metal for all anyone knew. That's what you are beginning to think, anyhow.\n\nOf course, the Government and Military representatives were \"completely positive\" that something would happen eventually. And they got to monitor the tests from another facilitiy eighty kilometers away - just in case the Object happened to be a bomb of some sort. That was really reassuring for you.\n\n\"Come on, Jones, let's get to work,\" Hammond says, the doors to the observation room swishing shut behind him as he arrives.", "action_results": [{"action": "\"Sure. So, what are we going to do to it today?\"", "result": "\"Okay, we're doing Gamma Radiation today. Why don't you get us started, spin the dial to five, will you?\" Hammond says, leaning over one of the consoles, and peering through the window at the Object below.", "action_results": [{"action": "Turn the dial to five.", "result": "\"Here goes nothing,\" you say as you turn the dial to five.\n\nBoth of you look out through the window at the Object in the chamber beyond. A long mechanical arm unbends from the wall, with a large emitter on the end. It slowly powers up, and you watch a counter slowly tick up from zero. Invisible gamma radiation begins to bathe the Object from the emitter.\n\nAs the counter begins to pass four, something happens!\n\nThere is a flash of light, almost blinding your eyes, and then-", "action_results": [{"action": "(continue)", "result": "Hammond yawns, leaning back in his chair. \"Well, there goes another day of useless tests, Jones,\" he says.\n\n\"What the-\" you stammer, looking around you. The clock on the wall says it is early in the evening outside. You glance at the dial for the gamma radiation emitter, and it is turned off, set to zero. Out through the window, the Object just sits there doing nothing, as usual.\n\nHammond notices the look on your face, \"What's wrong?\"", "action_results": [{"action": "Tell him what happened.", "result": "\"Hammond, what just happened?\" you ask him, bewildered.\n\n\"What do you mean? We just completed another day of the same old boring tests that seem to have achieved nothing at all,\" he answers.\n\n\"You know what? I think something happened!\" you say, confusion giving way to excitement. Something was finally taking place!\n\n\"What are you talking about Jones?\" he says, tired and in no mood for games.\n\n\"The last thing I remember, I was turning the gamma radiation dial to five. The counter passed four, and there was a flash of light! The next thing I know, I was standing here and the day was over!\" you explain, bursting with excitement.\n\n\"Is this some sort of joke,\" he says, standing up, and getting his things, ready to go home. \"Look, Jones, we tested it for gamma, we zapped it with more x-rays, we doubled the air pressure, we tried to cut it open with lasers! Nothing happened, no lights, no sounds, no anything. Look, you're probably just tired, imagining things. There's nothing so boring as staring through a window at a block of metal that just sits there, for hours on end.\"", "action_results": [{"action": "Stick to your version of what happened.", "result": "\"I'm telling you Hammond, one moment we were standing there performing the test, the next it was the end of the day!\" you exclaim, beginning to feel angry. You're sure of what happened. At least, you think you are...\n\n\"Look, Jones, maybe you saw a flashing light, maybe not. It only takes a few minutes to run the gamma radiation test. If you want, we'll throw it back up to five and see what happens. Will that make you happy? Maybe then I can go home and get some sleep,\" he grumbles.\n\n ", "action_results": [{"action": "Perform the Gamma radiation test again.", "result": "\"Yes, Hammond. That would make me happy. Let's do the test again,\" you say.\n\n\"Okay, by all means. Turn the dial back to five,\" he says, shaking his head tiredly.", "action_results": [null]}]}, {"action": "Maybe you just imagined it?", "result": "You yawn. Actually, it does feel like you've been working for a whole day. Maybe Hammond was right, maybe you're just tired. Day after day of repetative tests could indeed make everything seem to blur together, after a while.\n\n\"Yeah, maybe you're right, Hammond. I guess I should drive home and get a good night's sleep,\" you say.\n\n\"Rest up, and I'm sure you'll feel better tomorrow,\" he says. \"Well, see you later then, I'm off.\"\n\nHammond puts on his jacket and heads home.", "action_results": [{"action": "Leave the Facility.", "result": "You grab your jacket, flick off the lights, and walk out through numerous corridors and doorways. Finally, after passing through two security checkpoints, you reach the garage. Taking your car keys out of your pocket, you hop into your Toyota Aurion V6. You sink into the comfortable seat with a smile. Ah, the perks of your job.\n\nSwitching the car on, you pull out of the multi-level garage, and head out onto the road. The Facility was mostly underground, but a large boxy building juts up from the barren surface. Your temporary home, for the duration of the tests, was a house the company purchased in a relatively modern country town an hour's drive away.\n\nIt's getting dark outside, but the sky is clear, the moon and stars bright above you. You flick on your headlights, and there is a flash of light as they turn on...", "action_results": [{"action": "Waking up to more confusion.", "result": "You wake in your bed, in a house that the company has purchased, about an hour's drive from the Factility. Stretching, you get up out of bed. What an odd dream... Something had happened out at the Facility, but you couldn't remember what. Dreams tended to be like that. You were in your car, or something?\n\nStretching your arms above your head, you bend to each side, stretching your aching muscles, then reach out and open the door to the ensuite.\n\nA fierce, hot wind assails you, and you stumble backwards, your sleepy limbs not prepared. For a moment you just stand there in your underwear in shock. Outside your bedroom, looking through what should be the door to your ensuite, was the desert! You glance out the bedroom window, and it's still there! Bleak, barren desert sands and rocks stretch off to the horizon. Where is the town? More importantly, where is the rest of your house!", "action_results": [{"action": "Step outside", "result": "Astonished and confused, you open your main bedroom door, to see more desert outside. You step outside, onto the hot sand, to see if it is real or an illusion.\n\nThe sand is hot beneath your feet, and you quickly step back inside. Perhaps you should get dressed first?", "action_results": [{"action": "Get Dressed", "result": "Your clothing lies scattered across the floor around your bed.\n\n(Click on objects to put them in your inventory)", "action_results": [null]}]}, null]}]}]}]}]}]}]}]}