{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=60747", "context": "", "first_story_block": "\"You look like you could use a drink, Captain.\"\n\nYou turn to see Victoria, your first mate. Her purple hair is tied back in a ponytail. It always seemed to be tied a little towards the left side of her head. The thought came up to question why, but you've learned from experience not to question a woman on her hairstyle.\n\n\"Way ahead of you, V,\" you say raising your cup from the bar top for emphasis.\n\n\"I'll have what he's having,\" she addresses towards the bartender.\n\n\"Got any news on The Sanguine?\" you ask.\n\n\"Yeah, boss, and it's not good. Procter is working on the repairs now. He said we might need the hull replaced.\"\n\n\"I sure hope not,\" you reply.\n\n“We've been through worse, Cap,” Victoria replies.\n\nYou take another sip from your cup. The latest job smuggling cargo for an English merchant paid well, but the damage sustained fleeing from a Spanish Galleon could very well cost the entire payout, or worse, put you in the hole. The wizard on board the Galleon hit The Sanguine with more than a few nasty spells. If Victoria didn't fire back with a perfectly aimed fire bolt, the entire ship might be at the bottom of the Caribbean.\n\n“I sent Freddy to find us some work,” you say to Victoria. “Did he come back with anything?”\n\n“Nothing yet,” she replies. “Although knowing Freddy, he probably got distracted by the nearest gambling hole.”\n\n“He always comes through in the end, despite his tendencies,” you reply.\n\n“What's next for you, Cap?” Victoria asks.\n\nYou finish the cup and slam it back down on the bar top. Sunlight pours into the poorly lit building through several open windows creating rectangular beams of yellow. You're reminded of the Caribbean heat each time a wave of warm air floods in. Your crew had certainly seen better days. The last three ships you targeted weren't carrying anything substantial. Your most recent job would have been a huge payday if not for the Galleon's attack. At least you managed to escape alive and with most of your crew. Victoria's former life as naval mage certainly came in handy there.\n\n“Cap?”\n\n“Sorry, V. I must have zoned out for a second. My plan is to...”", "action_results": [{"action": "Check on Procter", "result": "“...check on Procter. I need to see the extent of the damage we sustained.”\n\n“A wise choice, Captain.”\n\nYou toss a few coins onto the bar top, pick up your tricorn hat, and take your leave. The bright sunlight assaults your eyes as you enter into the open. The tavern is one of many upon a windy sloped path. Various vendors with small shops line the cobbled pavement. You pass by a group of marching soldiers and tip your hat towards their stoic, blank expressions. Tension between Nassau and the English occupation was at an all-time high. The governor's hold over the city had been steadily declining for years. Criminal activity only escalated with the diminishing control. Still, the English possessed the best firepower and wizards in their employ. Witnessing arcane power in addition to modern weaponry, you didn't think there would be much of a rebellion without outside help. Steel and gunpowder was vastly overshadowed by the power of the elements.\n\nAs you continue on the road down the hill, your mind drifts to your crew. Besides the common sailor, gunpowder monkey, and cannoneer, you have three main members to rely on. Each have their flaws, although they're the best in the business as far as you're concerned.", "action_results": [{"action": "Procter", "result": "Sometimes you weren't quite sure of Procter's sanity. Your quartermaster had an affinity for unconventional methodology. During one less-than-friendly encounter with a French brig, Procter had saved The Sanguine by impersonating the ship's captain, taking the helm, and shouting “arrête de poser tes bras!” The cannon barrage and fiery destruction from Victoria helped as well.\n\nYou had first met the sorcerer in Tortuga. The two of you shared a prison cell. He had been arrested selling watered-down ale to a group of French soldiers. Something about him had caught your eye, an obvious intelligence beneath the guise of quirkiness and social ineptitude. When Freddy broke you out, you took Procter along with you. His willingness to take the “smart” approach, despite the majority's disposition, is one of the many reasons you named him quartermaster.", "action_results": [{"action": "Victoria", "result": "There was no one you trusted more than Victoria, not even Freddy, when it came to getting things done. Your first mate had grown up among the nobility in London and attended the most prestigious schools. Her affinity towards arcane magic landed her a position within the Royal Navy as a naval mage, which is where you first met. You both served upon the HMS Eternity occasionally butting heads when it came to advising the captain. The two of you were considered Captain Newburry’s “right and left hands” and were the primary reason the ship survived as long as it did. You did find it frustrating that Newburry sided with Victoria more, probably since it’s hard to disagree with feminine beauty. Ironically, The Eternity went down under fire from the Spanish fleet, but not before you rescued Victoria’s unconscious body on a piece of floating debris.\n\nThe two of you had gone your separate ways and met later in Port Maje. Uncharacteristically, Victoria had threatened her superior officers after being placed under another incompetent captain. Things escalated, a building or two burned down, and she was dishonorably charged from the Royal Navy. Her expertise when it comes to naval warfare has saved The Sanguine countless times. Lately, she has been teaching you to master the arcane, which in combination with your roguish tricks has created quite the resourceful, and deadly, captain.", "action_results": [null, {"action": "Freddy", "result": "Your oldest friend, Freddy, was like your little brother. The charismatic bard and you had been running jobs as long as you can remember. The mutual lack of familial upbringing brought you two together on the streets of London. It started with small-time stuff: Freddy would scout for a wealthy target, and you'd “gently” ask them for a loan. Once things got a bit too hot between the two of you and a rival gang, you joined the navy together to escape a certain death.\n\nYou quickly rose through the ranks with cool-headed tactics and an ability to act under pressure. Freddy didn't quite have the same progression, but once you took command of your own small vessel, you told your superior officer it was contingent upon Freddy's involvement. Freddy's disposition towards authority caused more trouble than good, but there's no denying his persuasiveness and willingness to take risks. You've never encountered a luckier son of a bitch and you make sure he knows it.", "action_results": [null, null, {"action": "Continue on", "result": "You finally reach the bottom of the hill and continue towards the docks. The bright blue water of the Caribbean reflects a flash of sunlight in your direction, and you lower the tip of your hat in response. Upon the dock, fishermen and sailors ready their boats with supplies. A few soldiers stand watch in obvious distaste towards their duty in the scorching heat. You don’t understand why the military makes them wear the layered bright red uniforms, especially in the tropical heat. The uniforms are better suited towards the cloudy streets of London. It isn’t your place to correct the decision of the English military, but if it were up to you, you’d definitely adapt the uniforms to the surrounding environment.\n\nAfter passing a few fishing boats and a couple sloops, your view of The Sanguine is uninhibited. The dark oak body floats gracefully upon the clear ocean. Its double masts are like two aged trees rising above a clearing. The sails are in a raised position, and you long to see the white cloth full in the Caribbean wind. You hear Procter’s voice echoing from below deck.\n\n“Dag nabbit when is that lumber arriving?”\n\nEntertained by the quartermaster’s odd curses, you board the ship and head below deck. You see Procter’s skinny frame standing with his hands on his hips. Around him, sailors rush to follow his orders.\n\n“No, no, no! Roll the cannons completely out of the way before reinforcing. I won’t have this ship sinking on behalf of your shoddy workmanship,” he scolds towards a young-faced sailor.\n\n“Ah, Captain, glad you’re here,” he says noticing you. “Perhaps you can motivate these fellows with your captainly inspiration?”\n\n“You’re doing great work, men,” you say towards the workers. “Listen to Procter. He knows what he’s talking about and your efforts will end up saving us all.”\n\nTurning to Procter you add on, “How bad is it?”\n\n“Not good. That nasty wizard scorched the port-side to hell. I wish Victoria left him alive because I’d like to have a few words with him for the trouble it’s causing me.”\n\n“Spare no expense. Many ships have gone down because they were economical in their repairs.”\n\n“Aye, Captain. We’ll get The Sangy as good as new. Even better, probably, now that I’m heading it up. Your last man must’ve cut corners.”\n\n“Cut corners and tried stealing from us,” you reply. “He did decent work until his little detour walking the plank.”\n\n“I’m glad you mentioned the plank. I have a few ideas that might make it a better experienced for all involved. I’m thinkin’ we get a longer, narrower piece of oak and—“\n\n“—I’m going to have to cut you off there. First things first,” you say motioning towards the ongoing repair in front of you.\n\nA sailor suddenly interrupts your conversation, “I’m sorry to intrude, Captain, but there’s a man outside asking for you.”\n\nWith a reassuring clasp on the sailor’s shoulder, you head above deck.", "action_results": [{"action": "Above deck", "result": "The man, dressed in brown leather, leans impatiently against the railing. An arquebus hangs upon his back, a weapon outdated by current standards. The musket was far more typical a rifle. At least the cutlass at his left hip looked modern, if not prototypical. He fans cool air towards his face with his feathered hat.\n\n“Well met, Captain,” he speaks.\n\n“What can I do for you...?” you ask indicating for his name.\n\n“Dampier.”\n\n“What can I do for you, Dampier?”\n\n“I serve the honorable Woodes Rogers. He requests that you join him this evening to discuss business.”\n\n“What does that old privateer want with me?” you ask.\n\n“That is a matter between the two of you. I’m simply to offer an invitation for you to meet at his estate.”\n\nRealizing that you have no choice in the matter, you tell Dampier to inform Rogers of your acceptance. He replies with something along the lines of “he’ll be expecting you”.\n\nAt this point, your mind drifts towards the business Rogers wants to discuss, and the formality of the conversation flows without thought. Rogers is a prominent figure in the Caribbean and working for him could bring fortune for The Sanguine and her crew. Refusing his offer would make a powerful enemy and perhaps bring the crew to mutiny. You have no choice but to meet Rogers this evening.", "action_results": [{"action": "Woodes Rogers' estate", "result": "Rogers' estate must be the largest on Nassau. As his man, Dampier, welcomes you through the front gate, you can’t help but be mesmerized by the beauty of the finely trimmed flora, statues, and mansion. Someone of your nature always appreciates high-quality things, and can’t help but wonder at its worth. Several guardsmen patrol through the well-maintained garden keeping a close eye on their employer’s guest.\n\nThe mansion itself looks freshly built. There isn’t a single crack or flaw in the paint, and the roofing tiles are placed perfectly together. As you draw near to the front door of the building, you see two, obviously Spanish, sculptures upon either side of the entryway. The things you’ve heard about Rogers seem to be true. He made his wealth preying upon the Spanish fleet.\n\nYou follow Dampier into the mansion and to the dining room. Sitting at a long mahogany table, is Woodes Rogers. The table looks as if it can seat about twenty, and seeing a single man using it is almost comical. The first thing you notice about him, besides having a table too big, is the massive scar upon the side of his face. It looks as if he ate a bullet, and probably a Spanish one if you had to guess.\n\n“You know they have priests for that,” you say sitting down and gesturing towards your face.\n\n“Pointing out someone’s scar is hardly a way to begin a conversation,” he replies. “Oh well, since we’ve found ourselves here, I should explain myself. Yes, you’re right. Any priest worth his salt could heal a simple scar, but I would not have this one healed.”\n\n“Why not?” you ask.\n\n“I like what it represents.”\n\n“Getting shot?”\n\n“The reminder of mortality. At any moment, I could lose this life at the simple pull of a trigger.”\n\n“I’m sure there are other ways of reminding yourself,” you say. “Ways that are…more visually appealing. Marriage, for instance, comes to mind.”\n\n“I am already happily married, Captain. Sarah is back in England with my son and daughters. I did not ask you here to discuss familial matters.”\n\n“Of that, I am glad. I’d need a few more of these to get through that discussion,” you say holding up a dainty wine glass from the table.\n\n“What do you know of Blackbeard’s cutlass?” Rogers abruptly asks.\n\n“I know it’s probably lost at sea along with the rest of Queen Anne’s Revenge,” you reply. “I also know it was rumored to harness immense power. The kind of power that makes you the most feared man in the Atlantic…if you believe that sort of thing.”\n\n“I know where it is.”\n\n“Then why are you still here?” you retort.\n\n“Ha, fair point. I know where it’s supposed to be.”\n\nRogers pulls a map from his inner jacket and places it on the table. “Blackbeard was slain near the Carolinas far north of here,” he says placing a finger on the map.\n\n“I’m well aware of the geographic location of the Carolinas,” you say.\n\nIgnoring your comment he continues, “And what do you know of the Cult of Quetzalcoatl?”\n\n“Next to nothing,” you answer. “They’re ancient Aztecs obsessed with a wind serpent and dark magic.”\n\n“That’s more than most people know,” Rogers says. “My expeditions have discovered a smaller sect of the cult. Guardians of a powerful artifact supposedly forged from a scale of the wind serpent. Does this look familiar?”\n\nRogers pulls another object from within his coat and places it next to the map. He carefully unravels the scroll displaying the image. The entire image is different shades of charcoal. In the center stands a massive pyramid-shaped temple with an almost unending staircase upward. Storm clouds gather at the very top. Within the clouds, a snake-like creature can barely be seen. You have to squint to make out its shadowy form. Upon a pedestal, in the center of the image, lies a single cutlass.\n\n“Sweet mother Mary that’s—“\n\n“—Blackbeard’s cutlass,” Rogers finishes for you with a grin. Looking back to the map he continues, “Without an owner, the cutlass returns to its home where it waits for a worthy member to claim it. The ancient protectors believe whoever claims the cutlass is Quetzalcoatl incarnate.”\n\n“And you know where the home is?” you ask.\n\n“I do.”\n\n“Where?”\n“An island in the Gulf. Only visible by viewing with a Quetzalcoatl headdress. Luckily, my expeditions have uncovered one.”\n\n“So why do you need me?” you ask. “You seem to have everything that you need.”\n\n“Alas, I cannot leave Nassau now. I’m in the middle of a big proposal with England that will very likely result in governorship. If I were to disappear for weeks, all my work would be for nothing. I can’t afford to send one of my own men because I’m fearful a rival would catch on. I need an honorable captain with no ties and the ability to prevail in dangerous circumstances. I need you, captain.”\n\n“I suppose this is the part you make me an offer I simply can’t refuse,” you say.\n\n“Even better. I’m making you an offer you don’t want to refuse,” he replies. “I’m well aware of your ship’s condition and will finance the entire repair. Going a step further, I’ll finance the overhaul for any on-board improvements you see fit. You can keep whatever treasures you find just bring me the cutlass. Oh, and should you decide to accept my repairs and run, I’ll put a bounty so large on your head that every privateer and their mother will be out for your blood.”\n\n“Rogers, you have yourself a deal,” you say offering out your hand and a grin.", "action_results": [{"action": "Set sail", "result": "Woodes Rogers paid for everything Procter asked for down to the tiniest detail. Procter was overjoyed because he thought the ship’s wheel was “splintery.” When reminding him that he rarely touched the wheel, he simply responded “and my fingers shall stay unsplintered when I do.\"\n\nThe entire hull was replaced and reinforced. Rogers even paid for the employ of a wizard to cast protection seals over the hull, something that would come in handy if you crossed paths with another mage. The cannons were upgraded to the latest models. Likewise with the sails. After the overhaul, when asked if there’s anything else needed, you uttered three words: “Paint it black” much to the ironic amusement of Freddy.\n\nThe Sanguine must be among the best ships in the Caribbean now, definitely highest of its class. The schooner at full mast glides upon the water as if propelled by an underbelly of rowers. The blue sky overhead and the sparkling water endless, you travel towards the destination Rogers marked on your map.\n\nThe sea wind brushes your face as you look from your spot at the helm. In front of you, sailors man their positions to ensure their designated task is fulfilled. Procter makes sure of that. You see Freddy passionately engaged in conversation with an unlucky powder monkey who desperately wants to complete his work, but doesn’t want to risk offending the captain’s oldest friend.\n\n“Sails, Captain,” Victoria speaks from behind you.\n\nShe hands you the eyeglass allowing you to see. Upon the horizon, the faint image of a vessel appears. It’s still too far away to view its colors.\n\n“What do you say, V? Should we put our new toys to the test?” you ask.\n\n“Up to you, Cap.”", "action_results": [{"action": "Pursue the vessel", "result": "“Run her down,” you say.\n\n“With pleasure,” she replies. Shouting from the helm, she adds on, “Ready the cannons, and let loose the sails! We’ve found ourselves a prize!”\n\nThe crew cheers and get to work. The sails unfold and catch a gust of wind propelling The Sanguine forward. Sailors scramble to prepare for the upcoming battle placing cannonballs and muskets at an arm’s reach. Grappling hooks are put on both the port and starboard side for boarding.\n\nYou spin the wheel maneuvering the schooner towards its prey. The smoothness of the pegs allows you to spin it with ease. The Sanguine glides over a wave spraying misty water into the air. Within minutes you catch up to the vessel. Another look through the eyeglass reveals its colors: Spain.\n\n“Slow ‘em down with the forward cannon!” you command from the wheel.\n\n“Aye, Captain!”\n\nThe gunner loads the cannon that’s placed directly at the bow and fires it at the Spanish vessel ahead. The grapeshot tears through its mast tearing through rope, cloth, and sends splinters showering upon the seamen below. A hearty cheer echoes from the deck of The Sanguine at the first blow being dealt. With their sails compromised, you easily catch the ship.", "action_results": [{"action": "Give them the broadside", "result": "You guide The Sanguine alongside the Spanish ship. You can now see the name painted on the side: El Explorador. On board you see few soldiers, although the crew appears to be working under steady determination. Your initial assessment is they are hard-willed, but lack fire-power. Though the battle should be easily won, you’re smart enough to not disregard the strength of willpower, especially in a kill or die situation.\n\nAs the entirety of your starboard guns line up with El Explorador, Victoria gives the command. Orange-red fire blasts from the new cannons. The force of the firing causes each gun to recoil back. The cannonballs tear holes throughout El Explorador and send men flying overboard. You witness more than one unlucky sailor torn in half by a direct hit. As the smoke clears, your gunner teams work quickly to reload another round.", "action_results": [{"action": "Give 'em another round", "result": "“Give them another taste!” you shout from behind the wheel.\n\nThe crew cheers and follows your orders. They can almost taste the certain victory. Again, the fiery-red shots ring out raining destruction on El Explorador. A severe hole is punctured through their hull rapidly flowing water into the ship. Their crew desperately tries to handle the flooding, only making it easier for yours to cut them down.\n\nRealizing your firepower is much more than you anticipated, you shout to your crew, “Salvage whatever you can! The ship’s going under!\n\nThe deck of El Explorador is a chaotic mess as the remaining survivors are forced to protect their cargo or their lives. More choose the latter, although you witness some of your greedier crewman cut down in their attempt to plunder riches.\n\nEl Explorador sinks to the bottom of the Caribbean leaving behind scraps of wood and floating barrels. The Spanish crew desperately clinging to the floating remnants are offered a choice. Rescue and join the crew, or die. The majority join your crew.", "action_results": [{"action": "To the island", "result": "Several days later you arrive at the coordinates Woodes Rogers marked on your map. You order the ship to drop anchor.\n\n“There’s nothing here,” comments Freddy.\n\n“Ye of little faith,” Procter says.\n\n“What’s that supposed to mean?” Freddy asks.\n\nProcter offers a shrug as his reply.\n\n“Time to see if Rogers is correct about the Quetzalcoatl headdress,” you say opening the trunk that contains the ceremonial hood.\n\nInside, the red headdress lies neatly folded. You pull it out to get a better view. The main section of the headdress is a hollowed out skull with reddish-brown thread weaved to cover the upper torso. The entire back section is covered in feathers. The skull looks to be some sort of large lizard. Your first instinct was “dragon”, but the size is much too small for that. It looks to be a little larger than your own head, which is perfect for fitting your own head inside. Oddly enough, the eye holes have black cloth over them making it impossible to view the eyes of whoever wore the headdress.\n\n“Creepy. How much you wanna bet the previous owner sacrificed humans in that?” Freddy says.\n\n“I’d be surprised if the previous owner didn’t sacrifice people in that. The real wager is if he ate them after or not,” Victoria chimes in.\n\n“As far as I know, they aren’t cannibals,” you say. “Then again, I don’t know too much about them.”\n\n“That’s comforting…”\n\nYou slip on the headdress. It’s like the world is suddenly void of all color. The crystal blue water and fiery sky turn grey. Everything has a mistiness to it like edges aren’t defined and trail off into nothingness. Sure enough, you spot an island exactly where Rogers said it would be. The island itself isn’t that large, probably half the size of Nassau. In the center, a single temple rises above the rest of the island. Dark storm clouds encircle the temple. The thick tree line that lines the edges prevents you from seeing more of the island features. You turn to relay the news to the crew and startle – you no longer see your crew, but a mass of skeletons gathered around you.\n\nOne of the skeletons steps forward and clacks, “What do you see, Cap?”\n\n“More than I would like,” you reply.\n\nSatisfied you’re in the right place, you remove the headdress to gaze upon Victoria. Relieved at seeing flesh again, you give her arm a slight squeeze for reassurance.\n\n“Ow! What was that for?” she exclaims.\n\n“Just checking something,” you answer.\n\nAcross the sea, the island is still visible, even without the headdress on.\n\n“V, put on the hood and tell me what you see,” you say.\n\nShe does as you ask and looks towards the island.\n\n“Do you see it?” you ask.\n\nShe nods. Before she can turn back to the crew, you jump into her vision.\n\n“Ahh!” she shrieks and immediately removes the headdress.\n\n“Spooky huh?” you ask with a grin.\n\n“Damn it, that’s not funny,” she replies.\n\n“Not from where I’m standing,” Freddy says laughing.\n\n“Can you still see the island?” you ask Victoria.\n\n“Yes,” she replies pinching you back.\n\nYou order the crew to take turns putting on the headdress. All but Procter flinch at the sight of witnessing the bare bones before them. As the crew prepares the longboats for transport, you head to the captain’s quarters. Inside, you place your flintlocks on the table and start to thoroughly clean them. It wasn’t uncommon for the guns to misfire and you wanted to reduce the likelihood of that happening. Next, you place your sword and dagger on the table and take out your whetstone. You aren’t sure what dangers lie in wait, but you’ll be sure to be well-equipped for them. A knock at the door alerts you of the crew’s readiness. It’s time.", "action_results": [{"action": "Row to shore", "result": "You and Freddy take one longboat with six of the crew, and Victoria and Procter do the same with the other. Besides your three officers, you figure 12 men is the best number to bring. It’s not a large group, but the environment and unknown dangers make a small, nimble group preferable. On the other hand, it’s more than a few and with numbers comes firepower, not that Procter’s and Victoria’s spells are lacking in that category.\n\nYour boats land on the beach and you take in your surroundings. The white sand continues on an upward slope to the edge of the jungle. The dense trees block most light from the canopy preventing you from seeing further into the interior.\n\n“Procter. You’re up,” you say.\n\n“Stand back, men,” Procter speaks.\n\nAs the crew follows his command, he begins casting a spell. He whirls his hands in the air, too dramatically for the spell, and finishes by stretching his arms towards the longboats. Beside him, Victoria rolls her eyes at his performance. In a split-second the boats appear to vanish from sight, although you know that’s not the case. Procter reaches down and picks up two tiny objects: the longboats.\n\n“Oh no. Freddy is still on board!” Procter exclaims holding one of the boats up to his eye for examination.\n\n“Calm down, crazy old man. I’m over here,” Freddy answers from behind some of the crew.\n\nProcter then utters a sigh and places the miniature longboats within his jacket padding the outside for good measure. You feel the presence of someone. You turn to see three natives standing at the edge of the jungle. Their clothes look to be the same style as the headdress. Their robes flow a deep red in the sea breeze. The middle one is leaning on a large staff. The two his opposite have an arrow knocked in their bows. They aren’t pointing them at you, which is a good sign, although they look prepared to fire.", "action_results": [{"action": "Show you mean no harm", "result": "You raise your arms in the air and motion towards everyone to follow your lead. You walk towards the three figures putting on your friendliest face. The native in the middle, the one you rightly assume to be in command, remains stoic. His skin is dark and his lengthy black hair is tied back with beads.\n\n“Why have you come here?” he speaks with broken, but understandable enough English.\n\nArms still raised, you reply, “We are seeking an artifact of great power. The blade of Quetzalcoatl. We mean you no harm, but respectfully if you stand in our way, there will be blood.”\n\nThe mention of Quetzalcoatl disrupts the native. He beats his staff into the ground causing a slight shockwave. You feel the hairs on your arm rise at the magical energy released.\n\n“You would come to a sacred place and plunder its treasure? For what? There is a reason the blade is kept hidden.”\n\n“It’s not my place to decide the reason. I was hired to find the blade and I intend to do my job,” you say. After a slight pause you add, “It’s probably not a big secret where it is...after all, the entire island seems to be built around the giant temple. I’d bet my left barnacle the cutlass is there.”\n\n“We will not stop you,” the native speaks. “The blade will determine if you are worthy. Many have tried to wield it for themselves. Only Quetzalcoatl incarnate can wield it.”\n\n“Yeah and Edward Teach,” you mutter under your breath.", "action_results": [{"action": "Continue talking", "result": "You finally lower your arms confident the natives won’t attack. You ask, “Why have none of you tried to take the blade for yourselves?”\n\n“Some have tried. All have died in their attempt. Why would more try?” the native replies.\n\n“So you sit here guarding the blade. I must say your ways of ‘guarding’ are quite unconventional. It usually helps to keep outsiders, well, out to protect the thing you’re guarding.”\n\n“Finding the island is the first part in proving your worthiness to the blade. If one cannot answer the call, they are not worthy.”\n\n“Oh come on, I couldn’t have been the first person wandering here with one of your hoods. Hell, Blackbeard possessed the blade. Did he come here to prove his worthiness?”\n\nAt Blackbeard’s name, the natives drop to their knees and whisper prayers. The leader addresses you, “Quetzalcoatl takes many forms. It is not our place to question the Great Serpent. We only are to serve his wishes.”\n\n“And if he wishes for me to take the cutlass and leave?” you ask.\n\n“We will see if that is truly his wish,” the native replies with a crooked smile. You notice his canine teeth have been filed to sharpened points. A tribute to his god most likely.", "action_results": [{"action": "Make for the temple", "result": "As you gather the expedition crew, the leader of the natives approaches you.\n\n“Shipmaster, will you wait a moment?” he asks leaning on the staff. After seeing you pause, he continues, “There is a blight upon this island. A dark magic attempting to corrupt the divine power of Quetzalcoatl. Quetzalcoatl's twin brother, Xolotl.”\n\n“If Quetzalcoatl is so powerful, why doesn’t he simply destroy Xolotl? Isn’t this his island, the centerpiece of his power?” you ask.\n\n“I dare not try to understand the thinking of Quetzalcoatl,” the native answers. “Perhaps this is your test. If you prove yourself worthy and cure the blight, you may be the next coming of Quetzalcoatl. I ask something of you, shipmaster.”\n\n“Yeah, get on with it,” you answer.\n\n“Come with me to our village, it’s not far. There is someone I’d like you to meet. Someone who may be able to help you in your quest.”", "action_results": [{"action": "Go with him", "result": "“How could I refuse free help?” you reply. “Lead the way.”\n\nThe native, along with his two archers, leads you through the jungle. The jungle is dense, but the natives know the proper trails to follow. You can hardly see in front of you, and yet they don’t require machetes to navigate through the overgrowth. You arrive at a formation of crudely-constructed huts. Semi-naked children run through the streets chasing chickens, which brings a smile to Procter’s face. He joins them in the chicken-chasing, although he keeps his clothes on.\n\n“Alright, so who is it you’d like me to meet?” you ask the leader.\n\n“We’re almost there. Patience,” he answers.\n\nLeaving Procter behind, you follow the native into the largest hut. The hut itself is a large circular tent. You flip the twin flaps aside and confidently enter the tent. Candles line the interior. A group of natives sit criss-crossed in a circle. The leader walks straight into the center of the circle. You follow, although your crew hangs back near the entrance.\n\n“Are you ready to meet our champion?” your guide asks.\n\n“Bring him forth,” you reply.\n\nOne of the criss-crossed people stands up. She approaches you and the native. Similarly to your guide, she wears a red robe, although hers is tattered with several tears at the edges. She is unarmed, yet the muscular curvature of her arms suggest she is more than capable of fighting without a weapon. Despite her athletic build, it didn't seem to diminish her other womanly attributes. Her black hair hangs loosely to her mid back.\n\n“This is your champion?” you ask the native.\n\n“This is Quetzalli,” the native replies. “High priestess and champion of our people.”\n\n“Does the outsider require a demonstration?” Quetzalli asks. “A combat exhibition, perhaps?”\n\nSeeing her slight flex you reply, “No, I believe you.”", "action_results": [{"action": "Talk to Quetzalli", "result": "You eye her long black hair and the onyx beads at her neck.\n\n“So you’re the champion, huh? How’d that happen?” you ask.\n\nHer tanned arms cross against her chest. “And high priestess.”\n\n“Yeah, and that. Aren’t you kind of young to be in those roles?”\n\n“I am the youngest high priestess and the youngest champion ever recorded. No one’s ever been both before,” she says proudly.\n\nVictoria steps up and whispers in your ear. “Captain, I suggest you don’t woo and run out on this one, unless you want your barnacles ground to dust.”\n\nYou whisper back, “Thank you for your invaluable input, first mate.” Turning back to Quetzalli you ask, “How did you become champion?”\n\n“The champion can only be a son or daughter of our elders. I see you’ve met the chieftain, my father.” At his mention, you smile nervously at the native who brought you here. She continues, “If the village loses faith in their current champion, they can hold a trial of combat. Anyone who’s born of an elder, and blessed by the high priestess, can enter.”\n\n“Did you bless yourself?” you ask. Freddy snickers in the background.\n\n“I was not high priestess at the time. I defeated the other challengers and the current champion, my brother, and became Quetzalcoatl’s chosen.”\n\n“You took championship from your own brother? I bet he’s not happy about that,” you comment.\n\n“He wasn’t.”\n\n“Wasn’t?”\n\n“When a champion falls out of Quetzalcoatl’s favor, he makes a sacrificial offering to the feathered-serpent. By offering one’s life, a fallen champion can hope to gain honor back.”\n\n“Well, I wish you good luck in staying in favor,” you say.\n\n“If Quetzalcoatl wills it, I will be champion for a long time,” she says with a smile.", "action_results": [{"action": "Focus on the quest", "result": "“Now that you’ve met our high priestess and champion, we must discuss the blight,” the chieftain, Quetzalli’s father says.\n\nHe leads you back outside the tent and through the village streets. You pass by an accomplished-looking Procter holding a chicken affectionately to his breast. The dusty street continues out of the village passing the cluster of huts. It leads up a grassy hill where you see a lone tree at the top. The tree itself is blackened, as if it barely survived a fire. The overgrown grass surrounding the tree doesn’t look affected by the fire. At the top of the hill, you get a full view of the temple. Uninhibited by the jungle, the temple is larger than you thought. Its peak is almost to the clouds.\n\n“What do you see, shipmaster?” the chieftain asks.\n\n“The tree. It looks burned, although the area surrounding it gives no sign of a fire,” you reply.\n\n“Yes. This tree, and many of its seedlings, have fallen victim to Xolotl’s corruption.”\n\n“What do you suggest I do?” you ask. “I’m only here for the cutlass.”\n\nFor a split-second, a flash of yellow appears on the tree trunk like an eyelid opening for a brief moment.\n\nIgnoring the tree, the chieftain continues, “Many of our ancestors have tried to obtain the blade. None were Quetzalcoatl incarnate, but some were close to the blade…very close. With my daughter’s help, and the knowledge of our ancestors, I believe you can reach the cutlass and use its power to cure the blight.”\n\nYou realize this is probably your best chance at receiving the cutlass. There’s no telling the dangers that lie in wait wandering through the jungle. Still, you are slightly suspicious of the natives. Not because of the chieftain’s sharpened teeth, but because you’re skeptical of things seeming too good to be true. The chieftain offered a direct route to the cutlass, and put his beautiful daughter at your disposal? Yeah, you were a bit suspicious, although it’s still your best bet at reaching the temple.", "action_results": [{"action": "Consult with the crew", "result": "“Freddy, have you seen Procter?” you ask.\n\n“He’s still playing those kids and their chickens,” he replies.\n\n“At least that shows we’re not conquering invaders. I saw some of the natives give us the stink eye.”\n\n“True, but that doesn’t mean they won’t fire those nasty-looking arrows at us once they don’t need us anymore,” Freddy says.\n\n“I don’t know about that,” Victoria interjects. “Don’t you know the captain is their god in the flesh? What sort of people would fire arrows at their god?”\n\n“What sort of people sharpen their teeth?” Freddy retorts.\n\n“The natives seem friendly enough to me,” Victoria says. “They could have attacked us when we first arrived, instead they invite us into their village.”\n\n“All I know is I’m not turning my back on one of them. They are useful as long as they guide us to the temple,” Freddy says.\n\nWe’re in agreement then,” you conclude. “We’ll accept their help, tentatively. If they show any hint of betrayal, we’ll strike first. Let’s get on with it...and someone please get Procter.”", "action_results": [{"action": "Journey to the temple", "result": "After eating a meal with Quetzalli and the village, you prepare to leave. On Victoria’s warning, you decide not to eat any meat and stick with recognizable fruits. Finally on much persuasion from Quetzalli, you eat a small piece of well-cooked meat. It's a little stringy, but otherwise delicious. The juice seems to pop with each bite. You don't bother to ask the meat type. Some questions are better left unanswered.\n\nTwo archers accompany Quetzalli. Both have a consistent distrusting look in your direction. They lead you and the crew to a deep ravine. The slope is too steep to simply walk down, so you attach ropes to trees at the top and guide your way down. Near the bottom of the slope, you see a pool of water. The natives are the first to arrive at the edge of the pool and calmly wait for the rest of the crew to join them.\n\n“Are we close?” you ask.\n\nQuetzalli leans on her feathered spear. “Close, yes. I hope you can hold your breath.”\n\n“Alli, I’m stuck on a boat with this guy,” you say grabbing Procter’s shoulder. “You bet your onyx beads I can hold my breath.”\n\nProcter shifts uncomfortably from your hand. “It’s not good for the body to hold it in. Does a mother hold in her baby?”\n\n“Totally not the same,” Victoria says.\n\n“Going to side with V on this one,” you say. Back to Quetzalli you add, “I take it we’re diving in then?”\n\nShe nods. “Our ancestors discovered this hidden pathway into the temple. No one has been able to enter through the front entryway in centuries. Xolotl destroys all who would claim the blade. There is an underwater passage that leads into the temple. The passage is narrow, better for a small number of people. You don’t want to block up the passage and run out of air.”\n\n“Lead the way then,” you say removing your pack. “Freddy, Procter, and Victoria, you’re on me.”\n\nUnable to take supplies during the swim, you hand your extra expeditionary gear to one of your crew. You also leave your coat and tricorn hat behind.\n\n“Jack, you’re in charge while I’m gone,” you say. Lowering your voice you add on, “Keep your eyes peeled. I don’t want to come back to your bodies covered in arrows. If you sense an attack, strike first.”\n\nJack tucks a strand of blonde hair behind his ear. “Aye, captain. You can count on me.”\n\nQuetzalli walks up to you. “Are you ready? Stick close to me. There are many chambers and the current is strong.”\n\n“We’re ready.”", "action_results": [{"action": "The swim", "result": "You step your feet into the water and discover it’s ice cold. Not unaccustomed to cold swims, you know it’s better to dive straight in rather than slowly wade. Quetzalli takes point, followed by you and your allies, and the two archers take the rear. The pool is much deeper than you thought. It’s not wide, but the bottom seems endless. Underwater, you can see it’s capsule-shaped, almost as if a castle tower. Many different passages and caverns line the way down. The water itself isn’t hard to see through, although the abundance of flora prevents you from seeing the entirety.\n\nQuetzalli swims directly for one of the openings. The group quickly follows and you’re relieved to find an air pocket within the opening. Seven heads bob up and down as you each have to tilt your face up to keep your nose and mouth above water. After everyone catches their breath, Quetzalli once again leads you farther down in the water.\n\nLong strands of dark green flora start to inhibit your progress down. It causes you to push the kelp-like plants out of the way as if opening a double curtain. After pushing aside a massive cluster of flora, you find yourself lost in a maze of green. Everywhere you look, you’re met with a wall of green. Panic begins to set in. Your chest begins to burn as you’re nearing the end of your breath. Suddenly a firm grip grabs your arm and pulls you through. Quetzalli. She motions to the passageway beside her. Finally out of the green maze, you catch sight of your allies. They’re not nearly as deep as you are. The two archers seem to be ushering them into a different passage way above you.", "action_results": [{"action": "Swim to your allies", "result": "Highly distrustful of Quetzalli, you shake her grip and attempt to swim upward. She begins to chase you, but then ducks into the passageway. The burning sensation in your chest amplifies as you know you’re mere seconds away from drowning.\n\nA cluster of underwater plants floats into your view preventing you from seeing your allies. Once you finally push them aside, there’s no sight of your crew. You’ve exhausted your final breath and drown in the cold water. Your quest ends prematurely.", "action_results": []}, {"action": "Stick with Quetzalli", "result": "You’re almost out of breath and allow Quetzalli to lead you into the underwater passage. As soon as you enter, a swift current takes ahold of you and Quetzalli. Unable to resist the current’s strength, you preserve your energy and let it run its course. It takes you down several narrow corridors. Your vision begins to blur at the edges as you’ve reached the end of your breath. You need air, badly. Just as the world begins to go dark, you’re thrust out of the water into an open cavern.\n\n“Even from another civilization, men are all the same,” Quetzalli says.\n\nSemi-conscious, you realize you landed on top of her and the two soft rocks your head rested upon were not, in fact, two soft rocks.\n\n“Sorr—” you attempt to say before coughing up water. Luckily, you get most of it on the cavern floor and not Quetzalli.\n\n“Sorry, I must have passed out,” you finally manage to say rising to your feet. You stretch your hand out to Quetzalli.\n\nShe grips your hand and you pull her up. “The others aren’t as experienced swimmers. They will have to journey the long route.”\n\n“So it’s just the two of us then,” you comment.\n\n“Looks that way. Don’t worry, the others will catch up,” Quetzalli says.\n\nQuetzalli whispers incoherent words towards her spear and the tip begins to glow allowing you to see. The water stream that brought you here fires into another crevice on one side of the cavern, one that is too small for a person to enter. You get a sinking feeling there is no way to retrace your steps. The only way is forward. A tunnel lies at the opposite end of the cavern, the only way out. You take stock of yourself. At least your sword and dagger stayed on you. Besides being soaking wet and missing your hat, you’re ok.", "action_results": [{"action": "The tunnel", "result": "The tunnel leads in a straight path for a few hundred steps and then begins a series of switch-backs. After what feels like an eternity of hiking, you arrive to a solid rock wall. Quetzalli doesn’t seem to break a sweat during the incline. While you’re in superb shape, your physicality is more dependent upon quick, dexterous movements. The raw strength required to climb uphill for hours is certainly something you’re not used to, nor conditioned for.\n\n“What now? you ask. “We’ve seemed to hit a brick wall, metaphorically, well kind of literally, speaking.”\n\n“I don’t know those words. Stand back,” Quetzalli says.\n\nShe removes the onyx-beaded necklace from her neck and holds it to the wall. A low rumbling emanates from within the stone. Thin lines appear in the stone. They run up and down connecting into a rectangle. The rumbling begins to get louder and you feel the ground beneath you starting to shake. Then, suddenly, a light appears at the rectangle. The stone in front of you swings open like a door. Quetzalli enters and you follow closely behind. The doorway leads into the temple’s catacombs. Stone coffins line the walls along with various altars and small statues of the feathered-serpent.\n\n“This is the necklace of Quetzalcoatl’s high priestess,” she explains. “In the temple’s former years, the high priestess lived here. The necklace is what you call ‘a key’.”\n\n“Why do you no longer reside in the temple?” you ask.\n\n“The guardian drove us out. He once lived in your world. Do you know the man, Blackbeard?”\n\n“He was the deadliest man on the seven seas,” you answer. “I can’t believe he was actually defeated in combat. Rumor is, they were ambushed while celebrating and the entire crew, including Blackbeard, was stumbling drunk. I find it hard to believe any man could kill him in a fair fight. Wait…are you saying Blackbeard is here?”\n\n“Once the wielder of Quetzalcoatl’s blade is defeated, he is charged with protecting the blade until Quetzalcoatl is born again. This is normally a peaceful process, but something is different with the current guardian, Blackbeard. He is obsessed with the blade and will do anything to prevent anyone from taking it.”\n\n“One man drove everyone out? Your village looks more than capable of handling yourselves.”\n\n“Not just one man. His crew resides here as well. I know not how they ‘live’, unless they have sworn fealty to the blade as well. If they have, their soul will reside in the blade for eternity along with Blackbeard’s.”\n\n“I imagine you have a plan on how to steal the blade from Blackbeard and his undead crew,” you say.\n\n“I will kill him,” Quetzalli answers tightening her grip on her spear.\n\nYou begin to protest at her answer, but you sense movement out of the corner of your eye. One of the coffin lids moved, you’re sure of it. Suddenly, all the coffins burst open almost simultaneously with an explosion of rock. Skeletons, armed with ancient swords and battle axes, begin to rise from their resting place.\n\nQuetzalli goes on the offensive masterfully spinning and stabbing her spear.", "action_results": [{"action": "Cast a spell", "result": "Calling upon arcane power, you fire several small lighting bolts from your palm. The bolts hit a few skeletons causing an explosion of bones. As more skeletons are drawn to the rushing Quetzalli, you cast a shield on her. You haven’t mastered the art of protection, but the shield would prevent at least one blow from sneaking in. The spell surrounds her body like a thin cloud.\n\nSatisfied at your arcane contribution, you draw your sword and engage the nearest skeleton. Its eyes are empty save for the small stream of black smoke exiting each eyehole. You parry its attack and counter. Individually, the skeletons don’t pose much of a threat, but you work to quickly dispose each one attempting not to get overrun.\n\nAfter a few minutes, the majority of undead are defeated. You and Quetzalli put the finishing touches on some headless bones and take the stairs up from the catacombs.", "action_results": [{"action": "Up the stairs", "result": "The stairs lead into a sanctuary. You swing open the double doors and hoist yourself up then offer a hand down to help Quetzalli up. The sanctuary is a narrow room with an altar at one end. No sign of anyone is near. Lines of pews inhabit most of the room, although the majority are broken. A tall staircase leads up to the altar. A cage lies on either side of the altar, but that’s not what grabs your attention.\n\nA cutlass sits on a sword stand atop the altar. The blade of Quetzalcoatl.\n\nAs you start towards the altar, an invisible force stops you just before the first step. You fire lightning at it, but the force absorbs the bolt almost without any reaction. The bolt just disappears.\n\n“Not just anyone can approach the blade. Only the high priestess and her chosen priests can enter,” Quetzalli says taking your hand.\n\nShe walks through the invisible force and guides you through as well. The magic of the protective field causes the hairs on your arm to stand upright. You imagine her necklace is the key to entering, and you wonder if the Quetzalcoatl headdress granted access as well, but it was left behind with the rest of your equipment. Besides, if you were going to bring a hat, it would be your tricorn.\n\nHalfway up the stairs, black smoke appears around the sword. Once materialized, it swirls through the air around the edge of the cutlass. Finally, it centralizes in front of the altar rapidly increasing the swirling. Then, the smoke subsides to reveal a man. Blackbeard.\n\nHe wears a black robe that appears blurred at the edges. Closer examination reveals small puffs of black smoke emanating from the robe. His beard is lit with fire at the tips and the entirety of his chest and back are holstered with pistols.\n\n“Thieves!” his voice booms across the sanctuary. “You’ll never steal the cutlass from me.”\n\n“You are the thief,” Quetzalli answers brandishing her spear. “You have stolen the rebirth of Quetzalcoatl and corrupted the feathered-serpent’s resting place. For that, you must die.”\n\n“Ha-ha! How do you plan to kill the undead?” Blackbeard asks.\n\n“We are not inexperienced in that area,” you reply thinking of the skeleton attack you just survived.\n\nBlackbeard turns to you and narrows his eyes. “Do you know why you’re here?”\n\n“We’re here for the blade.”\n\n“She’s here for the blade. I surmise you offered little getting this far, yes?”\n\nYou begin to correct him, but then you stop. Sure, you helped with the skeletons, but they were destroyed easy enough. Quetzalli showed you the hidden entrance, underwater passageways, and unlocked every barrier to get here. What did she need you for?\n\n“Don’t listen to him, shipmaster. He’s attempting to divide our strength,” Quetzalli speaks.", "action_results": [{"action": "Question Quetzalli", "result": "“He’s not wrong...why did you bring me along? You could have gotten this far without me,” you comment.\n\nShe sighs. “Don't listen to the spirit. He’s trying to turn us against each other.”\n\n“That does not answer my question,” you say.\n\n“Fine. The rebirth of Quetzalcoatl has mostly been outsiders, shipmasters from another world. No one from our village has tried to claim the cutlass in many years. Upon the next shipmaster’s arrival, I had a vision he would be instrumental in the god’s rebirth. True, I could get this far on my own, but only Quetzalcoatl incarnate can wield the cutlass.”\n\n“You do not believe you can wield it?” you ask.\n\n“I did not say that.”\n\n“So what am I here for?” you ask.\n\n“Only Quetzalcoatl knows,” she replies.", "action_results": [{"action": "Question Blackbeard", "result": "“Keep talking, Teach,” you say.\n\nHis eyes flash anger. “You’ll not command me, lamb.”\n\n“Lamb?”\n\n“That’s what they see you as. A lamb to be slaughtered to their god. The sword feeds on blood.”\n\nYou turn to Quetzalli. “Is this true?”\n\n“No! Well, yes, the blade’s strength grows with blood, but that’s not why you’re here,” she answers.\n\nYour hand grips the sword at your hip. “If you attempt to break our partnership, it will be your blood the cutlass drinks.”\n\nVisibly angered, Quetzalli speaks through a clenched jaw. “Don’t threaten me, shipmaster. Keep your eyes on the mission. Our true enemy is Xolotl and the blight.”\n\nIt’s a sad thing to see another of my kind seduced by the beauty of the indigenous population,” Blackbeard intervenes. “Tell me, would you agree to this partnership if she wasn’t strikingly beautiful?”\n\nYour face goes red as you briefly make eye contact with Quetzalli. Towards Blackbeard you reply, “I’ll do whatever it takes to obtain the cutlass.”\n\nJoining your side, Quetzalli adds, “We’ll both do whatever it takes.”", "action_results": [null, {"action": "Battle for the cutlass", "result": "The answers, or rather lack of answers, you discover don’t make you less uneasy, but that’s a problem for another time. At least until the undead pirate in front of you is defeated. Giving Quetzalli a reassuring look, you draw your sword and dagger and make up the staircase. The stairs are wide enough for Quetzalli to follow at your side.\n\n“Careful of the flintlocks,” you whisper to her. “And watch for an ambush from his crew.”\n\nBlackbeard is simply armed with a ceremonial knife. You find it a bit strange that he does not wield the cutlass, but then come to the realization the guardian of the blade cannot be the wielder.\n\nQuetzalli charges forward spinning her spear in front of her. You follow and circle to Blackbeard’s flank. She stabs forward, feints a low attack, and then finishes high. Blackbeard parries her initial attack and dodges his head from the high attack. You stab your sword to his back -- at least you attempt to. Without looking, the knife blocks your attack and slices towards your wrist. You manage to divert the blow at the last second with your dagger.\n\nThinking you have him distracted, Quetzalli thrusts forward with the point of her spear. Blackbeard turns and catches the spear with one hand before the point can pierce his body. He taunts Quetzalli with a smile, then brings his knife to cut the spearpoint from the shaft. He draws a pistol from his chest and fires. Quetzalli barely dodges out of the way with a quick roll to the left. Blackbeard tosses the flintlock aside and swipes downward with the knife. Another roll puts Quetzalli out of reach from the knife. The missed attack leaves a nasty scrape, visibly and audibly, on the floor where Quetzalli’s body just was.\n\nRecognizing her vulnerability, you take the offensive to distract Blackbeard until Quetzalli can recuperate. You assault with a series of uppercuts and thrusts employing every dirty tactic you know. Mid-assault, you toss your dagger to Quetzalli who catches it with one hand. She takes the spearpoint in her other as a makeshift knife. Blackbeard expertly parries each one of your strikes almost with ease. With Quetzalli joining your attack, you feel the tide beginning to turn in your favor.\n\nYour sword strikes true. The tip pierces Blackbeard’s heart. Black smoke begins to pour from the wound growing in volume until his entire body explodes in a dark cloud.\n\n“I can’t believe we did it,” you comment to Quetzalli.\n\nShe gives a slight smile clutching at her side, then collapses. You notice a deep cut at her side. The spearpoint and dagger clatter on the floor as she drops, echoing throughout the now quiet sanctuary.\n\nYou rush to her and hold your head on your lap. “Breathe easy now,” you command. “You’ll survive this.”\n\nAs you eye her wound, a sparkle catches your eye. The blade of Quetzalcoatl lies unguarded. You know what you must do.", "action_results": [{"action": "Take the blade for yourself", "result": "You gently place her head on the ground and approach the altar. The gold-spiraled cutlass sits on display daring you to take it. You take a deep breath and reach your hand out. The handle fits perfectly in your palm. As soon as your grasp the hilt, you feel energy shoot into your body. It’s comforting, reinvigorating. It feels like the first sip of cool water on your parched throat, only in a continuous state.\n\nYou turn back to Quetzalli. Her lifeless body lies on the floor looking up toward you. In her last moments, she witnessed her god in the flesh, Quetzalcoatl incarnate, reclaiming his blade. Her visionless gaze looks full of wonder as she gave her life in service to her god’s return. You walk to her and shut her eyes. Then you pick up her body and navigate to the temple’s main entrance.\n\nThe sound of combat stops you in your tracks. You hear a voice you recognize: Victoria’s.\n\nYou arrive at the temple’s exit. You stand looking down the giant steps leading to a narrow pathway. The main entrance is a bottle-necked, bridge-like road leading up to the temple’s steps. Two unlit torches are in front of you, one at each side. Looking down, you see Victoria, Freddy, Procter, and the two native archers engaged with a giant beast. The beast has the head of a dog and the body of a lizard. It towers above its combatants and your allies look to be barely surviving. This must be Xolotl. You traverse the steps into the fray. The fighting subsides at your arrival.\n\nThe beast, Xolotl, rears its ugly head. “You have brought the blade to me. How convenient. After I kill you, I will destroy my twin brother once and for all.”\n\nYou softly put Quetzalli’s body on the ground in preparation for the upcoming battle. The two archers rush to her side.\n\n“You are a poison upon this island and I will destroy you. You will never take the blade away from me,” you say drawing the cutlass.\n\n“If it is your death you wish for, I will gladly grant it, mortal,” Xolotl growls.\n\n“Come on then, the blade thirsts for blood,” you answer.\n\nYou charge forward as if guided by the wind. Freddy throws a barrage of throwing knives to follow up your assault. Victoria and Procter begin casting spells of destruction. You dodge Xolotl’s swipes and make several deep cuts on his legs as you run between his giant legs to his flank. Two bolts of fire hit Xolotl’s nose almost simultaneously. If they caused any damage, he doesn’t show it. Arrows bounce off Xolotl’s scaly chest as the razor points aren’t sharp enough to penetrate. Xolotl attempts to smash you underneath his tail, but you easily side-step each time it slams down.\n\nXolotl raises his head for a moment gathering focus. Static energy fills the air. He turns your direction and fires blue lightning in your direction. You’re barely able to raise the cutlass defensively and block the elemental attack. The blast disappears within the blade and a voice whispering instructions fills your mind. You imagine sending the blast back and as you think it, blue tendrils project from the blade catching Xolotl unaware. The blast fires through his mouth and creates a hole out the back of his head. With a resounding earth-shaking thud, Xolotl’s body falls to the ground. Witnessing your power, the two natives drop to their knees and begin saying prayers to their god.", "action_results": [{"action": "The aftermath", "result": "The village is disheartened at the death of their champion and high priestess, but they throw a giant celebration in Quetzalcoatl’s return. A statue is constructed of Quetzalli, who will forever be a hero of her people, the first champion and high priestess who brought Quetzalcoatl to flesh by her actions. As the celebration continues into the late hours of night, you sit alone staring into the fire. The drunken bodies of both the natives and your crew lie scattered around you. Despite the disagreements between the two, Freddy and Procter are passed out drunk with their unconscious heads holding the other upright.\n\n“I didn’t know the captain of our ship was a god,” Victoria comments sitting next to you.\n\n“V, you know me. I’m not the superstitious type, but the power within this blade is real,” you say.\n\n“I believe you,” she says. “I don’t think we would have survived Xolotl’s attack if you didn’t show up.”\n\n“How did you end up on the front steps?”\n\nShe sighs. “One of our ‘guides’ took the wrong underwater passageway. I suppose I can’t cast the blame solely on him. Procter was about to run out of air and the guide took us to the nearest air pocket. The water current ended up being too strong and it carried us out near the front steps. We figured you could use back up and decided to take the frontal assault.”\n\nYou take the bottle from her hand and take a generous swig. “I think the hard times are over, V. The Sanguine is among the deadliest ships in the Caribbean and we possess the weapon of a god. I don’t see a reason to return to Nassau. What could Rogers do to us?”\n\n“He’s a powerful enemy to make, Cap, but we trust your decision.”\n\nYou put your arm around Victoria. “A captain is only as good as his first mate.”\n\nYour eyes meet for a second, illuminated by the fire. “Captain, I think you’ve had too much rum,” she says and squirms from your arm.\n\nYou grin. “I think you’re right. By the way, have you noticed your ponytail hangs to the left?”", "action_results": []}]}, {"action": "Guide Quetzalli's hand to the hilt", "result": "You get a slight sinking feeling within your chest, but you know what you must sacrifice in order to save Quetzalli’s life. You gently lift her body from the ground and place her on top of the altar. You take her hand in yours and guide her hand to the hilt. Once her fingers wrap around the gold-spiraled handle, her body jolts with sudden rush of power. The wound at her side begins to close on its own.\n\nHer hands begin to grip the cutlass on her own strength, and she sits upright still holding the cutlass. You take a step back fearful of Blackbeard’s words. You just hope saving her life was enough to not be the recipient of the blade’s thirst for blood. She swings her feet from the edge of the altar and jumps down. Silent, she walks towards you. You begin to raise your arms in defense...and then feel the warmth of her body against yours.\n\nShe embraces you in a tight hug. Surprised at first, you stand with your arms still in the air, but then eventually return the embrace.\n\n“Thank you,” she whispers into your ear. Her voice quivers as if fighting off tears.\n\n“How does it feel?” you ask.\n\n“It feels as if I could run for days and never tire,” she answers. She kisses your cheek and then steps back.\n\n“Come, we have blight to destroy.”\n\nYou navigate through the temple and arrive at the front entrance. Giant stone steps lead down to a narrow pathway leading up to the temple. Looking down, you see a large creature and several smaller bodies engaged in combat. Then you hear a voice you recognize: Victoria’s. You rush down the steps as quickly as you can to join the fray.\n\nYou see Freddy, Procter, Victoria, and the two archers fighting off a giant beast. The beast has the body of a lizard and the head of a dog. From the stories the natives told, you recognize the beast as Xolotl, the scourge upon the island. At your arrival, Xolotl, turns to you and Quetzalli.\n\n“Convenient. You have brought the blade to me. After I kill you, I will destroy my twin brother, Quetzalcoatl, once and for all,” it growls.\n\nQuetzalli steps forward. “Quetzalcoatl has returned. I am the vessel in which the feathered-serpent inhabits. You have poisoned this island for too long. Your day has come, beast.”\n\nYour gaze wanders to Victoria who gives you a questionable look. No doubt wondering why the native woman holds the blade and not you. You answer with a shrug.\n\nXolotl charges towards Quetzalli swiping its massive claws. Quetzalli dodges, and returns the attack scoring several deep slashes on Xolotl’s forearms. The rest of the party joins the attack. Procter and Victoria begin reciting the incantation to their spells. A flurry of arrows fly towards Xolotl’s head. The two native archers reload their arrows without pause. Throwing daggers quickly follow the arrows as Freddy let’s loose a series of his chosen weapon. Confident at the amount of forward pressure, he pulls out his mandolin and begins to invigorate the party with a song. You make straight for Xolotl’s flank intending to output damage on the undefended area.\n\nQuetzalli whispers into the cutlass. You’re unable to decipher her words. Suddenly, she begins swinging the blade in aggressive attacks. Even though she is not near the beast, her strikes seem to cut through the air. Huge cuts appear at Xolotl’s chest and the number grows at each slash made by Quetzalli. Finally unable to take the blows, Xolotl crashes to the ground. Quetzalli walks calmly to the fallen beast and stands over its head. With one swift motion, she removes its head.", "action_results": [{"action": "Heroic return", "result": "The return to the village is met with a celebratory feast. You are granted a seat at the head table along with Quetzalli, her father, and the village elders. Procter refuses to eat any light meat as he is unable to find his feathered friend. The crew enjoys the celebration and drink alongside the native community. Upon Xolotl’s defeat, the island has returned to normal. The blackened tree has transformed back to a lush brown and green. The aggressive animals and dangers in the jungle have calmed, allowing for exploration without threat.\n\nLate into the night, you grab a bottle of rum and leave the village deep in thought. Woodes Rogers is not going to be happy at the outcome. You arrive at a small clearing overlooking the beach. Two trees grow tall near the edge of the cliff, allowing you to use their trunk for back support as you dangle your feet from the edge. After a few swigs, you sense footsteps. You pull your flintlock and its click echoes in the silent night.\n\n“Put that away, shipmaster, it’s me,” the voice of Quetzalli speaks through the blackness. “Spare a drink?”\n\nYou offer the bottle to her as she takes a seat next to you. “Be my guest.”\n\n“I know the sacrifice you made to save my life. Your friend, Freddy, told me,” she says.\n\n“I made enemies with one of the most powerful men in the Caribbean,” you say. “There’s no telling what he will do to make an example of me.”\n\nShe takes your hand. “You will always have a home here should you decide to stay.”\n\nYou squeeze her hand and softly kiss her forehead. “My home is the sea. The Sanguine has been anchored far too long. The crew will lose their edge if we remain any longer.”\n\nShe cups your hand with her own. “Will you return?”\n\nWith a grin you answer, “ You bet your onyx beads, we’ll return.”", "action_results": []}]}]}]}, null]}, null, null]}]}, {"action": "Protect her flank", "result": "As Quetzalli charges forward, you sprint to catch up drawing your sword. Her spear thrusts and swings forward scattering bones everywhere. You see one skeleton begin to swing its sword at her back and intervene. Just before the blow hits Quetzalli’s exposed back, you block the sword and counter with your own.\n\nQuetzalli turns at the unexpected explosion of bones and gives you a grin. “Follow me, shipmaster!” she yells.\n\nShe takes the lead and expertly strikes the skeletons with her spear. Bones fly left and right as she continues forward. You put the finishing touches on a few she missed and watch the coffins closely for any missed.\n\nAfter a few minutes, the majority of skeletons lie scattered bones on the floor. You and Quetzalli take the stairs up from the catacombs.", "action_results": [null]}, {"action": "Rush past her", "result": "Quetzalli may have gotten a head start, but damned if you were going to let her show you up. You shadowstep to a skeleton at her right and knock the skull from its frame. Quetzalli gives you a wink, which you promptly return. In range of the farthest skeleton warrior, you shadowstep to the end of the room.\n\nDestroying it with a single blow, you catch the attention of the others. They begin to swarm on your position. A flurry of attacks assault you, but you focus on parrying and riposte each attack. As Quetzalli’s battle cry grows louder, you see bones fly up and down near the back of the skeleton mob. You continue defending until you’re face to face with Quetzalli.\n\n“Took you long enough,” you say.\n\n“Had to take care of the mess you left behind,” she retorts.\n\nNow that you’ve survived the sudden skeleton attack, you and Quetzalli take the stairs up from the catacombs.", "action_results": [null]}]}]}]}]}]}, null]}]}, null]}, {"action": "Change your mind and attack", "result": "The three natives before you are just the first of many obstacles in your way. Although they aren’t showing any signs of aggression, that could change. You’d prefer to be the one attacking when it comes to a “surprise attack.” Confident your crew knows your signal, you remove your tricorn and scratch the back of your head with your left hand. You give your hat a spin in your hand and place it back on your head.\n\nAfter a silent count to five in your head, you draw your flintlocks and fire at the three figures. In unison behind you, the crew draws their weapons and fires. The leader spins his staff in front of him creating a magic barrier. Your projectiles don’t find their targets. Twin arrows fly on either side of you and slam into a couple of your crew members behind you. Their bodies hit the sand, then explode in flame as the magical energy within the arrow combusts.\n\nYou sprint towards the natives, drawing a third pistol from behind your hip and firing. Just before your third shot fires, Victoria finishes her dispel incantation. The barrier in front of the natives disappears and your bullet slams into the leader. He looks down towards the gaping hole in his chest, and looks up, confused at the events that just transpired.\n\nYour sprint is disrupted for a slight second as you dive to your left to avoid an arrow. Landing in a roll, you raise your swords to attack and see the two archers dead on the ground. Several throwing knives lay buried in the neck of both.\n\n“You couldn’t do that before I ran all this way?” you ask Freddy.\n\n“Well, you need to burn off that rum somehow. Daily visits with the milkmaid just isn’t doing the trick,” he replies.\n\nAfter the brief skirmish, three of your crew are dead. Witnessing the deadly potential of the natives, you and everyone else is left with the same thought: I hope we don’t have to face more than three at a time.", "action_results": [{"action": "Onward", "result": "The jungle is dense. The crew of The Sanguine is formatted into three lines, each a few feet apart. The leaders in all three rows chop forward at the green vines and vegetation that layers the way forward. Gnarled roots and plants crawl on the forest pathway. The lack of sunlight allowed through the canopy creates the illusion of night.\n\nSeveral hours later you arrive in a clearing. The overgrown jungle suddenly cuts off into a round, circular open area. In contrast to the chaotic jungle, the clearing looks groomed to the highest order. Lush green grass carpets the entire area. A lone tree sits in the center. Its aged trunk is riddled with knots and broken branches. Compared to the maintained clearing, the tree looks out of place, like it’s too scarred for the neatly kept grass.\n\n“Think it’s some sort of religious grove?” Victoria ponders.\n\n“Must be,” you answer. “Men, create a perimeter. We’ll rest here for a bit.”\n\nThe crew gathers close together and four unlucky members are selected for first watch. Freddy takes a seat leaning against the ancient tree and pulls out his mandolin.", "action_results": [{"action": "Procter's thoughts", "result": "“How’s my favorite quartermaster?” you say.\n\nProcter looks up from the wooden figurine he’s carving and answers, “I’m not a child.” Upon speaking the last word, he accidentally nicks the edge of the wood removing a large portion of the carving.\n\n“Damn it!” he yells and chucks the carving into the surrounding jungle.\n\n“No, of course not,” you answer. “What do you think about the island?”\n\n“There’s something…living about it. I feel the magical energy all around me. There is powerful magic at work here,” he says.\n\n“The entire island is hidden from view,” you aptly point out.\n\n“Invisibility? A simple parlor trick. I’ve seen countless street charlatans with that ability.”\n\n“Fair point, although none of them can perform something on this scale.”\n\n“Not alone,” Procter says. “Put more than a few of them in a room, or on an island, and I bet they could conjure up—well, combine their abilities for a more potent spell.”\n\n\"Makes sense. Better luck on you next carving,\" you say handing him a piece of wood.\n\nProcter accepts it with a nod and brings his knife to it.", "action_results": [{"action": "Victoria's thoughts", "result": "“Hey, V. How’re you doing?” you ask.\n\nShe absent-mindedly fixes her ponytail and replies, “You know me, Cap. Exploring forgotten islands and slaughtering natives is what keeps me going.”\n\n“You don’t think we should have attacked them?”\n\n“I think they had some usefulness, which we can’t access now. We don’t know anything about the temple we’re heading towards. There could be traps or defense mechanisms in place. At the very least, we could have gotten a local guide through the jungle.”\n\n“There’s no certainty they would have helped at all. We’re trespassing on their sacred island. For all we know they would have shot us in the back. I’d rather strike first before they have the opportunity. Besides, I have the crew to think of. A decision had to be made whether to engage or not and I felt it best to engage,” you say.\n\n“I suppose hard decisions are the reason why you’re the captain and I’m not,” Victoria says.\n\n“That and my charming good looks,” you say flashing a smile.\n\n“Captain! Did you just imply I’m not good looking?”\n\nRealizing the implication you reply, “Of course not! You’re the bright flower on our boat. Proof that beauty is not without brains.”\n\n“I’m just busting your cannonballs, although your ability to correct yourself in front of a woman is quite remarkable. Truly legendary stuff, Cap.”\n\n“I do the best with what I’ve got,” you reply.", "action_results": [null, {"action": "Freddy's thoughts", "result": "You approach Freddy leaning against the blackened tree. One of his knee is bent towards the sky supporting the mandolin. He finishes playing \"My Sister, My Love\" and looks up to you.\n\n“You know that’s my favorite song,” you comment.\n\n“Ever since we were kids, yes,” Freddy replies finishing the final notes on the mandolin.\n\nAs soon as his music stops, a deep rumbling echoes from within the tree’s center. The earth begins shaking, dropping several members of the crew to the grass. Suddenly, the ground splits open and multiple roots slither through like tentacles from the Kraken herself. Caught unaware, you witness a couple of the crew dragged below ground.\n\nThe ominous creak from a bark-covered tentacle curls itself around your ankle. Instinctively, you fire your pistol. Splinters explode from the tendril, but it remains fixed around your ankle. You holster the flintlock and recite the incantation exactly how Victoria taught you. Flames appear at your hands, which you quickly wrap around the tentacle. It recoils at the fire, and dives back below ground.\n\nAcross the field, you see Victoria and Procter have already put into effect your keenly discovered technique. Flames project from both of their hands firing on close tendrils. Procter even takes it upon himself to fire at the tree itself. His blast craters a deep impact into the trunk of the blackened tree. Upon impact, a ragged deep whine echoes from within the trunk. The noise sounds like a whale call, only much lower pitched and resounding. The earthquakes increase knocking everyone, including you, to the ground.\n\nThe tree begins to grow in size lengthening towards the sky. The ground erupts as more bark tendrils fly out pushing the tree upwards as if arms. You rise from the ground and look around. The peaceful field has turned into a chaotic frenzy. The neatly trimmed grass is now scarred by fire and the eruption of the roots.", "action_results": [{"action": "Continue fighting", "result": "“Focus on the main trunk!” you yell in attempt to rally the crew. “Procter! Victoria! Keep up the fire!”\n\nAs the tree continues growing in size, you can now see where the bark tendrils connect to its body. They must not simply be roots because they’re layered throughout different levels of the trunk, not just near the base. It’s clear attacking the trunk is most effective. As a tendril wraps around a crewman near you, you get an idea.\n\nYou break into a sprint and use the momentum to hoist yourself on the tendril. Then, with arms raised in a “T” for balance, you continue the sprint upwards towards the tree’s body. As the current branch begins moving too quickly, you jump to another, and a second after that to keep your footing. Your path brings you directly in front of the trunk where Procter’s blast originally hit.\n\nYou repeat the spell bursting your hands in flame. Suddenly, the blackened mark turns flips open. You find yourself face to face with a lone yellow pupil. The mark must have been on an eyelid. The eye remains transfixed on you and a voice begins in your head.\n\nTHE GROVE MUST NOT BE DISTURBED. THE BLIGHT MUST BE DESTROYED.\n\nThe voice subsides, replaced with a deafening roar. Even with both palms against your head, you can’t mute the noise level. Blood begins to pour from your ears creating a second reason to keep your hands pinned against your head. In your incapacitated state, a tendril wraps around your body. You can see the same is happening to your crew on the ground level.\n\nThe tree returns to its original spot and height in the grove dragging you and your crew underground along with it leaving behind nothing but a Wilhelm. Over time, your bodies help fertilize the grass allowing the grove to regrow back to its original state. Your quest ends prematurely.", "action_results": []}, {"action": "Run", "result": "Whatever magic the grove held, it’s certainly more than you can manage. Realizing you’re outmatched, you shout the word any man who wants to live would:\n\n“Run!”\n\nNeeding no other command, where to run for example, the crew scurries off into the surrounding jungle. Once you cross back into the trees, the nighttime effect returns. The bright grassy grove is replaced with the dark dense jungle. A flash of purple hair catches up to you.\n\n“Cap, you made it. For a second there I thought I’d have to take command of the boys,” Victoria says gesturing to the remaining crew behind her.\n\n“Is this all that’s left?” you ask. “Where’s Procter and Freddy?”\n\n“Not with us,” she answers. “They’re a resourceful couple, I’m sure they’re ok.”\n\n“I’m more worried about them killing each other rather than the island killing them,” you answer. “Those two don’t exactly have matching personalities.”\n\n“I hate to say it, but we should continue towards the temple,” Victoria says. “No sense in wandering around the jungle looking for those two. Besides if they have any sense of intelligence, they’d continue towards the temple as well. We’re bound to meet up that way.”\n\n“—unless they run into another magic tree, or worse, more natives,” you reply.\n\n“I thought you just said you weren’t worried about that?”\n\n“I was trying to be funny.”\n\n“Maybe you shouldn’t do that. We’ll follow your lead. Continue towards the temple or search for Freddy and Procter?”", "action_results": [{"action": "Search for them", "result": "“We may be pirates, but we’re not animals…or even worse, lawyers. We’ll spread out to cover more ground. We’ll each lead half the crew in search. We’ll meet back here in a day’s time, with or without those two,” you say.\n\n“So much for taking my advice about being funny. It’s a plan. Men! On me!” Victoria says.\n\nVictoria and four of the crew set out east while you take the remaining three and head west. Once again, you’re back to hacking overgrown vines and branches blocking your path. After a few hours of hacking, whacking, and slashing, you discover a series of stone-carved statues. There are five of them total arranged in a crescent circle. Each cracked, moss-layered statue is a naked woman looking downward with hands in a prayer position barely covering the front of their chest. The sculptor definitely didn’t skip over emphasizing their womanly attributes as their curves are much more than a natural woman's. At first glance they appear the same, but a more in-depth look suggests subtle changes between them.\n\n“Have we been at sea too long or are these statues beautiful?” one of the crew, Jack, asks.\n\nYou turn to blonde-haired youth. “They are quite alluring. Keep your distance though, we have no understanding of the magic of this place.”\n\nJack steps forward and points at the middle statue. “Is that what I think it is?”\n\n“Yes, those are breasts,” another crewman, Henry, interjects.\n\n“I know what those are, asshole,” Jack replies. “I mean the ring on her finger.”\n\nSitting on the middle statue’s finger like a crown, is an extravagant ring. Freddy had many rings, too many for you to keep track of them all, but there’s no doubt in your mind it’s one of them. Freddy must have left it here as a breadcrumb to signify you’re on his trail.\n\nHenry slowly walks towards the statues for a better look. At the last moment something catches your eye—\n\n“—wait, stop!” you shout.\n\nToo late. The ground beneath Henry collapses under his weight. In an avalanche of dirt, he falls into the pre-dug pit. You rush to save him, but not quickly enough. You arrive to the edge of the pit just before Henry hits the bottom. It’s not a far drop. Not even a lethal height. The sharpened pikes at the bottom are another story though. Henry lies unmoving held suspended in the air by three pikes. His eyes are still wide-eyed by the surprise fall.\n\n“No one else move,” you command the remaining two members. Jack and William glance at each other perfectly willing to follow the order.\n\n“He-he another man falls for us, sisters,” a woman’s voice projects from one of the statues.\n\n“They can never help themselves,” another speaks.\n\n“Even when they see another man’s ring on my finger,” the middle statue jumps in.\n\n“Where is the man who gave you the ring?” you ask.\n\n“My love had to leave. He’ll be back. They always come back.”\n\n“Freddy’s left more than a few women waiting,” you whisper under your breath. Unsure of the statue’s power, and not wanting to upset them, you say, “I am a friend of Freddy, your, uh, love. I think he’s in danger and I need to find him.”\n\n“Freddy?” the statue questions. “Oh you mean my love’s man-servant. Elizabeth has already claimed him.”\n\nThe statue’s eyes to the far left flash white for the briefest of moments. So fast, in fact, you’re not sure if you imagined it.\n\n“You promised not to tell!” it says in an unusual pitch you determine to be embarrassment.\n\nIgnoring the outburst you respond to the statue with the ring, “Do you mean your love is Procter? Why do you have Freddy’s ring then?”\n\n“My love’s man-servant was carrying it for him of course. He’s such a strange man,” the statue answers.\n\n“No arguments here. Where did they go?” you ask.\n\nThe voice answers quietly, “To the feathered serpent’s resting place.”\n\nYou nod. “Do you know the way?”\n\n“I will tell you if only for the reason it will bring my love back to me sooner. Beware the guardian.”\n\nYou retrace your path back to the location to meet Victoria. You’re a bit early, so you, Jack, and William, set up camp. You volunteer for the first watch.", "action_results": [{"action": "Wait for Victoria", "result": "You reach the appointed hour Victoria should be back. There’s still no sign of her. The worst thing you could do is attempt to search for her. Despite her reasons for being late, she would most likely return to the meeting place or continue towards the temple. You need to decide to keep waiting or continue towards the temple without her.", "action_results": [{"action": "Keep waiting", "result": "It's way past the appointed hour Victoria should be back. There’s not even a small sign of her. At this point, the worst thing you could do go look for her. She would most likely return to the meeting place or continue towards the temple. You figure your only choices are to keep waiting or continue towards the temple without her, though the thought of staying in one place too long makes you nervous...", "action_results": [{"action": "Keep waiting", "result": "“Captain, I think I saw movement,” Jack says.\n\n“Victoria?” you ask.\n\n“Not sure. It came from over there,” he points a finger into the jungle in front of you.\n\nYou peer into the overgrowth. You don’t see anything, but a whizzing sound causes you to instinctively roll to your right. The feathered javelin hits Jack square in the chest. Two more quickly follow impaling his stomach as he falls back. The points rip clean through his back stopping his fall a few inches from the ground. He dies with the same surprised look as Henry.\n\nStaying in the same spot too long has alerted the natives to your presence. Perhaps they wouldn’t have attacked if you didn’t attack them first on the beach. A group of natives appear through the trees encircling you and William. They march forward spears held in front of them. You try to fight your way out, but there are too many. You die in the jungle next to your two crew members. Your quest ends prematurely.", "action_results": []}, {"action": "Continue without her", "result": "Despite Victoria’s tardiness, you have a mission to accomplish. She would just have to meet up with you at the temple. No doubt that’d be her first destination after arriving to the meeting spot late. You follow the directions given to you by The Ladies, the name Jack and William called the statues. They appeared to still over-sexualize the stone carvings, although their crude comments distracted you from thinking the worst about your missing friends. After half a day’s march, and a remark from William about “being harder than stone”, you arrive on the outskirts of the temple.\n\nThe tree line cuts off almost immediately in front of the bridge-like pathway leading to the temple’s staircase. The pathway is long and narrow with high walls on either side creating a bottleneck opening into the temple. The same pillar lines the walls, one on each side every 10 feet or so mirroring the one across. The pillars have a snake wrapped around them from base to top with two wings spread out in flight position. There’s no sign of your missing crew or anyone else for that matter.\n\n“We’re here. The cutlass should be inside. It’s a little ominous though, don’t you think?” you ask.\n\nJack grabs at the long strand of hair that’s fallen out of his hair tie and places it behind his ear. “I have a bad feeling about this place,” he says.\n\nWilliam adds on, “It’s like that feeling you get when you spot that first black cloud at sea. Like the—”\n\n“—calm before the storm,” you complete.\n\n“Exactly,” William answers.\n\n“There’s no sign of the others,” you say. “In fact, this whole place doesn’t look like anyone’s been here in a while.”\n\n“That’s why it doesn’t feel right,” Jack says. “Because we know there has been. Wait, what’s that?”\n\nA light appears at the top of the stairs. The torch in front of the temple’s doorway has lit up seemingly on its own as you don’t see anyone. The light rises in the air, spirals, and then floats down the stairs to the end of the pathway. It hits a circular dial on the ground. A bolt of lightning strikes the dial and causes you to look away from the flash.\n\nYou return your gaze to find a creature standing at the point of the lightning strike. It stands upright like a man, but that’s the extent of its human likeness. It has the head of a wild dog and the body of a lizard. The dark fur around its face creep down its neck transitioning into scales mid-chest level. Its tail glides through the air almost as if weightless. It sniffs the air and points its head in your direction.\n\n“Why hide? Do you fear me?” it speaks through two sharp canine teeth.", "action_results": [{"action": "Attack it", "result": "“This must be the guardian,” you whisper to Jack and William. “Follow my lead.”\n\nYou exit your hiding place in the trees and walk down the path towards the creature. Jack and William follow behind a few paces. Jack on the right and William on the left. Although it only takes a matter of seconds, the walk forward seems an eternity. It probably has something to do with the beast waiting at your destination. You arrive right in front of the creature. It’s much larger up close. It stands unmoving, staring at you with its blackened eyes.\n\n“I’ve heard a lot about you,” you break the silence.\n\n“Have you now? And what have you heard?” it growls.\n\n“I’ve actually written it all down. Would you like me to read it?” you ask.\n\nLike most powerful creatures, you assume the beast possesses the same vanity. After receiving what sounds like a grunt of approval, you reach into your cloak for the “paper.” Your palm returns holding a hand grenade. With your other hand, you light the fuse and throw it towards the beast’s mouth. Your goal was to land it inside the mouth, but it hits a tooth and explodes in the air.\n\nUsing the explosion’s smoke, you dart in between the beast’s legs and cut your sword towards the backside of its legs. William throws a hatchet at the beast’s head while Jack circles around to the outside to scatter potential targets. As Jack circles, the beast’s tail catches him in the chest sending him flying into the nearest pillar. He slams into the stone leaving behind a crack and red stain.\n\nYou slice your sword at the scaly hamstring. Your blade bounces off without leaving a mark. Alerted of your presence, the beast stomps its feet in attempt to crush you beneath. You dodge, stutter-start, and evade the stampede of feet. The beast rears its head. Static energy fills the air with a low hum.\n\n“William, watch out!” you scream from under the beast.\n\nA bolt of lightning fires from the beast’s mouth blasting a hole through William. The shock blackens the area surrounding the hole cauterizing fatal blow instantly. Its turns to you now, the same energy filling the air. As great as your dexterity is, it’s not enough to dodge lightning. The blast kills you immediately. You die on the temple’s steps just short of reaching the cutlass. Your quest ends prematurely.", "action_results": []}, {"action": "Speak to it", "result": "“I bet this is the guardian,” you whisper to Jack and William. “Stick behind me.”\n\nYou exit your hiding place in the trees and walk down the path towards the beast. Jack and William follow behind you a few paces, one at each side. The creature is larger up close. It stands unmoving, staring at you with its blackened eyes.\n\n“You are Quetzalcoatl’s protector?” you break the silence.\n\n“Ha! Quetzalcoatl wishes. My twin brother banished me from his temple ages ago. I would destroy him myself if the magic seals didn’t bar my entrance,” it replies. “I am Xolotl, god of lightning and fire.”\n\n“I am—“you begin.\n\n“—your name matters not to me, mortal,” Xolotl growls. “I know you seek the cutlass, the artifact Quetzalcoatl embodies. Destroy it for me and I will give you my blessing.”\n\n“What sort of blessing would that be?” you ask.\n\n“The one that far eclipses possessing the cutlass for yourself.”\n\n“Ah, you see, I’m not taking the blade for myself. My employer requires it,” you say.\n\n“Ha-ha-ha!” Xolotl rears his fangs to the sky. “No fool would willingly give away that type of power in their possession. For what? A few gold pieces? ‘Wealth’ is the bane of your existence.”\n\n“What type of man would I be to go against my word?”\n\n“The type of man who would possess the power to etch his name into history forever. I will allow you to pass. Do not fail me.”\n\nXolotl disappears in a flash of light leaving you, Jack, and William alone. There’s no sign of your missing crew and the entrance to the temple lies open. You make your way up the staircase.\n\nThe arched entryway leads you into the temple’s outer chamber. The place looks as if a shell of its former glory. Ruined, decaying statues line the walls. Pieces of stone blocks lie scattered on the floor, the ceiling’s cracks the obvious source. Braziers are in key locations, although in their unlit state they serve no real purpose. By the activity on the island, you were expecting the temple to be, well, not a graveyard. Then the more you think about it, it starts to make sense; you doubt very many, if any, would make it past Xolotl. Still, that didn’t necessarily mean the temple is void of all danger. There is powerful magic keeping Xolotl at bay and for all you know that power could be directed at intruders as well. You step carefully sensing for traps.\n\nA steady beat diverts your attention away from your internal thoughts. The deep rumbling appears muted, and you guess there are many walls muffling the sound. Likewise as the temple is the obvious place to find the cutlass, it is likely the centerpiece of whatever ceremonial event was taking place. The drums signify another thing: the temple is not as deserted as the outer chamber looks.\n\nNavigating through the halls, you listen for the drum beat and head in the direction it is loudest. You arrive at a balcony overhanging a long rectangular room. At the far end sits an altar with a cutlass mounted on a stand. The staircase leading up to the altar is much larger than it should be, like it's a testament to the temple itself. The cutlass isn’t what draws your attention though. A single celled cage sits on either end of the altar. Inside you see a bound and gagged Procter and Freddy. Several hooded figures stand between you and the altar. A few bang on drums just before the altar's steps. Their red robes are a darker color than the natives you first encountered.\n\n“Look down there. We’ve got to help them,” William whispers pointing over the edge.\n\n“Of course we do,” Jack answers. “Any ideas on how?”\n\nYou interrupt, “I’ve got something in mind…”", "action_results": [{"action": "The plan", "result": "“Seriously? You think that’ll work?” Jack asks.\n\n“Do you have something better?” you reply. Seeing him shake his head you continue, “When I give you the signal, attack with everything you got.”\n\n“Alright, let’s get to work,” William says.\n\nYou silently swing your legs over the balcony and take a deep breath. You judge you’re about 30 feet in the air. Not a fatal height, but rescue missions tend to go better without broken legs. The side wall connecting the balcony to the bottom floor is cracked in several places. Unfortunately, the first crack is just out of reach. You leap forward arms stretch out for the hand hold. Your hands slide into the opening and grip it tightly. The sudden stop of your upper body causes your lower half to take the bulk of the momentum. You bend your knees slightly to absorb the impact without making a sound. You look down to see if anyone notices your acrobatics. All the hooded figures are still focused on their prayer. Now that the hard part’s done, you climb down to the lower floor.\n\nThe lone figure at the back of the room has your attention. Keeping in the shadows, you sneak behind them. Your arms lock around their neck in a choke. As they struggle, you secure your hand behind their head tightening the grip. You eat a pointy elbow in the gut, but remain firm on the pressure. As your target flails, you catch sight of a flash of purple. Instantly, you release the choke and flip back the hood. Your face catches a fist in response to giving up the superior position.\n\n“Victoria?” you whisper. “What are you doing?”\n\n“What are you doing? You scared me shitless,” she whispers back.\n\n“Saving those two,” you say pointing at the cages. “Where’s the rest of your group?”\n\n“Didn’t make it.”\n\n“Jack, William, and I are all that’s left of mine. They’re in position to attack once I signal. How’d you get past Xolotl anyway?”\n\n“Now’s not the time. There’s something happening. Look,” she gestures towards the altar.\n\nA lone figure silently steps towards the altar. The robed people in the room separate allowing a pathway. The figure is unlike the others in the room. He wears a black robe instead of red. The edges of the robe are blurred at first sight, but then you realize black smoke is emanating from the robe. Pistols line the figure’s chest and limbs and the tips of his beard are lit with small flames. You recognize the figure.\n\n“Is that—” Victoria starts.\n\n“Edward Teach. Blackbeard,” you answer.\n\nBlackbeard takes center stage and addresses the room.\n\n“It seems we’ve caught ourselves a couple of thieves looking for Quetzalcoatl’s blade. Unfortunately for them, the blade has not tasted blood in quite a while. What do you say, men? Should we feed the thirsty blade?”\n\nA cheer echoes throughout the room. You realize the red robed figures must be Blackbeard’s crew. Whatever power is binding Teach to this place, binds them as well. Ignited by their captain, the crew abandons their stoic, religious demeanor.\n\n“I say we let them fight to the death then sacrifice the survivor! Quetzalcoatl deserves a worthy sacrifice,” one man near the altar shouts.\n\n“No, sacrifice them both. The blade thirsts for blood,” another suggests.\n\nThe room erupts into a frenzy of disagreeing ideas between the crew to the amusement of Blackbeard. He gives a wink to a caged Procter after someone shouts the idea “cut out their beating hearts.” Finally, he raises his arms to settle the dispute.\n\n“I have decided. We will sacrifice both in the old way. Bring me the knife!”", "action_results": [{"action": "Wait for the opportune moment", "result": "Not wanting to do anything stupid, you bide your time. If you acted too suddenly, you might get your friends killed.\n\nBlackbeard opens the cage to his left and pulls a gagged Freddy out. He holds him steady with one hand and receives an obsidian knife in the other from a robed figured.\n\n\"The blade is thirsty! How shall we quench its thirst?\" he yells to the crowd.\n\n\"With his blood!\" the mob screams back.\n\nBlackbeard throws Freddy on top of the altar with one hand. Freddy tries to struggle, but can't resist against the strength holding him down. The knife plunges into his upper belly, just below the rib cage. Freddy's eyes go wide in the sudden pain. The gag muffles any sort of scream he let loose. Blackbeard carves a deep incision and tosses the knife onto the altar. His other hand plunges into the wound. His hand returns with Freddy's dripping heart. Blackbeard tosses the body aside creating room on the altar. He slowly grinds Freddy's heart against the blade of the cutlass until it's separated into two halves.\n\n\"No!\" you shout unable to control yourself. You just witnessed your best friend's heart ripped from his chest.\n\nAll eyes in the room turn to you.\n\n\"Well what are you waiting for?\" Blackbeard yells. \"Kill him!\"\n\nThe robed figures in the room rush toward your position. Frenzied by the ritual, they attack with a strength you've never seen before. Their ceremonial knives are simple, yet they use them effectively. Instead of rushing one by one, they mob up in attempt to overwhelm you. The gathering makes Victoria's spells land easier, but their numbers are too many. Jack and William face the same fate. One knife makes its way through your defense and lands in your side. More are quickly followed after. Your last memory is a mob of robed figures furiously stabbing. Your quest ends prematurely.", "action_results": []}, {"action": "Sneak to a better position", "result": "“We need to act now,” you whisper to Victoria. “Follow my lead.”\n\nYou silently move closer to the altar taking cover behind a broken pew. You’re still several paces from the altar, but you dare not get closer unless you want to be seen. Blackbeard opens a cage and pulls a gagged Freddy out. With ease, he flings Freddy onto the altar with one arm. Wide-eyed, and trying to resist, Freddy tries to escape, but Blackbeard’s arm pins him firmly to the stone structure. Blackbeard’s action frenzies his crew once again. They begin chanting and repeating the same sequence of words: “Tlah, uizcal, pante, cuhtli.”\n\nOne of the robed members wanders close to the pew. Isolated and with the room’s preoccupation, you decide it’s a good moment to reduce their number. Well that and you were likely to be seen in your current position. As he steps to the opposite side of the pew, you reach over covering his mouth with one hand and driving your dagger through his back into his lung. Not allowing a sound, you pull his body over the pew to your hiding spot.\n\nIt’s a move you’ve performed plenty of times, but this time the result surprises you. Instead of blood, the body explodes into a black puff of smoke. Unfortunately, the smoke is like a beacon on your location. All eyes are instantly drawn your direction.\n\n“Intruders! Capture them!” Blackbeard screams.\n\nThe crew erupts into a mad frenzy mobbing towards you. Luckily, the majority are only armed with simple ceremonial knives. Behind you, Victoria fires a barrage of magic missiles that explode into a few more smoke clouds. You draw your blade and parry the first several attacks. You sense the presence of two bodies behind you, and you turn to attack. It’s William and Jack joining your side with their cutlasses drawn.\n\n“We couldn’t let you have all the fun,” Jack says.\n\n“Yeah, I’m having the time of my life,” you sarcastically answer.\n\nYou take the offensive easily cutting down the robed crewman with their ill-equipped knives. You use the smoke as cover dodging and dashing like a spectre. Finally, all that’s left is Blackbeard. He stands at the altar with Freddy pinned down, an obsidian knife in his other.\n\n“A valiant effort. Perhaps you are a worthy successor,” he says.\n\nYou approach the altar's steps with your blade point in front of you, “Let him go, Teach. It’s over.”\n\n“Those who wield the blade must be prepared to give the ultimate sacrifice.”\n\n“What sacrifice would that be?”\n\n“A lifetime of servitude. The blade gives tremendous power to the wielder, but your soul is bound to it forever. I am destined to guard the blade until its successor proves himself worthy. Then my soul will be harvested inside with the others before me. It’s the way it will always be. The blade demands blood and will feed upon the wielder unless its thirst is sated.”\n\n“I am not here to wield it for myself. My employer is the one who wishes to wield it,” you answer.\n\n“Then you are truly bound to him. Should you prove yourself worthy to take the blade and gift it to another, your duty as guardian will remain.”\n\n“I’ve had enough,” you say. “Release Freddy.”\n\n“As you wish,” Blackbeard answers plunging his knife into Freddy’s chest.\n\nFreddy’s eyes grow wide in shock at the sudden pain. The cloth around his mouth muffles his scream. Blackbeard kicks his body down the altar’s steps landing Freddy at your feet.\n\n“Madman!” you scream and charge the steps.\n\nAn invisible force prevents you from taking the first step. You pull out your flintlock and fire it towards Blackbeard. The invisible force prevents your bullet as well.\n\nLaughing, Blackbeard opens the next cage with Procter inside. Bound and gagged, Procter can’t offer any sort of resistance. Multiple fireballs explode against the force shield. Victoria’s doing. Still bound, Procter utters a muffled noise. His eyes look up towards his forehead and he motions upward with his head. You know what he’s telling you to do.", "action_results": [{"action": "Put on the headdress", "result": "Just as the island’s invisibility had to be dispelled, perhaps the barrier had to be as well. You pull the Quetzalcoatl headdress from your pack and place it on. Instantly, you’re able to cross the barrier onto the altar’s steps. Just in time for Blackbeard to sink the knife into Procter.\n\n“Teach, you’re a dead man!” you shout.\n\n“Ha-ha-ha, right you are,” he shouts back with a smile.\n\nYou rip the head covering off and toss it to your allies behind you. You continue your rush towards Blackbeard. Your blade meets the obsidian dagger with a piercing screech. You thrust your blade expertly forward using feints to catch Blackbeard unaware. Almost with ease, he parries each strike. Even though you have the obvious reach advantage, Blackbeard masterfully blocks each of your swings.\n\nAttempting to break his defense, you fire a bolt of lightning from your other hand. The electric energy hits Blackbeard’s chest and disappears in a wisp of smoke. He grins and reflects the energy back to you knocking you off your feet and down a few steps.\n\nJack and William join the fray rushing past your fallen body. You try to get up, but the jolt left your muscles spasming. William lets loose a series of uppercuts and forward thrusts while Jack circles around to flank. Same as your attack, Blackbeard’s defense is impenetrable. Suddenly, Blackbeard draws a pistol from his chest and fires it directly into William’s forehead. William’s head snaps back in the impact and his body falls to the floor. The move angers Jack and he aggressively attacks from Blackbeard’s flank. Without even moving his head, Blackbeard drops the pistol, grabs another, and fires it into Jack’s gut. Jack’s body hits the floor mid-charge, the momentum slides his body forward a few feet.\n\nFinally able to move, you rise to your feet. The bodies of your crew, your friends, lie scattered around you. Their blood pools and drips down the steps of the altar creating a red waterfall. Blackbeard stands at the top of the stairs waiting for you. Behind you, Victoria is stuck outside the barrier. Jack or William, whoever was last inside, didn’t throw the headdress far enough. It’s on the ground just within the invisible barrier. Victoria can’t get in.\n\nYour eyes meeting Blackbeard's, you slowly traverse the steps up. He stands unmoving without emotion. You stand before him, the guardian of Quetzalcoatl’s blade. The cutlass remains on the sword stand on the altar. Realizing your magic is ineffective, you attack once more with expertly guided strikes and combinations.\n\n“Not many make it this far, I’ll give you that,” he says knocking your sword aside. “Perhaps you were meant to wield the blade. Perhaps if another guardian stood in your way you’d succeed. I don’t plan on harboring my soul in the cutlass anytime soon.”\n\n“And I don’t plan on dying anytime soon,” you reply with another series of strikes.\n\nTired of the game, Blackbeard parries your blade aside and knocks you back against the altar. His dagger pierces into your chest.\n\n“And look how close you’d gotten,” he mocks as you lean against the altar clutching your wound.\n\nSuddenly a sword tip appears at his chest releasing a small whiff of smoke. Jack collapses behind Blackbeard, his final amount of energy placed into thrusting his sword forward. In Blackbeard’s distracted state, you reach for the cutlass on the altar, screaming in pain. As soon as your hand clasps around the hilt, your vision flashes a supernatural green. Strength pours into your limbs like you’ve never felt before. The wound from Blackbeard’s mends itself closed. It’s almost as if you’re weightless; the energy flowing through your body feels limitless. With your new found strength you swing the blade down cutting Blackbeard from neck to hip. His body slides downward at the cut and then explodes into dark energy. Black smoke from his body surround you with a piercing scream. Then it pours itself into the cutlass in a rush of air.\n\nBlackbeard is dead and the cutlass is yours. You return to Victoria holding the blade.\n\n“We did it,” you say showing her the cutlass.\n\n“Not yet,” she answers. “Xolotl needs it destroyed.”\n\n“So that’s how you gained access to the temple,” you ponder. “The ‘power’ Xolotl is offering sounds too good to be true.”\n\n“Sounds better than being eternally bound to Quetzalcoatl...or following a captain into ruin.”\n\n“What’s that supposed to mean,” you say narrowing your eyes.\n\n“It means I don’t think you’re fit to lead anymore,” Victoria says. “It means I won’t continue to follow you while our crew gets destroyed in the process. We’ve fallen on hard times, and it’s a captain’s duty to protect and prosper the crew.”\n\n“What do you think this job is for!” you reply. “The Sanguine is now the most destructive force in the Caribbean. We can do what we please. The Spanish, French, not even the English can face us in open water now.”\n\n“We may have the ship, but we no longer have the crew,” Victoria says gesturing towards the fallen bodies. “I will rebuild The Sanguine’s crew...as captain.” Victoria’s palm ignites with flame. “I’ll be taking that cutlass now.”", "action_results": [{"action": "Hand it over", "result": "“Fine,” you answer. “I’ve lost too many friends already. If you really feel that way, go ahead and take it.”\n\nSmiling she grabs the blade from your hand. Her eyes roll back in her head as she experiences the same rush of power.\n\n“This is something else,” she comments. “But it won’t compare to the gift of Xolotl. Come on, let’s go.”\n\nVictoria leads you back out of the temple with the cutlass pointed at your back. You exit the temple and arrive at the circle Xolotl appeared at earlier.\n\n“Xolotl! I have the artifact!” Victoria shouts into the air.\n\nIn another lightning strike, Xolotl appears at the circle. His canines point menacingly from his lips.\n\n“It’s about time,” he growls. “Place the blade on the dial.”\n\nVictoria does as he says. Xolotl raises his arms up to the air drawing upon supernatural power. Dark storm clouds begin to circle above you in the air. The bright sunlight turns dark as if night had suddenly come. A blinding light fires from the sky directly to the dial’s center. A pillar of flame fires from the clouds followed by several lightning strikes. Pain pierces your chest as the cutlass begins to crack from the elemental burst. The cutlass begins to emit a low light from within that increasingly grows larger. As the cutlass’ light grows to crescendo, you feel the energy drawing you in. You feel your life force drawn into the cutlass just before it’s shattered into countless pieces. Your time of guarding the cutlass was brief. As the blade is destroyed, so is your soul. You’ll never know if Xolotl’s power bestowed upon Victoria was worth it.", "action_results": []}, {"action": "Refuse", "result": "“I’m sorry, V, but I’ve fought too hard to simply give the cutlass away. Our friends would have died for nothing if we give it away now,” you say.\n\n“Another poor decision from the ‘captain’,” Victoria says firing the spell from her hand.\n\nYou instinctively draw the cutlass up to block the attack. The bolt hits the blade and is dispelled upon impact. Victoria gives a surprised look and then fires another. Reactively, you dodge to the left. Though you may possess a magic dispelling blade, you’re certainly not used to using it. The blast hits the wall behind where you stood and explodes in a cluster of flame and stone.\n\n“V, I don’t want to fight. Stop, and we can forget about this whole thing,” you say.\n\n“It’s too late for that. Xolotl expects me to follow through. The Sanguine is in need of a new captain.”\n\nAngered at the mention of your ship you reply, “There’s no way in hell I’d let a mutinous first mate take command of The Sanguine. She deserves better.”\n\nVictoria continues to fire towards you. This time you raise the cutlass defensively. Like someone whispered in your ear, you know exactly what to do. Right when the spell hit the blade, you imagine returning the firebolt back towards Victoria. The bolt, along with the previous, projects from the cutlass in Victoria’s direction. You’ve seen her absorb magical attacks before, but this one catches her unaware. The blast explodes at Victoria’s chest blasting her backward. After the smoke clears, all that remains is a charred body with few strands of purple hair left. You have possession of the blade, but all your closest friends are dead. You exit the temple, blade in hand.\n\nA lightning strike greets you as you exit onto the temple’s steps. Xolotl appears growling with his palm outstretched.\n\n“It seems my faith in you was well placed. Hand me the blade. You do not yet have the power to destroy it,” he says.", "action_results": [{"action": "Use the cutlass on Xolotl", "result": "“The blade is mine. I’ll never give it over,” you say.\n\n“Ha-ha, and before you said it was for your employer,” Xolotl replies. “Funny how possession of power changes things. I bet you’re second-guessing that decision now that you’ve felt what the blade offers.\n\n“I admit, it is something else...something I’d rather not give away, especially when the reward is questionable,” you answer.\n\nXolotl roars in rage. \"Questionable! I offer you the power to be the most powerful man in the Caribbean and you call it questionable? You aren’t worthy of my gift.”\n\n“So be it,” you answer raising the cutlass.\n\nXolotl charges forward swiping his massive claws forward. Fueled by the blade’s energy, you easily dodge the reckless assault. Time feels to have slowed down as you can see Xolotl’s movements almost before he makes them. It’s as if fighting an opponent underwater except you’re still moving at full speed. Xolotl tries to stomp his massive feet on top of you, which you easily side step and counter with several deep cuts.\n\nXolotl begins to rear his head gathering focus. A blast of lightning fires from his mouth toward you. Trusting in the cutlass, you allow it to absorb the blast. Acquainted with the power, you silently tell it to return the shock. Blue tendrils release from the point of the blade striking Xolotl in the eye. Xolotl screams as he falls to the ground clutching at the hole where his eye once resided.\n\nYou walk to the beast writhing on the ground and lift the cutlass.\n\n“Look at you,” you start. “What fool would surrender Quetzalcoatl’s blade for your ‘power’?”\n\nYour sword, the resting place of Quetzalcoatl, removes Xolotl’s head with a single blow.\n\nThe rest of the crew waiting on board The Sanguine are relieved at your return, but the moment is tainted with the death of the others. You preserve Victoria’s memory, and don’t tell the crew of her mutinous attack. Weeks later you dock in Nassau. Woodes Rogers’ man, Dampier, meets you as soon as you lay anchor.\n\n“Let’s go. My master expects you at his estate,” he says without a greeting.\n\n“Right now? We’ve been at sea for awhile and the rum stores ran low,” you answer.\n\nNot willing to budge, you finally agree and follow Dampier to Roger’s estate...on the condition he provide you with a bottle upon arrival. Woodes Rogers meets you in the same room as before. The scarred face has a giant grin on his face.\n\n“Is that it?” he asks pointing at your hip.\n\nThe gold-spiraled hilt reflects the bright-lit room like gold pieces under the sea. You unsheathe the blade for a closer look. The removal from the scabbard sounds similar to chimes on a windy day. Once more in your hand, you feel the limitless energy the blade feeds into the wielder. Almost as if a whisper, a voice, not your own, speaks in your head: Think what we could accomplish together…\n\n“Captain? Hand it over.” Rogers says narrowing his eyes. Behind you, Dampier’s hand grips around the hilt at his hip.", "action_results": [{"action": "Complete the job", "result": "Shaking your head in attempt to silence the voice, you hold the cutlass out for Rogers to take. Before your arm even gets fully outstretched, he snatches it from your grip. A wide smile appears at his scarred face as he feels the power flow through his body.\n\n“It’s everything I imagined it to be,” he says swinging it around a few times. Dampier’s grip releases from his sword. “I must admit, it would take a lot of willpower to surrender this power. I’m sure you felt it too.”\n\n“Yeah, I felt it. Too much responsibility if you ask me,” you say. “Besides, I have a newly outfitted ship that requires my attention.”\n\n“You’re a good man, captain,” Rogers says offering his hand out.\n\nYou shake it and reply, “No I’m not, but I appreciate the sentiment.”\n\nTaking your promised bottle, you leave to The Sanguine. At least you try to. A searing pain rips through your head stops you from leaving the estate. The pain drops you to the ground. Your world and vision turns white hot as you roll on the ground clutching your head. You awake in an unfamiliar bed with a doctor hunched over you. He notices your eyes opening and quickly rushes out of the room slamming the door behind him. Hushed voices and footsteps project in the room through the closed door. Suddenly, it swings open and Woodes Rogers enters.\n\n“What do you know of the guardian?” he asks.\n\n“I know I likely can’t leave your side,” you answer remembering Blackbeard’s words.\n\n“You are bound to me now, Captain. Together we will rid the Caribbean of pirate scum.”\n\n“Great…” you reply in full-realization you're at his mercy.\n\nRogers offers a hand. “Come, we have much work to do.”", "action_results": []}, {"action": "Keep it for yourself", "result": "“Captain, I won’t ask again,” Rogers says nodding towards Dampier behind you.\n\n“The cutlass is mine. I’ve given up too much to simply hand it over. If you try to take it, there will be consequences,” you say.\n\nAt your refusal, Dampier draws his sword and lunges toward you. Without even turning your head, you bring the Quetzalcoatl blade up and block his attack. Your fist meets Dampier’s face almost simultaneously dropping him to your feet. You stare directly at Rogers while you plunge the blade into Dampier’s chest.\n\n“Still want it?” you ask pointing the blade towards Rogers aggressively.\n\n“My life’s work is for naught without the cutlass. Of course I want it!” Rogers yells and charges at you.\n\nYou easily parry, side-step, and bring the hilt of the cutlass to Roger’s face. His body collapses to the floor. Both hands clutch his face's bloody mess.\n\n“Now listen closely, I’ve lost a lot of friends finding this blade,” you begin. “So many, in fact, it’s given me somewhat of a reflective mindset. You’re going to do exactly as I say or you’ll get the Dampier effect,” you finish by gesturing at the bloodied corpse on the floor.\n\nRogers gives a disheartened nod.\n\n“Don’t look so distressed, you’re in luck. I’m going to help you achieve governorship, and with your political power, you’ll pardon every pirate in the Caribbean of their crime,” you say.\n\n“Do you know how difficult that will be to legally obtain?” Rogers says rising to his feet.\n\nYou eye the Quetzalcoatl blade in your hand and look to Rogers. “There is nothing I can’t accomplish. Are you with me, governor?”", "action_results": []}]}, {"action": "Surrender the blade and accept his power", "result": "“I surrender the blade to you. Bestow upon me your power,” you say with the cutlass outstretched.\n\n“Heh, I’ve got to admit, I thought you would try to keep it for yourself. You truly are worthy of my power,” Xolotl answers. “Place the cutlass in the circle where I first appeared to you.”\n\nXolotl raises his arms up to the air drawing upon his supernatural power. Dark storm clouds begin to circle above you in the air. The bright sunlight turns dark as if night had suddenly come. A blinding light fires from the sky directly to the circle’s center. A pillar of flame fires from the clouds followed by several lightning strikes. Pain pierces your chest as the cutlass begins to crack from the elemental burst. The cutlass begins to emit a low light from within that increasingly grows larger. As the cutlass’ light grows to crescendo, you feel the energy drawing you in. It’s as if your soul is ripped from your body. You feel your life force drawn into the cutlass...then, suddenly, it stops. The cutlass bursts into countless pieces in front of you.\n\nDark energy swirls at Xolotl’s claws creating a vortex of supernatural power. His arms outstretch firing a beam of the energy into your chest. It’s painful at first, but then gradually subsides. The energy raises your body into the air several feet before finally the beam stops. You find yourself one knee on the ground with your arm rested on the other.\n\n“How do you feel, my champion?” Xolotl asks.\n\nYou rise and look up towards Xolotl. Your eyes flash pure black before returning to ocean blue. You say nothing, but offer a toothy grin.\n\n“A good of an answer as any,” Xolotl says. “Leave this place. Go wreak havoc in the Caribbean. Now that Quetzalcoatl no longer keeps me at bay, I can unlock the true power of the island. I will call upon you if needed.”\n\nWith a nod, you leave Xolotl and journey through the jungle towards The Sanguine. The island recognizes your power, and none of the previous dangers approach you.\n\nWeeks later you arrive back to Rogers’ estate. His man, Dampier, eagerly met you at the docks and ushered you directly to Woodes Rogers even though you’d be at sea and wouldn’t have a chance to rest before the meeting. Back in the place Woodes Rogers hired you for the job, he addresses you.\n\n“So? Where is it?” he asks getting straight to the point visibly excited.\n\n“Gone,” you answer.\n\nThe smile drains from his face. “Gone? What do you mean ‘gone’? I paid you well more than you deserve up front and I demand you tell me what’s happened.”\n\n“I destroyed it. Well, Xolotl destroyed it, but you get the point. It’s forever gone.”\n\n“You damned pirate! I will burn you for this. I’m putting a price so massive on your head that every boat in the Caribbean will be after you. Even fucking fishermen will try to stab you in the dark--” he starts.\n\nYou hold up your hand silencing Rogers mid-speech then curl your hand into a fist. Dark tendrils fire from your hand grasping around Rogers’ face. Each tendril finds an entrance place in Rogers’ eyes, nose, and ears. Dampier attempts to help his employer, but you stop him mid-lunge. Rearing upward for a split-second, you fire a blast of lightning from your mouth imitating Xolotl. The jolt burns directly through Dampier’s chest and leaves the smell of smoke behind.\n\n“You listen to me,” you say. “The blade is gone because I wanted it gone. In exchange for your down payment, I’ll give you something even greater. Your life...on the condition you win governorship. Don’t worry, I’ll help you secure office, but once you do, I have a few changes I want you to make.”\n\n“What...happened...on...that island,” Rogers manages to ask.\n\n“I will tell you in due time. For your sake, I suggest you get to work...Governor,” you growl.\n\nWith your help, Woodes Rogers is elected governor over the Bahamas. You helped “convince” England to provide Rogers with a King’s Pardon, a document which allowed government officials to erase piracy crimes. You had big plans for the Caribbean, and needed to quiet the constant skirmishing between the law and the lawless. Rogers as your puppet, you slowly begin to accrue loyal agents all over the Caribbean. Your conquest over the Caribbean is only just beginning.", "action_results": []}]}]}]}]}]}]}]}, null]}]}, {"action": "Continue without them", "result": "\"They know the danger. Like you said, they'll probably head towards the temple to regroup. No sense in wandering around the jungle,\" you say.\n\n\"You heard the captain! Let's move,\" Victoria says to the remaining crew.\n\nYou continue your journey hacking and slashing through the jungle. Your eyes have adjusted well to the constant darkness. Still, the going is slow due to the overgrowth. You silently promise yourself to pass on the next clearing in the jungle. A few hours later, there's still no sign of Freddy and Procter. The jungle begins to seem familiar. One twisted branch looks exactly like one you passed an hour ago. When you pass a familiar fallen tree you realize without a doubt, you're lost.\n\n\"Victoria, I hate to say it, but I think we're going in circles,\" you say.\n\n\"I've lost sight of the temple, and my compass isn't even working,\" she says.\n\nShe's right. The overgrowth is too dense to see the massive temple.", "action_results": [{"action": "Stay on course", "result": "You pick the direction that feels best and continue on. Eventually you arrive at a river. Judging by the current and width, you probably wouldn't survive a swim across. The water itself is muddied, and you can't see through it. No telling what swims around underneath.\n\nOne of the crew steps forward tucking a strand of blonde hair around his ear. \"At least this is different from wandering through endless trees.\"\n\n\"Perhaps, but it's still not near the temple, Jack,\" Victoria replies.\n\n\"Think we could string together a raft? I bet it'd be quicker than hacking our arms weary,\" another member, Henry, speaks.\n\n\"Speaking of raft...\" Jack replies pointing in the distance.\n\nA crudely constructed vessel comes into view from around the bend almost on top of you. It's decorated similarly to the native's clothing. Red and covered in feathers. One of the natives on board starts frantically grabbing the others and motions in your direction. Suddenly, magic missiles barrage the shore from the boat followed quickly with a hailstorm of arrows. You were able to take down three natives with a surprise attack, but facing more on even ground, metaphorically speaking, is too much. Several arrows pierce your body, which is then blasted into pieces by the magic missiles. Your quest ends prematurely.", "action_results": []}, {"action": "Split up", "result": "\"Captain, I didn't want to say anything, but I think it'd be better if we split up,\" Victoria says.\n\n\"Why? So you could end up missing like Procter and Freddy?\" you answer.\n\n\"No, well, I think we have a better chance at reaching the temple in separate groups. Our area to search would certainly be increased.\"\n\n\"Fine,\" you say. \"Let's give it some time first though. One of us should stay put and the other should try to retrace our steps. We'll meet back here in a few days\"\n\nVictoria nods and ventures off leaving you with only Jack and William.\n\nDays later...\n\nYou continue to wait. No Victoria. It’s well past the time she should be here.\n\n“Captain, I think I saw movement,” Jack says.\n\n“Victoria?” you ask.\n\n“Not sure. It came from over there,” he points a finger into the jungle in front of you.\n\nYou peer into the overgrowth. You don’t see anything, but a whizzing sound causes you to instinctively roll to your right. The feathered javelin hits Jack square in the chest. Two more quickly follow impaling his stomach as he falls back. The points rip clean through his back stopping his fall a few inches from the ground.\n\nStaying in the same spot too long has alerted the natives to your presence. Perhaps they wouldn’t have attacked if you didn’t attack them first on the beach. A group of natives appear through the trees encircling you and William. They march forward spears held in front of them. You try to fight your way out, but there are too many. You die in the jungle next to your two crew members. Your quest ends prematurely.", "action_results": []}]}]}]}]}, null]}, null, null]}]}]}, null]}, null]}, null]}]}]}, {"action": "Board", "result": "In their weakened state, you order the crew to prepare to board. Grappling hooks are thrown from the starboard side to El Explorador drawing the two ships closer. Some of your more brazen crew, barbarians most likely, take the initiative and swing from hanging ropes to the deck of El Explorador causing mayhem upon their arrival.\n\nMusic catches your attention, and you look to see Freddy in the crow’s nest with a mandolin. He’s obviously enjoying the view and plays a song recounting the story of “Francis, the Eternal Emperor.” His music seems to invigorate the crew because they suddenly begin to work with extra might.\n\nIn front of you Procter barks commands making sure the crew is properly armed and the guns are reloaded quickly. At one point, you see him toss back a sailor for not “putting enough back” into his rope pulling and takes the rope himself. A bored-looking Victoria sends a series of magic missiles onto the deck of El Explorador for good measure. By now, most of your crew is engaged with El Explorador’s and you figure it’s time to end things before any of your more reckless members lose their life.\n\n“V, let’s give them the ol’ slip-out-while-they’re-in-the-washroom special,” you say.\n\n“We really need to come up with a better name for this,” she says starting to cast the alteration spell.\n\nMagic fires from her fingertips enveloping you into a shimmering, transitive state. Light seems to ignore your body as you turn into the transparent form. Only noticeable by highly perceptive individuals, you jump across the gap to El Explorador.\n\nYou soften your landing with a front roll and draw the dagger from your thigh. With the crew of El Explorador distracted by the battle, you make your way cutting through the preoccupied men. Eventually their captain notices the bodies falling by an unseen foe and directs the nearest soldiers in your direction. They take aim and unload a series of musket shots into the air. You manage to evade the shots by ducking underneath one of their fallen members.\n\nYou throw the dead body aside, and cast a light spell temporarily blinding the soldiers. Not wasting any time, you stab the nearest soldier with your sword and throw your dagger into another. With one hand free, you draw the flintlock from your hip and fire it into the third soldier. The sound of air whizzing past, followed promptly by a resounding thud draws you from the heightened state of battle. You turn to see the ship’s captain on the deck behind you with several throwing knives lodged in his chest. You look up to the crow’s nest of The Sanguine and give Freddy a salute. He returns the gesture with a toothy grin.\n\nWith their captain dead, the rest of the crew throws down their arms in surrender. You raid their cargo hold and find a significant amount of Spanish wine. You load the wine onto The Sanguine and offer a choice to the surviving members of El Explorador: Join or die. All but one join your crew, and Procter is excited that he gets to test his new plank courtesy of Woodes Rogers. It functions just as the old one, but you don’t have the heart to tell him.", "action_results": [null]}]}, null, {"action": "Ramming speed", "result": "With their sails compromised, the ship has no escape.\n\n“The new cannons seem to do their job,” you say to Victoria. “How about we put the new ram to the test?”\n\n“Aye, Captain.” Directing towards the crew she yells, “Brace for impact! We’re going to split the Spanish dogs in half!”\n\nYou spin the wheel to the right. The Sanguine responds accordingly directing its path perpendicular to El Explorador. A gust of wind catches the sails propelling the schooner to frightening speeds. You see the Spanish crew horrified at the approaching missile that is The Sanguine. Most begin to jump ship.\n\nVictoria was almost right. The bow of The Sanguine tears into El Explorador with a sickening crunch. The port side is ripped apart and looks as if cracks from an earthquake. The Sanguine’s momentum stops just short of reaching the starboard side of El Explorador. The impact renders most of the Spanish soldiers unless as they’re either thrown from the ship or crushed by debris. Several fires start along the deck and the sailors frantically rush to put them out.\n\nEnergized by the destruction, your crew jumps to El Explorador cutting down the remaining members and salvaging any valuables before the Caribbean claims it. You understand the danger of staying attached to a burning boat and order the crew to work on dislodging The Sanguine.\n\nYou gather all the treasure you can and continue your journey leaving behind a burning shell of a ship.", "action_results": [null]}]}, null]}]}]}]}]}, null]}, null, null]}, null, null, null]}, {"action": "Look for Freddy", "result": "“…look for Freddy. No telling what he’s got himself into this time.”\n\n“A wise decision, Captain.”\n\nYou flip a few coins to the bar and take your leave. The sudden sunlight in contrast to the dimly-lit tavern assaults your vision. You tip the point of your tricorn hat a bit lower to protect your eyes. The tavern is one of many upon a windy, sloped path. You pass by several street shops lining the cobbled pathway. A group of expressionless soldiers march by and receive a smile and tip of your hat. Tension between Nassau and the English occupation was at an all-time high. The governor's hold over the city had been steadily declining for years. Criminal activity only escalated with the diminishing control. Still, the English possessed the best firepower and wizards in their employ.\n\nEventually you end up at a table underneath a covered patio. The entire overhang is covered with a green ivy. Three men sit at the table along with a crowd eagerly huddled around the players. You see Freddy in the middle always with a perfectly trimmed goatee. You never know how he finds the time, especially at sea, to trim each hair to the exact desired length. He holds his cup of dice with the usual several rings upon his fingers.\n\n“Not your lucky day, is it Freddy?” one man at the table speaks.\n\n“No one can lose this many times in a row,” he replies. “My luck’s about to change… and your coin purse is about to get lighter.”\n\n“Ha-ha, you’ve already lost several months of wages,” the other man chimes in. “Pretty soon you’ll be putting those fancy rings on the table.”\n\n“Done,” Freddy replies taking a ring from each pointer finger.\n\n“Call,” both his opponents say simultaneously and push their coin piles forward much to the amusement of the crowd.\n\nThe three players shake their cups, rolling their dice, and slam the cups upside-down on the table. Then, they carefully peak underneath to see the result being careful not to let their opponent see.\n\n“Four fours,” one man speaks.\n\n“Five fours,” the other one bets.\n\n“Eight fours,” Freddy says. The crowd gasps at the sudden increase and start placing side bets with one another.\n\n“You mad dog, no way there’s that many,” the man to his left speaks.\n\n“Call me a liar then,” Freddy challenges.\n\n“Liar.”\n\nFreddy’s two opponents remove their cups revealing their rolled dice. Between the two of them, they have three fours.\n\n“Ha-ha-ha it’s still not your day, Freddy!”\n\nFreddy lifts his cup to reveal his roll. Each of the five dice shows a four. The crowd roars, threatening to riot. Freddy’s opponents stand up and knock their chairs to the ground in fury.\n\n“There’s no way you could roll that without cheating.”\n\n“Looks like my luck’s finally turned around. Thanks for the game, gentlemen,” Freddy says. Noticing you, he gets up to greet you.\n\n“Captain, there you are! I was getting to know the locals,” Freddy says. Quieter he adds on with a wink, “and they don’t have quick eyes.”\n\n“Yeah, well, they have quick feet,” you say pointing towards the table. As Freddy rose to greet you, his two opponents had taken their coin back and run off.\n\n“Damn, and we still had several more rounds to play. Anyway, I bet you’re here wondering about potential work. Don’t worry, I didn’t blow it off. I found us something and it could be big.\"\n\n“What’s the job?” you ask.\n\n“You heard of Woodes Rogers?” he asks. Seeing you nod he adds on, “I ran into his man, Dampier. They’re in the market for a captain; a captain who’s lived a life of danger and romance. One who all captains dream about becoming. I told him if I find anyone like that, I’d tell him.”\n\nNarrowing your eyes you reply, “Very amusing. What really happened?”\n\n“Ha. They are looking for a ship. The job is very hush-hush at this point. You’re supposed to meet him tonight at his estate.”\n\n“I suppose we don’t have much of a choice. We need money and a lot more than you were just playing for. I’ll meet with Rogers tonight.”\n“If you need me, I’ll be here,” Freddy replies. Turning back towards the crowd, he shouts, “Alright, who’s next?”", "action_results": [null]}, {"action": "Sit here and drink", "result": "“…sit here and drink,” you say.\n\n“Doesn’t seem like much of a plan,” Victoria replies.\n\n“The rum helps with brainstorming. A few more of these, and I’ll come up with something. Always do,” you say with a grin.\n\n“Far be it from me to question the captain,” she replies raising two fingers toward the bartender.\n\nThree more later...\n\n“Ha-ha-ha and that’s when I hid under the horse carriage and tried to find where I left my clothes! Luckily, I still had my hat to decently cover one side of me!” you finish telling the story to Victoria.\n\n“Ha, Captain! Her father, the magistrate, would have hung you.”\n\n“I still have my life...and my hat!” you say plopping the hat onto Victoria’s head. She instantly takes it off disgusted by its involvement in your story.\n\nSuddenly, a man sits down next to you and says, “Buy you a drink, Captain?” The antique arquebus upon his back immediately catches your eye.\n\n“You’re free to do as you please,” you answer. “Might want to buy yourself a modern weapon while you’re at it,” you add on.\n\n“I assure you, no musket any of these street peddlers sell can compare to ol’ Shelly,” the man replies tapping the rifle affectionately.\n\n“Fair enough. Thanks for the drink. What’s your name, friend?” you ask.\n\n“Dampier,” Victoria butts in. “He’s one of Rogers' men.”\n\nThe man, Dampier, nods, “That’s right. I’ve actually been looking for you. My employer, Woodes Rogers, has been looking for a captain of your caliber. He graciously offers an invitation to meet at his estate tonight to discuss business.”\n\nYou look to Victoria and silently agree there’s no choice but to see him out. At least that’s what your intoxicated senses tell you.\n\n“Tell Rogers I’ll be there,” you answer.\n\n“He’ll be expecting you. And please try to sober up before then,” Dampier replies.\n\n“Excellent idea,” you say. “Bartender, two beers please.”", "action_results": [null]}]}