{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=34849", "context": "", "first_story_block": "This is a story about a boy named Long, who life will change with the coming of war. \n\n\nBut first, let's focus on the Vietnam War itself. \n\n\nThe Vietnam war happened after the French's failed attempt to gain control of the country. The United States then took over for them. In 1954, when the French left, Vietnam split into two after a conflict over who would control the country. It was the communist North, and the independent South. The United States sided with the South.\n\n\n ", "action_results": [{"action": "Numerical Facts", "result": "-At the beginning of the 20th century, 90% of war casualties were soldiers, by the last decade of that century that 90% were of civilians instead. \n\n\n-Many of those 90% casualties were children.\n\n\n-More than a million South Vietnamese were orphaned by the war, and only a few thousand made it to adoptive families.\n\n\n(in the book Escape From Saigon)", "action_results": [{"action": "Back to 'A Note to Readers.'", "result": "This is a story about a boy named Long, who life will change with the coming of war. \n\n\nBut first, let's focus on the Vietnam War itself. \n\n\nThe Vietnam war happened after the French's failed attempt to gain control of the country. The United States then took over for them. In 1954, when the French left, Vietnam split into two after a conflict over who would control the country. It was the communist North, and the independent South. The United States sided with the South.\n\n\n ", "action_results": [null, {"action": "The Introduction", "result": "The story you are about to read retells the entire story of the book 'Escape from Saigon; How a Vietnam War Orphan Became an American'  by the author Andrea Warren.  Some parts will be shortened and changed (Not Entirely) to fit the 'Choose your Story' style. This includes alternate endings and a little bit of more dramatic parts.\n\n\nCredit goes to everyone involved in making the book 'Escaping from Saigon' and anyone that I failed to mention.", "action_results": [{"action": "Alright, let's start.", "result": "Your name is simply 'Long', a Vietnamese name. Your mother is Vietnamese, and your Father is American, making you an 'Amerasian.' You currently live with your Mother and Stepfather, along with your stepbrother in an apartment near the Saigon River. \n\n\nIt is late at night, Mother wakes you up from a long, peaceful sleep. Long, I know it's late, but we have to leave she says in a quiet, but uneasy voice. Your stepbrother is nearby across the room, fast asleep. You begin the remember the fun times you have, but those memories are overlapped with images of the violence of your stepfather. Thoughts come to mind, I love my stepbrother, but the more I stay, the more mother gets hurt...\n\n\nMother looks like she's in a hurry, so you better choose quick.", "action_results": [{"action": "Stay with your stepbroher", "result": "You decide that you want to stay with your stepbrother, for at least one more day, but Mother doesn't think the same. She quickly jumps through your bedroom window, carrying a sack over her shoulder. I'm sorry Long... she says before she leaps down onto the catwalk outside the window of the apartment complex. Your stepfather quickly runs into the room, baseball bat in hand while still in his pajamas. You helped her escape, didn't you?! he yells. He grabs you by the collar, and lifts you into the air, while your stepbrother watches in terror. Your angry stepfather then throws you into his bedroom closet, and locks the door. After a few minutes or so, tears start flowing down your eyes. You cry for your mother, but know that you will probably never see her again.\n\n\n                                                                                     GAME OVER                                                       ", "action_results": [null]}, {"action": "Listen to your mother and leave", "result": "The strong love for your mother overwhelms the love for your stepbrother. You grab a tiny backpack from your bedroom closet and quickly put things inside your mother tells you to grab. When you're done, your mother lifts you onto the catwalk outside your bedroom window. The two of you climb down onto the street below. Your stepfather, still in his pajamas, walks onto the catwalk a few minutes after you and your mother do. Instead of chasing you, he yells at the top of his lungs, then walks back inside. You cold barely hear his voice, however, as heavy rain and thunder pour down onto the city street.\n\n\n You see a parked taxi around the corner of a market, it's headlights illuminate the gloominess of the pouring rain. The driver is fast asleep, laying in the backseat with a hat covering his face. Your mother knocks lightly on the window. The driver wakes up, surprisingly more quickly than you expected. May I help you? The driver says, tilting his hat towards you and your mother. My  step-husband has treated me and my son with great abuse, so we have decided to flee his apartment complex  down the street. Please, he might be coming here soon, can you take us somewhere safe? \n\n\n ", "action_results": [{"action": "Find out what he has to say", "result": "The taxi driver offers to take you to a small village outside of Saigon. Your mother quickly agrees, and she takes a small amount of money out of her pocket. The driver refuses, The money is important to you. Please, keep it. Your mother thanks the driver, and before you know it, the taxi drives off into the night sky.", "action_results": [{"action": "Chapter Two: A New Life", "result": "You wake up after a long night's rest. Your grandmother is seen cooking breakfast.\n\n\nA few years have gone by since you fled your stepfather's home. The taxi took you to a village that is near the place your mother used to live. You and your mother traveled by foot to get here. ", "action_results": [{"action": "Okay, What's next.", "result": "You can hear jeeps rolling into the village, soldiers can be heard exiting the vehicles. Your grandmother walks into the bedroom, Long, your mother is working in the rice paddies. I've cooked a special treat for both of you. A man quietly opens the door. He is an American GI, who has the task of securing the houses for weapon supplies and hiding rebels. He smiles at you, then asks, What is your name? You quietly say, Long. The soldier then gives you a tiny chocolate bar. The brown wrapper covers half of it. 'Rshey' it says in grey letters. Thank, you. you quietly say. The soldier laughs, You're welcome, take it easy kid.  \n\n\nA few hours go by, you can hear a little bit of commotion going on outside. Your curiosity excites you, what is going on?", "action_results": [{"action": "Open the door and walk outside", "result": "You open the wooden door and walk outside.\n\n\nThe GIs surround a building nearby, they are holding something in their hands that look like some sort of metallic object. One of them violently kicks the door open. This leads to a quick outburst of loud explosions and screaming. Another GI walks up to the door, he has some sort of hose with him, and a big metal backpack.\n\n\nThe next thing you see is horrifying. The GI with the hose opens the door again.\n\n\nThe hose shot out anything but water, it quickly spat out a stream of fire into the building. More screaming endures. You think to yourself, How could someone possess something so terrible? Your mother walks behind you, and covers your eyes. \n\n\nLong, this is why I want you inside while the GIs are here. You grab your mother by the leg, and you and her walk inside.", "action_results": [{"action": "A few days later...", "result": "You wake up from your bedroom. You can hear the rain outside lightly pouring down onto the dirt road. \n\n\nLong, I want you to shop with me today. your Mother says. How exciting! You've never been shopping with your mother yet.  You and her take a long walk across the rice paddies and fields nearby. This takes you to a jungle path, where a white SUV waits there. A man and a woman stand in front of it. Your mother tells you to get into the SUV, and that she will be getting in after you. ", "action_results": [{"action": "Get into the SUV", "result": "Curiosity fills your brain, so you take a big step inside.  After getting into the SUV, you look back at your mother. She raises her hand and waves at you, almost effortlessly. \n\n\nBye. She quietly says.\n\n\nYou suddenly try to exit the vehicle, but one of the adults already shut the door. The car starts moving away from your mother. Don't go Mom! You yell at the glass.\n\n\nTen minutes go by. Mother is long gone. The car stops at a large house. It looks like some of the houses you've seen by your stepfather's apartment, near where the rich people live. The woman exits the front seat and opens the door on the right. \n\n\nLong, we will be your new Parents from now on. Me and my husband own this big house. We will have lots of toys for you to play with. \n\n\nYour mother would want you to live with us. Please listen to your mother. The man says from the driver's seat.\n\n\n ", "action_results": [{"action": "Okay, I'll stay", "result": "You think to yourself that doing what your mother wants is the best thing to do. After all, there was a reason why she told you to go inside the SUV.\n\n\nA few years go by\n\n\nYou're raised in a rich family. Your parents have treated and educated you well. Sometimes you wonder what has happened to your old family.  \n\n\nA few more years go by\n\n\nYour mother wakes you up. Long, we have to leave now. The bodyguards are at the entrance, when we're ready we'll head to our cruise ship to flee to the Philippines a few hours across the sea. \n\n\nI don't like this any more than you do Long, but we have no choice. Quang, we're all set. A man in a suit gently pushes you to the door, and into the white SUV. You drive to your private cruise ship sitting at the Saigon port. Armed soldiers and your bodyguards stand firm at the parking lot entrance. The big cruise ship is filled with people in suits and dresses, some greet your Father. Your hands lean against the railing of the cruise ship as it moves away from the city. You wonder where your mother is, but for the rest of your life that remains a mystery.\n\n\n                                                                                    THE END \n\n\n ", "action_results": [null]}, {"action": "No! I want to go back!", "result": "This is what your mother wanted Long! Please, stay with us!\n\n\nIn a loud voice, you yell, NO! I WANT TO GO BACK!\n\n\nThe woman looks at the man, then, with tears in her eyes, looks at you.\n\n\nPlease...\n\n\n ", "action_results": [null, {"action": "No! I want to go back!", "result": " You refuse to stay. Your mother is the only thing you can think about right now. Suddenly, a man in a suit grabs you, hands around the side of your chest, and lifts you out of the car. You're carries you over his shoulder, like a sack. You try to break free by pushing against his grip, but it is hopeless. He brings you into an empty room with painted walls and toys, and he sets you down. \n\n\nThe man and woman enter the room. He's ready for you sir. the man in the suit says over your head.  But may I please inform you that this 'method' of yours is uncalled for? The man who entered the room looks down on you, then looks at him. I'm aware. But his mother told us to do it this way. Long, He looks down on you Your mother would want you to stay with us. Give us a few days, and we can make you feel welcome.  You look at the man, and hesitate, Is this really what my mother wants? After thinking about it for a few minutes, you quietly say,", "action_results": [{"action": "No.", "result": " The couple tries to offer you toys and food, but you won't accept any of it. You wanted your mother, and you wanted her now. \n\n\nFor several days you hide in your closet, crying and refusing to eat anything. The couple, beginning to concern your health, decide to bring you back to your mother. \n\n\nYou take the same SUV that you took to get here. The man in the suit, standing by the door, quickly says something to you. I really hoped we could make it work. Sorry. You start to think about how kind the man was to you, but after you step out of the door, it quietly closes shut. The woman, holding your hand while walking to the car, quietly speaks to you No tricks this time, I hope you will have a better life with your mother. She helps you get into the car, and soon it moves away from the big house. ", "action_results": [{"action": "You get to your mother's village", "result": "The SUV parks in front of your house. The man gets out of the driver's seat and opens the door. \n\n\nYou walk to your mother's house, alone. After opening the door, you see you mother. Emotionless, and frozen in place. \n\n\nYou ask her why she tried to send you away, she does not respond. Long, your mother has not been well lately, You hear your grandmother say, eating at the dinner table. You join her shortly after.", "action_results": [{"action": "Chapter 3: Holt Center", "result": "A few months have passed since the incident. Your mother has not improved from her emotionless state. She sleeps often and barely shows any sign of the care she gave you before. \n\n\n You wake up from your bed. Your mother, sleeping in a bed next to yours, has not waken up yet. ", "action_results": [{"action": "Wake Her Up", "result": "You gently shake your mother's arm to wake her up. It has worked before so you figure you'd do it again.\n\n\nAfter trying to wake her up, she still doesn't move. Scared, you cry out for your grandmother.\n\n\nShe runs into the room, slamming the door open. Panicking, she grabs you mother and tries to sit her up. \n\n\nYour mother doesn't move at all still. \n\n\nYou and your grandmother run to the door, alerting the neighbors about what has happened to your mother.\n\n\nThey crowd around the bedroom, trying to find different ways to wake her up. \n\n\nIt is at this point where you all have come to the conclusion that she has died.", "action_results": [{"action": "A Few Months Later", "result": "It has been a while since your mother's death. Those days have included a lot of crying and anger. You don't know why your mother could just do something like that. \n\n\nNow you and your grandmother live in an apartment in Saigon. The house you lived in would be too much to pay for. Your grandmother works hard to earn the money you and her need to pay for rent and food. \n\n\nYou can't afford school because it is too expensive, so your grandmother also has to put time out of her day to teach you.\n\n\nOn one ordinary day, your grandmother asks you to walk with her to the store.\n\n\n \n\n ", "action_results": [{"action": "You walk with your grandmother.", "result": "You've never been outside a lot, so you figure it'll be fun to go shopping.\n\n\nThe path you take to the store is unfamiliar to you. \n\n\nYour grandmother finally stops at a square, two story building. The sign above it says \"Holt Center\".\n\n\nYou can hear children playing in the fence surrounding it. You think to yourself, What were they doing here? Why aren't we at the store yet? \n\n\n Your grandmother walks inside the building, you stay in front of the door. You can hear your grandmother talking, and doing some sort of negotiating. \n\n\nWhen your grandmother is done, she walks out, and two adults wearing identical blue shirts follow. \n\n\nLong...\n\n\nThese people are going to take care of you from now on. You'll be safe with them, and meet many friends. Please listen to your grandmother.", "action_results": [{"action": "Okay.", "result": "You decide that it's time for your grandmother to rest. Since your grandmother is getting older, she doesn't deserve the task of supporting a family. Thank you... She quietly says.\n\n\nThe adults take you inside the square shaped building. As you walk down a long, narrow hallway, children gather around. They quietly start talking amongst themselves, most of it you can't understand. \n\n\nWell, here we are! One of the adults next to you say. The room is stacked with bunk beds, night tables, and scattered toys. A window between two bunk beds show the street below. \n\n\nAfter looking through the window, you can see your grandmother walking down the sidewalk. You try waving to her, but she doesn't respond. She'll be fine. A woman says in a calm voice. She puts a hand on your shoulder, So, are you ready to meet your new friends? Or do you want to stay here?\n\n\n ", "action_results": [{"action": "Stay here and rest", "result": "It's been a long day for you, so some sleep would be wonderful. You ask where the shower room is, and an adult takes you there. \n\n\nAfter a long, warm shower, you put your pajamas on, and go to bed, thinking about your grandmother.", "action_results": [{"action": "The next day", "result": "On the next day, you get to know more children at the Holt Center. You begin to realize how fun the Holt Center is. School there is fun, and you get to play with your friends all day and the adults there help you with your needs.\n\n\nThe next few months have been nothing special. Play with friends, learn new things. Life there couldn't be much better, but you still think of your grandmother...", "action_results": [{"action": "Chapter 4: Your New Family", "result": "On an ordinary day, an adult walks to you with good news. Long, you might get adopted soon.  You've heard about adoption between the kids here, and you start to wonder, Who will take care of me? Will they be mean people? \n\n\nThe adult continues Don't worry Long, you have two choices to choose from. Both families are in America, and they look like nice people. \n\n\nYou're then shown the pictures of both families. One picture contains four men, with light colored skin as the adult with you, and hair that is shiny. A woman sits in the background, slightly above the men sitting down. Under this picture it says The Steiners.  The other picture contains a picture of a man in a hat, sitting with a boy and a girl, with a woman standing on the far right. They look similar to the Steiners.  They seem to be in some sort of wooden house, and a fireplace could be seen burning in the background. They all have wool sweaters on. Under the picture, it says, The Rogers. They all look like nice families, but you don't know which one to pick. ", "action_results": [{"action": "The Steinrs", "result": "You choose the Steiners. It was a hard decision, but your gut told you the Steiners were the better choice. \n\n\nAlright, I'll let them know. But first, we need to take a picture. The man gives you a sign to hold, and he tells you to go to the balcony. \n\n\nYou walk to the balcony, and hold up a sign. The Sign says Hello! My name is: Long. Perfect.The man says. \n\n\nYou're really excited to meet your new family soon, but you hope that you can see your grandmother for one last time. \n\n\n \n\n ", "action_results": [{"action": "A few months later", "result": "After playing with the chidren, the man you saw a few months ago when he showed you the Steiners asks to talk to you. We called back the Steiners, and they said they are prepared to adopt you still. We plan to get you to your new family soon. About a month from now. Your face lights up, and you're relieved that you'll get to move to America. \n\n\nYou run back to the children, jumping around in excitement. I'm being adopted! I'm being adopted! The children get excited too, and start asking questions. After quickly answering them, you lie down on the floor, exhausted from your excitement. You still plan to say goodbye to your grandmother, eventually.", "action_results": [{"action": "Chapter 5: The Flight to Freedom", "result": "A few months go by, you are about to leave for the American airport in the Philipines.\n\n\nYou and the children line up in front of the street.Two buses are parked by the sidewalk of the Holt Center. Alright kids! We're heading to the airport. It is a long way there so make sure you pick a good friend to sit next to you! Before you get on the bus, a person's had gently holds your shoulder. Long... You hear the soft sound of your grandmother's voice. You've grown so big! They must take good care of you. Your grandmother looks well. She isn't overly thin and has nice clothes on. One of the neighbors helped me get to a retirement home. I'm doing well Long, and I hope you will too in America. You jump off the bus steps to give your grandmother a long hug. I'll miss you Long... You quietly whisper. Me too. \n\n\nOne of the adults slowly separates you two. It's time Long... You let go of your grandmother. You look at the two busses. Both of them have your friends sticking out the window. You're the last one left, so hurry and choose! ", "action_results": [{"action": "The Left Bus", "result": "You take the left bus. As long as you all were going on the same plane it wouldn't really matter. \n\n\nAs the bus drives down the road, you can see your grandmother waving goodbye. Bye grandma... You think to yourself.\n\n\nThe airport in Saigon is surprisingly empty. To your surprise, an unfamiliar bus is parked in front of yours. The adults on your bus get off. They walk into the airport. Your friends are talking amongst themselves, wondering if they'll be able to get on a plane. ", "action_results": [{"action": "Wait for a half hour", "result": "You don't feel like getting in trouble, so you decide to just wait. \n\n\nDuring a long conversation with a kid sitting next to you, you can hear a big explosion. The kids in the bus start screaming. You close your ears from the loud noise. What has happened? You think to yourself. \n\n\nA man you've seen from the Holt Center walks on the bus. The schedule has changed, it's time to leave. The bus turns around. You ask the kids around you what they thought caused the explosion. They shake their heads.\n\n\n ", "action_results": [{"action": "The next day.", "result": "You soon find out that a plane full off adopted children like you has crashed, causing the explosion. You and the other children are scared to leave now. But your fears go away when you see your grandmother at the entrance. You run up to her and give her a hug. Hello Long. She says to you. I've heard about what happened at the airport, so I wanted to see if you were okay. You respond.  I'm fine grandma. You continue to hug her for a few more minutes, never thinking of letting go.", "action_results": [{"action": "A few weeks later...", "result": "The adults tell you to pack your bags again. Some kids refuse, and hide in the closet. While the adults try to get them to come out, you see your grandma again, waiting outside your bedroom. It's time Long. She helps you pack your bags. Grandma, when I leave, what will happen to you? She pauses, and after a few seconds, she replies. I'll be at the retirement home, of course. Resting. But don't worry about me, You haven't lived your life yet. I already have. Just, be sure to make the most of it. After you are finished packing, she gives you one last hug. \n\n\nOne of the adults from the Holt Center walk inside. I'm sorry ma'am, but we are really in a hurry so if he's done he'll have to go right now. Your grandmother nods, and the adult grabs your hand. Goodbye Long. Your grandmother tells you. \n\n\nAfter getting one last glimpse of your grandmother, the doors close, and the adult helps you onto the bus. ", "action_results": [{"action": "Get to your seat.", "result": "You can see the adult you were with talk to the bus driver. Drive fast please. He tells the driver. I don't want anyone trying to get on. The driver nods, and the bus quickly starts to move. \n\n\nOutside, you can see adults holding children in their hands, begging for someone to take their child somewhere safe. You put your hand on the window, but they pass by quickly. \n\n\nAfter getting to the airport, the Holt Center adults quickly warn the children. Alright. We have to hurry, so let's go! The children all run off the bus in excitement. Outside, you can see a crowd of adults with children behind the airport fence. They look scared. As you are turned around, children behind you pushed you forward. \n\n\nInstead of going through the airport, you go through a small room which leads to the airport. You can see the big plane now. It is green, and has the logo U.S. Air Force with a star inside a circle. A hatch opens from the bottom of it. It is a ramp which has people in green sitting inside. You quickly recognize that they are American G.I.s, like the ones in your old village. \n\n\nYou run up the ramp with your bags. Then a G.I. puts some sort of harness on you as you sit down. \n\n\nAfter the last kid and adult are on the plane, you can hear one of the G.I.s talking through some sort of radio. Baby-Carriage 3 is ready. Standing by for liftoff.  Shortly after, the ramp raises, and the plane starts to move. You get excited.You're almost to America. But your excitement fades away with the thought of your grandmother. You start to cry, wishing you could bring her with you. ", "action_results": [{"action": "Chapter 6: America", "result": " The plane lands at the U.S. air base in the Philippines. You say your final goodbyes to your friends, and get on a separate plane. It looks small than the one you were on earlier. \n\n\nOnce your plane lands in America, an adult leads you to your new family, the Steiners. \n\n\nThe Steiners we're excited for your arrival. They had balloons and a teddy bear for you. You find out your new name is Matt. You also find out that the three boys in the picture are now your brothers, and the older looking man in the picture is your Dad.  In America, they teach you all about religion and what they do for a living. They also change your clothing and hairstyle. You wondered why Americans look so weird. \n\n\nFood was the hardest part to get used to. Instead of the fresh food you've eaten in Saigon, the food was precooked and it tasted gross. But you managed it.  \n\n\nSchool was also hard. A lot of the kids called you rude names, mostly because of your race and the things you don't know as a foreigner. \n\n\n \n\n ", "action_results": [{"action": "Plenty of Years go by...", "result": "After growing up and having a family, you decide it's time to go back to Vietnam. \n\n\nWhen your plane lands at the airport, you can see a big sign on the ceiling that says, Welcome to Ho Chi Minh City. Although you still hear the locals call the city Saigon.  The guards at the exit examine your American passport. They glare at you slightly, but approve it anyway.\n\n\nYou travel around Vietnam, visiting your mother's village, and then the Holt Center. And finally, to your grandmother's retirement home. \n\n\nAfter you got to America as a boy, you were able to call your grandmother. She told you what retirement home she stayed in, and the address in case you were to visit. \n\n\nYou go to the front desk, and ask for documents about the location of your grandmother. After getting the papers, you find out where she is: in a small cemetery outside the city. After driving there you look for your grandmother's grave. ", "action_results": [{"action": "Look on the left side", "result": "You decide to look on the left side of the cemetery. You and your family go row by row, trying to find where your grandmother was buried. \n\n\nAfter an hour of searching, you still can't find it. \n\n\nIt is almost getting late, and your family is tired of walking. After sitting down on a bench nearby, you think about what to do.", "action_results": [{"action": "Find a hotel to stay in", "result": "You decide that it is time to rest. The hotel you find sits by the heart of the city. \n\n\nYou and your family quickly fall asleep, you feel guilty for not finding your grandmother's grave.", "action_results": [{"action": "The next day.", "result": "You go back to the cemetery. Your grandmother's grave must be here somewhere.", "action_results": [{"action": "Check the right side.", "result": "You decide to check the right side. \n\n\nYour family walks row by row, trying to find where your grandmother was buried. \n\n\nYou still can't find your grandmother after checking all the rows of graves. \n\n\nBut there's one grave, on top of the hill with a tree hanging above it. It interests you.", "action_results": [{"action": "Head to the grave on the hill", "result": "After walking to the lone grave on top of the hill, you crouch down by it to read what it says.\n\n\nThere was only one word on it that you cared about. \n\n\nBa. The name of your grandmother.\n\n\nYou stand before your grandmothers grave, looking down on it. Your family crowds behind you to look at it too. \n\n\n                                                                          THE END", "action_results": []}]}]}]}, null]}, null]}]}]}]}]}]}, {"action": "Sneak off the bus to see what's going on", "result": "Tired of waiting, you hop out the bus window. It is a long way down, but you land safely. \n\n\nAfter sneaking past any adults, you crouch behind a garbage can in front of the airport building. From here, you can see a man from the Holt Center talking to someone. The man he is talking to is wearing some kind of police uniform, with a tiny box with a wire sticking out of the side.\n\n\nSir, we were scheduled to get here first! Who's bus is this anyway? \n\n\nThe man with the police uniform answers. Don't worry. We have another plane scheduled to take your kids as soon as their plane leaves. \n\n\nThe Holt Center man nods. Alright, I'll tell the kids. Just be sure you- Before the man could finish, a loud explosion is heard behind the airport. Tower, what was that? You can't understand the chatter from the radio on the guard's shoulder. Sir, stay here. You know that bus that got here first? Well, their plane just went down. The guard finishes, and runs back into the airport. The Holt Center man is starting to walk back on the bus. Time to get back inside!", "action_results": [{"action": "Sneak back onto the bus.", "result": "You run towards the window you jumped out from. The kid you sat with tries to lower his hand through the opening. He yells, you barely make out what he is saying from the cries and talking from the children inside.\n\n\nHurry up Long! The man is getting closer to the bus. You don't know if you can reach his hand in time. There's an emergency door in the back. Maybe you can get in through there.", "action_results": [{"action": "Grab the kid's hand", "result": "You decide that going through the window would be quicker. After all, the bus driver gave assigned seats before you all got on, so she wouldn't notice. \n\n\nYou put your foot on the tire of the bus. It is barely high enough for you to be able to grab his hand. You jump up and let your feet press against the wall of the bus, just above the tires. You ready Long? The boy yells. You respond. Yea!  \n\n\nThe boy pulls, hard. Your feet let go of the wall, and you just barely manage to squeeze through the window. After putting on your seatbelts and closing the window, you wait for the bus driver to check on you. \n\n\nShe walks by your seat, and checks her list of names. She nods, and walks by. \n\n\nThat was awesome, Long. The boy next to you quietly says. You exchange high-fives. \n\n\nThe man from the Holt Center you saw outside comes back. The schedule has changed. It's time to head back. As the buses turn around, you slowly fall asleep. \n\n\n ", "action_results": [null]}, {"action": "Try and go for the emergency door in the back", "result": "You run to the emergency door in the back. After pounding on the glass, a face appears. It is the bus driver. Long, what do you think you're doing?!?!?! You can hear her muffled voice through the door. The door opens, and you hop inside. I don't know why you'd jump out like that, but this won't go unpunished! After she walks back towards the entrance, you get back to your seat. The man from the Holt Center you saw outside walks into your bus. The schedule has changed. It's time to head back. As the buses turn around, you slowly fall asleep. ", "action_results": [null]}]}]}]}, {"action": "The Right Bus", "result": "You take the right bus. As long as you all were going on the same plane it wouldn't really matter. \n\n\nAs the bus drives down the road, you can see your grandmother waving goodbye. Bye grandma... You think to yourself.\n\n\nThe airport in Saigon is surprisingly empty. To your surprise, an unfamiliar bus is parked in front of yours. The adults on you bus get off. They walk into the airport. Your friends are talking amongst themselves, wondering if they'll be able to get on a plane. ", "action_results": [null, null]}]}]}]}, {"action": "The Rogers", "result": "The Rogers look like nice people. It was a hard decision, but you felt it was the right one.\n\n\nAlright, I'll let them know. But first, we need to take a picture. The man gives you a sign to hold, and he tells you to go to the balcony. \n\n\nYou walk to the balcony, and hold up a sign. The Sign says Hello! My name is: Long. Perfect.The man says. \n\n\nYou're really excited to meet your new family soon, but you hope that you can see your grandmother for one last time. ", "action_results": [{"action": "A few months later...", "result": "While playing with the other children, the same man you saw a few months ago walks up to you. Long, the Rogers just called. Unfortunately, they have had financial trouble, and can't adopt you. Those words strike you, you think to yourself, Who will be my family then? Will I have to stay here? Your eyes begin to tear up, but before you do, the adult interrupts you. So in response, we called back the Steiners, and they said they are prepared to adopt you still. We plan to get you to your new family soon. About a month from now. Your face lights up, and you're relieved that you'll still get to move to America. \n\n\nYou run back to the children, jumping around in excitement. I'm being adopted! I'm being adopted! The children get excited too, and start asking questions. After quickly answering them, you lie down on the floor, exhausted from your excitement. You still plan to say goodbye to your grandmother, eventually.", "action_results": [null]}]}]}]}]}, {"action": "Meet your new friends", "result": "There were plenty of kids back in the hallway you walked by. Maybe one of them could be friendly.\n\n\nThe lady walks beside you down the hallway leading to the kids area. The kids here are just like you Long, without a home. At this place, we try to give them the care their parents couldn't give them. \n\n\nAfter a few minutes of walking, you get to the children's area. The kids there all stop to look at you. \n\n\nThis is Long, he's a new kid here so please be nice to him. The lady behind you tells them. You slowly walk towards the center and stand still. What are they going to do to me? You wonder. The children gather around you, and surprisingly, say hello.", "action_results": [{"action": "Talk to them", "result": "You soon find out how nice and kind the children are. They present themselves, one by one.\n\n\nAfter a few minutes they show you their toys and what they do. One of them knows how to ride a bike. Another knows how to do a cartwheel. Wow... you think to yourself. I wish I could do those things.\n\n\nA few hours of playing with your new friends go by. It is getting late.\n\n\nTime to go to bed children! One of the adults says after walking towards you.", "action_results": [null]}]}]}]}]}]}, {"action": "Leave her to sleep", "result": "You decide that your mother needs the sleep she could get\n\n\nThere is suddenly a knock at the door. \n\n\nHello Long, we've been hearing bad things about your mother and we just want to check on her.  They're nearby neighbors, holding flowers and various foods in their hands. You decide that your mother needs the comfort and support of your neighbors to help her get through these tough times. You walk to the bedroom.", "action_results": [null]}]}]}]}]}]}]}]}]}, {"action": "Stay inside", "result": "Your mother never said you could go outside, so you decide to stay in so you don't get in trouble.\n\n\nAfter a few hours of playing with toys in your living room, mother finally comes back. \n\n\nLong, the GIs have just attacked a home with Viet Cong hiding inside. Just remember that you should NEVER go outside without my permission. Please, I want you to be safe. Listen to your mother. You nod, and then go to bed.", "action_results": [null]}]}]}]}]}]}]}]}]}]}