{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=9361", "context": "", "first_story_block": "You and your buddy Ben gather your cheap spelunking gear from the corner of his basement where you keep it and hoist it up the narrow steps to his living room.\n\nHis mom is sitting there the same as when you’d come in, still in her bathrobe, a green terry cloth robe Ben said his dad gave her, that’s how old it is. You head through the room without saying anything since she never responds when you do anyway, not so much as a \"hi there\" even though you've been her son’s best friend since the two of you dominated the kindergarten playground together. It gives you the creeps to see Ben try to talk to her. He's never tried to do what the rest of us would do if our mothers were walking, breathing vegetables like her. We’d have lost it long ago, taken her by the shoulders, slapped her, told her to fucking snap out of it. But not Ben. He lingers behind you, and you know he is bending down to kiss her on the cheek.\n\nWhat do you do next?", "action_results": [{"action": "Enough is enough with Ben's mom. Someone needs to get through to her. You spin around on one foot, determined to get a reaction, if only for your friend Ben's sake.", "result": "\"Excuse me, Mrs. Anderson,\" you say, and you cannot stifle the thought that you sound like that character in The Matrix but know that this is no time for movie references, no matter how apropos.\n\nBen is suprised by your sudden need to address his mother. He stands there, his hands swinging nervously at his sides, as if he's struggling against the urge to take physical action against you, and you push on.\n\n\"Mrs. Anderson,\" you say again, as the first one didn't succeed in getting her eyes to shift from the TV screen to you. This one doesn't either. You clear your throat. \"Mrs. Anderson! Please look at me!\" You're practically yelling now, your voice booming over the laugh track.\n\nSlowly, ever so slightly, her head tilts up. Her eyes settle on your chest, then make their way up your chin to your eyes.\n\n\"Well. Just who. The fuck. Are you?\" she bellows. Her voice sounds gravelly, nicotine-charred. Her blue eyes are the emptiest eyes you've ever seen. Looking into them makes you feel as if you're falling down a mineshaft. The back of your neck goes cold, and you step back, feeling Ben's hand on your shoulder.\n\n\"Get the HELL OUT OF MY HOUSE!\" she screams. Ben grabs your arm, you both snatch the spelunking gear, and you're out of there.", "action_results": [{"action": "Meet up with Rick", "result": "You and Ben wait for Rick to pull up in his rusted-out Cavalier. They’ll probably make you drive as usual, seeing as how they're all jealous of your sea-green Chevy Nova. Black vinyl seats, a beautiful, flawless paint job that you applied yourself, a car with curves like Kelly Siegel, you always say; she's a girl who goes to your high school.\n\nRick pulls up, foul black stuff coming out of his tail pipe. “You guys want to help me with this exhaust problem this weekend?” he asks.", "action_results": [{"action": "Oh, yeah. Can't pass up an opportunity to mess around with somebody else's car.", "result": "Rick gives you a high-five, and you drop down to take a look at the underbelly of his car. Just like you suspected: The exhaust system is pockmarked worse than your face was before you discovered Stridex pads. The salt they put on the roads at the merest hint of a snowflake here in Southern Illinois wreaks havoc on cheap cars like Rick's. You're in for more than a weekend job helping your buddy, but that's OK. If he wants to sink burger money into a car that ain't worth it, that's no skin off your nose. It'll be good practice for when you go for your automotive tech certification.\n\nPlus, you made Rick happy. He'd never fix his car without your help.", "action_results": [{"action": "Drive to the Caves", "result": "You pile into your Nova, Ben riding shot-gun and Rick lying down in the back seat. He pretends he's being chauffeured around town, as if he were one of the Cardinals baseball players who live in those brand-new houses out by the golf course. Or Jimmy Connors, who is from Belleville, which everybody likes to point out as if it validates their existence in this cow-town. Rick mimics Ozzie Smith, complaining that his wrists are sore from all the backflips he did in the outfield last night, which is pretty funny considering that Rick is what they call \"husky.\" Nothing so much as a two-step has been performed by that guy since he was six.\n\nBen fiddles with your radio, but there isn’t anything good on. “When you going to get a decent tape deck in here?” he asks.\n\n“When you start giving me gas money, that’s when,” you tell him, and that shuts him up.\n\nYou quickly make it out of town and are curving around cornfields full of giant harvesters. You roll your window down to smell the sweetness, a little like candy corn before you’ve eaten too much to taste anymore.\n\nSuddenly Rick, says, “Did you all hear about the dead body they found out in one of these caves?” You know he likes to exaggerate and make shit up, so you don't bite. “Might be the cave we’re going to,” he says, dragging it out.\n\nYou decide to take the bait. “No, Rick, we haven’t heard. Why don’t you tell us?”\n\n“Yeah,” he says, sitting up and putting his elbows on the backs of your seats. “Some guy with his dick cut off.”\n\n“No!”\n\n“Yes, your honor. The man has no dick.”\n\n“Shee-it.” You and Ben laugh, realizing that Rick is quoting “Ghostbusters.” All three of you know every line because your family owns a second-hand VCR that came with just that one movie, and since nobody else's family has a VCR, you've all seen the movie about 50 times.", "action_results": [{"action": "Inside the Cave", "result": "The cave the three of you enter today is a new one for you, a real beauty, nice and clean-smelling limestone with fingerlike projections of rock, boulders stacked like furniture. You and your friends live for the world of the cave, where nobody is around to mess with you, none of those pansy-ass suits who commute to St. Louis everyday and look down their noses at you. The caves are your world, and in them, you feel like kings.\n\nYou shine your flashlight on a few tiny bats clinging to the rocks, wings tucked in like little Draculas sleeping the day off. The three of you crawl through passageways no wider than your shoulders. Pale white plants, like tiny mushrooms, grow along the floor.\n\n“Hey, check this out,” Ben says. He stares into a room full of pure, clear water. Over the water, draped like banners, are hundreds and hundreds of spider webs. You lean in, shining the flashlight on them: spindly white spiders, many carrying egg sacs, which vibrate as if about to burst open.\n\nRick comes up behind us. “I’m not setting foot in there,” he says.\n\nWhat do you do?", "action_results": [{"action": "Death to the spiders!", "result": "You take the walking stick you thought to bring with you and use it to hatchet across the silken webs, destroying the delicate swathe hanging over the water, and hundreds of spiders, along with hundreds of gestating embryos of spiders in their little vibrating egg sacs, plunge into the water and drown.\n\n... But wait a minute. What did these lovely, ghostly white cave spiders ever do to you? It's not like you're a hobbit trying to get past evil monsters with your sword Sting. This isn't that kind of story, and you're just a dude with a stick.\n\nGame over for you, sadist.", "action_results": []}, {"action": "Rick is right. Spiders, ick.", "result": "\"Just look,\" Ben says, so you and Rick do. You realize the spiders aren't threatening or disgusting; they're beautiful to watch as they spindle their webs and move slowly around the network of fibers that glow in the pale cave light. You can't help but let out a long, low, appreciative whistle, the echoes reverberating across the cave walls. Once your whistle dies down, the three of you turn around and keep going.\n\nYou crawl around nooks, through crannies, some spots wet and muddy, and soon, your jeans are soaked. You can feel water squishing in your boots. There are more ghost spider rooms, and you stare in at them, none of you willing to disturb the drapes of white webs glistening with moisture.", "action_results": [{"action": "Head Further into the Cave", "result": "A while later, Rick leads you down a passage that keeps getting narrower and narrower. You follow him, your gloves like muddy paws in front of you, Ben’s breathing behind you making you feel like he is sucking up your air. Then your head bumps into Rick’s ass.\n\n“What’s the deal?” you ask.\n\nHe's quiet, wriggling around in the dark in front of you.\n\nThen Ben stops in time to avoid bumping into you. “What’s the hold-up?”\n\n“Rick?\" you ask. \"What do you see?”\n\nRick laughs. “Nothing. I can’t get my flashlight out in front of me. I think I’m stuck.”\n\n“Like a pig in mud!” you hoot. You all have a good belly-laugh at that one. Ben tries to back out of the tunnel, but it's too narrow for him to turn around. You have to pull Rick free, and then you and Ben back out first, Rick coming after you.\n\n“I think it’s time for lunch,” Rick says, patting his belly.\n\n“That’s just what we need,” you say. “For you to eat more so we can get stuck for good.”\n\n“Hey, you’d get stuck in there, too,” he says, pointing. “Give it a try, Slim Jim.” \n\nYou get back down on all fours and try to get through the opening but can’t.\n\n“Okay, Chubs,” you say. “You’re off the hook this time.”\n\n“The meat hook that is,” Ben adds. You and Ben about piss your pants laughing. But Rick ignores you, scratching his head, looking around at the cave walls.\n\n“Which of these other passages did we come down?” he asks.\n\n“That one,” you say, pointing to the one on your right.\n\n“Naw, this one,” Rick says, thumbing at what looks like the wrong passage.\n\nBoth of you look at Ben to break the tie, and he shrugs his shoulders.\n\n“There's only one way to settle this,” Rick says, smiling.", "action_results": [{"action": "Settle the Disagreement", "result": "Rick holds his hands out, one fist on top of a flattened palm. It's the universal sign for Rock, Paper, Scissors.\n\nWho wins?", "action_results": [{"action": "Your scissors cuts Rick's paper", "result": "You scissors your fingers across Rick's outstretched hand just to emphasize your win. Rick looks pained, and not just from losing at Rock, Paper, Scissors: He really thinks his passageway is the right one to take. He glances at Ben again, and again, Ben shrugs. He's the type of guy who learned a long time ago just to go with the flow, that winning battles against those closest to you always gives you an empty kind of victory.\n\nThere's a lot at stake in this moment: your ability to get out of the cave, not to mention the strength of your friendships with these guys. What happens next in part depends on what's happened in the past, how you've been to each other up till this moment. Remember when Rick asked you to help him work on his car exhaust? What did you tell him?", "action_results": [{"action": "Yes. It was a win-win situation.", "result": "\"You know what?\" you say. \"Rick, if you're sure your way is the correct way, I can go along with that. I'm not a hundred percent sure mine's the right one.\"\n\nIt's a shift in the balance of your relationship. Up till now, you've been the alpha male in the group, usually getting your way in all disagreements because Rick isn't quite as strong as you are, and Ben just wants peace.\n\n\"Yeah?\" Rick asks, his voice betraying excitement, if a little disorientation, at your gesture of friendship.\n\n\"Yeah.\"\n\n\"Well, all right.\" Rick says. \"I'm sure mine's the right one. Let's step on it.\"", "action_results": [{"action": "Follow Rick", "result": "You crawl around for a long time, hours it seems, and none of the passages you come to look like the one you’d been down before, and then you have to belly-crawl when the passages get narrower. It seems like you’ve got down to some old passages that nobody ever prowled around in, and you feel colder than you've ever felt in a cave. The further you crawl, the more you need your flashlight to see.\n\nRick checks his watch at one point, and it’s been six hours since you left Ben's house. You don't know if you are going deeper down into the earth or heading back toward the cave mouth. Your internal compass seems to swing around in wild circles, like compasses that go haywire when aliens land nearby. Your chest tightens, you all crawl faster, breathing hard, no one saying anything. When none of you can pretend like you aren’t for sure lost in the cave, you stop. You and Ben don't feel like telling Rick it is all his fault. And you don’t need to.\n\n“Damn it, damn it,” Rick says. “I’m an idiot. I picked the wrong way.”\n\n“Naw, man.” you say. “Could have been my route. We’d be in a different part of the cave, but we’d still be lost.”\n\n“Yeah,” Ben says. “No telling which one was the right one.”\n\n“I got some candy bars in here,” Rick says, as if it's a peace offering, opening his backpack.\n\n“Dude, you’ve been holding out on us,” you say. “Don’t know if it’s because I know I’m trapped here or what, but I’m suddenly hungry. Got any beer in there to wash this down with?”\n\n“Nope,” Rick says. “You know I don’t touch that stuff.”\n\n“Sure would make being stuck in a cave a little easier right about now,” you say. Rick is quiet.\n\n There are two Hershey's bars. What should you do?", "action_results": [{"action": "Eat the Hershey's bars. You'll never get out of the cave if you don't get sustenance.", "result": "“Let’s get going,” Ben says once you've polished off the Hershey's. “Mosey on out of here.”\n\nThe three of you follow Ben, who seems to get a rush of energy from the candy bar. Those skinny guys are like that, fast little motors in them like a gerbil in a treadmill. You try not to think about the corpse Rick said they found, the one with his dick cut off. You hadn’t bothered to ask him if he made that up. And now you don't want to know. You try not to think about how you don't have any food, that you hadn’t told anybody where you were going, that it is just your car parked in a cornfield to signal that the three of you are down here. In your mind, you try to calculate how far you've walked and crawled, and how far from the opening of the cave you've come. You can't picture it right: just a series of identical rocky rooms. The white spiders seem a long way off now.", "action_results": [{"action": "Become Introspective", "result": "You keep thinking about this guy they’d brought to your high school once, part of their tough love campaign. They brought in cops and military men to talk to students about the “real world” that you would encounter after graduation. Their speeches were always graphic, which was entertaining as hell, but you got the feeling they were exaggerating just to scare you straight.\n\nThe latest guy had been a POW in Korea. He told you they made him eat maggots and kept asking him for information he didn’t even have, not that he would have given it to them if he had, he said. But you had to wonder whether or not he would have cracked. You have a theory that most people cracked, despite what TV and the movies want you to think. Those were the good stories, right? The bad stories probably never saw the light of day. With this guy, the North Koreans thought he was lying and so they jammed metal files under his nails or just beat him up all the time. The worst part, according to him, was being put in the hole, a 5-foot-by-5-foot box where he’d have to crouch for weeks at a time. All he gave them was his name, rank and serial number.\n\nYou all decide to take a break, sitting in the pitch black darkness to conserve your headlights, cold and shivering then because the damp has leaked through the top layers of your clothing and down to the skin. You're all quiet. Rick stretches out on the ground to take a nap. After a while, you decide to ask Ben about his dad. “Ben?”\n\n“Yeah?”\n\n“Think your dad might have been a POW?”\n\n“Hard to say,” he answers. “Most of my family just say he’s MIA, like he’s just lost in the jungle or something. Like once he finds a map, he’ll be back. But he might have been killed during the war. Or he might be rotting in some moldy old jail cell. I think he’s dead. There’re thousands that are probably dead, their bones in some rice paddy.”\n\n“I can’t imagine,” you say.\n\n“Can’t imagine what?”\n\n“Any of that stuff—dying in war, torture.”\n\n“Me neither.”\n\n“What’s it like, man,” you ask, “to grow up without a dad?”\n\n“You don’t miss what you never had.”\n\n“Yeah, but it’s got to be weird, you know, not ever having a dad. Don’t you think about it all the time? Don’t you miss him?”\n\n“Yeah, I guess.” Ben pauses as if he's thinking about how to say something that has been on his mind a long time. “You know Skeeter and those guys up at the VFW hall?” he asks. “Talking about that phantom limb syndrome? They say they feel it tingling where there used to be a leg or arm or even a pinky finger. Like when your hand itches but you can’t find the scratch anywhere. He went MIA when I was like three years old. I can’t miss someone I never even knew. But it’s like he’s supposed to be there, you know?”\n\nYou think of your own father, who left your mother and is now shacked up with some chick he used to work with who's half his age, and you feel envious of Ben for not having to deal with a father at all. “Sometimes I wish my dad was MIA,” you say.\n\nBen suprises you by grabbing your shirt, harder than he’d ever laid a hand on you before. “Don’t say that shit,” he says. “Don’t say shit you don’t mean.”\n\nYou shrug off his hand. “How do you know I don’t mean it?”\n\nBen is quiet a while, like he's trying to calm down.\n\n“You and me,” he finally says, “we’re opposites. I don’t know what it’s like to have a dad who up and leaves. You don’t know what it’s like to grow up wishing you had a dad. I could tell you that I’d rather be in your shoes, but you’d probably tell me the same thing.”\n\n“Ain’t that the truth,” you say. “Do you remember him?”\n\n“Just this one thing,” he says. “I kind of have this shadowy memory of him dressed up as Santa Claus. I think I pulled his beard down, but it could be I just remember it from my mom telling the story. You know how that is. But it seems like I can remember him bouncing me on his knee; that’s how I pulled the beard off. He was bouncing me too hard, and I thought I’d fall off, so I grabbed hold of the closest thing.”\n\nYou pick up a dead root and start carving the dirt with it even though you can't see the shapes you're carving.\n\n“You really don’t think he’s ever coming back, do you?”\n\n“Nope.”\n\n“You guys never had a funeral.”\n\n “My mom thinks he’s coming back. She’s still waiting.”", "action_results": [{"action": "A Strange Sound", "result": "None of you say anything for a bit, and you hear a little chipping noise, like a squirrel trying to crack into a nut. “You hear that?”\n\nYou crawl in the direction of the noise. Then you shine your light on Rick and laugh. “It’s just Rick,” you say. “His teeth are chattering.”\n\nBen crawls over. Rick’s teeth are going a mile a minute. He touches his face.\n\n“He’s ice-cold,” Ben says. “We got to wake him up. He could go into hypothermia.”\n\n“Shit,” you say, mad that you hadn’t thought of it when Rick stretched out for his nap. “Wake up, Rick!” you yell. You shake him. “Wake the fuck up!”\n\nRick wakes quickly, looking confused. “Where am I?” he chatters.\n\nYou and Ben each grab a shoulder and lift him up. “Man,” Rick says, shaking his head as if he is groggy. “I am trapped in a goddamn cave. I was hoping it was a nightmare. I don’t feel so good, guys. I’m cold. Why’d you wake me up, anyhow?”\n\n“No, Rick,” you say. “You can’t go to sleep. You’ll go to sleep and never wake up, you know what I mean?”\n\n“I wish we’d brought more clothes,” Ben says. “A wool jacket or something. It’s always colder than you think it’s going to be in the caves. Bunch of idiots, that’s what we are.”\n\n“Let’s sit together,” you say, scooting up close to Rick’s side. “Use our body warmth.” Ben does the same on the other side, and soon, Rick’s shivering slows down. But you are aching with cold on the side away from Rick. “Let’s huddle,” you say, motioning for Ben to move around so that you are touching on all sides. It's weird, sitting that close to Rick and Ben, but you don’t care.\n\n“We’re going to have to keep each other awake,” Ben says. “Body temperature drops when you’re sleeping. That’s why Rick fell out like that.”\n\n“Should we keep moving, trying to find our way out?” Rick asks.\n\n“Seems like we’re just getting in deeper,” Ben says. “Maybe we should stay right here.”", "action_results": [{"action": "Keep Crawling", "result": "You don't like the thought of sitting there waiting for someone to rescue you. “Fuck that,” you say. “I’ll find my own damn way out.” You start crawling, and they follow you.\n\nYou crawl until your hands feel bloody. Rick and Ben follow, none of you making a sound.\n\n“I have to rest,” you say when your knees ache and feel you can't go any further.", "action_results": [{"action": "Huddle Together", "result": "You huddle together, Ben saying, “Remember about keeping warm.” His words come out raspy. He hasn’t had any of his water in a while.\n\n“Sip some water,” you say.\n\n“What if I run out?” Ben says, his voice hoarse. “I need to go as long as I can. I’m not drinking that muddy cave water. Make you sick.”\n\nIt's pitch dark now. Your headlamp winks out, and theirs are down to two lights that together aren’t stronger than candlelight, so they turn them out to conserve.", "action_results": [{"action": "Try to Keep Warm", "result": "You sit in the dark for hours, moments of worried chatter interspersed with quiet. All three of you are shivering so bad, when it's quiet, all you can hear is the chatter of three sets of teeth. You're so cold, you keep imagining yourself surrounded by drifts of snow. You flash back to when you were five and young enough to make snow angels, how you took the garden hoe and set it in the angel's wing to look like a devil's pitchfork. \n\n“This ain’t working no-more!” Ben chatter-yells. His voice sounds uncharacteristically uneven, as if he could break into a sob any minute. “I’m dying of cold!” he yells. “I’m going to die down here, and no one will know!\"\n\n“It’s all right,” Rick says. “We’re not going to die.”\n\nYou say nothing. Ben is yelling the same way you feel, and you can't conjure any encouragement.\n\n“What the fuck do you know?” Ben says. “This is like my destiny. My mom will have two disappeared people in her life. A husband, then a son. That’s it. Then she’ll have two people to wait for!\"\n\n“You know what I heard once, at the VFW?” Rick asks suddenly, sounding oddly calm compared to Ben’s hysteria.\n\n“This is no time for small talk!” Ben yells. “We’re dead men!”\n\n“These guys were lost in the jungle, all right, homeboy?” Rick grabs Ben’s shoulders as if to steady him, and it strikes you how much they sound like one of those dramatic war movies they show on Saturday afternoon TV. Ben is the weak guy who's losing it in the heat of battle; Rick is suddenly the one holding you all together.\n\nYou laugh. “You guys are damn entertaining.”\n\n“Shut up,” they both tell you.\n\n“They were lost,” Rich says, continuing his story. “And it was cold. You think of jungles as hot, but those jungles in Nam can fuck with you. These guys were all wet from the swamps. Soaking wet like we are. And they were lost. They were supposed to meet a supply team but got lost. You know what they did to stay warm?”\n\nNeither Ben nor you answer. You’d heard that story at the VFW, too.\n\nRick says it anyway: “They pissed on each other. It’s 98.6 degrees Fahrenheit. Body temperature. That would be great right now, wouldn’t it? A shower of about 98.6 degrees?”\n\nYou still don’t say anything.\n\n“Look, brothers,” Rick says, “we’ve been pissing in the dirt, wasting that bit of body heat, and I’m not going to do it again. I’ll piss myself if I have to, but I’d rather not waste half of it in my jeans. I’d rather use it to keep you shits from dying on me. Capiche?\"\n\nYou stand up. “Fine,” you say. “Which one of you wants it first?”\n\n“Give it to Ben,” Rick says. “Sounds like he’s about to go into a coma.”\n\nYou stand over Ben, and he holds his hands out. If it weren’t dark, you'd know for sure that they're already blue. If you get out of here, you think, will you be able to see color again?\n\nAny time one of you has to go, you use it to save each other’s life.", "action_results": [{"action": "Another Strange Noise", "result": "You think you hear a sound, a tapping sound. \"Hey, do you guys hear that, or am I hallucinating?\"\n\nThey listen, and there it is: tap, tap, tap. It's coming from above you. The three of you pick up your headlamps and start tapping back.\n\nYou see the flashlight beam of your rescuers bounce off the cave walls before you know for sure you're saved. The sound of other people’s voices is like music, some sweet old country song that makes you cry every time you hear it. They told you you've been down there for three days, but it feels like three lifetimes. You were down deep. It takes hours and hours to crawl out.\n\nAt the mouth of the cave, a TV news crew is set up, Channel 11 from St. Louis. And there is Ben’s mom, standing over by your Nova, waiting for him. She's the one who called your parents, the police, even the news station when the police wouldn't take your disappearance seriously. She is still wearing that ratty old robe, but Ben doesn't care. He hugs her so hard, it picks her up off the ground, and that’s the clip they show on TV that night, a real homecoming for everyone to see.", "action_results": []}]}]}]}, null]}]}]}, {"action": "Ration the Hershey's bars. You don't know when you're getting out of this cave.", "result": "You take one of the three candy bars, break it into three equal pieces, and hand Ben and Rick their allotments. You and Ben eat yours quickly, but Rick eats his slowly, as if savoring the taste. Then, it hits you: Rick just really likes the taste of food. You remember how he will order a soda at the McDonald's drive-through and ask for ketchup packets there even though you're headed to Arby's for a roast beef sandwich, all because Rick likes the taste of the McDonald's ketchup better. To you, there's no difference.\n\nYou turn on your headlamp and lead the way, feeling a rush of energy from your little bit of candy bar.", "action_results": [{"action": "Become Introspective", "result": "As you crawl through the passageway, the light from your headlamp bouncing off the walls, you keep thinking about this guy they’d brought to your high school once, part of their tough love campaign. They brought in cops and military men to talk to students about the “real world” that you would encounter after graduation. Their speeches were always graphic, which was entertaining as hell, but you got the feeling they were exaggerating just to scare you straight.\n\nThe latest guy had been a POW in Korea. He told you they made him eat maggots and kept asking him for information he didn’t even have, not that he would have given it to them if he had, he said. But you had to wonder whether or not he would have cracked. You have a theory that most people cracked, despite what TV and the movies want you to think. Those were the good stories, right? The bad stories probably never saw the light of day. With this guy, the North Koreans thought he was lying and so they jammed metal files under his nails or just beat him up all the time. The worst part, according to him, was being put in the hole, a 5-foot-by-5-foot box where he’d have to crouch for weeks at a time. All he gave them was his name, rank and serial number.\n\nYou all decide to take a break, sitting in the pitch black darkness to conserve your headlights, cold and shivering then because the damp has leaked through the top layers of your clothing and down to the skin. You're all quiet. Rick stretches out on the ground to take a nap. After a while, you decide to ask Ben about his dad. “Ben?”\n\n“Yeah?”\n\n“Think your dad might have been a POW?”\n\n“Hard to say,” he answers. “Most of my family just say he’s MIA, like he’s just lost in the jungle or something. Like once he finds a map, he’ll be back. But he might have been killed during the war. Or he might be rotting in some moldy old jail cell. I think he’s dead. There’re thousands that are probably dead, their bones in some rice paddy.”\n\n“I can’t imagine,” you say.\n\n“Can’t imagine what?”\n\n“Any of that stuff—dying in war, torture.”\n\n“Me neither.”\n\n“What’s it like, man,” you ask, “to grow up without a dad?”\n\n“You don’t miss what you never had.”\n\n“Yeah, but it’s got to be weird, you know, not ever having a dad. Don’t you think about it all the time? Don’t you miss him?”\n\n“Yeah, I guess.” Ben pauses as if he's thinking about how to say something that has been on his mind a long time. “You know Skeeter and those guys up at the VFW hall?” he asks. “Talking about that phantom limb syndrome? They say they feel it tingling where there used to be a leg or arm or even a pinky finger. Like when your hand itches but you can’t find the scratch anywhere. He went MIA when I was like three years old. I can’t miss someone I never even knew. But it’s like he’s supposed to be there, you know?”\n\nYou think of your own father, who left your mother and is now shacked up with some chick he used to work with who's half his age, and you feel envious of Ben for not having to deal with a father at all. “Sometimes I wish my dad was MIA,” you say.\n\nBen suprises you by grabbing your shirt, harder than he’d ever laid a hand on you before. “Don’t say that shit,” he says. “Don’t say shit you don’t mean.”\n\nYou shrug off his hand. “How do you know I don’t mean it?”\n\nBen is quiet a while, like he's trying to calm down.\n\n“You and me,” he finally says, “we’re opposites. I don’t know what it’s like to have a dad who up and leaves. You don’t know what it’s like to grow up wishing you had a dad. I could tell you that I’d rather be in your shoes, but you’d probably tell me the same thing.”\n\n“Ain’t that the truth,” you say. “Do you remember him?”\n\n“Just this one thing,” he says. “I kind of have this shadowy memory of him dressed up as Santa Claus. I think I pulled his beard down, but it could be I just remember it from my mom telling the story. You know how that is. But it seems like I can remember him bouncing me on his knee; that’s how I pulled the beard off. He was bouncing me too hard, and I thought I’d fall off, so I grabbed hold of the closest thing.”\n\nYou pick up a dead root and start carving the dirt with it even though you can't see the shapes you're carving.\n\n“You really don’t think he’s ever coming back, do you?”\n\n“Nope.”\n\n“You guys never had a funeral.”\n\n “My mom thinks he’s coming back. She’s still waiting.”", "action_results": [{"action": "The Cold Gets to You", "result": "None of you say anything for a bit, and you hear a little chipping noise, like a squirrel trying to crack into a nut. “You hear that?”\n\nYou crawl in the direction of the noise. Then you shine your light on Rick and laugh. “It’s just Rick,” you say. “His teeth are chattering.”\n\nBen crawls over. Rick’s teeth are going a mile a minute. He touches his face.\n\n“He’s ice-cold,” Ben says. “We got to wake him up. He could go into hypothermia.”\n\n“Shit,” you say, mad that you hadn’t thought of it when Rick stretched out for his nap. “Wake up, Rick!” you yell. You shake him. “Wake the fuck up!”\n\nRick wakes quickly, looking confused. “Where am I?” he chatters.\n\nYou and Ben each grab a shoulder and lift him up. “Man,” Rick says, shaking his head as if he is groggy. “I am trapped in a goddamn cave. I was hoping it was a nightmare. I don’t feel so good, guys. I’m cold. Why’d you wake me up, anyhow?”\n\n“No, Rick,” you say. “You can’t go to sleep. You’ll go to sleep and never wake up, you know what I mean?”\n\n“I wish we’d brought more clothes,” Ben says. “A wool jacket or something. It’s always colder than you think it’s going to be in the caves. Bunch of idiots, that’s what we are.”\n\n“Let’s sit together,” you say, scooting up close to Rick’s side. “Use our body warmth.” Ben does the same on the other side, and soon, Rick’s shivering slows down. But you are aching with cold on the side away from Rick. “Let’s huddle,” you say, motioning for Ben to move around so that you are touching on all sides. It's weird, sitting that close to Rick and Ben, but you don’t care.\n\n“We’re going to have to keep each other awake,” Ben says. “Body temperature drops when you’re sleeping. That’s why Rick fell out like that.”\n\nYou eat the second candy bar in an attempt to warm yourselves up.", "action_results": [{"action": "Find a Way to Tough This Out", "result": "“Maybe we should sing,” Rick says. “Might take our minds off the cold.” \n\n“Maybe we should cook you up and feast off your excess fat,” you say.\n\n“Let’s try the singing,” Ben says.\n\n“Shit,” you say. “Singing sissies. Like that’s going to help.” \n\n“Bye, bye Miss American Pie…” Ben starts, and he and Rick sing without you. You give in when they get to the Elvis songs. They remind me of the part of your dad you can tolerate, maybe even like, the guy who sings at the top of his lungs when he's happy. You sing every song you know the words to, every damn song you learned in elementary school, every Christmas song, every church song, even the alphabet song. You sing every part of the Bohemian Rhapsody and Van Halen songs both pre- and post-David Lee Roth. You sing for hours and hours, pausing to take a breath or talk or relieve yourselves when you have to.\n\nOr maybe days go by. You're beginning to realize there isn’t any time in a cave. You break the last candy bar in half first and then into thirds, saving half for later, painfully aware of how little food it is. You're cold, a cold that seems to get into your bones, turn your blood to tiny frozen rivers. It becomes hard to sing through the chattering of your teeth.\n\n“This ain’t working no-more!” Ben chatter-yells. His voice sounds uncharacteristically uneven, as if he could break into a sob any minute. “I’m dying of cold!” he yells. “I’m going to die down here, and no one will know!\"\n\n“It’s all right,” Rick says. “We’re not going to die.”\n\nYou say nothing. Ben is yelling the same way you feel, and you can't conjure any encouragement.\n\n“What the fuck do you know?” Ben says. “This is like my destiny. My mom will have two disappeared people in her life. A husband, then a son. That’s it. Then she’ll have two people to wait for!\"", "action_results": [null]}]}]}]}]}]}, {"action": "No. I rather play Super Mario Bros.", "result": "There's a reason you're the alpha male in this group, after all. You know you're right about the passageway. Rick's one of those guys who always has music or some other distracting noise playing in his head, so he never notices details, like the way the stone in the passageway you came down has long yellow veins running through it. The other passages all look blue instead. You explain this to Rick and Ben, and they can't argue with your logic. The three of you split a cache of candy bars that you thought to bring along, and then you crawl and crawl, several times resisting Rick's insistence that you've chosen wrong and should head back down the other way. It takes a couple hours, but the three of you crawl to safety.\n\nThe sun is setting when you exit the mouth of the cave. You can see it glinting off the St. Louis Arch on the other side of the Mississippi.\n\nRick is uncharacteristically quiet as you head back to Ben's house. He seems distant, less like his jokester self. As you let him out at his junker, you nod your head in the direction of it. \"Hey, maybe I can swing by and give you a little help with your exhaust system tomorrow after all,\" you say.\n\nRick stares off, at his car sitting there at the curb in front of Ben's house. \"Nah, that's OK,\" he says. \"I'll manage.\"\n\nThe three of you part ways, and you head home. As you round the cornfields this time, you see in your mind's eye a long cord stretching out between you and Rick, and you see that cord snap, the two of you drifting apart in space.", "action_results": []}, {"action": "I said no at the time, but I'm going to lie because I think it might give me a better outcome.", "result": "\"You know what?\" you say. \"I'm sure mine's the right one, and just to prove it to you, we're not going to take it.\"\n\n\"Wait. Did you just say we're not going to take it?\" Ben asks.\n\n\"That's right. Not. As in ain't. Gonna. Take it.\"\n\n\"Sweet!\" yells Rick. \"That means, I win! Let's go, boys.\" He picks up his gear and heads down the passageway.", "action_results": [null]}]}, null]}]}]}]}]}]}, {"action": "No way. Rick's had enough of your free labor.", "result": "Why spend the weekend flat on your back under Rick's hunk of junk when you could be at home, sitting on that new lounge chair you just got for your room, finishing your quest to rescue the princess? You're so close; you can feel it. Just another hour or so, and victory is yours.", "action_results": [null]}]}]}, {"action": "This family stuff isn't your business. Pause and wait for Ben.", "result": "“Bye Mom,” you hear him say as the screen door closes behind you. He might get a nod from her but that’s it, a nod without looking up, her eyes spaceylike from her pills, watching TV with the sound all the way down, as usual.\n\nYou wait on the porch under the oversized black POW/MIA flag, which rolls in crazy arcs from the October wind. One of these days you'll get around to telling Ben he should take the flag down. It's a dark omen and makes the whole house look like somebody just died when in reality, Ben’s father went MIA more than twenty years ago.", "action_results": [null]}]}