{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=54011", "context": "", "first_story_block": "The arrows never stop flying. \n\n\nCrawling through the mud, you watch as unlucky comrades around you are caught in the volleys.  A grunt and a thud, in the trench in front of you one falls, reaching his hand out to you.  Crawling over to him you rip off his armor, trying to stop the bleeding.  Almost impossible with the arrow lodged in his chest, ripping it out would only kill him faster.\n\n\nYou sit there cradling him, trying to offer some small comfort in his final moments.  He tries to speak, but only a gurgling sound emerges as crimson red trickles out of the side of his mouth.  One final sigh and his whole body relaxes, his head falls back.  His glassy eyes stare at you, only seeing emptiness.\n\n\nPlacing him down, you continue to trudge through the mud.  Around you more have fallen, and will continue to fall.  A dark purple blast of energy flies overhead, frying some unfortunate.\n\n\nYou make a run for the trees.  Never running in a straight line, you start right, then dart left as you dive behind a tree.  A few arrows lodge themselves in the ground beside you. \n\n\nDamn elves.\n\n\nYou think back to how the elves had first come peacefully.  Offering promises of power and strength.  The orcs didn't want anything to do with them and their magic.  The next time the elves showed up; however, it was in force.  Looking to capture conscripts for their fight against the Empire.  The orcs wanted nothing to do with their war, but since the elves brought it to our doorstep, we had now come to retaliate. \n\n\nThe elves, unable to fight a war on two fronts, were sure to crumble. \n\n\nBut this all started four years ago.  Turns out elves have incredible resolve... which you intended to break.", "action_results": [{"action": "Advance", "result": "Only a few miles ahead, you see the castle stronghold of the Wister Elves' king.  King Harribor, intent on delaying his final stand, hides behind his people.\n\n\nCoward. \n\n\nHe would let his enemies lay waste to his nation, rather than meeting his fate out on the battlefield.\n\n\nBy now, you've made your way to a ridge, behind which many orcs wait.  Across is another ridge, with orcs similarly stationed.  In between, dozens and dozens of orcs slowly advance: hiding in trenches, behind rocks, and amidst piles of dead comrades.  They will never make it through unless you buy them time. \n\n\nAhead, the elves had constructed wooden walls and towers.  Each had slits and ramparts to shoot their arrows and blast their magic. \n\n\nScanning the area, you see that the elve's defenses are strongest on their right flank. Perfect.  All you need to do is charge down the ridge and straight towards that tower. \n\n\nYou grab an orc by the shoulder, he looks back grunting.\n\n\n\"See how strong their defenses are on the right?\"\n\n\nHe peers out, grunting in acknowledgment.\n\n\n\"I need you all to string up, focus all of your fire in that region.\"\n\n\n\"Why? Their left is weakest.\"\n\n\n\"I know, I'm going to use that to our advantage.\"\n\n\nYou're about to leave when you pat his shoulder again.\n\n\n\"Try not to shoot me.\"\n\n\nYou backtrack down into the forest and see some lights coming from the trees.  The elves are watching their line closely.\n\n\nSeeing multiple orcs in the darkness, you stop them.  They look at you inquisitively until you explain your plan.  They are eager to follow.\n\n\nYou move back behind the ridge, close to the front lines, careful to stay in the darkness.  Peering over the top you notice something new: a system of hidden trenches filled with elves.  They must be expecting the orcs to charge at any minute and are planning a surprise in the trenches.\n\n\nYou inspect the trench immediately below you.  It leads directly to the door of a tower.  You see an officer using a dimly glowing spyglass.  Near him, and scattered throughout the trenches, are wounded elves.  Some fit to fight, some are not, and yet they'll do it regardless.  You have to respect that at least.\n\n\nYou ready your bow, and sight an elf slumped against the trench wall.  Bloody bandages wrapped around his head, he holds his dagger and appears to be praying.  He looks almost like a child, several years younger than yourself. \n\n\nAs you let loose, the rest do as well.  The elf gasps in surprise as the arrow pierces his chest.  You all fire several arrows, until each elf in front of you is pin-cushioned.\n\n\nNo one is walking away from this.  No one sounds an alarm.\n\n\nMaking your way through the trench to the nearest battlement, you ready your axe, short enough to be used with one hand but long enough for two.  You stand next to the tower door, inhaling deeply.", "action_results": [{"action": "Tower", "result": "Thrusting your foot forward, the door bursts open, splinters hitting the wall directly behind.  You storm in as a bloodied elf staggers towards you.  His eyes widen in surprise as you plant the axe into his forehead.  Thick streaks of blood creep down his face as other orcs pour past you.  You pull the axe from the fallen foe with a satisfied grunt. \n\n\nAs you enter the narrow hall, you see the wide eyes of many elves, their dead faces contorted in shock.  They... almost didn't see what hit them.\n\n\nLeading the way once more, you rise up the stairs to the next landing, your movements hidden by the sounds of battle.  You recognize the twanging of arrows. \n\n\n\"I hit one,\" one of the elves says, \"Ha! Look at him squirming!\"\n\n\nYour face contorts in rage.  Raising your axe, you step out, and embed it into their officer's neck.  You've left your axe in another's shoulder and jammed an arrow into the eye of a third before they realize what's happened.  In an instant, the other orcs are upon them.\n\n\nYou ascend to the top of the tower.  Almost immediately, an elf with bandaged hands sees you and shouts a warning to his companions. \n\n\nYou charge them, dodging arrows and bowling into them, knocking two over the edge, screaming.  The wounded one tries to bring down his sword, but you catch it between your hands.  Wrenching it away you toss the sword off the edge.\n\n\nSnarling, you prowl towards the elf; he backs up, desperately swinging as you do so.  You duck a punch and wrap an arm around his neck as you slip behind him.  His hands bat and pull at your arms ineffectually. You squeeze tighter.  With a snap, his hands go limp.  You drop him.\n\n\nFucking stick, so damn weak.", "action_results": [{"action": "Continuing", "result": "You duck down and go to the ledge, peering up and over a low wall.  Arrows are still flying; chaos everywhere.\n\n\n\"Come on, we have more towers to take out,\" you say.\n\n\nYou go to the other edge and wave to get the attention of the orcs at the ridge you left.  You signal them to storm the trenches from your side. \n\n\nBy the time you've made your way down, the orcs have already flooded into the trenches.  As the enemy loses focus in the confusion, the rest of your comrades rush in from the center to surround them. \n\n\nThe elves fight valiantly, refusing to surrender, which surprises you.  What is more surprising is that you are only able to kill a few before the orcs have completely decimated the rest.\n\n\nYou run forward to the walls watching over the trenches, where the elves are far up but their fear is visible.  All the trenches seem to lead to an underground tunnel system, with side rooms dug out for wounded and extra supplies. \n\n\nAs you enter one of them you see a wounded elf on a cot.  His chest wrapped in bloody bandages, his breathing labored.  He might not even make it, although killing defenseless people is for the weak as far as you're concerned. ", "action_results": [{"action": "Mercy Kill", "result": "You approach the elf, stepping lightly.  As you draw your blade from you sheath he looks up at you.  His eyes widen and his breathing become faster.  He feebly tries to raise his arms, probably to ask for mercy.\n\n\nDriving the sword through his recent wound, you press as the blood pours out and trickles down his side.  A short gasp escapes from his lips as his back and neck arches, his eyes widening before closing about halfway.  You pull your blade out and move forward.", "action_results": [{"action": "Back to the tunnel", "result": "As you are about to run back into the tunnel, a loud sound erupts, shaking the ground.  You have to catch yourself against the wall.  After exchanging glances with the other orcs, you make your way forward through the tunnel, ever vigilant.\n\n\nYou reach an opening engulfed in flames.  Orcs scream burning or already lay still, flesh roasting.\n\n\nYou cringe as the putrid smell reaches your nostrils.  You get low to try to get a better view up a dirt ramp.  The explosive must have come from the wall. \n\n\nYou dart to the side of the hall, thinking about what you should do.  You see some other orcs about to through the fiery opening.", "action_results": [{"action": "Wait", "result": "You hold up your hand.\n\n\n\"Wait,\" you say.  \"They could have more.\"\n\n\nThe room is deadly silent as everyone waits.  You hear more of those explosions, and orcs storming through the other trench tunnels. \n\n\nBy now, it sounds like full on chaos out there.  At some point, you hear a scream and an elven body crunch against the ground just outside of the opening.\n\n\nThey must have taken the walls, or at least part of them by now.\n\n\nYou slowly approach the opening, axe in hand.  As you step out, you notice there are elves and orcs engaged in deadly combat everywhere.\n\n\n Several elves run straight towards you.  They're probably trying to seek refuge.  One of their face twists as they raise their arm.  A bright red bolt flies from his hand.  You barely have time to drop to the ground as the bolt slams into the wooden fixture right above the tunnel.\n\n\nAs small wood pieces shower your back, you notch an arrow to your bow.  You only stand up high enough for your arrow to be raised just above the ramp.  You exhale as you align the arrow with the closest of the elves, who are significantly closer now. \n\n\nYou release the arrow, the elf who blasted at you staggering as it lands in his hip.  But he still runs forward, although now they all start blasting bolts of energy at you.  An orc to your right goes down, smoke rising from the wound on his chest.\n\n\nYou notch another arrow, a bolt passing right by you, and you shoot the next elf as another orc already finished off the first one you hit. \n\n\nWithin moments, the group of elves are all dead, along with a few orcs around you. \n\n\nIt seems that the orcs have gained the upper hand once again, superior strength and numbers.\n\n\nYou move out into the open with your group, quick to find somewhere less vulnerable. ", "action_results": [{"action": "Push", "result": "Many of the orcs loot the treasures, weapons, and trophies from the elf bodies.  You cross your arms and lean against some supply shed. \n\n\nA horse gallops over to a group of orcs, in the middle of them is an orc chief.  The orc scout on horseback frantically starts speaking.\n\n\n\"The elves! They're closing in on us, we're right in the middle of their line, we'll be surrounded,\" he yells. \n\n\nIt would only be a matter of time before they cut off the opening to their king.\n\n\nSifting through the orcs, you eventually find the orc chief in charge of the battle, who seemed to have dismissed the scout.\n\n\n\"Chief,\" you say, \"we need to push further.\"\n\n\n\"Yes, yes, I'm aware.\"  He sort of shrugs you off, while some other kiss ass orcs hand him some trinkets.\n\n\n \"You heard him, we're in the middle of their line, we could easily get caught in a pincer movement.  Probably surrounded too.\"\n\n\nThe orc chief laughs.\n\n\n\"Let them come, they won't stand a chance.\"\n\n\nYour eyes widen, this fool would let your brethren die rather than end this it seems.\n\n\nGrunting, you rip the horn fastened to his belt.  He glares at you, stepping forward.  You see his hand lightly resting on his sword handle.", "action_results": [{"action": "Reason with him", "result": "Looking at the horn in your hands, you realize you may have made a mistake.\n\n\n\"I'm not gonna sit here while you get them all killed,\" you say.  \"We need to move now, while we have an opening to their king.\"\n\n\nThe chieftain's eyes dart to the side as he considers what you have said.\n\n\nHe chuckles.\n\n\n\"You are a bold one, and you're right.\"  He says this as he walks up to you, and he pushes you to the side as he grabs the horn from your hand.\n\n\n\"But I can't let this disrespect stand.\"\n\n\nHe keeps walking as he blows the horn, rallying the orc armies.  As he calls for them to push forward, you hear something sliding behind you.\n\n\nWhipping around, you are just in time to sidestep a sword blow, which would have cleaved your head apart. \n\n\nYou grab the orcs forearm, quick to twist his arm and steal his sword.  He falls to one knee grunting in pain, and you kick him in the face, knocking him over.\n\n\nThe other four orcs in the chieftains entourage all draw their weapons as they try to surround you.  All the while you are moving, back, left, right, where ever you have to go to keep the foremost ones in front of you and keep the others from surrounding you.\n\n\nOne finally lurches forward, slicing open your shin.  Ignoring the searing hot pain, you leap forward, your sword biting into his neck.  His body relaxes and he slumps forward, not quite dead yet but on his way there.\n\n\nAnother orc rushes forward, trying to bury his axe into your head.  You simply pull the dying orc in front of you, the axe burying into his back.\n\n\nYou let the orc fall, as the weight of him doesn't allow the other orc to pull his axe out.  It instead slips from his fingers.  His hand goes for his dagger, but before he can do anything else, your stolen sword is buried in his chest.\n\n\nWith a grunt you push it the rest of the way through, all the way to the hilt, specks of his warm blood spattering your arms and chest.  The orc's mouth gapes and quivers as his arms flail in his death throes, patting your arms as his hands slide off your forearms. \n\n\nThe remaining two orcs have already started charging.  One leaps over the dying orc, almost hacking into your shoulder.  You get a lucky dodge, this time drawing your real sword.\n\n\nThe other one comes from your side, intent on plunging his spear into your side.  You knock the spearhead away, sliding the blade along the shaft, until you reach his hand.  You simply pull your blade back real quick, then with a quick chop severing his fingers.  He cries out in pain, turning into a gurgling as you slash your sword across his throat.\n\n\nThe last orc, and probably the most resourceful.  Pulls up a small shield from his side, frisbee whipping it at you.  It hits your raised forearm, leaving a stinging mark on your arm.\n\n\nAs you step back, the other orc tucks and rolls, grabbing the spear.  As he raises into a kneel, he lurches the spear forward.  It buries into your waist, burning hot pain shoots through.  You roar in pain as he rips it out.  This time he aims right below your throat, but you manage to knock it aside.\n\n\nIn the same motion, you pull up your axe, throwing it with surprising dexterity.  The orcs head kicks back, then slowly slumps forward.  One of his eyes stares at you, the other looks off at a weird angle.  He falls, the axe handle stopping his face from hitting the ground.\n\n\nSighing, you limp over, pulling your axe out of his forehead.  As you look around, you realize some orcs had gathered to cheer you on.  They didn't seem to want to get involved in case you deserved it, and they didn't know what you were even fighting about but seemed entertained nonetheless.\n\n\nThey pat you on the back for wrecking four orcs, and one even offers to help you clean and bandage your wound.  Which you gladly accept...\n\n\nSome hard alcohol and stitches later, your leg and stab wound are securely patched up.  You just have to be careful not to reopen or aggravate the wound.\n\n\nHaving missed the initial rush, you are stuck moving with the supply wagons, with all the old, lame, or wounded orcs.  You do manage to hitch a ride, also being offered some fresh cooked beef.  A delicatessen you haven't had since months ago.\n\n\nYou decide to get some shut-eye on your way to the front...", "action_results": [{"action": "King Harribor's Stand", "result": "The past few days have been spent sieging the elven King's last safe harbor.  All the fields, villages, and towns outside of the castle having been swept up by the armies of orcs.\n\n\nSomewhere behind the main army, detachments of orcs have been held back to keep the elven lines from closing in.  You've heard they fight with desperation at the thought of losing their king.  They've gained almost a mile since yesterday, but the orc rearguard has finally managed to hold their ground.\n\n\nYou sit on a hill, drinking whiskey as you watch the orcish reserves moving about the moats and trenches, trading arrows with the elven defenders.\n\n\nYou had spent the previous nights routing out and destroying the surrounding elf units.  You've finally been convinced to reserve your strength as you sit against a tree with some trusted orcs.\n\n\nTo your left a huge swath of trees fall.  Tensing up a bit, you see large wooden catapults being forced out of the trees.  Followed by columns of heavily armored elven knights.\n\n\nPreparing to warn the orcs, you bolt up onto your feet, as do your friends.  As you run down the hill you notice something odd.  The insignia on their flags are different from the Wistern elves' flag.  Instead of a yellow flag with red shield, it is a black flag with a red dragon.\n\n\nThese might be the Velaneer elves.\n\n\nYou hop on a horse, galloping over to them with a dozen or so other orcs.  The rest prepare to defend their lines. \n\n\nYou stop out of spear or bolt range of the columns, they don't appear to have any archers with them yet, so that won't be an issue.\n\n\nYou call out.\n\n\n\"Who are you? And what business do you have here?\"\n\n\nWhat appears to be an officer steps forward.  You don't realize the elf is a woman until it speaks.\n\n\n\"My name is Valek, Captain of the Velaneer assault brigade.  You are?\"\n\n\n\"Nolazir.\"\n\n\n\"Rank?\"\n\n\n\"I'm... I just kill things.\"\n\n\n\"Any generals?\"\n\n\n\"No, we have some chiefs though.\" you say.\n\n\n\"And?... Where are they?\" She asks getting clearly annoyed.\n\n\n\"Off sieging King Harribor's last defense... or drunk somewhere.\"\n\n\n\"You'll have to do.\" Valek says this as she strides toward you and your horse.\n\n\nYou hop off and go to meet her.  Her hair is the gold blonde that most elves of her nation seem to have, and her eyes are a deep green.  They would almost be beautiful.....if she wasn't an elf.  You almost can't look away, but you manage to break eye contact.  Looking down her face to her lips, which seem to come up to a slight pout.  She slowly smiles, some twinkle in her eye.\n\n\n\"Seems like you really are doing a great job breaking into the castle.\" She says haughtily.\n\n\n\"We're trying to starve them out,\" you say.\n\n\nShe sighs.\n\n\n\"They're elves, they can magically grow food in their castle gardens, and when they run out of ammunition they'll probably start throwing magic bolts at you.\"\n\n\nYou grunt, not having thought of this.  Valek chuckles.\n\n\n\"You orcs are always getting caught with your dicks in your hands.\"\n\n\nYou look down at your fur and leather pants, no dick in sight.  Fearing this was a ruse, you grunt and look up at her, but she isn't trying to fry your face off. \n\n\n\"We kinda did have a plan, the moat is the issue,\" you say.  \"We were gonna tunnel under the fort, but that would probably just flood.\"\n\n\n\"Have you tried just knocking?\" She smirks.\n\n\nYou look over to the drawbridge, covered in arrows.\n\n\nYou look back at her and shake your head.\n\n\n\"Too dangerous.\"\n\n\n\"Well, you have some brains... for an orc.\" Valek chuckles.\n\n\nShe is about to say something but you interrupt her.\n\n\n\"We were thinking of finding a way to just barge straight in.  They must have a weakness somewhere.\"\n\n\n\"They probably have a secret tunnel system, most elven fortresses do.\"\n\n\nNow it is your turn to act like a snob.\n\n\n\"Don't you think if they did they would have taken their king to safety?\" you say, mimicking her haughty attitude.\n\n\n\"Besides,\" you say resuming your normal tone, \"we already caved in their tunnel system.\"\n\n\n\"What? Why didn't you just use that to get in?\"  She starts getting angry.\n\n\n\"Too small, and we lost too many orcs trying to get in.  Better to collapse and kill all the elves inside.\"\n\n\nShe looks over to the wall, observing the battle taking place. \n\n\n\"We have a plan to get through,\" you say.  \"We just need more time.\"\n\n\nYou show her some of the wooden \"machinations\" you and the orcs have been working on.  They are wooden constructs, each with a front wall with a small window and handles, there is a small roof to protect against arrows, and the side walls are dipped to allow archers to fire from the side.  Each one can protect half a dozen orcs and are operated by three pushing, which would turn the wheels on the front and sides, and three archers firing from the front and sides respectively.\n\n\n\"We call them siege breakers.  Should get us close enough to take those doors down,\" you say as you stand behind one, the roof part at least a good foot above your head.  A dozen or so elves could probably fit behind one of these.\n\n\n\"I have to say,\" she smirks, \"I'm impressed Nolazir.  But are you sure you'll be able to get through to the walls, even with these?\"\n\n\n\"Valek, that's where you come in,\" you say.  \"We need you to barrage them with your catapults, and your... magic blast things. Once they are beaten down, we can get in.\"\n\n\nShe nods, taking a moment to look at the defenders scrambling up on the walls, they seem to be massing more out of their reserves in response to this elven nations arrival.\n\n\nYou decide to spend the rest of the day with Valek and other elvin and orcish leaders planning out how to break the siege of King Harribor's castle.", "action_results": [{"action": "Three Days Later...", "result": "You grunt as you push, gripping the handle of the siege breaker you take shelter behind.  Arrows embed themselves into the front and top of it.  Far ahead, the catapults snap as they fire off, sending stones into the wall. \n\n\nThe orc next to you chuckles as a stone shatters part of the wall, and several elves fall to their dooms below. \n\n\nLooking behind you, Valek watches as you push the siege breaker.  She sticks her thumb up at you and smiles, and not being sure what to do, you smile and raise your middle finger.  She looks surprised for a second and looks away to the catapult.\n\n\n\"Idiot!\" the orc next to you yells.  \"Elves don't make jokes!\"\n\n\nNodding in acknowledgment of this wisdom, you continue to push the machine.  A horn blares behind you.  Valek stands with a catapult into position right behind you and orders it to fire.  You and the other orcs all cringe as the projectile soars overhead.\n\n\nWith a huge crash, the missile breaks through the castle gate, shattering it and sending splinters flying all over. \n\n\nYou nod at Valek, who smiles and raises her middle finger at you.\n\n\nDrawing your sword and axe, you give a mighty cry and lead the charge through the gate.  The elves on the walls scramble to either rush to the gate or shoot down on the orcs, but your elven allies blast them with energy bolts, either killing or suppressing them.\n\n\nAs you burst through the opening, dozens of elves wait, swords in hand.  One tries to hack you, but you simply knock it away with your sword and slice his knee with your axe, running it across his belly next as he falls to a kneel.  He tries to keep his guts from spilling out, but you manage to slice his throat, only a gurgle escaping as he falls to the ground.\n\n\nYou throw yourself into a group of elves, fighting through them with a new ferocity along with your comrades…\n\n\n ", "action_results": [{"action": "Revenge", "result": "With the castle in sight, the orc army pushes forward, as the elves follow up and support them.  From the castle, a large brigade of elves come flowing through.  They are lead by an elf in leather black armor, and a large sword for an elf of his stature.  From here, you can see his hair is raven black,  much like the orcs, but he is full elf, with one blue eye and one green eye.  A nasty scar crawls across his face.\n\n\nAs the orcs and elves meet, chaos ensues, from the houses and shops the windows burst open, energy blasts shooting out and killing elves and orcs alike.  More of the elves flood in from a side street, blindsiding the orcs.\n\n\nYou barely manage to dodge an axe to the head, before lopping off your foes arm.  You and another orc move through, watching each other's backs and cutting down elf after elf.\n\n\n\n\n \n\nYou hear a grunt and a heavy sigh. Turning, you see the orc you were fighting with sinking to the ground, a smaller axe buried in his chest. Ahead you see the culprit. The chief from before chuckles as he draws his sword. \"So you managed to survive, pretty impressive,\" he says, \"my son and I have a bone to pick with you though.\" Coming up to his side you see an orc, who looks familiar. Then you remember, he was the orc whose sword you stole. You kicked him in the face and knocked him out, you should have gone back to kill him. Oh well, time to handle this now. The two orcs begin to circle you, the younger seeming eager to rush in. The older content with biding his time. The chief's son rushes in suddenly, he is quick and strong, but stupid and sloppy. You parry a downward blow, raking your axe blade across his thigh. He stumbles as he steps to the side, but manages to stop you from burying your sword into his neck. He swings at your neck, and, stepping back, you slice down into his chest, quickly retracting. He grunts in pain, blood oozing down from his wound. You hear something behind you… Turning, you duck under a strike that surely would have decapitated you. As you pivot, you run your sword along his side, and finishing you bury the axe blade behind his knee. As he falls you loop the axe around and over your head, about to bring it down for the final blow... Something stops you, the chief's son had leaped over, barring you with his sword. His other hand grips the blade, pushing your axe up. His face straining as you both struggle, genuine concern for his father on his face. With your other hand, you drive the sword through him. His brows furrow and his mouth gapes slightly, a small choked cry of pain escapes his lips. As you step back, you pull the sword out of him. Backing up several steps, you watch as the chief pulls himself up to kneel over his son. You can't hear what, but you see the chief's lips moving as he talks to his son. The son tries to speak, and the chief leans in to hear one last whisper before his son goes limp. Turning to you, rage is blazing in his eyes. He moves quickly despite his injuries, and almost bowls you over. You manage to roll out of the way, his sword striking the ground where you stood. In almost the same movement he turns, almost cleaving you in half. You try to chop him with your sword, but he buries his blade in the handle, pulling against the hilt as the sword is pulled from your hand. Gasping, with sweat running down your body, you attempt to chop his arm. The chief roars as he catches the axe by the shoulder, kicking you as he pulls it from your grip. Panting, you crawl back, trying to reach his son's sword. But you are too far, and the chief is too fast. He steps in, looping the sword around his head and raising it for the killing strike. Something pale blue hits his chest, emitting a pop and smoke, sizzling heard from the wound on his chest. He looks up as he staggers back, accidentally lowering the sword. Two more bolts slam into him, causing him to reel back and fall to the ground. Smoke rising from his body, and he lays still.\n\n\n ", "action_results": [{"action": "Rescued", "result": "You roll onto your side, to see Valek standing with her arm outstretched.  As you stand, she runs over to you.\n\n\n\"Nolazir, are you okay?\"\n\n\n\"Yeah, I'm fine,\" you grunt.\n\n\n\"What were those guys trying to kill you for anyway?\" \n\n\n\"Orc dispute.  I didn't like his leadership, and they tried to kill me.  Twice now.\"\n\n\nYou gather your weapons and take a second to gather your breath.  The battle seems to have turned for the orcs. \n\n\nValek turns and pats you on the back.\n\n\n\"You alright? You didn't get tired from fighting a couple of orcs now did you?\"\n\n\n\"I thought elves didn't joke?\" you say.\n\n\n\"Now where did you hear that?\"  She raises an eyebrow.\n\n\n\"Uhh, nevermind,\" you grunt.\n\n\nYou both watch as the orcs make their way through up to the front of the castle.\n\n\n\"So, where exactly are you from?\" you ask.\n\n\n\"The Velaneer Kingdom,\" she says.  \"Only the best of the best.\"\n\n\n\"I know where you are from, but what did you come from?\"\n\n\n\"Well, you may be surprised to hear it, but I'm actually from a family of peasant farmers.\"\n\n\n\"Can't you elves use your magic to grow stuff.\"\n\n\n\"We can, which I guess made it easier.  But we still needed to make a living, and the Kingdom needs a food supply.\"\n\n\n\"Aren't you elves all fancy? I couldn't imagine what elven peasants would look like.\"\n\n\n\"No, those are probably just common myths.  While we do hold ourselves to a higher standard than all other races, we're not all getting fat off the spoils of the kingdom.\"\n\n\n\"So what are you doing here?\" you ask.\n\n\n\"I thought I could do better for my people than growing grapes and tomatoes, so I became a soldier.  Surprised to say I rose through the ranks pretty quickly and found myself here.\"\n\n\n\"So you weren't happy with the life of a peasant, I get that.\"\n\n\n\"So, Nolazir, what about you?\" Valek asks.\n\n\n\"Hold on,\" you grunt.  \"We're pushing through.\"\n\n\nAhead, the orcs seem to have breached the castle.  Valek follows behind you, noticing that you are somewhat pissed at not being in the front of the fray. ", "action_results": [{"action": "Castle Fall", "result": "You pass over the bodies of the fallen, some horribly mangled, some looking almost peaceful laying on the ground.  You see an elf and orc tangled up, the orc's hands wrapped around the elves neck, whose eyes are bulging from his skull.  The orc still has a snarl frozen on his face, multiple dagger wounds on his ribs and back, with the elves hand still gripping the dagger.\n\n\nAs you enter the castle hall with Valek, the sounds of combat echo throughout the halls.\n\n\nEventually, you make your way through the main hall, littered with the corpses of elves and orcs.  Throughout all of this, you don't see the corpse of the elf with the two different colored eyes.\n\n\nThe large golden doors to the King's chamber stand ajar.  Holding your axe tightly, you step over to the door.  You signal Valek as you get ready to open the door, and she preps to blast a bolt of magic.\n\n\nA shuffling sound and a groan come out from behind the door.  You give Valek a sideways glance, and she nods.  Throwing the door open, you step back and tighten your grip on your axe.  Valek raises her hand...\n\n\nIn front of you, an orc shuffles towards you, his body covered in deep gorges, cuts, and burn wounds.  In his hand is the head of an elf, which he holds by his long hair.  Behind the orc the rest of the body lays in a golden robe, covered in wounds and with a bloody sword next to it.\n\n\nThe orc stops in front of you, throwing King Harribor's head to the ground, where it rolls to your feet.  The King has one blue eye and one green eye. \n\n\nThe orc's mouth quivers slightly as he tries to say something, but he just falls forward.\n\n\nYou kneel next to him, feeling his pulse, but he is dead. \n\n\nAs the fighting in the rest of the castle recedes, dozens of elves come retreating into the chamber pursued by orcs, only to stop short at seeing the elf king's corpse. \n\n\nYou watch as the elves stare in shock, one of them, rather old for an elf draws his sword.  You reflexively ready your axe.  But the elf drives it through his own chest, gritting his teeth in pain as he pushes it in deeper before falling.\n\n\nSeveral of the elves follow suit.  The rest, seemingly galvanized start firing bolts at the orcs, in a moment you see one heading straight for Valek.\n\n\nYou grab her, throwing her behind the door as the bolts fly by.  Several manage to miss you as you throw her to safety.  You turn to throw the axe, but the orcs have already overrun the remaining elves and have butchered them. \n\n\nYou just watch the carnage as you call Valek out. \n\n\n\"You didn't have to do that, you know,\" she says.\n\n\n\"Eh, it just seemed like the right thing to do.\"\n\n\nYou and her walk out onto the king's castle balcony.  Some elves stop her to ask her some questions about prisoners and the remaining soldiers in the forests and hills.  While she talks to them you step through the curtain.", "action_results": [{"action": "Balcony", "result": "It's a beautiful sight, the sun setting over the trees and the hills.  The orange and purple rays playing over the horizon. \n\n\nCasting your glance down, gruesome corpses lay all around the castle yard and surrounding houses and buildings.  Elves and orcs alike plunder and loot the corpses and treasures of the elven kingdom's capital. \n\n\nOutside, the elves move their catapults and shift columns of soldiers who got to sit and watch the battle.  Somewhere to the left, you see allies moving in large groups of prisoners.  Word of King Harribor's death spread quickly.\n\n\nThe curtain ruffles, and Valek steps out beside you.\n\n\n\"So, Nolazir, are you going to be staying around for a while?\" Valek asks.\n\n\n\"Hmm, yeah, just long enough to organize some things. What about you?\"\n\n\n\"Uhh, yeah I was planning on staying for a bit.  Lots of prisoners to secure and people to move around.\"\n\n\n\"Great,\" you say.  \"I'm sure I'll see you around then.\"\n\n\nValek wrinkles her nose, looking out at the carnage below.\n\n\n\"Sometimes, I wonder if it was all worth it,\" she says.  \"So many people killed, and for what?\"\n\n\n\"I don't know why you elves started fighting each other, but they came to us making promises of strength and power.  They thought we would be too short-sighted to see what they were trying to do.\"\n\n\nValek nods.\n\n\n\"They showed up in force, and we responded with greater force,\" you say.\n\n\n\"We had our reasons, but I just don't know what the point of it all really was,\" Valek says as she leans against the railing.\n\n\n\"Sure, the Wister elves were at odds with us, but these past few years, we made so many sacrifices. \"\n\n\n\"It wasn't all in vain,\" you say, \"they sacrificed to secure a better future.  You might not see it now, but King Harribor was getting too bold, too greedy.  He was putting you and us in jeopardy.\"\n\n\n\"Hmm, we will see about that,\" she says.\n\n\nYou both stop talking for a moment, and after a few seconds you look over to find her just looking at you.\n\n\n\"What's with the staring?\" you ask raising an eyebrow.\n\n\n\"I don't know, there's just something I like about you.\"\n\n\nYou take a step toward her, and, even though she is an elf, there is something you like about her too.  You put your hand on the back of her head, pulling her in as you lean in.  Her lips are much softer than an orc woman's. \n\n\nShe puts her hand on your shoulder as she begins to reciprocate…", "action_results": [{"action": "Later...", "result": "You lay on your bed of blankets and pillows.  Valek is snuggled up next to you, her hand resting on your chest, your arm wrapped around her lower back and resting between her hip and stomach.  Her body very warm against yours.\n\n\n\"I hope no one heard us,\" she says.\n\n\n\"Screw 'em if they did.\"\n\n\n\"Well, this was a fun little experiment,\" she says.  \"Too bad we won't have time for more of this.\"\n\n\nYou grunt in response to which she lightly slaps your chest.\n\n\n\"What's 'mrmmph' supposed to mean?\"\n\n\nYou grunt.\n\n\n\"Are you going to talk to me,\" she asks, \"or are you going to keep being weird?\"\n\n\nYou grunt in response.\n\n\nValek rolls over and grunts... to which you also grunt, causing her to grunt once again.\n\n\nValek laughs and snuggles closer to you. \n\n\n\"You're pretty funny for a big ugly orc.  I'll miss you, I think.\"\n\n\n\"And you're not such a pretentious snob... for an elf.\"\n\n\nYou close your eyes and hold her close, knowing that this won't last long and you will soon have to return to your homelands…", "action_results": [{"action": "Prologue Closing", "result": "The Wister Empire had fallen, allowing the elves and orcs to return to their homes at long last.  In the coming years, relative peace would fall over the orcs, but a storm was forming over the horizon…", "action_results": [{"action": "Chapter 1:Rising", "result": "Six years later...\n\n\nThe sun casts its golden rays over the blessed lands of Orcin, the blue sky showers the soft grass in its jubilee.  The rivers run freely, the animals roam, and the people are happy.\n\n\nThe villages and tribes have recovered well from the four years of grinding combat with the elves.  The Wister Elf nation has been absorbed into the Empire; the Imperial governor of the old nation has turned it into a labor force for the Empire.  From what you have heard they have been sending a surplus of weapons, wagons, and even domestic equipment to their allies.\n\n\nA loud wailing sound pierces the silence you had lost yourself in.  The baby cradled in your arm cries out, demanding attention.  You rock the child in your arm, murmuring an old orcish lullaby. \n\nA little orc girl of three years waddles over and pats your knee. \n\n\n\"Dad, can I hold Lagrik?\" she asks.                    \n\n\n\"No, Vokra, I'm just getting him back to sleep,\" you say.  \"You can play with him later.\"\n\n\nVokra walks off to pout but is soon distracted by her brother, Grovlar, who seems to have found a baby snake to play with. \n\n\nIt's been a long six years.\n\n\nThey've been filled with blessings though.  Your wife and children are all healthy and strong, your humble farm yields healthy crops.  The animals are all in good condition, and you have nothing you would consider a real problem. \n\n\nA quick pinch to your belly reminds you that you have gotten a little soft in these past few years.  While you are still strong as an orc should be, it has been a while since you've actually had to do any vigorous work for extended periods of time. \n\n\nWell, other things call in the life of an orc.  You hand the infant to your wife, as you go to chop up some more firewood for the coming night along with other chores that need to be done.\n\n\nYou raise the axe, cleaving the piece of wood in half…\n\n\n \n\nLater in the day, you sit by the fire with your wife snuggled beside you.  The children all snore gently in their beds of animal furs.  Gilikia cradles the baby as he whimpers softly. \n\n\nAs you sit, you wonder how Valek is doing, if she is even alive.  You haven't heard from her since you left the Wister Kingdom.  More than likely she has probably moved on with the life of a soldier in search for something else, as most tend to do.   ", "action_results": [{"action": "The Next Day", "result": "It's been a productive day.  You've made sure the crops have adequate water, your animals are well fed and some are ready to be slaughtered soon. \n\n\nThe sound of hooves hitting the dirt causes your ear to prick.  Looking over your shoulder, you see two orcs on horseback. \n\n\nOne you recognize as Rolomag, a few years younger than you and being the son of your cousin's sister in law.  Something like that anyway.  His hair tied up in a bun, similar to what many of the orcs seem to prefer these days, and his face clean shaven. \n\n\nThe other one you don't quite recognize, a little orc boy.  About ten years of age.\n\n\n\"Nolazir,\" the older orc says, \"we need to talk.\"\n\n\n\"Alright, come in,\" you say.  \"And whose kid is this?\"\n\n\n\"Huh? That's my little brother, Rolzagir.\"\n\n\nYou nod.\n\n\nThe two brothers hop down off the horse, the older handing the reigns to the younger, who goes to tie the horse to a post.\n\n\nThe other orcs in your village live pretty spread out, as everyone farms or at least owns some livestock. \n\n\n\"So what's going on Rolomag?\" you ask, sitting down on a wooden log.\n\n\nRolomag sits down as his brother walks over and leans against your house. \n\n\n\"Dekard spotted some Imperial patrols hovering near the border,\" Rolomag says.  \"We think they are preparing to come through.\"\n\n\n\"For what?\" you say.  \"They already took the elves.  What do they want with us?\"\n\n\n\"Resources, food, animals, us… Hell if I know.\"\n\n\nRolomag stands up.\n\n\n\"Anyway, the village is meeting up to see what we're going to do about this.\"\n\n\n\"Is there really anything we can do?\" you ask.  \"Maybe they just want to protect their border. I wouldn't put it past some of the border tribes to be raiding people on Imperial lands.\"\n\n\n\"You think that's the case?\"\n\n\n\"If it is, we need to stop them before the Empire takes it out on all of us.\"\n\n\nYou stand and go to your horse.\n\n\n\"No point in waiting around.\"\n\n\nYou, Rolomag, and Rolzagir all ride off to meet with all the other orcs.", "action_results": [{"action": "Village Meeting", "result": "All the orcs stand around a giant tree in the village center, waiting for your chief, Greusim, to speak.  He stands on a flat rock, looking over everyone.\n\n\nGreusim has the raven black hair that all the orcs have, the sides shaved into a mohawk, with the back end running down to his upper back.  White hairs scattered throughout his majestic hair.  His face aged and wrinkled, giving him the appearance of a grumpy bulldog, and two sharp teeth protrude up from his under bite, a common trait among orcs. \n\n\nFor a moment you and he look at each other, his left eye always perpetually half closed, making him look vexed.  Although the chief is one of the calmest orcs you have ever met.\n\n\n\"Everyone,\" he starts, \"it has come to my attention that the Imperials are amassing warriors by the borders between our lands.\"\n\n\nHe spreads his arms out.\n\n\n\"These very lands that have been our home since Gigalak gave it to the First Born.\"  He pauses for a moment.  \"We need to make sure these lands are protected, for the well being of all orcs, ourselves, and future generations. \"\n\n\nSome of the orcs start calling out for blood, to which Greusim shakes his head.\n\n\n\"No, we must watch what the Empire does, we cannot go out looking for a fight.  Not this time, we must try to avoid conflict.  Now, I will personally lead an expedition team to the border, and we will see what the Imperials are doing.  There will likely be other tribes of orcs doing likewise, but if they fight the Empire, we will not interfere.\"\n\n\n\"What happened to all that shit about sticking together?!\" an orc cries angrily.\n\n\n\"We will only fight if they attack us first, we will not be the ones to start a war with the Empire.  It would be deadly, and very long if we did so.\"\n\n\nYou all talk amongst each other.  According to chief Greusim, this could be a very precarious situation.  You call out.\n\n\n\"What if they are protecting their borders from orcs raiding Imperial lands?\" you ask.  \"You know what some of the tribes are like.\"\n\n\nIf you could even call them that, some groups of orcs aren't even proper tribes.  Just bands of raiders, thieves, and scum.\n\n\n\"If that is the case,\" the chief says, \"we will let them know they do not act on behalf of all of Orcin.  Maybe, we would even help the Empire fight them on behalf of the rest of the tribes.\"\n\n\nThere is arguing amongst the orcs.  The orcs have banded together to fight external threats, but never with a foreign power to fight other orcs.  The affairs of orcs have always been kept to the tribes of orcin.\n\n\nHelping the Empire fight fellow orcs, no matter if they are scum, would be crazy.\n\n\n\"So, my friends,\" Greusim says, \"who will aid me on this quest.\"\n\n\nMany hands go up, the chief peering through the crowd to see who would be best.\n\n\nYou wonder if you should raise your hand, the expedition might call for experience and expertise, which you would have.  On the other hand, you also don't really want to leave your family for an extended period of time.  While Gilikia is strong and hard-working, two kids, an infant, and a multitude of chores would be difficult for her to handle by herself.  Also, there is the fact that someone may need to run the village in Greusim's absence, which is also something you would be willing to do.   ", "action_results": [{"action": "Raise Your Hand", "result": "You raise your hand, the chief's eyes widening slightly and a small grin creeps across his face.  Seems like he was hoping you would join.  The chief starts calling out names, yours and Rolomag's among them.\n\n\nThe other orcs shuffle off at the command of Greusim.  You go off towards your house, to prepare for the expedition. ", "action_results": [{"action": "Expedition", "result": "With your supplies ready, you've said your goodbyes to your family and ride over to the village center, where three dozen orcs have gathered. \n\n\nGreusim nods his head towards the mountains, leading the group forward.  You ride on for the whole day, passing streams, rivers, fields, and forests.\n\n\nAfter some days you come to the foot of the mountains.  On the other side of this lies the border between Imperial lands and Orcin.\n\n\nRolomag  cuts you a look, raising his eyebrows and gesturing towards the mountains.  You wonder why he seems annoyed by the mountains, as he knew you would be traversing them.", "action_results": [{"action": "Mountain Trail", "result": "The howling wind's cruel bite pierces your fur and leather clothing.  It takes the dying leaves from the trees with it, spiraling down to the depths below.  Crags point out accusingly, and cliffs dare you to come too close. \n\n\nYou all ride in a single file line, making sure your horses don't slip and fall to certain doom below.\n\n\nSomewhere above, something skitters along the rocks.  There is nothing to be seen up there, very strange.  Could just be some mountain critters going about their day.\n\n\nFinally, after a whole day of moving painstakingly slow, you get off the steep paths of doom.  Ahead the road is far wider, and there is vegetation and pools of water for the horses.  Stopping the horses to rest, you all huddle behind the chief as he looks out from the mountain.\n\n\nThe mountain curves down into a valley, and even below that are the great forests guarding Orcin.  Miles and miles of trees, and eventually you can see large Imperial cities interspersed throughout the forests, hills, mountains, and plains in the distance.  To the right, past a large river, are huge plains that are home to the more nomadic orc tribes, as well as the vagabond types roaming Orcin.\n\n\n\"Beyond this mountain, where the First Born was created, the Empire seeks out our land,\" Greusim says while he takes in the fresh mountain air, gesturing to the forests and plains below.\n\n\n\"We will give them a warm welcome, or a bloodbath,\" Greusim says. \"It's their choice.\"\n\n\nThe group rests there for the night, leaving guards to watch out for wild creatures or individuals who would do harm.\n\n\nThe next few days are full of eventful walks down the mountain. \n\n\nSoon, the path to the valley is in sight.\n\n\n ", "action_results": [{"action": "Through the Valley", "result": "Silence.  No wind.  No talking.\n\n\nYou all sit on your horses, staring into the valley.  Ahead, what appears to be scattered remains of tents and campfires lay around. \n\n\nAs you advance towards the deserted campground, your eyes dart back and forth, to every rock and every tree.  Something doesn't quite feel right here.\n\n\nAs you ride through the camp, you notice some of the tents seem to have been ripped open.  There aren't any bodies or anything, and by the camp's design, it belonged to some orcs.\n\n\nOn the ground is a tattered blanket, pinned under a tent stake, and almost blowing in the wind.  Hopping off the horse, you look underneath it.  A dagger made out of bone and hide sits under it, dark red blood sticking to the blade.\n\n\nYou hold it over your shoulder, showing it to the chief, who takes it in his hand. \n\n\n\"Something definitely came through here,\" he looks into the trees above, \"but what?\"\n\n\n\"Nothing I want to find out about,\" Rolomag says, much louder than he should.\n\n\nYou put a finger to your lip, looking up to the trees.  They sway in the wind, maybe carrying something deadly within them.\n\n\nYou're not sure, but for a moment it sounds like something is whispering to you from the trees.\n\n\nGreusim signals the group to mount up and move on, which you do gladly. \n\n\nYou all gallop out of the valley, and into the forests ahead.", "action_results": [{"action": "First Encounter", "result": "With the strange campsite far behind you, the group seems to be more at ease.  The forest is much more serene and offers some peace and quiet.\n\n\nA stream trickles by, as your horse steps over it, you hear some sounds up ahead.\n\n\nGreusim looks over his shoulder at the group behind him, and you nod at him. \n\n\nYou, Greusim, Rolomag, Dekard, and some other orcs all leave your horses to go scout ahead.  The main group waits for your return.\n\n\nThe unmistakable sounds of violence penetrate your ears.  Peering from the foliage, you see two things.  The first must be Imperial soldiers, with their flat top helms and robes over what appears to be some kind of silver coat.\n\n\nCowards. The orcs only use some padding from their leather armor and sometimes studs.  Anything more would just weigh a warrior down and keep him from being effective. \n\n\nFrom what you can see, they have two separate lines of archers by the trees, and in the clearing between them are soldiers on horseback.  Ahead, on a rocky hill, a group of orcs seems to be holding their ground, trading arrows with the Imperial archers.  Once in a while, an orc taking a shot at one of the horsemen, but always missing.\n\n\nIn between two groups lays a slain Imperial, a spear in his back, and a dead orc with the spear still gripped in his hands.  The orc has several arrows protruding from his back.  Judging by his face paint, it looks like these orcs are one of the lawless bands of orcs.\n\n\n\"We need to help them,\" Rolomag says as he starts forward.\n\n\nYou grab him by the shoulder, pulling him back.\n\n\n\"Stop. We don't know who started it,\" you say. \"This isn't a proper orc tribe.  They're just some vagabonds.\"\n\n\n\"Does it matter? They're still orcs,\" Rolomag says.\n\n\n\"No, Nolazir may be right,\" Greusim says. \"We should let the Imperials know they aren't working on behalf of all of orcin.\"\n\n\n\"Are you really going to listen to this?\" Rolomag asks. \"Nolazir, the Empire won't care either way.  They will blame all of us.\"\n\n\n\"No, we can make peace with them,\" Greusim says.\n\n\nGreusim looks at you.\n\n\n\"You believe me, don't you, Nolazir?\"\n\n\nChief Greusim looks genuinely concerned about whether or not you believe him or not.  You look to Rolomag, he raises an eyebrow, not lifting the scowl on his face for a moment.", "action_results": [{"action": "Talk to the Imperials", "result": "\"We will talk to them,\" you say. \"We can't achieve peace through war, not this time.\"\n\n\n\"Thank you, friend,\" Greusim says.\n\n\nWith this, Greusim leads you all over to the Imperials.  You all move slowly, hands in sight, and with Greusim several feet ahead.  The Imperial knight ahead jerks his head back as he sees your group.  The other horsemen seem alarmed, but ultimately don't do anything.\n\n\n\"Friends,\" Greusim calls out, \"we have come to tell you, those lawless do not act on behalf of Orci-\"\n\n\nTo this day, no one knows where it came from, if it was a stray arrow from the lawless orcs meant for an Imperial knight or an Imperial archer who was too hasty in his actions, but everyone knew it was what started one of the largest conflicts in the history of Velis Brum. \n\n\nGreusim gasps, an arrow piercing his side.  Crimson red oozes out of the wound soon after.  With a roar, the other orcs charge forward in rage.\n\n\n\"Wait,\" Greusim wheezes out, trying to compose himself.\n\n\nIn response, the Imperials charge forth, ready to fight the orcs.  The knight who had first seen your group holds his hand out, signaling the other knights.\n\n\n\"No, stop,\" he commands. \n\n\nBut the knights just keep charging, and the two groups embroil in deadly combat.", "action_results": [{"action": "Fight the Horsemen", "result": "Looking between the groups, you and the knight find each other.  He still seems shocked, having tried to stop his men from attacking.  As you both make eye contact, you nod at him.  Both of you share a resigned look, but know this must be done.\n\n\nYou draw your sword, and the knight does likewise.  He holds the sword in front of his face, putting his forehead to the hilt for a moment before readying it to fight.  You both spur your horses forward.", "action_results": [{"action": "Charge", "result": "As you get closer to him, you arc your sword over your head, aiming for his neck.  The Imperial soldier slams it away with the flat of his blade and, mid-push, brings his blade back down.  The sword cuts through your thick leather armor, biting into your shoulder.\n\n\nYou wince and grunt as he pulls his sword, the both of you passing each other and turning in preparation to charge again.  Behind him, you see that the orcs seem to have pushed the Imperial horsemen back a bit, and the orcs on the hill have wounded several archers in each column. \n\n\nThe battle is going well enough for the orcs. \n\n\nAs you charge the Imperial knight again, you consider your next move.", "action_results": [{"action": "Slice through him with your sword", "result": "As you ride forward, you prepare to slash into his neck again.  You pull the sword over the opposite shoulder of the hand it's in.  As the Imperial gets closer, you go for a vicious swing.\n\n\nHe twists his wrist, blocking it near the hilt, pushing your sword up.  As your blade slides off his, the knight arcs the deadly weapon over his head the opposite way.  As you pass each other he swings his sword back.\n\n\nYour mouth gapes open as the tip of the blade digs into your back, cutting across the length of your back.  It notably severs your spine.  As your horse trots forward you feel a numbness creep from your waist and through your legs. \n\n\nAs the horse starts to turn, you begin to feel dizzy, the numbness spreading through the rest of your body.  You see the knight watching you, his sword at the ready.  You don't even realize that you've fallen off your horse, the numbness finishing spreading through your body.\n\n\nThen, an eternal night. ", "action_results": []}, {"action": "Run him through", "result": "The horses charge forward, the Imperial knight holds his sword out in front of him, ready for whatever may come next.  You arc your sword around your head, and you see his arm flex to deflect the strike. \n\n\nAs you near striking range, you whip the sword around counter clockwise, pulling your elbow back and plunging forward.  The knight manages to knock your sword aside, flicking his wrist and stabbing the tip of his blade into your chest.  The momentum causes the tip of the blade to just come out through your back. \n\n\nPain shoots through your body and you gasp.  The force of the sword pushing into you causes you to fall back, but you manage to catch onto your horse, stopping you from falling off.  You clutch the wound as the horses circle back around.\n\n\nLooking back you can see the Imperials are starting to overwhelm the orcs.  How can this be?  There are far more orcs than those human scum. \n\n\nWhite hot pain shoots through your chest again, and you clutch the wound.  Blood sticks to your hand as you pull it away.\n\n\n\"Damn it,\" you say.\n\n\nThe Imperial knight twirls his sword, daring you to come at him again.  Such arrogance.\n\n\nYou decide to oblige him, charging forward.  He prepares his sword, expecting you to strike again.\n\n\nThis time you pull up your axe, but hold it down behind the horse.  You strike with the sword, and he predictably parries it.  This time you slam your axe blade into his side, and as you circle back around you smirk as you see that…..\n\n\nThere's no blood?\n\n\nYou see the spot on his side where you swung the axe, but the robe is just ripped, the silver coat gleaming in the sunlight. \n\n\nIs this some kind of magic coat? Or maybe it is some kind of metal. You've never seen anyone wear metal to avoid battle injuries.  You've also never actually seen a human before either.\n\n\nAs the knight prepares to charge again, your body begins to feel weak.  You're losing blood fast, so you are going to have to finish this or he will.  The knight charges towards you…\n\n\n ", "action_results": [{"action": "Throw your axe at the Knight (W)", "result": "You sit there panting, and for a moment you see that the orcs on the hill have finally come down, and helped turn the fight around for the orcs. \n\n\nThe soldier readies his sword, and you lift your axe, hefting it forward.\n\n\nIt flies, whipping through the air.  The blade buries into the horses forehead, it lets out a pained neigh and drops forward.  The knight flies forward and off the horse, crying out as he does. \n\n\nYou hear a crunch as he hits the ground, and he rolls to a stop.  Trotting forward, you prepare your sword to finish him.\n\n\nThe knight grunts and feebly tries to stand up, but one of his arms is horribly bent.  He loses his balance and falls before he can get up.\n\n\nYou feel dizzy as you raise your sword, pain shooting through your arm.\n\n\nBefore you can strike him down, you hear a loud cry emanating out from behind you.\n\n\n ", "action_results": [{"action": "For the Emperor! (W)", "result": "You turn your horse, clutching your wounds.  From out of the trees, an enormous group of humans comes rushing out, screaming and yelling.  You notice they are quite different from the knights. While some of them have the silver coats, most of them just have some kind of padding and the Imperial soldier robes.  Their boots, gloves, and helmets don’t look anywhere near as nice as the knights'.\n\n\nThese must be the lowly soldiers of the Empire, but there sure are a lot of them.  Wincing, you turn as you see the lawless orcs bring up a cry, charging towards the humans.  You watch as your comrades also charge the humans, so you decide you should as well.\n\n\nGalloping forward, you prepare your axe.  A battle of strength versus numbers, you decide that Gigalak will decide the winner today. \n\n\nYou trample a couple of humans, their cries ringing out.  The axe bites into another, and as he dies his sword nicks your arm.  You slash, hack, batter, and even punch one.  A dying soldier cries out, digging his dagger into your side.  You gasp and slam your axe handle into his eye, a squishing sound resounds as blood squirts out and onto your leg.  He lets out a blood-curdling scream as he flails, soon going limp and falling to the ground. \n\n\nWith the dagger still in your side, you circle back, needing to fight through a few more soldiers to do so.  Panting, you see that the battle is being lost for the orcs, but some still fight on, despite their injuries and overwhelming odds. \n\n\nChief Greusim charges into the middle of it, laying waste to soldier after soldier.  His mighty club denting helmets and cracking skulls, breaking arms and busting jaws. \n\n\nYou watch as he cries out, someone plunging their sword into his side.  Gasping, you ride forward to save him.  But there are too many soldiers to fight through, and before you can reach him the grunts pull Greusim from his horse, stabbing, slashing, punching, and beating.  You see his own club being raised to be used against him.\n\n\nAll the other orcs in your tribe watch as the chief goes down, along with the other orcs he had around him. \n\n\nThere's just too many, you'll never fight through them all.\n\n\n\"Fall back! Fall back!\" some orc cries out.\n\n\nAs you all do so, the lawless orcs seem shocked as to why.  Before they can get away, the Imperial troops have swept them up and begin to butcher most of them.  Few escape, and you even swing one onto your horse as you ride away.  You trample and hack several Imperial soldiers on your way out. \n\n\nYou all ride into the forest, lucky to have escaped death on this day.  The same cannot be said for many others. \n\n\nYou exchange glances with Rolomag, who nods and pokes his chin to the valley.  Although you don't like the idea, you all will have to go there to recover and make plans….", "action_results": [{"action": "New Problems", "result": "You sit there by the fire.  Rolomag sits across from you, taking  a swig from a flask of orcish whiskey before handing it to you.  You gladly accept, the bitter substance burning your throat as it goes down.\n\n\nThe camp is silent except for the tribeless orcs squabbling over something.  \n\n\n\"We're gonna have to go back,\" Rolomag says.\n\n\n\"What? Back where?\" you ask.\n\n\n\"The village.  We need more orcs.  We have to get these Imperials out of our lands.\"\n\n\n\"I don't think it's going to work so well,\" you say, \"there's so many of them.\"\n\n\n\"What's wrong with you?\" Rolomag says, \"I used to hear stories about you from returning orcs in our village.\"\n\n\n\"That was years ago.  This is now.  Greusim was right.  We can't fight them.\"\n\n\n\"Yeah, well those animals tore him apart.  It's our job to get vengeance.\"\n\n\nYou sit and stare into the fire, realizing the Imperials are probably already marching further into Orcin.  Grunting as you stand, you walk over to the wild group of lawless orcs. \n\n\n\"Who of you is your leader?\" you ask.\n\n\n\"I am!\" one orc cries as he stands.\n\n\n\"No, I am!\" another yells.\n\n\nThey both start brawling, savagely punching and wrestling each other.  You shake your head and look to the rest.  A tall orc stands, one tooth protruding up from his underbite, the other chipped, warpaint in the shape of a red handprint on his face.  His raven black hair runs wild along his head, the sides shaved as is popular with warring orcs. \n\n\n\"I am Grolik,\" he says, \"leader of the Red Handed orcs band.\"\n\n\nYou extend your hand and shake his in the traditional orc handshake. \n\n\n\"I am grateful for your assistance,\" Grolik says. \"We probably wouldn't have made it out of there.\"\n\n\n\"We orcs need to stick together,\" you say, \"but I wonder.  How did this all start?\"\n\n\nGrolik looks to the side and shuffles his feet.\n\n\n\"We….uhh, we thought they were invading and tried to stop them.\"\n\n\nYou squint your eyes at him.\n\n\n\"You weren't raiding Imperial villages on their side of the border?\" you ask.\n\n\n\"Well…uh….no?\" he says.\n\n\n\"You realize you've put Orcin in jeopardy,\" you say.\n\n\n\"We can probably work something out with the Empire,\" Grolik says. \"Hell, they probably think they've won.\"\n\n\n\"I have half a mind to turn you over to them,\" you say, \"but I just want to get this all settled, and go back home.\"\n\n\nGrolik laughs hard at this.\n\n\n\"What? Have you gotten soft?\" he asks, \"what kind of orc are you?\"\n\n\nBefore he can react, your slam your fist into his face, bowling him over.  Some Red Hands grab their nearest weapons and stand up.  Several of your tribesmen prepare for a fight as well.\n\n\n\"No, no.  It's alright,\" Grolik says. \"Don't worry about him.  He's just a fool.\"\n\n\nGrolik snarls as he stands.\n\n\n\"But if you ever do that again,\" he says, \"it won't end well for you.\"\n\n\nYou just watch as he goes back to his spot next to the fire and guzzles some alcohol.\n\n\nGrunting, you walk back over to Rolomag.\n\n\n\"Just as I thought,\" you say.  \"We shouldn't even be involved.  They started this mess.\"\n\n\nRolomag's eyes widen for a moment before going back to staring sleepily at the fire.\n\n\n\"We still lost good friends there,\" he says. \"We need to right this.\"\n\n\n \n\nThe next day, Dekard and three other orcs ride back to the village to get some help.  You're sure some of the orcs will be happy to have some fighting to do.  Although you can't be sure where this will lead, you will be happy to keep the Imperials away.\n\n\nYou sit back, closing your eyes to rest.", "action_results": [{"action": "Two Months Later...", "result": "The wind plays along your hair, the warm morning sunshine gracing your face.  The rocky outcrop you lay upon offering you a complete view of the Imperial camp ahead. \n\n\nThe past two months had been spent watching and tracking the Imperials.  Their move into Orcin has been slow, and, other than a few minor fights with other random lawless bands, they have not done much. \n\n\nYou watch soldiers milling about, their purple and black standards dotting the camp.  Stern officers watch younger soldiers and recruits train, practice, and do drills.  Oddly, it looks much like an orcish war band preparing for battle.  Only, the humans have a lot more wagons and crates of supplies than orcs, who mostly live off the land as they go.\n\n\nThe camp of soldiers still outnumbers your group, even with back up from the camp and some more tribeless orcs rallying to the Red Handed cause.  Grolik's band are even more impatient and bloodthirsty than regular orcs. \n\n\nGrolik sits behind you, mumbling something as he sharpens his axe blade.  His plan is just to march in and start slaughtering people, but you know you'll only be overwhelmed and killed.  These soldiers are too numerous and too skilled for those tactics. \n\n\nYou're going to have to go with another plan, somewhat against your nature, but maybe it'll help win this fight.\n\n\nAlmost on cue, a column of soldiers marches onto the road running through the camp.  They all have their helmets and silver coats, as well as varying degree of light weapons. \n\n\n\"Humans sure do dress strangely for battle,\" you say.\n\n\nLeading the column is a knight on a horse, looking very similar to the knights you first encountered. \n\n\nYou signal the orcs around you, slowly making your way down the rocky hill. \n\n\n\"Come on,\" Grolik complains. \"Let's charge 'em!\"\n\n\n\"No, we must wait.\"\n\n\nPutting your finger to your lips, you follow the Imperials as they move through the forest.  They move quite slowly, and some don't really seem to even be paying attention. ", "action_results": [{"action": "Circle", "result": "Your orcs faithfully carry out your plan, most moving ahead and some around the Imperial soldiers, until you have created a c-shape around them.\n\n\nEvery orc has the same tools for fighting these humans.  As they march forward, you prepare to throw one of your spears.  Lifting it, you watch as the knight stops and looks to his right.  As you chuck the spear, he looks ahead.  Somehow he manages to duck and slip off the horse, hitting the ground and rolling before the spear can hit him.\n\n\nYou watch as it harmlessly bounces off a soldiers helmet.  Once an eerie silence, the area now erupts with men and orcs shouting, as orcs fire arrows relentlessly at the soldiers.  As you notch an arrow, the knight lays down behind his fallen horse. \n\n\nYou observe the arrows and most spears bouncing off the silver coats they wear.  Although some are killed when they are hit in spots the coat doesn't cover, such as arms, legs, and their faces.  You are surprised to see one spear actually pierce the armor, but it can't have gone too deep as the soldier is still standing. \n\n\nThe soldiers hide behind their shields and armor, most of the projectiles becoming useless.  The orcs get sick of all this shooting and decide to charge the Imperials.  As you draw your axe and run forth, you see the Imperials making a line of shields with other Imperials standing between them and firing arrows through.\n\n\nThe orcs are pierced by arrows as their axes and swords bounce uselessly off the shields.  Getting closer, you watch an Imperial bash an orc with his shield before slicing through his padded leather shirt with his sword.\n\n\nYou rush in, throwing your shoulder into one of them.  The human doesn't quite fall, but you ram your axe head's spike into his face.  He cries out in pain and falls, and you barely have time to react before other soldiers close the gap.  You leap back as three blades are swung and jabbed at you.", "action_results": [{"action": "Break", "result": "While some Imperials have been killed, they are quickly whittling down your numbers.  To your left, you see the knight caught out of the line, trying to rally his soldiers.  You watch as an orc chops at his head with an axe, but it bounces off his helmet.  The knight rams his sword blade through the orc's armpit, pushing the dying orc off. \n\n\nAnother orc slashes, the blade harmlessly skidding across the helmet.  Before the orc is cut down, he slams the flat of the axe on the soldier's helm, slightly denting it. \n\n\nYou look to the Imperial with the protruding spear from his silver coat, and the knights dented helmet.  You get an idea…", "action_results": [{"action": "Smash a rock on the knight", "result": "You run up to the knight, parrying a jab, tackling him and throwing his sword to the ground.  The knight rolls to the side, slamming his fist into your stomach as he comes up to a crouch.  It barely affects you, but he reaches his sword.\n\n\nAs he grabs it, he stumbles and, seeing your moment, you grab a large rock.  The knight twirls around, crying out and trying to take your head.  You duck, the blade swooshing over your head.  With a mighty roar, you stand, slamming the rock onto his helmet.\n\n\nThe sound of metal crashing attacks your ears.  The Empire's knight crumples to the ground, a large dent in his helm.  You kneel down, slamming the rock into his helmet again and again.  The helmet crushing inward unnaturally and the man's body spasming as blood seeps out from under his helmet. ", "action_results": [{"action": "Retreat", "result": "The orcs give a cry as the knight dies, and the Imperials try to execute a controlled retreat.  Some orcs mimic you in using force to crush the helmets and pierce the silver coats.  You notice though, that most of the weapons used seem heavily damaged after.\n\n\nPicking up an Imperial shield, you catch up to some unfortunate and ram the shield into his helmet, denting it.  You slam the point of the shield into his face until it is a pink, bloody, unrecognizable mass of flesh. \n\n\nAt this point, the soldiers are in full flight, attempting to reach the safety of the camp.  It is not too much longer before all of the Imperials lay butchered on the ground.\n\n\nPanting and covered in sweat and blood, you lean against a tree.  You watch as the orcs loot the corpses, taking Imperial weapons. \n\n\nCurious, you walk over to one of the bodies, removing his silver coat.  It clanks together as you move it about and is heavier than you thought.  Peering closely, it appears as though it is made up of many little rings of metal.  You fold it up and stash it inside an Imperial soldiers satchel, which you also take. \n\n\nYou assist the orcs with collecting the dead and wounded, intent on better preparing for your next encounter...", "action_results": [{"action": "Two Years Later...", "result": "The past two years have been successful in repelling the Empire.  While you wish it didn't have to come to this, you know that these humans can't freely move their army around Orcin without consequence. \n\n\nShortly after ambushing that patrol two years ago, you led the orcs into a nighttime raid on the camp.  Your warriors cut throats, burned tents and supplies, and left few survivors.  Since then, the human generals have sent more and more troops to try to contain the situation. \n\n\nOnce this had happened, you enlisted the help of a couple of the other surrounding orc tribes.  Using your newfound guerilla tactics, you managed to keep the skirmishes to the forests at the borders of Orcin. \n\n\nIn the meantime, your fellows had created some advancements to cracking the metal shells of the Imperials.  Heavy tipped arrows and spears for piercing the chainmail armor, as you have since learned was the name for their \"silver coats\".  You had also taken the heavy wooden clubs and trimmed down the large wooden portion for a couple metal rings wrapped around the tip.  This would make them easier to swing, and it is easier to dent Imperial helmets, as well as bruise and break limbs. \n\n\nAlso, having taken some of the chainmail, you and the others have learned how to make your own in recent months.  Although you were not able to make steel, you used iron to make chain rings and studs woven into your leather padded clothing. \n\n\nThis had decreased the chances of death for your orcs, forcing the Imperials to get more creative with their killing methods as you have had to.  For a while, you had the upper hand until they developed heavier weapons that could easily pierce mail.\n\n\nNeither the orc tribes nor the Imperials have made any attempts at establishing peace or any sort of treaty.  It just seems as though these fights have become normal for both sides by now, although the council has sent you several messages asking to make a treaty.  You always send the messenger back, telling them to come do it if they are worried about it.  It isn't that you do not want peace, but the Imperials have become pretty skittish at the sight of orcs, each side shoots first and asks questions later.", "action_results": [{"action": "Interruption", "result": "Two loud voices shout just outside of your tent.  Pushing the flaps aside you step out and are not surprised to see that Rolomag and Grolik are arguing again.  While Grolik was a problem for a while, he seemed to warm up after you unknowingly saved his cousin's life a few months ago. \n\n\nYou watch as the two bicker like some old married couple.\n\n\n\"Grolik, you're a fool if you think we can push into Imperial territory,\" Rolomag shouts.\n\n\n\"My orcs haven't looted anything in weeks. We're getting restless.\"\n\n\n\"See, I can agree on invading soldier camps,\" Rolomag replies, \"but actually going into their home villages and towns is asking for more than we can handle.\"\n\n\n\"It's only a matter of time before they start attacking ours,\" Grolik says. \"Once they realize we've been trading with the surrounding neutral villages, they'll start wiping them out.  And there are innocent people in those villages too.\"\n\n\n\"Why do you care?  You're worried the Empire is going to steal your victims?\"\n\n\n\"Of course I care, they're fellow orcs damn it!  Besides, we only raid fellow bands of 'tribeless orcs', like ourselves.\"\n\n\n\"So you've never raided a village?\"\n\n\n\"Well….maybe we've stolen crops and cattle here and there.  But that's survival, and we usually don't murder anyone.  Besides, we wouldn't want to bring the wrath of the council on us.\"\n\n\n\"But you have no problem stirring up the Empire?\" Rolomag asks.\n\n\n\"It was the same thing with them.  We stole crops and cattle when we needed.  I thought if anything they would just bolster their defenses, not send a damn legion in here.\"\n\n\nGrolik seems to realize he has stepped too close to Rolomag and sighs as he takes a step back.\n\n\n\"Besides,\" he says, \"they're not completely innocent.  They've made dozens of trespasses in years past.\"\n\n\nYou stand and watch, a scowl on your face.  They both are right to some degree.  It seems that you can either escalate the conflict or remain in this little stalemate. \n\n\nYou have also been made aware that the goblins living in the Southwest of Orcin, who have always been rivals with the lawless, have become bolder.  After years of constant skirmishing with the lawless orc bands, the goblins have gotten more organized, made better equipment, and even have moved further into Orcin.\n\n\nThis is an issue for everyone as the lawless orcish tribes and the goblins have usually kept too many dwarves, humans, and more adventurous ogres and other invasive creatures from coming too far in from there.  While you are sure there are smaller pockets of goblins and other creatures in the orc lands, these goblins have only increased in number. \n\n\nNow, with the lawless focused on the Mannate Empire, and the goblins moving away from the Southwestern border, you've heard of dwarves making a steady advance into the lands.  They mostly just mine for raw materials, the only military presence being small teams to protect the miners.  You are aware that many of the dwarves have a partnership with the Empire, and, at any moment, they could push into the hills and plains and into the heart of Orcin.", "action_results": [{"action": "Issues at hand", "result": "Stopping your thoughts, you decide to intervene before Rolomag and Grolik come to blows.\n\n\n\"Enough,\" you say. \"We will figure all of this out.\"                 \n\n\nIt seems that you have become the unofficial chief of your tribe since Greusim's doom, and even his son Galik hasn't tried to challenge this.  It has its benefits, but also its own headaches.\n\n\n\"Well, Nolazir,\" Rolomag says, \"what will it be?\"\n\n\n\"Neither for now,\" you say.  \"We need to amass strength before we do anything else.  We can probably keep them in this stalemate for a while.\"\n\n\n\"You need to act now,\" Grolik says. \"I think you've become complacent, and that never ends well in these situations.\"\n\n\n\"Grolik,\" you say, \"while we have many orcs, I don't think we have enough to keep this up for too much longer.  All the humans need to do is galvanize a couple of legions, and they could wipe these mountains with our corpses.\"\n\n\nYou grunt and spread your arms out for a moment.\n\n\n\"We can't risk escalating right now,\" you say, \"but we also need to keep up the appearance of being a larger force, and we know this won't keep up for long.\"\n\n\nYou gesture for the two to enter your tent, where you have a large map of Orcin pinned to a wooden table.\n\n\n\"See here?\"  You point on the map. \"The goblins started out here.  The lawless orcs drove them way out over here.\"\n\n\nGrolik grunts in surprise, apparently unaware that they had covered so much ground.\n\n\n\"We need to either wipe them out,\" you say, \"or make a treaty, which I like better.\"\n\n\n\"What?\" Grolik says.  \"They're filth, scavengers, and cowards.\"\n\n\n\"They're organized,\" you say, \"and like you and your lawless tribes, they have kept the dwarves away.  If we can make a treaty between them and the lawless tribes, you all should be able to live close enough, back where they originally were.\"\n\n\nYou point back to where the goblins originally lived.\n\n\n\"Once we have made peace with them,\" you say, \"your orcs can enjoy whatever spoils they take from the Imperials.  We'll even help you establish farms and trade with the rest of the orcs.\"\n\n\n\"Why would we want that?\" Grolik asks.\n\n\n\"No more hungry winters.  Besides, don't think I don't know what you all do for food when you're desperate.\"\n\n\nGrolik's eyes dart to the ground, his face wincing for a brief moment.\n\n\n\"What are you talking about?\" he says, not so much asking.\n\n\n\"You know damn well.  It's against Gigalak.\"\n\n\n\"It was just survival…\" Grolik says.\n\n\n\"Yeah, well we're not animals… or wendigos.\"\n\n\nThere is a silence as Grolik shifts uncomfortably.  Rolomag just pretends he is not paying attention as he studies the map. \n\n\n\"Now,\" you say, \"while I deal with the goblins, can you gather some of the lawless tribes?\"\n\n\nGrolik still looks ashamed, but he nods.\n\n\n\"If I promise them some loot, food, and some autonomy… then yeah, I can.\"\n\n\n\"Good, now can you and your best go handle that?\"\n\n\nGrolik nods and walks out of the tent.  After a few moments, Rolomag speaks.\n\n\n\"Damn,\" he says, \"didn't know things were that desperate for them.  Now I guess I can see why they loot.\"\n\n\n\"Yeah, well we will put an end to that soon enough.\"\n\n\nYou sigh and grab a pack of supplies.\n\n\n\"Rolomag, stay here and watch over the camp,\" you say.\n\n\n\"Where are you going?\" he asks.\n\n\n\"I'm taking a group, we're going to go take care of the goblins, one way or another.\"\n\n\nWith this you exit the tent, gathering some trusted orcs for the trip.", "action_results": [{"action": "One Month Later...", "result": "The last several weeks have yielded little results.  After reaching the deserted camp of the goblins, you can only assume they had moved deeper into Orcin.  At this point, you're wondering if going total war on them wouldn't be a bad idea.\n\n\nWhile orcs do not always completely waste their enemies, conflict can get messy and shit happens.  This might become one of those instances if the goblins keep pissing you off.\n\n\nAs you travel deeper into the hills, the light drizzle overhead turns into a heavy pelting.  At first, you see one, then two dim fires in the distance.  The fields and hills slowly turning to marsh and then swamp as the trees in the outskirts give heed to many mysteries and dangers.\n\n\nSince the beginning, the orcs have always stayed well enough away from the swamps of their own homeland.  Except for some light traveling on the outskirts, there has always been some common knowledge that something terrifying resides deep within.  It would seem that, perhaps, the goblins welcome the unknown fear that the swamplands bring.\n\n\nYou look to your orcs, signaling them to travel through the swamps and towards what might be the goblin's camp.  At first, you just see some lamps tacked onto the trees, but soon you see the campfires ahead.\n\n\nAfter some time, you finally reach the camp.  It consists of wooden huts, bridges, and walkways to evade the murky waters.  Several goblins sound a horn as they see you, all preparing to defend themselves.  You raise your hands, signaling you are not a threat.\n\n\nThe goblins seem to be reluctant until one comes forward.\n\n\n\"Hey, stop!\" it cries. \"I recognize you… aren't you the orc chieftain?\"\n\n\n\"Yes.\" you say.  \"Where is your chief?\"\n\n\nThe goblins all look at each other, seemingly whispering amongst themselves.  You slowly reach down to your side, clutching your axe.  After what seems like a long time, one of the goblins finally steps down and around to the closest walkway.\n\n\nThis one seems to be wearing some sort of fur shawl, the skulls of various animals and other races adorning his belt.  What appears to be a large snake tooth hangs from a necklace on his neck.  His black hair is tied up into a messy knot which seems common for goblin shamans. \n\n\n\"Chief Gru'zikular is not taking guests right now,\" the goblin says as he starts to turn around.\n\n\n\"Yeah, well you're encroaching on our territory,\" you say.  \"I'm here to ask you to go back to where you came from.\"\n\n\nThe goblin turns, his yellow eyes appear to be gleaming.  A sick smile spreads across his face.\n\n\nYou frown, knowing that something isn't right about this particular goblin.  This one seems different from the rest.\n\n\n\"What? Go back to those hellholes you call caves?\" he asks.\n\n\n\"I don't care if you go into the caves or not.  The dwarves are creeping into that area, as well as other things.  You used to keep them away, and your presence would probably slowly force them to back off.\"\n\n\nThe goblin just stares at you.\n\n\n\"If you go back, it can be beneficial for all of us,\" you continue.  \"I can even get the tribeless orcs to leave you all alone.  You can build proper houses such as the ones you have here.\"\n\n\n\"You see, orc,\" the goblin says, \"these swamps had always been the homes of the goblin people.  We were never supposed to be cave dwellers as everyone seems to think.\"\n\n\nThe goblin raises his hand as the other goblins start to join in.  They immediately go silent.\n\n\n\"I demand to see your leader,\" you say.  \"I will not listen to this foolishness.\"\n\n\nThe strange look on the goblin's face intensifies.  His teeth showing as his sick smile widens.\n\n\n\"As you have asked, so shall it be,\" he says.  \"Just East, further in, you can find our leader.\"\n\n\nThe goblin gestures, showing the way.\n\n\n\"I advise you though, green one, the Master's work is best not interfered with.\"\n\n\nYou furrow your brow, wondering at the meaning.  You look at the whole group of goblins, who, compared to this one, seem like they are more even-minded. \n\n\nAlso, you seem pretty sure that this emissary for their chief may have been threatening you all.  But he is just a goblin, you could crush him if needed.\n\n\n\"Tell me, who are you?\" you ask.\n\n\n\"I am the Shaman, Rozibu,\" he says, \"speaker for Gru'zikular and humble servant of the Master.\"\n\n\nYou squint at him.  Perhaps it would be best to return and have the tribeless bands inhabit the lands the goblins used to live in.  It would accomplish a dual purpose; each group gets their own respective territory and stops fighting, and it is not like the goblins are using any land that you are not.  Also, the tribeless orcs could probably keep the dwarves out.\n\n\nAs you stare at the forest beyond, you get a feeling, not of immediate danger from the goblins standing before you, but a dark foreboding.\n\n\nYou and the goblin stare each other down, the whole time you think about what you should do. \n\n\n[Add link for Reign of Amortia]", "action_results": [{"action": "Turn Back", "result": "Sensing that continuing on this mission would be foolish, you begin to leave.\n\n\n\"I don't think that will be necessary,\" you say as you nod your head.\n\n\nYour orcs protest, but you hold up a hand to silence them.  The goblin just smirks and bids you farewell.\n\n\nA sense of relief sweeps over you as the horse trots out of the marsh.  There was something weird going on there, and you don't want to know what it was.  You have more important things to worry about right now.\n\n\nYou hear a couple of the other orcs express their relief in getting out of there as well.  Soaking up all the little conversation, you are content to sit quietly and enjoy the trip back to your camp.\n\n\nA couple weeks later, you have arrived, many orcs welcome you and your group back.  The journey back was much shorter, as you didn't have to spend any time searching; like you needed to do on the way to the goblin camp.\n\n\nOn the other side of the camp, there appears to be a large addition, namely dozens and dozens of tents and large groups of orcs.  You can tell from their tattoos, paints, clothing, and general demeanor that these are the lawless tribes that Grolik had gathered in the last month or so.\n\n\nGoing around the camp, you gather Rolomag, Grolik, Galik, Dekard, and a few other orcs.  Bringing them into the tent, you start to go through plans for fighting the Empire…", "action_results": [{"action": "One Year Later", "result": "Over the course of the last year, things have been going smoothly for you and your army.  Some of the lawless orcs have begun to push the dwarves out of Orcin.  As per your instructions, they haven't used methods that were too over the top.  You don't want to attract the might of the dwarven armies, and other than a few small skirmishes there has not been a whole lot of trouble for them.\n\n\nThe Imperial patrols and camps have increased, but they have not taken any ground.  In fact, they lost some serious distance a few months ago.  You led a large assault on a couple of the camps, then about a week later some of your scouts were overrun by a surprise Imperial patrol.  Among them was one of your best scouts, an orc named Ruzmar.  In retaliation for the dead scouts, you staged another large attack.\n\n\nUnlike the last one, you managed to recover a lot of loot and supplies, while killing multiple Imperial soldiers. \n\n\nIn the meantime, you have not heard from the goblins.  They have not moved any further into Orcin, and they haven't moved back to the hills and plains.  There were reports of some minor earthquakes in the area, but nothing after that.\n\n\nSeveral of the Council members visited your camp recently as well.  Some congratulated you, and others scorned and chastised you for fighting the Mannate Empire so doggedly.  In the last couple of months, the Council got the Empire to agree to stop the fighting.  While you didn't agree with this, you have respected the armistice.  From what your messenger has told you, the Council and Imperial ambassadors are at a stalemate in terms of negotiating a treaty.\n\n\nYou have just taken this time to better arm and train your orcs, for when the Empire continues the fight, you will be ready.  The peace has allowed many of the orcs to take an extended leave to return to their homes though.  Many have farms, cattle, families, and other important endeavors to watch over.  So until it is time to recall your orcs, a skeleton crew patrols the mountains and borderlands. ", "action_results": [{"action": "Home Again", "result": "After a long day of taking care of household duties, you sit and watch your children.  Grovlar and Vokra have gotten big.  It seems they do so considerably every time you have taken a trip back during these last three years.  It has been a whole nine years since you finished fighting the Wister Elves, and since the last time you saw Valek.\n\n\nWhile you do take care of home and village life, messengers bring regular reports to you on the state of the conflict with the Empire.  Not much has changed in the last few days, of course.  You are actually content with it being so, and, who knows, maybe the Council will come to an agreement with the Empire.\n\n\nGilikia, your wife, comes outside.  She kisses you before looking at the children at play.  Little Lagrik stumbles around, trying to keep up with the two older kids.\n\n\n\"When is this all going to end?\" she asks.  \"You know we need you here, Nolazir.\"\n\n\n\"I am doing what needs to be done,\" you say.  \"When it is all over, I will return home, and I will stay here.\"\n\n\n\"They won't be small forever.  Don't you want to watch them grow up?  And what if you….\"\n\n\nShe trails off, not able to say the obvious concern on her mind.  You turn, taking her hand in yours.\n\n\n\"I've been through too much for too long to let anyone or anything take you all away from me.\" You say as you stand up and embrace her, and, stepping back, you continue to hold her hands.\n\n\n\"I have been blessed with you, my beautiful wife, and these healthy, strong children,\" you say.  \"If it weren't for you all those years ago… well, you pretty much saved me from what I would have become.\"\n\n\nYou step a little bit closer.\n\n\n\"If Gigalak didn't intend for us to be together,\" you say, \"he would have never let me off those muddy fields in the Elven kingdom, but he did, and I am grateful to have you all.  I know he will return me to you every time.\"\n\n\n\"Well…how do you know?\" she asks.\n\n\n\"Because, while I may be off fighting in the mountains and off finding the Imperials in the forests... my heart is here, with you all, and an orc always returns to where his heart is.\"\n\n\nShe leans into you, squeezing with all her might. \n\n\n\"I love you,\" she says.  \"I know you'll always return to me.\"\n\n\nYou smile and hold her, as you turn and watch the children playing… and once in a while eating an insect on the ground…", "action_results": [{"action": "Six Months Pass", "result": "The last few months find you and your army in the forests by the border.  Reports had come of a legion of Imperials slowly making their way to the border.  In the meantime, you have amassed assistance from a few more orc tribes.  All the while, the Imperials wait, and your forces grow stronger and stronger.\n\n\nYou wait, while the rain pelts your face.  Every orc is silent as the ground starts to become muddy at the intensity of the precipitation. \n\n\nYou signal the orcs to move forward, a slow trod through the mud.  The Imperials are moving dozens of soldiers through, but if all goes to plan they'll never make it to the staging ground.  By the time you reach them, you are hoping their supply wagons will be stuck in the mud, and their horses antsy at every trick and sound of the forests. \n\n\nWhen the time is right, you will strike, and make them pay.  If the Imperials seek to break their treaty, you will show them the consequences.  You all have your padded leather gambesons over your chainmail, extra leather straps tied around to reduce some of the clinking the chain tends to make.\n\n\nRiding forward, you catch Grolik's eye, who nods at you.  Rolomag as well, who winks and pats his heart with his palm in a sign of respect. \n\n\nComing up to a ridge, you signal your forces to stop.  Creeping low through the foliage, you see the Imperial columns.  As suspected, their wagons seem to mostly be stuck in the mud.  At your signal, your archers start their painstaking crawl over to the ridgeline. \n\n\nThe other third, slowly bring their horses onto both sides of the columns, preparing their charge.  On the other side across from you, some of the lawless orcs should be preparing their attack on the Mannate soldiers.  The cavalry orcs should still be fighting their way through by the time the archers are done, and when that happens they will slide down the slope.  You don't want to run the risk of accidentally shooting your cavalry, so the archers will have to work fast, but by then the Imperials will be surrounded, and you should be able to crush them. \n\n\nAs the rain intensifies a bit, their horses get even antsier.  As the lightning strikes, the soldiers look into the dark forests, fear apparent.  When the thunder claps, their officers bark orders to hurry and move the wagons from the mud.", "action_results": [{"action": "Stay with the Archers", "result": "When the heavens are silent, the wind stops blowing for a moment, and the trees stop their near eternal sway, a single arrow soars.\n\n\nThe Imperial officer, in the middle of yelling his commands.  Lurches forward, his face curling up as the arrow pierces his chainmail, sticking through his heart.  Only a moment after, dozens of arrows are unleashed upon the hapless soldiers.\n\n\nTheir cries ring out, almost drowned out by the thunder of Gigalak's wrath.  Many soldiers lay wounded, and others lay fallen.  They try to hide behind their wagons, some even shooting back.  You lay low as some of their arrows pierce the foliage, a few lucky shots downing some of your comrades.\n\n\nAn Imperial crouches behind a wagon, your arrow ready to be released and show the Imperial his doom.  As the lawless fire their arrows, the Imperial screams as arrows slam into his back.  On both sides, Imperial and Orcish cavalry alike duel on, the clamor raging. \n\n\nAt your signal, you and the orcs charge down the slope.  You slide through the mud, running as you touch the bottom.  Some arrows happen to miss you, swept off course by Gigalak's hand, and you break into the soldiers.\n\n\nThe first one you slash with your sword, his blood oozing from his coat and covering the top of his hauberk.  A swooshing sound comes from up ahead, a soldier's sword clinking against your leather padding and chainmail as you dodge the blow.\n\n\nWith a roar you embed your axe into his shoulder.  His chain catches most of it, but you ram your sword pommel into his jaw.  His face being reduces to a broken jaw and a bloody face, you turn to deflect blows from his other comrades.\n\n\nA spearman downs the orc next to you.  Noticeably, his armor covers his face, two slits over where his eyes are, and a grate over his mouth.  He spins and twirls, intent on tripping you up.  You are too experienced and would not fall for this trick.  With a hop you avoid this maneuver, charging towards him as he brings the spear up and around.\n\n\nAs your foe tries to bring the spear down, you catch it in the shoulder of your axe.  Pushing it away, you step forward and jab your sword.  He grunts as the tip pierces his armor, and he accidentally drops the spear.\n\n\nTaking this moment, you charge and swing.  Two other Imperials rush in to his aid, one nearly beheading you.  You roar and charge forward, ramming the sword all the way through his gut.  The second Imperial nicks your arm, and you slam the hammer side of your axe into his head. \n\n\nThe spearman draws a dagger, jabbing at your side.  It bounces off the chainmail, and seeing this, he and the other soldier charge you.  With the axe you deflect a dagger blow, ramming your shoulder into the spearman.  The other Imperial tries to aim for your throat, but, with a quick parry, your axe lands in his face.  A gurgling cry comes out, stymied by the blade in his face. \n\n\nA squelching sound comes from behind, and you swing around just in time.  The spearman lifted a sword from a fallen comrade and stepped into jam it through your back.  Luckily you sidestep this and, grabbing his wrists, you twist the sword from his grasp.  He grunts as you force him to drop it, and slam one hand into his face, exposing his throat.\n\n\nWith a mighty cry, you send your fist into his exposed throat.  A pained choke coming from behind the helmet, he steps back and grips his throat.  He falls to one knee, his windpipe crushed, and his adam's apple dislodged.  You turn your attention to other combatants as the spearman struggles with choking to death…", "action_results": [{"action": "Forward", "result": "The Imperials try to hold out, managing to down a few orcs, but, in the end, they are overwhelmed.  You stand, stabbing an Imperial with one of their own spears repeatedly.  His friend, clutching an injury, swipes his blade at you.  You step back to dodge and ram the spear into his throat.  Gurgling as he goes down he swings once more; his blade scratches your hand but not too deep.\n\n\nTwisting and pulling the spear, you yank it from his corpse.  You run forward, seeing the orcs beating down a group of Imperials.  The last few men seem terrified, and one not older than seventeen trembles.  If you could hear over the sound of the fighting, you would be able to hear his knees causing his hauberk to clink together. \n\n\nBefore you can reach them, the rest of the orcs have stabbed and battered them into oblivion.  Some orcs ride into the forest to find the fleeing soldiers.\n\n\nYou pant, watching the massacre taking place all around.  Wounded men cry out, and some lay there dying quietly. \n\n\nAn orc approaches you, the frenzy of blood-shed just starting to wear off. \n\n\n\"What shall we do with the wounded?\" he asks.\n\n\nYou sit there and think for a moment.  Orcs have never really taken prisoners, and you don't have the supplies to care for their wounded.  You are worried about having enough medical supplies for your own as it is. \n\n\nAlthough it might help to take some of them ransom, there is not too much that you would need, so maybe just leaving them to die would be better. ", "action_results": [{"action": "Finish them off", "result": "\"Finish off the wounded,\" you cry.  \"Leave no survivors!\"\n\n\nAt this, the orcs seem to go into a frenzy again as they start clubbing, hacking, and slashing the wounded.  Some orcs even loot the dying men before slicing off their scalps. \n\n\nStepping forward to do your dirty work, you flip over an injured soldier with your foot.  Placing the sword tip to his throat, the man tries to talk but his voice seems hoarse.  He sputters as rainwater barrages his mouth, and he soon closes it to die quietly.\n\n\nWith your foot on his chest, he feebly grabs your calf.  Snarling, you push the sword down as the tip slowly pushes through.  Blood oozes out of the neck wound, the man sputtering and choking on his blood, and the blade penetrating through.  In a matter of moments, his hands stop feebly hitting your leg as they go limp.\n\n\nIn the large crowd of orcs, you see Grolik.  He pushes a spear tip into a dying human, his face twisting into a mixture of anger and shame.  As Grolik pulls the spear out, you catch his glance.  Guilt written all over his face.\n\n\nYou were not aware that an orc such as he could have such emotions.  It comes as a bit of a shock to you, but sometimes tough things must be done to preserve victory.  While killing the helpless is not a task for the faint of heart, it must take its toll on some.\n\n\nRolomag sits on a rock, using a rag to nurse a gash on his cheek.  He seems tired, and just sits and watches the other orcs.  A good amount of whom are helping your injured orcs.  Sighing you decide it is a job best fit for them, as you have other work to do. \n\n\nYou wander off to continue…", "action_results": [{"action": "Aftermath, Six Months Later", "result": "These past six months after the battle where you ambushed the soldiers in the mud have been brutal.  You continued to push through, fighting patrol after patrol.  It seems that after some time, the humans have wised up, laying counter traps and ambushes.  These did not work too favorably for them at first, but they soon developed their skills.\n\n\nUnlike them, you don't have hundreds and hundreds of recruits.  You and your army are tired, theirs is often quite fresh.  These skirmishes have dragged out over the last four years, and while they are not as intense as the four years of war you experienced with the Wister Elves, it is taking its toll.\n\n\nYou need more troops, and you need them fast.  It may be time to unite all of the orc tribes, as this concerns them as well.  While they are not fully involved, they have not been entirely complacent.  Some have traveled far to join you and your warriors, believing it is in the best interest of Orcin. \n\n\nYou have heard of reports of other armies such as yours gathering up.  Having tried to correspond with them, there have been delays, or the messages never arrive.  The increased Imperial presence must be contributing to this.  It seems that every month brings more and more of them on your doorstep.  You know that soon, they will be ready for a giant push.  The ambush and sabotage missions can only hold them back for so long.\n\n\nWhile you do technically have your troops on some kind of rotation, it hasn't been enough.  The only real reason for the rotation is that you and many other orcs have homes and families to take care of.  Many of them have family and children old enough to help out on their farms and their ways of living; which you believe should at least help them in their home efforts.  The winters have been especially brutal these last few years though.  The only consolation is that, as orcs, you all tend to live off the land when agriculture is not available, which has helped immensely. \n\n\nYour recent decision to bring all of your warriors back into the fight has caused grumbling from many.  They do not rebel though, as they know they work for the good of all of orc-kind.\n\n\nWhile there are some that don't agree with everything you are doing, such as Galik and sometimes Grolik, you suppose that is bound to happen in these situations.  \n\n\nLeaving your tent, you go to check up on things...", "action_results": [{"action": "By the Border", "result": "Standing on a rocky ridge, you watch over a large clearing.  On the other side is a forest leading from Orcin and into the Imperial lands.  Behind you stands Galik, who seems to be lost in thought. \n\n\n\"Just a few miles out there,\" you say, \"lies the Imperial homeland.\"\n\n\nGalik raises an eyebrow and steps forward, standing at your side.\n\n\n\"Will we be waging war in their home? As they have done to us?\"\n\n\n\"No,\" you say, \"they have legions staged in those forests.  Going in now would be suicide.\"\n\n\n\"So what, we're just going to sit here and let them take back the land we just kicked them out of?\"\n\n\n\"Yes… to a point.  See this field? They'll never cross it on our watch, but they will try.\"\n\n\nYou sigh and pat Galik's shoulder.\n\n\n\"I need you all to watch over everything for me.\"\n\n\n\"What? Are you leaving us?\"\n\n\n\"Not for long,\" you say.  \"I need to get some help.  Unite the tribes.\"\n\n\n\"That's impossible, they'll never agree to join us.  If the Empire kills us all, well, they don't want to be held responsible as well.\"\n\n\n\"No, they'll see reason,\" you say.  \"This affects all of us.\"\n\n\n\"Nolazir,\" Galik says, \"if you don't move us into their homeland soon, I will do it.\"\n\n\n\"Don't, you fool.  This would put all these past few years of fighting to an end, and it wouldn't be good for us.\"\n\n\nYou point to Rolomag who is standing nearby.\n\n\n\"Make sure he doesn't do anything stupid.\"\n\n\nWith that, you mount your horse and ride back into the lands of Orcin.  While you have left a few trusted orcs in charge, you hope not to take too long.  Galik's impatience could spell doom for the Orcish army.  Rolomag certainly will obey your orders.\n\n\nYou are not sure of Grolik though, he has been scarce the last couple of days.  He seems to be leading his orcs from inside his tent.\n\n\nWhile you are not sure of the outcome, you know you will fight the Mannate Empire until the bitter end.\n\n\nBreathing in, you take in the air of the forests as you make your way to the tribes.", "action_results": [{"action": "Rising Part Two", "result": "One Month Later…\n\n\nThe large wooden gates of the village creak open, the surrounding orcs casting suspicious glances your way.  A few even have their hands on some weapons nearby, and you do not blame them.\n\n\nRiding in through the mist which veils dawn's light, you appear almost as a specter of death.  Lifting the hood, you give your brethren a weary nod. \n\n\nA few of their eyes widen as they recognize you, some stand unsure of who you are, and some just shrug and go back to their business. \n\n\nOne orc approaches you.\n\n\n\"Who are you?\"\n\n\n\"I am Nolazir, surrogate chief of the River Tribe in place of Chief Greusim.\"\n\n\nThe orc's eyes widen.\n\n\n\"It's been four years, and you have not found a replacement? Does he have any sons?\"\n\n\nYou nod.\n\n\n\"One, but he is young and impatient.  I will stand in until he has learned how to do his duty with patience and wisdom.\"\n\n\nThe orc scoffs at the unthinkable act of leaving a tribe largely chief less.\n\n\n\"What is it that you seek?\"\n\n\n\"I want to speak with your chief,\" you say.\n\n\nThe orc shrugs and gives you directions to the chief's hut.  That was a bit easier than you thought.\n\n\nAs you ride forward, the large hut comes into view.  You are impressed to see that it actually has two stories to it.  Most orcs chose to build one floor but with a wider house, although you are aware the council has at least three floors.\n\n\nPushing this useless information out of your mind, you hop off your horse.  Your legs are stiff from the long ride, and you take a moment to stretch them.\n\n\nMuffled yelling comes out from within the doors of the chief's hut.  Splinters of wood fly as the door bursts open.  A hapless orc youth falls out and tumbles down the stairs. \n\n\nA large, broad orc steps out.  His dark mane falling past his shoulders, two sharp teeth protrude from his bottom lip.  His right eye looks like it is perpetually swollen halfway shut, a series of scars emanating from the side of his eye and going all the way to his ear.  On his head rests a helmet with two bullhorns attached to it.\n\n\nHis tribal necklaces jingle as he bounds down the steps, his boot landing in the young orc's face.\n\n\n\"Fool, how could you be so incomprenent?\" he says, not realizing he butchered the word.\n\n\nThe youth prepares to defend himself, but the chief is too fast.  He twists the orcs arm and lands several fists into his ribs.  As he continues to beat the orc, you wonder if he will kill him. \n\n\nWhile you have the strong urge to step in, you also don't want to get into another tribe's affairs.  They could easily kill you for interfering, although it wouldn't be the first time you have pissed off an orc chief. ", "action_results": [{"action": "Step In", "result": "You walk forward, prepared for anything.  The orc chief snorts as he stops wailing on the orc young for a moment. \n\n\n\"Who the hell are you?\" he asks.\n\n\n\"Nolazir of the River Tribe,\" you say.  \"I'm here to see the chief.\"\n\n\n\"I am Chief Gro'tesk,\" he snorts again.  \"Nolazir, huh?  I've heard of you.  Getting soft for an orc, are ya?\"\n\n\nYour eyes narrow, some think you've gone soft, and others think it's just your age. \n\n\n\"I'm not sure what you're talking about.\"\n\n\n\"Pshhah, you let those under you argue and disagree with you all day long. The right way is to beat them into submission.\"\n\n\n\"Why don't you just leave him alone, he is already defeated.\"\n\n\nThe chief laughs and throws the young one to the ground, he cannot be any older than fifteen.  Gro'tesk lands a couple swift kicks to his ribs.\n\n\n\"You done beating him yet?\" you ask.\n\n\nGro'tesk's eyes narrow, he straightens up and stares at you.\n\n\n\"No,\" he says, \"and I don't think you'll do anything about it either\"\n\n\n\"Oh yeah, and why is that?\"\n\n\n\"Because you need me, and my allies,\" he says.  \"You want us to help you fight the humans?\"\n\n\n\"Yes.\"\n\n\n\"Well, I'm not gonna help you!\" he snarls.  \"You're nothing but a weakling!\"\n\n\nTaking a deep breath, and, tilting your chin down slightly, you frown.\n\n\n\"So are we going to do this the hard way?\"\n\n\nThe chief grins and cracks his knuckles.  You slowly roll your neck and stretch your arms back. \n\n\n\"I have two conditions,\" you say.  \"If I win, you join me, along with your allies, and you stop beating the kid.\"\n\n\n\"If I win… you screw off!\" Gro'tesk screams.\n\n\nBy now, a large group of orcs has gathered around.  All of them cheering on Gro'tesk as he removes his tribal necklaces.  They make a circle around you as you prepare to fight…", "action_results": [{"action": "Fight!", "result": "Fists raised, you step to the side, constantly circling your foe.  Gro'tesk does likewise, a sadistic grin spread across his face. \n\n\nWith a huff you step forward, your fist twisting as the arm propels it forward.  Gro'tesk's cheek ripples and his head turns as he moves with the punch.  At the same time his fist flies, you manage to knock it away.\n\n\nDucking under, you slam your left fist into his ribs and come back up slamming into his jaw.\n\n\nGro'tesk staggers back, bewildered at your speed.  Although you are quite a large orc, he is bigger than you.\n\n\nHe throws a backhand, which hits your defending arm.  As he brings it back, he sends his other fist forward, which you manage to parry.  But, in your rush, you accidentally lower your right arm a bit too far…\n\n\nAs it connects a quick flash of dark splits through your vision, but only for a brief moment.  As you stagger back, a pain shoots through your jaw.  Managing to duck another blow, you push your opponent back, a move he was not expecting.\n\n\nAs you try to regain your ground, you feel a fuzziness spreading throughout your head.  Getting punched sucks. \n\n\nAs you step forward, you consider your next move…", "action_results": [{"action": "Feign a Kick", "result": "Lifting your knee, you hop forward and act as though you are about to kick Gro'tesk's shin.  He brings one hand down to push your leg away, and in this moment you slam your foot into the ground, lurching forward. \n\n\nIn the same movement, you reel your fist back and then bolt forward.  Your knuckles hit him straight in the forehead, this is followed by another swift hit right under his eye.\n\n\nGro'tesk grunts and staggers back.  With a mighty roar he charges you, slamming one punch into your chest. \n\n\n\"Oof!\"\n\n\nThe blow knocks the wind out of you, throwing you to the ground.  Chief Gro'tesk savagely lands a quick kick to your face.  Reeling to the side you land face first in the dirt, the heavy pounding of his feet stopping as he lifts his foot again.", "action_results": [{"action": "Cheap Shot", "result": "Grunting and rolling, you dodge his right foot, stopping under and between both of his legs.  Pushing up on your forearm, your other hand curls into a fist, hitting him right in the sweet spot with a thud.  He hunches a bit as his face contorts into pain. \n\n\nHe screams as his knees buckle, but before he can fall forward you slam your foot into his stomach, toppling him another way.\n\n\nYou pant as you pull yourself up, looking at the large group of orcs standing around you.  Some look disapprovingly at your method of winning, others stand in awe, and some appear indifferent.  The chief grunts as he rolls around in pain.\n\n\n\"No fair!\" he says, \"that was cheating!\"             \n\n\n\"There is no such thing as cheating when you're about to get your face stomped in.\"\n\n\nThe chief manages to pull himself up.\n\n\n\"Fine!\" he says,\" you win.\"\n\n\nThe chief pouts as he hobbles over to his hut, and you follow to give him your terms.", "action_results": [{"action": "Terms and Conditions", "result": "Gro'tesk sits on his large fur and leather chair, looking glum.  It's apparent he is used to getting his way, but so are you. \n\n\nYou grin as you finish explaining your terms.\n\n\n\"You would still largely be in command of your tribe and your allies,\" you say, \"only I will have final say and make the larger battlefield and strategic decisions.\"\n\n\n\"Hmm, I don't like to be bossed around.\"\n\n\n\"You wouldn't be so much,\" you say.  \"Think of yourself still as a chief and advisor, only I'm just supervising the rest of you.\"\n\n\nGro'tesk seems to mull this over and leans back. \n\n\n\"Well as long as I get some say in things…\"\n\n\nWith that, you have Gro'tesk agree to go meet your army, along with the lesser tribes that follow him. \n\n\nYou go and mount your horse, intent on gathering some more tribes…", "action_results": [{"action": "Two Months Later....", "result": "You've traveled far the past three months total, gaining the support from large and small tribes alike.  It has been tough convincing some, but others are far more agreeable.  From the reports you've heard, it's put much less pressure on your army, for now.\n\n\nOn the downside, Galik and Grolik have managed to engage the Mannate Empire in some larger skirmishes than you would have liked.  Rolomag and the other more reliable orcs haven't been able to keep them in check as well as you had hoped. \n\n\nAs you ride on, one of the coastal villages comes into view.  The sun bearing down upon you, in the distance you see a number of orcs.  Some seem to be fishing with nets and spears, and some seem to be enjoying the sun.  A few unsurprisingly wrestle in circles made of seashells. \n\n\nSeveral wooden boats float lazily among the waves.  One orc saunters over to you, his skin a much darker shade of green due to generations of living out here.  Yours is a much lighter shade of green.  The orc stops several feet away from you.\n\n\n\"Who are you?\"\n\n\n\"Nolazir.\"\n\n\nHis eyebrows arch and his eyes widen a bit.  A small grin spreads across his face. \n\n\n\"I have heard of you, fighting off the humans.  Making your rounds to many of the villages and tribes.  That is why you are here?\"\n\n\n\"Yes.\"\n\n\nThe orc chuckles as he leads you toward the village.\n\n\n\"I don't think we'll be able to help you, friend,\" he says.\n\n\n\"All of us are at stake,\" you say.  \"We need all the people we can get.\"\n\n\n\"We're having our own issues.  We can't save everyone else when we can't even save ourselves.\"\n\n\nYou grunt, scanning the area.  Nothing seems to be happening.\n\n\n\"What's your name?\" you ask.\n\n\n\"Silak,\" he says, \"I just do the fishing around here.  The chief is inside.\"\n\n\nHe gestures into a small wooden hut.  You nod to him in thanks and step inside, the old wood steps creaking a bit.\n\n\nHalf of the hut is dark, the rest illuminated by the sunlight entering between the wooden beams above.  Some tarp seems to be covering the rest of it.\n\n\nYou stop short as a figure steps out of the shadows, an orc with several wrinkles on his face.  His raven dark hair contrasted by a multitude of grey hairs throughout.  His face turns up into a weary smile.  His dark green skin hiding him well, until he steps into the rays of light.\n\n\n\"Welcome, friend,\" he says.  \"I am Chief Hidius.\"\n\n\n\"I am Nolazir.\"\n\n\nIt is just then that you notice the severe burn marks covering Hidius' body.  His face, from what you can see, is even a bit distorted. \n\n\n\"I know why you are here.\"\n\n\n\"Will you join me?\" you ask.\n\n\n\"No.\"\n\n\n\"But-\"\n\n\n\"Walk with me.\"\n\n\nThe chief puts his hand on your shoulder, slowly leading you outside.  As you step into the sunlight, you realize Hidius injuries are more severe than you thought.  It appears as though his nose has been smelted off of his face.  You're surprised that his hair is still growing though, which should not be possible.\n\n\n\"How... is your hair still growing?\"\n\n\n\"A rude question to ask of my deformities.\"\n\n\n\"I'm sorr-\"\n\n\n\"No.  It's alright, no one has asked in a long time, some around here know the story.  Others think it's crazed nonsense.\"\n\n\nHidius waves a hand to change the subject.  He stops and gestures to the village and the waters ahead.\n\n\n\"Gigalak gave us these lands and these waters so that we could live wild and free.  The Mannate Empire wants to take that from us.\"\n\n\n\"So help us stop them.\"\n\n\n\"We can't… I can't,\" Hidius says.  \"I am dying and so is my village.\"\n\n\n\"What do you mean?\"\n\n\n\"We've been cursed, you see, as made apparent by my condition.\"\n\n\n\"That's nonsense,\" you say.  \"Taking heavy burn wounds isn't going to damn the rest of the village.  Besides, they look fine to me.\"\n\n\nHidius chuckles.\n\n\n\"It won't be today, or tomorrow, or even a decade from now, but we're all doomed.  I've seen it.\"\n\n\nHidius closes his eyes and takes a deep breath.\n\n\n\"Whether or not we stop the Mannate Empire… something far worse is waiting to take us into a grip of fire.\"\n\n\n\"Stop this,\" you say, \"and tell me what you mean.\"\n\n\n\"Nothing we really do this day matters anymore, I have seen it.\"\n\n\nYou take a deep breath and try to stop yourself from shaking the older orc in frustration.\n\n\n\"No matter what is going to happen, you can't just lay down and die.\"\n\n\nYou gently put a hand on his shoulder and turn him around to face you.\n\n\n\"We're orcs damn it, and we fight everything that gets in our way.  Living, dead, hell, Empire, whatever it may be.  We don't just lay down and die.\"\n\n\nThe chief smiles slowly.\n\n\n\"While that may be true of you and yours, I am old and tired of fighting.  I've seen enough horrors to last one thousand lifetimes.  Our time is useless.\"", "action_results": [{"action": "\"Use that time for a greater purpose\"", "result": "\"If you think you're gonna die anyways, why don't you use whatever time you have left for something good?\" you ask.\n\n\nThe chief shuts his eyes and seems to be contemplating your words. \n\n\n\"Whatever you think is coming to harm us all, we can deal with it when it comes.  In the meantime, we can't just sit around and let the Empire step on us.\"\n\n\nHidius does nothing.\n\n\n\"I need everyone that I can get,\" you say, \"there are so many orcs doing their part.  Now you need to do yours.  Please….I'm asking for your help.\"\n\n\nAt this, Hidius opens his eyes and gives you a side wards look.\n\n\n\"Although your words will be ultimately futile…..I will help you.\"\n\n\nLetting out a sigh of relief, you step to the side.\n\n\n\"One more thing,\" you say, \"stop spreading this doom prophecy to your people.  They're really taking it to heart.  I'm not saying it's not true or whatever, but at least lift their spirits a little.\"\n\n\nHidius nods, and begins to walk back to his hut.\n\n\n\"I will gather a group of warriors, and we will meet your army.\"\n\n\n\"Good,\" you say, \"make haste, for things are stirring quickly.\"\n\n\nHidius nods, and goes to a group of orcs.  You can’t hear what he says, but they all seem to go off to find more orcs.\n\n\nWith satisfaction, you mount your horse to make your way out of the village.  As you head to where you are sure where the next will be, you think that maybe you'll find a place to escape the heat first.", "action_results": [{"action": "Three Months Later...", "result": "It has been six months since you left to unite the tribes.  It has not been easy, but it has been largely successful.  There were a few that gave you trouble, refusing to join in the fight.  Even then, some of their members disobeyed and walked right out with you.  The rest will come around eventually.\n\n\nLately, the Council has sent several couriers with messages urging you to hold off in the fight against the Empire.  You always send them back with a \"no.\"\n\n\nIt appears that the humans have really been pushing within the last month, and Galik seems to have taken charge over things since you have left.  Maybe he has finally matured and is ready to take over for you. \n\n\nYou wouldn't mind not having to worry about all of this; except for the fighting really.  It would be just like the war with the Wister Elves, someone points and you attack, broken up with random bursts of initiative and leadership.\n\n\nAt the same time, your axe itches to go into the fray.  That spark Gigalak ignited into all orcs has not gone out yet.  You begin to wonder where this course of action will take you when it begins to rain.\n\n\n\"It's raining again.\"\n\n\nAs you make your way back to your camp, you see that it has grown tremendously.  Many orcs shout and greet you as you enter.  While you have been pretty well liked by most of them, you didn't expect such an enthusiastic welcome.\n\n\n\"The chieftain has returned!\"\n\n\n\"Hail Nolazir!\"\n\n\n\"Our leader returns to us!\"\n\n\nYou smirk a bit, it will be a letdown for some if they find out you're thinking of resigning over to Galik.\n\n\nAs you enter the main area of the camp where many of the orcish leaders live, you notice something is different.  Several posts have been erected, with orcs tied to them, while their comrades grimly whip them.\n\n\nAs you turn, looking between your old tent and some of the others, there upon the ground are three slain orcs.  Above them stands Galik, a fiery rage in his eyes.  Near them, stands Grolik, severely beaten and held back by three orcs.\n\n\n\"Galik!\" you cry.\n\n\nGalik breathes heavily and looks up from the corpses to meet your eye.\n\n\n\"Nolazir,\" he says prowling forward, \"stand down!\"\n\n\n\"What is going on?\"\n\n\n\"These fools disobeyed me.  They were here to sabotage our efforts.\"\n\n\n\"What in Grikalia are you talking about?\"\n\n\n\"These traitors spent weeks scheming and planning,\" Galik said, \"but it was not that alone that caused this? Do you want to know what it was?\"\n\n\nYou glare at him, lowering your chin a bit.  Your hands curl at your side as you prepare for anything.\n\n\n\"There are some in the Council who think we should give the humans quarter,\" Galik says, \"parley with them, make an agreement.  These fools pushed this idea, even saying we should compromise with them.\"\n\n\nGalik furiously spits on one of the corpses.\n\n\n\"This one thought that we should concede some land to be annexed with the Empire.  Fools.\"\n\n\nWhile you can see the logic in his anger, something seems off. \n\n\n\"And the rest?\" you ask.\n\n\n\"Not so keen on the idea of conceding land yet,\" Galik says, \"but it was only a matter of time before the traitor would get them to turn over.  I know this.\"\n\n\n\"That's only one of three,\" you say, \"and you think you can justify their executions with assumptions?\"\n\n\n\"Nolazir, they were traitors.  I could see it!  It would not have been too long!\"\n\n\n\"And what say you for Grolik?\" you ask.  \"What has he done?\"\n\n\nGrolik slowly looks up at the two of you, a dark look in his eyes.\n\n\n\"When I was… purging these traitors, he tried to intervene,\" Galik says, \"using much the same words as you have.  Actually, he is lucky I haven't gutted him yet, seeing as he has been a pain these last couple of months.\"\n\n\nGalik twirls his sword a bit before pointing it at the whipping post.\n\n\n\"I thought a nice whipping would get him to change his mind,\" he says, \"but he sure is stubborn.  I have only spared his life because he spoke against these traitors, but then he ridiculed me for sending them to Grikalia early.\"\n\n\n\"So what do you intend to do?\" you ask.\n\n\n\"I'm going to kill him,\" Galik says with a smirk.\n\n\n\"Or more like…\" he grins, \"you're going to kill him.  Prove your loyalty to your new chief, Nolazir\"\n\n\nGalik takes a few steps back, gesturing you to step forward.  As you do, the other three orcs raise Grolik. \n\n\nAs you stand in front of him, one of the orcs hands you a shortsword.  As you grip the simple weapon, the texture of the leather grip feels odd to you right now.\n\n\nGrolik looks at you, shaking his head a bit.\n\n\n\"Don't do it Nolazir,\" he says.  \"I think we know who the real traitor is.\"\n\n\nYou look at the blade, surely Galik has seen madness, but could you really kill the child of your dear friend Greusim?  The young orc who had often sat on your lap when you went to visit your now dead friend… all those years ago.\n\n\nWho is Grolik?  You've known him for a few years, but he is just a lawless orc.  Still, he has shown great promise, and hasn't let you down yet.  Other than your first altercation, he has been a true friend. \n\n\nGrolik looks into your eyes, there is no fear.  There is a quiet rage, and even a hint of sadness in his eyes.", "action_results": [{"action": "Free Grolik", "result": "With a heavy sigh… you lift the sword up, gripping it with both hands.  Grolik doesn't even blink as you bring it down.  But you step slightly to the side, slicing clean through the arm of the orc to your left who handed you the sword.  He screams in pain as he falls over, and you run the second through the chest.\n\n\nAs you pull it out, you turn around just in time to deflect an attack from Galik.  As you circle him and parry his blows, Grolik tackles the third orc, turning his own dagger towards him.\n\n\n\"You've made the wrong choice, old friend,\" Galik says.  \"I'm sorry.\"\n\n\nYou don't respond but, instead, block his swift attack.  Galik fights with ferocity, but you match this with skill.\n\n\nAs you hook your blade onto his hilt, you turn and twist, Galik flies forward.  He drops his sword for a moment but rolls and picks it back up.  Behind him, Grolik and the other orc still struggle, the dagger on the ground and both of them in a deadly grapple.\n\n\nGalik twirls his sword as you circle each other.\n\n\n\"Drop the sword, Galik,\" you say.  \"It doesn't have to be like this.\"\n\n\n\"Oh but it does.  Remember, you chose this!\"\n\n\nThe last couple of words are emphasized by Galik swinging his sword down at you.  You easily dodge this and take a wide swipe, nicking his arm.  Galik hisses and swings at your head, which you duck as you plunge the tip of the sword into his calf.\n\n\nGalik cries out in pain and staggers back.  You raise the sword before pausing, instead, taking a step back.\n\n\n\"You truly have gotten soft, Nolazir,\" he says.  \"What happened to the ruthless orc I used to hear stories about?\"\n\n\n\"Do you really think I want to kill you?\" you say.  \"You're the child of my dear friend Greusim.  He was like a father to me, why would I want to kill any of his children?\"\n\n\n\"You're just a weakling and a pathetic leader, Nolazir,\" Galik says.  \"My father would be disappointed in you.\"\n\n\nWith these words still in the air, Galik charges you, first swinging high but then veering low.  With a cry you barely manage to escape, the tip of the blade slicing into your thigh.  Gritting your teeth you slash his chest.\n\n\nNot once, but twice and then three times; you swing the sword in a perfect arc of fury.  Galik's face twists as he staggers back, clutching his chest.  He raises his sword and stumbles forward, you easily deflect the strike and slam your foot into his knee.\n\n\nGalik cries out and falls back, rolling to get away from what he thought would be a killing blow.  As he looks up, you see the seething hatred in his eyes.  His sword lays behind you, which he had dropped when you knocked him over.\n\n\n\"Well, what are you waiting for, Nolazir?\"\n\n\nYou take a step forward, raising the sword.  As you do so, you remember the first day that Greusim showed Galik to you; when he was but an infant wrapped inside a blanket.  You remember the days of taking him out as a young lad, teaching him how to fish and about the plants and animals.  You remember the closeness you used to share, before Greusim fell, and this wrath took him over.", "action_results": [{"action": "Kill Galik", "result": "As these memories flood through your mind, you realize that it doesn't matter what he was.  It just matters what he has become; and that's a murderer.  He would drag the orcish armies into the grave with him, dooming Orcin to an eternity of rule by the Mannate Empire.\n\n\nGalik laughs insanely as you step forward, and you drive the sword down…\n\n\nIn the last moment, Galik rolls to the side and the sword slams into the dirt.  You pull, but the blade does not budge.\n\n\nStanding, you cannot do anything before your foe slams into you.  His fingers dig into your shoulder as he draws a dagger from under his shirt.  He grins and chuckles as he lifts the blade up, intent on slamming it into your chest.  The dagger gleaming in the sunlight, showing you your final moments…\n\n\nGalik brings the knife down, your hand shooting up just in time.  Grunting you twist and wrench the blade from his hand.  Grabbing his shoulder you shove the knife forward into his belly, as it slides through surprisingly easy.  Galik gasps, and his hands grip your shoulders.\n\n\nYou rip the dagger out and slam it back into him, this time some splatter decorating your forearms.  On the third strike, Galik's knees buckle and he falls back, guided by your hand.  As you kneel over him, Galik's hands grip your arms and shoulder.  ", "action_results": [{"action": "Stab him again", "result": "He tries to speak but he is too winded.  Snarling, and with a gleam of victory in your eyes, you plunge the knife into him a fourth time.  Galik's eyes widen for a moment before his head falls back onto the dirt.  He expels a short breath before laying still.\n\n\nPanting heavily, you kneel over your once good friend.  You stare down at his face, empty eyes staring into the sky above.  Your brow furrows as you place your hands under him, lifting him up a bit. \n\n\n\"Why did you make me have to do this, Galik?\" you ask.  \"Greusim was my friend.  I've known you since before you were born.  You fool.\"\n\n\nWith this, you drop him, and you look up to see Grolik.  He stands there holding a bloody dagger at his side.  He gives you an understanding nod.\n\n\nYou stand up and start to walk away.  He raises an eyebrow.\n\n\n\"Let someone else deal with his corpse,\" you say.  \"I want nothing to do with him anymore.  It's done.\"\n\n\nYou drop the dagger and walk to the tent, and, sitting on the chair, you grab some whiskey…", "action_results": [{"action": "Six Months Later", "result": "The last six months since Galik's death have been eventful.  It took a while for you to reorganize the camp, fixing all of Galik's mistakes.  While it was stressful at first, you managed to delegate some responsibility to Grolik, Gro'tesk, Hidius, and Rolomag.\n\n\nEverything is now organized, but it seems that the Empire is done playing around.  In the last two months alone, you have repelled several small-scale assaults.  You are sure they are finally going to act and make some big moves.\n\n\nBut so are you.  Soon, these years of stalemates and quiet maneuvering will be at an end.  Soon, it will be time to test the Mannate Empire's true mettle.\n\n\nThe past five years have been filled with hardships and struggles, but you have managed to overcome all of them.  For the first time, you are looking at this conflict pretty positively.  Young orcs trickle in everyday willing to contribute to the cause.  What worries you though is their age.  While there are plenty of experienced veterans in your army, the number of young, inexperienced, and foolhardy orcs concerns you.\n\n\nTraditionally, orcs have always set out as adults at the age of fifteen.  What this usually means for them is going out and finding adventure and fighting things.  Because of your warlike nature, many orcs do not actually live too long.  Some would even consider an orc such as yourself, at the ripe age of thirty-five to have been a long enough and accomplished life.\n\n\nGigalak did not intend your kind to grow old and miserable, but, instead, to put life into your years, no matter how short or long they may be.\n\n\nYou sense someone pulling up to the side of you.\n\n\n\"Still thinking about Galik?\" Grolik asks.\n\n\n\"Among other things,\" you sigh.\n\n\n\"I know you were close to him, but he just went too far.\"\n\n\n\"I know, it’s just hard seeing someone you care about turn into something else.\"\n\n\nGrolik exhales slowly, nodding as he does so.\n\n\n\"Sometimes, you'll do everything you can to save someone,\" he says, \"but sometimes you have to do what you have to do.\"\n\n\n\"What would you know about this?\" you snort.\n\n\nGrolik gulps and looks into the distance before turning his head to you.\n\n\n\"I….I butchered my entire family and tribe.\"\n\n\n\"What?\" you ask.\n\n\n\"It's… a long story.\"\n\n\nBefore you can say anything further, Grolik spurs his horse forward to attend to something else.\n\n\nA whole throng of orcs march ahead and behind you, as you all make your way down the mountains and to the hills where the rest of your army waits.  Along the way, you have groups of fighters intersperse throughout the hills and rocks just before the plains.  It seems the Empire plans to take you on in open combat.\n\n\nThe scouts alerted you of the huge shift in troops heading this way.  Once your reserves and last line are firmly placed, you call to all of your commanders. \n\n\nKneeling by a rock, you spread a map across it.  Taking a piece of charcoal to mark it up.\n\n\nRolomag peers closely at it, rubbing his chin.  Grolik looks out to the hills and then to the plains and forest ahead.  Gro'tesk sharpens his weapons and checks the string on his bow.  Hidius closes his eyes and takes in the crisp air.\n\n\nYou start by marking all of the locations the Imperials should be attacking from.  Mostly, directly ahead of you.\n\n\nGro'tesk points to the area in the Southeast.\n\n\n\"I think they'll try sending a few brigades through here,\" he says.  \"While there's no chance they would be able to make it through the mountains in time, it wouldn't take much longer for them to divert through these woods.\"\n\n\nYou have some light patrols stationed in the mountains, so they would alert your left flank if they saw Imperials moving through there.\n\n\n\"Hmm, we can probably divert more troops to watching that area then,\" you say.\n\n\n\"Or, we could go through that way ourselves and try to catch them off guard,\" Gro'tesk says, \"whether or not they're coming through that way.\"\n\n\n\"No way,\" Rolomag says. \"We need all the warriors here that we can get.  Their only real option is to try to push through the plains, and we should try to match them.\"\n\n\n\"No, wrong way!\" Gro'tesk yells.\n\n\nGrolik speaks without looking to the group.\n\n\n\"I think Gro'tesk is actually right about this one,\" he says, \"we need to keep an eye over that way.  Or maybe even exploit it.\"\n\n\n\"Yes, if they get cavalry through those woods,\" Gro'tesk says, \"even with our reserves and archers, we won't be able to stop them from wiping through our flank.\"\n\n\nYou analyze the area, the humans could utilize it, in which case it would be helpful to prepare to counteract them.  They also just might use brute force, in which case you would need to have all of your fighters here at the ready. \n\n\n\"There is another thing,\" Hidius says.  \"While we can't expect them to come through and around the mountains, see this stretch of open space between the mountains and the trees?\"\n\n\nRolomag squints at the map.\n\n\n\"Yes, but what does that-\"\n\n\n\"If they move some soldiers through here,\" Hidius says, \"they could easily hit this side with a concentrated force.  I suspect they would use cavalry to cover the gap as well.\"\n\n\n\"Let me position more warriors there,\" he continues.  \"I will keep the mountain patrol there.  But if we see any soldiers or cavalry, we can easily ride in and trap them in between the main force and this one.\"", "action_results": [{"action": "Attack Straight On", "result": "\"I like Rolomag's idea,\" you say.  \"The chances of them utilizing either side is nonsense.\"\n\n\n\"What? Fool!\" Gro'tesk yells.\n\n\nGrolik's eyes snap to you in surprise.\n\n\n\"Nolazir,\" he says, \"are you serious?  This is stupid.  You were the one always going on about how pure strength alone won't win this.\"\n\n\n\"I can't say I agree at all,\" Hidius says, \"but if I can't change your mind, I will obey.\"\n\n\nRolomag just sits back in silence. \n\n\nYou nod to all of them and roll up the map.\n\n\n\"I know this won't be easy,\" you say, \"but I know we can do this.  We'll still have the reserves to help us, but as I see it… we're gonna be able to just push through them.\"\n\n\nGrolik shakes his head.\n\n\n\"I don't know about this, Nolazir,\" he says.  \"Why don't we think about this again?\"\n\n\n\"No,\" you say.  \"I have decided.\"\n\n\nGrolik sighs and goes off to get his orcs ready.  The rest do the same.", "action_results": [{"action": "Preparations", "result": "Days later, your troops stand at attention, their mail armor and weapons gleaming in the sunlight.  The red tendrils of the rising sun cast themselves over the sky, piercing the clouds like slender fingers eager to reach into what lay beyond.  The wind's breath carries the fresh morning air through the field, passing through each warrior; the wind carrying the breath they might otherwise hold in anticipation of what lays ahead.\n\n\nThe orcs stand before you, ready to move forth at the sight of the Mannate Empire.  The reserves wait in the rocky hills behind you.  While not appearing so, many orcs are nervous, as any would be before a large battle; but, with hope in their minds and courage in their hearts, they stand by you.\n\n\nYour horse shuffles, it's ears pricking up.  The song of the Empire trickles from the forest, quietly at first.  But, as the first humans emerge, their hauberks showing crests of their nobles, the standard bearers proudly emerge, their counterparts blaring trumpets and horns.  How kind of them to announce themselves, yet so arrogant.\n\n\nThe columns of Mannate warriors spill forth.  They move simultaneously.  They do not waver or break form.  Their perfect union a direct affront to the free and natural order that was intended for all.\n\n\nThe human soldiers stand at attention, all saluting as their officers move up and down the line.  Some appear to inspect their warriors, some seem to be doing a lot of shouting.  Others stand calmly in front of their columns. \n\n\nOne knight, which you recognize as such by the helm he wears, rides out in front of the column.  He waves a white flag ahead above him.\n\n\n\"I think they wish to speak,\" Hidius says.\n\n\nYou scowl at the human riding forth, as if you could not have him crushed.  His hands held up and flag waving as a sign of peace.\n\n\nSpurring the horse beneath you to meet this human, you keep your hand by your sword. \n\n\nStopping several feet away from the Imperial, you both meet in the field between your armies. \n\n\n\"Hail Orc,\" the knight says.\n\n\nYou grunt in response.\n\n\n\"General Levalier has sent me to parley. Will you speak?\"\n\n\n\"I will.\"\n\n\n\"Who may I ask do you speak for?\"\n\n\n\"Myself.\"\n\n\n\"So you are this rabble's leader?\"\n\n\nPeering through the slits in the knight's helmet, his eyes light up in understanding.  His other hand, which lays free of the flag, twitches slightly by his sword.  Your hand already rests near yours.\n\n\nYou peer into the eyes of the knight, your eyes narrowing as you do so.  The soldier looks back, and both of you sit there in silence.\n\n\nHis hand slowly moves away from his sword as he shifts to hold the flag with both hands.\n\n\n\"I have been sent to ask you to disperse your forces.\"\n\n\n\"No.\"\n\n\n\"Brute, won't you listen to reas-\"\n\n\n\"No.\"\n\n\n\"I say, while I would not expect a beast of your nature to understand politics.  At least hear the message my general has for yourself.\"\n\n\n\"The only thing you need to do is go home,\" you say.  \"You could save many of your soldiers' lives today.\"\n\n\nThe knight huffs in exasperation and turns his horse around.  He gallops back, moving around the side of the columns.\n\n\nGrunting, you trot back to your spot among your comrades.  You don't trust that they will just up and leave after these years of skirmishes and preparation.  It seems that battle was fated to happen this day, it will progress no matter what words are spoken. ", "action_results": [{"action": "Attack!", "result": "The trumpets across the field begin to sound, and the officers riding upon their horses shout and wave their swords around.  With all of your troops in position, you take your horn.  Exhaling, you blow into it, and the other chiefs under you do so as well.  The air is filled with the sound of war as you and your warriors pour forward.  The Mannate humans approach, weapons held tightly and the crest of their Emperor waving in the wind.\n\n\nYour orcs go to meet them, the might of Gigalak carries you forward to crush your enemies.", "action_results": [{"action": "Brute Force", "result": "With all of your forces centered, the orcish lines meet the human's with unparalleled force.  You watch from your horse as weapons and shields collide.  Mail armor protecting both sides from grievous wounds.  It is not too long before your orcs push through the humans first line, bashing and knocking down warriors as the rest overtake them.\n\n\nThe humans give a steady retreat, before spearmen move through the columns to give some support.  Two large columns come down and around from each side, taking a diagonal assault to your front.  On your orders, your fighters divert to stand against it.  As you wave your arm, two bands of cavalry swoop around your lines.  One lead by Grolik and his Red Handed, the other by Gro'tesk and various civilized orc tribes.\n\n\nArchers in each of your lines work to weaken your foes.  Hidius and Rolomag each lead one of the defending lines to your sides, and you command the center force.  With Gigalak's fist you break into the center.  As your lines push the Imperials back, some Imperial knights by Grolik shake up his assault.\n\n\nFrom where you are, you can't reach them.  But orcs from one of the columns rush forth, taking on the knights.  Many orcs to the right fall, but your overall army holds strong, and steadily you push the Imperials back.  The horses stepping over the crumpled remains of orc and human alike.\n\n\nGrolik blows his horn, rallying his troops.  Nursing a wound in his shoulder, he rides forward, inspiring his fighters to go forth.  Many fight on, even with life threatening injuries.  You gaze to the wave of orcs. \n\n\nGrolik circles around them, yelling out orders.  In a moment, his eyes meet yours, before his face scrunches and his brows furrow.  Looking down to his chest, a bloody arrow protrudes from his heart.  Your friend goes limp and slumps off his horse, rolling as he hits the ground.  Many of his orcs stare in confusion, before a volley of arrows shows them the same fate.\n\n\nFrom the forest in the Southeast, a column of Imperial soldiers rushes out, covered by archers.  They do untold damage to your right flank.  They sweep in before your forces can organize a defense.  Roaring, you charge forward.\n\n\nRolomag starts to divert troops.\n\n\n\"No,\" you cry, \"stay focused.  I've got this.\"\n\n\nAs you ride by, you see Grolik's eyes glazed, and staring into the sky.  The arrow having gone straight through his heart, and spilling his spirit into the void.  Orcs continue to fall, as the diversion weakens your center line.  The humans in the center gain no ground, but don't lose any either.\n\n\nSomething else in the distance disturbs you.  Circling around, a large cavalry rides through the open plain.  Between the mountains and the forest they go, sweeping into your left flank.  Hidius is just able to mount his horse, fighting off a knight.  You howl in agony as another one rides up behind Hidius, planting his sword through his back.\n\n\nHidius falls quietly, and almost immediately.  Somewhere in the fray, you see Silak defending his chief's corpse before himself being killed.  As you rally troops to defend this side, Gro'tesk glances to you, his eyes flashing in anger.\n\n\nThe lines and columns are all in a frenzy, being attacked viciously from multiple sides.  There is no semblance of lines and divisions.  All the orcs fight as one, the Imperials slowly pushing through with reinvigorated fury. \n\n\nSlamming the butt of your axe into a hapless soldiers helmet, you let out a roar.  His helmet pinging and denting under your blow, his eyes bloodshot from the trauma.  The soldier twitches before laying still.\n\n\nThe horse you are on cries out in agony, a couple of arrows piercing its chest.  Managing to leap off, you roll to the ground and stand bearing both weapons.  Just in time to meet the blades of bloodthirsty soldiers. \n\n\nHacking, slashing, and bashing you stand by your brethren.  As you remove the head of one soldier, another's spear finds its way through your armor.  Your mouth gapes in pain but you stay silent, grimacing and facing the soldier, you knock his spear away.\n\n\nWith a grunt you shove the sword blade under his helmet and into his face.  Specks of crimson blood cover your arms as the soldier writhes, twitches, and dies.  On the right flank, the Imperials push Rolomag's line ever closer to this one.  The center also being pushed back.\n\n\nRolomag, with several injuries, gives you a weary nod.  You are about to return it when Rolomag huffs and falls, an axe buried in his back.  Ahead of you, a beast of a man wrenches the axe from your fallen friend's back.\n\n\nYou charge each other, weapons sparking and colliding.  Grinning, you slam the spike atop your axe into the man's ribs.  He ignores the pain and hacks into your side, breaking through the armor and embedding his axe into your ribs.\n\n\nTwisting, you make him lose his grip.  Your sword buries into the human's neck as his eyes widen in surprise.  Before you can twist the sword out, a burning sensation shoots through your side.\n\n\nThe axe blade twists through your side snapping ribs and almost blinding you with pain.  Before you can move, the axe blade slams into your helmet.  As this happens a hand pushes you down, before you can twist around the handle slams into your helmet as well.\n\n\nIt's not long before various weapons slam into your armor or pierce through it and into your flesh.  Your body aches all over, before feeling numb as you are overwhelmed. ", "action_results": []}]}]}]}, {"action": "Allow Gro'tesk to Flank", "result": "\"Gro'tesk,\" you say, \"I want you to put together a strike force, and go around.  Give the battle some time to start, but once you take them by surprise, hit them as hard as you can.\"\n\n\n\"Got it,\" Gro'tesk nods.\n\n\n\"What about the left side?\" Hidius asks.\n\n\n\"We don't need to worry about that,\" you say.  \"With Gro'tesk attacking their flank, they'll have no choice but to concentrate in those two areas.\"\n\n\n\"We're going to be exposed over there,\" Hidius says while sharpening his knife.\n\n\n\"Trust me,\" you say.  \"This plan will work.\"\n\n\n\"Gro'tesk, while we are setting up I want you to wait in the forest over there,\" you say.  \"Make sure they don't see you at all.\"\n\n\nWith the plan made, you all disperse to make preparations for the upcoming battle.", "action_results": [null]}, {"action": "Allow Hidius to lay a trap", "result": "\"Hidius,\" you say, \"I want you to take a unit and set them up by the bottom of the mountain.  If they try to send cavalry across, sweep them up and take them down.\"\n\n\nHidius nods.\n\n\n\"What about the forest to the Southeast?\" Gro'tesk says.  \"We need to watch it.\"\n\n\n\"No Gro'tesk,\" you say, \"there's no way they'll take that much time to divert forces that way.  I know how the Imperials fight, they'll just attack straight on and use cavalry.\"\n\n\nGro'tesk shakes his head in frustration. \n\n\n\"You never know!\" he yells throwing a rock at the ground.  \"It will take more time, but it would be worth it for them.  I have seen these things happen!\"\n\n\n\"If they do attack, we will easily be able to divert troops to stand in their way,\" you say.  \"We can't risk our bulk to divert troops left and right without knowing if we need to.\"\n\n\n\"I think Gro'tesk is right,\" Grolik says.  \"I'll personally take-\"\n\n\n\"No,\" you say.  \"You'll have other roles to play.  Focus on them.\"\n\n\nGro'tesk and Grolik glance at each other but then turn and nod at you.  You send the group to go about their duties and prepare for the oncoming battle ahead. ", "action_results": [null]}, {"action": "Listen to both Hidius and Gro'tesk", "result": "You nod and look to both Hidius and Gro'tesk.\n\n\n\"I think you are both right,\" you say.  \"We need the right amount of surprise and caution.  If the battles with the Empire so far has taught us anything, these humans are tenacious, and we need to prepare for anything.\"\n\n\nGro'tesk grunts in agreement, and Hidius slowly nods his head.\n\n\n\"So, Gro'tesk, I want you to take your warriors up and around the forest.  Divert and cut off any troops they are sending through, then begin your assault on their flank.\"\n\n\n\"I will crush them for you, chief.\"\n\n\n\"And Hidius, station your cavalry by the base of the mountain,\" you say.  \"If they come through the plain to attack our flank, sweep them in and crush them.  Rolomag and I will prepare that flank to fend off their horsemen while you charge them.\"\n\n\nYou gaze out through the plains and to where the mountain turns into rocky hills.\n\n\n\"You will need to go quickly lest they finish their foul deeds.\"\n\n\n\"I will go with Gigalak's breath at my heels,\" Hidius says.\n\n\n\"Good,\" you say.  \"With one hand may he guide us, and with the other sweep our enemies from our home.\"\n\n\nYou and your comrades disband to prepare for the battle that is yet to come.", "action_results": [null]}]}]}, {"action": "Stop", "result": "As Galik's weak hands clutch onto you, your fingers curl around the dagger tightly.  But you toss it to the side, instead lifting Galik up and cradling him.\n\n\n\"Why did you do this?\" you ask.  \"Greusim was my friend, I've known you since before you were born.  Why couldn't you just wait for me to come back, we could have handled this together.\"\n\n\nA weak grunt passed Galik's lips, and he pulls himself up a bit.\n\n\n\"I'm…sorry…\"\n\n\nThe last breath passes between his lips, and his body goes limp.  You sit there, letting out a heavy sigh.  With a grunt, you lift up Galik's body, throwing him over your shoulder.\n\n\nIn front of you stands Grolik, a bloody dagger in his hands.  He nods in understanding and steps to the side as you walk by.\n\n\nYou go down to bury your former friend by the river…", "action_results": [null]}]}, {"action": "Spare Galik", "result": "He may have lost his way, overtaken with wrath, but surely there must be another way to handle this.  You stop, and glancing around you see many orcs have gathered.  They seem to be expecting you to finish Galik off. \n\n\nDespite your brutal nature, you cannot bring yourself to do it.  There is another way to handle this… he is just lost-\n\n\nSomething slams into you, forcing the wind from your chest, and as you fall your arms twist and you roll.\n\n\nStopping, you see Galik stepping towards you… twirling the sword, a smirk on his face.\n\n\nYou crawl back, lifting your arms up defensively as Galik raises the sword.\n\n\nYou cringe a bit as his arm twitches… but not for the reason you would expect.  Another arm shoots under it and grabs his wrist, twisting it back and to his side.  You pull yourself up, hands out just in case. \n\n\nGalik snarls as he begins to struggle, but this is replaced by a gasp; his brow twitches and he drops the sword.  He staggers forward and reaches his arms out, and as he falls you catch him.  His face buries into your chest as he falls at an awkward angle.\n\n\nBewildered you look up to see Grolik, standing, a dagger slicked in blood in his hand.  His brow furrowed, he looks up from Galik and nods at you.\n\n\nUpon Galik's back you see a stretch of blood dripping down his back.  The dagger wound placed expertly in his spinal column.  Rolling Galik over and kneeling, you hold him off the ground somewhat.  His eyes are blank and his mouth slightly agape, he did not suffer for very long. \n\n\n\"Damn it Galik,\" you say.  \"It didn't have to be like this.\"\n\n\nA few orcs walk forward, nodding at you.\n\n\n\"Chief,\" one says, \"we will take care of him for you.\"\n\n\n\"No,\" you say.  \"I'll handle it, let's untie the other orcs first though.\"\n\n\nYou walk with Grolik over to the orcs tied to the posts, the whippers having long since left.  Grunting, you begin the work of cutting their bonds, several orcs coming over to help. \n\n\n\"Can't say we'll miss him too much,\" one says.  \"I know you were close to him, but he was a damn tyrant.\"\n\n\nYou sigh and continue your work.  After finishing up, you hoist your former friend over your shoulders and go to find somewhere to bury him…", "action_results": [null]}]}, {"action": "Kill Grolik", "result": "You level the sword, the placing the tip on Grolik's chest.  Sometimes sacrifices have to be made for the greater good, Galik may be wild but you should be able to keep him in check. \n\n\n\"Really Nolazir?\" Grolik says, \"is this really what you're doing?\"\n\n\nGrolik's stare pierces you, his glare hard enough to cut steel and his voice unwavering.\n\n\n\"If this is really what you're doing,\" Grolik says, \"Gigalak help me you better make sure I'm dead because if I make it out of this I'm coming for you bo-\"\n\n\nYou grab his shoulder as hard as you can, thrusting the sword into his chest and through his heart.  Grolik's face scrunches up in pain, but only for a moment.  His eyes roll into the back of his head and he falls to the side.\n\n\nHolding the sword, you stare at the bloody blade.  The weight of what you have done not quite hitting you, and this weapon of death seeming foreign for a moment.\n\n\nAs you lower the sword to your side, a hand slams into your shoulder.\n\n\n\"Hahaha!\" Galik says, \"good job Nolazir!  Guess he wasn't so tough after all, let's see him come back to get us from this one!\"\n\n\nForcing yourself to laugh, you walk off with Galik, who starts to talk about some strategies.", "action_results": [{"action": "Conflict", "result": "In the following days, chaos has erupted throughout the camp.  The Red Handed and their allies dispersed themselves throughout the camp, then without warning began to butcher as many of your orcs as they could.\n\n\nTrapped by a cliff behind you and the bulk of the late Grolik's forces ahead of you, the only viable cover is the rocks and wagons you hide behind.  They have a pretty good grip on the main camp area.  Once they finish fighting the rest of the camp, they will surely overwhelm you at any moment.\n\n\nArrow after arrow thuds into the wagon.  You fire an arrow back under one of the wheels, unsure of where the hell it landed.  In front of you the tents burn and the sounds of fighting ring throughout.  You didn't know there were so damn many of them until last night. \n\n\nThe minor nicks, scratches, and bruises you've received from fighting your way out pulsate through your body.  Galik sits next to you, nursing a grievous injury in his side.\n\n\nAs you, Galik, and the rest of the orcs fought your way through, some orc chucked a javelin into Galik's side.  It went through pretty deeply and you are surprised that he is still alive, although he won't be if you do not get him treatment soon.  Even then his chances are probably slim.\n\n\nYou witnessed Hidius walking out of his tent to see the commotion, and immediately was stabbed in the chest before you could help.  Silak fought valiantly to defend his dying chief, but was ultimately overwhelmed.\n\n\nGro'tesk might be dead by now, you didn't see what became of him.  You're not too sure about Rolomag either for that matter.  You had not seen him since late yesterday, and as far as you know he wanted to speak with Gro'tesk.  So they're either standing together or already dead.\n\n\nGasping and panting, Galik stands up and directs some of the orcs around you. \n\n\n\"You, crawl that way,\" he says, \"and you, keep shooting damn it!\"\n\n\nHe kneels and grips another orc by the shoulder.\n\n\n\"Finish this up, damn it!\"\n\n\nA team of orcs furiously work on a contraption similar to the siege breakers you constructed during the war with the Wister Elves.  Actually, you recognize a lot of the orcs around you from those days.\n\n\nGalik slumps against the wagon, gritting his teeth. \n\n\n\"Nolazir,\" he says, \"we're going to try to break through.  We'll have archers at the sides covering you, follow us, and when we get close enough break out and rush them.\"\n\n\nWhile the path you have to go is pretty narrow, you're sure this will only lead to your doom.  Well, so would sitting here eventually.", "action_results": [{"action": "Follow Galik's Lead", "result": "\"Yes Chief,\" you say, \"bring one of these shields.\"\n\n\nLuckily, one of the wagons happened to have a bunch of weapon and shield supplies in it.  Galik hands the shield back to you.\n\n\n\"Gigalak will shield me,\" he says, \"besides, I don't know how much longer this dressing will hold without my hand.\"\n\n\n\"I'll see this through to the end with you,\" you say.\n\n\nAs the orcs finish up the siege breaker, you all get into position.  A few orcs begin the slow push, as Galik stands in the middle of it barking orders and taking cover.  Raising your shield you get into the column, a couple of arrows already hitting and bouncing off your shield.\n\n\nYou all make a sort of wall with the shields, but many orcs are still struck down.  Some of yours fire arrows over the shields and the siege breaker, a few even managing to kill or wound some of your foes.\n\n\nAs you get closer, you see the Red Handed preparing to charge.  You brace yourself for their attack.", "action_results": [{"action": "Use your bow", "result": "You hand an orc your shield, as his is riddled with arrows.  Getting behind him, you notch an arrow to your bow.  Taking aim as the orcs ahead cry out and begin their charge.  Even as you aim, an arrow glances off your cheekbone, but it does not sway you.  You release your first arrow, the receiving orc stumbling and falling still.\n\n\nThe gleam of bloodlust in your eyes, you fire arrow after arrow.  Mostly killing and wounding offending orcs.  When your quiver runs out, you start ripping arrows out of the shield on the ground next to you, using the projectiles that haven't broken. \n\n\nThe Red Handed push into your line, many of your orcs rushing forward to take them on.  They actually hold them off pretty well for a good while.  But as they exhaust and succumb to their injuries, you see there is no way you will win this.\n\n\nYou push forward with the orc in front of you as they start to surround Galik, making a desperate attempt to get to him.  The orc in front of you drops you his quiver and heroically dashes into the fray, almost immediately he is beat down and killed by your enemies. \n\n\nYou move forward with the other archers, roaring as you make your way to your leader.  As the Red Handed flood around him, he has no choice but to climb atop the siege breaker.  Orc after orc is cut down trying to get to him.\n\n\nYou charge forward, deflecting a sword with your bow.  The orc's face crunches as you smash the bow into his face, the heavy wooden weapon turning his face into red mush.  You throw it at the next, which doesn't do much but give you an opportunity to axe him in the neck.\n\n\nBefore you can do anything, Galik takes a spear jab in the back.  Two orcs climb up and one grabs him, the other using his dagger to stab the shit out of him. \n\n\nYou hook the axe shoulder behind the knee of one of those lawless scum, arcing it back around and slamming it into his face.  As the orc sputters and cries out, you try to pull the axe out, but it won't budge.  The bastard even grips the top part of the handle, pushing it deeper into his face.\n\n\nYou struggle with him until you feel a heavy pain in your chest. \n\n\n\"Argh!\"\n\n\nAbove you, a Red Handed quickly retracts his spear.  You roar as you charge up, but the dying orc below grabs your leg, causing you to fall.  The orc with the spear begins to stab you in the back, as other orcs stab you and beat you down with clubs. \n\n\nYou cry out in pain and anger, but you are too weak to do anything else.  In moments you are left to die, broken, bloody, and bleeding out….", "action_results": []}, {"action": "Charge", "result": "You draw your sword, preparing it as you raise your shield.  With a roar you go forth to meet them, arrows from the archers flying to the sides of you and taking down some of your foes.\n\n\nThis barely slows them down, and they meet yours.  The orcs slow down the Red Handed, but as you duck, parry, deflect, and attack….the exhaustion is clearly written on your orcs.  Almost a straight twenty four hours of combat and sustaining injuries seems to be taking it's toll.\n\n\nYou slowly and steadily retreat as your allies fall one by one.  Ahead, Galik and the rest of the orcs at the siege breaker are being flooded by the Red Handed.  Galik climbs atop the contraption as he makes his stand, cutting down any foe brave enough to try to face him.\n\n\nRoaring, you and a few other orcs break your line to fight your way towards Galik.  Most of the other orcs rally to you and help you to push forward. \n\n\nDodging a blow, you slice through an orc's face.  He shouts out but before he can do much else you've already slashed his neck.  As you lunge forward you parry a blow, slamming your blade straight through the offenders chest.\n\n\nHis arms flail in front of him, and as you wedge the blade to get it out his blood spouts from it.  Another orc swings, his sword glancing off your cheek bone.  Roaring in fury, you slash through his knee and he falls gripping his stub. \n\n\nGalik slams his sword into an orc's skull, but it is in too deep for him to wrench it out.  The orc falls and the sword slips from his grip. \n\n\n\"Galik!\" you shout as you throw him your sword, and in one motion he catches it and slices through an orc's chest in mid climb.\n\n\nBrandishing your axe you charge forward, cutting down several orcs in a fury, but not without sustaining some injuries yourself.\n\n\nPanting and heaving, you climb onto the top of the siege breaker.  The both of you stand back to back fighting off orcs, as the rest of your allies are swallowed up.  As your weapon clashes with others, and blood is shed, you hear a gasp behind you.\n\n\nTurning, you see there is a dagger wedged into Galik's knee joint.  He falls and you reach out to catch him, but miss by a hair.  Galik is dragged into the crowd of orcs, you slash, beat, stab, and jab at him.\n\n\nYou roar and slam your axe into the nearest orc.  Before you can fall another, a flail flies forward, wrapping around your leg.\n\n\nThe orc pulls with a grunt, and steps back, dragging you off the glorified wagon.  You howl in pain and rage as the surrounding orcs begin to stab you and beat your with their clubs and fists.\n\n\nYou meet much the same fate as Galik….", "action_results": []}]}, {"action": "Stay here and cover Galik", "result": "\"Galik\" you say, \"let's hold out here.\"\n\n\n\"We need everyone to push through.\"\n\n\n\"No, if we stay here we can shoot them when they inevitably charge us,\" you say, \"we will probably die anyway, but we can whittle down their numbers a bit.\"\n\n\nGalik nods and prepares his bow.  You pass along the order for everyone to stand their ground and wait for the time to fire….\n\n\nBut it never seems to come.\n\n\nTwo days later, the fighting has calmed down in the camp, many of your orcs apparently having managed to escape if they weren't killed.\n\n\nNow most of the Red Handed are focused on launching volley after volley of arrows at you.  Many of you manage to shoot back, sometimes killing and wounding theirs.  But they have you beat down pretty well.\n\n\nAs you stand to fire an arrow, a sharp pain shoots through your chest.  Gritting your teeth you kneel down, gripping the arrow lodged in your chest.  You snap the shaft in half, knowing that pulling it out would only really cause you to bleed out faster.\n\n\nStill, this isn't the first time you have been shot with an arrow.  You sit down against the wagon next to Galik.  He is not doing so well, having developed a fever, and his wound becoming red and filled with pus. \n\n\nAn orc bends as low as he can as he dashes over to you.  Right before he can yell his message an arrow tears into his forehead.  He looks up at it, almost going cross eyed.  The orcs mouth moves but no sound comes out, and he collapses. \n\n\nLooking around, your orcs seem dispirited.  Many nursing wounds that will eventually be the death of them anyway.  One tired looking orc crawls his way over to you.\n\n\n\"Nolazir,\" he says, \"I was with you during our fight with the Wister Elves.  I will remain with you until the bitter end.\"\n\n\n\"The bitter end is already here, my friend,\" you respond.\n\n\nGalik wheezes and grabs your shoulder.\n\n\nIt's time,\" he says while bearing his sword.\n\n\n\"They've already got us beat,\" he says, \"we mind as well go out on our feet.\"\n\n\nYou and the other orc help Galik up as he struggles to stand.  He manages to get his own balance though.\n\n\n\"Friends, warriors,\" he says, \"the end is here.  I say we honor our fallen comrades, and go out on our feet as Gigalak intended it to be.\"\n\n\nGalik's voice is raspy and weak.  The remaining orcs all nod and prepare to charge.\n\n\n\"Forward!\" Galik cries.\n\n\nAs you and your young friend storm forward, you do not hear the rest of the orcs going.\n\n\n\"What is the this?\" Galik says, as you both see the other orc dead on the ground, an axe in his skull.\n\n\nOne of the orcs gestures to the dead orc with the arrow in his head.  \n\n\n\"The Red Handed gave us an ultimatum while you were busy talking about how best to get us all killed,\" he says.\n\n\n\"What are you-\" you say.\n\n\n\"Shut up,\" he says, \"this fool was going to tell you.\"\n\n\n\"Tell us what?\" you ask.\n\n\nMaybe it was the fatigue, maybe it was the trust in your fellows.  But under normal circumstances you should have seen this coming.\n\n\n\"It's better if we show you.\"\n\n\nAbout a dozen orcs notch their bows, you reel back in surprise, inhaling deeply.\n\n\n\"I order you to-\" Galik is cut off as several arrows hit him, he immediately drops.\n\n\nYou only get a moment to roar in rage as several more arrows pierce your chest.  You stagger back, blood starting to ooze out of your body. \n\n\n\"Argh! I'll fucking kill you!\"\n\n\nBefore you can muster anything else your old friends have restrung their bows.\n\n\n\"By Gigalak's blood I'll-\"\n\n\nArrows whistle through the air and slam into your body, gritting your teeth and writhing in pain as the deadly projectiles tear through your flesh and organs.\n\n\nYou go down, yelling an unintelligible garble, as you fall into a rage filled heap.  Twitching you lay there, all of your senses stopping as a haze slowly envelops your vision.", "action_results": []}]}]}]}]}, {"action": "\"Stop Moping\"", "result": "\"Listen, Hidius,\" you say.  \"You need to stop moping around and do something.  The only thing that is going to doom you and your tribe to extinction is this attitude of yours.\"\n\n\nHidius' eyes widen in surprise at your words.\n\n\n\"Even though you've been through much, they all look up to you.  You need to be their guiding hand, show them how to live a life by example, show them how to defend it too.\"\n\n\n\"I can't- there's no way we'll ever stop the oncoming darkness-\"\n\n\n\"Enough of that talk, it's spreading to everyone here.  The second thing that came out of Silak's mouth was this doom and gloom shit.\"\n\n\nHidius looks down for a moment.\n\n\n\"Perhaps my suffering has made me weak, when it should make me stronger.\"\n\n\n\"Yes, look.  They all need you.  We all need you,\" you say.\n\n\n\"Fine.\"  Hidius clenches his fists. \"I will gather my forces and take them to meet your army.\"\n\n\n\"Be quick.  The Mannate Empire is becoming a faster and larger beast every day.\"\n\n\nHidius nods and calls over a group of orcs.  You can't hear what he says but they all split up to gather more orcs, so you can only imagine that he is keeping his word.\n\n\nAs you ride off into the burning rays of the sun, you hope that your words actually got through to Hidius. \n\n\nYou ride on, to where you think the next tribe should be.  Perhaps you will find somewhere to hide from the sun for a bit first…", "action_results": [null]}]}]}]}, {"action": "Knock Out", "result": "Rolling to the side, his foot smashes into the ground inches away from your head.  Pulling your foot back, you shout as you slam it into Gro'tesk's knee.  As his knee pushes in, he cries out and falls forward, catching himself with his hands. \n\n\nYou push yourself up into a crouch as you run forward, reeling your fist back.  But you lose your balance and skid forward.  Fortunately, you use the momentum to plant your fist into the side of his head.  He grunts as the full force of your attack hits him, his head snapping to the side and his body twisting.\n\n\nHe lays still, and you crawl backward, just in case….\n\n\nBut he just lays on the ground.  All of the onlookers gasp, never having seen their mighty chief get knocked out cold.  You stand up and dust yourself off, and just right after the chief rolls over onto his back.\n\n\nRubbing his face and sitting up he looks at you, still dazed.\n\n\n\"I win.\",\n\n\nHe stares at you blankly for a moment.\n\n\n\"Fine!\"\n\n\nWith the help of a couple of onlookers, he stands up and stumbles his way over to his hut, rubbing his head as he tries to figure out how he could have lost.\n\n\nYou smirk and follow him in to give him your terms.", "action_results": [null]}]}, {"action": "Swift Punch", "result": "Keeping your elbows tucked in, you send out several punches.  The first three land well, hitting Gro'tesk's face.  The next two don’t go so well.  As your foe dodges the next, you lose form and go wide with your fifth punch, and he easily sees it coming. \n\n\nHe actually manages to catch your fist, twisting your arm to the side with one hand.  As you bring your left arm up to defend your face, his large fist slips in under it.  Your head kicks back as you feel the pain ripple through your mouth, the lip busting open.\n\n\nGro'tesk lets go of your arm as you stumble back, and he lands another fist into the side of your head.  A throbbing pain emanates from the side of your head. \n\n\nYour opponent grins as you stagger in a daze, he prepares the finishing blow…", "action_results": [{"action": "Catch his Wrist", "result": "Shuffling to the side a bit, you stare at your foe, your hands at your side.  He snarls and lunges forward for the last strike.  You lean back, then step to the side as you grab his wrist with your outermost hand.  You pull it down with as much force as you can, and with your arm closest to him you run your elbow along his straightened arm for a moment.\n\n\nYour elbow collides, hitting him right between the eyes.  His face scrunches up, and, as you let go, you step right in front of him; reeling your fist back you snarl as you ram it into his nose.  His head jerks back and his feet slip out from under him, landing with a heavy thud. \n\n\nPanting, you step back and watch him as he lays still.\n\n\nWith a groan he shuffles, rubbing his face with his hands.\n\n\n\"What happened?\" he asks.\n\n\n\"I won the fight.\"\n\n\n\"Aww, come on!\" he complains.  \"I wanted to win!\"\n\n\n\"No, I won fair and square.\"\n\n\n\"Fine!\" Gro'tesk groans.\n\n\nAs he pulls himself up, he mumbles under his breath.  He signals to you to follow him into his hut.  The crowd stares in awe, as they have never seen anyone beat their leader down before.", "action_results": [null]}]}, {"action": "Grapple", "result": "You shuffle forward, wrapping your fingers around his forearm.  He grunts in surprise as you pull, while simultaneously planting a fist or two into his ribs.\n\n\nDucking under a swing, you grab his wrist with your other hand and slide the first up his arm and lock it around his elbow.  With all your might, you yank is arm forward and pull down.  Gro'tesk stumbles and falls, and, as you are about to twist his arm, you feel a savage kick land on the back of your knee.\n\n\nBuckling and letting go of his arm, the foe pushes himself up.  Hearing him coming up right behind, you throw an elbow back with a savage snarl.  He catches it and wraps his hand around the back of your neck.\n\n\nWith a heavy grunt, he pushes you forward, using his control and momentum to keep you moving.  You cry out as he tosses you over a water trough and into a wooden rack with animal skins hanging from it. \n\n\nYou only half-catch yourself, and, before you can fully turn, Gro'tesk is right there.  With a sick grin, his boot flies into the water trough which slams into your stomach.  The wind is taken out of you, and you even manage to get a grip on it.  You cannot stop the force of the kick and the trough still goes down, pinning you to the ground from your waist.\n\n\nThe cold water spills out, pouring up over your belly and chest.  You feel like something sucks up into your chest as the cold makes you gasp.\n\n\nWith an unnatural nimbleness, Gro'tesk hops over the fallen trough.  He lifts his foot and brings it down.  Luckily you manage to catch his foot in time.  With both hands, you push as he does; both of your faces twisting with effort. ", "action_results": [{"action": "Twist his leg", "result": "Crying out, you twist his ankle; Gro'tesk almost falls but catches himself on the skin rack.  With one hand you pull his ankle forward.  Your goes tries to stop himself from falling forward, his other leg straightening up.  You shout out, sending your other fist into his straightened knee.\n\n\nA sickening crack resounds as your opponent's face twists up in pain.  He falls as he cries out, rolling into the skin rack as he nurses his injured knee. \n\n\nPushing the water trough off of you, now easier as it's empty, you hobble over to Gro'tesk.  He looks at you, a fiery rage in his eyes.\n\n\n\"You ruined my leg!\" he screams.\n\n\n\"That was called winning.\"\n\n\nHe roars, almost springing up and grabbing you, but his leg buckles and he falls.\n\n\n\"Hey, it was your knee of my skull.\"\n\n\n\"Fine! You win fair and square!\"\n\n\nYou stand to the side as several orcs help him limp into his hut.  The rest of the orcs from the village just stare at you in awe.", "action_results": [null]}, {"action": "Go for a cheap shot", "result": "Gritting your teeth as his foot gets closer and closer to your face, you're only left with one option.  He tries to pull his leg away, but you hold on tight.  Your wrap your hand over the top of his foot, pulling it so his heel skids across your chest.  Your other hand shoots upward, Gro'tesk's face twists in pain as he stumbles back and falls.  He rolls howling in pain, nursing his injured genitals. \n\n\nWith the water trough empty and no one trying to crush your skull, you have a much easier time pushing it off of you. \n\n\n\"No fair!\" Gro'tesk cries, \"that's cheating!\"\n\n\n\"So is trying to stomp in my skull,\" you say, \"but I did win.\"\n\n\n\"Fair is fair…and unfair is unfair!\" Gro'tesk screams.\n\n\n\"Well, now you've learned that there are consequences to trying to stomp heads in.\"\n\n\nGro'tesk rolls to the side and pouts.\n\n\n\"Fine, you win,\" he says, \"but I owe you a punch!\"\n\n\nGro'tesk pulls himself up in a huff, and hobbles over to his hut.  Most of the orcs stare at you in awe as you follow, others give you disapproving looks for your chosen victory route. \n\n\nAlthough you don't really care either way, you've won.", "action_results": [null]}]}]}]}, {"action": "Stay out of it", "result": "The chief just continues to wail on the youngster, his nose battered and turned wrong.  Blood oozes out of his nostrils and his left eye seems to be swollen shut.  He tries to talk but it just comes out as garble. \n\n\n\"What!? I can't hear you,\" the chief screams, \"you'll have to speak louder than that!\"\n\n\nThe youth's mouth begins to move, and as he does so, the chief's hand lifts and curls into a fist.  The larger orc raises an eyebrow, daring the smaller to try to speak again.  Realizing he is being given a chance, the younger sighs and remains quiet.\n\n\n\"Coward!\" the chief yells and drops the other orc onto the ground.\n\n\nHe just lays there, silently soaking in the pain inflicted upon him.  The chief turns to you, satisfaction in his eyes.\n\n\n\"Who the hell are you?\" he asks.\n\n\n\"My name is Nolazir, of the River Tribe…as some call it.\"\n\n\n\"Hah! Foolish name!\" he says, \"I am Chief Gro'tesk, and you are…..ah, Nolazir.\"\n\n\nHe grins.\n\n\n\"I've heard of you, fighting the humans….but you let your warriors argue with you,\" he says, \"you have gone soft!  You should pummel them into the ground whenever they so much as look at you the wrong way.\"\n\n\n\"Maybe I'm not so harsh to my own,\" you say, \"but I don't give that same kindness to strangers.\"\n\n\nGro'tesk's eyes narrow, and he snarls. \n\n\n\"Are you threatening me?\" he asks.\n\n\n\"No, I'm challenging you,\" you say, \"if I win, you and your allies join me.\"\n\n\n\"If I win….you screw off!\" Gro'tesk growls.\n\n\nBy now, a large group of orcs has gathered around.  All of them cheering on Gro'tesk as he removes his tribal necklaces.  They make a circle around you as you prepare to fight…", "action_results": [null]}]}]}]}]}, {"action": "Leave them", "result": "\"Leave the wounded,\" you say.  \"Gigalak will decide their fate!\"\n\n\nMost of the orcs obey, although many still loot the corpses.  Some of the more savage orcs cut the scalps from the still living and squirming men despite your order.\n\n\nYou walk through the dead and wounded, picking out the orcs who plead for your help.  Some you know cannot be saved, and others can while being grievously wounded.  With all the orcs gathered, you and many of the other orcs set to work helping them.\n\n\nYou have saved many lives this day, working over the sound of groaning Imperials dying in the mud just outside. \n\n\nYou see Grolik looking around, putting a spear tip to a wounded human.  With a grunt he pushes, sending the dying man to his fate.  It would seem as though that is not the first or the last he has killed in this manner.  You catch his glimpse for a second, shame written across his face.\n\n\nWhile he does not seem the type for emotions like that, putting helpless people out of their misery must take a certain toll on one.\n\n\nOn a rock sits Rolomag, nursing a gash on his face using a rag.  He just watches some of the orcs finishing off the dying Imperials.  Most of them do not seem happy about it, but maybe they believe it right not to prolong their suffering.\n\n\nYou turn your attention back to your work, ending the suffering of friends in a much different manner.  The orc whose deadly injury you have just cleaned and sewn up thanks you as he hobbles away.", "action_results": [null]}, {"action": "Take them prisoner", "result": "\"Take them as prisoners,\" you shout.  \"We will take them as ransom.\"\n\n\nYou divide your orcs, some of them gathering wounded orcs to aid them with their injuries.  The rest gather up the wounded Imperials worth saving.  Some are too wounded, so are either put out of their misery or left to die.\n\n\nYou grab a dying Imperial soldier, the young human sort of whimpers.  He must believe you are going to kill him, but his eyes widen in surprise as you clamp his wound.  You lift him up and carry him to some of the tents erected for the wounded.  There are many more orcs in here than humans, as most are focusing on the orcs, who they find more worth saving. \n\n\nThe soldier winces and grunts as you pour alcohol into his wound.  Alcohol and blood running from the gash in his side.  He groans in pain as you sew his wounds, then when it seems he is set, you tie his hands and place him under the guard of some other orcs.\n\n\nYou go, helping orc and human alike.  In the group, you are surprised to see Grolik eagerly helping a human. \n\n\nStrangely, he seems compassionate towards the wounded fellow as he wholeheartedly stitches his wounds up.  You are surprised to see this trait from an orc such as Grolik.  After witnessing him brutally butcher and maim countless enemies, it comes as a bit of a shock that he is not looting or scalping the helpless foes.\n\n\nWhile aiding enemy soldiers does not come naturally to you, surely Gigalak would smile upon saving lives as opposed to wanton destruction of life, something only the grimmest of souls would take satisfaction with. ", "action_results": [null]}]}]}, {"action": "Join the Cavalry", "result": "On your horse, you go around to join the cavalry.  As you do so, you signal the archers, the lightning briefly illuminating your warriors.  For a moment, the heavens are silent, the wind stops causing the trees to sway, and a single arrow soars through the air.\n\n\nThe Imperial officer lurches back, the arrow slicing through his shoulder.  He falls off his horse with a thud, and the rest of the soldiers try to escape, but it is already too late. \n\n\nYou and your cavalry have them caught in a pincer movement.  As you ride by, you lop an Imperial's head clean off his shoulders.  Before long, some of the humans have mounted horses in a vain attempt to buy their fellows time to escape. \n\n\nGalloping through the mud, you rush to meet one of these foes.  Before you is a tired looking man, a wild look in his eyes as he gives a mighty battle cry.  His sword clashes against yours, the rain splattering off the twin blades.  You circle back to face him again, a slight burning sensation on your neck.  To your left an Imperial soldier stands, fixing another arrow, the first arrow's head had just lightly grazed your neck.\n\n\nDucking, you spur your horse forward, turning back around to face the man who you had clashed with before.  Three orcs are upon him, as one sends his club into the man's gut, the other two hack and slash him with swords.  It takes some time before they pierce the mail he wears, but they are effective.\n\n\nCharging towards the small group of archers, you throw your axe.  The blade misses, instead the blunt side slamming into the man.  He holds his face, blood dripping from his nose.  A few arrows almost slam into you, but by the hand of Gigalak they are swept aside.  You ram your horse through, trampling two men and cutting another's chest open.\n\n\nAs you circle back around, you grab a spear from a leather pouch at the side of your horse.  Chucking it, the spear impales an Imperial. \n\n\nBy now your archers have joined the battle, and the Imperials are all but surrounded.  As they group up, they seem to realize the futility of their fight, and some even manage to run into the forest to escape.", "action_results": [null]}]}]}]}]}]}]}]}]}]}]}, {"action": "Impale the Knight", "result": "You pull one of your spears slung onto your back.  With a roar, you charge the knight, he looks in surprise, taking a swing at you.  You knock the sword to the side and ram the spear into his stomach.  The silver coat snaps and crunches, and, as the knight falls, you push the spear further into him.  You watch as crimson red oozes out from inside the coat as you twist and push the spear.  The imperial sputters and coughs from under his helm as he feebly reaches for his sword before going limp.  Ripping the spear out, you see the tip is mostly ruined.  If you hadn't kept pushing the dead man before, you would only have had a minor flesh wound.", "action_results": [null]}]}]}]}]}]}]}]}, {"action": "Throw your axe at the horse", "result": "The horses gallop forward, the knight's elbow tenses and he leans forward on the horse.  He seems intent on running your through.  As you ride forward you let him think this will be a jousting match….\n\n\nLike a bolt of lightning, you draw the axe at your side, throwing it at the Imperials horse.  The axe embeds itself in its forehead, and it lets out a pained neigh.  You dip to the side as it lurches forward, the knight being launched off with a cry of dismay. \n\n\nAs he lands a sickening crunch sounds out.  The knight groans and tries to pull himself up, but his arm is twisted and bent horribly.  He buckles and falls onto the ground, a defeated sigh escaping his lips. \n\n\n\"Come on, knave,\" the knight says, not moving, \"what are you waiting for you brute?\"\n\n\nBefore you can ride forth to finish him, a loud cry emanates from the forest behind you.", "action_results": [{"action": "For the Emperor!", "result": "You turn your horse.  From out of the trees, an enormous group of humans comes rushing out, screaming and yelling.  You notice they are quite different from the knights. While some of them have the silver coats, most of them just have some kind of padding and the Imperial soldier robes.  Their boots, gloves, and helmets don’t look anywhere near as nice as the knights'.\n\n\nThese must be the lowly soldiers of the Empire, but there sure are a lot of them.  You turn again as you see the lawless orcs bring up a cry, charging towards the humans.  You watch as your comrades also charge the humans, so you decide you should as well.\n\n\nGalloping forward, you prepare your axe.  A battle of strength versus numbers, you decide that Gigalak will decide the winner today. \n\n\nYou trample a couple of humans, their cries ringing out.  The axe bites into another, and as he dies his sword nicks your arm.  You slash, hack, batter, and even punch one.  A dying soldier cries out, digging his dagger into your side.  You gasp and slam your axe handle into his eye, a squishing sound resounds as blood squirts out and onto your leg.  He lets out a blood curdling scream as he flails, soon going limp and falling to the ground. \n\n\nWith the dagger still in your side, you circle back, needing to fight through a few more soldiers to do so.  Panting, you see that the battle is being lost for the orcs.  But some still fight on, despite their injuries and overwhelming odds. \n\n\nChief Greusim charges into the middle of it, laying waste to soldier after soldier.  His mighty club denting helmets and cracking skulls, breaking arms and busting jaws. \n\n\nYou watch as he cries out, someone plunging their sword into his side.  Gasping, you ride forward to save him.  But there are too many soldiers to fight through, and before you can reach him the grunts pull Greusim from his horse, stabbing, slashing, punching, and beating.  You see his own club being raised to be used against him.\n\n\nAll the other orcs in your tribe watch as the chief goes down, along with the other orcs he had around him. \n\n\nThere's just too many, you'll never fight through them all.\n\n\n\"Fall back! Fall back!\" some orc cries out.\n\n\nAs you all do so, the lawless orcs seem shocked as to why.  Before they can get away, the Imperial troops have swept them up and begin to butcher most of them.  Few escape, and you even swing one onto your horse as you ride away.\n\n\nYou all ride into the forest, lucky to have escaped death on this day.  The same cannot be said for many others. \n\n\nYou exchange glances with Rolomag, who nods and pokes his chin to the valley.  Although you don't like the idea, you all will have to go there to recover and make plans….\n\n\n ", "action_results": [null]}]}, {"action": "Throw your axe at the knight", "result": "As you both ride forward, the knight tenses up, preparing to run you through.  Pulling the axe from its loop, you whip it forward.  The axe whirls landing in his shoulder, almost making him fall off his horse.  Despite this injury he manages to hang onto his horse, pulling the axe from his shoulder.\n\n\nYet there isn't the familiar sight of blood oozing from the wound, just a ripped robe and silver gleaming in the sunlight. \n\n\n\"You'll have to do better than that, brute,\" the knight says while twirling the axe.\n\n\nGlaring at him, you accept his challenge, you spur your horse onward.\n\n\nThe knight does the same, holding both sword and axe in hand.  As he rides forward, you get an idea. ", "action_results": [{"action": "Stab his neck under his helmet", "result": "You lean in as you ride forward, intent on pushing the tip of your sword under his helmet, which should pierce his throat. \n\n\nAs the knight gets closer, you lunge, pushing the blade forward.  He slams his sword into yours, simultaneously pushing it forward and sliding the axe blade along it.\n\n\nBefore you even realize what is happening, the sword blade is biting through your neck.  The axe follows tearing through your flesh, muscle, and severing your neck bone.  You barely feel a thing as your head rolls to the floor, your vision darkening as the knight rides on, and your body falls to join you.", "action_results": []}, {"action": "Use bow", "result": "Not wanting to get close to this knight, you decide to this would have to do.  Sheathing your sword, you sling your bow from your back, notching an arrow just as fast.\n\n\n\"Huh?\" the knight says in surprise.\n\n\nYou release the arrow, and with a twang it soars through the air.  The knight barely has time to react before the arrow lands in between his helmet and silver coat.  It protrudes from his neck as dark blood spills out, a gurgling sound coming from his throat.\n\n\nThe knight struggles to stay up on the horse, falling onto the ground below.  You manage to recover your axe before you hear a loud cry coming out from the forest behind you.\n\n\n ", "action_results": [null]}]}]}]}]}, {"action": "Help the Orcs", "result": "You look to Greusim.\n\n\n\"Sorry chief,\" you say, \"Rolomag is right.  We need to work with the orcs, besides, the Imperials encroached on our lands.\"\n\n\nYou draw your sword.\n\n\n\"And there must be consequences.\"\n\n\nYou tell Dekard to get the rest of the orcs, in the meantime you wait.\n\n\n\"Nolazir,\" Greusim says, \"I'm disappointed in you.  We're in no position, and we will never be in a position to fight the Empire.\"\n\n\n\"It's for the good of Orcin,\" you say, \"we'll teach them a lesson.\"\n\n\nThe rest of the orcs arrive, and you look out towards them.\n\n\n\"Please chief,\" you say, \"help us defend our home.\"\n\n\nHe looks at the ground for a moment, but returns to answer you.\n\n\n\"If you all think it is best, I will help you.\"\n\n\nMaking sure to stay in cover, you wonder what the best course of action would be.", "action_results": [{"action": "Attack the Horsemen", "result": " Feeling bold, you suggest to go straight for the horsemen first, then fan out to the sides and wipe out the archers.  Some of the orcs have reservations about this plan, as it would place you right into the center of the archers.\n\n\nBut by Grikalia, you won't let some sharp objects scare you.\n\n\n\"We go in fast, and we go in deadly,\" you say raising your sword.\n\n\nMost orcs nod, and some reluctantly agree, including Greusim.  You all get on your horses, waiting for the right moment, although there really isn't one.\n\n\nOn Greusim's command you all charge forward, readying your weapons to meet these humans.  The archers fire at your group, an arrow whirling right by your head.  The cries and thudding of fallen comrades sounds out as the arrows kill several of your comrades.\n\n\nA low gasp, an arrow sticks out of chief Greusim's chest.  His face scrunches up in pain, but he ignores it and rides on, letting out a war cry of rage and pain.\n\n\nOne of the horsemen comes circling back from near the hill.  Seeing you all on the attack, he draws his sword, arcing it over his head as he rides towards you.\n\n\nYou decide to accept his challenge, arrows whirling around you and the sound of fighting in your ears. \n\n\n ", "action_results": [null]}, {"action": "Wipe out the Archers", "result": "Scanning the area, you decide it would be best to take out the archers first.  Your plan is to split the groups into two, each taking out a column of archers, and then catching the knights in a pincer attack. \n\n\nYou and the chief lead one group to the closest archers, and Dekard and another orc lead the others.  They take their group a longer way as their targets are further away.  Although you figure your distraction will let them take the other column even easier. \n\n\nYou slowly pass through the trees, the sounds of fighting slowly dying down until you creep up behind the archers.  The orcs prepare their weapons, waiting for the signal.\n\n\nAs you are about to charge, an Imperial archer steps out from behind a tree, adjusting his belt and sighing contentedly.  Although his hood is up and his mask is pulled up over most of his face, you see the surprise in his eyes when he sees you all.\n\n\n\"Attack!\" he cries, and at this point you all gallop forward.\n\n\nThe archers scramble to get ready, and Greusim make a passing swing for the Imperial.  He ducks under, and in the same movement grabs onto Greusim and his horse, pulling himself onto it. \n\n\nAs you ride forward, and Greusim tries to throw the archer off, the Imperial draws a small dagger.  The chief cries out in agony as the Imperial buries the blade into his back.  The chief falls, taking the Imperial with him.\n\n\nThe other orcs are coming up on the archer column, several having been killed by arrows.  Greusim groans and the archer attempts to stab him, but he catches his wrist, and the push and struggle.  Normally Greusim could easily overpower him, but getting thrown off the horse must have done a number on him. ", "action_results": [{"action": "Continue the Charge", "result": "Greusim seems to be doing well enough, so you decide to charge forward.  The orcs have broken through the middle of the column, leaving crushed and mangled corpses strewn about.  You break into the utter chaos, cleaving half of an Imperial's face off.\n\n\nTo the left a group of archers tries to form, and you attempt to go straight through them!\n\n\nYou duck low onto your horse, and as you approach them, you feel a stinging in your side.  You ignore it as your horse slams into some archers, screaming sounding out.  You lop another's arm off as you ride by, circling around and preparing to finish the group off. \n\n\nOne of the archers, helping a wounded friend, drops him and notches an arrow.  As you ride forward he lets it loose, and you grunt as the arrow buries itself into your thigh.  In anger you don't even bother using your axe, you just trample him and his friend with the horse. \n\n\nLooking out, you see that the orcs have decimated most of the archers.  The other column seems to be in chaos.\n\n\nOut towards the clearing, you see the lawless orcs have charged the Imperial knights, overwhelming them with sheer numbers.  They hack and beat the knights to pieces.\n\n\nA hot pain shoots up through your body, and looking down, you realize you have an arrow buried into your side.  Groaning, you steer the horse over to the other orcs as they finish off the archers. \n\n\nFrom out of the trees, Greusim stumbles out, panting and covered in wounds.  He has multiple gash marks and three arrows dug into his back, side, and hip.  Looking behind him, you see multiple archers laying broken and bloody on the ground.\n\n\nThe chief hefts his club over his shoulder.\n\n\n\"It'll take some more than some tender-bellies to take me down,\" he says.\n\n\nThe chief grunts as he pulls himself onto his horse.  As you ride to meet with the rest of the orcs, you break most of the shafts from the arrows on your body.  You leave a portion in so as not to make the injuries worse, and so that you can get them out later. \n\n\nYour comrades seem to have wiped out the other column, and the lawless orcs you helped start to walk towards you.\n\n\nBefore you can do anything else, a cry rises up from the forest behind you.", "action_results": [null]}, {"action": "Help Greusim", "result": "You whip the axe, the blade burying into the archer's shoulder blade.  He screams in pain as he stumbles to the side, almost tripping over Greusim.  He tries to pull the axe out, but Greusim gets a hand on it first.\n\n\nStill on the ground, he wrenches the axe out, swinging it back around and slamming it into the Imperial's stomach.  He doubles over as the chief rips the axe out, and the Imperial falls to his knees clutching the wound.  With a savage cry, Greusim arcs the weapon back around, burying it into the Imperials neck.  He falls twitching and gurgling as his blood seeps out into the earth.\n\n\nPanting, Greusim pulls the axe out, tossing it to you. \n\n\n\"Thanks,\" he says, and you nod at him.\n\n\nThe other orcs seem to be wrecking the column pretty well, even though several orcs have been shot down by the deadly volleys. \n\n\n\"Well, let's get to i-\" Greusim says, almost stumbling as an arrow rips into his back.\n\n\nYou ride over, looping around the tree and lopping off an archers arm.\n\n\nSeveral more materialize from the trees, firing at you.  Ducking you circle back around, hopping off your horse.  Sliding behind a tree, you and Greusim ready your bows. \n\n\nStepping out, you don't realize the archers were trying to creep up on you.  You slam your notched bow into his, causing his arrow to hit the dirt, before bringing yours back and shooting him in the throat.  He gurgles as he staggers to the ground.\n\n\nBefore you know it, the archers are charging you.  A couple arrows flying by you as you draw your axe.  To your right, Greusim cracks a couple of skulls with his club.  You deflect a sword, chopping into an Imperial's shoulder.\n\n\nOne jumps onto you, grabbing you and trying to restrain you.  His friend tries to run you through with his sword, but you step to the side.  The soldier's sword plunges into the tree, and as you raise your sword he desperately tries to yank it out.  He screams as you spill his blood onto the grass, specks hitting the tree.\n\n\nThe archer on your back grips your forearm, trying to turn your sword into you.  You chuckle and jab the sword back, the tip stabbing him in the face.  He cries out and you throw him over your shoulder, stomping on his neck to silence him. \n\n\nYou look up, ready to take the next one, but you see them laying crushed and bleeding around Greusim.  He pants as he kneels, deep cuts and gouges all over him.  Three arrows protrude from his back, side, and hip.  The archers must have thought the other two were going to kill you, and decided to all focus on him.\n\n\n\"Chief!\" you cry out.\n\n\nHe stands up, waving you off.\n\n\n\"I'm fine, I'm fine,\" he says, \"let's go find the rest, Nolazir.\"\n\n\nYou nod and go with him to find the rest, mounting your horses.  As you ride out you see that both columns of archers have been destroyed.  The lawless orcs on the hill must have swept down and fought the knights, as evidenced by the butchered corpses on the ground. \n\n\nGreusim climbs onto his horse as you ride forward.  Before you can do anything else, a loud cry rises up from the forest behind you.", "action_results": [null]}]}]}]}]}]}]}]}, {"action": "Don't Go", "result": "You have weighed out all of the options, and you decide that you are going to stay here at the village.  Let the currently more adventurous orcs handle this sort of thing.  Greusim looks somewhat disappointed that you did not volunteer to go along, but no chief can force an orc to take a part in these matters if they do not wish to.\n\n\nChief Greusim beckons you to him, while all the other orcs are getting prepared for the trip, or complaining they weren't selected. \n\n\n\"Nolazir, my friend,\" Greusim says, \"I need your help.\"\n\n\n\"I'm sorry Greusim, I can't go-\"\n\n\n\"No, not that,\" he says.  \"I need you to keep an eye of the village while I am gone.  Oversee things and make sure that it all holds together.\"\n\n\n\"Well what exactly do I have to do?\" you ask.\n\n\n\"Hmm, govern the daily matters of the village, for one.  Most orcs are responsible for their own crops and supplies, but sometimes Gigalak has other plans.  If they need help, then you help them.  If there are any squabbles, you end those as soon as you can.  Also, as I'm sure you know, make sure the village is kept safe…\"\n\n\n\n\nGreusim gets into the specifics of running the village day to day, and while some of it sounds kind of boring, you realize those are the things that must be done to keep the village together.\n\n\n\"Gigalak didn't give us these fields, forests, and mountains as our home, just to lose it to laziness and ignorance.  Remain vigilant and you will be fine,\" Greusim nods and pats your shoulder, \"but I trust you Nolazir, you'll do a fine job in my stead.\"\n\n\nYou bid each other farewell.  Greusim and the rest of the groups ride off towards the mountains, and before leaving the village Rolomag looks back from his horse and nods at you, which you return.\n\n\nThe village stands behind you, more or less going on as it always has, even if it is a little emptier.", "action_results": [{"action": "Branch 1B: Home", "result": "You enter the large hut that could be considered the villages town hall.  There really isn't much to it, mostly a chair and desk near a fire place.  The rest of the space just has piles of extra crates, hide bags, and random farming tools.  As there isn't much use for an orc at a desk, you decide to saddle up and make your rounds through the village.\n\n\nAfter some time, you realize there isn't much going on except for the village seeming a bit emptier.  It isn't as empty as it was when you returned from fighting the Wister Elves, but you shake off this feeling before you go into your old habit of thinking about those days too much.\n\n\nIt is not too long after that several orcs come to seek out your guidance and leadership.  While you have always been able to lead others when it counted, it was never really in a domestic capacity.\n\n\nYou stand outside of the chief's hut, feeling it unnecessary to sit at the desk.  One by one the orcs come through, asking for advice on various issues regarding farming, smithing, and others.  A few even come to you for help in settling disputes among each other. \n\n\nAfter the next few hours, you feel pretty great that you got to help, and that none of the disputes ended in bloodshed, which is quite common in Orcin.  While you are the acting chief, you are confident that no fools are going to try to challenge your leadership.  This would be foolish as Greusim would return to take his rightful place soon anyway.  You have rarely heard of orc cheifs being assassinated, as outright murdering an orc chief does not count, and would only end in execution. \n\n\nAn aspiring orc would have to challenge him, and at the appointed time they would fight where the whole village could watch.  The fight would go until one yielded, or to the death.  From what you remember from when you were much younger, that is how Greusim came to be chief.  Although the chief before him was a terrible and cruel leader.  Since then, you had only seen a few orcs challenge Greusim; those all ended in a grisly demise for the challengers, and saying as most are happy with his leadership, there has been no need to attempt to remove him.\n\n\nAs you prepare to return home for the day, you see one of Greusim's sons, Galik, briskly approaching.  Judging by his demeanor, you know he is upset about something.  At first, you assume it is about Greusim refusing to bring him on the expedition.  Although Galik is of age to participate in these matters, he is way too hot headed, even for a normal orc of youth.\n\n\n\"I'm here to take my rightful place as chieftain,\" Galik says.\n\n\nYou take a moment to stop yourself from laughing.\n\n\n\"Galik, my friend,\" you start, \"do you realize this is temporary?\"\n\n\n\"Yes, but as I am his son,\" he says.  \"Why shouldn't I be in charge? I have seen him work enough to know what to do.\"\n\n\n\"I know you would be very skilled in leading the tribe,\" you say, \"but he left me in charge and I will obey his wishes.\"\n\n\n\"Who are you to take this power from us?\" he asks.  \"When we earned-\"\n\n\n\"No, Greusim earned it,\" you say.  \"You should know that status does not follow family lines.  Each lives according to his own merit.\"\n\n\nYou cross your arms and lean against the hut.\n\n\n\"Besides, in a few years when your father is good and ready to retire,\" you say.  \"I'm sure you'll be well prepared to lead us further into prosperity.  Do you think I want this title?\"\n\n\nGalik stops and thinks for a minute.\n\n\n\"Galik, as I said, this is only temporary,\" you say.  \"I would not want to do this for all the years Greusim has, I have my own place in the tribe.  While he can't pass down leadership to you, he can prepare you to earn the role when it is your time.  You'll do a fine job, boy.\"\n\n\nGalik seems calmed down at your words, and he nods.\n\n\n\"I'm sorry Nolazir, my friend,\" he says.  \"Sometimes I get caught up in these things too much.  I especially want to preserve all the hard work my father has put into this village.\"\n\n\n\"And you shall, someday.\"\n\n\nGalik apologizes again before going off to take care of other matters.  You sigh and look around the village, the dying light casting a cold shade upon your home.\n\n\nYou get to your horse and ride back down the trail leading to your house.", "action_results": [{"action": "Later...", "result": "The next morning yields several orcs showing up to your house.  While at first, you thought their intentions were bad, as soon as they saw you they started complaining about issues.  You notice these orcs are the young and impatient sort, who haven't learned that showing up at a chief's house first thing in the morning is frowned upon.\n\n\nSternly, you tell them to wait until you go down to the hut to start village business.  The orcs all grumble and shuffle off, presumably to cause some mischief.\n\n\nYou shake your head.\n\n\n\"No damn patience.\"\n\n\nYou take care of your regular work, making sure your wife only really needs to worry about the inside of the house and the children.\n\n\nAfter saying your goodbyes to your family, you walk down to the village center.  Breathing in the fresh morning air, happiness swells inside of you, but soon after you can't help but get a sick feeling in your stomach.  It is almost as if something has reached its hand into your gut and is content with squeezing your organs within.  Ignoring this feeling, you go back to thinking about the day.\n\n\nAll around the village orcs hustle and bustle, going about their daily work and chores.  You see the village blacksmith working hard, mostly making farming equipment for some of the residents.  You have dabbled in some smithing yourself, but as most orc weapons are relatively simple to make, the task is usually up to a handful of orcs.  These days all their work mostly goes to farming equipment, tools, and other metal components for barrels, wagons, and other miscellaneous things.\n\n\nYou watch as a dozen orcs prepare their canoes for some river fishing.  While most orcs can be self-sufficient, most like fish, and it makes good for trading for the villages who cannot get fish so easily. \n\n\nAhead, a wagon slowly rolls into the village, pulled by horses and with several orcs sitting on it.  You recognize them as being from one of the mountain coastal tribes.  They have come a long way to trade with many tribes.  As they trade rocks and materials only found by the sea, including some pearls, they regale the younger orcs with tales of adventures on the sea.  Most likely exaggerating accounts of encounters and battles with large sea monsters.\n\n\nEventually, they roll through the village, their exchanges being over with.  You notice they even recruit a few young and adventurous orcs to join them on their sea adventures.  While you can't stop them, you wish they would stay and help the village.  Most are still concerned about the reports on the Mannate Empire.\n\n\nThe orcs that leave with them will probably return someday, they always do.  Turning your attention to other matters, several of the orcs need your assistance and advice on village matters.  You lead them past a group of young teenage orcs fighting and wrestling, as they tend to do.", "action_results": [{"action": "Two Hours Later", "result": "After a couple hours of dealing with the villagers' problems, one orc named Ruzmar rushes in, panting and sweating profusely.\n\n\n\"Nolazir,\" he says, \"I was out hunting for deer by the rivers Southwest of the village.  We saw a group of goblins heading through the hills.\"\n\n\n\"Goblins live in the area, so what's it to us?\" you ask.\n\n\n\"We were only a few miles from the river,\" Ruzmar says.  \"They have always been rivals with the lawless tribes down in the plains in that area.  The thing is, they've never been this far up.\"\n\n\n\"Hmm,\" you cross your hands under your chin, \"perhaps they've been driven up here by the tribeless bands.\"\n\n\n\"Also,\" he says, \"they are pretty heavily armed.  Not the usual stone and wood weapons either, metal and iron.  I think they're learning how to make better stuff, or stealing it from the lawless, who have probably stolen it from others.\"\n\n\n\"Show me.\"", "action_results": [{"action": "Onward", "result": "With this alarming revelation, you round up two dozen orcs to go with you and Ruzmar.  As you climb onto the saddle, Galik approaches, ready to go.\n\n\nYou open your mouth to tell him to stay, but stop as you realize he will need to learn how these things are handled.\n\n\nLater, after as the evening sun lowers over the land, you move through the hills.  Keeping a vigilant watch, Ruzmar tells you that you have almost reached where he last saw the Goblins.\n\n\nOver the next hill, a large camp extends over the little peaks and valleys in between.  Multiple campfires are alight, and you see the short goblins scampering about, doing random chores or just keeping an eye out.\n\n\nPeering closer, you see that several seem to notice your group.  Before long a group of over thirty goblins cautiously make their way over, stopping at the end of what they believe is throwing distance.  One particularly larger and uglier goblin walks forward.  His face and body are covered in tribal tattoos, and he wears bone necklaces and an amulet which must be a symbol of status.\n\n\n\"I am Gru'zikular,\" he says, \"Chieftain of the proud tribe of Gerobler.\"\n\n\n\"I am Nolazir, humble servant of Chief Greusim, the leader of our tribe.\"\n\n\n\"Has your tribe no name?\"\n\n\n\"Sometimes we are called the River tribe, but Gigalak has never had need to distinguish us.  Only the lawless concern themselves with petty names.\"\n\n\nGru'zikular nods, both hands resting on his staff, which you assume is where he draws his shamanic power.  The orcs and goblins are similar in that respect, they call upon the powers of the Earth for assistance, while the elves use their strange magic.\n\n\n\"That is what we have come to speak about,\" Gru'zikular says.  \"These….lawless orcs raid and pillage, steal and burn.  We have tried to make peace, we have tried to fight them.  Nothing has worked, so we come to you with a treaty.\"\n\n\n\"I see your plight, the lawless have been trouble,\" you say, \"but they've kept the humans, dwarves, ogres, and even yourselves from treading too far in our lands.  I would say, you goblins and the ogres have probably helped keep the dwarves out as well.\"\n\n\n\"So then why are we treated as such vermin and animals?\" Gru'zikular asks, \"we no longer have lands to call our own, since the dwarves threw us from the mountains and caves, and before that, we walked these very lands you now call yours.  Since our removal we have roamed the land, living much as bandits and raiders in order to survive.\"\n\n\nGru'zikular seems to get a little angry, although he attempts to hide it.\n\n\n\"We seem to have common interests,\" he says, \"so we need your help.  Either tell the lawless to leave us alone or else help us fight them.  In exchange for their souls, and the land they live, we would be glad to put our skills to use for the lawful tribes of orcs.\"\n\n\nThey offer an interesting argument, and although both goblins and the lawless orcs have each been helpful in their own way, they each also pose their own problems. \n\n\n\"I will bring your request to Chief Greusim upon his return,\" you say.  \"Until then, you will have our protection.\"\n\n\nGru'zikular raises his eyebrow.  It is here that you explain you will leave some orcs to watch over the camp, as the lawless would not dare to kill an orc from a proper tribe.  This would bring upon them the wrath of the council and neighboring orc tribes.  The goblin chief expresses his appreciation. \n\n\nYou leave half of the orcs in your company with the goblins.  Although there is much complaining, they still comply. ", "action_results": [{"action": "Return to the Village", "result": "As you ride back, Galik ceaselessly argues over your decision.  At which point you tell him to shut up, and that Greusim will have the final say.  Even though he still seems pissed, it gets him off of your back for now. \n\n\nIt is late when you return to the village, and you decide not to worry about any of these issues for the night.  They can easily be handled tomorrow. \n\n\nThe next morning seems to come quicker than you had expected.  Yawning as you stretch, you go to quiet your infant child, Lagrik.\n\n\nAfter some time, when the child has fallen asleep, you go outside.  Almost immediately, you see three orcs riding up to your house on horseback.  You are almost about to shout at them when you realize these aren't the young and impatient orcs from the other day.\n\n\nYou see three faces before you.  The first being Rolomag, his face drawn and tired looking.  His normally shaved face covered in a dark stubble.  The second is Dekard, the orc who first saw the Imperials and went on the expedition.  Around his head are bandages wrapped around, a dark red stain soaked into it.\n\n\nThe third orc is one you do not know, his hair is wild and his face also covered in stubble.  Multiple scars line his face and arms, his leather and fur clothing not looking like that of your tribe.  Two teeth protrude from his underbite, one of those is chipped.  A red hand painted on his face, his dark eyes attempt to pierce through you.\n\n\n\"Who is this?\" you ask.\n\n\n\"My name is Grolik, leader of the Red Handed orcs band.\"\n\n\n\"Hmm?\" you say, \"one of the lawless.  What are you doing here?\"\n\n\nBefore he can continue, Rolomag has jumped off of his horse and grabs your shoulders.  Eyes widening, you step back, pushing his arms off of you.\n\n\n\"What has gotten into you?\" you ask.\n\n\n\"Nolazir,\" he says, seeming very tired, \"we ran into some Imperials, they were fighting these orcs.\"\n\n\nRolomag goes on to explain that the Imperial soldiers laid siege to the orcs, who were stuck on a rocky hill.  They exchanged arrows with the archers, and some Imperial knights on horseback made sure none could leave the hill. \n\n\nHe goes on to say that Greusim rode forward to talk to the Imperials, but was struck in the side with an arrow.  While both sides were shooting back and forth, Rolomag is not sure who actually hit the chief.\n\n\nRolomag goes on to explain that the arrow barely had an effect on him, and that, even when all-out combat broke out, Greusim was able to help them.  They killed the knights and managed to wipe out the archer columns after a hard-fought battle. \n\n\nRolomag looks at the ground and seems to stop.\n\n\n\"Well, then what happened?\" you ask.  \"Out with it.\"\n\n\n\"From out of the trees a large force of Imperial soldiers ran out, we fought them well on horseback… but… they surrounded Greusim and the orcs nearest to him.\"\n\n\nRolomag seems to struggle with speaking.\n\n\n\"They fought well, but the humans were hard to kill with their silver coats and helmets.  They pulled Greusim off his horse… by Gigalak there were so many of them.  They struck him with everything imaginable, even his own club.\"\n\n\n\"What are you saying?\" you say, already knowing but in disbelief.\n\n\n\"Greusim lays dead,\" Rolomag says.  \"They butchered his corpse.  After that we couldn't fight them, there were just too many.  We fled to the hills, and from there the three of us came here.\"\n\n\nYou sit down, almost missing the wooden log and hitting the ground.  Staring at the ground, you wonder how this expedition could have led to this?  All he wanted to do was talk, and those animals tore him apart. \n\n\n\"Damn human scum,\" you say on the way to the village as you learn of the other fallen orcs.", "action_results": [{"action": "Mourning", "result": "The village is in mourning, the loss of Greusim and the other dozen orcs has hit the village hard.  A somber mood fills the air, and most orcs only know of one way to handle these types of emotions.\n\n\nYou see many orcs putting on their war paint, and performing war rituals to ask for Gigalak's favor and guidance.  Sighing, you join in on this, as your anger fills you.\n\n\nThe humans do not know peace or diplomacy.  They only see war and control.  While the switch from sadness to rage was quick, you all know it is the right thing to do.\n\n\nAs you ride towards the camp in the mountain, you make your plans for revenge on the Empire.\n\n\nThe plan, to unite with the Red Handed and find where the Imperial camp is located.  Then you will figure out how best to handle them…", "action_results": [null]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, null]}]}, null]}]}, null]}]}]}]}