{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=10183", "context": "", "first_story_block": "You are a local swineherd in the village of Jacquescrappe and your two best friends in the whole world are your two favorite pigs \"Oinky\" and \"Snout\".  You have recently finished your daily chores when you hear a terrifying scream.  Your village is known for suffering frequent hit and run attacks from the creatures in the mountainside and those that get taken never come back.  By the time you get there, it is already too late.  And to make matters worse, it was your little sister that was taken this time.  You've been dealing with this shit your whole life, but this is the last straw.  Somebody has to take care of those foul beasts!\n\n \nYou pick up a pitchfork only to be stopped by the gentle hand on your shoulder.  You turn and see Brandolf the Bray gazing down at you from behind a beard that is quickly encompassing his whole face.  He tells you that to stop the monsters you must focus on assassinating the Craxil, for without their leader the rest will likely vacate the area (or at least fall into disunity making them easier for the local militia to handle individually). \n\n \n \n \n Many other villagers have arrived on the scene and they obviously share the same sentiments as you.  Seeing the looks in their eyes, Brandolf decides he's going to have to organize a council meeting to discuss the matter before anyone gets it in their mind to do anything stupid. \n\n \n ", "action_results": [{"action": "To The Council Meeting Then", "result": "Brandolf the Bray manages to convince the townspeople to stow their torches and pitchforks and agree to a council meeting but it is clear from everyone's faces that they would not accept any outcome that did not involve taking immediate action.  Brandolf's magic may be formidible, but against a numerous and organized foe he would not get far.  The townspeople (yourself included) are but farmers and peasants and would be hardpressed to slay a hackneyed donkey, let alone a monster.\n\n \nMost of the creatures that come out of the mountains are lumbering, humanoid creatures that stand about 10 feet tall and are covered by brown fur from head to toe.  They have a hunch in their backs, and the villagers have taken to calling them humunculi.  While these creatures are certainly new to you, you are warned that there are even more dangerous creatures lurking in the depths of the mountainside.  Now you begin to look at the towering rockface with a mixture of curiosity and dread.\n\n \n\"We need to deal with this Craxil thing NOW\" an angry voice shouts.  \"How long must be culled before the royal military arrives to aid us?\"\n\n \nOf course, the royal military they speak of is from the kingdom of Mihtana, which is a considerable distance away.\n\n \n\"The royal military has never been willing to send any military force out to our village, why should this be any different?\"\n\n \nThis comment is true, you think.   The village of Jacquescrappe is a considerable distance away from civilization and the kingdom of Mihtana sees it as being of no strategic value.  Even if it was under direct threat of annihiliation, you doubt anyone would go through the trouble of committing a significant military force out to such a far away place.  In fact, Brandolf is the only outsider that has bothered to help the village in a long time.\n\n \nThe rest of the townspeople immediately begin arguing over whether they should stay and defend the land of their ancestors or simply leave.  Others put forth ideas on how to trap the Craxil that are quickly dismissed by Brandolf as stupid.  Suddenly, Brandolf makes an announcement. \n\n \n\"I have a poison, aquired from an alchemist in Lima, that can kill the Craxil.  Even trace amounts of this deadly substance can kill even the largest of creatures\".\n\n \n ", "action_results": [{"action": "Listen Intently to Brandolf's Plan", "result": "\"The trouble is that this poison must be ingested or applied to a blade, simply splashing your opponent with it will not suffice.\" \n\n \n\"But how will anyone even get that far?  Without royal aid, how can anyone even hope to reach the Craxil?\"\n\n \nAt this point, many in the council are reminded of your exploits at last year's \"capture the flag\" contests.  In fact, at every annual festival you manage to outfox your opponents, evade their numbers, and sneak up on their flag.  Your success record was almost unrealistic.  Suddenly, the council gets it in their minds to send you in with the poison.  In fact, you're alarmed by how quickly they're all agreeing to this idea despite the fact you haven't yet.  Then again, you've always sensed that as a swineherd you've never really been well liked or considered \"valuable\" by the townsfolk so this response isn't entirely unexpected.\n\n \nNonetheless, you aren't going to go anywhere or do anything that you haven't agreed to do first.  Unlike the others in the room, Brandolf has the decency to walk up and ask your opinion on the matter.  He is usually dismissive of stupid ideas, but he seems to think this one might actually work.  You take a moment to decide how to respond.\n\n \n ", "action_results": [{"action": "Accept The Offer And Begin Your Quest", "result": "You resent that the rest of the village is so quick to agree to such an idea without bothering to consult you first, but these creatures carried off your sister and they are going to have to pay for that.  Besides, this shit has to stop.  You inform Brandolf that you agree and he smiles warmly. \n\n \n\"Thank you young one, you are certainly bold to undertake such a suicidal mission.\"\n\n \n\"Well, what choice do I have right?\"\n\n \nHe hands you the vial of poison, a short sword, a longbow, and a quiver of basic iron arrows.  For once, some of the people of the village actually look at you with respect but then you realize that they are commenting on how stupid you must be under their breath.  The ingrates!  Still, you need to focus on the task at hand.  Brandolf reminds you that the Craxil will be larger that the other creatures and that you should seek to evade rather than engage its underlings.  At this point, you realize you have a problem...\n\n \nYou stink!  The stench of swine manure spreads forth like body odor of a sweaty fat girl and you realize you are going to have to do something about this if you expect to succeed in your quest.  The council members may be used to it as this is a farming community, but the creatures almost certainly will not be.  You are going to have to consider how you are going to go about dealing with this issue.\n\n \n ", "action_results": [{"action": "Try The Fancy Cologne", "result": "You know that a friend of yours has recently returned from his trip to the city and brought some cologne with him.  You've heard that it does wonders for a man's scent and promptly apply some from a bottle labeled \"Musque\".  Coincidentally, it does seem rather musky.  Confident in your newfound manly scent you head into the mountains and prepare to meet destiny.  The wind changes direction and your enemy is aware of your position before you even reach the first plateau on the trail.  It isn't long before the humunculi are upon you, ripping you from limb to limb.  You tried to defend yourself with your short sword but hey... these are monsters and you've got the upper body strength of an anorexic girl.  They find you to be an unsatisfying meal.\n\n \n\n \nTHE END", "action_results": []}, {"action": "Roll Around In Mud And Grass So You Smell More \"Earthy\"... Like The Monsters Do", "result": "You reason that many of the monsters that come down from the mountainside smell a bit \"earthy\" so you try rolling around in the mud and grass to try and acheive that same smell for yourself.  Unfortunately, it doesn't mask the stench of the hog manure that still stains your pants and boots.  It isn't long before the humunculi are aware of your presence.  The villagers got to see their hero pounced on and torn apart before he even got out of sight range.  Too bad.\n\n \n\n \nTHE END", "action_results": []}, {"action": "Just Take A Bath", "result": "This is a no brainer.  If you want to shed the stench of pig crap then take a bath and get a change of clothes!  You head down to the bathouse and a tall, dark haired girl prepares your bath.  The bath is relaxing and you take special care to dawn an all tan outfit as you suspect it may help you blend in with the rockface better than your usual swineherding outfits will.  When you are done, you realize you haven't any scent at all and gather up the equipment you were given at the council.  It is time to go.\n\n \nThe villagers are gathered at the base of the mountainside cheering you on as you walk forth.  Despite their cheering you know they don't really give a shit about you and you question why you are still taking this kind of risk, but you move forward with it anyway.   You continue up the path and reach the first plateau that overlooks the village.  There are two caves that go down deeper into the rockface.  You remember seeing humunculi emerge from these caves so you reason that this would be a good place to being your search. \n\n \n\n \nAll that's left to decide is which cave you wish to enter.\n\n \n ", "action_results": [{"action": "The Left Cave", "result": " \nYou are quickly beginning to wish Brandolf had given you a torch, but given the nature of your quest he probably figured you didn't need to draw attention to yourself.  Still, you can barely see more than a few feet in front of your face and it is only getting darker as you continue further inward.  You run your hand along the right wall and move carefully, scouting each step with your foot to avoid a fall.  Your heart is racing and you know that at any moment, something might come out and attack.\n\n \n\n \nEventually, the cave leads into a small inner chamber with a campfire in the middle.  Three humunculi are sitting around the campfire, roasting human limbs on a stick as if they were marshmellows.  Fortunately, they are not aware of your presence and the campfire enables you to see there are several tunnels leading out from this chamber.  On the other side of the chamber is a tunnel that goes deeper in, but you won't be able to go down this way undetected as long as the humunculi are here.  There are also nondescript passsageways to the left and the right (large and small respectively) that you can reach as long as you stay in the shadows.\n\n \n ", "action_results": [{"action": "Sneak Down The Large Passageway", "result": "You press your body firmly against the back wall of the chamber and slowly make your way over to the entrance of the large passageway on the left.  Occasionally the campfire will flicker light in your general direction giving you pause, but the humunculi are totally unaware of your presence.  Eventually, you manage to make it to the passageway and it doesn't take long before you reach another chamber.  You are greatly disheartened by what you see up ahead. \n\n \n\nA larger than normal humunculus stands in the center of the fairly well lit chamber and judging from his tribal decor you figure he must be someone of rank.  The passageway continues at the other end of the chamber, but this creature blocks your path.  At the moment, he is looking off to the side and does not notice your presence.  You weigh your options.\n\n \n \n ", "action_results": [{"action": "Charge Him With Your Sword Drawn. Only One Of Him After All.", "result": "You may be weaker than a Japanese schoolgirl but there is only one enemy to face here and you have the element of surprise!  Perhaps if this were just an ordinary humunculus this would have worked, but it becomes apparent that this well decorated character is something altogether different.  His reaction time is excellent and he whirls around to back hand you before you can get within range to strike.  This sends you sprawling across the floor and knocks the sword out of your hand and beyond your reach.  Before you can get up, he leaps over and grasps your neck.  As he squeezes the life out of you, the three from the other room come down and you quickly realize all hope is lost.  There is no point in fighting now, it is simply...\n\n \nTHE END", "action_results": []}, {"action": "Draw Your Bow And Try To Kill Him From A Distance Before He Realizes You're Here.", "result": "The room is too well lit to try and sneak past him and lunging forth at a superior foe with a short sword doesn't strike your fancy either.  You decide to get creative and pull out the bow that Brandolf gave you in the council before you left.  You ran a few practice shots before departing on this journey and you know you can at least hit a general target, though you'd be pretty hard pressed to achieve any kind of real accuracy.\n\n \nThe first shot whizzes past the creatures head and into a nearby pillar of rock.  His eyes go wide as he looks at the arrow then turns to look directly at you.  You immediately pull back another arrow and take aim knowing this shot is going to make or break destiny.  You aim for his chest as that is the broadest target available and the iron arrowhead may even reach his heart.  As he lunges forth you close your eyes and release...\n\n \n\nYou half expected you'd be dead by now but when you open your eyes you discover your arrow went through the creatures neck.  He is now on his knees bleeding profusely and clutching his throat.  Wasting no time, you finish him with your short sword, then dive into the darkest corner.  The three humunculi heard the ruckus and have come down from their campfire to see what the commotion was.  When they discover their fallen comrade, they go into a rage and start to look around.  You dig into the corner as much as you can and clutch your sword.  Two of the creatures move towards the unexplored passageway on the other side of the chamber while the third seems to be gravitating closer to your position.  You begin to wonder if you should strike him by surprise while you still can or hope you can try to remain undiscovered.", "action_results": [{"action": "Strike Now While You Have The Chance!", "result": "Instinctively, you know you are going to be discovered if he gets any closer.  You aren't sure how you are going to go about escaping the other two, but you are gonna have to kill this one before it gets any closer.  Without warning you lunge forth and put your short sword through the creature's belly.  You were actually aiming for the heart and the creature moved so I guess that says something about your swordsman skill.  Nonetheless, it proved effective at killing the creature.  You waste no time at all in bolting back up to the original chamber with the campsite and the other two will round the corner any second.  You need to make a decision FAST! \n\n \nThe large pathway (on the right wall as you enter) is now inexplicably barred but you can still run back outside the cave or down the passageway that was previously inaccessable due to their presence.  The adrenaline floods your body and your survival instincts take over.  You immediately decide to...\n\n ", "action_results": [{"action": "Run Down The Previously Inaccessable Passageway", "result": "You run down the passageway that you were previously unable to get to while the three humunculi were at the campfire.  Unfortunately, the humunculi have chosen the same path.  You aren't sure if it is because they saw you or because of bad luck, but they are not far behind you now.  You reach another chamber and find a large, demonic looking creature blocking your path.  Before you can even think about how to describe this thing you feel the humunculi grab you from behind and pull you to the ground.  They are about to stomp you to death when the demonic looking creature disintigrates them on the spot. \n\n \n\"Nobody takes my prey in my domain.  Tell me little thing, what are you here to do?\"\n\n \nThis thing looks like a large floating eye with multiple smaller eyes attached atop its head.  You realize this thing is a beholder and soon you find yourself paralyzed in its gaze.  That's what you get for staring into its eye I guess.\n\n \n\"Answer me puny one, why are you here in my domain?\"\n\n \nYou are too terrified to answer, but this creature appears to grow irritated by your silence so you muster all the courage you've got and speak up\n\n \n\"I'm here to slay the Craxil\" you proclaim, terrified of how this creature will respond to such a bold statement.\n\n \n\"HA!  Amusing little one, someone of your strength doesn't have what it takes but it would entertain me to see how you die in the Craxil's mountains.  Answer this riddle correctly, and I will permit you to continue through to the other side of my domain.  Answer incorrectly, and you will share the same fate as your pursuers.  Are you ready?\"\n\n \n\"As ready as I'll ever be\" you squeak.\n\n \n\"Very well!\" it bellows, clearly enjoying every bit of this.  \"I am a vast canyon that spans beyond sight.  I am without end and have been a part of every man whenever there is trouble.  What am I?\"\n\n \n \n ", "action_results": [{"action": "Boundless Hope", "result": " \n\"Indeed\" the creature states.  \"You are clearly in trouble right now as you are helpless in my domain, yet like the rest of your kind you retain hope of survival somehow.  I guess this means I'll have to let you through to the other side, but hear this:  once you reach the other side, I'll not permit you back in so this is a one way deal.  Get going.\"\n\n \nYou wanted to protest as you can't guarantee you won't need to come back here later in search of the Craxil but let's face it... you aren't willing to argue with this thing either.  Just stay focused on the goal and avoid unnecessary conflict with anything other than the Craxil.  You cross to the other side and a gate closes behind you.  The beholder gives you a look as if to say \"good-bye\", then turns and moves the other way.  You have no choice but to move foward from here.\n\n ", "action_results": [{"action": "Time To Move Forward", "result": "You are standing on a narrow plateau in the rugged mountainous region beyond your village.  Unlike the brownish/tan rockface you see near your village, the rocks in this region are more redish and vibrant looking.  You see a path leading forward and you decide to follow it.  On the plus side, you haven't encountered any hostile creatures so far.  You walk for at least a few miles and it appears to extend beyond your sight.  You curse at your luck and begin to slump into depression when you realize you don't even know where to fnd this Craxil thing in the first place.  You decide to build a campfire for the night, think things over, and gather some rest.  As you are doing so, a strange man lumbers out from behind a large rock and begins to beg you for help.\n\n \n\"Please, it won't take long.  My caravan was beset upon by foul creatures and I fear for my families safety.  You must help me!\"\n\n \nYou pause.  It seems odd that a human would be up here in such a hostile region, let alone a caravan.  But this is definitely the face of a human and he shows no signs of hostility.\n\n \n\"Why are you up here anyway\"? you ask. \"The Craxil and his followers will kill anyone that wanders into their mountainous territory.\"\n\n \n\"We got lost trying to find our way to Jacquescrappe village, perhaps you've heard of it\"?\n\n \n\"Yeah... I just came from there... but I don't think you want to go back that way, you won't get far.\"\n\n \n\"Look, I don't wish to be rude, but my family is in danger and I need your help NOW!\"  \n\n \nAt this point, the man turns and runs down the path.  You call out to him to stop but he keeps going.  You aren't sure if you would be of much help to him in battle, but you aren't sure how you would feel about abandoning him like that either.  Time to decide...\n\n \n ", "action_results": [{"action": "Ignore The Man, There Is Something Fishy About That Fellow", "result": "You decide to just ignore the man as he runs on ahead.  Part of you feels like an absolute dickhead for doing this, but you sense there is something strange about how a human caravan is operating this far into the Craxil's lands in the first place.  And even if it is true, the man is physically stronger than you are so what kind of help do you honestly think you can provide in a situation that has him scared?  Most importantly of all... your gut tells you there is something fishy about that fellow and you think it best to let him run on ahead.\n\n \nYou wait until he is out of sight, then wait a while longer and continue your jouney.\n\n \n\nAs you continue on your journey you wonder if you made the right choice.  I mean, what if the man's family really was in danger and you could have made a difference?  Did you make the right call?  You console yourself by reminding yourself of the importance of your own mission and how you cannot afford to take unnecessary chances.  Just as you are having these thoughts, you discover the man who approached you earlier as well as four others standing in the middle of the beaten path with their heads down.  It looks like you aren't done with them after all...\n\n \n ", "action_results": [{"action": "What Do They Want?", "result": "The man you just dismissed earlier is standing at the front of the pack.  You knew there was something off about that earlier request and seeing this display only reaffirms that you were right to avoid them in the first place.  They are all looking down at the ground but now he is looking up directly at you with a creepy smile on his face.  \n\n \n\"So, you saw through our little ambush scheme did you?\"  he sneers.\n\n \n\"What is it you want?\"\n\n \n\"Quite simply we're aware of your quest to reach the Craxil and we are not prepared to allow it.\"\n\n \n\nAt this point their heads begin to twist and contort and their skulls appear to come out of their mouths.  It is almost as though they were never human at all but part of some kind of disguise.  In fact, it is now readily apparent that this is the case.  You are now looking at five maniacal looking skeletons armed with an assortment of swords and hand axes.  They seem like they are eager to get things started and in fact, they are all rushing down the beaten path towards you.  You turn the other way until you can decide what to do and despite what you've been told about the undead, you discover they are perfectly capable of keeping pace with you.  \n\n \nYou know you aren't going to be able to take on five of these guys and they seem intent on sticking together during the pursuit.  To your left is another cave you've chosen to pass up on your journey, figuring it was just another humunculus den.  Perhaps, if you are lucky, you can lose your pursuers in there.  Alternatively, you could always try climbing the steep rockface off to your right.  You've had plenty of climbing experience as a kid and somehow you hope these skeletons won't be able to follow you.  You could also turn around and start unloading arrows into your enemies.  They may be keeping pace with you, but you still have a heck of a head start and you'd wager you could release quite a few before they catch up to you.  It's up to you...\n\n \n ", "action_results": [{"action": "Try To Lose Them In The Cave", "result": "The cave is dark, and dark is good given your need for evasion.  You dart forth into the cave hoping not to alert any inhabitants present inside.  You know you have a good headstart on your pursuers so you take the time to quietly move in and survey your surroundings.  Just inside the cave is a half eaten corpse (one of the villagers that was taken from the village a few weeks ago in fact).  The stench is overpowering but you persist down the next passageway and into a large chamber with a multitude of standing rocks.  Another passage off the left wall goes deeper in, but you choose instead to find a hiding place behind one of the standing rocks here.\n\n\n \nFor quite a while you wait, thinking the skeletal warriors that chased you are not going to be coming.  Just as you are about to stand up and leave you see them coming down the corridor.  They fan out and are now scoping out all the possible hiding spots in this room so it won't be long before they find yours.  You look back at the passageway on the left and notice that although they are not up, there are bars in the floor that can be raised to block the passage.  You can only hope that the lever on the wall controls this mechanism.  In a flash you jump up and run towards this passage.  You throw up the lever and step back.  The bars raise in time to stop the other four from getting in, but the lead one who tried to fool you earlier managed to get in before the bars raised and now brandishes his sword at you. \n\n \n\nIn self defense you draw your own sword and prepare to thwart his advance.  He is fast and it takes all your concentration just to block his attacks from hitting you.  Given you are in a close range battle in a part of the cave that may or may not have other inhabitants, you don't really see much use in running.  You figure you are going to have to continue this fight with your sword but another item catches your eye.  Off to the side is a good size rock that would fit easily in the palm of your hand.  Given the opportunity you could try and bash the skeleton in the face with it. \n\n \n ", "action_results": [{"action": "Sword Fight", "result": " \nThere is no time to try newfangled plans, you just need to survive.  You parry his most of its attacks but take several slashes.  Nothing major, but damn if it doesn't hurt and you are losing blood.  You manage to land a blow against his shoulder and it goes halfway through the bone, but that doesn't stop the skeleton from fighting.  In fact, before you can get your sword back out he lands a blow against your shoulder and it deals a lot more damage.  You struggle to keep up with your opponent but you are losing a lot of blood now and this monster is picking up the pace.  In desperation you suddenly drop any pretense of defense and lunge forth at your opponent.  You bring your sword down through several ribs but this does little to phase him and now you are wide open for the final blow.\n\n \nPerhaps this would have gone better if you remembered that bladed weapons are only effective against enemies with flesh and blood.\n\n \nTHE END", "action_results": []}, {"action": "Bash Skeleton With Rock", "result": "You grab the rock you noticed earlier almost immediately, then go back to blocking your opponents attacks.  The enemy is attacking fast and furious and it takes all your concentration to block.  Even so, you only manage to block most of its attacks and take a few slashes.  Nothing major, but you are losing blood.  Eventually you see your opening and you ram the rock into the creature's skull with the full force of your adrenaline infused arm.  You hear a satisfying crack as the front of the skull crumbles and the creature stumbles back.  Realizing how brittle this thing must be, you grab its wrist before it can regain composure and bring the rock down again, taking off its sword arm at the elbow.  Another crack at the spine for good measure and you are confident the creature is dead.  The other four look on angrily and scream but the bars prevent them from doing anything about it, so you decide to move on deeper into the cave in hopes of finding another way out of here.\n\n \nThe cave only gets darker and darker as you go in deeper and you find it odd that there are no other inhabitants in this region... until you see a pair of large white eyes staring back at you from the darkness in the next cavern.  It doesn't appear willing to leave the chamber in pursuit of you, but you cannot return the way you came as the skeletons are still banging on the bars you left behind.  Studying the creatures behavior a little more, you begin to suspect it is a grue.\n\n \n\n \nYou've heard stories of grues from nearly every adventurer you've ever met.  These things are the leading cause of death amongst those in the adventuring profession.  Even higher than dragons, vampires, and Lindsay Lohan.  In fact, while grues are believed to be organic and corporeal, no adventurer has ever actually killed one before.  You struggle to remember what the adventurers told you when dealing with a grue.  It has a certain weakness, but for the life of you you simply cannot remember what that is...  You're going to have to guess.\n\n \n ", "action_results": [{"action": "A Grue's Weakness Is Garlic, I apply It To Myself", "result": " \nOf course!  Garlic!  You still have some garlic powder in your pack that you use to flavor your pork rines.  You douse yourself with it and make a mental note to bathe later so the other monsters don't notice your scent.  You confidently walk into the dark chamber ahead, certain that the grue will flee your garlic stench.  As you confidently strut through the creatures chamber you think to yourself,\n\n \n\"Why can't all my challenges be this....\"\n\n \nYou don't get enough time to finish that thought. \n\n \nYou were eaten by a grue.\n\n \nTHE END", "action_results": []}, {"action": "A Grue's Weakness Is Noise, I Shout Loudly As I Enter", "result": " \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nOf course!  Many creatures are frightened by loud noises, grues must be too!  You march into the chamber singing \"FRIDAY FRIDAY\" as well as \"MY MILKSHAKE BRINGS ALL THE BOYS TO THE YARD...\" certain that this will scare the creature.  Sadly, despite your frightening choice in music, the creature does not appear to be phased.  \n\n \nYou were eaten by a grue.\n\n \nTHE END", "action_results": []}, {"action": "A Grue's Weakness Is It's Reflection, I Hold Up A Reflective Surface As I Enter", "result": " \n\n \nUpon reflection you decide that a mirror would be your best bet against this creature.  Grues are afraid of their reflection right?  You go back and find an old iron shield half buried under dirt.  It is mostly caked with crud and rust, but still operable as a ghetto-esque mirror.  You hold the mirror in the direction of the grue and move along the wall looking for the next passage.  Suddenly you realize the stupidity of your mistake.  It's pitch black down here, how is this thing even gonna see its reflection in the first place?!?  Sadly, you learn all to late that your new concerns are well founded.\n\n \nYou were eaten by a grue.\n\n \nTHE END", "action_results": []}, {"action": "A Grue's Weakness Is Light, I Make A Fire With Some Wood And Tinder", "result": "Grues are afraid of light!  This is why it won't leave its pitch black chamber to pursue me.  Fortunately, you still have some flint and tinder.  You originally brought it with the intention of building a campfire along the journey but things change I guess.  You light a piece of wood and wrap a piece of torn clothing (soaked in cave water) around the middle to help prevent the flames from going to far down near your hands.  You need to move fast as this is not going to last for long and you don't want to be stuck down there without light. \n\n \nAs anticipated, the grue backs away in a feverish effort to avoid the light your flame is generating.  You are pleased to see that the passageway at the end of this chamber has a faint light source at the end (although it is very far away).  Hauling ass as fast as you can, you head down the tunnel towards the light source as your makeshift torch is already beginning to burn itself to completion.  By the time it does, you've already made it close enough to the nearby light source that the grue wouldn't dare follow. \n\n \n\nIt seems the light is being generated by a series of torches that line a set of tracks.  It is then that you realize this cave is not really a cave at all but a mine occupied by numerous kobolds.  You were always raised to believe that kobolds had beards and wore candles on their heads, but seeing them now you realize how ridiculous that claim actually is.  Who came up with that anyway?  In reality, they are like miniture lizard folk and very scrawny too (even by your scrawny standards).  Staying at the edge of the light source, you decide to observe these creatures for a little while before planning a move.  You are reasonably certain you could handle one or possibly even two in a fight but you most certainly can't charge in or you will be overwhelmed in an instant. \n\n \n \n \n \n\n \nOf particular notice is the kobold on the high ledge that is sporting a purple overcoat and barking orders at the laboring kobolds in whatever the hell language these things are speaking.  It occurs to you that these kobolds may very well be working for the Craxil, in which case you would very much like to get your hands on that one in the purple & green coat.  You tire of wandering the mountainside aimlessly, narrowly evading one death after another all the while having no idea where this Craxil actually is.  Perhaps you could find some way of getting to him quietly and making him talk. \n\n \nThere are a few problems with this plan.  For starters, the torches provide plenty of illumination in this region and there are countless kobold laborers that would detect your presence and tear you to shreds if you just went in as things are now.  You entertain the idea of making them chase you back to the grue, but you don't really have enough wood for another makeshift torch.  Even if you were to sneak along the wall on either side, there is still enough light in there to give away your location.  This is going to be tough.\n\n \nYou observe them more and try to formulate some kind of cogent strategy when you notice a kobold has to emerge from a nearby storage chamber to bring wood to the torches.  The storage chamber isn't illuminated and you didn't even notice it was there in the beginning.  That gives you a couple of ideas.  For one, you could hide in the storage chamber until the next kobold comes in to keep the torches going, then kill him quickly.  Once the torches go out, you can head to the head kobold in charge.  Alternatively, you can set the entire room on fire, which would undoubtedly create a diversion.  This plan is risky given that the fire would undoubtedly light the place up quite a bit, but it would also eliminate the tinder they need to light any torches later.\n\n \n ", "action_results": [{"action": "Hide In The Storage Room And Kill The Kobold", "result": "You sneak into the storage room and wait for almost 2 hours before the next kobold comes in.  As soon as he does you plunge your sword into his back and try to silence him by holding his mouth shut with your arm.  He let's out several whining and whimpering noises but nothing that seems to attact alarm.  A few minutes later another kobold walks in, obviously waiting for that tinder and you manage to surprise attack that one as well. \n\n \nUnfortunately this plan isn't working out as well as you had planned.  The torches are still going strong and now a group of three kobolds is heading towards the stock room.  You hide behind the door and manage to kill the first one but the other two draw their weapons and start shouting.  Soon, all the kobolds in the mine are aware of your presence and it isn't long after that that you begin to find yourself overwhelmed.  You have the unique displeasure of being killed an eaten by a large number of creatures that are even weaker than you are.\n\n \nTHE END", "action_results": []}, {"action": "Sneak Into Storage Room And Set Fire To Their Supply Of Tinder", "result": "There is no point in hiding in the storage room as they may very well send more kobolds in to retrieve the tinder.  Instead, you are going to set it all ablaze.  Even if the distraction doesn't work well enough for you, it will only be a matter of time before the quell the fire and run out of tinder for their torch basins.  You sneak in start a fire using their own flint and tinder.  Soon this fire spreads to the rest of the tinder in the room (with your help of course) and you quickly find your way out of there and out of sight before the kobolds are aware of what has transpired.\n\n \n\nIt isn't long before they take notice and flock over to their storage room.  The taskmaster kobold keeps jumping around shouting \"yip yip\" or whatever the hell these things say and the other kobolds are struggling to stop the fire.  You manage to slip around the corner and evade the bulk of them and you think you've found the passageway leading up towards the taskmaster kobold.  In fact, you have.  There's just one small problem.  There are two kobolds guarding the taskmaster and you would be foolish to assume the taskmaster is unarmed so that makes three.  At present, the taskmaster is clearly focused on the fire, to the point of ignoring all else, but the two guardian kobolds are still vigilant.  You're going to need another plan.\n\n \nYou consider using your bow again.  You are actually pretty close to the bodyguard kobolds yet still veiled in darkness so you would not likely miss from this range.  Of course, with one dead you would have to immediately focus on the other and subdue the taskmaster all in quick succession lest the entire colony become aware of your attack.  Another, possibly crazier idea is to just run past the guards before they mentally register your presence, grab the taskmaster, jump from the ledge, and just run.  The fall may be considerable for a kobold, but you are sure that as a human you can handle it. \n\n \n ", "action_results": [{"action": "Use Your Bow To Take Out The Guardians Quickly, Then Subdue The Taskmaster", "result": "You are going to take advantage of the short range and the distraction you created to shoot down your target's guardians and then grabbing the target himself.  You don't want to just grab him and run as you have no secluded place in mind in which to take him and you certainly don't want to alert the rest of the colony.  It is decided then, you are going to have to use the element of surprise once again and make a risky move.\n\n \nYou draw your bow and notch an arrow in the drawstring.  The nearest kobold is so very close.  You aim at his head and for the first time in your life the arrow actually goes where it is supposed to.  The other bodyguard is so in shock at the sight of this that by the time it registers what is going on you already have another arrow drawn back and ready to go.  He turns to run towards his taskmaster and you put one between his shoulderblades.  Its only at this time that the taskmaster turns around and sees what has transpired.  He starts shouting more of his \"yip yip\" nonsense but given that he had been doing that already since the fire started the other kobolds don't seem to notice anything out of the ordinary. \n\n \nYou grab him and pull him back into the passage before the ledge, tear the purple cloth that makes his coat, bind his wrists, and search him thoroughly for any weapons.  The creature looks at you in complete fear and for the first time you are truly taken back by the kind of things you are capable of.  After all, you've just been an underappreciated swineherd your whole life.  And a scrawny one to boot (ok, so you're still scrawny, but that's beside the point).  I guess survival and stress can make people do some pretty crazy things huh?\n\n \nYou draw your sword and let the kobold know that if he makes any unnecessary noise he'd quickly regret it.  Like most leaders, he's bold in words and all coward at heart.  You decide its time to begin.\n\n \n\"Tell me what you know about the Craxil\" you demand.  You're clearly not used to being in such a position of dominance or control but damn if you're gonna let the kobold know that.\n\n \n\"Yip, ok.  The Craxil is the organizer, the one that unifed the scattered beastmen thoughout this region of the barren mountain range.\"\n\n \n\"Why did the Craxil do this?  What does it hope to accomplish?\"\n\n \n\"eee.  The Craxil wants to provide for the beastmen it does!  No likes hoominz that take all nice land and push us back into barren lands yip.  Craxil wants some good lands too yip.  Takes them from hoominz he will.  You'll see\"\n\n \nYou shove your sword under his neck as if to somehow counter his claim.  \"What manner of creature is this Craxil you demand.\"  \n\n \n\"Yip.  Nobody knows, least not us kobolds anyway.  We's gets our orderss from the riders we does\"\n\n \n\"Riders?\"\n\n \n\"Yip, humans that serve the Craxil.  Well, at least they used to be human.  Now... not anymore\"\n\n \n\"The Craxil raised them as undead?!?\"\n\n \n\"Yip noes, the Craxil does not perform such foul practices.  The Craxil is noble to us beasties he is.  No, the Craxil spends days performing the ritual to break their mind and make them thralls.\"\n\n \nThis last part terrifies you.  You know mindflayers are capable of turning humans into thralls, but they can do so instantly.  They don't require days and a ritual to do so.  Clearly, this Craxil is indeed a creature unlike any other.  You can hear the sound of kobold laborers gradually getting closer so you take the last bit of time you have to ask the most important question.\n\n \n\"Where can I find the Craxil?\"\n\n \n\"Yip!  He resides in an underground cavern accessed from the bottom of a vast canyon up north yip.  Best way is Redridge Pass.  Rocks will be red they wills and cactii too.  Use mine shaft at end of mine that way, it takes you close.  Now let's me go yip!\" \n\n \nThe voices are drawing closer and you don't have time for any further answers.  You decide to execute your prisoner and stash the body so you can sneak out to the passageway without alerting the rest of the kobold colony.", "action_results": [{"action": "Continue Sneaking To The Mine Shaft", "result": " \nThe kobolds are not alerted to your presence yet; and with most of them trying to contain the fire you started, there aren't very many standing between you and the mine shaft.  You continue down along the tracks in the passageway.  There are multiple passages and mining spots on both sides and even some ladders leading deeper into the ground but you follow the tracks straight as told until you reach the end of the passage.  A single ladder leads up, very far up in fact.  You are beginning to develop a fear of heights just looking at how high you are gonna have to climb and given that kobolds built this place you have serious reservations about how well the ladder is gonna support your weight. \n\n \nBut what choice do you have?  The skeletons and grue you left behind will certainly make it difficult to leave this place the way you came and it won't be long before the kobolds discover the bodies.  You set about climbing the ladder and waste no more time thinking about it.  You just do it.  The ladder reaches higher and higher and higher and looking down you are soon aware of just how extensive these mining tunnels are.  Still, your curiosity about kobold mining practices will have to wait.  You've got a Craxil to kill and a village to save.  Finally, you reach the top and fling open the hatch.\n\n \n ", "action_results": [{"action": "Move On With The Quest", "result": "You are glad to have put that unplesant ordeal behind you and now head forth in search of the Redridge Pass.  You are finally beginning to see cactii, which pleases you greatly, and the dirt/rocks are still red.  You get the sense that you must be close so this Redridge Pass is going to have to be somewhere nearby or up ahead.  You shudder when you realize there are rarely ever any formal signs in beastmen controlled territories so how will you know this pass when you get to it?\n\n \n\nAs you ponder these thoughts you notice a small hut up ahead, along your path.  Smoke rising from a brick chimney tells you someone is home though you cannot imagine what civilized being could possibly live so deep within the Craxil's territory.  How would such a person get supplies?  How would such a person survive out here with all the hostile creatures roaming about?  Perhaps this person isn't a person at all but a hostile creature himself that for whatever reason favors the abode of humans?  \n\n \nDespite the fact that it is still daytime, you decide to creep up and look in the window to see who is inside.  All you see is a homely old man with a beard eating plumpdinberry pie in his rocking chair.  An illusion you question?  Or perhaps your time out here in the Craxil's territory has made you jaded.  After some internal debate, you decide to go in.  You've been awake for two and a half days now and eaten nothing but the pork rines you brought with you (which you are nearly depleted on).  At this rate, you won't be able to put up much of a fight at all, even if you do get to the Craxil.  Besides, he might know something about the Craxil or the Redrange Pass and you can't afford to be wandering around aimlessly throughout the Craxil's domain.\n\n \nYou go back around to the front door and before you even knock the door opens...\n\n \n ", "action_results": [{"action": "Dun Dun Duuuuuuunnnnnnnnn!!!!!!!!!", "result": " \nThe door opens and the old man is standing there, looking at you expectantly.  He is at least two feet taller than you but looks frail in his old age.  He invites you in and you go in, though cautiously.  The inside of his home looks pretty much like you would expect for a man of his age.  A tad messy, but plenty of paintings of his family and the all too familiar old people smell.  He beckons you to join him for dinner and nervously you do so. \n\n \nThe food is tremendous though in all fairness, its been quite a while since you have had anything but the pork rines you brought with you.  He fills your pack with fruits and breads and now you are starting to feel guilty about it all.  This guy seems genuinely nice and you feel your guard beginning to drop, but still...you have to ask...\n\n \n\"Why do you live out here sir?  This is deep within the Craxil's territory and extraordinarily dangerous.\"\n\n \n\"I've lived her since before the Craxil established itself.  I'm pretty out of the way for their usual operations so they don't usually pay me much mind.  Besides, I'm old.  If they find me and its my time then so be it.\"\n\n \nYou're taken back by this strange answer but you accept it and ask further...\n\n \n\"If you've been here all this time, that must make you something of a hermit.  Still, you ought know something about the Craxil right?\"\n\n \n\"Yes, I suppose I am something of a hermit, but only because the visions I have make people suspect I'm crazy.  Still, I've sensed the Craxil in my dreams and I know it is capable of having such visions as well.  That is how it is aware of you and your plans.\"\n\n \n\"WHAT?!\" you exclaim.  You've always relied upon stealth and the element of surprise to make up for the drastic difference in power between you and your adversaries.  If the Craxil is aware of you and your plans, how are you going to pull this off?\n\n \n\"Indeed, the Craxil knows what you hope to do.  But don't dispair yet, as I've seen a good deal of cleverness in you and even if it knows your coming it doesn't know when.\n\n \nSomehow that last statement doesn't offer you much consolation but after coming as far as you have you don't really see that you have any other choice than to stay the course.  After a filling dinner you lie down on a mat and get the best sleep you've had in a long time.  During this nap, you are visited by a strange dream...\n\n \n ", "action_results": [{"action": "Strange Dream", "result": " \nYou saw a soft mist of white and purple against a pitch black surrounding.  You could sense there was something or someone in the room with you but you could not see who it was.  You could not sense whether or not it was good or evil, kind or malevolent, all you could sense was its presence.  It hits you that this presence is the Craxil, and it is watching you intently as you stumble around in the darkness. \n\n \n \n \n \n \n\nYou sense one more presence, one which you are very familiar.  It's your sister!  You see her only breifly before her likeness disappears back into the darkness.  You sense fear followed by supplication coming from her.  You are now moving faster through the darness, stumbling over rocks and nearly twisting your ankles on rivets in the ground.  But no matter how quickly you move you cannot get a visual on either your sister or the Craxil, you only sense their presence. \n\n \nYou wake up sweating feverishly.  \"That was quite a dream you had young man\" the old man starts.  \"You were shouting so loud I thought you were losing it.  And here people thought I was crazy...\"\n\n \nYou aren't really sure what to make of this dream.  Was it a vision or just a nightmare?  Was the Craxil really watching you the whole time?  And what of your sister?  You last saw her being drug off by humunculi so you assumed she was dead.  Could she still be alive somehow?  She looked a lot different in that dream too.  Not the shy, reserved younger sister you knew but rather a fierce looking warrior in battle garb.  The hell is that about?  Your dream seemed so vivid you can't help wondering if it was a vision, but your logical mind tells you that the power of suggestion is at work here and its all bullocks.\n\n \nFeeling full, refreshed, and well stocked on supplies you thank the old hermit for everything and really appreciate what he's done for you.  He tells you that the Redrange Pass is just over the peak to the northwest of his hut and you immediately see what he's talking about.  Its still a long way from the pass to the canyon, but you have a very clear idea of where you are going now.  Once you get to the Redrange Pass you just follow it northwest of your current position and it will EVENTUALLY lead you straight to the canyon, which you're told is hard to miss.\n\n \n\"Good luck young man, I'm rooting for you\".\n\n \n\"Thank you sir, and again I appreciate it.\"\n\n \nNice guy.  He's the first to address you as something other than \"pencil arms\", \"scrawny one\", \"bone boy\", or the like.  You head out towards the peak and begin the lengthy climb upwards.\n\n \n ", "action_results": [{"action": "Up The Peak", "result": "You climb the peak and though it takes a considerable amount of time to get to the top, it isn't nearly as tiring as you expected it would be.  You are now standing on an even higher plateau on the mountainside and the Redridge Pass is precisely where you expected it to be.  You are thrilled to have finally found the pass, which is really more of a trail than a pass, but you still have a lot further to go.  As you move forward you suddenly get wind of a foul stench and hear a lot of loud, obnoxious grunting noises up ahead.\n\n \nYou immediately get off the beaten path and find a good hiding spot.  It is midday now so there isn't a lot of darkness to aid you.  Still, you manage to crawl forward unseen until you see a small group of orcs.  This is VERY not good you think you yourself.  Orcs are exceptionally strong.  Even one on one you stand no real chance of defeating one.  There are about five blocking the path forward so you are going to simply have to sneak around them and continue on your journey.  You've interrogated lesser creatures, but if the Craxil is commanding these creatures then just how strong is the thing?  No, don't dwell on such thoughts.  You need to focus.  You've come this far and you're sure as hell not gonna let yourself be intimidated now.\n\n \nReturning to the task at hand you see a couple of different options.  There is a river that runs down the middle of the orc group's position and some hollow reeds close to you.  You remember one time during capture the flag where you moved through the river underwater and breathed through reeds very similar to these.  That was an epic maneuver worth remembering, perhaps it will serve you again here?  The orc camp and you are at the same elevation; but there is a ditch that runs from your current position, along the side of the camp, and out the other side.  Presumably, if you hug the side of the ditch closest to the orcs and move along quietly they shouldn't be able to see you.  Alternatively, you still have plenty of poison.  Even if you applied it to all your remaining arrows, you wouldn't even have used half the bottle.  Orcs are large and there are only five of them... \n\n \nTime for a decision.  What's your plan of action?\n\n \n ", "action_results": [{"action": "Breathe Through Reeds And Move Slowly Underwater To The Other Side", "result": "Of course!  The reeds will enable you to breath from underwater.  The river water is opaque so you will not be seen and because orcs have an exceptional sense of smell, this is probably the safest way to get past them without being seen.  You quietly slip into the river water from a point that can't be seen by the orcs, get one of the hollow reeds to act as a snorkel, and slowly begin moving through the water.  You intend to move slowly, so that if any of the orcs do notice the moving reed it will look like it is just drifting downriver.\n\n \nThe idea is working.  You can hardly see where you are going, but you got a very good look at where the river goes and the approximate distances before you got in so you have a pretty good estimate of where you are.  Soon, you can hear the orcs talking and you know you must be in the middle of them now.  As fate would have it, a snapping turtle decides to be a pain in the ass (literally) but despite the pain this hissing bastard is inflicting you manage to keep your cool and continue moving slowly through the river.  Eventually you, make it to the other side and emerge out of the orc's view.  You pat yourself on the back for that one, this maneuver is definitely one of your favorites.\n\n \nJust then the hissing bastard that bit your ass makes it known that he's still attached by tighting his bite and inflicting more pain.  You put a drop of the poison in his mouth and within moments he's off of you and squirming on the ground.  Looks like this stuff Brandolf gave you is legit after all.  You massage your sore bottom and try to walk it off.  There is a welt on your right butt cheek that still stings but you figure you will eventually get over it.\n\n \n ", "action_results": [{"action": "Get Over It And Get On With The Quest", "result": "You rejoin the Redridge Pass and continue northwest towards the canyon you hope to find.  You hear a shuffling noise and you could have sworn that the vines stemming from that rather bizarre looking cactus just moved.  Nah, just a vine on the ground... from a cactus... on a mostly dry and rocky mountainside... makes perfect sense.  You continue to rationalize this in your head as you walk along only to notice a similar movement from another cactii vine up ahead of you.  Suddenly you feel one of these vines wrap itself around your left ankle and sting you.\n\n \n\nYou pull and draw your sword but other vines have taken up the call as well and you are getting grabbed and stung all over.  You still have limited movement with your limbs, but you are out of balance.  The stingers must have injected you with something because you are feeling nausious.  You need to focus and get out of this mess before you black out or you might not wake up.  You look over at the cactii these vines are coming from and they have inexplicably moved closer to your position.  Very close in fact.  The needles jutting out from them seem to have perked up and gotten longer.  Whatever these things are, they've got you and you aren't about to become their prey.\n\n \nYou are still able to reach your sword, but with vines slowing your arm and your lack of balance you aren't sure you will be able to sever the thick vines that are holding you in place.  You could always apply some poison to it first, but just reaching the poison is going to be a challenge as you've stored that in your backpack.  You still have flint in your front pocket and a few pieces of tinder left, perhaps if you can get a small fire going you can push them back.  Whatever you do though, it has to be quick.  You can feel the venom from the many stingers affecting your mind and it is taking all your discipline to maintain your focus right now.\n\n \n ", "action_results": [{"action": "Just Draw Your Sword And Try To Cut Through The Vines", "result": "It would take too much time and energy just to reach the backpack and rumage through it for the venom right now, and you need all the time and energy you have to try and free yourself from this trap you seem to have landed in.  You are able to reach your shortsword within a short while and begin raising it against the vine holding your left arm.  You bring it down as hard as you can, but with the vine holding your right arm and the others keeping you off balance, you don't cause nearly as much damage as you would like to.  The same happens when you try again.\n\n \nYou decide to start using your sword like a saw instead, running the edge of the blade back and forth against a singular point on the vine holding your left arm.  It takes a while but you are about halfway through the vine when it suddenly responds.  The vine recoils abit so that the part you were working on is now out of your reach.  You are greatly disheartened by this, but set to work on it again in a new spot.  The creature's vine responds the same way again and by now the venom has clouded your mind so much you are barely able to maintain your conciousness.  You realize now that it is over.  You have no idea what they did after you blacked out, because you never woke up again.\n\n \nTHE END", "action_results": []}, {"action": "Apply The Poison First, Then Cut At The Vines", "result": "You aren't sure if you will be able to completely sever the vines that hold you, but if you can at least cut into them, the poison should do the rest.  Unfortunately, it is stored in your pack which is a little difficult to reach right now, but that isn't going to stop you from trying now is it?  You pull your right hand back and the vine that holds it pulls back.  Somehow, you think it might realize you are trying to get something and it seeks to keep your arm out front.  You continue to pull against it with all your might but you reach a stalemate with the vine just getting your arm to your side. \n\n \nThe venom is starting to really kick in now.  In addition to being nausious you are now dizzying as well.  The only thing keeping you going is your sheer determination to live.  You bite and claw at the vine, you squirm, you fight, and eventually you get your arm back to your pack.  You are feeling light headed and you know you don't have much time.  You manage to get the vile of venom out of your backpack but in your situation that struggle took too much time and energy.  You no longer have the energy and wherewithall to apply it.  You black out and the vile falls uselessly to the ground.  You don't know what they did after that, because you never woke up again.\n\n \nTHE END", "action_results": []}, {"action": "Light A Piece Of Tinder And Wield The Flame As A Weapon", "result": "You need to get out of this mess as quickly as you can.  The vines are thick, you are off balance, your arms are partially restrained, and you don't have much time.  You reason that in this situation your best bet is to start a fire and try to use it against the vines.  You lean forward and allow the flint and tinder to fall from you and onto the ground.  After a short struggle, you manage to get your hands on them and work feverishly to start a fire.  You worry that lighting the tinder on fire will make it difficult to hold against your enemies without burning yourself but you do it anyway and wrap a thick piece of cloth torn from your shirt around your hand before doing so for rudimentary protection. \n\n \n\nIt hurts, but not to the point of burning you thanks to the cloth material  and you are far more concerned about survival.  You hold the fire up close to the vine holding your left arm and it releases and recoils almost immediately.  The others follow suit pretty quick, which is good as this tinder won't last much longer before it is burned to completion.  You hold out what's left of it to keep these cactii away and rush away. \n\n \nYou've managed to get away, but the venom in your system is already screwing with your head and you don't think you will get much further before blacking out.  You go to the nearest area you can find without any cactii around and collapse on a large rock.  You don't awaken again until nightfall, but at least you have your mind and focus back, and you are glad you weren't attacked while you were out.  However, it isn't long after you awaken that you get a sickening feeling in the pit of your stomach.\n\n \n ", "action_results": [{"action": "Uh-Oh, What Is This?", "result": "The bad feeling in the pit of your stomach returns and you realize that eating all those pork rines and only pork rines for several days until seeing the old man did not do your digestive system any good.  You spring into action, find a secluded corner, and relieve the mess that was building up inside you.  Unfortunately, it is not until after this messy endeaver that you remember you neglected to pack bottom tissue when you left on this quest.  You've braved many dangers and survived several impossible situations but now you are going to have to make a decision.  A decision that is more frightening than any you have made before. \n\n \n \nTo your left are large, round, orange leaves.  They aren't brittle and look as though they might work.  To your right are a bunch of ferns sporting three fingered leaves.  These are green with red spots.  It's time to make an all important decision.\n\n \n \n ", "action_results": [{"action": "Wipe With The Large, Round, Orange Leaves", "result": " \nYou choose to wipe with the large, round, orange leaves and you find them quite well suited for the task.  With your keister sanitized you have now averted another dangerous situation and decide to continue on with your quest. \n\n \nThe next three days of travel down the Redridge Pass are surprisingly uneventful.  You sneak past the occasional orc patrol and wild animal but nothing particularly difficult.  You half expect something to come jumping out at you from the darkness or to find some large camp around the corner but to your plesant surprise the way seems more or less clear.  Part of you wonders if it is a trap given the Craxil knows you are coming but then ... what choice do you have?\n\n \nAs you come up a steep incline you look down and with great satisfaction you find what you've been searching for all this time.  A colossal chasm, the canyon you've been searching for!  The old man said you would know it when you see it and damn if he wasn't right about that!  Still, this canyon is freaking huge.  It will take probably half a day just to get down to the bottom safely and once down there, there is a LOT to explore.  You know the underground cavern that houses the Craxil is accessed somewhere down there, so I guess you don't have much choice than to go down there and investigate huh?\n\n \nYou are about to cautiously decend when you hear the sound of hoofprints behind you...\n\n \n ", "action_results": [{"action": "Turn Around", "result": " \nYou turn around to confront the source of the hoofprint noise and you see two humans on horseback.  Their eyes appear to be in a glaze and they are looking right at you.  Thing is, you recognize these two.  They were farmhands that were captured a few weeks back.  Everyone assumed they were eaten like most of the people who are taken.  For some reason the Craxil must have decided to make them thralls and this is abundantly clear in their appearance.  These must be some of the \"riders\" you've heard about.\n\n \nThey both hop down from their horses and draw swords.  Given you were already standing at the edge of the canyon when they showed up, you don't have a lot of room to maneuver.  You know that before they became thralls they didn't really possess much fighting skill, but you have no idea now.  You don't have much time to decide what to do here.\n\n \nThere is a small gap between the two of them and they are widening it in an attempt to come at you from both sides.  Perhaps you should bolt between them and try to get away.  Alternatively, there is a branch sticking out of the wall of the canyon not far below you.  You could jump down to it and try to climb down the wall of the canyon to a safer ledge.  Either way, you need to get away from these two.\n\n \n ", "action_results": [{"action": "Run Between Them", "result": " \nYou make a break for it and dash between them.  You catch an unpleasant slash across the right hip and it is bleeding but you are still alive and running and that's what counts.  You contine down the Redridge Pass, determined to lose them and double back somehow.  Its only when you hear the hoofprints getting closer that you realize the tactical error you've just made.  The horseback riders quickly catch up to you and one of them puts his sword into the back of your head as he rides by. \n\n \nTHE END", "action_results": []}, {"action": "Jump To Branch And Climb Down", "result": "You aren't going to be able to outrun them if they have horses so you take the only option you got and jump.  You are scared out of your mind but you successfully grapple the hanging branch and the two riders can do nothing but glare down at you and growl.  The tricky part is getting down from here.  You have never really been afraid of heights but you are REALLY high up.  The nearest ledge is almost halfway down the canyon and the rockface isn't easily climbable.  Still, you don't have much of a choice so you try anyway.\n\n \nYou make it most of the way down until one of the groves you were holding onto comes out and you fall.  Thankfully, you land on the ledge and you were already most of the way there so aside from knocking the wind out of you and hurting like hell you are pretty much alright.  Its possible you might have a broken rib but you have no way of knowing and it isn't precluding you from going on even if it is broken.  After taking time to recover a bit and catch your breath, you look around a bit and find a clear way to climb down to the bottom of the canyon and downward you go.  Fortunately, you make it to the bottom of the canyon without further incident.\n\n \n\nYou have now reached the bottom of the canyon and you know the entrance to the Craxil's chasm must be around here somewhere, but it is a massive canyon to explore.  You spent almost 7 hours down there until you come across three bizarre looking doors.  One is red and bears the emblem of a bear.  The next is green and bears the emblem of a spider.  The last is blue and bears the emblem of a wolf.  This whole ritual gets even more bizarre when you notice a rabbit approach and stand beside the red door as if to beckon you in that way.  A squirrel approaches the green\ndoor and stands atop the frame as if to endorse that one, and an owl flies down to a rock near the blue door.  Its times like these you wish you were a druid so you could better understand what the hell these critters are trying to tell you.  Still, you have a decision to make and your instincts (whatever they are worth) are telling you that you only get one shot at this.\n\n \n \n \n \n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n~Hint:  Depending upon the path you took to get here, you may or may not have seen one or both of the creatures on the correct door already.  If not, you are just going to have to guess.~\n\n \n \n \n ", "action_results": [{"action": "Enter The Red Door With Bear Emblem, Endorsed By The Bunny", "result": " \nWho can resist a cute widdle fluffy wuffy bunny hmm?  You open the red door with the bear emblem and as soon as you enter, the door slams shut and locks behind you.  It looks like you really don't have much of a choice but to continue down this passageway.  At the end is a large, circular chamber with numerous torches illuminating the entire chamber.  You are trying to decide which of two passageways to proceed down until you notice two bears, one coming out of each passage.  They lock eyes on you and give chase almost immediately.  You turn and run back to the door you entered from but it won't budge.  It seems you've made the wrong decision, and now the bears are eviscorating your midsection. \n\n \nTHE END", "action_results": []}, {"action": "Enter The Green Door With Spider Emblem, Endorsed By The Squirrel", "result": " \nYou choose the green door with the spider emblem, endorsed by the squirrel.  After all, what is more trustworthy than a cute little squirrel?  You enter and immediately thereafter the door slams shut behind you and locks in place.  It seems you haven't much of a choice but to move forward down the passageway.  It is exceptionally dark down here, but given that you are a sneak that is actually a good thing.  You suddenly find yourself stuck and after fidgeting around for a while you come to the sudden realization what it is that has trapped you and why the door has a spider emblem on it.  It seems you aren't the only one that enjoys sneaking around in the dark...\n\n \nTHE END", "action_results": []}, {"action": "Enter The Blue Door With Wolf Emblem, Endorsed By The Owl", "result": "After careful consideration, you trust the owl and enter the door with the wolf emblem.  The door shuts and locks behind you and you see no choice but to move forward.  An eery glow beckons you forward down a passageway that is leading you deeper and deeper underground.  You can't tell if that is a good thing or a bad thing but you follow it anyway.  When you reach the bottom you see a large room decorated to look like the antechamber of a church.  You aren't sure what to make of all this, but you feel like you must be getting close to the Craxil now.\n\n \n\nThe next chamber is substantially different than the one you just entered from.  Instead of being all decorated and kept, you see half eaten farm animals in a pen and three large lizardfolk guarding a doorway.  They bear polearms and plate mail and you don't think you would be able to take even one of them in combat.  The blue door has shut behind you and you don't really see any reliable means of setting a trap.  You have dealt with these types of situations before though.  You just have to keep your cool and figure a way to deal with this.\n\n \nFor one, you could start a fire in the antichamber to distract the lizardfolk from the door, then slink in.  The antichamber is big, but a fire large enough to attract their attention might also illuminate most of the room, making it hard for you to operate unseen.  Another possibility is their food source.  You surmise the half eaten farm animals are what they've been feeding on during their meal breaks.  You could try using some of the poison Brandolf gave you on some of the meat of the freshest looking animal and wait until they feed again.  Of course, there is no telling how long you will have to wait for them to feed again.  Your call adventurer.\n\n \n ", "action_results": [{"action": "Start A Fire To Distract The Lizard Folk", "result": "You don't have any tinder left after that incident with the cactii, but you do have some flint.  You look around the large antichamber-like room for anything wooden and you find a few things that look like they might be combustable.  You set about lighting them with the flint, then quickly cast them in the direction of a large wooden table in the center of the room and run to the corner just before the room with the lizardfolk.  As you had hoped, two of the lizard folk eventually come out and because you are hiding in their blindspot, they don't see you.  The creatures rush over to quell the fire as best they can but there is a problem.\n\n \nOnly two of the lizardfolk emerged to deal with this threat.  The third one still stands guard at the door.  Lizardfolk are known for their fierce dedication to their duty and unfortunately it seems they are also smarter than the majority of your adversaries as well.  After quelling the fire the two begin searching the room, leaving no stone unturned so-to-speak.  They must suspect that it was caused by someone.  You move around from one dark hiding spot to another, hoping to evade their search until they retire back to the door but you step down on the charred remains of the table and an audible crunch is heard.  \n\n \n\nTo your credit, you kept them searching for a long time due to your skill at evasion but given that you just removed any and all doubt about your presence, it was only a matter of time before they found you.\n\n \nTHE END\n\n \n ", "action_results": []}, {"action": "Poison Their Food Supply And Wait For Them To Feed Again", "result": " \n \nBrandolf gave you more than enough poison to kill the Craxil.  It takes only trace amounts to kill even the largest of creatures so why would you need to save the entire vial?  You carefully creep up and apply poison to various parts of the bovine flesh, particularly the meaty parts, and take care to poison all the carcasses in the pen so you don't have to try and guess which ones they will feed off next.  You then back away to the antichamber-like room and begin waiting the long wait.\n\n \nIt is almost 7 hours later and only now do the lizardfolk appear to be conversing with each other and gravitating towards the food pen.  \"About damn time\" you think to yourself, eagerly waiting for them to begin eating as you watch them from a dark corner in the next room.  You struggle to contain your glee as the first one sinks his teeth into the freshest cow and another picks up a smaller animal you also poisoned.  Before long, they are all dry heaving and you are doing a silent victory dance in the darkness.  For some reason it took a while for one of them to finally die, but when he did the way to the door was clear. \n\n \nCrossing through the doorway and into the underground chasm, you come to realize the Craxil is NOTHING like what you had expected...\n\n \n ", "action_results": [{"action": "The Craxil", "result": " \nThe Craxil is nothing like what you were expecting.  You are standing in a massive underground cavern that extends as far as the eye can see in all directions (except the one you came from).  Running across it is an underwater stream and floating above it is a beautiful woman bathed in pure white light.  It almost appears to leave an after image of itself behind as it moves.   You aren't really sure if you would categorize this as a ghost or spirit or what, but you remember that it is a supposed to be a creature unlike anything since discovered. \n\n \nAlmost as if reading your mind the Craxil remarks \"Indeed... I am not like any other creature your kind has ever seen before, but then I believe I have already told you that haven't I?\"\n\n \nTo your shock and horror she transforms into the likeness of Brandolf the Bray, the mage who visited you in the village of Jacquescrappe, then into the old man who watched over you as you slept.  Was it really the Craxil all along?!?  Is this why you had that dream that it was watching you the entire time?!?  What does this mean for your sister, is she still alive?  And what of the poison?  Surely she wouldn't give you something that would actually work on her. \n\n \nSensing the millions of questions that flurry through your mind, the Craxil begins to laugh and float about you in circles.  The door once guarded by lizardfolk now slams shut and locks on its own.  With this door shut, there is no longer any light and the Craxil itself is the only thing left that you can actually see.\n\n \n\"I can take whatever form I please swineherd, and I have been watching you in various forms throughout the entirety of your journey.  You fancy yourself the king of sneak yet you were clearly unaware that you were being watched the moment you entered my territory.\"\n\n \nYour face grows pale and you have no idea how you are going to deal with this being.  She knows all your secrets.  She knows your plan.  You haven't any element of surprise whatsoever.  Hell, you aren't even sure if your weapons are going to work and you're sure as hell certain the poison isn't going to be effective given that it was her that gave it to you.  Your mind races to discern a proper course of action as she continues to toy with you.  However, your concentration is broken when another figure enters your view...\n\n \n ", "action_results": [{"action": "The Other Figure", "result": "You turn to find your sister, dressed in one of the war garbs you saw in your dream, walk out towards you from the shadows.  She doesn't look as glossy-eyed as the other riders you encountered (in fact she looks perfectly normal) but from her demeanor and obvious reverence to the Craxil you know she is in fact a thrall.  How can this be?  This is the same war garb from the dream!  But your sister has never been like that.\n\n \n\"We have big plans for her\" the Craxil coes.  \"She is the carrier of a great plague, a slower acting yet more contagious version of what you carry in that vial I gave you.  As a carrier she will be immune to its effects, but she will spread them among the humans whereever she goes.\"\n\n \n\"Why?!?  Why would you do something like that you sick bitch?!?\"\n\n \nThe Craxil only laughs at your insult and seems to take delight in your obvious fear and frustration at this moment.\n\n \n\"With the surrounding kingdoms of Mihtana and Lima buckling from the plague, there will be little resistance when we move out of the mountain range and into their lands.  As you may have noticed on the way here, I have many humunculi, goblins, grippli, kobolds, and even a handful of orcs all gathered here in these mountains.\"\n\n \n\"So you really are planning an invasion then?\"\n\n \n\"I believe that poor servant you so ruthlessly interrogated several days ago already explained that much to you.\"\n\n \nYou struggle not to be blinded by your anger at this point, but there is nothing you can do to stop her.  \n\n \n\"The humans are a truly repugnant race.  They have no respect for those that labor, those that produce, those that sacrifice for the good of others.  Whenever they want something (be it money, power, or respect) they simply take it for themselves, and only those who do are respected.  This is why the beastfolk I serve have been pushed deep into this barren mountainside.\"\n\n \nTo your astonishment, you actually find yourself identifying with the Craxil.  Even when you agreed to stick your neck out on their behalf they snickered comments about your intelligence under their breath.  Even now, after all the dangers you've faced, you're sure they have probably already assumed you're dead and are likely redistributing your property as we speak.\n\n \n\"The beastfolk here are loyal to me and to themselves, they have honor.  And they certainly deserve the lands of their ancestors, taken from them by the humans.\" \n\n \n\"And you think slaughtering humans is the answer?\"\n\n \n\"Since when has diplomacy not ended with a beastman's head on a human's table?  Since when did the humans ever sit down to negotiate with my brethren?  The humans understand only the simplicity of death and destruction so that is what we will bring to them.\"\n\n \nYou know this is morally reprehensible, but from a purely stoic and logical standpoint you can understand the rationale behind the Craxil's argument.  You wonder if peace between humans and the beastmen really is possible.  Since the beginning of time, beastmen have always preyed on humans and humans have always responded with military force on their camps.  Perhaps there really is no better way to advance their position right now but you cannot stomach the loss of life that would come with it.  \n\n \n\"My beast brothers have every right to be happy, and so they shall.  They humans will be brought to the breaking point with this plague and the forces I gathered will retake the lands they deserve.  But I am not without understanding.  I can see you have an open mind and have considered my position.  You were wondering if peace between human and beast is possible.  It is a noble but impractical thing.  If you were to join us, I could make you powerful...\"\n\n \nYou think to yourself \"damn, does this Craxil thing read my mind too?\"  Still, it is a tempting offer.  You have always toiled as a swineherd, providing the ever popular hams and bacon that are so popular at festivals and weddings and even fed those without homes, yet you've always been looked down upon as a swineherd by those who have probably never worked a day in their lives.  You've seen girls you had feelings for go for men who were of \"higher social standing\" than yourself.  You've always wanted respect, maybe even a little money or even power.  You think about what the Craxil said, about how only those who TAKE it can ever HAVE it, and upon reflection you must admit it makes sense.  But the Craxil's plan would involve massive loss of life and you are unsure if you want that on your hands.\n\n \n\"Your sister did not understand the situation as well as you and I, so I had to make her a thrall.  When the acquisition is finished, I will return her to you... but only if you join me and help spread this plague throughout the human lands.\"\n\n \nThe Craxil, now clearly curious about all the thoughts running through your head, moves closer until her face is less than a foot away from your own.  \"Well human, how do you respond?\"\n\n \n ", "action_results": [{"action": "I Will Join You, And Seize The Respect And Power I Deserve", "result": "The humans of Mihtana refused to send aid to the villagers of Jacquescrappe (even when people were dying) because it didn't suit their political or military interests.  The villagers practically elected you for this quest without even asking you if you wanted to, then mocked your intelligence when you accepted on their behalf.  You're sick of being looked down upon as a low class swineherd despite all the hard work you've done to provide for your community.  All of that is about to change. \n\n \nYou proclaim your allegiance to the Craxil and to your astonishment she is actually overjoyed.  Seems she needs as many people as possible to help spread the plague and your sister is the only thrall that doesn't look like an obvious thrall.  Your voluntary support to the Craxil's plan is well recognized.  You and your sister are made to be carriers of the great plague.  When you return to the village of Jacquescrappe, you misinform the people that the Craxil is dead and deliver a liquid dose of the plague into the town's wine supply and shaking hands with everyone who comes to congratulate you.  Shortly thereafter, you make sure to thoroughly infest all your pork before the next big wedding in Lima.  Meanwhile, your sister gets a position as a laysister at a cathedral in the kingdom of Mihtana.  By poisoning the holy water, she manages to infect everyone who comes in for a blessing. \n\n \nBetween the two of you, and the increased contagiousness of this version of the plague, you are able to infect a massive segment of the population.  You work to continue spreading the disease, but the damage is already done.  Quarantines are set up in Mihtana and Lima in a desperate attempt to quell the spread of the plague.  Those who are uninfected (or who believe themselves uninfected) revolt against the guards in a desperate bid for self preservation.  Others lock themselves in their homes and arm themselves in hopes of outliving the vile plague.  Criminals take full advantage of the choas to operate unchecked and before long both kingdoms (and their militaries) are completely at their knees. \n\n \nWhen the beastmen move forth to retake human lands, there is nothing to stop them.  As you and your sister have become the Craxil's right and left hands so-to-speak, you are now recognized as a person of power and all respond with fear and respect when in your presence. \n\n \n\"The Craxil was right\" you think to yourself.  \"If you want respect, you have to take it.  If you want power, you have to take it.  Nobody else is going to recognize your merit and deliver these things to you.  To have anything worth having in life, you simply have to take it.\"\n\n \nUnfortunately, it wasn't quite what you imagined.  You enjoy your newfound respect and power, but the fear felt by everyone else only makes you feel more alienated and alone.  By choosing this path, you have seized what you've always wanted, but what good is respect if it comes with the kind of fear that pushes people away?  What good is power if there is no one to share it with. \n\n \nWhen the time comes, the Craxil honors its agreement to release your sister and as you feared, she is appauled by what the two of you have wrought.  You recieve word the next week that she was found in a clearing in the woods.  She hung herself in the field where she used to play as a child.  You try to establish some sort of peace between humans and beastfolk, but given what you have done the humans want nothing to do with you.  They only respect you out of fear because of the beastmen you now command.  Realizing you are now completely alone, you go to meet your sister in the clearing and follow her to whatever lies beyond.\n\n \nCONGRATULATIONS! \n\nThis is official ending #1 of 2", "action_results": []}, {"action": "I Cannot Abide The Senseless Slaughter You're Scheming, I Would Rather Die", "result": "Humanity may not be perfect, but it certainly doesn't deserve the kind of death and destruction the Craxil has in mind.  You announce to her that you would rather die than support her in this plan.  You were terrified that this being might become infuriated and attack, but instead she calmly and slowly backs away... then looks to your sister.  Your sister looks back at the Craxil and you realize the Craxil has just given her a nonverbal order.  By now your sister's blade is unsheathed and she is coming at you. \n\n \nShe fights with a furocity and intent that is completely out of character for your shy and reserved little sister, but her physical strength is the same.  There is nothing special about her swordplay technique either and you are pleased to see that you can block and parry her attacks.  Still, this is your sister, and you don't want to kill her if you don't have to.  The Craxil is obviously enjoying this and you can't help but think that if you could just find some way of killing her then perhaps your sister can be saved.\n\n \nThe Craxil is currently in her noncorporeal true form, but she has taken corporeal forms before when she was watching you.  You wonder if striking her while she's in one of these corporeal forms might actually damage her.  Alternatively, you wonder why a shapeshifting being with noncorporeal capability would even need others to spread the plague in the first place.  Perhaps she isn't immune like you once thought or perhaps she felt secure from it in her noncorporeal form.  Would you still need to get her into corporeal form for that first or could you try and give it to her while she's in her noncorporeal state.  Or perhaps there is some other way of getting your sister back to normal.  Unlike you, she knows some very basic magic.  Perhaps she will have something that will damage the Craxil in its noncorporeal state.\n\n \nWhile your mind wonders to ponder these things, your sister manages to get a shallow cut across your right shoulder and you respond by kicking her onto the ground and stopping down on her sword hand.  You remove your sister's weapon and the Craxil moves in as if to protect its vassal.  You quickly begin to go over your previous ideas in your head knowing you will need to try something and soon lest the Craxil decides to attack first.\n\n \n ", "action_results": [{"action": "Call Out To Your Sister And Try To Free Her From Her Servitude", "result": "You call out to your sister and try to reach her as her brother.  You remind her of the grove you two played in when you were young.  You recall times when you organized a surprise gathering for her birthday.  You remind her how much she cares about the well being of others and beg her to come to her senses.  Unfortunately, whatever magicks control her mind apparently override any logical or emotional argument you put forth and she instantly follows whatever order the Craxil gives her. \n\n \nYou have her weapon, but she still has her basic spell casting abilities.  She puts a magic missile into your leg and you are unable to stand.  From here, the Craxil decides to turn you into another one of her mindless thralls.  You spend your days serving her whims, spreading the plague, and standing guard against intruders until one day many monthes later a real hero lops your head off while fighting the Craxil's minions. \n\n \nTHE END", "action_results": []}, {"action": "Fire A Poison Coated Arrow Into the Noncorporeal Form Of The Craxil", "result": "You draw a poison coated arrow from your pack and immediately notch it into your bow.  You realize you don't have a lot of time so you draw it back, aim, and fire immediately.  The Craxil does not move.  Instead, she allows the arrow to pass directly through her noncorporeal state and land somewhere in the dark distance.  You realize she only felt secure enough to give you the poison in the first place because she existed in this noncorporeal form whenever she wasn't spying.  You attempt to quickly consider your other options but it seems she doesn't much care for you any longer.  She stretches forth her hand and it feels as though you are being lifted into the air by your own skeleton.  You scream as you feel what feels like a brain aneurysm.  You continue to suffer the pain until it kills you.\n\n \nTHE END", "action_results": []}, {"action": "Challenge The Craxil To Take On Other Corporeal Forms, Then Infect Her With The Poison", "result": "\"It is clear that I have neither the means nor the ability to complete my quest, so as a dead man I ask that you grant one dying wish\" you proclaim.\n\n \n\"Throwing in the towel already?\" she scowls, obviously disappointed that you didn't have some clever trick in mind.  \"From your past exploits in my territory I thought you'd at least think of something to try.  What do you want?\"\n\n \n\"I want to know how you were able to keep tabs on me during the journey.  What other forms did you take besides Brandolf and the old man?\"\n\n \n\"I took many forms.  From birds, to rocks, to the very water you swam through to get past the orcs.\"\n\n \n\"Show me\" you demand, \"I want to more fully understand how I was bested before this ends.  Let me die with that peace.\"\n\n \n\nAs she's talking, she starts by taking the corporeal form of Brandolf the Bray and you seize upon the opportunity.  As rapidly as you can you grab a poison coated arrow, notch it in your bow, drawback the drawstring, aim, and release.  The poison arrow lands in her forearm and she promptly removes it and tosses it aside.  You fear she was unaffected by this arrow and she begins to laugh.\n\n \n\"It seems I misjudged you, you haven't surrendered at all have you?  Attacking me in my corporeal state... that does sound like you.  But I have the ability to reform my corporeal state just as easily as I formed it in the first place.  This is a simple matter of...\"\n\n \nShe stops midsentence as if she somehow came to the realization of what you've done.\n\n \n\"That arrow...\"\n\n \n\"The same stuff you gave me on day 1.  It looks like I managed to complete this quest after all\"\n\n \nThe Craxil bursts with laughter as if somehow impressed with your creativity or perhaps the irony of the situation.  She doesn't stop laughing even when the nausea and vomitting come.  You can tell her power is waning because you sister suddenly regains control of her facilties and runs to your side.  The Craxil laments that the beastmen will no longer maintain unity after her death and expresses genuine concern about their well-being.  You aren't sure why, but you promise to try and convince the human leaders in Mihtana and Lima to recognize the importance and advantages of peace and even integration of beastmen into civilization.  She smiles and then the light that made up her corporeal being goes out. \n\n \n ", "action_results": [{"action": "Continue The Story", "result": "Unfortunately, this story takes a tragic end for your sister, who remains a carrier for the plague even after the Craxil's death.  You explain to her what the Craxil was and what it planned to do.  She backs away from you immediately as if not wanting to infect you.  In fact, it dawns on both of you that she will never again get to experience the physical touch of another person in any way ever again without killing them.  In a deep state of sadness, she decides to remain in the wilds as a hermit, embarking on a quest to find a cure for this condition.  You want to stop her but in all honesty, you cannot possibly think of anything better for her right now and bringing her to civilization would be a bad idea right now.  You wish you could hug her or comfort her somehow, but you both understand why you can't.  Instead, you wish her the best of luck and hope she one day finds what she's needs.  From this point on, there is not a single night that goes by for the rest of your life that you don't pray for her.\n\n \nWith the death of the Craxil, the doors that sealed behind you are no longer fixed.  The infighting amongst the now disunified beastmen makes it easy for you to get through unnoticed on your way back to the village.  Along the way you see grippli attacking goblins, kobolds fighting amongst themselves, and the orc patrols seem to have raided numerous humunculi settlements.  The large, unified force they once represented is now thinned out considerably, and although the journey is long and your rations are low, you eventually make it back to the village.\n\n \nThe villagers are shocked to hear that the Craxil is dead and you tell them all about it.  Some believe you are full of it and think the Craxil still lives.  Others admit they bet good money you would die.  You were right to assume they'd have redistributed your property under this very assumption and it takes some doing getting it all restored.  Unfortunately, they decided to slay your friends Oinky and Snout for ham while you were away and for the first time in your life you chose not to take it lying down anymore.  If this journey taught you anything, its that you are going to have to demand respect if you hope to get it.\n\n \nHowever, this journey has taught you a lot more than that.  As promised, you travel to meet with leaders in both Mihtana and Lima so that you can try to convince them why peace between the humans and the beastfolk might actually be beneficial.  You explain how the Craxil was able to rally them together and organize them and how some of them demonstrated a higher level of intelligence than you originally thought them capable of (i.e. - the kobolds extensive mining techniques and the goblin's tinkering).  Unfortunately, despite your best efforts, the world is just not ready to view them as anything other than dangerous savages to be on guard against and you realize that this is how it is going to stay.\n\n \nEventually you return to your farm and begin shoveling out all the pig dung that had been piling up in your absence.  As you are working, a girl you took notice of at the local tavern looks over to you.  You smile with confidence and she smiles back and suddenly you think... this might not be so bad after all.\n\n \nCONGRATULATIONS!\n\nYou've found real ending #2 of 2.", "action_results": []}]}, {"action": "Challenge The Craxil To Take On Other Corporeal Forms, Then Strike Her Down With Your Sword", "result": "\"It is clear that I have neither the means nor the ability to complete my quest, so as a dead man I ask that you grant one dying wish\" you proclaim.\n\n \n\"Throwing in the towel already?\" she scowls, obviously disappointed that you didn't have some clever trick in mind.  \"From your past exploits in my territory I thought you'd at least think of something to try.  What do you want?\"\n\n \n\"I want to know how you were able to keep tabs on me during the journey.  What other forms did you take besides Brandolf and the old man?\"\n\n \n\"I took many forms.  From birds, to rocks, to the very water you swam through to get past the orcs.\"\n\n \n\"Show me\" you demand, \"I want to more fully understand how I was bested before this ends.  Let me die with that peace.\"\n\n \nThe Craxil takes the form of Brandolf the Bray first and you seize upon you opportunity.  Walking forth with feigned curiosity you unsheath your sword and charge at her with a firm sense of purpose.  You bring the blade down through her collar bone and into her chest while she's still in the Brandolf form.  She looks surprised, and the look of disappointment is replaced with a smile and a laugh.\n\n \n\"So that's it eh?  Not bad.  But you see, I can reconstitute my form.\"  You withdraw your blade and watch as her flesh comes back together and restores itself anew.\n\n \n\"It was not a bad idea, it really wasn't.  The kind of thing a guy like you would probably try.  But this is where it is going to have to end. \n\n \nWhile your attention is focused upon the Craxil, your sister springs forth and grabs your arm.  The significance of this move is lost on you until you realize she's the carrier of the new plague.  You shirk her off and back away but it is too late.  The Craxil and your sister then leave, discussing various ideas for disseminating the plague, leaving you to spend the last few hours of your life in complete darkness.\n\n \nTHE END", "action_results": []}]}]}]}]}]}]}]}]}, {"action": "Wipe With The Three Fingered Green Leaves With Red Spots", "result": " \nYou choose the three fingered green leaves with red spots and it is not long after your sanitation ritual that you realize what a mistake that was.  Whatever manner of herbs those were you have a burning rash all along and in your backside.  Between that and the turtle bite, you are finding it difficult to walk without pain.  You really hope this journey ends soon, you really do.\n\n \nThe next three days of travel down the Redridge Pass are surprisingly uneventful.  You sneak past the occasional orc patrol and wild animal but nothing particularly difficult.  You half expect something to come jumping out at you from the darkness or to find some large camp around the corner but to your plesant surprise the way seems more or less clear.  Part of you wonders if it is a trap given the Craxil knows you are coming but then ... what choice do you have?\n\n \nAs you come up a steep incline you look down and with great satisfaction you find what you've been searching for all this time.  A colossal chasm, the canyon you've been searching for!  The old man said you would know it when you see it and damn if he wasn't right about that!  Still, this canyon is freaking huge.  It will take probably half a day just to get down to the bottom safely and once down there, there is a LOT to explore.  You know the underground cavern that houses the Craxil is accessed somewhere down there, so I guess you don't have much choice than to go down there and investigate huh?\n\n \nYou are about to cautiously decend when you hear the sound of hoofprints behind you...", "action_results": [null]}, {"action": "Don't Wipe At All You Filthy Mongrel", "result": " \nReal men don't wipe, so why should you?  LOL, ok.. so that was stupid.  But you don't feel like wiping with leaves so you just pull up your pants and keep going.  Sure you've got a pretty nasty case of mudbutt going on and you are not looking forward to returning these pants to the girl who loaned them to you (don't even ask why you chose to wear girls pants...).  Hopefully this journey will end soon.\n\n \nThe next three days of travel down the Redridge Pass are surprisingly uneventful.  You sneak past the occasional orc patrol and wild animal but nothing particularly difficult.  You half expect something to come jumping out at you from the darkness or to find some large camp around the corner but to your plesant surprise the way seems more or less clear.  Part of you wonders if it is a trap given the Craxil knows you are coming but then ... what choice do you have?\n\n \nAs you come up a steep incline you look down and with great satisfaction you find what you've been searching for all this time.  A colossal chasm, the canyon you've been searching for!  The old man said you would know it when you see it and damn if he wasn't right about that!  Still, this canyon is freaking huge.  It will take probably half a day just to get down to the bottom safely and once down there, there is a LOT to explore.  You know the underground cavern that houses the Craxil is accessed somewhere down there, so I guess you don't have much choice than to go down there and investigate huh?\n\n \nYou are about to cautiously decend when you hear the sound of hoofprints behind you...\n\n \n ", "action_results": [null]}]}]}]}]}, {"action": "Move Through The Ditch To The Other Side", "result": "The orcs might notice a moving reed and get suspicious and attacking a superior number of superior enemies is just inviting death.  You decide the best bet is to move through the ditch and move through while tightly hugging the wall closest to them, thus minimizing your chances of being seen.  You hop in and start moving.  A tiny little stream trickles through and much of the ground here is mud.  The stench of orc shit is strong in here and you begin to realize this is where they've been dumping it (no pun intended).  Still, you brave on knowing this is a life or death situation and no time to be getting squeamish. \n\n \n\nYou are now so very close to the orcs but they haven't yet seen you.  You move even slower than before but you are confident you will make it.  That is, until one of them lifts his nose and sniffs the air.  It seems you forgot to take into account the fact that orcs have an exceptionally keen sense of smell.  Despite the fact that you are clean, and the fact that the orc manure should be overpowering their senses right now, it seems they've identified your scent.  They move over and it isn't long before you are seen.  You try to run, but you stumble in the mud that has taken your shoe.  You try to run without it but you don't get very far.  The orcs were put there on the path to stop you from reaching the Craxil and they've succeeded.\n\n \nTHE END", "action_results": []}, {"action": "Attack With Poison Tipped Arrows", "result": " \nYou have way more poison than you need to kill the Craxil so why not use it to help you get there as well?  If Brandolf was right about this stuff, it should kill anything that ingests it or is stabbed by it.  The orcs are very large creatures too, so you hope you will be able to hit them.  You apply the poison to about a dozen of your arrows and take your stance.  You pull out the first poison arrow, notch it in your bow, pull back the drawstring as far as you possibly can, and release.\n\n \nThe first shot is a success.  One of the closest orcs takes it in the shoulder and it isn't long before the poison takes effect.  He is laying on the ground vomiting and though he isn't dead yet, you know it won't be much longer for he has the look of death upon him.  The other four are now charging at you.  The two in front have their shields out, as if to block any subsequent shots.  You quickly let fly another arrow.  It goes precisely where you aimed but one of the front orcs anticipated it and blocked it with his shield.  You manage to get one of the ones in back in the leg with your next shot, bringing your enemy's total to three but they are nearly upon you now.  You only have enough time for another two shots and the forward orcs manage to block them with their shields.  They've certainly developed a clever counterstrategy to your strategy haven't they?  \n\n \n\nNow they are upon you, hacking you to pieces and bellowing insults like \"stupid morra\".  You don't live long enough to hear him finish his next line.\n\n \nTHE END", "action_results": []}]}]}]}]}]}]}, {"action": "Run Past The Guardians, Grab The Taskmaster, Jump From The Ledge, And Run", "result": "You may be in close range, but you doubt if your skills with a bow would enable you to kill in quick succession like that.  Instead, you choose the more daring approach.  After all, the crazier the plan the less likely they are to see it coming.  You gather your nerve, fixate upon your target, and bolt.  The kobold guards jump back like they've just seen a screamer or something and you sail past them and onto the ledge.  The taskmaster, still focused on the fire, is completely surprised when you grab him and jump off the ledge.  By now, every kobold in the colony is aware of what you've done so you just blindly run down the back passage and deeper into the mines. \n\n \n \n\nYou haven't any idea where you are going and there are numerous kobolds chasing you from behind.  Thankfully, their legs just aren't long enough to keep pace with you, though they certainly push themselves trying.  You focus all your attention on trying to avoid the kobolds that are deeper in these mines while simultaneously trying to find a secluded place to stop and interrogate your new prisoner.  Unfortunately, you're so focused on this task that you don't see the dagger your kobold prisoner pulls out of his sleeve and plunges into your chest.  Seems the flaw with your plan was that you didn't have any time to properly restrain your prisoner and now you are dead.\n\n \nTHE END", "action_results": []}]}]}]}]}, {"action": "Climb The Rockface To Get Beyond Their Reach", "result": "The skeletal undead aren't exactly known for their climbing skills so you promptly head over to the steep rockface and set about climbing to a point beyond their reach.  You are almost at the top when the skeletons reach the base.  The attempt to climb but as you had hoped, they are substantially less successful than you.  One of them responds to the situation by tossing his hand axe at you and you move your hand just in time to avoid it.  You make sure it stays stuck in the rockface so it doesn't get to try again, then pull yourself up and over the top. \n\n \nYou are glad to be away from those damn things and now that you are at a slightly higher elevation along the mountainside, there's a good chance you won't be seeing them again.  Just got to keep your cool and remember to be stealthy.  You continue your journey in the same general direction but keep to this elevation for fear of encountering those undead creatures a second time.  After a while, you begin to smell a rather curious smell up ahead.  As you approach you discover a camp situated in what is probably the only forested ledge on this entire mountain range.  You don't initially see anyone there, but you keep your distance and eventually see something hop down rather quickly from one of the trees and go behind another.  You didn't get a good look at whatever it was and you are hoping they haven't seen you. \n\n \n\nNightfall comes and now the occupants of the camp are coming into view.  You never believed that at any time in your entire life you'd ever lay eyes on the creatures you are seeing.  The grippli, a race of humanoid tree frogs standing at 2 feet tall, have organized this camp.  There aren't more than a dozen tops, but grippli are known to be considerable fighters when they need to be and there is no way of knowing if there are more of them in the trees. \n\n\nThey often prefer to fight with poison darts, nets, and bows as they would prefer to keep their enemy at a distance but a few bear swords.  You see one of them adorned in considerably nicer garb than the others and commands quite a presence from them so you surmise it must be their leader. \n\n \nSuddenly it occurs to you.  These creatures are in Craxil territory so odds are they work for the Craxil.  That means that instead of wandering the mountain range aimlessly you ought try and extract information regarding the Craxil's whereabouts from the grippli.  Ideally, you could get your hands on their leader but that is going to be easier said than done.  There may not be many grippli present, but each one is a challenge in his own right and you have no way of knowing how many may be in the trees to see what you do.\n\n \nEventually, the captain retires to his tent as do many others.  Three grippli remain near the campfire out front and again, you have no way of knowing what is still in the trees.  The captain's tent is near the back.  You surmise you could go around, giving the camp a wide berth, and sneak into the captain's tent.  However, you feel like you should at least do SOMETHING about the three on watch or you may be the one getting captured instead.  This is quite a dilly of a pickle indeed.\n\n \n ", "action_results": [{"action": "Sneak Around Back And Enter The Captain's Tent Quietly", "result": " \nYou don't foresee any way to take down a group of three grippli given each one would probably pose a challenge.  As well, they are tasked with being nightwatchmen so you doubt they'd abandon their posts so easily no matter what you do.  You are going to just have to take a risk and sneak into the captain's tent without attracting any attention.  You give the camp a wide berth as planned and SLOWLY work your way along the far edge of the treeline until you are in a position to sneak in towards the captains tent without being seen by the grippli at the campfire. \n\n \nYour approach is successful.  You slowly creep in, staying low to the ground.  You can't help but look up at the treetops everyone in a while out of fear that darts, arrows, or nets may come raining down upon you but so far nothing has happened.  Perhaps there is nobody there or perhaps they just don't see you.  Either way, you've made it to the captain's tent.  Cautiously, you open the canopy and enter the tent.  As you had hoped, the captain is asleep and you take care to knock him unconcious with a block shaped wooden figurine from his tent.  Now all that's left is to carry him away from the camp, someplace safe where you can interrogate him for information regarding the Craxil. \n\n \n\nYou exit the tent with the grippli captain slung over your shoulder.  At only 2 feet tall the little fella is surprisingly light.  Unfortunately, as you exit you hear a rather startling noise.  It sounded like a cross between a ribbit and a scream.  Whatever the hell it was, it came from one of the grippli over by the campfire.  Almost immediately, the whole camp is on alert.  Grippli are dropping down from the trees and coming out of their tents.  You take off and run, your only real option left.  Unfortunately, the grippli have amazing speed and agility.  You drop the captain behind in hopes of getting away but before long you've taken a few darts in the back.  As the poison sinks in, you realize it no longer matters if you outrun your pursuers... this stuff will kill you anyway.\n\n \nTHE END", "action_results": []}, {"action": "Construct A Pit Trap And Lure The Three Out Towards You", "result": "You need to dispatch with the three grippli keeping watch but you cannot do that in the camp or you will almost certainly get attention.  Therefore, your only real option is to lure them out and eliminate them somehow while they're away from camp.  Even if you do lure them away from their camp though, three grippli are more than a match for you so you are going to have to construct a trap of some sort.  You remember seeing a small drop off in the middle of the path you just came down and that gives you an idea. \n\n \n\n \nYou take about a dozen of your arrows and plant them firmly in the ground (arrowhead up) at the bottom of the hole you encountered along the path.  You only lightly cover it with what little large leaves and vines you can find, then cover this foliage completely with sand and small rocks (enough to cover the vegetation but not enough to make it fall into the hole).  Your hope is that you will be able to lure your three grippli out here away from the camp and then fall in on top of your arrows.  The only thing left to do is figure out how you are going to lure them away from the camp without them alerting the camp as well.\n\n \nYou decide to mimic the sounds of the small prairie dog like creatures out here and toss small pebbles around the corner where they would see them.  You seem to have their attention as they are too bored to really entertain themselves with anything else.   Unfortunately, the prairie dog gag isn't enough to make them come so next you imitate the sound of a ewe while making loud pawing noises at the ground.  For whatever reason, this one gets their attention and they start approaching quietly with their weapons drawn. \n\n \n\nYou continue making animals noises but move back slowly at the same time.  At point for them is a hunter brandishing a bow.  The other two apparently believe in the sword.  Maybe that's not as atypical for a grippli as you thought.  You are careful to remain unseen but back up slowly and continue leading them forth with animal noises.  Eventually the game is up as the hunter seems to get suspicous and notices you are there.  You turn and run using the indentations in the rockwall to your right to help protect you from arrow fire.  You take your position behind a rock on the other side of the trap and to your glee they are running straight for it. \n\n \nYES!  The sound of your cover giving way under their weight is music to your ears, as are the ribbits of pain emitted shortly thereafter.  You surmise they are dead until one of them jumps out of the pit with only a leg wound.  He pulls out his sword and glares at you.  You feel like facing him like this, it would be an even match.  Still, you would much prefer some kind of advantage whereever you can get it.  You draw your sword and begin to think carefully about how this is going to go down.\n\n \n\n \n ", "action_results": [{"action": "Rush The Creature And Try To Push Him Back Into The Pit", "result": "You realize that if the pit was good enough to kill the other two then knocking him in again ought do the trick pretty quick.  Plus, he's still standing only a few feet from the edge.  You charge in at him and strike your sword vertically at his face.  He parries as you knew he would, and now you prepare to push his 2 foot little keister back into the pit. \n\n \n \n \n \n \n \n\nThe problem with this strategy is that it is predictable.  The grippli knew what you were doing as soon as you began the charge.  It hopes well out of the way and launches a charge of his own.  He cannot match your strength (which is saying a lot coming from you) but he is so damn fast that you can't react to his moves in time to avoid getting stabbed.  This persists for a while until finally you drop to the ground looking like one of Freddie Kruger's victims.  With a sense of pride, the 2 foot little froggie bastard walks off back to camp no doubt to brag to his friends what he just accomplished.\n\n \nTHE END", "action_results": []}, {"action": "Toss Dirt In His Eyes, Then Attack", "result": " \nThere is no shortage of dry dirt and rock all around you and as an amphibian you reason he's probably not to terribly accostomed to that type of thing.  Given his 2 foot stature, you wait for him to make a move then kick dirt in his face.  You reasoned correctly.  The frog's large eyes close down firmly and he is clearly unable to handle himself.  You almost feel sorry for employing such a cheap trick on the little guy.  Almost.\n\n \nWith him unable to see and barely able to compose himself, the battle ends pretty quickly.  You return to the edge of the pit and shoot a couple more arrows into your punctured prey for good measure as you don't want any more unexpected surprises to arise when you go in for the capture.  You inch your way back to camp under the midnight moon and make sure to scope the place out anew before making your move.  As you had hoped, the nightwatchmen didn't rouse anyone before they left.  You still don't know about the treetops, but the coast is as clear as its gonna get.\n\n \nYou creep through camp where it is darkest and make your way to the captain's tent.  You carefully open the canopy and move inside.  As you had hoped, the captain is still asleep.  You take care to knock him out over the head with a block shaped wooden figurine you find in his tent, then carry him over your shoulder and out of the camp.  Without the three nightwatchmen, it is easy to carry the unconcious 2 ft. lightweight out of camp and out to a safe location.  It takes several hours before he awakes, but when he does you already have his froggie hands and feet bound with cloth torn from his own outfit. \n\n \n ", "action_results": [{"action": "Time To Talk To The Froggie", "result": "To be honest, you aren't entirely sure which one of you two is more afraid... him or you.  The grippli struggles in his bindings and begins to make noise which you are quick to silence.  You raise your sword in warning and he begins to quiet down.  Quite frankly, you are amazed that you are actually doing this.  You've never been in a position like this before, doing something like this.  You've always been an underappreciated swineherd your whole life.  You are definitely not used to this sort of thing but you sure as hell don't want your prisoner to realize that.\n\n \n\"The Craxil isn't something you can easily kill.  It has united the beastmen in this region of the mountains and aims to provide for its people\" the captain starts.\n\n \n\"And what exactly is that suppose to mean\" you demand.\n\n \n\"The humans have driven us beastmen into the barren land of the mountainrange and taken the fertile, soft ground for themselves.  The Craxil wants for us to have good ground.  Human ground.  The Craxil has been organizing us for quite some time now and it is going to help us take what we deserve.\"\n\n \n\"What manner of creature is this Craxil anyway?\" you ask, knowing you'll have to face him eventually. \n\n \n\"We don't know, none of us do.  We never see the Craxil, its sends its orders with the riders.\"\n\n \n\"The riders?\"\n\n \n\"Yes.  They used to be humans but... well... not anymore really.\"\n\n \n\"You mean he's raising them as undead?!?\"\n\n \n\"No, no, the Craxil would never resort to such deplorable practices.  The Craxil breaks their minds with a ritual that takes days.  When the Craxil finishes, they become thralls.\"\n\n \nYou are truly frightened by this last comment.  It is common knowledge that mind flayers can dominate the minds of others, but they are able to do so instantly.  They don't require a ritual that takes several days to accomplish.  Brandolf did say the Craxil was a completely different creature than anyone has encountered before.\n\n \n\"Where can I find the Craxil?\" you demand.\n\n \n\"The Craxil resides in an underground cavern, accessed from the base of a large canyon up north.  The most direct route is Redridge Pass though I doubt you'll even get there alive.  You'll know you are getting close when all the rocks and dirt are red and the cactii become more numerous.\"\n\n \nYou wanted to ask him more questions, but it seems that his comrades have already noticed his absence and begun looking for him.  You don't see any other choice than to kill him, hide the body, and head north.  But hey, at least you got some valuable information including some general directions.\n\n \n ", "action_results": [{"action": "Moving North", "result": "You ponder what the grippli captain said as you continue on your northward journey.  You haven't seen any cactii yet so you surmise you still have a long way to go.  But what other dangers await you?  So far you've encountered humunculi, undead, grippli, and even a beholder.  More amazing is that your sorry swineherding ass has survived this far.  Still, you have to wonder just how many different types of creatures there are under the Craxil's command and what this Craxil even looks like. \n\n \n\nYour musings are cut short when your path is suddenly blocked by a very large wolf.  Its eyes glow red and it snarls with both anger and malice evident.  This wolf is no ordinary wolf.  It is huge and it looks like its possessed or something.  You draw your sword preparing to defend yourself but it doesn't attack, it simply stands there staring at you.  You attempt to move to the side and it follows as if to block your path.  You move to the other side and it follows again.  You take a step back and it follows with a step forward.  You aren't sure you even want to know what it will do if you take a step forward, and for once you aren't crazy enough to find out.\n\n \nSuddenly, the creature does something you did not expect.  It speaks. \n\n \n\"Tell me human, do you serve the Craxil?\".\n\n \nYou are tempted to lie and say yes but then how do you know that is the answer it wants to hear?  Maybe it serves the Craxil or maybe it is its enemy.  Either way, it looks like its going to kill you if you don't share its loyalties so you are going to have to decide what to say.\n\n \n ", "action_results": [{"action": "Yes", "result": " \nYou decide to lie and tell the large creature that you are in fact a rider for the Craxil in hopes that it will calm it down a bit.  Quite the opposite.  It seems this wolf is infuriated by the Craxil and the recent beastmen influence in the region.  You try to go back on your word and tell it the truth but its too late.  The massive wolf jumps on you, knocking you on the ground.  It goes immediately for your throat.  You spend the last moments of your life in a state of sheer terror.\n\n \nTHE END", "action_results": []}, {"action": "No", "result": "Honesty always was the best policy.  You tell the wolf you are on a quest to kill the Craxil then raise your sword defensively expecting him to attack.  Instead, the creature looks you over and accuses you of dishonesty.\n\n \n\"You honestly expect me to believe a scrawny kid like you was chosen to slay a being like the Craxil?\"\n\n \n\"I made it this far didn't I?\"\n\n \n\nThe wolf looks taken back by this comment and you tell him all about the plan to use poison, how you outmaneuvered the humunculi, the beholder's riddle... everything.  The creature takes a few steps closer to you and his bright red eyes are bearing deeply into your own.  You've never been more scared in your life than you are right now, but it seems the wolf has decided you are telling the truth.\n\n \n\"There is truth in your eyes, a certainty I haven't seen in quite some time.  Lots of fear though.  Odds are you are going to fail but hey, its your life to waste right?\"\n\n \n\"Well thank you for trusting my allegiance then.  Why don't you tell me what the heck you are, starting with how the hell you can talk.\"\n\n \nThe wolf turns back around, front legs spread in an aggressive position.  \"I never said I trusted you, you are going to have to prove yourself.\"\n\n \n\"But...\"\n\n \n\"You claim you came from the village.  What is this village called?\"\n\n \n ", "action_results": [{"action": "Jacqueshit", "result": " \nWRONG!\n\n \nThe massive wolf knocks you to the ground and rips your throat out with its teeth.  A terrible way to die to be sure.\n\n \nTHE END", "action_results": []}, {"action": "Jackcrappe", "result": " \nWRONG!\n\n \nThe giant wolf leaps upon you and tears your throat out with its teeth.  A horrible way to die to be sure.\n\n \nTHE END", "action_results": []}, {"action": "Jacquescrappe", "result": "\"Correct\" the wolf admits, \"but even the Craxil and the surrounding beastmen know that much.  It doesn't prove anything.\"\n\n \n\"Then ask me something else\" you demand.\n\n \n\"Fine then, I shall!\"  \n\n \n\"What is the name of the wizard that came to Jacquescrappe?\" \n\n \n \n \n ", "action_results": [null, {"action": "Brandolf The Bray", "result": "\"Correct\" the wolf sighs... \"though the enemy does seem to keep itself awfully well informed on the surrounding humans...\"\n\n \n\"Just cut the crap and give me a real question\" you demand.  \"If it won't prove anything then don't ask it in the first place!\"\n\n \n\"Fine then.  This one will prove your honesty or lack there of for sure.\"  the wolf replies with a wide grin upon his face.  \"You claim you were the underappreciated swineherd.  I've heard of him as well.  What are the names of your two favorite pigs?\"\n\n \n\"How did you...\"\n\n \n\"Ha, don't bother with how I know.  All that is important is that I do.  Answer this, and I will know you are who you say you are.\"\n\n \n ", "action_results": [{"action": "Oinky and Snout", "result": "\"Correct\" the wolf concedes.  \"I guess you really are the town swineherd.  Hard to believe you got this far.\"\n\n \n\"Thanks for the vote of confidence but you still haven't answered my questions.  For starters, how do I know YOU don't work for the Craxil?\"\n\n \nThe wolf motions his snout towards a pile of bones.  Upon closer inspection, you recognize them as the skeletal creatures that attacked you earlier. \n\n \n\"They were following you ever since they managed to get up to this elevation.  I took care of them for ya, how's that?\"\n\n \n\"Very well, but you still haven't told me who you are or how you are able to talk.\"\n\n \n\"Sigh... you ask too many questions frail one\"\n\n \nYou boil at the rude irony of that comment until he laughs and turns back around to face you again. \n\n \n\n\"I'm not really the wolf that you see here, but rather the spirit that possesses it.  This creature is my shell.  Many years ago, when this landscape was not as barren as it is today, this area here was my home.  I'm buried in these lands and still think of them as my home, despite how much they've changed.\"\n\n \n\"I knew it\" you think to yourself.  You suspected that thing was possessed the moment you saw the red eyes and you aren't even an experienced adventurer or anything.  Maybe your instincts are not as dull as you thought.\n\n \n\"The arrival of the beastmen has distressed me considerably but worse is the Craxil.  It brings them together in this mountainside, it organizes them, and it seeks to advance them over the humans.  Quite simply, I cannot return to the eternal rest I deserve until the Craxil is destroyed.\"\n\n \n\"I don't suppose you would know anything about this Craxil?  I'm told it is a completely unique manner of creature that has not yet been witnessed before.\"\n\n \n\"I would say that sums it up pretty well scrawny one.  I don't think there is anything more anyone can tell you that would be of any additional use to you.  Just continue as you have been and for the love of all things sacred, be careful.  I'm not sure how your pathetic, pencil arms made it so far into Craxil territory but you have gotten farther than any mortal since it established itself here.  Stick to what you have been doing and see it through.\"\n\n \nAfter that little peptalk the wolf spirit vanishes in a puff of light gray smoke and disappears from view.  You can't say you liked the spirit.  Much to vain and abrasive for your taste.  Still, you do appreciate that it got rid of those skeletons for you.  Rather creepy to know someone had been stalking the sneakery master.  Perhaps you aren't the sneakest sneak after all.  Well, you didn't get this far by doubting yourself (except when it comes to physical strength) so let's continue forth.\n\n \n ", "action_results": [null]}, null, null, null]}, null, null]}, {"action": "Jaquescrappe", "result": " \nWRONG!\n\n \nThe wolf jumps on you and tears your throat out with his teeth.  A horrible way to die to be sure.\n\n \nTHE END", "action_results": []}]}, {"action": "What Is A Craxil? Is That A New Brand Of Butter Cracker?", "result": " \nYou attempt to lie to the giant wolf creature but despite your skill as sneakery you've always been a horrible liar.  The dishonesty is not taken well and before you know it, the massive canine has you on the ground and is sinking his jaw into your throat.  You spend the last moments of your life in sheer terror.\n\n \nTHE END", "action_results": []}]}]}]}, {"action": "Don't Waste Time With Elaborate Trickery, Just Fight The Thing", "result": " \nThere is no longer any element of surprise so the time for elaborate tricks is over.  You are simply going to have to face this thing one on one.  At first things seem to go well.  His 2 foot tall stature is no match for your strength (which is saying a lot coming from you) but he is fast as hell.  Given that he's part frog he's hopping around behing you, above you, between your legs, all with the speed and reflexes of a frog.  You've always wondered what made people consider these things to be so dangerous.\n\n \n \n \n\n \nIn the end, you've taken on more stab wounds than you can possibly handle and drop to the ground looking like one of Freddie Krougar's victims.  The 2 foot little froggie bastard develops a new air of pride and marches back to camp, no doubt to brag to his friends about his new victory.  But for you it is simply...\n\n \nTHE END", "action_results": []}]}, {"action": "Try To Sneak Up On The Grippli Near The Campfire And Cut Them All Down Before They Can React", "result": "The way you see it, you don't really have a choice.  You can't risk going after the captain while these three grippli are here standing guard like this.  You'll be caught.  You have your doubts about whether you'd be able to lure the nightwatchmen away from their posts so you are going to just have to be direct about it.  There may be three of them, but once again you have the element of surprise and you don't intend to give them any time whatsoever to react to the onslaught you intend to bring.  You creep around into the center of the camp and approach the nightwatchmen from behind. \n\n \n\n \nAs you approach, the light from the campfire makes your shadow apparent and the other grippli take notice.  After all your years of capture the flag success you'd think you'd know by know that it is much easier to creep up on someone in the dark than near a campfire.  Rookie mistake.  The grippli nightwatchmen rouse from their posts and draw their weapons.  As the three leap forth to attack you, grippli in the trees fire poison darts into your back and others are roused from their tents.  I don't think I need to tell you that this is...\n\n \nTHE END", "action_results": []}]}, {"action": "Rain Arrows Upon Them", "result": "Why run when you can fight?  The arrows worked for you before and you believe you can get off quite a few shots before they start catching up to you.  To wait until you reach the top of a local hill then spin around and draw your bow.  The five skeleton creatures are still running towards you in a tight grouping.  You let fly the first arrow and it hits the collarbone of one of the back skeletons.  You release another and it hits the leg of another skeleton.  In fact you score a lot of hits, even putting one through the skull of the lead skeleton.  There's just one problem... they aren't slowing down!\n\n \nMaybe you've forgotten, but arrows and bladed weapons are only effective against enemies that still have flesh and blood to let.  These skeletons are not slowing down or taking much damage as a result of your arrows.  In fact, it would require a more blunt weapon to kill.  As they start drawing in close you turn and continue running.  You've pretty much lost your head start and now they are hot on your heels.  This continues for a while until one of your skeletal pursuers gets it in his mind to throw its hand axe into your back.  It only goes downhill from there for you.\n\n \nTHE END", "action_results": []}]}]}, {"action": "Help Him, What Kind Of Adventurer Are You?", "result": "You decide to help the man.  What kind of adventurer would you be to deny a father the aid he needs to save his family from the Craxil's minions?  The royal military may have abandoned Jacquescrappe because it was remote and of no strategic value but dammit if you are going to end up just like them.  However, something about this is starting to feel weird.  Why would there be a human caravan up here in the Craxil's lands and why do you have this strange feeling in the pit of your stomach. \n\n \nJust as you are having these thoughts, an owl looks at you from atop a dead tree and just looks at you with intent.  You've never been able to communicate to animals like the druids do, but somehow you just know this thing is telling you to turn back.  You stop for a minute, then strike yourself and shake it off.  Since when did you become a druid and take advice from animals?  Aside from your pigs \"Oinky\" and \"Snout\" you've never really connected with any animals anyway.  Besides, your gut hasn't helped you win any gambling tournaments so why should you trust it now?  You're probably just afraid and subconciously looking for a way to avoid a potentially dangerous situation.  Helping the man is the right thing to do, you're sure of it...\n\n \nRight?\n\n \n ", "action_results": [{"action": "Indeed, What Kind Of Hero Abandons His Fellow Man When His Family Is At Stake?", "result": "You arrive in a clearing and the man who pleaded with you earlier has just stopped in his tracks.\n\n \n\"So where's the caravan?\" you inquire, expecting some sort of explanation for this sudden drop in urgency.\n\n \nSilence\n\n \n..............\n\n \nAt this point you are quickly surrounded by other men who are equally silent.  The feeling in the pit of your stomach has just gotten worse and you realize that you've been had.\n\n \n\"There is no caravan is there.\"\n\n \n.....\n\n \nAt this point the man who led you here turns to face you.  The head suddenly begins to twitch and distort and the head of a skeleton emerges from the mouth as if pushing through a mask.  You back up and realize the four other men around you are doing the same.  They rush you from all sides and you are quickly overwhelmed.  You made a grave mistake in not trusting your instincts earlier, they exist in us for a reason. \n\n \nTHE END", "action_results": []}, {"action": "No, Something About This Whole Situation Is Fishy. I'm Turning Back.", "result": "You don't like any part of where this is going and decide that the best thing to do is to turn back.  After all, no humans from Jacquescrappe have ever made it this far into the Craxil's territory so why should you believe there is a human caravan out this far?  None of this makes any sense and you think to yourself that these beastmen are not above using your compassion against you as a weakness.  It is low, but well within the bounds of what these things might do.\n\n \nYou come to a stop, and look up at the owl.  He gives you a warm, approving look then flies away.  \"What a strange creature\" you think to yourself.  You wait for the man to disappear from view, then wait a while longer for good measure, then continue forward on foot as you had originally planned.  Frankly, you're just glad to be away from the suspicious man. \n\n \n\n \n \n \nAs you continue on your journey you wonder if you made the right choice.  I mean, what if the man's family really was in danger and you could have made a difference?  Did you make the right call?  You console yourself by reminding yourself of the importance of your own mission and how you cannot afford to take unnecessary chances.  Just as you are having these thoughts, you discover the man who approached you earlier as well as four others standing in the middle of the beaten path with their heads down.  It looks like you aren't done with them after all...\n\n \n ", "action_results": [null]}]}]}]}, {"action": "The Thirst For Knowledge", "result": "\"Wrong\" it proclaims.  \"While the thirst for knowledge may be limitless in your kind, it is not your primary concern in times of trouble now is it?\"\n\n \n\"Well... erm...\"\n\n \nYou don't have time to retort.  It fires a beam of negative energy into your chest and you disintigrate on the spot, bringing your quest to an abrupt end.\n\n \nTHE END", "action_results": []}, {"action": "The Limitless Potential Of Mankind", "result": "\"Wrong\" it bellows, laughing under its breath.  \"Your kind's potential is not as limitless as you like to think it is.  And besides, your limitless potential isn't exactly showing through in this time of trouble now is it little one?\"\n\n \n\"Well... erm... \"\n\n \nYou wanted to say something about how desperate situations propel human potential to new heights but the blast of negative energy he shoots at you doesn't give you a chance. \n\n \nTHE END", "action_results": []}, {"action": "A Bar Wench?", "result": "The creature and you both get a hearty laugh out of this response but you know that you are wrong and you know you are going to die soon.  Indeed, the creature hits you with the same negative energy it used on the humunculi and you disapate into the air.\n\n \nTHE END", "action_results": []}]}, {"action": "Run Outside The Cave", "result": " \nYou run outside the cave and around the corner.  You are back on the plateau overlooking the village.  Your heart is beating fast as hell and you are clutching your sword so tightly you will probably have blisters.  Fortunately for you, the humunculi have chosen to run down the path behind their campsite.  You wait outside the cave for a few hours and still they haven't returned from the passageway.  Perhaps they have chosen to travel further in to pursue you?  \n\n \nYou return to the cave's interior and are standing at the campfire.  The large passageway on the right side of the chamber is still blocked.  You peer down the passageway in front of you, the one the humunculi chose to go down and you wonder what lies beyond its depths.  However, as you look left you remember there is still an as yet unexplored passageway down in the cavern where the humunculi nearly overwhelmed you.  You aren't going to find the Craxil by standing around here so you are going to have to decide where you want to go from here.\n\n \n ", "action_results": [{"action": "Follow The Path Behind The Campfire, Where The Two Humunculi Went", "result": "You chose to take the passageway behind the campfire.  If these creatures are protecting the Craxil, or at least serving him in some sense, it would makes sense they would head in this direction.  You get the strong scent of burning animals or something like that and what you see next is COMPLETELY unexpected.  Instead of seeing the two humunculi that ran down this passageway earlier, you are standing directly in front of some kind of hovering demon whose gaze is fixed directly upon you!\n\n \nThis thing looks like a large floating eye with multiple smaller eyes attached atop its head.  You realize this thing is a beholder and soon you find yourself paralyzed in its gaze.  That's what you get for staring into its eye I guess.\n\n \n\"Answer me puny one, why are you here in my domain?\"\n\n \nYou are too terrified to answer, but this creature appears to grow irritated by your silence so you muster all the courage you've got and speak up\n\n \n\"I'm here to slay the Craxil\" you proclaim, terrified of how this creature will respond to such a bold statement.\n\n \n\"HA!  Amusing little one, someone of your strength doesn't have what it takes but it would entertain me to see how you die in the Craxil's mountains.  Answer this riddle correctly, and I will permit you to continue through to the other side of my domain.  Answer incorrectly, and you will share the same fate as your former pursuers.  Are you ready?\"\n\n \n\"Did he kill the humunculi?\" you think to yourself...\n\n \n\"As ready as I'll ever be\" you squeak.\n\n \n\"Very well!\" it bellows, clearly enjoying every bit of this.  \"I am a vast canyon that spans beyond sight.  I am without end and have been a part of every man whenever there is trouble.  What am I?\"\n\n \n \n ", "action_results": [null, null, null, null]}, {"action": "Go Down To The Cavern Where You First Used Your Bow And Try That Passageway", "result": " \n\n \nNaturally, you are not going to go down the passageway that your pursuers went down, that's just stupid.  You want to avoid unnecessary conflict after allso you can increase your chances of reaching the Craxil.  This passageway leads you out to a large plateau.  To the right, you can see another several clusters of cave networks populated by humunculi.  To the left you see a step drop off that would land you in the forest the hunters of your village like to use.  In front of you, and in the distance, is a curious looking camp.  You see a couple different campfires and at least two dozen tee-pee style tents down over there.  You can't make out who the inhabitants are though, at least not from here.  Odds are they aren't friendly though.  This is Craxil territory after all.  Of course, the humunculi in the multiple cave clusters over there aren't friendly either so what does it matter?  You still have no leads as to where to find the Craxil but you need to make a decision as to where to go.", "action_results": [{"action": "Investigate The Camp", "result": " \nYou cannot contain your curiosity about this camp but you know you should keep your distance and be careful.  They are likely hostile after all.  You remember that you are out in the open now so the sun will remove any advantage that the shadows had given you in the caves.  You decide to wait until nightfall, then slink in closer to the camp.  There is minimal rock cover but you manage to find a decent place from which to observe their camp.  They are goblins, armed with schimitars and polearms which you assume must be the work of the Craxil. \n\n \nEven outside the Craxil's domain, goblins are known for their hostility towards humans so approaching them would be stupid.  However, unlike the powerful humunculi you've had to deal with so far, goblins are a weaker enemy you feel confident you could stand against (provided you don't get yourself overwhelmed).  There are about 30 of the foul creatures wandering about the camp, but the one that catches your interest is the shaman.  Decked out in fancy garb and occupying a large tent in the center of the camp, it is clear this one is the leader.  It occurs to you that if they are working for the Craxil then this one might be able to provide you with some much needed leads as to where you can find him.\n\n \n\n \n \n \n \n \n \nYou are confident in your ability to handle a single goblin or perhaps even two if your life depended on it but certainly not the entire camp.  You're just a sneaky swineherd after all.  You wait until midnight, when most of the goblins have retired to sleep.  There are still a handful of night watchmen goblins though, and they will need to be dealt with before you can hope to reach the shaman's tent.  You also shudder at the thought of the shaman unleashing horrid magicks upon you.  Once again, you will have to use the element of surprise to make up for your lack of fighting experience but then... as a sneaky bastard that is your specialty.\n\n \nThe first concern is the single goblin standing at the closest entrance to the camp.  He is holding a polearm and needs to be removed before you can get into the camp.  As stated before, you are confident you can take him, but you need to be careful not to wake the rest of the camp in the process.  One idea is to sneak up on him and stab him through the back with your sword before he can react.  Another idea is to try and hit him with an arrow from a distance, then move on to the next target.  Either way, he needs to be removed.\n\n \n ", "action_results": [{"action": "Sneak Up And Stab Him", "result": " \nYou might be able to hit the broadside of a barn, but your aim is not sufficient for anything more than a general area.  You don't want to alert the goblin to your presence so you are just going to have to deal with him the old fashioned way.  Under cover of midnight you slink around to the edge of the camp and work your way along the side until you are close.  Despite your apparent lack of skill in fighting and archery you are an absolute master at sneakery.  But enough of such destracting thoughts.  As the goblin turns away you leap forth, cup his mouth with your left hand, and stab him through the back.  You pull the body away from the camp so none of the other goblins will see it.\n\n \nFortunately for you, none of the goblins seem stirred in the least.  You removed that problem without attracting attention.  Even better, another one of the nightwatchmen goblins has come back to the same post trying to figure out why his comrade is no longer at his post.  This affords you the opportunity to repeat the procedure and return once again.  The way to the central tent still has a few more problems in store for you.  Single goblins patrol the area and there is always at least one patrol goblin within sight range of that tent.  Also, the tent itself has its own nightwatchman who is evidently dedicated to the shaman.  At the very least, you need to kill one of the patrolling goblins to create an opening and the sentry guarding the tent.  With this done, you have a chance at abducting and interrogating the shaman for some much needed information on the Craxil.\n\n \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYou have some ideas on the patrolling goblin.  You could attempt to construct a simple foothold trap out of vine and add some barbs from the camp to dig into his foot.  Alternatively, you could wait until he rounds his usual tree and cut him down before the next patrolling goblin comes along.", "action_results": [{"action": "Construct A Barbed Foothold Trap And Place It In The Patrol's Path", "result": "You can't get caught if you aren't around when he trips the trap right?  Well, I suppose you could be, but whatever.  You spend a half hour or so of your time outside the camp constructing this trap.  The knot will tighten the loop around the goblins leg when I pull on the vine so I just need to get back into position and lay the trap.  As predicted, the goblin came back around with his usual path but this time he was a little bit to far to the right.  You pull the loop a bit closer and wait until the next one comes, but he is a bit too far to the left.  After some frustrating trial and error, a patrolling goblin finally steps foot in your loop and you tighten it abruptly around his foot.  At the same time, you quickly drag him towards your hiding spot so you can silence him.  Goblins are particularly light, especially when they are not wearing armor, so you are able to do it fairly easily.  The barbs dug into his foot so deep they nearly too it off.  You silence him with your hand then break his neck.  For a moment, you are amazed at what you have learned to do given you're just a swine herd, but then again... survival makes us capable of many things doesn't it.\n\n \nThe next patrolling goblin discovers the sword the last patrolling goblin dropped when you got him.  You are concerned that he's about to raise the alarm but he just mutters \"Akt Khazzat nighmam noriet maln\" or something along those lines and walks off.  You have no idea what he said, but from his tone of voice, you think he thinks the other watchman is skipping out on his duties.  Shit, does that mean the shaman will be able to speak English?  Surely he will, he's a shaman after all.  He better dammit.\n\n \nYou wait for the opening to come again, then quickly maneuver into position to stab the tent's sentry before the next patrol goblin comes around.  You peek inside to see the shaman sleeping (lucky you) and drag the sentry's body inside where it won't be detected.  You've reached the shaman, and he's still asleep, but you can't very well interrogate him here.  You pick up a candlestick from the nearby table and as he's coming to you clock him over the head with it.  You check for a pulse to see if he's dead or unconcious and thankfully, he's just knocked out.  You gag him and bind his arms behind his back because he won't be able to cast spells without his tounge and hand movements.  You use the same patrol opening to escape the camp and return to a spot distant from the camp.  You rouse the shaman to wake up and realize you are probably more scared than he will be.\n\n \n ", "action_results": [{"action": "Time For An Interrogation", "result": "Fortunately for you, he does know English as is readily apparent by the curses he chooses to expel regarding your parents.  You glare at him and ask him about the Craxil but he just squeals with laughter as if finding it difficult to take you seriously.  You ask him again and remove the gag so he can answer but then quickly put it back in when he starts trying to chant a spell of some sort.  You punch him and because you're such a wimp it ends up hurting your wrist more than it hurt his face, which only adds to his laughter.  You realize this isn't working as planned so you take him to where you stashed the bodies of the two nightwatchmen you killed at the entrance and draw your sword.  This seems to make a bigger impression upon him.  You take him back further away from the camp and inquire again.  This time he seems more receptive.\n\n \n\"The Craxil isn't something you can reason with or just strike down, he's an inspiration to the beastmen of this region.  A unifying force.\"\n\n \nThe shaman goes on to explain that the Craxil has been gathering his strength here for longer than the villagers realized and that the weekly raids for food were little compared to what is being organized.\n\n \n\"The Craxil isn't content to leave his children here in the mountains while the humans enjoy the soft lands.\" The shaman explains.  \"He isn't after world domination or anything, but he wants to take a few choice pieces of territory from the humans down below.\"\n\n \n\"What manner of creature is he?\"  you demand, keeping your sword out as a reminder of your unspoken threat.\n\n \n\"None of us goblins really knows for sure.  The riders deliver his orders to us and they are the only ones who have ever seen him.\"\n\n \n\"The riders?\"\n\n \n\"Yes, they were once human but umm... not anymore.\"\n\n \n\"You mean they were raised as undead!?!?!\"\n\n \n\"Heavens no, the Craxil doesn't resort to such disgusting practices.  Rather, they become his thralls after a lengthy, mind breaking ritual.  They do his bidding now.\"\n\n \nYou pause at that comment.  You've heard of mind flayers dominating people's minds like this but they've always been able to do so instantly, without the need for such rituals and practices.  Moreover, Brandolf insisted that the Craxil is a being unlike any that has been seen in this world so far.  You decide to change the topic to discuss the Craxil's location.\n\n \n\"Where is the Craxil located?\" you ask.\n\n \n\"Pff.  Do you even know where YOU are located right now\" the shaman says with a chuckle.  \"A bit far from home and looking a little lost out here aren't we?\"\n\n \nYou shove your sword closer to his throat and he ceases to taunt you.\n\n \n\"The Craxil resides in an underground cavern that is accessed from a canyon north of here.  When the rocks cease to be this familiar brown and start looking red then you are getting closer.  Even closer still when you begin to see the cactii.  The most direct route is the Redrange pass, though that has some dangers of its own.\"\n\n \nYou are about to inquire further about what else lies in store for you, but you hear the sounds of goblins in the distance and you are worried the shaman may start making noise for them.  You can't afford to be swarmed by goblins right now so you cut his throat and retreat a little until they return to camp.  Fortunately, the path he spoke of can be reached by simply going around the goblin camp from a safe distance and continuing in that direction.  You still have about a full days journey before you get to this \"Redrange Pass\" and even then you are only at the start of the shaman's directions.  But hey, at least you know where you are going now and have the knowledge that you've been going the right way all this time.  You just really hope that little shit isn't lying to you.\n\n \n ", "action_results": [{"action": "Onward", "result": " \nYou've gotten past the bulk of the humunculi and the goblins were refreshingly easy, but as you continue forward you shudder to think at what else may lie in store for you up ahead.  This nondescript plateau had dredged on for quite a while and still no sign of Redridge pass.  Suddently you reach a tunnel and you are dismayed to see a large troll blocking access.  Trolls are even stronger than humunculi so you won't be fighting this one anytime soon.  The tunnel represents the only way through to the other side as an inclimbable rockface extends in both directions along the plateau.  You're gonna have to get through that tunnel one way or another. \n\n \nYou remember that the shaman said that the Craxil uses riders to send its orders out to its minions and that these riders are basically human thralls.  Perhaps you could fake it to get past him.  Another option is your bow.  Trolls are very large creatures and therefore pretty hard to miss, even for you.  A final option is to try and distract it somehow.  You reason that you could cause a lot of commotion in the half-dead vegetation nearby to draw him away from the tunnel, then circle around and make a run for it. \n\n \n ", "action_results": [{"action": "Try To Trick The Troll Into Believing You Are A Thrall", "result": "You dawn your poker face and approach the troll expectantly.  You reason that you cannot hope to match a troll's strength but rather take advantage of their lack of intelligence.  As you approach, the troll glares at you and is clearly readying his club for a strike.\n\n \n\"I must report back to the Craxil\" you announce.  \n\n \n\"And who are you to see the Craxil\" the troll questions.\n\n \n\"I am a rider and have no time for your nonsense.  This report is very important.\"\n\n \nThere is a pause as the troll is thinking over your response.  Clearly, he isn't sure what to say or do in this situation.  It looks like this might actually work.  But then...\n\n \n\"Where is your steed?\" the troll asks.\n\n \nShit.  Of course, they're called riders for a reason and you haven't got any ride now do you?  Of all the rotten luck. \n\n \n\"He is ill, suffers the ick\" you manage, doubtful as to whether or not this will be taken.\n\n \nAt this point the troll isn't buying it.  You wish you had considered this before you attempted to lie.  Hard to take, being outsmarted by a troll.  Even harder to take is the club that has now crushed every bone in your body and left you a mangled mess.\n\n \nTHE END", "action_results": []}, {"action": "Draw Your Bow And Fire Upon The Troll", "result": " \nYou may only be able to hit a general area, but a troll is a very large and broad target so you have practically no chance of missing here.  You position yourself behind a large rock, just out of the trolls sight and ready your bow.  The troll is still completely unaware of your presence and just stands there looking bored out of his mind.  You pull out an arrow and draw it back in the string.  You take aim and release.\n\n \nThe first shot hits the troll in the navel but seems to deal minimal damage.  You draw back again and fire one into him, this time just below his chest.  He looks confused but now lumbers in your direction.  As you pull another one back he detects your presence and is now moving faster.  You put another one into his midsection but again this deals minimal damage.  You prepare to draw back another but he is upon you now.\n\n \nIt's too bad you forgot that trolls have exceptional regenerative capabilities.  It takes more than a few arrows to bring these things down.  Unfortunately, this is a lesson that has cost you your life.\n\n \nTHE END", "action_results": []}, {"action": "Create A Diversion To Lure Him Away, Then Run For It", "result": "The troll may be large, but something tells you it would take more than a few arrows to bring this thing down and you have no intention of getting up close to it for a bluff.  It takes time, but after making enough noise from cover you manage to get the troll's attention and lure him away from the tunnel entrance.  The creature lumbers slowly and cautiously towards the source of the noise and you are already working your way around from the other side.  Eventually you see your opportunity and make a break for it.  By the time the troll realizes you are there, you are already behind him and nearing the entrance to the tunnel.  He tries to stop you, but you are already inside and despite his best efforts to stop you, you are already beyond his reach.  He lets out a series of angry grunts and you continue onward through the tunnel.  Clearly all those years of playing capture the flag have served you well.\n\n \nAs you emerge from the other side, you begin to see the rocks getting more red and you take it as a sign that you are on the right path.  There was never much foliage in this mountainside but the area you are in now is especially rocky and devoid of vegetation.  You hope you will find the Redrange Pass soon so you can deal with the Craxil and be done with this quest. \n\n \n\nYou've been traveling a long time without sleep and dawn is starting to crack.  Somehow, the warm beams of sunlight raising up over the distant rocks make you feel sleepy.  As you continnue forward along the rugged expanse of jagged red rocks and dirt you discover the remains of an unused campsite.  The inhabitants are long gone, but the camp is still here.  A cozy warm campfire, soft, cottony sleeping mat, warm blanket, the works.  There are no enemies as far as the eye can see in any direction and you think you would probably be able to think better if you had some rest.  The warmth and coziness of this campsite is calling to you and since you haven't slept in almost 40 hours now, you begin to consider.\n\n \n ", "action_results": [{"action": "Curl Up And Sleep, You May Not Get The Chance To Later", "result": "You are going to need to stay awake if you want to keep your mind sharp, and you can't do that if you are sleep deprived.  It only makes sense that you would need to take a break in your journey and catch some much needed sleep.  Besides, the blanket is so warm, the mat is so cottony soft and the sun beams over your face are just wonderful.  You feel as though you could just curl up and hibernate like a bear and continue your sneaky journey at night.\n\n \nKind of lucky that you just happened upon such a nice, uninhabited camp huh.  I mean, what are the odds right?  Well... they aren't very high actually.  Actually, its pretty damn convinent isn't it.  It's at this point you start to get suspicious but by now it is too late.  The entire camp site dissipates into a thick black smoke and you feel as though you've just aged by 50 years.  You manage to stand but you can barely move.  This is when you notice all the skeletons on the ground that were not here before.  How could you not see them before?!?  They definitely weren't here before.  No way!\n\n \nThe billowy smoke takes form and suddenly it all makes sense in a terrible way.  The campsite was just a tempting illusion generated by a wraith.  Its terrifying to think that its intelligent enough to lure you in like this, and now that it has already sapped so much of your strength and lifeforce you know in your heart you are completely fucked.  Fear gives way to anger, which then gives way to desperation followed by pathetic pleading.  The wraith ignores it all and soon you are but a husk of a man and within a few weeks of decay you become just another skeleton adorning his trap.\n\n \nTHE END", "action_results": []}, {"action": "Focus & Discipline, You Need To Keep Moving", "result": " \nYou decide that there will be time to sleep when your journey is over.  Sleeping now would only make you vulnerable within Craxil territory and given the myriad of possible fates that may befall you we simply cannot take that chance now can we.  Then again, you have gone almost 40 hours without sleep so far and you aren't even sure if you are halfway there yet.  If you continue pushing yourself forth at this pace you may very well collapse.  Perhaps finding a safe place to rest isn't such a bad idea after all. \n\n \n\nAs you try to walk away you get the distinct smell of bacon.  You look back and see a skillet over the campfire.  It smells fantastic.  Strange that you didn't notice this earlier though.  The campsite seems to be calling to you, but of course that idea is completely absurd.  Your beginning to feel like that halfling Brodo Faggins, who traveled relentlessly on his journey without supplies or rest.  You suppose that given you've been an underappreciated swineherd your whole life, such an idea is a fun one to ponder.\n\n \nYou catch yourself stopping in your tracks, and starring at the food over the campfire and the mat on the ground.  \"How convinent\" you think, \"to have all that food within reach of the soft cotton mat.  You shake your head and try to shake it off but the temptation is grabbing at your attention.\n\n \n ", "action_results": [null, {"action": "Disciplie Man! You Can Do It!", "result": "No!  You sense there is something not right about this campsite.  There has been nothing but hostile creatures in Craxil territory so what benevolent creature would set something like this up for you?  The fact that there's food on the spit means it can't possibly be deserted as well.  Moreover, you are CERTAIN that the food wasn't there when you first laid eyes on this camp so something funny must be taking place.  It takes a considerable amount of willpower but you manage to turn away and continue walking the other way.\n\n \n\nAs soon as you do, the campsite dissipates into a thick cloud of black smoke and takes the form of a wraith.  It is clearly displeased that you were able to pass up its illusion trap but now it is poised to attack you directly.  It moves quickly and is capable of blocking your escape regardless of how you try and manuever.  Worse, it is noncorporeal so you aren't sure how effective your sword or arrows will be against such a creature.  And that's assuming your lame ass is even capable of landing a hit against such a swiftly moving creature.  You are beginning to panic until the next beam of dawn's sunlight strikes your face...\n\n \nThat's it!\n\n \nYou aren't sure if this is for real or not, but you remember your grandpappy telling you a story about a wraith a long time ago.  The hero lured it out of its cave into direct sunlight whereupon it incinerated on the spot.  Dawn is creeping up and you know that there will be direct sunlight soon.  You begin to frantically contemplate how you can stall the creature from killing you until the sun rises.  Then again, that was just a story.  Is there really even any relevance to it?  You don't want to waste your last bit of hope and time on this earth on something may only work in children's stories.  Perhaps you should go down with the sword in hand instead?   Who knows, you may even land a hit.  Certainly a more corporal hope than waiting for sunlight to save the day.  \n\n \n ", "action_results": [{"action": "Stall For Time By Asking The Wraith About Its Life Back When It Was Still Alive", "result": " \nOne thing you've learned about socializing is that people love to talk about themselves.  Whether young or old, man or woman, human or elf, all individuals love to talk about themselves.  Hell, given the opportunity you could probably talk for hours about your goals, your past romances, your problems, etc...  You don't think a physical strike against a noncorporeal being is likely to work and given its speed it is unlikely that you would get away so you really see no other option than to wait for the sunlight to come up.  The wraith circles you with considerable speed and you realize you don't have much time to strike up a conversation before it moves in for the kill.\n\n \n\"Tell me creature, what were you in life?\"\n\n \nYou get no response.\n\n \n\"How did you die?  Were you murdered or betrayed?  Why did you stay behind as a wraith?\"\n\n \nNo response.\n\n \nWhatever the wraith may have been in life, it no longer holds sway over what it is now in death.  Or if it does, the wraith refuses to recognize this.  In fact, he has been ignoring your attempts at conversation which draws you into a frightened panic.  Before long, he moves in for the kill and catches you off guard.  The black smoke that forms the visage of his being now envelopes you and you feel yourself growing old at an alarming rate.  Your bones grow brittle, your neck sore, your eyesight poor.  Soon you can no longer maintain your own body weight and collapse to the ground.  It isn't much longer before you lose conciousness.  The wraith finishes drawing out the last of your lifeforce then returns to set up its trap once more.\n\n \nTHE END", "action_results": []}, {"action": "Stall For Time By Insulting Its Lame Attempt At A Trap", "result": "You decide to insult its attempt at a trap to try and goad it into a conversation.  After all, a physical strike against a noncorporeal being is unlikely to end well for you and it is far too fast for you to run away from.  Dawn's light is just around the corner and you decide your best bet is to try and stall until then.  Right now the wraith is circling you with considerable speed and you realize you don't have long to engage its attention before it goes in for the kill. \n\n \n\"You should probably stick to direct conflict, that campsite of your's wasn't convincing at all.\"\n\n \nIt seems even the wraith have a sense of pride, albeit a very hateful one.\n\n \n\"It was enough for most of the mortals that come by this way\" it bellows defensively.\n\n \n\"Probably because you have only been preying on mindless humunculi and dim witted goblins\"\n\n \n\"The hell do I care?  Life is life.  Life repulses me.  Life scars me.  Life offends me.  I hate life in all its forms and will kill you no matter how smart you may think you are meatbag.\"\n\n \nDespite the harshness of his words you are actually encouraged to hear this.  The story you heard as a kid warned you that the wraith hate life and light.  Perhaps this means the part about the light is true as well?  The sun is starting to banish the shadows on the far end of the plateau you are on but it will still be quite a while before it reaches the two of you.  You decide to press the matter further.\n\n \n\"Life is simply a state of being, not altogether different from your own\" you retort.\n\n \nThe creature emits a loud, angry shriek and leans forth as if to shout in your face.  \n\n \n\"LIFE EXISTS ONLY TO BE TAKEN AWAY YOU FUCKING LOW LIFE EXCUSE FOR A BEING\"\n\n \n\"I'm a lowlife am I?  Last I checked you were the one who started baiting mortals with that campsite of yours, and not very well I might add.\"\n\n \nBy this point the wraith is mad and seems intent on intimidating you into accepting things his way.  This is good for you, you think.  As long as he is arguing with me, he isn't killing me and the sun is inching closer.\n\n \nNow he is not only posturing his face up close to yours, but he is walking towards you, forcing you to back up while he snarls his hateful remarks in your face.\n\n \n\"You mortals are concerned with your own entropic state of being, bringing chaos and disorder to the universe, as does the light you bask in that is born of heat.  I feel the disorder.  I HATE the disorder.  And I hate YOU.\"\n\n \n\"Well I'm sorry to hear you say that, but sometimes a little disorder can be a good thing.  The world would certainly be boring if it was predictable and uneventful wouldn't you say?\"\n\n \n\"SILENCE you ignorant creature.  Your ignorance pains me.  Your entropy pains me.  Your LIFE pains me.  I'm going to end it now you vile thing.  And do you know why?\"\n\n \n\nBefore you get a chance to let him gloat hate further the sun lifts and the wraith is basked in its light.  You are thrilled to see that the story you were told as a child was right.  The smoke becomes embers and he abruptly disappears from view.  Somehow you expected something a little more dramatic, but you're just glad to be alive.  And frankly, his quasi-intellectual hate speech was wearing thin.  I guess now you have a deeper insight into how wraith think... lucky you.\n\n \n ", "action_results": [null]}, {"action": "Draw Your Sword And Strike When The Time Feels Right", "result": " \nNo more running.  No more children's fables.  It is time to be a MAN!  You clutch your sword tightly and manage to compose yourself.  Fear still grips you but you aren't going to let it dull your abilities or steal your focus.  The wraith is circling you with considerable speed.  High pitched shrieks are emitted from the creature and the shrill quality of its voice makes you cringe.  You know that eventually he's going to have to make his move and try to attack you and you reason that is probably your best time to attack.\n\n \nIndeed, the wraith does stop himself directly in front of you and stares demeaningly at you, as if offended that you still presume to try and defend yourself.  He moves forward very slowly as if to intimidate you and you take a few steps backwards.  \"What are you doing?!?\" you shout at yourself and firmly plant your feet into the ground.  You aren't going to back down and you aren't going to run.  This creature is not taking you without a fight.  The creature comes to a stop just a few feet in front of you and you sense this is the best time to attack.\n\n \nYou lunge forward and plunge your sword deep into the creatures form.  The noncorporeal being seems to be unaffected and it is at this moment you realize that a physical attack is not going to work against this creature.  Unfortunately, by now it is too late as you've just launched yourself at the enemy with that strike and it is now upon you.  You begin to age rapidly until you are no longer able to hold your own weight and collapse to the ground.  It isn't much longer after this that you lose conciousness.  The wraith has drawn up all of your lifeforce and left you for dead.\n\n \nTHE END", "action_results": []}, {"action": "Run Like The Little Pussy You Are And Cry", "result": " \nYou take a deep breath, calm yourself, sheath your sword, then promptly soil yourself.  You are running and balling like a little girl without a date for the festival.  You feel something warm run down your leg.  You jump thinking the wraith touched you when in actuality you just peed yourself.  You run faster and faster, tears welling up in your face and suddenly the wraith just appears directly in front of you.  You stop yourself and bolt in the other direction but the creature does it again, and again.  No matter how you maneuver or how fast you run it is exceptionally faster and keeps popping up right in front of you as you run. \n\n \nEventually the wraith tires of toying with you and decides to simply drain your lifeforce right there.  The thick smoke that comprises his form now envelops you and you begin to feel increasingly old and frail.  Before long, you are no longer able to stand let alone run.  You collapse to the ground and lose conciousness as the wraith draws the last bit of life from you.  Satisfied with his meal, he returns to the rocky shoals and sets up his trap once again, obviously awaiting the next living thing to cross his path.\n\n \nIn the weeks that followed, several other adventurers are sent to try and put an end to the Craxil.  One of them recognizes your body from the villagers description and goes over to inspect you.  He gathers up your sword, bow, poison, and food rations and notices that you crapped yourself.  He succeeds in defeating the Craxil and upon his return to Jacquescrappe describes how you crapped yourself and died.  You watch helplessly from the afterlife as the village people and even some girls you used to like laugh uproariously at the news of your fate.  But hey, at least the village is safe now right?\n\n \nTHE END", "action_results": []}]}]}]}]}]}]}, {"action": "Wait Behind The Tree And Cut Him Down As He Comes Along", "result": " \nYou prefer to keep things simple and avoid the convoluted.  Besides, a barbed trap would likely make him scream out before you kill him would it not?  You hide behind a tree and wait for the next goblin to make his usual round.  As he comes about you plunge your sword into his chest and immediately grab him so you can hide the body before the next patrol arrives. \n\n \nYou wait for the opening to come again, then quickly maneuver into position to stab the tent's sentry before the next patrol goblin comes around.  You peek inside to see the shaman sleeping (lucky you) and drag the sentry's body inside where it won't be detected.  You've reached the shaman, and he's still asleep, but you can't very well interrogate him here.  You pick up a candlestick from the nearby table and as he's coming to you clock him over the head with it.  You check for a pulse to see if he's dead or unconcious and thankfully, he's just knocked out.  You gag him and bind his arms behind his back because he won't be able to cast spells without his tounge and hand movements.  You use the same patrol opening to escape the camp and return to a spot distant from the camp.  You rouse the shaman to wake up and realize you are probably more scared than he will be.\n\n \n ", "action_results": [null]}]}, {"action": "Put An Arrow In Him", "result": "You are concerned that if you were to get to close to him or the camp before he is taken out then you will be detected so it is best to deal with the problem from afar.  You pull an arrow back in your bow and wait until the goblin stops fidgeting around.  You were successful with this thing the last time you used it against that one humunculus, but you know that was just luck.  Besides, you aren't going to get a second chance this time.\n\n \nYou carefully aim at the goblins chest because that is the broadest target on his body and an arrow that lands there is likely to still prove fatal.  You wait for the wind to die down, pull the drawstring as far back as you possibly can, perfect your aim, and....................RELEASE!\n\n \nThe arrow sails through the air but fails to hit its target.  Actually, you overshot and the arrow tore through one of the peripheral tents.  You ready another arrow, but the goblin guard is aware now and so is the inhabitant of that tent you shot.  You manage to blow out the guards knee with the second shot (despite still aiming for the chest) but its no use as the camp is now stirring and the goblins are now being roused.  You pull back towards the humunculus caves you emerged from, hoping to find someplace to hide before they get their shit together.  You duck behind a large rock just outside the passageway you exitted from when you first arrived on this plateau.  The goblins have explored the area between you and the camp and they are drawing closer. \n\n \nThe shaman leads them into the passageway you came from and for a moment you think you're going to be safe...until one of the footsolder goblins detects your presence.  He lifts his spear above his head leaving you no choice but to thrust your sword through his abdomin.  Of course, now the other goblins are aware of your presence.  Reasoning your longer legs should enable you to outrun the goblins you take off and it looks like you might get away.  At least, that's what you thought until the shaman lands a fireball against you. \n\n \nTHE END", "action_results": []}]}, {"action": "Explore The Humunculi Clusters", "result": " \nPerhaps it is wise to stick with the enemy you know right?  Anyway, the creatures that have been attacking your village have been humunculi and while they are not the only creatures under the Craxil's command (according to Brandolf) they are the ones he seems to call on the most.  Perhaps you'll find clues to his whereabouts somewhere about in their dwellings.\n\n \nThe task of sneaking over to these cave clusters unseen is a challenging one.  You are out in the open now, so the sun is taking away any advantage that the darkness would otherwise have given you.  Also, a couple humunculi are standing outside in the open, in the front of the cave clusters you seek to gain entry to.  Realizing the impossibility of this situation, you fall back a bit and wait until nightfall to make your move.\n\n \n \nEventually the sun sets and the humunculi retire to their caves.  You slink over to their position using what little rock cover and shrubbery you have to conceal your approach.  Just as you reach the next rock for cover you feel something strike you from above and you lose conciousness.  Seems one of the humunculi noticed your approach and got you with a rock from a high vantage point.  You're surprised you survived such a blow but you soon wish you hadn't.  Your arms and legs are restrained with thick vines and it is clear you are about to become the meal for a handful of humunculi. \n\n \n\n \nTHE END", "action_results": []}]}]}]}, {"action": "Remain In The Corner And Hope To Be Undiscovered", "result": "Even if you succeeded in sneak attacking this one, what about the other two?  You cannot possibly hope to defeat two humunculi, especially without the element of surprise on your side.  Their monsters and let's face it, elementary school girls still best you at arm wrestling.  Your best bet is to remain in the corner and pray.  You sit there, hold your breath, and close your eyes.  This is probably for the best, because its all over before you realize what's happening.  The humunculus discovered you and struck you upside the head with such force that you suffered a fatal concussion.  On the plus side, you didn't feel a thing.\n\n \nTHE END", "action_results": []}]}, {"action": "Go Back The Way You Came", "result": "You are quickly beginning to wish Brandolf had given you a torch, but given the nature of your quest he probably figured you didn't need to draw attention to yourself.  Still, you can barely see more than a few feet in front of your face and it is only getting darker as you continue further inward.  You run your hand along the right wall and move carefully, scouting each step with your foot to avoid a fall.  Your heart is racing and you know that at any moment, something might come out and attack.\n\n \nEventually, the cave leads into a small inner chamber with a campfire in the middle.  Three humunculi are sitting around the campfire, roasting human limbs on a stick as if they were marshmellows.  Fortunately, they are not aware of your presence and the campfire enables you to see there are several tunnels leading out from this chamber.  On the other side of the chamber is a tunnel that goes deeper in, but you won't be able to go down this way undetected as long as the humunculi are here.  There are also nondescript passsageways to the left and the right (large and small respectively) that you can reach as long as you stay in the shadows.\n\n \n ", "action_results": [null, {"action": "Sneak Down The Small Right Passageway", "result": "You press your body firmly against the back wall of the chamber and slowly work your way around to the right passageway.  You pause whenever the campfire flickers light in your general direction, but the humunculi are completely unaware of your presence. ", "action_results": [{"action": "Continue", "result": "You reach a large but unoccupied chamber filled with rugged rock formations that hang from the ceiling and jut upward from the ground.  Clear pools of water dot the floor and in the distance, fireflies can be seen dancing around in the sky.  There is a large passageway on the left hand side of the chamber, and another passageway on the right, near the fireflies.  Despite hearing no sounds of any nearby creature activity, you decide it best to remain in the shadows and pick your next destination carefully. \n\n \n ", "action_results": [{"action": "Take The Large Passageway On The Left", "result": "You are quickly beginning to wish Brandolf had given you a torch, but given the nature of your quest he probably figured you didn't need to draw attention to yourself.  Still, you can barely see more than a few feet in front of your face and it is only getting darker as you continue further inward.  You run your hand along the right wall and move carefully, scouting each step with your foot to avoid a fall.  Your heart is racing and you know that at any moment, something might come out and attack.\n\n \n\nEventually, the cave leads into a small inner chamber with a campfire in the middle.  Three humunculi are sitting around the campfire, roasting human limbs on a stick as if they were marshmellows.  Fortunately, they are not aware of your presence and the campfire enables you to see there are several tunnels leading out from this chamber.  On the other side of the chamber is a tunnel that goes deeper in, but you won't be able to go down this way undetected as long as the humunculi are here.  There are also nondescript passsageways to the left and the right (large and small respectively) that you can reach as long as you stay in the shadows.\n\n \n ", "action_results": [null, null]}, {"action": "Take The Passageway On The Right, Near The Fireflies", "result": "You carefully maneuver towards the right hand passageway, eager to ensure your every step is as quiet and well placed as possible.  You step inside the passageway to discover a large pool with crystal clear water that is cool to the touch and ever so refreshing.  There sure are a lot of fireflies in this room though.  What was once a pretty sight is starting to get aggrivating.  As you lean in for another drink of water the fireflies start moving in closer around you and you soon realize that their touch kinda burns.  These things are definitely more malevolent than you initially suspected and you are racing to thing of any possible solution for this situation.\n\n \nThe simple solution would be to just run like hell through the swarm and back out into the chamber you came from.  Another idea would be to jump into the pool and submerge yourself so the fireflies can't hurt you.  Whichever you decide, you're going to have to act NOW.\n\n \n ", "action_results": [{"action": "Dive Into The Pool", "result": "You jump straight into the pool of crystal clear water and take care to submerge yourself as soon as possible.  As you suspected, the fireflies are reluctant to actually get in the water, preventing them from harming you.  You chuckle to yourself until you realize you need to breathe and there are no straws for you to breathe through.  You pop up for a quick gasp of air before submerging yourself again.  The fireflies are waiting en masse just above the surface and you begin to fully realize the position you've gotten yourself into.  The next time you pop up for air, one of the fireflies burns your upper lip.  The next time, two get your nose.  The pain makes you want to cry out and you have difficulty holding your breath under such circumstances.  You try to endure this, hoping they will leave, but waiting for you to emerge and then striking is like a game to them. \n\n \nEventually you can bear no more and spring forward for a long gasp of air.  At this point, a host of fireflies decend upon your face and before you know it, your flesh is seared through and through.\n\n \nTHE END", "action_results": []}, {"action": "Run Through The Swarm", "result": "This is no time to play around, these things hurt and you need to get out of here.  You charge through the heart of the swarm, flailing your arms and trying to get back out into the mainchamber as soon as you possibly can.  Their touch burns, and you are taking a lot of burns, but you are determined not to cry out lest you draw the attention of the caves other inhabitants.  Though it only took you a few moments to get back out to the main cavern, you have a multitude of small, circular burns on your arms, face, and sides.  It sucks, but hey... live and learn.  Even pretty things can be mean.  And you're still alive so there's that.  Time to continue on your quest.\n\n \n ", "action_results": [{"action": "Time To Continue On Your Quest", "result": " \nYou reach a large but unoccupied chamber filled with rugged rock formations that hang from the ceiling and jut upward from the ground.  Clear pools of water dot the floor and in the distance, fireflies can be seen dancing around in the sky.  There is a large passageway on the left hand side of the chamber, and another passageway on the right, near the fireflies.  Despite hearing no sounds of any nearby creature activity, you decide it best to remain in the shadows and pick your next destination carefully.", "action_results": [null, null]}]}]}]}]}]}]}, null, {"action": "Attack The Humunculi With Your Sword While They Are Relaxed", "result": " \nThese humunculi are blocking a passage that may lead to the Craxil; and the fewer of them there are, the less difficult it will be for you to have to sneak around.  You draw your sword and lung forth plunging it into the back of the nearest unsuspecting humunculi.  You swell with pride realizing that you have just killed your first monster, and a humunculi too!  Unfortunately, you have difficulty removing the sword from the humunculi's body and the others have immediately taken notice of you.  You attempt to run back out of the cave from whence you came, but the creatures are faster than you are.  They beat you savagely before bringing you back to their campfire for desert.\n\n \nTHE END", "action_results": []}]}, null]}]}, {"action": "Refuse The Offer And Tell The Assholes In Your Community Where They Can Shove Their New Idea", "result": "The people of Jacquescrappe have never really treated you with respect and you never really liked them either.  Moreover, you are offended by how many of them just agreed to send you in without even bothering to ask you how YOU felt about the idea.  You decide to return to your swineherding responsibilities and let the rest of the townspeople try to figure this out for themselves.  \"Fuck 'em\" you think as you leave the council chambers and return to the fields.\n\n \nIn the weeks that followed, several intrepid individuals attempted to reach the Craxil and never returned.  Many townspeople gathered together all the gold they had in hopes of putting together a reward for a worthy adventurer who might succeed in this task.  Many others were sent to the royal palace, begging desperately and fruitlessly for military assistance in their remote and low value settlement.  In the end, all these events failed and soon, the raids returned.\n\n \nIf the townspeople didn't like you before, they certainly hated you now.  While before you would sometimes get dirty looks or the occasional one word answer, they now ignore you completely wherever you go.  You insist that you had every right to refuse such a foolish plan, but most just dismiss you as being a selfish bastard.  You return to the fields to talk to \"oinky\" and \"snout\", the only friends that haven't turned their backs on you yet.\n\n \nIn the monthes that followed, numerous people are dragged off into the mountainside, never to be heard from again.  You smile as the fat hog of a woman with a barbed tounge that pissed you off the most is seen screaming while in the grasp of one of these creatures.  However, one night while you are cleaning up the digested remains of oinky's chili burritos you are surprised by two humunculi.  You may have enjoyed it when others you didn't like so much got carried off, but this time it is you.  You are never heard from again.\n\n \n\n \nTHE END", "action_results": []}]}]}]}