{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=36594", "context": "", "first_story_block": "Its a sunny Saturday morning, you are sitted on the staircase to your home sipping coffee and mulling over the day's newspaper after your routine morning run. Its a your rest day and you plan on tucking in the whole day having had 2 long weeks. Its been 2 years since you left the military and joined the Anti-Terrorism Unit having earned a medal of honor for saving your team from what would have been an overwhelming annihilation from enemy forces in Syria.\n\n\nNon-military life had its perks-relaxed time frames, more family time, no foreboding barking of commands and best of all a near-predictable life routine. Your walkie-talkie is rested on the floor next to you, just in case there were any alerts on the events frequency. \n\n\nJust then it chuckles to life as you turn a page on the newspaper.", "action_results": [{"action": "Pick up walkie-talkie", "result": "You pick up the walkie-talkie and reply \"Copy dog patch 6\"\n\n\n\"New events have come up that need your immediate presence\" replied the voice with an acute touch of urgency\n\n\n\"Errr, I am.........\"\n\n\n\"Its a level 1 situation, gather your team and get to M&T bank at Queensferry and Seagate immediately over\" cut in the voice \n\n\nYou jump onto your feet and run into the house. You dress quickly and run out. As you run out of your bed room remember you have not told your wife that you are leaving.", "action_results": [{"action": "Talk to your wife", "result": "You run to the kitchen where your wife is cooking. She smiles as she sees you. You quickly peck her on the cheek and you tell her that you have an urgent work situation. She understands and bids you goodbye.\n\n\nYou rush out and jump onto your SUV and pull away from the parking lot in a hurry. 15 minutes later you get to your designated location and notice a number of police vehicles with their hazard lights on. Your team is already on site and awaiting further orders. You alight half running and your assistant Special agent in charge hands you your protective gear and gun. He briefs you on the situation on site and waits for your command. You assess the situation including all exit routes from the building.\n\n\nThe terrorists have held hostage a total of 27 customers and 12 employees of the bank.They demand that a well known terrorist be released or hostages will be executed by the hour. You learn that the terrorists had planned their stay with enough food supplies for 3 days and were not planning to leave anytime. Delaying tactics would not work.\n\n\nYou look at your watch and you only have 4 minutes until the 1st hostage is executed. Your assistants holds the line for the Director National Security Branch, just in case you decide to negotiate.\n\n\n\"We are running out of time sir\" He urges \n\n\nSnipers were in position and the team had also taken the front  and back entrances", "action_results": [{"action": "Call Director to release prisoners", "result": "You decide that its not worth losing hostages over a single prisoner. Furthermore, it would be easier to trace a group of escaping terrorists running across the country with all the inter-agency resources at your disposal.\n\n\nYou call the Director and he shares your views after assurance of the mission's success. You promise him that you would not let the terrorists escape. He barks vehemently on the phone and lets you know that if they escape you would be answerable.\n\n\nYou immediately call back the terrorists and inform them of the decision to comply with their demands. The terrorists demand that their prisoner be put on a plane to a destination that would be disclosed once the plane was airbound. You make the arrangements and go back to looking at the floor plans.\n\n\nYou notice an underlying old waterway below the building's blue print.\n\n\n ", "action_results": [{"action": "Inquire about the old waterway", "result": "The building was renovated a decade ago and the old waterways were sealed with waterproof cement. It had remained unused for the period of time. The drainage had a diameter of about a meter and led to an abandoned septic tank 3 blocks away.", "action_results": [{"action": "Follow up on the waterway", "result": "You call your assistant and assign him an assault team of 10 strong. You send them to the septic tank and brief them. The team leaves and lays ambush at the location.\n\n\nAs the second  team drives away enroute to their location they catch a glimpse of a bomb set near the second floor window manned by one of the terrorists and let you know about it. You call your bomb expert and brief him. He examines the location and confirms that it was indeed a bomb. He tells you  the good news  that the bomb had to be manually set off to go off after a 5 minute timed delay.\n\n\nYou wonder whether it is better to shoot the 2nd floor terrorist first and send the bomb expert to dispose it but risk a panic by the terrorist who may shoot the hostages or\n\n\nTake out the 2nd floor terrorist during the surprise attack and takeover the building without risking the hostage deaths by shooting", "action_results": [{"action": "shoot 2nd floor terrorist first", "result": "You decide to first shoot the 2nd floor terrorist and send the bomb disposal expert. A sniper takes out the 2nd floor terrorist. The rest of the terrorists seem not to notice. You send in the bomb disposal expert through a fire escape collumn at the side of the building. He gets to the location and as he attempts to tinker with it another terrorist gets into the room and shoots your expert. Immediately he rushes to arm the bomb and is shot too by your sniper as he runs away. Hostages begin running out of the building but as they run out, an explosion tears the yard around the buidling throwing away debris .\n\n\nYou are thrown away by the force and find yourself in a nearby ditch after a while. You stand up and look around, your ears ringing from the explosion.\n\n\nYour entire team is wiped out.\n\n\nYou limp towards the entrance of the building to inspect the building. Debris is scattered all over the floor and the hall is obscured by a plume of smoke and dust settling from the explosion. you manage to reach the open vault. It has been plundered with cash bundles strewn on the floor. Its seems the robbers stole what they could carry.\n\n\nYou limp back to the banking hall and notice a hole on the ground but before you approach it you notice your leg is bleeding profusely and tear off a piece of cloth from the debris to bandage the wound. Just then an ambulance parks at the front entrance with its sirens blaring. A paramedic runs into the bank and looks around the bank for survivors that might need help.\n\n\nHe runs back towards you. \"You don't look good,\" he proclaims as he proceeds to examine your leg.\"You need to go to hospital.'' You barely hear his voice.\n\n\nOut of confusion you don't say a word. Your ears are still ringing from the explosion. Just then you remember that your second team was laying an ambush at the end of the tunnels. The medic holds your hand towards the exit and you see a police vehicle idling with its doors open. You could easily jump into the vehicle and drive to the ambush site but your leg hurts", "action_results": [{"action": "Go to the ambush", "result": "You decide that there is unfinished business to attend to. You call a police officer who has just arrived , introduce yourself and inform him that the robbers might have escaped through the tunnel. He immediately gathers a team of 10 officers and plans to enter the tunnel. You get into the police vehicle and drive away towards the old septic tank.\n\n\nYou get there and find a fire fight taking place. The robbers seem to be heavily armed and pin down your officers. Your team is annihilated and taken down. You pick an M16 rifle and join the fight. You tactically try to  delay the robbers from leaving until the police officers in the water tunnels arrive.\n\n\nYou run out of ammunition  and you find yourself surrounded by the 5 masked men. They get to your position but hesitate once they see your face. the leader of the team raises his arm and clenches a fist to command the men to hold fire - special forces style. As you wonder why you are being spared a 5th man emerges from the tunnel and shouts \"tunnels are boobytrapped.\" He screeches to a stop when he notices you lying on the floor like a deer amidst a pack of wolves.\n\n\nYour eyes meet and for a moment your faces show bewilderment. \"Jack? Is that you?\" He looks down. The rest of the men peel off their masks.", "action_results": [{"action": "Unlikely reunion", "result": "\"Rohn, Lewis, Sean, Larry and Beck\" you muse  as you stand up to regard them.\n\n\nThey were all part of another team of your  special forces unit that had been regarded Killed in Action during a search and rescue mission two years ago in a Siberian bank heist. The discovery finally solved a mystery in which both the team, the robbers and the money were never found.\n\n\nYou remain speechless as the revelation hits you piece by piece. No wonder the heist was executed with pin point precision.\n\n\n\"We don't have time.\" muttered Jack. He picks a box full of cash and places it at your feet and signals the team to pack off.\n\n\nYou are still in a dilemma as the team leaves you standing and walks away towards a parking lot guns in hand.", "action_results": [{"action": "Take the cash and walk away", "result": "You decide its too dangerous to pursue the team of  elite ex-military men. In addition you have alot of cash to spend, retire and make  your family comfortable. You pick up the box of cash and walk away towards a taxi at the corner of the block. You get in and travel back home. You count the money and find amounts in excess of 20 million dollars.\n\n\nYou hide your find and head back to hospital for treatment. Your boss later visits you in  hospital and lets you know that a team of policemen spotted the robbers splitting the stolen money near a parking lot. They managed to dispose an explosive devise planted at the scene  and were reviewing nearby CCTV surveillance cameras to identify the culprits.\n\n\nYour heart beats palpitatingly as you listen to the Special Agent in Charge. The boss is a close friend who always respected you for your professional records. You wonder whether you should confess that you took some money from the team and split the spoils or let the investigation take its course since there was a chance the video surveillance might not reveal his identity at the parking lot", "action_results": [{"action": "Confess to the Special agent in charge", "result": "You trust your boss and call him aside where you narrate to him the story. He keeps quiet the whole time and asks where the money was.\n\n\nYou lie to him that it was hidden at your office drawer, just in case he did not comply with your suggestion. He immediately summons 2 agents accompanying him to the hospital.\n\n\n\"Place special agent Jasper under arrest until you hear from me\" he commands and leaves you handcuffed to the hospital bed.\n\n\nYou ask the two agents to allow you to make a call to your wife and since they know you they agree. You call your wife and you let her know the situation. Fortunately you had told her about the days events and she understands your predicament and stashes the loot elsewhere. The CCTV surveillance reports come out and fails to reveal your identities. The heist team was clever enough to cover their tracks and destroyed the camera a day before the heist.\n\n\nYou are let free for lack of evidence and your boss is fired for implicating a decorated member of the National Security Division.Your retire from the force with full honors", "action_results": [{"action": "3 months later", "result": "You are sitted on your porch sipping coffee and reading your newspaper. Your phone rests on the small coffee table. you pick up the call from a strange number.\n\n\n\"Hi Jasper, its Jack Zulu,\" ready for the next mission?\"", "action_results": []}]}, {"action": "Keep quiet about your meeting with the robbers", "result": "You don't trust your boss. He is a stickler for rules and he may report you. You let the incident go and sit there listening to him.The CCTV surveillance reports come out and fails to reveal your identities. The heist team was clever enough to cover their tracks and destroyed the camera a day before the heist.\n\n\nYou recover and go on with your duties in the force to avoid suspicion. You plan to keep a low profile and retire in the next 2 years.\n\n\n ", "action_results": [null]}]}, {"action": "Warn the police officers and pursue the robbers", "result": "You warn the officer that there was an explosive rigged to blow in the tunnel. You wait for backup and decide to pursue the team.\n\n\nAlthough your backup sustains injuries and deaths you manage to arrest 2 of the men and recover a total of 112 million dollars. You also save the lives of 10 police officers. You receive a presidential commendation and are appointed the director of the National Security Division.               ", "action_results": [{"action": "Retribution", "result": "You are at your office when you receive a call that a group of terrorists have held hostages in a nearby bank. The terrorists demand that you be handed over to them in exchange for the release of the hostages. the president gives you a call and lets you know that he trusts your judgment. As you deliberate on the matter a hostage is shot dead.\n\n\nYou assess the situation. 1 life for many.......seemingly fairtrade.", "action_results": []}]}]}]}, {"action": "Go to hospital", "result": "You decide to let your assistant handle the situation. You get onto the ambulance and go to hospital. You later learn that the ambush team was wiped out in the attack and another 10 police officers were killed by explosives. A total of 112 million dollars was stolen from the bank.\n\n\nYou are tried for negligence and lose your job over the your team and the police officers' deaths.", "action_results": []}]}, {"action": "Surprise attack", "result": "You decide a coordinated surprise attack would be more effective in arresting the fallout from the hostage situation.\n\n\nYou order your sniper to shoot the terrorist on 2nd floor and shoot anyone entering the room when the attack commences. You give the command and the attack is made. All hostages run out of the building but the terrorist disappear through the underground water tunnels. You alert your team laying ambush to expect  company at their end.\n\n\nYou jump into a waiting car and rush to the ambush site", "action_results": [null]}]}, {"action": "Ignore waterway and focus on the current location", "result": "You decided the waterway is too old and is sealed. In addition you know that the terrorists were most likely to use the hostages to escape. It would be a waste of resources to send another team to the septic tank and you would rather focus your attention on the current location", "action_results": [{"action": "Prisoner release", "result": "After 20 minutes the prisoner has boarded the plane and is airborne. You inform the terrorists that their prisoner is airborne. The terrorists demand that the plane land at a secondary private airstrip near the border and be handed to a team waiting to transfer him to a jet.\n\n\nYou weigh your options. If you complied with their actions,the prisoner is likely to escape since you were not allowed to pursue targets across the border, otherwise it would spew diplomatic rows as it would be seen as an act of war.\n\n\nIf you detained the prisoner, the terrorists are likely to kill all the hostages at the bank. Both options were not tenable but a choice had to be made", "action_results": [{"action": "The bluff", "result": "You decide to release the prisoner and decide to accompany the team escorting the prisoner to the strip. You get to the airstrip and find a jet ready to leave. You realize there is no way of retaining the prisoner and that the best way is to first ensure safe custody of hostages.The prisoner embarks on the jet and you rush back to the plane to coordinate the hostage release. As your plane nears the city you see a billow of black smoke rising to the sky.\n\n\nYou learn that your entire team has been wiped out.  As you are still pondering, your cell phone rings. It is your brother's wife calling.You pick up the call and listen.\n\n\n\"Halo........he is gone, he is gone\" sobs your sister in law\n\n\n\"who is gone? where....\" You ask\n\n\n\"Tim was killed in the attack\"she answers and continues to cry until the line goes dead.\n\n\nYou  hold your head in anguish\n\n\nLater on you discover that the prisoner release was a trick diversion to draw your attention away from the  bank. A large consignment of cash was stolen through abandoned underground waterways and the bombs set off anyway by a group believed to be ex-military personnel.\n\n\n \n\n ", "action_results": []}]}]}]}, {"action": "Ignore the waterway and focus on coordinating the release", "result": "You decided the waterway is too old and is sealed. In addition you know that the terrorists were most likely to use the hostages to escape. It would be a waste of resources to send another team to the septic tank and you would rather focus your attention on the current location.", "action_results": [{"action": "Prisoner release", "result": "The terrorists demand for their prisoner to be put on a plane whose destination would be disclosed once it was airborne.\n\n\nAfter 20 minutes the prisoner has boarded the plane and is airborne. You inform the terrorists that their prisoner is airborne. The terrorists demand that the plane land at a secondary private airstrip near the border and be handed to a team waiting to transfer him to a jet.\n\n\nYou weigh your options. If you complied with their actions,the prisoner is likely to escape since you were not allowed to pursue targets across the border, otherwise it would spew diplomatic rows as it would be seen as an act of war.\n\n\nIf you detained the prisoner, the terrorists are likely to kill all the hostages at the bank. Both options were not tenable but a choice had to be made\n\n\n ", "action_results": [{"action": "The bluff", "result": "You decide to release the prisoner and decide to accompany the team escorting the prisoner to the strip. You get to the airstrip and find a jet ready to leave. You realize there is no way of retaining the prisoner and that the best way is to first ensure safe custody of hostages.The prisoner embarks on the jet and you rush back to the plane to coordinate the hostage release. As your plane nears the city you see a billow of black smoke rising to the sky.\n\n\nYou learn that your entire team has been wiped out.  In addition, a cash consignment of 112 million dollars has been stolen from the bank by the robbers  who escaped through underground waterways. The prisoner release was a ruse to distract you from the escape.\n\n\nYou are tried for negligence and for the death of your team. \n\n\n ", "action_results": []}]}]}]}, {"action": "Launch a surgical strike with unknown casualties", "result": "You decide to launch a surgical strike but you don't know the number of  casualties that would be injured . As you read through your plan for the final time you notice some old abandoned underground waterways  beneath the building.", "action_results": [null]}]}, {"action": "Run outside the house", "result": "You decide that you don't have the time to talk to your wife and you rush out ,jump onto your SUV and pull away from the parking lot in a hurry. You step on the accelerator as you hit the highway.\n\n\nMeanwhile your wife rushes outside and finds the SUV tearing away from the parking lot at high speed. Unaware that it was you driving away, she immediately thinks the car has been stolen and rushes to call the police to report the theft.\n\n\n\"What is your emergency?'' Asks the telephone operator on the other end\n\n\n\"I am reporting a stolen vehicle\" she replies\n\n\nShe describes the vehicle  and  its last seen location.\n\n\n\"We have officers on that road, just give me a moment.\"\n\n\nThe line goes quiet for a moment and then the operator speaks,\"officers have placed a road block on all roads.we shall inform you of all new developments. meanwhile stay in touch in case we need clarification.\"\n\n\n ", "action_results": [{"action": "Roadblock", "result": "You have been driving at high speed for the last 4 minutes. Suddenly you notice a traffic jam forming ahead of you. You pull out of the road and drive along the walk way honking as you snake your way through the lines of vehicles. You get to a junction and an officer signals for you to stop. Before you explain your situation 3 officers point guns at your face as the rest close the road. \n\n\nThey force you out the vehicle and cuff you on the ground. As you try to explain yourself you are whisked away and the vehicle is searched for weapons. They find a walkie-talkie and service pistol and they immediately take you to a police station 20 minutes away. Unfortunately you have forgotten your badge and cannot prove that you are an agent.\n\n\nThe 1st opportunity you get to speak is at the interview room when you are being questioned. You explain the day's predicaments and by the time you finish your wife appears in the questioning room. She informs the police that you are her husband and they let you go after apologizing. They hand you back your pistol, walkie-talkie and car. Just as you are about to leave the station you catch a glimpse of the television at the reception.\n\n\nIt has been the perfect rest day. You lie on the couch and switch on the Television. There is breaking news showing terrorism attack in your city. 139 civilians and 23 agents of the Anti-terrorism Unit are reported dead from an explosion that rocked a bank in your city. The terrorists are said to have demanded for release of a well known prisoner but the security forces decided to launch an attack to rescue the hostages. Unknown to them, the whole building had been rigged to blow in case a rescue mission was attempted.\n\n\nYou shoot to your feet, mouth agape as you take in the bad news. Your whole team has been wiped out  in the attack. As you are still pondering, your cell phone rings. It is your brother's wife calling. \n\n\nYou pick up the call and listen.\n\n\n\"Halo........he is gone, he is gone\" sobs your sister in law\n\n\n\"who is gone? where....\" You ask\n\n\n\"Tim was killed in the attack\"she answers and continues to cry until the line goes dead.\n\n\nYou fall onto your knees and hold your head in anguish\n\n\n \n\n ", "action_results": [{"action": "Retribution", "result": "You pull out of your grief in an instant. You call your senior and learn that the explosion has devastated your security force. You jump into your SUV and hit the road once more. Its a furious drive to the site and your feet hit the ground as the car screeches to a halt. You can feel adrenaline coursing  through your veins as you walk over the site to look for clues, the kind that you usually felt when jumping off planes and dodging bullets back in the army.\n\n\nA couple of rescuers are on site to pull the hostages from the  debris. Your eyes pore over as you look for what could be the bodies of the dead terrorists.\n\n\nA gaping hole welcomes you to one corner office at the far left of the banking hole. You peer into the hole and discover an underground tunnel. It seems old  but wide enough to snuggle through. None of the bodies outside matched the profile of terrorists. You realize this could be the gunmen's escape route.\n\n\n \n\n ", "action_results": [{"action": "Pursuit", "result": "You look around you and notice an armored truck pulling over at the bank's foyer. Its a replenishment of agents from your force. You immediately talk to a team leader disembarking from one of the vehicles.\n\n\nYou walk over your findings with him. He spreads out  a security map indicating old underground tunnels leading to an abandoned septic tank 3 blocks away. He assigns you a 10 man detail  and a vehicle and selects another 10 men to pursue the attackers from the bank through the tunnels.", "action_results": [{"action": "Go to the ambush", "result": "You get there and immediately you alight from your vehicle a fire fight begins. The robbers seem to be heavily armed and pin down your officers. Your team is annihilated and taken down. Your  M16 rifle  runs out of ammunition  and you find yourself surrounded by  5 masked men. They get to your position but hesitate once they see your face. the leader of the team raises his arm and clenches a fist to command the men to hold fire - special forces style. As you wonder why you are being spared a 5th man emerges from the tunnel and shouts \"tunnels are boobytrapped.\" He screeches to a stop when he notices you lying on the floor like a deer amidst a pack of wolves. \n\n\nYour eyes meet and for a moment your faces show bewilderment. \"Jack? Is that you?\" You ask as he looks down. The rest of the men peel off their masks.\n\n\n ", "action_results": [{"action": "Unlikely reunion", "result": "\"Rohn, Lewis, Sean, Larry and Beck\" you muse  as you stand up to regard them.\n\n\nThey were all part of another team of your  special forces unit that had been regarded Killed in Action during a search and rescue mission two years ago in a Siberian bank heist. The discovery finally solved a mystery in which both the team, the robbers and the money were never found. \n\n\nYou remain speechless as the revelation hits you piece by piece. No wonder the heist was executed with pin point precision.\n\n\n\"We don't have time.\" muttered Jack. He picks a box full of cash and places it at your feet and signals the team to pack off.\n\n\nYou are still in a dilemma as the team leaves you standing and walks away towards a parking lot guns in hand.\n\n\n ", "action_results": [null, {"action": "Warn the agents and pursue the robbers", "result": "You warn the agents pursuing from the tunnels that there was an explosive rigged to blow in their way. You wait for the backup from the tunnels. They manage to locate the trap and dispose the explosives. You lead the team onto the waiting vehicle and with the help of a surveillance operator, pick up the gunmen's trail leaving the city.\n\n\nIts a close quarter gunfight, the mainstay of the special forces trained crew you were pursuing.Armed with M16 rifles, the supposed terrorists returned the favor; shooting to kill with every opportunity they got. They change their objective from running to defending to attacking. You take a quick count of your team and realize that your team was taking more than it was giving and order a cease-fire.\n\n\nThe robbers roll back into their vehicles and leave you licking your wounds. Luckily you have managed to kill two of their crew members.  You hand over the cash given to you by the crew and you are commended for showing valor.\n\n\nThe president awards your  team posthumously silver stars for uncommon bravery. You are appointed director of the national security force after 2 months and you take the job half-heartedly, thinking of the men and women who lost their lives in the siege", "action_results": [{"action": "3 months later", "result": "You are at your office when you receive a call that a group of terrorists have held hostages in a nearby bank. The terrorists demand that you be handed over to them in exchange for the release of the hostages. The president gives you a call and lets you know that he trusts your judgment. As you deliberate on the matter a hostage is shot dead and thrown over a 6th floor balcony in the full glare of the media.\n\n\nYou assess the situation. 1 life for many.......seemingly fair-trade.", "action_results": []}]}]}]}]}]}]}]}]}, {"action": "Do not pick up walkie-talkie", "result": "You look at the walkie-talkie. Its not your job since you are on rest. You had promised your wife to stay at home and play with the kids. More so, there were other Special Agents in charge to lead the team.You turn to the next page and proceed to read the news paper ignoring the call.\n\n\nThe line goes quiet and you forget the whole incident. You can smell something sweet coming from the kitchen and you cant wait to have  the good meal.", "action_results": [{"action": "Perfect rest day", "result": "It has been the perfect rest day. You lie on the couch and switch on the Television. There is breaking news showing terrorism attack in your city. 139 civilians and 23 agents of the Anti-terrorism Unit are reported dead from an explosion that rocked a bank in your city. The terrorists are said to have demanded for release of a well known prisoner but the security forces decided to launch an attack to rescue the hostages. Unknown to them, the whole building had been rigged to blow in case a rescue mission was attempted.\n\n\nYou shoot to your feet, mouth agape as you take in the bad news. Your whole team has been wiped out  in the attack. As you are still pondering, your cell phone rings. It is your brother's wife calling. \n\n\nYou pick up the call and listen.\n\n\n\"Halo........he is gone, he is gone\" sobs your sister in law\n\n\n\"who is gone? where....\" You ask\n\n\n\"Tim was killed in the attack\"she answers and continues to cry until the line goes dead.\n\n\nYou fall onto the couch and hold your head in anguish", "action_results": [null]}]}]}