{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=38542", "context": "", "first_story_block": "", "action_results": [{"action": "Alien Abduction", "result": "It was the start of summer and you really wanted to be doing what you had planned for many months: sleeping. Well, of course you weren't going to sleep ALL day, but you certainly were not planning on getting up a five in the morning just so you could go stand in line... and then stand in line again... and then again.\n\nSummer had arrived and while you had planned to spend the week sleeping and gaming, your parents had decided that instead you were going to spend a week with Aunt Mary. You really didn't have anything against Aunt Mary, but she was pretty plan and boring. Worse, she lived in a town with absolutely nothing to do. Last time you spent a week there, you spent most of the week sitting on the front porch watching the grass grow. Sure, you might catch up on some of your sleep in the first part of the week, but she didn't have a gaming system, so you knew you were going to be seriously bored. Then again, it's not like anyone asked you what you wanted to do. So you got up early and rode to the airport.\n\nAfter getting dropped off, you stood in the line to check in. The days of the skycap were over, you know, because of \"terrorism.\" Instead you had to walk inside and stand in line for an automated kiosk. You managed to make it through the line only for the machine to tell you that you had to check in at the agent counter. You trudged over to that line and waited at least 30 minutes before you made it to the front of the line. You handed ID, she pressed about 500 keys, then took your luggage with a seriously fake smile. This was really going to be a long day.\n\nThinking about Aunt Mary's tiny house, you headed over to the security line. Of course there were about 1,000 people in that line, most of them confused when the blue-uniformed Wal-Mart greeters told them they had to take their shoes off. Or leave them on. For some reason, some people had to take shoes off and some did not. The confused ensured the line would continue to move very slow. That and the \"special\" people who managed to cut into the front of the line after paying some bribes or some crap. You were just glad that when you finally got to the front of the line and through the scanners that you didn't get felt up by the goofy guards.\n\nNext you had to wait for your plane to start boarding and then watch as all the people who were not called to board ran to get in line first. You had a ticket with an assigned seat, so you just waited until your row was called and then went to stand in line yet one more time. As you walked down the aisle of the plane, you counted the seats and knew before you finished counting that the seat next to the really fat guy that was having trouble breathing was your seat. Hooray for coach seats! At least you had the aisle seat so you wouldn't be squashed into the wall of the plane. You took your seat, fastened the stupid seat belt, and promptly closed your eyes, trying to ignore everyone and everything around you.\n\n\nAt some point in time, you woke up, wide awake. You're not really sure why you woke up. The plane was filled with the sound of airplane noises. You looked around and realized that there was some sort of odd greenish light coming in through the windows of the plane. A few people started talking about just that as more noticed it. You heard a popping sound and looked around for the source. Everything looked normal, but then you heard someone towards the front of the plane yell. You stood up, like most of the plane, and looked towards the front. Suddenly there was another popping noise, and half the people in front of you simply disappeared! They were there one moment and not the next. More people started to yell and run into the aisle. There was another pop, and everyone in front of you disappeared. You looked around towards the rear of the plane, and saw others staring at you, eyes wide open. Then there was another popping sound and suddenly blackness...", "action_results": [{"action": "Continue...", "result": "When you start to wake up, you feel cold. Actually, mostly just your rear end feels cold. And quite uncomfortable for some reason. You slowly open your eyes and blink in the bright white light. You realize that you're lying down on your back and your pants are down around your ankles. You are lying on a cold metal table. Well that explains why your rear end is cold, but why does it feel like...\n\nYou sit up and look around, pulling your pants up. You are in a small, strange, round metal room. The floor is flat, but the silver metal walls curve up and around, creating almost a bubble. You are sitting on a table in the middle of the room and there is a large machine of some sort sitting right next to you. It has long probes on it that are pointed in your direction. Fortunately, none of them are moving at the moment, but your butt clenches as you stand up from the table.\n\nThere is an opening in the wall to the east that leads into a hallway, but you don't see any other ways out of this room. The floor and walls appear solid, but they also appear to be glowing a little, enough to provide light so that you can see all around you.", "action_results": [{"action": "Head out of the room to the east.", "result": "You stand at the west end of a long hallway. The walls are silver and curve up and around the ceiling so much that you feel like you are walking in a long, strange tube. The floor is flat and level, but there are small dips at the edge, looking almost like gutters that you would find on the roof of a house, but not quite as deep.\n\nTo the west is the room where you first awoke with the strange table and probes that make you feel strangely uncomfortable. The hallway continues to the east, slowly bending out of sight to the right. To the south is a rounded doorway that leads into a well-lit room that looks like it might have some other metal tables in it.", "action_results": [null, {"action": "Go east towards the east end of the hallway.", "result": "You stand at the east end of a long hallway. The walls are silver and curve up and around the ceiling so much that you feel like you are walking in a long, strange tube. The floor is flat and level, but there are small dips at the edge, looking almost like gutters that you would find on the roof of a house, but not quite as deep.\n\nThe hallway continues to the west, ending in a doorway at the other end. To the south is a rounded doorway that leads into a dark space. Off to the east, the hallway goes through a rounded archway, then twists around to the south.", "action_results": [null, {"action": "Go through the doorway to the south.", "result": "This room is a small round room, very similar in size to the room where you started. As you walk into the room, lights appear making the rest of the room visible. Instead of tables and probe machines, this room has two medium-sized cages in it and nothing else. The cages are about four feet tall and have bars on all side.\n\nThe cage on the right contains a furry creature, at least you assume it is a creature. All you can see at the moment is a large, purple ball of fur. The fur looks long and thick, and you feel like you want to pet whatever that thing is. As you watch it, it rolls a little in the cage, almost towards you. You think you see a glimpse of eyes and teeth through the fur, but you can't be sure...\n\nThe cage on the left appears to be empty.", "action_results": [null, {"action": "Open the cage that appears empty.", "result": "When you approach the apparently empty cage, you notice that the latch on top is not quite closed all the way. By simply grabbing the side of the cage and pulling, you find that you can open the cage up all the way. When you do, you realize that the cage is indeed quite empty. Except...\n\nAs the cage opens, you get a glimpse of something at the bottom of the cage, right where the door swings open. When you move the door again, you see something red. Giving the cage a shove, you reveal some sort of small red card. Picking it up, it just looks like a small piece of plastic, completely red. It has no other identifying marks on it at all.", "action_results": [null, null]}, {"action": "Open the cage with the creature in in.", "result": "You are in the center console room.\n\nThere is a device in the center of the room in the shape of a large pyramid, over eight feet tall. Each side of the pyramid is a different color. One is red, one is yellow, one is blue. Near the floor of each side of the pyramid is a small lever that looks like it can be pushed down, perhaps with a foot. There is also a small slot in the middle of each side of the pyramid. There is a large black lever on the wall.\n\nThere are openings in the walls in four different directions, all leading into open, curved hallways.", "action_results": [{"action": "Step on the Red Lever.", "result": "The lever does not move at all.", "action_results": [null]}, {"action": "Step on the Blue Lever.", "result": "The lever does not move at all. It appears to be stuck.", "action_results": [null]}, {"action": "Step on the Yellow Lever.", "result": "The lever does not move at all no matter how hard you step on it.", "action_results": [null]}, {"action": "Press down the Black Lever.", "result": "The lever moves as you push it. It slides down with little effort. When you let go of the lever, it gently slides back into the starting position.", "action_results": [null]}, {"action": "Exit the area to the east.", "result": "This is another hallway, much like the hallways you have traveled before. There are the curved walls, the slight gutter, and a smooth, even light. Back to the west is the center console area with the multicolored pyramid. There is a doorway to the north and to the south, both leading into rooms that are dark at the moment. To the east the hallway opens to an archway that leads into an area that is much darker than the rooms to the north and the south.", "action_results": [null, {"action": "Go through the doorway to the north.", "result": "This is apparently a dead-end room with rounded walls. On the floor here is a pile of well, what you can only assume is garbage. There are a number of pieces of metal and plastic things. There are a few puddles of liquids that are fluorescent blue and green. There are shards of boxes and pieces of other things that you cannot recognize at all.\n\nYou see no other exits out of the room, but you can see a large red lever on the far wall. To reach that lever, you will have to walk through the apparent trash and step into at least one of the puddles of strange liquid.", "action_results": [null, {"action": "Step into the filth and press the large red button.", "result": "You step into the puddles and try and avoid the trash. A sharp edge of something cuts easily through your pants and tears the skin on your leg. You can hear some sort of sizzling from your feet where you stepped into the blue liquid. You manage to reach the lever and give it a pull. The lever moves downward easily and you hear a loud click from below your feet. Suddenly the floor beneath you disappears!\n\nIn the blink of an eye you find yourself falling through space. You have time to realize that the hole you have fallen into is completely dark. Suddenly your fall ends as you slam into a pile of something and you feel a sharp edge stab you in the back painfully. As you attempt to roll over and adjust to the pain, you hear a rumbling sound and the pile you are sitting in starts to move and shift. You try to get to your feet, but in the darkness, you cannot see anything. You slip and slide and then reach out a hand to feel a large, flat wall that is moving towards you. Reaching out to the other side, you find another, similar, sticky wall, also moving towards you. In that moment you realize you must be in some sort of trash compactor! Then you feel the side walls reach your shoulders and you know that you really should not have pulled the red lever...\n\n\nWell that's it. I'm not going to describe your ending any more than that, you'll just have to use your imagination. And if you don't want to, that's fine, you're still dead. Maybe if you try again, you avoid the red lever?", "action_results": []}]}, {"action": "Go through the doorway to the south.", "result": "This room is one of the largest rooms you have seen so far. It has the same rounded walls that give out light, but the light here is a little dimmer than everywhere else you have seen. Throughout this room you can see a number of large table-looking things, a little like the examination table where you woke up, but larger. On a number of the tables your see figures. As your eyes adjust to the dim light, you can see they are large, oblong green creatures! They have no hair and a number of long tentacles that are almost hypnotic as they weave and sway off the sides of the tables. They make no sound and other than their swaying arms, you do not see any movement. There are at least a dozen of the creatures here, lying on the tables in the dark. From where you are, you cannot see any other exits from the room.", "action_results": [null, {"action": "Step over to the creatures and look around.", "result": "Really? You actually thought this was a good idea? Okay fine:\n\nYou step closer to one of the creatures, taking a look. As you get closer, you can feel some warmth coming from the creature. The closer you get, the more you can feel the heat. As you look over at the nearest creature, you get a whiff of something that burns the hairs in your nose. Suddenly, you feel something touch your leg, then wrap around it tightly. You try and move away, but your leg is held in an iron grip. As you turn to try and flee, you feel something grab your arm. You look down and see that one of the tentacles of the creature has wrapped itself around your arm. Suddenly you are lifted off the ground and pulled towards the creature. You try and turn and twist, but you are held quite tightly. You are pulled towards the creature backwards. You feel more heat as you get even closer and feel like you are getting a sunburn on your back. There is massive pain in your rear, as if you are being burned more, but then there is no pain. Twisting around, you can see that your rear end has made contact with the creature and has disappeared! You watch in horror as the creature continues to pull you into it, and your body simply disappears as it makes contact with the creature. Your legs disappear and it continues engulfing you. Your eyes are open wide as your mid-section starts to disappear and you are dead before you are completely consumed.\n\nThere. Happy now? Great choice. Oh, wait, I mean, sorry that you have died. Please do try again. And maybe next time you shouldn't bother waking up the aliens that have abducted you when you're trying to escape from them!", "action_results": []}]}, {"action": "Continue east into the darkened area.", "result": "You step into this room and the light increases only slightly, and mostly just a the level of your feet. You are able to see the same flooring as the hallways, but while the walls are curved, they appear to be very large windows. You can see what looks like outside and you see a sky filled with stars. There are many more stars than you have ever seen from standing on earth -- and you suddenly realize that you are sure now that you are not actually on the planet any more!\n\nSome of the stars appear to be moving very slowly, so it does appear that you are moving through space. You do not see the earth out the windows from where you stand at the entrance way to this room. There is a railing or seat of some sort along the edge of the windows. It could be a seat, but certainly not for humans...", "action_results": [null, {"action": "Step up to the windows and look around.", "result": "You step around the barrier and up to the windows. You look out and see a vast universe of stars. It looks like a view from earth on a very dark and clear night -- there are stars everywhere. You try and pick out a few constellations that you recognize, but there are so many additional stars, you just can't tell if the constellations are those that you recognize. From this close view of the windows, you can look over to the left and see a large planet. After a moment you realize that is planet earth! That's where you are supposed to be, but you're not. It is clear now, in case you had any doubt, that you are in a space ship. Now you just need to find a way back home.\n\nAs you finish looking around and start to think about how to escape, you look down and see a small blue piece of something. You reach down and pick it up and see that it is a small blue card. It appears to be made of some sort of flexible plastic like material and is almost see-through. It easily bends, but does not break.", "action_results": [null, null]}]}]}, null, null, null]}]}, null]}, null]}]}]}]}