{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=8557", "context": "", "first_story_block": "The smell of water clouded Gabri's mind.  The vast painting of blue was beautiful.  Forget the immense fog.  Forget the millions of trees closing him in.  All that was there was the pool of water.  He began touching his feet inside.  Its crisp freshness made him shiver with joy.  Soon, he was wading, all of him, in the water.  He swam around rapidly and then just let the water carry him.  It felt good.  Oh, how it felt good.\n\n\"Gabri!\" shouted a voice from outside his own world.  There, clothed in a brown and apricot robe, stood Ka Kamikaze, Jedi Master.  His black hair, silver at the sides, clung to his scalp, refusing to let any wind pass through.  His ashy black beard did the same.  Ka was stocky, broad-shouldered.  His blue lightsaber stayed tucked away deep in his robe.  Gabri had never seen him withdraw it, but he had heard great tales in which he fought with it.  Oh, if he could see him wield it, see all those tales come true, he would love it.\n\n\"No more tomfoolery!\" Ka ordered in his bold voice, \"Do you come or do you stay?  I must search this area.\"\n\n ", "action_results": [{"action": "Stay", "result": "\"I think I shall stay.\" Gabri told Ka, and began drifting off into the water's hypnotizing ripples.\n\n\"Very well.  If you must.  I shall meet you back here soon.\" Ka said, a touch of bitterness in his voice, and was off.  But Gabri didn't listen to him.  He was already immersed in the water.\n\nThe quiet tranquility calmed him.  It was a calm quiet.  A peaceful quiet.  An eerie quiet.  A menacing quiet.  He felt the sensation of being watched.  He reluctantly emerged from the water and draped his robe around him.  He then went to explore the region around the pool.  The only sounds were his footsteps squishing on the damp grass and his breathing.  But, as he quieted himself, he heard another breathing noise.\n\nHe whipped his head around, scouring for another being.  He saw nothing.  He looked to the north and, suddenly, he heard the hum of a lightsaber.  He lashed his own out.  The crrsshh of their lightsabers clashing echoed around them.  The bright hues of green and red lit up their faces.  Gabri could not see the other's face, for it was covered by a sooty, black hood.  He knocked the lightsaber out of the other's hand and pinned him to the ground.  The other was not, however, a he at all.  She was a woman, with musty red hair all ablaze and fawn's eyes.  They were timid pools of blue-green water and they were glistening.  Her hood was now down and her arms bent up against her head.  With flaring nostrils, Gabri shouted at her,", "action_results": [{"action": "\"Who are you?!\"", "result": "The woman looked at him with stern eyes.  She clenched her teeth and answered, \"I am Ophelia.  And you may be?\"\n\n\"Gabri,\" Gabri told her, \"I'm tempted to kill you.\"  She looked at him with girlish eyes.  Her sternness was there but her eyes sang a different tune.  They sang, \"Have mercy on me.\"  He kept her restrained but, in an act of kindness, eventually let her be free.  She stood and brushed the dew off her robe.  As she stared at him her eyes said something again that her voice did not: \"Why are you kind to me?\"\n\nHe knew not why, but he felt a certain sadness for her.  It seemed she wished not to be here, that she longed to be somewhere safer, happier.  A tear trickled down her face.  She gazed down a moment.  Then, she looked into his periwinkle eyes.\n\n\"You have been sent to free me,\" she replied, speaking like a prophet, \"To free me from the Sith's manacles.\"  He stared into her fawn's eyes.  Her strength was wilting.  She suddenly dropped to her knees, laid her face in her hands and cried.  Seeing her sorrow made him think of how he was glad he was a Jedi.  The Sith were menaces.  They always turned on each other.  They couldn't be trusted.  But he then remembered the harshness of Ka.  How Ka was cruel and unforgiving.  That was like the Sith.  They both sounded horrible.  He knelt by her, resting a claming hand on her back, and told her,", "action_results": [{"action": "\"Come with me and the Jedi shall protect you.\"", "result": "She looked up at him with trustworthy eyes.  The tears made her eyes quiver like someone dropping a pebble into a a pond and watching the ripples.  She laid a hand on his shoulder and said, \"Thank you.\"\n\nHe never quite did know if the Jedi were the good ones, or the Sith.  But seeing this girl break into tears, he knew.  He had to take her into his custody, make her feel wanted.  And so, following the path from Padawan to Jedi Knight, he took her as his Padawan.  He needed to show everybody how the Jedi were the ones to be trusted.  He did show them.  Every one.", "action_results": []}, {"action": "\"Do not fear the Sith. They will help you.\"", "result": "Her eyes met his and she resembled a deer in headlights.  Her crying stopped from sheer shock.\n\n\"Your a monster if you believe that,\" she said, \"You must be.\"  She fled from him, leaving him kneeling with a hand in the air.  She fled because she feared him.  She just didn't know.  The Sith were the good ones.  Not the Jedi.  Ka was a good example.  So he became a Sith Master, destroying all dear to him for he knew this was the right thing to do.", "action_results": []}]}, {"action": "\"Why did you try to kill me?!\"", "result": "She gazed at him with fiery madness.  \"Because you are a Jedi!  Jedi cannot be trusted!\"  She wanted to struggle, to escape from him, he could tell but if she tried she'd feel the wrath of his lightsaber.\n\n\"It is the Sith that can't be trusted!\" he shouted, accidentally letting her go.\n\n\"The Sith have only tried to restore the galaxy.  The Jedi have tried to tear it down!\" she shouted back, angrily, picking up her lightsaber and wielding it once more.\n\nThey clashed the lightsabers against each other again and started an immense battle.  They whipped around and around again.  She withdrew her lightsaber unintentionally and he took the moment to\n\n ", "action_results": [{"action": "Murder her", "result": "He swished his emerald lightsaber through her body and she fell to the ground.  Her hair laid around her and her body was limp.  He felt anger rise inside him.  He didn't know then but he was becoming a Sith.  He went out into other worlds expressing his anger.  He found that the Sith were the good, the great defenders of the galaxy.  And, after annihilating people and planets, he joined the Sith for the good of the galaxy.", "action_results": []}, {"action": "Hug her", "result": "He wrapped his arms around her and, as she eased into him, she cried.\n\n\"They're cruel beings,\" she hiccuped, \"They are self-seeking and would do anything to destroy their enemies and even their friends, if they had any, to make themselves stronger.\"  Gabri nodded on her candlelight hair.  Ka was callous at times but he always had good intentions.  He wanted to help, not hurt.  Gabri knew that now.  As the girl sobbed into his robe, he knew he had to stay a Jedi if he wanted to help.  And he did want to.", "action_results": []}]}]}, {"action": "Go", "result": "Gabri stood out of his soothing water, pulled on his robe, and followed Ka.\n\n\"A Jedi shouldn't play around like you do,\" Ka scolded, \"I wanted a willing Padawan, not an immature little boy.\"  Gabri looked up to Ka with great admiration, and he knew he played around more than he should, but he also knew Ka could be harsh.  They moved on, the damp grass squishing under their feet.\n\n\"What are we looking for?\" Gabri asked, again.  He never really listened to Ka's answers for Ka always spoke down to him, and in sarcastic tones as well.\n\n\"If you paid the slightest bit of attention, instead of goofing off, you'd already know,\" Ka snarled.  And so, Gabri's question went unanswered.\n\nThey walked a far distance until they came to a shed.  It was poorly constructed and rundown.  The door was off its hinges and nothing but dust and grime laid inside.  They entered and found a Gungan standing there with flappy tan ears and eyeballs on antennae.  He had a bill and a long tongue.\n\n\"Are you Jedi Master Ka Kamikaze?\" he asked, \"I have been sent for him.\"  Ka nodded.\n\n\"I am Lum Blimi.  A ship has been sent for you, from the Rebellion.\" the Gungan told them.  He led them through the thick jungle and there before them was Y-wing, a mossy yellow color covering it.  Ka boarded and Gabri followed.  In its own little compartment was R2-B5, an astromech droid with yellow coloring as well.  The droid beeped at Gabri and he waved.  Then, he ran inside.\n\nSitting in the pilot's seat, Ka set a course for", "action_results": [{"action": "Tatooine", "result": "As they arrived at Tatooine, sand began pelting the windows and they could see nothing.\n\n\"A sandstorm!  What luck!\" Gabri complained.  Ka paid him no mind to him.  He tried to maneuver the the Y-wing but the sand kept it stuck to the ground.\n\n\"This is all your fault!  We should have plotted a course to Endor!\" Ka yelled at Gabri.\n\n\"My fault?!  It was not my fault!  I let you decide!\" Gabri yelled back, even angrier.\n\n\"It was your fault!  Everything's your fault!  You never do anything right!\"  Gabri let his anger explode.  The explosion was large and insane.  He withdrew his lightsaber and killed Ka with much force.  Ka's body dissolved, leaving a his robe and lightsaber in a pile.  Through Ka did Gabri Joo now realize the evil ways of the Jedi.  They were not defenders of the galaxy.  They were destroyers.  And so he became one with the Sith and killed many a Jedi.  Ka had shown him the Sith were the righteous ones.", "action_results": []}, {"action": "Endor", "result": "As they landed on the planet of Endor, they heard the shrill cries of Ewoks.\n\n\"We must help them!\" Gabri shouted.  Ka left the Y-wing and Gabri followed.  They searched the dense trees until they found a small group-only three-of Ewoks.  They were closed in by a horde of stormtroopers.  A lifeless Ewok body lay beside them.  They were whimpering and cowering like small children.  Ka stayed back but  Gabri leaped out of the underbrush.  He had always questioned himself of who was truly the defenders of the galaxy: Jedi or Sith.  But seeing those Ewoks, and seeing the motionless body, he knew it was the Jedi.  They were the great ones, the ones who helped the harsh worlds.  As he attacked the stormtroopers, he knew he was a Jedi.  And a loyal one at that.", "action_results": []}]}]}