{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=42204", "context": "", "first_story_block": "You… think too much. It’s always been your issue. You’ve had twelve miserable years in the world, an existence wracked with headaches, horrible, coma-like states known as your “deep dreams”, and horrible, scratching and never-ceasing voices that knaw at your sanity. You’ve been left frail, pale and very skinny from your condition as you spend most of your life sleeping, wrapped up and coddled in a tent of animal hides. If there was any justice, you would’ve been left on a hill to die when your tribe realized how weak you were, but through your condition you’ve made yourself useful. You have premonitions, messages that you can make out from the depth of your dreams that make you the most valuable member of the tribe. Whether it be seeing the green flames of anger running through the eastern fringes of the forests that signal an upcoming Greenkskin attack, the sweet smells drifting from the lake that indicate a herd of Braxen or a flock of buzzards that can easily be haunted down by some of your hunters. That’s not even to mention some of your other abilities. You can unnerve, even frighten strong warriors with a glance, cause mass confusion with a few words, easily convince some of the dumber members of the tribe to do your bidding, and with a lot of effort you’re able to “drag” items towards you without touching them. Still, due to the fact you can barely walk, it’s hardly a fair trade off.\n\n\n“Karth!” a voice cries. \n\n\nYou look up, pulling your skinny body slightly above the blankets that are wrapped around you to look at Duggin as he walks inside, carrying a spear, a bow and sheath, wearing the hide of one of the many beasts of the jungle.\n\n\n“What thoughts have you for us today?” Duggin asks.\n\n\nYou love your tribe. Your tribe is a group of strong, brave and loyal men who only want the best for each other. Better men don’t exist. Unfortunately, they’re idiots. Half your job here is relaying the many dreams, omens and messages you have in your sleep. The other half is keeping them from killing themselves. There are men here who have lived twenty, thirty, forty, even fifty years, but in your twelve years on this world you’ve learned infinitely more. You introduced them to the concept of stealing the hides from slain beasts and wearing it as your own, the concept of hiding like a predator with camouflage and strength, and new battlefield strategies beyond “attack!”.\n\n\n“None. It was a peaceful night,” you say.\n\n\n“We’re having a hunt with the Azajaja tribe. We’re heading to meet up with them soon.”\n\n\nYou nod, raising your bony arms as Duggin lifts you up. You wrap your frail body around him as he walks outside. A large boar-like creature, a puk, sits there with a double-saddle tied to it. Duggin sits in the front saddle and places you in the back one, wrapping blankets tightly around you. You need the blankets for multiple reasons: to keep warm, to give yourself some sort of cushion to protect your fragile body, and most importantly it stops from having to feel the rough puk hair. Many textures, just like puk hair, just sends you into a tantrum for some strange reason. You can't rationalize it, but it still effects you. The puk begins striding forward in a half-gallop, as the other hunters of your tribe hop astride the puk, heading out toward the nearby lake. Suddenly, you watch as dozens of lizard-like creatures burst out of the trees, scuttling away from the jungles.\n\n\n“Ah! Look what we have here, boys! Fresh prey, sent to us by the great God-Emperor!” Duggin yells, raising his bow.\n\n\nYou watch as the lizards charge out with reckless abandon, straight into your arrow fire. You pull yourself up the saddle into more of a sitting position, thinking. These are simple beasts, but even beasts have a level of cunning that stops them from acting as such. They aren’t this stupid, are they?", "action_results": [{"action": "Warn your allies", "result": "These beasts would never simply charge into the path of a fierce predator… unless a fiercer predator was chasing them.\n\n\n“Wait! Wait! Attack!” you shout.\n\n\n“What?” Duggin asks, annoyed as your outburst causes him to miss a shot.\n\n\n“There’s something chasing the beasts!”\n\n\nDuggin raises an eyebrow, before barking out an order. The hunters quickly rearrange formation, just as a horde of Greenskins charge out of the trees with a fierce roar. A burst of spears and arrows flies out from your allies, but the orks take them in their stride. Arrows imbed themselves into their chest and arms, but they don’t go down. Spears jab forward, metal points finding the softest parts of the thick green skin, sinking deep with a spurt of blood. There’s about two dozen, as many as you, but they can take more punishment. You’re outnumbered, but thanks to your forethought and your tiny amount of preparation, you have a chance. You still find yourself useless in the upcoming battle, but it lasts only a few minutes. You watch as blood is shed, limbs are hacked off and puk are struck down. You use what little might you have to cling onto the puk, only barely stopping yourself from falling off. You close your eyes, and wait. Eventually, Duggin calls you.\n\n\n“Karth! It’s over!” he says.\n\n\nYou open your eyes, and survey the carnage. Bodies litter the earth, green and tan, lean and muscled, big and small. You’ve lost half your hunters in a single attack, but the rest of you have survived with few wounds. When orks strikes land, they kill, not wound. \n\n\n“Men, we need to check on the Azajaja boys!” Duggin yells. \n\n\nHe rides forward, towards the Azajaja camp, deep in the trees. You cling to the puk, looking through the trees as you approach their camp. It’s in ruins. Tents have been torn apart, set alight and entirely wiped out. Bodies cover the ground, and you see the last few remnants of the Azajaja struggling to fight off the approaching Orks. Most are naked, still refusing to pick up your tactic of not going into battle with their dicks flapping in the breeze or their breasts hanging, as well as being one of the more idiotic tribes not to take on clothing at all, unlike yours.\n\n\n“Idiots,” you mutter to yourself.\n\n\nDuggin raises his spear and charges forward, the puk bursting forward as you struggle to hold on. Why couldn’t the idiot have left you at home?! Your allies attack with rage and speed, smashing into the orks from behind. There’s a short, brutal fight, before you see an ork charging towards you, swinging his axe.\n\n\n“Duggin!” you yell, pointing at the ork. \n\n\nDuggin turns, but he’s not fast enough. The ork’s weapon smashes into your puk, cutting through flesh and beheading him in a single blow. You’re sent flying as the puk collapses suddenly, smashing into the cold earth. You let out a pained yell, before opening your hazy eyes, only to find yourself in the centre of the remaining Azajaja survivors, which only consist of half a dozen warriors, a number that’s constantly dropping as the Orks charge once more, as well as two dozen civilians hastily armed with weapons. Suddenly, a small, goblin-like creature, a Gretchen, scampers through the warriors’ line, carrying a small knife fashioned from a large stone, who lets out a chuckle as he spots you and lets out a terrifying grin. You need to do something, fast.", "action_results": [{"action": "Crawl away", "result": "You scamper backward, before the creature charges toward you with its blade. You grab the earth, your frail strength still managing to pull your light body away, but the Gretchen it eager. It leaps onto you with a yell, jamming its blade into your throat. You let out a yell, as blood stains the ground.", "action_results": []}, {"action": "Attack it", "result": "You grab a rock, swinging it forward and smashing it into the side of the Gretchen’s face. It smacks into the ground, and you climb atop it and smack it into the creature’s skull again and again. The Gretchen’s head is crushed, and you let out a relieved sigh. The relief is short-lived, though, as the orks continue to charge forward, swinging hastily-made weapons. The number of Azajaja survivors grows much smaller, as your tribesmen attempt to rescue both them and you whilst surviving the onslaught of Greenskin, but there’s just too many. Hands grab your shoulders and pull you up, just out of the path of an oncoming spear. You turn, to see the face of a young girl, barely older than you, holding a spear with a terrified look on her face. You blush as you realize she’s naked, before chiding yourself for having such an immature thought while people are charging to kill you. You hear a roar, and turn back to see an ork charging forward. He sees you, raising his axe.", "action_results": [{"action": "Crawl away", "result": "You scamper backward, before the creature charges toward you with its blade. You grab the earth, your frail strength still managing to pull your light body away, but the ork swings, the blade sinking into your shoulder, cutting through bone and flesh with ease. You let out a yell, as blood stains the ground.", "action_results": []}, {"action": "Attack", "result": "You grab a rock, swinging it forward, but the ork’s so big you can only reach its thigh, and the rock harmlessly bounces off the ork. The ork swings, the blade sinking into your shoulder, cutting through bone and flesh with ease. You let out a yell, as blood stains the ground. ", "action_results": []}, {"action": "Scream", "result": "You can barely walk. You’re not going to crawl away from an ork, let alone kill it. The orks have struck down everyone around you. Only you and the girl are left, with your tribesmen on the other side of a wall of green muscle, struggling to survive. You do pretty much the only thing you can do. You let out a terrified, ear-piercing scream. In one outburst of air, you release all your pent-up terror and fear. The ork lets out a pained howl, clutching its ears. It continues screaming, collapsing to its knees, before its head explodes in a spray of crimson mist. You watch as dozens of orks collapse to the ground, blood streaming from their eyes, ears, nose and mouth. You feel a scratching behind your eyes, in the centre of your skull, as if invisible hands are trying to pull you apart. You let out a moan, and collapse backwards.", "action_results": [{"action": "Enter oblivion", "result": "You have horrible nightmares of ever-changing balls of tentacles and eyes, horrible creatures of claws, breasts, hooves and long tongues, large, boil-covered, plague-ridden abominations and horned red beasts wielding flaming swords. Finally, you awaken in a cold sweat, coddled in your old, musky blankets. You look around, your eyes adjusting to the light of dusk. You notice the girl from earlier sitting in the corner, scaled hides and furs wrapped around her with her head resting on the handle of the sword she’s clutching. She notices your wandering eyes and begins staring at you with her bright, green eyes. She's covered in dirt, with her brown hair hacked as short as yours, making her look like a boy.\n\n\n“You’re awake,” she says.\n\n\n“Yes,” you reply, staring back at her, wondering why she’s keeping herself from blinking.\n\n\n“You sleep a long time.”\n\n\n“I do.”\n\n\nYou sit there staring at each for quite some time, before the tent flap opens as Duggin walks inside. You notice several fresh scars across his chest, and a long one across his face.\n\n\n“Karth! You’re awake!” he says with surprise. \n\n\n“How long was I dreaming?” you ask.\n\n\n“Two weeks. We thought… after what happened… Well, we considered feeding you to the puk,” Duggin chuckles. “Good to see you’re alive. What visions have you had?”\n\n\nYou reflect briefly on your dreams.\n\n\n“There’s heavy storms coming within a weak, heavy amounts prey south towards the coast of the lake… and no sign of Greenskin activity,” you say.\n\n\n“Good to know, little one. I’ll pass the message on.”\n\n\nDuggin turns his attention to the girl, who sits there.\n\n\n“Have you met the Azajaja, Karth?” he asks. “She hasn’t said a word the entire time she was here. She just sat there. It took a fierce bit of effort to get her to eat. I’m pretty sure she’s just been shitting in the corner.”\n\n\nDuggin looks to the girl, seemingly expecting her to say something, but she says nothing, just stares at you.\n\n\n“I’ll… grab you some food and drink. For both of you,” Duggin says, walking out of the tent, leaving you and the girl alone.\n\n\n“I’m Karth,” you reply, offering your hand to shake.\n\n\nShe just sits there in response, staring at you. It’s getting unnerving. After a few minutes, Duggin returns, carrying two wooden bowls of cooked meats as well as two more of wine. He leaves them on the floor in front of you.\n\n\n“Make sure she eats. I’ll give you some time, but then we need to discuss how you wiped out two dozens orks with… whatever powers you’ve been blessed with,” he says, before leaving.\n\n\nYou grab the two bowls of meat, sliding one across the floor to her. You begin eating, as she does the same. She grabs the meat and stuffs it into her mouth, all without breaking eye contact or letting go of her sword. She eats the meat with her mouth open, making loud chewing noises. You wince at the noise, the churning, slicing and crushing being another thing your mind is repulsed by. You blink, unnerved by the staring, but begin to eat, the delicious taste of flesh filling your mouth.\n\n\n“You snore loudly,” she says after several minutes.\n\n\n“Yeah, I’ve been told,” you reply.\n\n\n\"What do you do?\" she asks.\n\n\n“What do you mean?”\n\n\n“What do you do all day? You don’t seem like you can walk around much, let alone do chores or work.”\n\n\n“I sit here and sleep a lot. Sometimes I make plans when needed.”\n\n\n“Why are you so pale?” she asks quizzically.\n\n\n“I spend most of my time in a tent, obviously,” you reply.\n\n\n“Do you want to go outside?” she asks.\n\n\n“Everyone’s too busy to carry me around.” \n\n\nThe girl considers this.\n\n\n“Do you want to go on my back so I can take you outside?”", "action_results": [{"action": "Yes", "result": "“Yes, if you don’t mind,” you say.\n\n\nShe stands, scoffing the remaining bits of meat down her throat before gulping down the wine. She walks forward, turning and bending over to allow you to wrap your arms around her shoulders and then lift yourself up enough to wrap your legs around her thighs. She stands with a grunt, grabbing her sword before walking forward and out of the tent. You look up at the quickly falling sun, basking your face in its warmth. The rest of the tribe gives you a quick glance, surprised to see you outside, but go back to work. The girl continues to carry you around, trotting along the tents towards the trees.\n\n\n“So… do I get to know your name?” you ask. \n\n\n“It’s Fay,” she replies.\n\n\n“I’m Karth.”\n\n\n“What do you dream of? You know, when you sleep?”\n\n\n“Bad things, mostly. Monsters. Sometimes, I get messages. I see beasts attacking, and I know when the orks will strike. I…”\n\n\n“Did you know the orks were going to attack my village?” Fay asks, sadness filling her voice.\n\n\n“I… no. I don’t get messages every time.”\n\n\n“Oh. OK.”\n\n\nYou arrive at the trees, and you outstretch your arm, running it across the bark of one of the trees. You spot the sun finally descending under the horizon, as the darkness stretches over the sky. Two duller bright lights take its place, but they’re far too weak to give even an ounce of its brightness. \n\n\n“We should go back,” you say.\n\n\n“Why?” Fay asks.\n\n\n“Monsters dwell here at night.”\n\n\nShe pats her sword gently.\n\n\n“I have a blade. I can easily kill the monsters.”\n\n\n“Monsters are scary.”\n\n\n“I can be scary too.”", "action_results": [{"action": "Pressure her to go back", "result": "“Come on, let’s go back, please,” she says.\n\n\n“Fine,” she says with a sigh, turning and heading back to the camp.\n\n\nShe goes back inside the camp, putting you back on your blankets.\n\n\n“Can I sleep in here?” she asks.\n\n\n“Uh… OK,” you reply, curling up in your blankets.\n\n\n“I’ll see you in the morning,” she says.\n\n\n“Goodnight.”\n\n\n“Goodnight.”\n\n\nWith that, you curl up in your blankets and let sleep take you once more.", "action_results": [{"action": "Three Years Later...", "result": "Over the next three years, things change, both for you and the world at large. Fay becomes a constant companion, seemingly oblivious to the fact that the other children of the tribe would be happy to play with her and devoting all her time to you. You’re not sure why, but you’re grateful for it. Puberty changes both of you. Fay grows significantly taller, faster and stronger, growing from a small girl to a large and powerful warrior. She stands as tall and proud as the boys of the village, and is more than happy to face them off in a wrestling match, winning all of them. She seems to prefer spending her time hunting with the boys or more often with you than learning the common girl's chores of cooking, sewing and cleaning. You'd imagine soon enough she'll have to find a husband among the hunters.\n\n\nThankfully, growth does not leave you behind, although it doesn’t effect you nearly as much. You grow strong enough to be able to stand and stroll around the camp, even taking small trips, although even a light jog for a minute or two is enough to topple you over with exhaustion. Compared to Fay, you're a twig whilst her muscled form is that of an thick tree trunk. Puberty also has a significant change on your abilities. You sleep less, although your dreams are harsher, and there’s more… anger behind them. The monsters seem aware of you know, there voices constantly breaking into reality and continuing to scream and plead with you. You simply refuse to listen, and with training, you can make them become something of a white noise to your day to day activity. Your powers also increase. With the flick of your fingers, you can start a small fire. With a word, you can leave anything, man or beast, confused and befuddled. You can pick things up and throw them with a strength unfound to you, beating out many of the warriors in throwing contests without even moving. The world as a whole changes as well. The amount of Greenskin attacks intensifies, and in response the tribes band together, forming a much larger community to stand against the tide. Your dreams are muddled, but you feel something is coming. The sky, which to the plain eye is beautiful, blue and unchanging, seems about to be torn open in your dreams. Something bad is coming.\n\n\nYou sit in the grass, a tan finally having replaced your pale form, next to Fay as you watch buzzards flying overhead, eating a bowl of Braxen meat. \n\n\n“It’s a nice day,” Fay says.\n\n\n“It is,” you say, your dreams from the previous nights still filling you with a feeling of dread.\n\n\n“You look nervous.”\n\n\n“Do I?” you ask, feigning confusion.\n\n\n“As much as you like to think so, I’m not stupid. I can tell something’s up.”", "action_results": [{"action": "Tell her the truth", "result": "“I’ve been having a lot of nightmares. I think… I think bad things are coming.”\n\n\n“Really?” Fay asks, getting worried. “Like what?”\n\n\n“I don’t know,” you admit. “But it’s bad.”\n\n\n“Have you told Duggin?” \n\n\n“He just increased the amount of training warriors are doing. He asked what else he could do, and I didn’t have any better suggestions.”\n\n\n“You worry too much. You’re not even eating. Your bowl’s full. Speaking of which…”\n\n\nShe plucks the bowl from your hands.\n\n\n“I’m still hungry!” Fay laughs as she gracefully hops out of reach.\n\n\n“Oh, no! Whatever shall I do? I’ve been left helpless! What will poor Karth do?” you say sarcastically.\n\n\nWith the wave of your hand, Fay’s feet go from under her and the bowl flies into your hands. You grab a piece of meat and throw it into your mouth with a smile.\n\n\n“You’re just a bully,” Fay says, fake pouting. “Thank the God-Emperor you were cursed to be a cripple.”\n\n\n“Hey! I’m not a cripple! I’m just super weak. If we find a tribe of women who aren’t ugly bags with stringy hair, odd scars sand gross teeth, I’ll get super buff. But, we haven’t,” you reply.\n\n\nFay looks down, actually looking hurt by your joking comment. Shit.\n\n\n“Uh… don’t be so insulted, Fay,” you say, gently knocking her to the ground again with the flick of your wrist. “You’re less ugly when you smile. You need to have thicker skin.”\n\n\nShe smiles as she stands back up.\n\n\n“Me? I need thicker skin? This is coming from the guy who’s always like “I’m scared because I dreamed something bad”!”\n\n\n“Hey, I’m never wrong. I have a lot of power,” you say, emphasizing your point with another flick of your wrist.\n\n\n“Stop that!” she complains, hitting the ground. “I don’t even know why I hang out with you.”\n\n\n“Because of my dashing good looks?”\n\n\n“Shut up! I’m going down to the lake for a swim!” she says, jumping up and jogging off towards the lake.\n\n\nYou quickly stand up, walking after her.\n\n\n“Wait up! You know I can’t go that fast!”\n\n\nFay rolls her eyes, stopping and grabbing your hand.\n\n\n“Come on!” she says.\n\n\nShit. You hate swimming. It’s mostly just you sitting in the shallow, exhausted from the effort of getting in. Still, you go where she does, and she’s the same. You walk as quickly as you can towards the lake. ", "action_results": [{"action": "Four Hours Later...", "result": "You lie on the grassy edge of the lake, your feet dipping gently in the water, watching as Fay gathers berries, nuts, fruit and whatever other edibles she has access to. You watch her approaching you, carrying a handful of food. You eagerly extend a hand as she hands some to you, and you stuff your cheeks with them, eagerly eating.\n\n\n“How can someone be so hungry yet be so thin?”\n\n\n“I suppose I’m just an abomination,” you smile, watching as the water turns gold as the sun shines across it, finally beginning to disappear as night takes hold.\n\n\n“It was a nice day,” you say. “But we should head back.”\n\n\n“You’re such a maybe. You’d think a magic man who can kill dozens of orks with one petrified scream would be less of a coward.”\n\n\nYou flick your wrist and she falls over with a yelp.\n\n\n“Stop doing that!”\n\n\n“No,” you reply with a smile. \n\n\nYou watch as the bright two moons appear, just as dozens of stars fill the sky. \n\n\n“Beautiful night,” Fay remarks.\n\n\n“Yeah. The sky’s looking gorgeous,” you reply.\n\n\n“You know...\" Fay starts.\n\n\nThere’s a howling scream, and the sky is torn apart. You watch as the very fabric of reality is sliced through, tearing a hole in the sky. There’s a bright, purple hole in the sky itself.\n\n\n“What the fuck is…?” Fay asks, drawing her sword as if with some hope of stopping the horror that is to come.\n\n\nA headache pulses through you as you try to stand, collapsing back to the floor. In the distance, a massive, black shape leaves the hole, heading straight towards the planet. You stand again, but the shrieking continues, preventing you from thinking, let alone running.\n\n\n“Karth!” Fay yells, wrapping her hands around you and lifts you up.", "action_results": [{"action": "Tell her to go back to camp and warn them", "result": "“Go… go back to camp without me. Warn them!”\n\n\n“I’m not leaving you!”\n\n\n“Fay, have you fucking seen me? It’s a hell of a lot less dangerous here, I’ll be fine. Go!”\n\n\nFay nods, turning and sprinting off towards the camp. You sit there, clutching your head. After about a minute, your head clears enough to realize that there’s no way in hell the camp wouldn’t notice the massive, sky-tearing hole in reality itself, so sending Fay back to warn them is completely useless. Suddenly, you’re hit by another wave of anguish as pain courses through you. Then, the voices return. This time, though, one pierces through, louder than ever before, almost as if someone is whispering directly in your ear.\n\n\n“Karth… Karth… I can help you… I have so much power… I have so much strength… all of it, I’m happy to offer you…”\n\n\nYou feel the claws of a million voices scratching at your mind. You begin to scratch at your eardrums, hoping, begging the voices to stop. You shudder, and thankfully, oblivion takes you and you lapse into unconsciousness. ", "action_results": [{"action": "Awaken", "result": "You awaken, lying on the grass outside of your camp. Your eyes blink twice, as you begin to look around. Several large, metal buildings sit there in the fields next to the tents. Men holding large spears march around the camp, directing throngs of tribespeople towards the buildings. These spears seem to be capable of firing arrows made of concentrated sunlight. Interesting. You notice several giants, seemingly made of metal, standing on the edge of the camp, watching the work. Suddenly, you find yourself yanked into the air by invisible hands, and float into the air, suspended two four feet above the ground. You watch as a trio of men approach you, smiling. The one on the left is a giant, seemingly made entirely of metal. He stands at around eight feet, with dozens spikes protruding from his metal skin. His body’s black, with a purple head. In the middle, a tall, pale man wearing a long, black leather overcoat, a spiked collar strapped around his neck. The third seems to be a hybrid between a girl and a metal monster, her eyes replaced by the three red, unblinking eyes of a monster, a dozen long, metal arms extending from the nape of her back, three arms ending in claws and one a drill, with her legs replaced by four spider-like legs. Where her human arms would be extends a grasping, whirring claw and a metal barrel, the inside of which glows faintly blue. The middle one walks forward with a smile.\n\n\n“Hello there, young Karth. Pleasure to see you,” he smiles jovially.\n\n\n“We don’t have time for pleasantries, psyker,” the metal man says. “Load him onto the ship!\n\n\n\"Give him time to adjust! He's only just waking up,\" the man, the psyker, says.\n\n\nOne of the long, metal arms attached to the monster-man's back goes towards you, whirring its drill. It cuts along your arm, drawing a long, thin cut as you yelp in pain.\n\n\n\"This one is weak... how pitiful,\" the monster-man says. \"It's pain tolerance is low, but I can work with it.\"\n\n\n\"I want to use his mind, not his flesh,\" the psyker says. \"My name is Kyros. The burly armored man to my right is Chapter Master Taj Suenage, and the robotic companion to my left is the Heretek known as the Craftsman of Vorn, the Butcher of Karis IV and the Father to the Prometheans. Her name is Magos Cern. We are the Forces of Chaos.\"\n\n\nThe monster-man extends one of her metal tentacle arms once more, tracing the outline of your cheek bones.\n\n\n\"Bah! Time wastes! Either give me the surge of the warp overtaking me, or give me the surge of battle, Kyros!\" Taj roars, smacking a metal hand against his chest.\n\n\n\"As you wish, Taj,\" the Psyker says. \n\n\nThe Psyker claps his hands, and his various forces begin forcing the last of the tribespeople inside the building, as those who litter the floor, those who presumably tried to resist, are carried there.\n\n\n\"Are they dead?\"\n\n\n\"Some, presumably. I gave the order to keep as many alive as possible,\" Kyros says.\n\n\nYou see Fay's battered and bruised body being tossed over a metal giant's shoulder as she's carried off towards the building.\n\n\n\"No! Give her back!\" you shout.\n\n\n\"She fought well. When my men entered this pathetic village, she was trying to warn them. She even tried to fight them off. Killed one of the dumber ones who tried to call her bluff. Commendable.\"\n\n\nYou furrow your brow, and the Psyker grins as Taj's head is knocked slightly back, before presuming position. Despite how little you've harmed him, the metal giant seems enraged.\n\n\n\"You scum-sucking sociopathic cunt!\" Taj roars, charging forward.\n\n\nTaj is flipped into the air, being suspended just out of reach of you. His metal fists swing at you, but he's kept out of grasp.\n\n\n\"Tut tut. Stay your anger, my dear Taj. Karth, I'll make you a deal. Do as I say, and the girl will be unharmed. Deal?", "action_results": [{"action": "Agree", "result": "\"OK. Just don't hurt her,\" you say.\n\n\nYou drop, hitting the floor quite gently. Kyros grins and gives you a nod.\n\n\n\"Good boy. I'll make sure special care is taken of the girl.\"k\n\n\n\"Ha! I'll give your bitch whore \"special care\"!\" Taj roars, still grabbing at you.\n\n\nKyros rolls her eyes, flipping Taj into the dust.\n\n\n\"Quiet now, marine,\" he says. \"I have a gift to sate your bloodlust. Bring out the chieftain!\"\n\n\nYou watch as Duggin is dragged form his tent, growling and yelling. A large cut goes down his chest, blood having soaked his armor, turning it a deep crimson that shines in the sun. \n\n\n\"Come on, finish me!\" he roars.\n\n\n\"I don't want to see my men die, Karth. I gave your chieftain the option to surrender, give me his finest warriors... and you, of course, and I'd spare his civilians. He refused, killed some of my men, had his warriors killed and now I have to take you all. Now, he will die. This is what happens when people mess with my plans, Karth.\"\n\n\nTaj drops to the ground, turning to stare at Duggin with a monstrous laugh.\n\n\n\"Fortunately, Karth, I won't make you watch. You have agreed, haven't you?\" Kyros says with a wink. \n\n\nYou're released to the ground, and Kyros and Magos Cern walk alongside you towards the metal buildings. You walk inside, and the doors shut. A bright red light, like a very powerful candle, appears out of nothingness, brightening the room. The tribespeople are packed in here, surrounded by a tight bundle of guards with spears raised.\n\n\n\"What happens here? There's no space to do anything,\" you say.\n\n\n\"It's a landing craft, little one. Now, we soar to the stars,\" Kyros says.\n\n\nYou see several feet away from you is Fay's crumpled form and feel a twinge of pain. You sit down in the metal building as it begins to shake and shudder as if moving, terrified of the world around you.", "action_results": [{"action": "Four Hours Later...", "result": "The trip is long. The landing craft constantly shakes and shudders, and quickly fills with the smell of puke as the stomachs of many of the men and women around you as they fail to handle the constant shaking. You sit there, unmoving, staring up at the guards. Finally, the ship shudders to a stop.\n\n\n\"Good! We're here!\" Kyros says. \"Welcome to the Roar of the Vortex! Please file out and follow the guards towards your cells.\"\n\n\n\"What are you going to do with us?\" someone asks.\n\n\n\"I'm going to make you matter in a galaxy that stands for no one,\" Kyros says proudly.\n\n\nThe people begin being shuffled off the landing raft, and you find yourself in a massive metal room. You look out a massive opening, filled with similar craft. You look around, before a metal hand grabs your shoulder.\n\n\n\"Stay,\" Taj growls. \"You're not to be mixed in with these common curs.\"\n\n\n\"What's going to happen to them?\" you ask.\n\n\n\"Some will live. Most will die. All will suffer,\" Taj says.\n\n\n\"What... what are you?\"\n\n\n\"A space marine, boy,\" Taj says.\n\n\nHe grabs his head, twisting it. His metal head is yanked off, revealing a scarred human head underneath.\n\n\n\"You're a human.\"\n\n\n\"Practically. Did you think I was metal through and through?\" Taj asks.\n\n\n\"Yes.\"\n\n\n\"It's armor, boy,\" Taj says. \"I don't have time to explain shit to you.\"\n\n\nKyros marches out, raising you into the air.\n\n\n\"Come on, boy. Let's go!\" Kyros says eagerly, walking along the ship.\n\n\nYou float after him, being dragged through the air, unable to resist. After a few minutes, you fall to your knees in front of a metal door.\n\n\n\"I've asked what's going to happen to us. You still haven't given me an answer,\" you say.\n\n\n\"You've found yourself in a war, little one. Your planet is worth jack shit. Everything you know doesn't matter. This war encompasses the galaxy.Systems burn, billions die, the fate of trillions is fought for.\"\n\n\n\"War? Whose fighting?\" you ask.\n\n\n\"Everyone. The world has monsters so powerful that they'd wipe out every warrior in all your tribes in an instant. There's the Tyranids, a horrible bug hive-mind with nothing but a need to eat. There's the Necrons, an ancient of soulless machines that have only just began to awaken. There's the Orks, a warring species of monsters, the Eldar, an enigmatic species just as likely to help as hinder you, Then, you have the worst villains. The Imperium of Man. They're freedom-crushing, innovation-stopping, potential-destroying fascists who enslave trillions and worship a corpse. We stand against them. We serve the Dark Gods. Khorne the Warrior God, Tzeentch the Sorcery God, Slaaneesh the Pleasure God and Nurgle the Plague God. We fight to free ourselves from tyranny, to make sure every man is free. We offer gifts of strength, knowledge, joy and immortality, yet the Imperium spurns us. So we rebelled. We are the Forces of Chaos, who fight back against tyranny! Praise Chaos in all it's glory!\"\n\n\n\"I'm still waiting for an answer,\" you say.\n\n\n\"We're going to turn you into super-soldiers. Magos Cern has long worked on the process. We're going to make you greater than Space Marines. You hold the most potential. Cern can play with their flesh and Taj can train them, but I offer the greatest gift: Ultimate power. You're gifted, Karth. I want to use that gift to make you one of the most powerful beings known to man.\"\n\n\nYou stare at him nervously. You're not an idiot. People don't just create powerful soldiers without having a chain around them. You watch as Kyros takes a steel, studded collar and walks towards you. He wraps it around your throat, clicking it into place. \n\n\n\"Is that comfortable?\" Kyros asks.\n\n\n\"I suppose,\" you see, scratching at the collar.\n\n\n\"At any moment, I can shut down your powers and strangle the very air out of your throat. So play nice.\"\n\n\nKyros picks you up again with a flick of the wrist and you float upwards. Kyros carries you through the air, stopping at another door. It opens with being touched, and Kyros drops you inside it.\n\n\n\"This is your cell. I've made it... comfortable. In return, you best be... compliant I need to... check on some things. Wait here for the time being,\" Kyros says, sealing the door behind you.\"\n\n\nYou stand up, looking around the room. There's a bed there, a small hole in the floor the size of a baby's head, a shelf and a small glass box with a lever inside.", "action_results": [{"action": "Investigate the hole", "result": "You walk over to the hole, and look down it. Nothing but blackness. You put your ear against it, but no noise comes out. Finally, you put your arm down it, up to the shoulder. There's a gunk coating it further down, but you can't make out what it is by touch. You lift out your arm, only to find it caked with dried shit.\n\n\n\"Fuck,\" you complain, as the smell just begins to hit you.", "action_results": [{"action": "Investigate the box", "result": "You walk over to the box, entering it. You press down on the lever, and nothing happens. You pull it, and suddenly you're hit by a burst of water. You look up, and it's like lashing rain has formed right above you. This has the added benefit of washing off the shit that cakes your arm. You quickly turn it off, avoiding getting too soaked.", "action_results": [{"action": "Lie on the bed and wait", "result": "You collapse onto the bed, closing your eyes. Almost immediately, the voice begins.\n\n\n\"Karth... Karth...\" the voice calls. \"I have so much to offer you... you're a prisoner here, Karth. These men are going to break you, child. Only I can help you... just give me time...\" the horrible voices stops, and reality fades back into reality.\n\n\nThe voices thankfully subside, and you're granted a short break of blissful sleep. Unfortunately, this is broken by the door opening. You look up to see Kyros standing there.\n\n\n\"Karth, it's time for your... augmentation,\" he says cheerfully.\n\n\n\"What's going to happen?\" you ask fearfully.\n\n\n\"Magos Cern and the Chapter Master want to create super-soldiers. They're aiming so low they could hit themselves in the foot. I want to create something... excuse me, someone of immense power. Your mind will be a thousand times sharper than any blade. You will be a Psyker feared by the entire Imperium.\"\n\n\n\"Let's say you make me extremely powerful. Then what? How do you keep me under your control?\" you ask.\n\n\n\"Karth, you're my prisoner, but I don't think you need to be for long. I want you to join me. We figtht for freedom, for power, for glory! We'll crush the dying Imperium, and lead mankind  towards a new dawn. Can't you see that that's a strong goal? Can't you see that that's something to join us to fight for?\"", "action_results": [{"action": "\"I agree. They're commendable ideals.\"", "result": "\"I'm glad to hear it. I'm sorry to say you'll still have to remain my prisoner for the time being, but I'm sure the crew will come to trust you quickly enough.\"\n\n\nYou arrive in a large room, filled with dozens of large, see-through tubes. You glance at them, take a deep breath, and get sick all over the glass while falling to your knees.\n\n\n\"Ah, yes... you best not look at these,\" Kyros says, flicking his finger to pick you up again.\n\n\nInside the tube, submersed in a thick, viscous liquid, are your tribespeople. They're completely naked, with long tubes having been forced down their throat. Dozens of needles have been forced into their arms, backs and necks, pumping strange liquids into them. \n\n\n\"What the fuck are you doing to them?\" you ask.\n\n\n\"Making them super-soldiers. We've been through this,\" Kyros says absent-mindedly.\n\n\n\"I thought you'd be training them!\"\n\n\n\"After we change them. If you think the nutrients and drug treatment is bad, wait until we start using the Geneseed. At least they'll all survive this bit.\"", "action_results": [{"action": "Look around for Fay", "result": "You look around, noticing Fay floating in a tube. \n\n\n\"Let her out!\" you say, tears welling in your eyes as you watch her body convulse as chemicals and nutrients flood into it.\n\n\n\"No. She needs to become strong if she wishes to survive here.\"\n\n\n\"She's one of our best warriors! She trains everyday!\"\n\n\n\"I don't particularly care whose the best warrior of some shithole tribe on some shithole planet! We'll be fighting super, cybernetic orks, super-soldiers the likes of Taj, ancient, psychic warriors and never-ending waves of bug warriors. Your sister could be torn apart in seconds by even the weakest of threats.\"\n\n\n\"She's not my sister,\" you say, putting your hand against the glass.\n\n\n\"Really? Wife, then? I've seen cultures with younger marriage ages, but they're not the norm.\"\n\n\n\"We're not married, we're just friends,\" you say sadly, as you're carried into the air once more and dragged along Kyros.\n\n\n\"Ah, I see. Your society isn't patriarchal enough that you can just demand she has sex with you. Unreciprocated love, what a pity,\" Kyros laughs.\n\n\n\"It's not... let her go!\" you shout.\n\n\nThe collar tugs tightly around your throat, taking the breath away from you. You choke and gasp for several seconds, before it releases, allowing you to take a breath. \n\n\n\"Quiet now.\"\n\n\nYou continue on, arriving at a thick, metal door.\n\n\n\"Here we are,\" Kyros says with a smile.\n\n\nThe metal doors slide open, revealing a large, empty chamber. Magos Cern stands in the center, her head twisting around to reveal her glowing red eyes, piercing your soul.\n\n\n\"Is the chamber complete?\" Kyros asks. \"Have you succeeded?\"\n\n\nMagos Cern stares at you.\n\n\n\"Well?\" Kyros asks again.\n\n\n\"Don't question my work, Kyros. If something goes wrong, it's because you're an idiot trying to harness the magical energies of the warp while using a flesh battery.\"\n\n\n\"I have a name, you know,\" you point out.\n\n\nMagos Cern walks out of the room, the mechanical part of her body whirring.\n\n\n\"What is she?\" you ask. \"Is she even a \"she\"?\"\n\n\n\"Imagine a simple human girl. Useless. Unknown. Weak. We all want to be strong. She scorns are use of the Warp, but she's happy to replace most of her body with machinery.\"\n\n\n\"Machinery?\"\n\n\n\"She... adds metal shielding, important tools, new robotic arms... that kind of thing. Are you ready to start the procedure?\"\n\n\n\"Do I have a choice?\" you ask.\n\n\n\"Not in the slightest, but if you have any questions, you might as well ask them.\"", "action_results": [{"action": "Ask questions about the Warp", "result": "\"What's the Warp?\"\n\n\n\"Imagine an alternate dimension, of pure Chaos and emotion. It's known as the Warp. We are in a galaxy teeming with life. These lives all mean that there are trillions of bright, powerful souls. The powers of the Warp can easily be reaped here. By passing through it, we're able to travel hundreds of light years with ease. Through manifesting and manipulating the Warp, some of us, Psykers, can use it's powers like you and I do.\"\n\n\n\"We use the powers of the Warp for our magic?\"\n\n\n\"Yes, yes. Here, in the warp, are powerful and ancient creatures such as the Dark Gods and their daemons. There's Khorne, who has been born out of the galaxy's never-ending combat, representing courage, strength, blood-thirst, honor and most importantly, rage. There's Tzeentch, who has been born out of scheming and plotting. He represents sorcery and the use of magic, scheming, plotting, hope and change. There's Nurgle, the plague god. He represents sickness, decay, rot, plague, defeat and in a strange way, life and acceptance. Finally there's Slaaneesh, who represents self-indulgence, passion, love and pleasure. These are the four greatest Dark Gods, and it is to them I pledge my life. In exchange, they give me gifts to enhance my dark powers and give me the strength to fight for what's right.\"", "action_results": [{"action": "Ask questions about the procedure", "result": "\"What's going to happen to me?\"\n\n\n\"Your body is frail, weak, useless, because that's not where your strength comes from. Look at the finest warriors in your village. Their strength comes from the pathetic vessels their souls use. Your body could be upgraded, and we could make you as strong as someone like Taj with enough work, but what would be the point? It would be like adding a simple rifle bayonet to the heavy macro cannon of a starship. Now, I'm going to refine your abilities.\"\n\n\n\"You haven't told me what you're going to do,\" you point out.\n\n\n\"Well, this could be quite unpleasant. We're going to pump the chamber ful of Psychic energies and enhance your abilities,\" Kyros says.\n\n\n\"Is that going to work?\" you ask.\n\n\n\"Probably,\" Kyros shrugs, flashing a devilish grin. \"What I expect is a forced evolution of your mind to a much stronger state. It'll skip directly to the height of your psychic maturity, and then several levels past that. It requires a powerful Psyker who's still growing as a psyker with a lot of potential to succeed, but I'm certain you'll be able to survive it. Good luck.\"", "action_results": [{"action": "Start the procedure", "result": "\"Alright, I'm ready,\" you say with a grimace.\n\n\n\"Good. Now, it is important to know that this chamber is going to flood with psychic energy. If you feel your a few outer layers of your skin begin to burn off, you'll be find. It's quite likely that as the connections to the Warp that are built up and a portal is built up, daemons could attempt to manifest in the chamber. These are beings that are built on fear. You might see them, but they can't hurt you unless you react to in fear. They'll be able to cease on the presence of your fear and* fully manifest, and then they'll definitely be able to hurt you.\"\n\n\n\"So they can't hurt me if I don't react to them?\"\n\n\n\"Well... if this goes well, they won't be able to harm you if you don't show fear. If it goes wrong in some way and if they can harm you, being scared what change anything and you'll be slaughtered like a lamb either way won't do anything. So don't get scared, and don't react in anyway.\"\n\n\nKyros steps backwards, outside of the chamber, as four massive giant men wearing the metal armor just like Chapter Master Taj, wearing black armor with purple helmets. Severed Ork heads hang from around their heads, seemingly quite fresh, while they hold in their hands massive Bolters, which as you've learned from the chitchat between guards aboard the landing craft, spit huge bits of flaming metal with amazing speed. They're either here to keep you in... or to keep whatever ends up in this chamber if something goes wrong. The doors close, sealing you in there. Shit. You're definitely going to die in this chamber.\n\n\n\"Shit!\" you say loudly, you voice echoing off the walls of the circular chamber.\n\n\nThe chamber begins to hum, as the entire room begins shaking. The walls course with psychic energy. You hear a thousand energetic voices begin to chatter endlessly in your mind. One voice is loud and strong above the others.\n\n\n\"Karth...\" the now familiar voice calls. \"...feel the power reverberate through your soul... I knew I was right to target you.\"\n\n\n\"Who the fuck are you?\" you whimper.\n\n\nYou feel your body shudder, as your mind stretches. You feel sharp bursts of emotion. A deep, powerful rage at the slaughter and enslavement of your people. How dare those fucks kill your allies, kidnap your people and do these things? What gives them the right?! This rage is quickly replaced by a burst of joyous bliss, as an immense pleasure floods through your body, and you shudder in ecstasy. This is replaced by a deep sadness, as you realize that your entire tribe, your entire planet, all of the heroes of lore that you looked up to, meant nothing. Your world, as the Chaos lords said, is infinitesimally small and worthless compared to the rest of the galaxy. \n\n\n\"I am a friend, Karth. An ally. A daemon with unimaginable power which I'm willing to offer you. My name is Meliodas. I want you to survive this... I'm your friend... I know the powers flooding into you like you know the air you breath. Just ignore the chattering... ah, look... they're arrived. Try not to react...\"\n\n\nYou watch as the air courses, pulsing with solid, permanent beat. You see the air morph and flex with energy, as colored energy begins to manifest and coagulate. You see a morphing shape appear, a humanoid, red shape standing on black claws with a long, spiked head with two black horns. In it's hand is a long, flaming sword. It's skin the same as a burning coal sitting in the center of flames, veins of molten blood coursing through it. It looks at you and lets out an angry, guttural hiss. It slowly walks over to you, as it's blade crackles with heat. You feel your headache worsen ten times over, as the inside of your mind is scratched and hacked apart from the inside. The daemon raises a burning sword high into the air, before swinging towards your neck.", "action_results": [{"action": "Do nothing", "result": "You close your eyes to take in a deep breath, calming your mind slightly. You can feel your very consciousness shaking, and let out a shudder, opening your eyes. The daemon is gone, leaving you alone in the room. Electricity cackles along the wall, lightning running across you and wrapping around your very being. You feel a massive, terrible psychic scream reverberating deep in your mind, across every facet of your soul. You drop to your knees, as an unimaginable pain fills you. You let out a horrified scream from deep in your lungs, deep in your mind and deep in your soul. The room explodes, setting alight with multicolored flames which race along the walls, with flashes of lightning appearing and disappearing like snowflakes on wet stone. You collapse forward, onto the ground, as the room begins to cool down, but this only speeds up your fall into the void.", "action_results": [{"action": "Enter the Void...", "result": "You hear screaming. You look up, to find yourself falling through an endless void. You look at your body, starring in abject horror as it blisters, boils, sores and rashes cover you puke, releasing a torrent of vomit, blood and bile, as your flesh begins to decay, rotting in front of you. \n\n\n\"Karth!\" a voice screams, bringing you back to reality.\n\n\nYou open your eyes, finding yourself lying in the chamber. The four Space Marines stand over you, massive figures wearing thick-plated armor, next to Kyros.\n\n\n\"We should kill the Psyker. He's probably possessed, or corrupted beyond sanity,\" one says, not noticing you waking up.\n\n\n\"You can try, but I'll bind your souls to a fucking Soul Grinder! I'll make a flaying seem like the greatest ecstasies Slaanesh has to offer!\" Kyros roars. \"If that cunt has failed and died from this, I'll toss his entire tribe to the mutants to be flayed, the dogs to be mauled and the men to be fucked! I'll burn the fucking...!\"\n\n\nKyros notices you, and his hate-filled expression changes to a friendly, cheerful one.\n\n\n\"Ah, Karth, you've survived! Terrific!\" he says, gripping your hand and shaking your hand eagerly. \"Congratulations on your survival!\"\n\n\n\"Yeah... I did,\" you say, rubbing your head.\n\n\n\"Ah, I've found... residence,\" Meliodas says from deep in your mind. \"Your mind has grown powerfully. I know you had potential.\"\n\n\nMagos Cern walks into the room, starring at you with her cold eyes. She raises a pincer, quickly tearing off a stretch of skin from your arm. You yelp in pain and surprise as the skin is pealed away. She stares at it, scanning it with your mechanical eyes, before looking back at you.\n\n\n\"Light signs of Warp mutation. Should be cleared with a round of decontamination therapy,\" she says.\n\n\n\"How fares his mind? Did it work?\" Taj growls, marching inside.\n\n\n\"I'll probe your consciousness, see how much I've succeeded, shall I?\" Kyros says.\n\n\n\"My head hurts,\" you complain, as you feel a pounding headache hit.\n\n\n\"Oh yes, that's normal,\" Kyros says.\n\n\n\"I thought you've never done this before. How do you know the aftermath of it leads to headaches?\" you ask.\n\n\n\"Oh no, I mean if you're as powerful a psyker as I expect you to be, you'll be suffering from constant headaches, and that's when you're at your best,\" Kyros says, shrugging.\n\n\n\"Why the fuck didn't you tell me that earlier?\" you say. \n\n\n\"You're a slave, Karth. Remember that when you speak back to me, or you'll become familiar with the lash,\" Kyros says, his cheerful, friendly demeanor dropping for a second, before he smiles once more. \"Now, shall we begin the probing? You'll feel a sharp sensation. Just ignore it.\"\n\n\nYou nod your head slowly, before you feel something akin to an ice-cold blade slowly being forced into your consciousness. You shudder, but try not to tense up or resist in anyway.\n\n\n\"Hmmm... it's strong. Very strong. I've done well here. Thank the Dark Gods I installed that collar before I put you in the chamber,\" Kyros says, smiling as the collar tightens slightly around your throat. \"These space marines will act as your personal bodyguard.\"\n\n\n\"He's the prisoner, we're the guards. Don't let him think any different,\" one of the Space Marines says, as Kyros hands him a long chain which the space marine wraps around his fist.\n\n\n\"That'll control his collar, marine. Use it to throttle the life out of him if he gets uppity.\"\n\n\n\"Yes, sir,\" one of the space marines responds.\n\n\nYou can practically feel the super-soldier maliciously grinning through his helmet. \n\n\n\"Now, let's take our newly evolved friend to the training pit,\" Kyros smiles. \"Test out his new abilities.\"", "action_results": [{"action": "An Hour Later...", "result": "You sit in the middle of a large, Colosseum-type building. Kyros stands in a booth up above you all, next to Magos Cern and Taj Suenage. All around the seating area are the various men of the ship, crewmen, soldiers and the favored slaves. In four side of the circular arena are metal gates, where your foes will be released from. You question the insanity of building a fighting arena aboard a spaceship with very limited space, but then again, you're not in charge.\n\n\n\"Alright, Karth, the rules are simple. No attacking the audience. There is a protective shield keeping you guys in there from damaging the crowd or, Dark Gods forbid, me. Also, if you try, we're more than happy to strangle the life out of your, break your body and bind your soul to a Soul Grinder,\" Kyros shouts. \"Now, let's begin. Leave none alive!\"\n\n\nThe first gate opens, and you freeze as you see a group of a dozen shambling mutant abominations walking forward. You can tell they were once human, but now you can barely tell. Tentacles, extra limbs, massive tumors, animal parts and much worse. There's barely a human intelligence left behind their eyes, replaced by an animal-like instinct. They shamble towards you, roaring, howling, screeching, shouting, hissing and letting out whatever bursts of noise they can.", "action_results": [{"action": "Fire psychic bolts of energy", "result": "You fire a bolt of purple energy, striking down the largest whose head explodes. You flick your wrist again, burning the hair off a howling beastman. A mutant is struck in the face by another bolt, and by now they're confused and scared, attempting to flee back to the gate they came through which has now closed shut. Needless to say, it doesn't take much more to fully finish off the mutant pack, leaving them all dead.\n\n\n\"Alright!\" Kyros yells cheerfully. \"Now, anyone can strike down some animalistic mutants. Now, let's see how the gladiator-slaves fare!\"\n\n\nYou watch as another gate opens, and half a dozen semi-armored humans walk out, holding swords, spears, halbeards, axes and all hold shields. Thankfully, they've no long-range weapons, so you have a fairly good chance. With that, they begin to advance. They're in a solid formation, bundled together to stop you from picking them off one, shields raised in an attempt to mimic a shelled creature.", "action_results": [{"action": "Fire a burst of flames at them", "result": "You raise your hand, firing a stream of fire that manifests in your palm and gushes out towards your foes. They raise their shields, but the fire easily surpasses them, going past the shield and searing flesh, burning hair and melting bone. There's a burst of screams and howls of pain that quickly fizzle out, leaving a mass of ash, burning flesh and melted armor and weapons. \n\n\n\"Alright, alright!\" Kyros yells. \"Let's see him fight some real, blooded warriors. May I introduce the last known members of the Pandemian 501st Regiment!\"\n\n\nThe third gate opens, and ten men wearing combat armor, gas masks and holding lasguns with bayonets march forward in unison, before raising their weapons to fire. You need to react quickly.", "action_results": [{"action": "Teleport behind the enemy", "result": "You close your eyes, opening them once more and finding yourself less than a step behind the soldiers, who look around, confused, not noticing you. Time to strike.", "action_results": [{"action": "Send a fireball hurtling towards your enemy", "result": "You fire a massive, burning fireball directly at the guardsmen. Unfortunately, you over-estimated the distance between the two of you. The guardsman is engulfed in a fiery explosion, but unfortunately you are as well, your skin turning to ash and your bones quickly melting, your soul expiring shortly after.", "action_results": []}, {"action": "Charge them with psychically-enhanced fists", "result": "You charge forward, as psychic energy floods into your fists. You grab one, yanking her head off and flinging it with all your psychic strength at another. You grab a lasgun, breaking someone's neck and beheading two more with the bayonet. The guardsmen panic, falling over each other to escape, but you don't give up, finishing the rest of them with relative ease.\n\n\n\"Alright, he's shed some blood. Perhaps we should give him a break,\" Kyros says, before laughing cheerfully. \"Or perhaps... we should give him a real challenge. Bring out the Champion of Davial!\"\n\n\nThe final gate, the one behind you, opens. You spin around on the balls of your feet, prepared to kill, even through you're exhausted. You can here your psychic defenses begin to falter as the voices come back, thousands of voices screaming, laughing and howling in your mind. Physically, you're tired from this heavy exercise, and just want to pass out. You watch in terror as a massive figure clad in huge plates of armor walks forward. Two sharpened tusks come out from his helmet, and in one hand he holds a massive warhammer, while in the other, attached to his arm, is a bolter. By either side of the massive Champion is a nearly naked slave wearing rags, trying to polish the armor while the Champion of Davial continues walking forward.\n\n\n\"Begin!\" Kyros shouts.\n\n\nSuddenly, you hear another familiar voice.\n\n\n\"Hello, my dear Karth. I see you're outgunned here. Need some help?\" Meliodas asks.\n\n\nThe Champion raises his bolter and it fires. You quickly form a shield, barely absorbing the massive amount of power behind the bolter. \n\n\n\"I can help you, but you're going to need to get your hands dirty. See those two slaves? Go for them. Boil their bloods with your mind, and help draw the psychic beings that are trying to enter.\"\n\n\n\"What?\" you ask aloud, teleporting out of the way of another burst of bolter fire as the Champion of Davial continues to advance.\n\n\n\"Kill the slaves. I'll offer their souls as a... summoning gift to two potential allies for you.\"\n\n\nThis presents a moral dilemma. Can you wipe out the two slaves in order to win this battle? Can you even trust Meliodas? You do have other options. Through teleportation and levitation, you can easily evade the Champion, and you can wait to tire him out. You can attempt to wear down the Champion's armor through fire and psychic bolts. You can also attempt to teleport atop the Champion and try use your psychic powers to tear this bastard's head off.", "action_results": [{"action": "Kill the slaves for Meliodas", "result": "You nod, raising your hands and directing a blast of powerful psychic flames towards both slaves. The slaves are hit by the stream of fire and engulfed entirely, their existence ending with a powerful scream. The fire engulfs them, but while the bodies falls apart to ash, two new shapes appear in the fire. You watch, as from the engulfing flames step two daemons. They're humanoid, half beautiful women and half horrifying crab-monster. Their face are stretched and gaunt, like once beautiful women whose faces melted, with long black hair, pale skin changing to black shell in patches over their bodies and a massive claw having replaced their right arm. They eagerly turn to the Champion of Delial, charging forward. They bounce, picing and attacking and cutting through metal with their powers. You fire a stream of fire at the Champion's armored head as the two daemons repeatedly pince and cut at his head and chest. He fights valiantly, but he doesn't last long fighting two powerful daemons and a psyker. He falls to his knees, before collapsing onto his face. The space marine guards begin sending bolter fire down at the daemons, who quickly with under the fire before collapsing back into the flames, disappearing, leaving you in an arena, empty except for the corpses of your enemies. \n\n\n\"Well,\" Kyros says. \"That was interesting. I didn't expect daemon summoning to be in your inventory. None the less, well done.\"\n\n\nKyros levitates down towards you as the shield evaporates, before ending up less than two or three feet above you.\n\n\n\"Well done, noble warrior! Look and behold the powers of the Warp!\" he says, in the opening of a speech.", "action_results": [{"action": "Kill Kyros", "result": "You take a deep breath, preparing all of your reserves of psychic energy. Quickly, you manifest it in your most powerful bolt yet, before firing straight at Kyros. The energy drained from you, you collapse to your knees. You feel your collar flex, beginning to choke you.\n\n\n\"Ha! You have balls, my little ally! I love it!\" Meliodas cries.\n\n\nKyros rises up quickly and brings the shields up full force, and they explode, barely managing to contain your psychic power. Kyros watches as the collar chokes the last ounce of psychic power from you, dropping down to his previous height with an enraged snarl.\n\n\n\"Is that how you want to play this, you little cunt?\" he snarls.\n\n\nYou search your mind, but your entire psychic reserve is gone. You can't even make a spark. You do have a ounce of physical strength yet, before you collapse from exhaustion, and you intend to use it.\n\n\nThe entire audience of slaves, mutants, soldiers and thousand-year old warriors watches as you arch your head back and spit in Kyros face, before collapsing.", "action_results": [{"action": "The Familiar Oblivion...", "result": "After going through another sparse of evil dreams and horrifying nightmares, including getting chased by tentacle abominations through tunnels, watching your tribe being flayed alive by men infested by worms and covered in a solid sheet of pus and staring into the eyes of beings of pure, unending hate, you awaken in a small room. You're lying on a metal table, completely naked, while Magos Cern stands nearby, drilling holes through a large blob of meat on another table.\n\n\n\"Ah, the good Techpriest is looking after you. You'd have been safer if they tossed you in a pit of deathworms,\" Meliodas says.", "action_results": [{"action": "Speak up", "result": "\"Hello?\" you say.\n\n\n\"Ah, look whose woken up,\" she says, her head swiveling around mechanically to stare at you\n\n\n\"What happened?\"\n\n\n\"You passed out from fatigue. I brought you here, left you to sleep for a while, injected you with a few shots of adrenaline, gave you a full cleansing of your blood and burned off a few layers of your skin to remove all Chaos taint.\"\n\n\nShe emits a long burst of static energy, before staring at you.\n\n\n\"Kyros has been informed of your awakening. He'll be here shortly.\"\n\n\nMagos Cern immediately goes back to working on the chunk of meat, clearly not in the mood to converse. After a few minutes, Kyros enters, covered in blood. He seems quite calmer then before.\n\n\n\"Ah, look who it is, the traitorous bastard.\"\n\n\n\"You invaded my world, burned my villag, killed half my tribe and enslaved the other half. What did you expect?\" you say.\n\n\n\"I suppose. I just assumed you were intelligent enough to know that that would never work, or even a little grateful at the fact that I had given you the gifts of power.\n\n\n\"It's quite hard to use the gift of power while bound by chains.\"\n\n\n\"Perhaps,\" Kyros says. \"You're to be escorted back to your cell. Let's go.\"\n\n\nYour four guards enter, as stern as ever, and you stand, following them along the halls.", "action_results": [{"action": "A Week Later...", "result": "The week goes by. Your guards give you no chance to even think about escape, let alone actually making an attempt at it. You practice fighting in the arena everyday, facing hordes of mutants, failed attempts at creating super-soldiers, thankfully none of them from your tribe and a few slaves thrown in there for you to kill. Kyros is prone to sending out enemies that can cause painful wounds such as those that utilize painful poisons and toxins. It seems he's still bitter about the fact you tried to murder him. Understandable. After that, you have meditation, to calm the storms of your mind and give you a chance to keep the demons, and more literally daemons, at bay.\n\n\nYou spend time with Kyros as he attempts to indoctrinate you to serve him willingly, although after your attempt at his life this time mainly serves as a time to check on the wards for your collar and make sure you haven't circumvented them. You give him the idea that you're buying it, but you know he's just a madman. His ultimate goal seems to be regrouping with several other Chaos war-bands of various sizes to topple the Imperium of Man and take Terra, although the whisperings from other men tell you that that is an impossible goal.You're still not allowed to see Fay or anyone else com your tribe. You shudder at the thoughts of what Kyros is doing with them. For all his friendly gestures, kind deeds and grand ideals and plans, Kyros is but a corrupted mad man who is willing to sacrifice anyone and everyone in an attempt to gain power.\n\n\nUnder the Magos' orders, you've spent a lot of time sleeping from either the fatigue of constant fighting and training to expand your mind and permanently trying to ward off the daemons that scratch at your mind, or from various drugs and chems to put you under. Sleeping is painful, for the most part. You get a few brief bit of oblivion, which is a peace incomparable to anything you've ever had to deal with, but these states still being you deeper into your mind and the theWarp. Then the nightmares start. In the waking world, you have classes with the teachers. Kyros teaches you meditation techniques for controlling your powers as well as new ways to utilise the psychic energy flowing through your mind. Taj teaches you military tactics and how to lead everything from a small unit of hardened men to a massive army of garrisoned troops. Magos Cern teaches you a bit about mechanics, the various technologies of the galaxy and gives you a broad, general education about the galaxy and its inhabitants.\n\n\nOne day, you lie in bed, having emerged from the state of horrified dreaming but not yet having fully awoken, in a blissful, thoughtless state. The door opens, as two of your space marine guards enter. One uses a small device to make your collar tighten quickly before releasing again, a small threat to make sure you know whose boss. The fucking collar. You could turn him into a thick pink mist inside that armor if the collar wasn't stifling your abilities. \n\n\n\"What?\" you ask, annoyed to have been disturbed from your bliss.\n\n\n\"Kyros wants you,\" one says.\n\n\n\"What does he want?\"\n\n\nKyros appears in the room, leaning against the doorway, seemingly manifested out of thin air.\n\n\n\"Come on, let's go,\" he says nonchalantly, picking his nails.\n\n\n\"Where?\" you ask.\n\n\n\"Well, as a... reward for your long week of work, I have a surprise. We're going to go see Fay.\"\n\n\n\"Really?\" you ask.\n\n\nA surge of emotions rising up inside you. Joy at the thought of seeing your friend, surprise at Kyros' kindness, gratitude for the gift, fear at what could've happened Fay, all these manifest into an overwhelming feeling of both exhilaration and dread.\n\n\n\"Well? Let's go!\" Kyros says, walking out of the room.", "action_results": [{"action": "Follow Kyros", "result": "You stand, walking along after Kyros. You're at a point where your psychic growth has overtaken your physical growth to such a degree that it'd be easier to float along the ground rather than actually having to walk. Unfortunately, the collar prevents you from even firing out some sparks without Kyros' permission. You arrive in a metal door, which opens, revealing the booth from which Kyros and the others watch down at the fight. You walk along, looking down at the arena, which is empty.\n\n\n\"I thought you were bringing me to see Fay,\" you say nervously, despite knowing what this is.\n\n\n\"I brought you to see her fight!\" Kyros says with a smile.\n\n\nYou stare down, as one of the gates opens. You watch as an abomination stumbles out. Stumbling on four insect-like legs, with it's eft arm replaced by a long tentacle of coiled pink muscle, the very end of it studded with bone outgrowths to make it a more formidable weapon. In it's right hand is a short, rusted axe stained with blood and gore. It's head is monstrous, with an oversized mouth filled to the brim with teeth, overflowing with acid that drips onto it's chest with a sizzle, and a single, blood-shot eye. The creature looks up at you, it's eye flinching, before it lets out a miserable howl.\n\n\n\"Shit... that looks miserable beyond belief,\" you say.\n\n\n\"Yes, she does,\" Kyros says, grinning from ear to ear as half a dozen more beasts just like the first walk, stumble or crawl into the center of the arena. \n\n\n\"She?\" you ask.\n\n\nNow that you're not fighting them, you can have a long look and see what these mutant abominations really are: disgusting, pitiful creatures that should receive a quick death.\n\n\n\"You don't recognize her?\" Kyros says, clearly suppressing laughter. \"This is what remains of the Uwais Tribe, and the first one to come out, the pack leader, is Fay.\"\n\n\nYou look at monsters underneath, trying to see any resemblance to your friends as pure horror overtakes your mind. You collapse to your knees, puking over the banister and onto the monsters underneath as Kyros bursts into laughter.\n\n\n\"He's done this to provoke you. He wants to get you angry, to see how powerful you are even with the collar. He's under-exaggerating how powerful you are, so you might be able to harm him, but...\" Meliodas advises, but you don't pay any attention, too filled with anger.\n\n\nYou stand, holding onto the banister to pull yourself up. Your knees shake, but you take a moment to regain your strength. Then, you launch yourself at Kyros. You grab at his eyes, your fingers going straight for his eyes. Kyros stumbles backwards, unprepared, before you feel your collar quickly tightening as you start to choke. You continue to scratch and gouge, even as the air is choked from you. Finally, you're dragged upwards by invisible hands, floating a few feet away from Kyros. Your weak body has done practically no damage to Kyros, who seems surprised and a bit amused rather than angry.\n\n\n\"Hmmm... I under-exaggerated how angry you'd get, or how stupid you are if you think trying to fight me is an option.\"\n\n\n\"I'm going to kill you. I'm going to break you. I don't care how long it takes, I will destroy your very soul,\" you say, staring at him.\n\n\nKyros chuckles softly, before forcing you around to stare down at the arena.\n\n\n\"Watch the match,\" he says.\n\n\n\"We will have our revenge, Karth. Not today, not tomorrow, but we will have our revenge, \" Meliodas says.\n\n\nYou watch for about a minute as the abominations sit there, wandering around in confusion, falling to brief bursts of violence and self-harm and a lot of screaming and howling. Finally, the second gate opens. You watch as hooded figures enter, holding swords and small, circular shields. The trio charges forward, diving into the air. The beasts charge forward, attacking with fierce brutality. You watch as the lead one, the thing that used to be Fay, is almost beheaded by one of the trio. The trio fight with ease, diving, ducking and weaving out of the way of tentacles, axes, biting and stomping. Within a minute, the last of the abominations stumble forward and hits the ground as its front two legs are hacked off, and one of the trio leaps on top of the monster and impales it through the head.\n\n\n\"What a display!\" Kyros says with a smile. \"Shall we see the victors?\"\n\n\nBefore you can say a word, Kyros releases you and you fall through the air, smacking into the dirt with a pained yelp. You moan in pain, looking up at the fighters. They walk forward, staring at you.\n\n\n\"Karth?\" one of them asks.\n\n\nYou look up to see Fay standing there, her hooded robes covered in blood, alongside two other Uwais tribals you vaguely remember from your trips accompanying hunting parties, the Jakar Twins.\n\n\n\"Fay,\" you reply, staring back at her, not knowing what else to say.\n\n\nFay tosses her sword aside, grabbing you and embracing you tightly. Even though you feel yourself being turned into a fine powder from the strength of her hug, you're just so happy that you've found her that you don't care, hugging back. Kyros drops down, staring at you from over Fay's shoulder, as Magos Cern joins you.\n\n\n\"Ah, what a happy reunion!\" Kyros says.\n\n\n\"You said she was dead!\" you shout angrily, pushing Fay aside to point an accusatory finger at him.\n\n\n\"I did. I lied,\" Kyros says, smiling.\n\n\n\"Never trust a psyker, Karth. Not even yourself,\" Meliodas says.\n\n\nYou shrug it off, trying not to bow to his attempts at emotional manipulation. You grab Fay, looking at her properly as she takes off her hooded cloak. She's tall, standing over six foot tall, and she's a lot more muscular than you remember. Whatever Kyros has done to her, it's had a serious affect. Her arms and legs are quite muscled, and you doubt you could find an ounce of fat anywhere on her. Still, she has the same coy smile, the wild, adventurous look in her eyes, She's pretty much the same Fay.\n\n\n\"So... what's with the hood?\" you ask, struggling to find anything else to say.\n\n\n\"Um... it's so the mutants can't grab my hair and drag me down, Karth. Was that the most important question? How are you? What are they doing to you?\"\n\n\n\"Come on, out of the arena. I have a captured Squig the boys want to have some fun fighting,\" Kyros says. \"Jakar twins, back to the dorm. Karth, Fay, follow me.\"\n\n\nYou look at Fay, before grabbing her hand and walking after Kyros and Magos Cern.\n\n\n\"Hmm, walking alongside me with my hand held? Where's the old Karth that I would piggyback around the village?\" Fay asks.\n\n\n\"Pffh, if I didn't have this collar I'd be floating around the place,\" you say.\n\n\nThe stress of being kidnapped, having your tribe enslaved and murdered, your village burned down, your mind and soul forced through the very depths of hell falls away as you talk to your old friend. You recount your story as she tells hers. Apparently, she spent much of the time in a coma, having her body hacked apart and remade. Her blood now contains vast amounts of chems and combat drugs, she has several new organs and stronger bones, faster blood clotting and much more. She's trained extensively both with swords, guns, explosives and infinitely more, as well as team tactics. She's been chosen out as Team Leader for the Uwais super-soldiers.\n\n\n\"So basically, you've become a super-soldier?\"\n\n\n\"Super-soldier?\" Magos Cern says, her voice flooded with the most emotion you've heard from her the entire time you knew her. \"She's a failure. A disgrace. I had access to geneseed, space marine test subjects and untold resources. What did I create? A mockery. These \"super-soldiers\" couldn't take on multiple space marines each like I had hoped. They couldn't take on a single fucking space marine like I had planned! They're barely worth half a space marine! I've failed!\"\n\n\n\"They'll do fine, Magos,\" Kyros says, arriving at another set of metal doors, which open to reveal a large table, where various figures are sitting.\n\n\nThere's Kyros, Magos Cern and Taj Suenage, as well as Kyros' daughter, who sits in the corner. There's also many more who you don't know. One is a tall, gaunt looking woman with pale skin and black hair pulled back in a pony tail, wearing a long coat that disturbingly, appears to be made from human skin. Another is a girl with a shaved head wearing heavy combat armor who is sharpening a long machete, another is a... person whose gender you can't tell, wearing black leather armor and lingerie in an odd attempt to look sexy at a war meeting, with long, curly black hair and excessive make-up. The person smiles at you, licking his... or her... or its lips. Then there's a young girl, younger than even you, wearing hooded robes and reading an ancient, dusty tome. Finally, there's a barely human monster. An obese man covered with rotting pores, boils, sores and pus-filled, infected wounds, with its arms replaced by long, rusted spikes. Kyros and Magos Cern take a seat.\n\n\n\"These are the leaders of the fleet, Fay and Karth. Some introductions are in order. First is me, the supreme leader of the entire fleet. Magos Cern leads the Dark Mechanicus on the ship and maintains the vessel itself. Chapter Master Taj Suenage leads the space marine chapter on board, the Undying Reapers. Then we have Calpurnia the Ravager, leader of the 22nd Istanford Regiment. \"\n\n\nThe one with the human skin coat stands up, extending a hand to shake.\n\n\n\"Pleasure to meet you,\" she says, shaking both your hand and Fay's. I hope you're... efficient during your stay here.\"\n\n\n\"Then there's the Staine siblings. There's Rebecca Staine, the leader of the Bloody Claws, a war-band that worships Khorne the war god.\"\n\n\n\"Fuck you, psyker. You're weak and pathetic. Your parents should've left you to die,\" Rebecca growls, pointing her blade at you.\n\n\n\"Fuck you,\" Fay snarls, shoving her blade point away from your throat.\n\n\nRebecca stands, brandishing her sword, before the plague-ridden man stands, blocking Rebecca's path forward with one of his spike arms. \n\n\n\"Hey, hey! There's no need for violence! We're all brothers and sisters here!\"\n\n\nRebecca sits back down with another growl.\n\n\n\"Alright, next we have Elios, leading of the Shrieking Harpies, a war-band that worships Slaanesh, the god of excess,\" Kyros says, pointing at the person clad in leather and lingerie.\n\n\n\"Pleasure to meet you, darlings. For slaves aboard a Chaos vessel, might I say you're looking... delectable,\" Elios says in a deep, masculine voice, licking his lips as he stares at both you and Fay.\n\n\n\"Keep it in your pants, Elios,\" Kyros says. \"Next we have Elizabeth.\"\n\n\nElizabeth, the hooded girl reading the book, doesn't look up.\n\n\n\"She's risen to the position of leader of the One-Eyed Crows, a war-band that worships Tzeentch, the sorceror god. She easily reached the position through her amazing social abilities. Tell us about yourself, Elizabeth.\"\n\n\n\"Move along,\" Elizabeth says, making a circular motion with her hand without looking up.\n\n\n\"OK, Elizabeth. Finally, we have Durge, leader of the Black Rats war-band that worships Nurgle the plague god.\"\n\n\n\"Hello!\" the diseased man says, waving his spike-arms. \"It's a pleasure to meet you! I hope you're being treated well. I hope you're being fed enough. If not, it's probably because I've eaten all the food aboard this vessel!\"\n\n\nThe man, Durge, breaks into laughter as several maggots burst from his skin. You try not to get sick.\n\n\n\"You're here to meet the leaders of this fleet so that you know who you'll be answering. We want you both to lead the slave army.\"\n\n\n\"Slave army?\" Fay asks.\n\n\n\"The Uwais tribe soldiers, the previous batch of failed test subjects, the gladiator slaves and whatever else we can muster up. We'll hold the detonators to your explosive collars, but you'll hold a copy of the detonators for all the men under your command.\"\n\n\n\"There was a previous batch of failed test subjects?\" Fay asks.\n\n\n\"Yes, there was. They were quite strong, but their minds were easily broken. Most weren't sentient, the sentient ones were insane. There was only one who you could even have a conversation with, the one I appointed leader. I'll show you to them some time after this. I assume you'll take the position?\"\n\n\n\"It's not like I have much choice,\" you say.\n\n\n\"We'll take it,\" Fay says, answering for the both of you.\n\n\n\"This slave army, ot whatever you want to call it, will give us the strength advantage to become a serious military power in this tiny little sector. We could conquer ourselves a little kingdom from the weak and undefended worlds. We could become a raiding fleet that could have us living a life of luxury. But one little slave army wouldn't even give us a chance against even the defenses on Pluto!\" Calpurnia says.\n\n\n\"I'll tear out your soul and devour it if you show anymore signs of cowardice!\" Kyros yells. \"Magos Cern, take Fay and Karth to see the previous batch of super-soldiers.\"\n\n\n\"I'll have to let the galaxy witness the shame of my failed creation when we release them on the galaxy. I might as well let the two adolescents have a preview of my sickening failure,\" Magos Cern says.\n\n\n\"We're not finished here!\" Calpurnia splutters angrily. \"I'm not launching my army on a suicide mission!\"\n\n\n\"My army! As long as you serve me, it's my army!\" Kyros screams.\n\n\n\"We take a vote, then,\" Calpurnia suggests.\n\n\n\"Fine, raise your hands if you don't want to go through with the assault, if you're a coward, if you're not loyal.\"\n\n\nCalpurnia defiantly holds up her hands. Elios holds up his next.\n\n\n\"Sorry, Kyros. I'm not dying.. I'm too young and beautiful to die fighting an unwinnable war,\" he says.\n\n\nDurge holds up a spike, looking ashamed.\n\n\n\"I'm loyal, Kyros, but I'm just as loyal to my men as you, and I won't see them die for nothing.\"\n\n\nElizabeth slowly raises a hand, looking up from her book for the first time. \n\n\n\"This plans suicide, Kyros. We both know that.\"\n\n\nKyros snarls in anger, looking around.\n\n\n\"That's me, Cern, Taj and Rebecca for attacking, and Elizabeth, Durge, Elios and Calpurnia for not doing so,\" Kyros says in a low growl.\n\n\n\"The slave leaders are the tie-breakers, then,\" Calpurnia says. \n\n\nKyros looks at you with a stare, holding onto the controller for your collars. Well, this seems like an obvious answer, even if it is a suicide mission.", "action_results": [{"action": "Support the assault on Terra", "result": "You keep your hand at your side, and while Fay raises an eyebrow, she does the same.\n\n\n\"Cowardly... but smart,\" Meliodas says. \"Perhaps you'll realize your potential after all.\"\n\n\n\"Good... good!\" Kyros says, his voice flooded with relief. \"The slaves are loyal! Now I must question why my own allies aren't.\"\n\n\nAn uneasy silence fills the room, before Magos Cern breaks it.\n\n\n\"I shall take Fay and Karth out to inspect their new troops, the old generation of super-soldiers. Is that acceptable, Kyros?\"\n\n\n\"Yes, yes,\" Kyros says, his mind clearly focused on other things. \"Go then.\"\n\n\nMagos Cern walks out of room, and you quickly follow, followed by Fay. You walk along empty hallway, heading towards the super-soldiers. Magos Cern is clearly not interested to talk at all, so you and Fay have time to talk.\n\n\n\"So, what just happened?\" you ask. \"Were we just given an army?\"\n\n\n\"We've went from slaves to masters of a slave army, in five minutes,\" Fay says.\n\n\n\"Well, to be fair, we're still slaves. We're slaves who are also slave masters of a slave army,\" you point out.\n\n\n\"Alright, I suppose so. Anyway, are you OK? We've walked a lot,\" Fay says.\n\n\n\"I'm fine,\" you smile. \"I don't know whether to be thankful you're looking out for me, or insulted you think I can't even walk that much.\"\n\n\nYou walk on, eventually entering a large, metal elevator. The elevator quickly begins descending down the ship.\n\n\n\"Alright, children. Listen up. We're going to wake our super-soldiers from their cyro-sleep. Don't make any sudden movements, don't make any loud noises, do nothing of the sort.\"\n\n\n\"Got it,\" you both say.\n\n\nThe elevator doors open, revealing hundreds of metal tubes lining the walls, the cyro-pods. Magos Cern walks forward, extending a metal tentacle that grows from her spike. The tentacle presses onto the consoles attached to the many pods, and three open. Cold air quickly floods out, and you watch as three lumbering monsters walk out. \n\n\n\"Behold, my failures,\" Magos Cern says.\n\n\nThe super-soldiers stand at eight feet tall, and are made of massive coils of muscle that makes them nearly twice as wide as even a normal man, without any armor. Their mouths are filled with hundreds of carnivorous teeth, like a shark's. They have short, four-inch bone claws extending from their wrists. Their skin is dark and misshapen, like someone tanned human skin to make leather and then stitched it over their bodies. They walk forward, grunting and growling. The first looks around, before stumbling back inside it's cyro-pod.\n\n\n\"Sleep... sleep... sleep...\" it mutters, walking back inside.\n\n\n\"Size isn't everything... but it sure as fuck counts for a lot,\" Meliodas remarks.\n\n\nThe other two immediately begin head-butting each other with grunts, and you hear the sound of heavy bones smashing against each other. Magos Cern takes out a small data pad, pressing it. The two super-soldiers grunt, wandering back to their cyro-pods.\n\n\n\"These are the super-soldiers. The guards here have given them the nickname \"Goliath's\". I suppose it's fitting. They're not smart, but they fear the lash and the electro-collar, so they follow orders easily.\"\n\n\nTo prove her point, Magos Cern pulls out a small datapad, quickly tapping it. The pair of super-soldiers roar in pain, backing up into their cyro-pods. Magos Cern quickly taps on the pad and the cyro-pods close. He strides forward, to another tank.\n\n\n\"Let me introduce you to Specimen 401245. It goes by the name Cain. It's the most intelligent of the beasts, and the most friendly. Now, here he is.\"\n\n\nThe cyro-pod opens as Magos Cern taps quickly on the datapad. You see another massive, lumbering Goliath wander out of the cyro-pod. It looks almost the exact same as the others, the only differences being a pair of bone growths sticking out of its forehead like horns and its oversized lips held up by hooks to allow it to breath. It steps out, taking in a deep breath, before staring at you. There's a brief silence, that Fay quickly breaks.\n\n\n\"Does... can it talk?\" she asks.\n\n\n\"It can definitely hear,\" the beast grunts in response.\n\n\n\"Um, hi there!\" Fay says. \"I'm Fay. What's your name?\"\n\n\n\"Cain,\" he responds, his voice a low, rumbling, guttural growling sound.\n\n\n\"I'm Karth,\" you say.\n\n\n\"What time is it?\" Cain asks.\n\n\n\"Time?\" you respond. \"I don't know. A little after noon, probably, or what the ship uses as noon.\"\n\n\n\"I don't care. What time is it for me?\"\n\n\n\"... uh... the same time?\"\n\n\n\"I am awake. I always sleep in the cold pod until I'm needed. I'm only needed to be cut up, drugged, poked and prodded, or to kill. What time is it for me to do? Kill, or be torn apart?\"\n\n\n\"Neither. I'm here to introduce you to Fay and Karth, the new leaders of your men.\"\n\n\n\"My men? First time I've heard them called men,\" Cain says, running his claws against each other absent-mindedly. \"Well? They've met me. What else is there? What do you want to know?\"", "action_results": [{"action": "Ask a question", "result": "\"What?\" Cain grunts. ", "action_results": [{"action": "\"How did you get your name?\"", "result": "\"Found it scrawled in a tome that was dropped out in the trash, back when they let us be rather than freezing us. \"Cain\" is a lot easier to remember than the Subject however many numbers,\" Cain says.", "action_results": [null]}, {"action": "\"How old are you?\"", "result": "\"How old? I don't know. Time in the cold pod makes it hard to tell. There's no sun, no days, no minutes,\" Cain says, seemingly pondering this.\n\n\n\"This subject is roughly five years, three months and two days.\"\n\n\n\"Ah... interesting,\" Cain remarks.", "action_results": [null]}, {"action": "\"How many men do you have?\"", "result": "\"Do I look like I've counted many?\"", "action_results": [null]}, {"action": "\"How capable are your men?\"", "result": "\"They're tough. We've fought many times before. Most of us can wield bolters, though a few just end up using them as clubs to fight with their claws. A few can operate bigger weapons, and a few can only wield clubs and such. They follow orders, though. They show no fear, feel no pain, lose no battle. They'll take as much firepower as the enemy can give, even without armor.\"", "action_results": [null]}, {"action": "\"What exactly is your motive?\"", "result": "\"Motive?\"\n\n\n\"What do you want?\"\n\n\nCain pauses, scratching one of his \"horns\". The horn begins to bleed, but you doubt he cares.\n\n\n\"I don't know,\" Cain finally answers.", "action_results": [null]}, {"action": "\"I've no more questions.\"", "result": "\"Alright,\" Cain sleeps. \"What else?\"\n\n\n\"Nothing else is required,\" Magos Cern says. \"Return to your pod.\"\n\n\nCain nods, before walking back into his pod. The cyro-pod shuts, leaving Cain back to his cold, endless sleep.\n\n\n\"We should continue,\" Magos Cern says. \"I still have to show you the gladiator slaves who you'll take under you command and the Uwais Tribe. The Goliaths will act as your heavy shock troopers, the gladiator-slaves will act as scouts, skirmishers and fill in whatever spare roles you have, and the Uwais tribe will be your main unit. I'll take you to see them.\"\n\n\nYou begin following Magos Cern out of the cyro-sleep area, and along the hallways. After ten minutes, you reach a large metal door, which opens to reveal a large room filled with bunk beds, with familiar bronze bodies lying in the beds. \n\n\n\"This is Dorm A. We have around sixty soldiers here,\" Magos Cern says.\n\n\nFay walks into the room, and lets ou a shout.\n\n\n\"Gentlemen! Your captain's back!\"\n\n\nThe tribals roll out of bed. You recognize a few of them, but strangely you recognize many as men from other various tribes.\"\n\n\n\"Fay, you're back!\" one says.\n\n\n\"How did the fight go? It took far longer than expected,\" another adds.\n\n\n\"Oh, shit! Is that Karth?\" another asks.\n\n\nThe attention immediately goes from Fay to you, as tribals begin appearing. They all appear far more muscular, many bearing fresh scars.\n\n\n\"Karth! How are you even still alive?\" someone asks incredulously.\n\n\n\"It's the Uwais shaman!\" another asks.\n\n\n\"Karth, how are you? What have they been doing to you?\"\n\n\nYou watch as the tribals begin to surround the three of you, although Magos Cern makes sure they keep as least half a dozen feat away from her. \n\n\n\"Stay back. Karth is only here to see you, not talk to you,\" Magos Cern says, drawing a datapad and letting out an electro-shock that causes the group to let out a pained yelp before they back away.\n\n\n\"Why are there so many men and women from other tribes? I thought it was the Uwais tribe who was kidnapped.\"\n\n\n\"When we arrived on your planet, we needed to do a lot of work. We drained lakes for water, drilled into the planet's crust to get vast quantities of Promethium, wiped out native species for food. It takes a lot of effort to run a vessel this large, and to do it quickly and efficiently. While we did so, our soldiers went to work. They needed to fight, both to train and to simply shed blood for their own enjoyment. Prisoners were taken in vast quantities, and I used them as I used the Uwais tribe. Now, there's far more from other tribes than there are from Uwais tribe.\"\n\n\n\"Hmmm... your home world is destroyed. Ambition is the only path forward now, Karth, there is no going back. We will conquer the stars together.\" Meliodas says.\n\n\n\"I suppose calling them the Uwais tribe is a bit of a failing, then. Tribals would be more suitable.\"\n\n\n\"As you wish. You are their superior. You can do as you wish with them.\"\n\n\n\"The average tribal will be be outfitted with combat armor as well as some equipment, such as grenades, gas masks, communications devices, that kind of thing. The stronger ones will get Bolters, the strongest will be equipped with melee weapons; chainswords, chainaxes, power swords, as well as bolt pistols. The weaker ones will be given specialized roles and equipped for as such: meltaguns and missile launchers for anti-armor, snipers with sniper rifles and stealth roles with chameoline cloaks and silenced weapons. We should have a fairly well equipped army that will be able to hold their own when fighting alongside the Guardsmen and Traitor Marines we have under our command.\"\n\n\n\"We're not fighting for you fucks!\" someone shouts. \n\n\n\"Yeah! Fuck you, you kidnapping bastards!\"\n\n\n\"Ah, this is an issue,\" Magos Cern says. \"Unfortunately, due to my... failures in work on the brain, Kyros has forbid me to tinker on their minds to ensure loyalty. Fay has only so far failed to do, so it'll be your job now. I need all rebelliousness to be crushed.\"\n\n\n\"How?\" you ask, raising an eyebrow.\n\n\n\"Get it done. I don't care how. I need to go check on the oxygen decks to the macro guns on the starboard side doesn't asphyxiate,\" Magos says, turning around and walking off. \n\n\n\"Well, that's a bitch,\" you complain, turning to Fay. \"I guess we need to get rid of rebelliousness before Kyros gets pissy and blows our heads clean off.\"\n\n\n\"Or...\" Fay says slyly. \"We could just hide the rebelliousness. It would be better if we kept it under wraps until we have a chance to get out of here.\"\n\n\n\"Oh, choices, choices, choices. Terrify, threaten, talk or trust. Which shall it be, Karth?\" Meliodas says.\n\n\nYou walk forward, into the center of the dorm. You have several options here. You could attempt to use some of your psychic powers to show these tribals the true power of the Warp. That would definitely ensure their loyalty, if only out of fear. You could threaten them to ensure their loyalty, once again while out of fear, and you wouldn't have to alienate yourself by making yourself seem like a terrifying psychic being. You could attempt to convince the tribals that loyalty to this place is the only rational choice. You could also take Fay's path, and assure them that they'll have the chance to get revenge, but that for now they should hide all rebelliousness until it's time to strike. ", "action_results": [{"action": "Terrify the tribals with the powers of the Warp", "result": "You tug at your collar, but fortunately, due to Kyros' distraction with his troops who are \"disloyal\", the restrictions are loose. Not gone, still definitely there. You know if you try anything you'll gain his attention and the restrictions will be tightened, as well as the collar around your throat, most likely. Still, you need to take advantage of this and put on a full show. \n\n\nYou walk slowly forward, raising into the air. Black and purple electricity begins running along your body, bursting along yourself. You set alight, as the crimson flames of the Warp engulf. You change your meek and timid voice, amplifying it through the Warp to booming proportions.\n\n\n\"Do you see what I've become? Do you see what Kyros made me? I am a vessel of Chaos, a being of the Warp. This is the power the Warp holds. This is the power Kyros holds, the power this vessel holds, and the power of the cursed men who guard and crew it. You can't possibly hope to beat it. You should only thank the Dark Gods that the role they've asked you to fill is beneficial to you, and embrace this role to the utmost.\"\n\n\nThe tribals, including Fay, stand back, looking terrified. You know in that moment that fear has replaced all rebelliousness in their souls. They'll follow orders now. You drop down to your feet, staring around.\n\n\n\"Spread the message,\" you say to the tribals, before turning to Fay. \"We should go.\"\n\n\nYou walk out of the room, quickly followed by Fay, who runs after you.\n\n\n\"What the fuck was that?\" she asks.\n\n\n\"I did my job,\" you say simply.\n\n\n\"Those are our friends, our family, our kinsman. You're not seriously happy with a life of service to a guy who kidnapped us? These guys killed Duggin!\"\n\n\n\"Duggin was a fool,\" you reply. \"Our lives were once meaningless. Now, we have a hope. Surely you understand?\"\n\n\n\"I wish I could say I could, Karth, but I don't. I don't know how you can think that.\"\n\n\nYou walk outside, where Kyros awaits, smiling.\n\n\n\"Well done,\" he says, smiling. \"Impressive display.\"\n\n\n\"You were there for that?\" you ask.\n\n\n\"I was aware. Why else would your collar restrictions be weaker?\"\n\n\n\"I assumed it was because you were distracted,\" you admit.\n\n\n\"If that was true, whenever I slept you'd be free to do whatever you wanted,\" Kyros says, smirking. \"Now, we need to visit the last of your soldiers, the gladiator-slaves. They're always an interesting crew. Shall we go?\"\n\n\nYou look at Fay, who nods, although she still looks nervous from your earlier \"display\" of power.\n\n\n\"Yes, let's,\" you reply.", "action_results": [{"action": "Visit the gladiator-slaves", "result": "You follow Kyros, as you head to the arena. You reach the doors that would lead into it, but instead oof entering you go off to a small elevator behind it. You enter, and it slowly begins descending. It opens, revealing the underhive of the arena. There's dozen of cages, holding exotic beasts and dangerous Xenos. You see a half dozen thick, heavily muscled, green-skinned Orks in a cage, their necks chained to the wall. They're howling and roaring, tugging at their chains. Surprisingly, while most shout in their barbaric, guttural language, one seems to speak yours.\n\n\n\"Humie! Humie! Get me free! Get me free!\" he shouts. \"I is gonna let you live, even give ya a bitta loot and an escape pod if ya let me free!\"\n\n\n\"Don't respond!\" someone further down the catacombs that lay beneath the arena shouts. \"It only encourages Ol' Dak!\"\n\n\n\"Hmmm... this Ork must be one of the greatest speakers of his kind,\" Meliodas points out. \"Of course to us he's a fucking idiot.\"\n\n\nThe ork's eyes narrow, before he begins howling in frustration and smacking his hands against his own head, a heavy thud emanating as his muscled fists slam into his thick skull. You continue walking, passing amazing and fantastic creatures and gladiators. There's a tentacled slug-man with a large beak and dozens of eyes peppered around his body which is huddled up in the corner of it's cage, a trio of horrible bird-hound creatures that scratch at their bars, a massive human wearing what appears to be an iron cage with hundreds of inward pointing nails who rams himself against the cage wall, his body shredded to such an extent you're amazed he's not dead yet, a multi-legged, horned creature that looks almost cute. Finally, you reach a long hallway, with thick, heavy metal doors spread along the hallway. An eye peers out of a door eye-slot, staring at you.\n\n\n\"Hello there. Do we have more fighters, or...? Oh wait, it's them. Terrific.\"\n\n\nThe eye disappears, and the slot closes. Kyros takes out a datapad, pressing several buttons before the door slowly slides open, revealing a large open area. Bunk beds line the wall, with a bunch of young men and women, the oldest in their late twenties and the youngest in their mid-teens. They wear very little armor, all of which is either leather or light combat armor. They sit around a fire, roasting chunks of meat on sticks in it. Two of the gladiators lean against the beds nearest to you, staring at you. One is a tall, muscled and tanned, with long blond hair and sparking green eyes. She holds a long, rifle-like gun with an axe blade made into the barrel with a grip under it. The other is shorter, with similarly tanned skin, with playful green eyes and curly brown hair, holding a curved sword and a Plasma pistol. They both look to be in their late teens or early twenties at latest.\n\n\n\"Is that a fire?\" Fay asks.\n\n\n\"Are they armed?\" you also.\n\n\n\"Yes and yes,\" the male says, turning to the girl. \"This question game is fun.\"\n\n\n\"The fire's below a vent that's sending the smoke... somewhere. We weren't exactly given schematics of this place, all we know is the smoke doesn't bother us. And we're allowed weapons to keep the others in check. Even if we both went for Kyros, our minds would be shattered before we could raise our weapons,\" the girl says.\n\n\n\"Nah, I could at least start a swing before I was killed.\"\n\n\n\"These are the Twins. They lead the Gladiator-Slaves. Now, introduce yourselves,\" Kyros says.\n\n\n\"I'm Castus,\" the boy smiles, staring at the pair of you.\n\n\nHis eyes flicker, as he looks over Fay. He appears to be checking her out. You feel like punching him in the throat, but refrain.\n\n\n\"You're a jealous one, aren't you?\" Meliodas says.\n\n\n\"I'm Olive,\" the girl says, extending a hand, which you grab and shake before Fay does the same. \n\n\n\"So, is there a reason you're here?\" Castus asks.\n\n\n\"Fay and Karth will be taking command of the gladiators. They are my lieutenants, and will command a segment of our army, the slaves.\"\n\n\n\"Oh, terrific. We've been shafted,\" Castus says.\n\n\n\"I'm sure Kyros will want us to have an advisor position to assist Fay and Karth,\" Olive says.\n\n\n\"Correct,\" Kyros says.\n\n\n\"Well, there might be an issue with that,\" Castus says. \"You see, both Fay and Karth have a history of... well, murdering my men. Pitting the Kyros Jr and Magos Cern's latest brand of super-freaks against us has led to a lot of men being, quite understandably, pissed with the guys who hacked apart, or psychically exploded, or simply beat their friends upside the head until they went comatose.\"\n\n\n\"If you want, we can have the dissenters flailed alive. Simply point them out, and I'll have them broken. Is that preferable?\"\n\n\nCastus goes quiet. \n\n\n\"As I thought,\" Kyros says with a smile. \"Make sure the men know to follow orders. Now, it's late, and these guys need sleep. Is anything else needed?\"\n\n\n\"I suppose not,\" Olive says.\n\n\n\"Well, we need a lot, but nothing we're realistically getting anytime soon,\" Castus says.\n\n\nKyros stares at Castus, fire beginning to run along his body.\n\n\n\"Nothing needed, sir,\" Castus says.\n\n\n\"Good. Fay, Karth, let's go,\" Kyros says.\n\n\nKyros swivels around, walking out of the room. You quickly follow him, and the massive metal door shuts behind you.\n\n\n\"So, we'll escort Fay back to the Uwais dorms, and then send you to your room,\" Kyros says.\n\n\n\"Well you know, Karth's room is closer. I could just spend the time in his,\" Fay suggests. \"It would give us some time to go over battle plans now that we know what our men are capable of, and I can inform him of what the Uwais tribe are like in battle...\"\n\n\n\"Really? That's the reason? That's the reason you're going for?\" Kyros asks, raising an eyebrow. \"No.\"", "action_results": [{"action": "Argue that Fay should spend the night in your room", "result": "\"But she could help me plan what do to with the lieutenants and what to do to secure their loyalty, and...\"\n\n\n\"Don't fuck with me, Karth. You just want the girl there so you can have something fuck. Maybe if you were a little smarter with the way you acted towards me I'd grant you such base pleasures, but you acted like a prick all while you've been here, so no, she'll go back to her bed, and you'll go back to hers.\"\n\n\n\"Surprisingly, the cunt doesn't stop being a cunt just because you want to get laid. Unless I'm wrong and you seriously didn't plan or want to try anything with her, in which case Slaanesh will never get a hold on your soul,\" Meliodas says.\n\n\nYou arrive at the doors to your cell, and Kyros opens it.\n\n\n\"Hurry up, inside,\" Kyros says.\n\n\nYou look at Fay, who smiles at you.\n\n\n\"Bye, Karth. Thanks for trying,\" she says, giving a short little wave.\n\n\n\"Bye, Fay,\" you reply.\n\n\nThe doors are shut, and you walk over to your bed, collapsing on it. Only now do you realize how exhausted you are. You've spent all day walking, which again isn't exactly your specialty. You close your eyes, and soon sleep takes you. Thankfully, the twilight stage where your soul can rest and your exhausted mind can find peace, lasts extra long. Of course, it doesn't take long before the nightmares hit.", "action_results": [{"action": "Sleep", "result": "You writhe in pain, curling up in an attempt to get the endless suffering to end. All you hear is the chattering of thousands of skulls laughing at you. You star up at a mountain of skulls that rises up into the sky past. You can see beasts of metal roaring as they charge across the skulls, ramming into each other with powerful clashes, with dragon-like beasts flying overhead.\n\n\nYou take in a panicked breath, stumbling away from a nearby one and falling. You tumble along the skulls, rolling down the mountain of skulls. You slam into the skull of a massive beast, ending your tumble. You look down at a massive river of boiling blood, horrifying creatures of bones bursting from the water and diving back under again. You frantically try to use your powers, to levitate away from this horrifying place, but you can feel an invisible hand around your neck, closed tightly around your trachea and preventing you from breathing, tethering you to the ground and preventing you from using your power. \n\n\nIt... doesn't go well from there. You wander the endless mountain of skulls, hiding in terror from the daemonic beasts that roam. Eventually, you awaken with a start, finding yourself lying in bed in a cold sweat, naked and scared. The rest of the night is, thankfully, not as bad. The monsters of your dreams staying off in the distance away from you. Sleep is... somewhat bearable.", "action_results": [{"action": "Several Hours Later...", "result": "You wake up to the sound of the metal doors opening. You stand, looking up to see Kyros and Fay entering the room. You realize you're naked, grabbing a blanket and wrapping it around yourself. Fay giggles, smiling.\n\n\n\"Well, that was a surprise. A pretty small one, to be fair,\" she says with a smile.\n\n\nYou find a little leeway with your collar, and eagerly use it through the flick of a wrist and send Fay onto her behind once more. The collar tightens around your throat quickly, making it hard to breath but not unbearable. You raise your hands in surrender, and Kyros releases the collar. \n\n\n\"We're going to the war room,\" he says, softly but creepily. \n\n\nKyros seems considerably darker today. His coat is covered with several dark red splotches and stains. You doubt it's a good idea to ask about their origins. You stand up, following Kyros along the halls.\n\n\n\"What's in the war room?\" you ask.\n\n\n\"We're just having a meeting. Quiet now,\" Kyros says.\n\n\nYou walk along the hallways in silence, passing my various crewmen running along the halls, working. Kyros walks quickly and you break a sweat trying to walk at his pace.\n\n\n\"Can we slow down?\" Fay asks.\n\n\n\"You're a genetically-upgraded super-soldier. Is a fast walk really too much for you?\" Kyros says, continuing at his speed.\n\n\n\"It's too much for Karth,\" she says.\n\n\n\"I'm... fine,\" you pant.\n\n\n\"No you're not,\" Fay says. \"Physical exercise isn't exactly a strength of yours.\"\n\n\n\"He has the energy to talk, he has the energy to walk! Now silence!\"\n\n\nKyros flicks his wrists, and Fay yelps. A long, thin cut appears, running down her cheek, as blood runs down her chin.\n\n\n\"Hey!\" you shout.\n\n\nYou step up, staring into Kyros' eyes. His eyes are wild and cruel. The humor and joy he held only a few hours ago is gone. You realize that he'll be more than happy to hurt both you and Fay seriously. You back down.\n\n\n\"That's what I thought. Now faster, we've wasted time with this!\" Kyros says.\n\n\nYou speed up, moving as quickly as possible. Soon enough you reach the war room. The doors open, and you pause. Inside, lying in her seat, is Calpurnia. All of her skin is just... missing, seemingly flayed off her. Blood covers her seat, the the floor around her and the table. Her eyes are missing, seemingly gored out by inhuman claws. She lets out a pained moan, and you realize with a start that she's somehow alive.\n\n\n\"What the fuck...?\" Fay says.\n\n\nMagos Cern appears behind you, walking forward. She stares at Calpurnia, seemingly disinterested.\n\n\n\"Does this concern me?\" she asks.\n\n\n\"No, old friend.This concerns the others,\" Kyros says, his voice a low growl.\n\n\nUncaring, Kyros sits down at the table. Taj enters, but doesn't even respond, simply taking his place at the table. Calpurnia holds up a hand as if begging for help, but Taj simply spits on the table.\n\n\n\"Traitor,\" he grunts.\n\n\nYou watch as Durge walks in, with Elizabeth at his side. Durge pauses, looking at Calpurnia, before looking at Kyros, as Elizabeth turns very pale. \n\n\n\"What the hell is this?\" Durge asks, staring down at Calpurnia.\n\n\nHis massive, bloated frame waddles forward, standing over the bleeding near-corpse.\n\n\n\"What happened you, he asks, before shoving a spike-arm in front of Elizabeth and pushing her back, stepping in front of her defensively as he stares at the rest of the room. \"Who did this?!\"\n\n\nRebecca walks in, a grin on her face.\n\n\n\"Oh, who did this?\" she asks, clearly feigning surprise.\n\n\nFinally, Elios walks in, pausing, and looking around the room, taken aback.\n\n\n\"What... what happened?\" he asks, turning even paler than his chalk-white makeup.\n\n\n\"It seems our good friend Calpurnia has been attacked in the dead of night,\" Kyros says. \"Imagine how much pain she's feeling. The pain of her wounds. The pain of her betrayal. Who hear could have possibly betrayed them? Who could have plotted late in the night to back stab a person, to betray someone who had given them so much? Could it have been Elios? Durge? Elizabeth?\"\n\n\n\"Fuck... you,\" Calpurnia says, before collapsing her head against the table.\n\n\nCalpurnia screams as her arm's bare flesh begins to cook, as Kyros glares at her. Durge raises a spike, running it through Calpurnia's head.\n\n\n\"Enough. There's no need to prolong her suffering,\" Durge says, glaring at Kyros.\n\n\n\"I suppose. Perhaps it's best that she died. Do you know what, Durge? Magos Cern, Chapter Master Taj and Rebecca all came to me, told me a coup was being planned by Calpurnia, and she was recruiting all the faction leaders. I'm sure she hadn't gotten around to asking you, Elizabeth and Elios yet, or you would've reported it to me. Correct?\"\n\n\nDurge stares at Kyros, not saying a word.\n\n\n\"Well, I'll have someone investigate who could have possibly done this to our dear friend. Anyone, as for the purpose of this meeting, I just wanted to tell you we're all out of Recaf, and I'll have it replaced by tomorrow. I also suppose I must say I'm taking control of the 33rd Istanford Regiment in the wake of Calpurnia's passing. Now, everyone back to their duties. We're in a risky time. Who knows who'll have the next... accident?\"\n\n\nKyros walks out of the room, and you and Fay follow him. He immediately has you set to work. He has you train with a few of your new men, fighting off dozens of crab-like aliens with a handful of Goliaths, Tribals and Gladiators to learn how they fight. The Tribals still work with their hunting tactics and the methods of war used to fight off the endless greenskin attacks, so you find you're easily able to lead them to victory.\n\n\nThe Goliaths are borderline idiots, who even in the heat of battle get distracted by themselves and each other, get frustrated when their massive hands fail to successfully reload their bolters, and are more than happy to break formation to charge the enemy. Cain proves himself as a solid leader, taking you orders and bellowing them out with massive, powerful lungs, loud enough to snap the Goliaths back to violence. The Goliaths make up for their mental failings with their extreme strength, withstanding punishment beyond what you thought was possible, whilst turning steel to dust with their powerful blows.\n\n\nThe Gladiators' fighting style is an interesting one. Due to the lifestyle of gladiators, they haven't really trained for being part of a large unit, only knowing how to fend for themselves or maybe fight alongside a small unit of a half dozen people. They're good, experienced fighters, but despite their experience they're still young and wild, taking unnecessary risks in battle and acting far too prideful. While Castus is wild and barely acts as a leader in battle other than shouting out curses at the enemies, rallying his men and leading a charge whenever necessary, Olive is calm, collected and acts as the real leader, spitting out battlefield tactics that allow for a crushing defeat. The gladiators also have a certain showmanship, no doubt because they're performers before they're fighters. The gladiators' attacks maximize bloodshed and feature extravagant yet unnecessary feats of agility, something that needs to be eliminated from their battle doctrine.\n\n\nAll in all, your newfound force is fairly competent. You're satisfied with their ability to fight, which is bolstered by your immense powers, the only outlet of which are these arena battles. After several long hours fighting, just as you're too exhausted to continue fight, the massive metal gates from which the aliens spew slam closed.\n\n\nYou hover in the air, firing a stream of multi-colored fire that consumes a crab-alien, before you swoop down, firing a psychic blast directly into the unarmored face of another. Your forces wipe out the remaining beasts, and soon the fighting is over, leaving you surrounded by corpses, blood and bolter shells. The metal gate you came through opens, and you drop to the ground, feeling your collar begin to restrain your psychic powers again, before standing and beginning to walk back inside. \n\n\n\"Well done, men. You've proven yourselves today,\" you say.\n\n\nYour four guards wait by the gate, alongside dozens of other guards to ensure none of you attempt a mistake. The gladiators are led to the underneath of the arena, the Goliaths back to cyro-sleep and the Tribals to their cell-dorms. You're quickly escorted to your room, and the doors close behind you. You walk forward, quickly undressing from your blood-stained, sweat-soaked clothes before collapsing on your bed, burying your head in your pillow.", "action_results": [{"action": "Go to sleep", "result": "\"Karth!\" Meliodas' voice says, appearing in your mind. \"Look behind you, you fool!\"\n\n\nYou quickly twist around in bed, raising your fists and preparing to use what little psychic powers, to see Elios leaning in the doorway of your bathroom. \n\n\n\"Shit! What the fuck are you doing!?\" you shout.\n\n\n\"Hmmm... a man can't just lean back and enjoy one of the finer sights in life?\" Elios says, winking as he strolls confidently towards you.\n\n\n\"Get...!\" you try to speak, but he puts a finger against your lips, leaning in close.\n\n\n\"Quiet, baby. No need to fret. I'm not here to give you any trouble. I'm hear to help you with a certain little... problem.\"\n\n\nElios runs his hand along your bare chest and up to your collar, playfully tugging on it. You stare at him, waiting. \n\n\n\"Well, let's be realistic here. We're going to be slaughtered. If we're lucky, we're going to be killed when Kyros leads his moronic charge against the Imperium. If we're unlucky, we're going to end up like Calpurnia, tortured to death by a paranoid Psyker.\"\n\n\n\"You're at risk of being tortured to death. I never betrayed him,\" you say.\n\n\n\"Oh, baby, why do you have to be so difficult?\" Elios smiles, two of his fingers walking up your legs, slowly nearing your groin. \"Baby, at the moment, Kyros is looking to eliminate those who are going to betray him. But he's growing paranoid. He'll end thinking you're going to betray him, whether you are or are not. Let's be fair, you do have motives. Your tribe destroyed or enslaved, forced to bear the troubles that a Psyker does? Hell, it wouldn't surprise me if you had an escape plan in the works. Hell, even if he doesn't, one of your men will act rebellious or a battle will go wrong, and you'll be blamed for it. You need to get with us, baby.\"\n\n\n\"Let's say I'm considering it. What would it entail?\" you ask.\n\n\n\"You need to get the leaders on your side. Fay, Olive, Castus, whoever's in charge of those big monster boys I saw you working with earlier. Get them on your side, while I will talk to Elizabeth and Durge about maintaining the rebellious attitude amongst Calpurnia's boys, make sure they're still up for a little bit of mutiny.\"\n\n\n\"What happens when we take the ship?\" you ask.\n\n\n\"That'll be decided once we've secured the other leaders. I'm sure they have demands of their own. So are you in?\" \n\n\n\"Hmmm... it's clearly our only option, but you should know that Elios both wants to fuck you over and straight up fuck you,\" Meliodas says.\n\n\n\"I'm pretty sure my other choice is death. That's not even a choice,\" you say.\n\n\n\"Well, it's the one I'm giving you, baby,\" Elios says,gently flicking the tip of your dick, causing you to yelp and scuttle back on your bed. ", "action_results": [{"action": "Agree", "result": "Elios steps forward, knocking on the metal door. The guards open, immediately raising their bolters. Elios waves his hand.\n\n\n\"You didn't see me here. The voice of Slaanesh calls you, and you're his now. Move aside, and tell no one I was here.\"\n\n\n\"I... no... yes, sir,\" one says, stepping aside. \n\n\nYou watch Elios stroll out of the room, giving a final smile and wave as he leaves the room.\n\n\nYou get some sleep, lying wrapped up in your blankets. Blissfully, there's only a few dark, terror-filled dreams, the rest only filling your with a vague, uneasy sense of dread. You awaken to Magos Cern poking you in the stomach with a white-hot pincer.\n\n\n\"AH!\" you scream. \"What the fuck?\"\n\n\n\"My diagnostics told me that I'd be able to wake you up 0.4 seconds faster this way. We need to go,\" Magos Cern says.\n\n\n\"Where?\" \n\n\n\"First, you require food. Then, you'l get some implants. I'm going through some long overdue upgrades for the... \"Goliaths\", as you called them, and Kyros asked me to pencil you in for a few biological upgrades.\"\n\n\n\"Then?\" you ask\n\n\n\"Melee practice. In wake of assassination threats, Kyros wants you to be able to fend off a melee assassination as easily as you could a ranged or psychic attack.\"\n\n\n\"My powers can do that,\" you say.\n\n\n\"You'd be run through before you could react. Castus and Olive will run through some drills to get your reaction time up and give you a few dodging techniques that will lend themselves to all your battles.\"\n\n\n\"Then?\"\n\n\n\"By then, with the recovery time from the implants, your weak body will require sleep.\"\n\n\n\"OK\", you say.\n\n\nMagos Cern leads you out of the room, and along the hallways. You find yourself in a massive cafeteria. You walk forward, spotting Fay sitting alongside a badly burnt girl with a long braid wrapping around herself and another with a prosthetic arm replaced by a sharpened, mechanical claw. Fay looks up, noodles hanging from her mouth, spotting you.\n\n\n\"Oh, Karth!\" she says, waving, before noticing that her mouth is filled with noodles and blushing.\n\n\nYou take a seat next to her, and she smiles.\n\n\n\"So, how are you doing?\" she asks.\n\n\n\"We need to talk. Alone,\" you say, looking at the two tribals beside her.\n\n\n\"Uh... OK,\" Fay says, motioning for the two tribals to move, which they quickly do.\n\n\n\"Thanks,\" you say to the tribals as they walk off.\n\n\n\"So? Is this about what I think it's about?\"\n\n\n\"What do you think it's about?\" you ask, raising an eyebrow.\n\n\n\"Well, you know... you want to speak to me alone... privately... so I kind of assume it's about us.\"\n\n\n\"Yeah, of course it's about us, that's why we're both here to talk about it.\"\n\n\n\"No, I mean... like, us us,\" Fay says, clearly frustrated by your failure to understand.\n\n\n\"What?\"\n\n\n\"Well, like, do you want us to be a couple?\"", "action_results": [{"action": "\"Yeah, I want to go out.\"", "result": "\"Oh, really?\" Fay says smiling.\n\n\n\"Don't you?\"\n\n\n\"Oh, yeah, yeah!\" Fay says, smiling. \"I was actually just going to ask you about that. I'm glad you said yes.\"\n\n\nFay smiles, before leaning in and kissing you briefly on the lips. You stare into her bright green eyes, the split-second kiss lasting for infinitely longer, feeling the warmth of her lips flood into you, before she pulls back.\n\n\n\"Well, that was nice. Ideally our next rendezvous is going to take place somewhere where we're not surrounded by our tribe and horrible guards who want us dead,\" Fay smiles. \"Was that it, or was there something else?\"\n\n\n\"Yeah, we have something important to discuss.\"\n\n\n\"Wasn't that important?\" Fay asks, smiling.\n\n\n\"Oh no,it was, I just... I meant important for the tribe, not just for us,\" you say, stumbling over your words.\n\n\n\"It feels nice to see you've become as awkward as I just was,\" Fay giggles. \"Now, stop spitting out words. Take a breath, and tell me what's so important.\"\n\n\n\"Rebellion.\"\n\n\n\"Oh?\"\n\n\n\"Kyros is mad and paranoid. He's either going to slit our throats or send us on an endless string of suicide missions. We need to do something, and I really need your help. A group of collaborators have planned to rise up, and rid ourselves of Kyros. Then, we take over. I need the support of your Tribals to do so.\n\n\n\"Yeah, totally. Done.\"\n\n\n\"Done?\"\n\n\n\"Yeah. If we don't escape, we die here. Also, they're your Tribals as much as mine. Who else is in on this?\" Fay asks.\n\n\n\"Elios, Durge and Elizabeth are all in. No doubt Calpurnia's man will help us,\" you say.\n\n\n\"What about Cain and the twins?\"\n\n\n\"I haven't asked them yet, but we need to get them on board,\" you say. \n\n\n\"Do we hae a solid plan yet?\" Fay asks.\n\n\n\"Not yet. We need to find out how many people we have fighting for us.\"\n\n\n\"What happens after we take the ship,\" Fay asks, raising an eyebrow.\n\n\n\"That is still to be decided. Once we have Cain. Castus and Olive behind us, we'll have bargaining power. So you're in?\"\n\n\n\"I'm in,\" Fay nods. \"I'll have the message spread among the tribals.\"\n\n\nYou notice one of your guards walking towards you, carrying a tray. You motion for Fay to quiet down, as the guard arrives putting the tray down on the table.\n\n\n\"Eat,\" he says, in a cold voice like the scraping of a blade on rusted metal.\n\n\nYou look at your food. There's a bowl of noodles and strips of thin, cured meat, a small bowl of green jelly with chunks of odd, alien fruit inside, a large plastic cup of wine and a small, dense biscuit-like cake.\n\n\n\"Well, someone's being pampered,\" Fay says, smiling.\n\n\n\"Clearly I'm just more important than you,\" you gloat as you have a forkful of noodles and meat. \n\n\nFay grabs the biscuit cake from your tray, taking a bite.\n\n\n\"Hey!\" you say in annoyance, as Fay sticks her tongue out.\n\n\nYou quickly eat your meal, polishing off the entire tray and gulping down the wine. Then, Magos Cern arrives.\n\n\n\"Good, you've eaten,\" she says. \"These operations will be safer if you've had a full stomach.\"\n\n\n\"OK, I'm ready, let's go, you say. \"Bye, Fay. See you soon.\"\n\n\n\"See you later, Fay says, blowing a kiss.\n\n\nMagos Cern leads you out of the cafeteria and along the halls, off along halls and elevators. Eventually, you pass through the cyro-sleep section, arriving in a large operating room. Dozens of Goliaths are lying on the surgery tables, many halfway through surgery. A half dozen other Tech Priests wander around between the Goliaths, removing and adding flesh, bone, organs, cybernetic implants and other strange things.\n\n\n\"I didn't know there were other Tech Priests,\" you note.\n\n\n\"This ship is the size of a small moon. Did you think you've seen enough of it to accurately be able to say that we don't have something? I have scores of Tech Priests who followed me into the embrace of the Dark Gods,\" Magos Cern says.\n\n\nMagos Cern leads you to an operating table.\n\n\n\"This is yours. Please get undressed and wait here, I need to grab my materials and equipment. Stay here.\"\n\n\nMagos Cern turns around, walking off, leaving you alone. You spot Cain, lying on his operating table, his chest cut open to reveal still functioning organs. You wonder how he can still be alive with such a hastily cut-up torso, before you wince as you see his eyes dart towards you and you realize he's conscious. Looking to see Magos Cern hobbling away, you hop off the operating table and walk over to him.\n\n\n\"Commander Karth,\" Cain grunts. \"Need something?\"\n\n\n\"I have... an offer.\"\n\n\n\"An offer? An offer of what?\" Cain says, absent-mindedly picking at a cut alongside his... or at least, one of his stomachs.\n\n\n\"Freedom,\" you say, catching the monster's attention.\n\n\n\"Go on,\" Cain says, furrowing his scarred brow and causing a thin stream of blood to pour from his horns.\n\n\n\"We're planning an escape. We could use you and your men,\" you say.\n\n\n\"We?\"\n\n\n\"Elios, Durge, Elizabeth, Fay, others,\" you say. \"That's it, I think.\"\n\n\n\"When?\"\n\n\n\"We don't have details, yet. We need a head count before we can start planning it.\"\n\n\n\"Hmmm... I'm willing to give you control of my... \"Goliaths\", as you called them. But, I have a list of conditions that I want to be satisfied once we take the ship.\"\n\n\n\"Go on,\" you say.\n\n\n\"I want us to get names. Every Goliath who is capable of remembering and answering to a name will be called that instead of its serial number, by you and ALL other members of command. No more cyro-sleep. I want a bed for every single Goliath. I don't care if it's fine cloth or a slab of concrete, as long as it doesn't freeze them, it'll do us. I want free time that's not just killing.\"\n\n\n\"Anything else?\" you ask.\n\n\n\"That's it,\" Cain says, spitting out a serrated teeth that's fallen free from his jaw. \n\n\nCain's demands are far from unfair. Really, all he wants is slightly more rights for his Goliaths, which wouldn't even take any more resources. Still, you don't want the beast getting a big head. You ARE still in charge of not only his collar, but the collars of every single Goliath. All you need is a few threats, and the Goliaths will be yours.", "action_results": [{"action": "Agree to Cain's demands", "result": "\"Deal,\" you say.\n\n\n\"Good, good,\" Cain nods, extending a hand.\n\n\nYou grab his hand, and thankfully Cain doesn't attempt to squeeze, which would almost certainly result in your fragile bones shattering. You shake vigorously, and Cain attempts a smile. The corners of his mouth twist unnaturally high, revealing rows of serrated teeth, curved fangs, massive molars and many other weird, odd teeth, protruding from bloody, rotten gums. You smile in response, not willing to offend him.\n\n\n\"The beast would've taken half of what he asked for,\" Meliodas says.\n\n\n\"Why didn't you tell me that before?\" you say angrily.\n\n\n\"I presumed you knew,\" Meliodas replies.\n\n\n\"Are you OK?\" Cain says. \"Tell you what?\"\n\n\n\"Uh, nothing. Sorry,\" you say.\n\n\n\"OK. Good deal,\" Cain says, his face contorted in what you assume is his version of a raising of the eyebrow. \"Alright, best get prepared for your operation before Magos Cern gets back.\"\n\n\n\"Yeah, I should,\" you say.\n\n\nYou walk over to your operating table and quickly get undressed, before lying down. After another minute or two, Magos Cern appears, pushing a tray in front of her. One of her metallic tendrils grabs a syringe filled with a pale, translucent liquid.\n\n\n\"This might hurt a little. It will more likely hurt a lot more,\" she says.\n\n\nYou let out a pained yelp as she jams the syringe into your neck. She begins pushing down on the plunger as what you hope is anesthetic is pumped into you. Warm hands embrace you, pulling you into the oblivion of unconsciousness.", "action_results": [{"action": "Embrace the darkness", "result": "Your eyes lull closed, and you lose consciousness.\n\n\nYou awake an unknown time later, lying on the metal operating table. Magos Cern stands over you, washing her implements in a basin of water. She looks at you, her cold, red eyes peering into your soul.\n\n\n\"Ah, you're awake. Good,\" she says.\n\n\n\"What did you put into me?\" you ask.\n\n\n\"The biology of what I did is beyond you, flesh bag.\"\n\n\n\"Can you dumb it down for me?\" you ask.\n\n\n\"Could one reduce concertos to the mumbled grunts of mutants?\" Magos Cern asks indignantly.\n\n\n\"Please?\"\n\n\n\"Fine. I increased the size of your heart by 40% and lungs  by 12%, and added several veins and arteries leading directly to the brain from the heart. These actions increase the blood flow to your brain, and should hence increase psychic abilities. I added multiple microchips that breed monocytes, other white blood cells, platelets and other helpful things for your body. That was the bulk of my work. Other than that, it was just a medical check-up.\"\n\n\n\"OK,\" you say.\n\n\n\"I have a lot of important work to do, now. You should've had enough time to recover.\"\n\n\nTwo of your massive space marine guards arrive, a roaring face on their thick helmets.\n\n\n\"Here you are,\" Magos Cern says. \"Guards, make sure to walk slow. If at any point the patient starts puking blood, let him sit down for ten, maybe fifteen minutes.\"\n\n\n\"Shouldn't you keep him hearing for observation, then?\" one of the guards ask.\n\n\n\"I have far too much work to do,\" Magos Cern says. \"Don't disturb me. If anything goes wrong, go to Genetor Corivan. He is very experienced with medical matters.\"\n\n\n\"Yes, sir,\" the space marine says.\n\n\nMagos Cern quickly heads off, walking off to a row of elevators. The space marines stare at you, and you climb out of bed with a groan.\n\n\n\"Ah, my head,\" you say.\n\n\n\"You should have headaches for the next 48 hours,\" Magos Cern shouts, right before she disappears into an elevator. \n\n\nYou stand, feeling a rush of blood hit your head. You walk after the space marines, along halls and up and down elevators, until you find yourself in the arena. Castus and Olive are there, mid-battle with each other.\n\n\n\"Oh look, it's tweedle-dum and tweedle-fucking idiot,\" Meliodas says. \"Not even a laugh? Oh wait, you didn't grow up with nursery rhymes, you're from a Feral world. My bad.\"\n\n\nCastus swings his sword at her, while Olive swings her rifle-axe up at his head. He rolls out of the way, kicking Olive's foot away and sending her to her knee, before booting her in the head. She collapses down, before rolling out of the way to avoid a downward stab by Castus. She grabs Castus' sword handle and punches him. Castus falls backwards, before taking up a fighting stance. Olive begins circling him, her gun-axe at the ready. She spots you, smiling.\n\n\n\"Karth's here,\" she says.\n\n\n\"Bullshit,\" Castus says, readying his sword.\n\n\n\"Karth, tell him you're here,\" Olive says.\n\n\n\"Yeah, I'm here,\" you say. \n\n\nCastus turns to look at you, but Olive charges, swinging her gun-axe. She knocks the feet away from Castus, dropping his knee down on Castus stomach. Castus grunts before Olive grabs her gun-axe and holds it to Castus throat.\n\n\n\"Dead,\" she says.\n\n\n\"No fair, we were supposed to stop when Karth got here,\" Castus says.\n\n\n\"You're still dead,\" Olive smiles, standing up.\n\n\nCastus grabs Olive's wrist, pulling her forward so his sword pokes into her stomach.\n\n\n\"Dead,\" he smiles.\n\n\n\"Seriously?\" Olive says, rolling her eyes. \"Fine, I'm dead. Are we finished yet? The kid needs training.\"\n\n\n\"Fine,\" Castus shrugs. \"Let's start it.\"\n\n\nCastus draws a dagger from his belt, staring at it. The blade is a bright silver, with an odd pattern etched into it. It's handle is a bright, light blue, with a short, silver horn coming from the end of the handle.\n\n\n\"Now, this is an absolute beauty. I really don't use it enough, so it's yours. Xenos-origin, so even owning it is heresy. The blade is razor sharp, it could cut through flesh and bone easier than it could through air. Here.\"\n\n\nCastus turns, tossing the dagger straight at your head.", "action_results": [{"action": "Duck", "result": "You duck your head, the knife flying just over your head and cluttering to the floor behind you.\n\n\n\"Good catch,\" Castus says.\n\n\nYou grab the knife, taking a practice stab.\n\n\n\"What do you think?\"\n\n\n\"It's a knife,\" you say simply.\n\n\n\"Yeah, it is. Do you like it? Does it feel good?\" Castus says.\n\n\n\"I don't know anything about knives. Maybe,\" you say.\n\n\n\"Alright, first, we need to talk. Is anyone watching us? Like, are there cameras?\"\n\n\n\"No. Well yes, but they're offline,\" Olive says, resting her head on the butt of her axe-gun. \"What is it?\"\n\n\n\"A plan is being formed. We're going to escape.\"\n\n\n\"Escape?\" Olive says, musing. \"Who's on our side?\"\n\n\n\"We have a large amount of people on our side. Elios, Elizabeth and Durge are bringing the weight of their war-bands, as well as most, if not all, of the Guardsmen here. Then there's the Goliaths and the Tribals, both of whom are with us.\"\n\n\n\"What...?\"\n\n\n\"Because I've done this twice before, I best say. We have no plans yet. They're to be decided. We have literally nothing. We just need to check whether you'll join us. Then, we'll get the leaders together to plan our to take over, and what to do with once we've actually done so.\"\n\n\n\"Huh. Well, I'm in,\" Castus says.\n\n\n\"What?\" Olive asks, surprised.\n\n\n\"Yeah, I'm in,\" Castus says.\n\n\n\"We don't know the plan, we don't have any assurances that we won't be back-stabbed as soon as we take over, we...\"\n\n\n\"Olive, let's be smart here. If we don't rebel, we'll definitely either be killed fighting Kyros' war, killed trying to put down these fuckers' mutiny, or killed fighting another arena battle for these bastard's amusement.\"\n\n\n\"If we rebel, we'll almost certainly be killed!\"\n\n\n\"Almost certainly is way better than definitely. Plus, we'll get to kill a few of Kyros' bastards before we go down.\"\n\n\n\"Fine, I'm in, but I... we have a few demands,\" Olive says.\n\n\n\"Go on,\" you say.\n\n\nYou know the gladiators will be essential to your plans, so you really need to get them, but still, you don't want to devote to many resources to this issue. \n\n\n\"I want instant freedom once we take-over. No more being locked up under the arena. I want my men to have free reign to travel around the ship. I want pay, do the men and women who fight and work for the ship actually get something from it. I want an increase in food rations, and better equipment than the shit we're given. I want actual medical care, on top of this.\"\n\n\n\"That it?\" you ask, annoyed with her large demands.\n\n\nIt'll probably take a serious amount of resources to fulfill her request. You have a few options here.\n\n\n\"What a fucking greedy bitch. This fucker needs a dick, I tell you that,\" Meliodas complains.", "action_results": [{"action": "Agree to her demands", "result": "\"Done,\" you say.\n\n\nOlive extends a hand, which you grip and shake extensively. Castus extends his hand, which you grab, but he twists your arm around, causing you to yelp painfully. He kicks away your foot and sends you to your knee, before bringing his sword up to your throat.\n\n\n\"Dead,\" he says with a smile.\n\n\n\"Well shit, Castus, what's wrong with you?\"\n\n\n\"What? I was just preparing him for fighting. I thought we were supposed to be training him. First lesson, kid: trust no one. Now, get up.\"\n\n\nOlive offers you a hand, smiling.", "action_results": [{"action": "Allow her to help you up", "result": "You grab Olive's hand, and she pulls you to your feet.\n\n\n\"Ah, good job,\" Castus says. \"Second rule: the first rule is bullshit. You know who doesn't trust anyone? Bastards like Kyros who ends up with no loyal friends, no allies, nothing, and then end up alone, with no one. If you want to survive in this world, you need allies.\"\n\n\nCastus grabs his sword by the blade, offering it to you. You reach out to grab it, before he swings it and smacks you in the side of the heat, sending you to the ground. Castus offers his hand to you, which you accept. He pulls you up, before kneeing you in the stomach and tossing you to the ground.\n\n\n\"Come on, you're not learning. First rule: trust no one. Don't you listen?\"\n\n\n\"I was going my the second rule,\" you say, groaning.\n\n\n\"Sometimes, the first rule is more important than the second rule,\" Castus shrugs.\n\n\n\"How the fuck am I supposed to tell the difference between which rule to us?\" you ask, annoyed.\n\n\n\"Beats me. When you find out, you'll be the most powerful warlord in history. Until  then, you just go off gut feeling and intellect.\"\n\n\n\"Seems like a shitty system,\" you say, as Castus finally lets you stand up.\n\n\n\"Seems like a shitty world you're in. That system is the best I have to offer. Now, rule three: in hand to hand combat, go for the weak spots. The throat, eyes and balls are always good, but when it comes to half these fucks, I'd stick to the eyes, because past that, I don't know what you have left. Observe.\"\n\n\nCastus flips his sword so he holds the blade again, wrapping his sleeve around the blade so it doesn't bite into his fingers as much. He steps forward, swinging his sword with insane speed. The pommel slams into your throat before jabbing you in the eyes, leaving you to stumble backwards. You quickly close your legs together before Castus jabs the pommel into your groin, and you collapse backwards with a pained yelp.\n\n\n\"See? Effective,\" Castus smiles. \"Rule four: you can win through many ways. Pain submission, incapacitating them, or simply taking their lives. Judge which can be used to take down your enemies. For instance, in your case, pain is the way forward.\"\n\n\nYou're growing tired of being hit in the face. As Castus steps forward with his sword raised, you decide you're going to do something to dissuade him from continuing to hit you. ", "action_results": [{"action": "Freeze Castus' sword in place", "result": "You use your telekinesis to hold the sword in mid air, Castus grunts in confusion as he finds his weapon stuck in the air as it was concrete.\n\n\n\"I don't need to learn how to wield a sword, Castus. You've trained all your life with a sword. I never have. Yet look how simply I disarm you? I need a sword as much as you need fangs. I've evolved past the need for it,\" you say, before sending the sword clattering to the ground.\n\n\n\"Fair point, kid,\" Castus says, as you have his sword levitate back up to him. \"I suppose you're good to go. End of training.\"\n\n\n\"Terrific,\" you say. \"So, can I leave?\"\n\n\n\"Yeah, I'll call your guards here to open the gates and take you off,\" Castus says, grabbing a walkie-talkie hanging from his belt and speaking into it.\n\n\n\"Yeah, we're finished here,\" he says. \"Oh shit, over.\"\n\n\n\"Affirmative, out,\" the voice comes back. \n\n\nSoon, the gate lifts up as your guards saunter out in their thick power armor. \n\n\n\"Where to next, boys?\" you ask.\n\n\n\"Shut it, psyker,\" one growls, looking at Castus and Olive. \"Is it back to the cells for you two?\"\n\n\n\"We're happy to practice some more here,\" Olive says, twirling her gun-axe to stop a surprise attack from Castus. \"I mean, if this dumb bastard has done so little practice to think that would take me down, he's go to need a lot more practice.\"\n\n\n\"Pffh, I'd like to see you take me down,\" Castus says.\n\n\n\"So be it,\" your captor growls. \"Move it, psyker.\"\n\n\nYou raise your hands defensively, and allow them to escort you back to your room.", "action_results": [{"action": "Three Days Later...", "result": "There's no peep from Elios, Durge or Elizabeth over the next few days. There's more of the usual, training, fighting and such. Eventually though, as you put your head down on the pillow, you hear a familiar voice.\n\n\n\"Karth, talking to you with that collar on is painfully hard. Can you start checking the shadows so I don't have to do this?\" Meliodas says.\n\n\nYou twist around in bed, to spot a familiar figure in the corner, wearing tight, very revealing black leather with heavy make-up.\n\n\n\"Why do we have a habit of meeting like this?\" Elios says.\n\n\n\"Fuck,\" you say, jumping up in bed.\n\n\n\"Is that an order? Because I'm more than willing to... serve,\" he says, licking his lips. \n\n\n\"Why are you here?\"\n\n\n\"We're meeting up. We have plans to make. Shall we go?\" Elios smiles.\n\n\n\"Uh... sure,\" you reply.\n\n\nElios strides over to the door, knocking on it. The guards open, and Elios once again deceives them so they easily step aside.\n\n\n\"How do you do that?\" you ask, as you stroll past your guards.\n\n\n\"Serving Slaanesh has it's benefits. Charisma, beauty, the ability to bend people to your desires, and an ever-lasting... stamina,\" he says, breathing the last word.\n\n\n\"Ah, good to know,\" you say.\n\n\nYou stroll through the hallways, heading down a path you've never headed down before. Eventually, you find yourself in a seemingly abandoned section, entering a large room that's been done up like a war-room.\n\n\n\"This is the old war-room. Kyros had a new one built in a position safer from boarding actions. From here, we run the mutiny.\"\n\n\nYou look around the room, taking note of who's here. Durge sits in a large wooden chair, pricking boils along his belly with his spike-arms. Elizabeth sits in the corner, reading a datapad. A young man, seemingly in his twenties, leans against a wall, smoking and scratching his thick stubble, with a shaved head, scarred face and sallow skin. Cain is scratching the scarred cuts that run along his leathery bare chest. Castus is playing with a knife, while Olive leans against the wall, drinking from a canteen. Fay leans against the wall, noticing you instantly.\n\n\n\"Hey, Karth,\" she smiles, walking up to you. \"How'd Elios get you out of your cell?\"\n\n\n\"Did some deceiving trick on the guards. You?\"\n\n\n\"Elizabeth put the guard's to sleep somehow,\" Fay replies.\n\n\n\"Alright, boys. We're all here. Shall we begin?\"\n\n\n\"Yes, let's go through this,\" Durge says.\n\n\nDurge stands, scratching the side of his stomach as you see something furry scuttling through his intestines. You try not to get sick, or to simply set the entire monstrosity known as Durge aflame to cauterize his disgusting form, before reassuring yourself that he's on your side.\n\n\n\"Sssh, sssh,\" Durge says, patting the side of his stomach, before grabbing a remote from the large metal table and turning on a large blue hologram of the ship, the Roar of the Vortex. \"Here she is. We need to start planning how to grasp control of the ship. Remember, this isn't a planet. We don't win by capturing more territory than the enemy has. We need to capture the necessary areas.\"\n\n\nThe hologram begins to change, as various sections become different colors.\n\n\n\"These black sections are abandoned by crew. They're either unnecessary cargo space, unused dorms or functional sections whose functions are either redundant, have been taken over by other sections or are being fulfilled by whoever remains in these sections.\"\n\n\n\"I thought they were abandoned,\" Fay says.\n\n\n\"Abandoned by the crew, not abandoned by all. You must remember just how large this vessel is. Certain sections were crewed by slaves or mutants who, from lack of contact with crew members, have regressed to a feral state. Many of them now fulfill their roles, such as cleaning pipes or pumping air or working generators, because they consider it a religious ritual, necessary for their food, water and waste pipes to continue or just do it without knowing why.\"\n\n\n\"Ah. How... terrifying to know that that's a reality,\" Fay says.\n\n\n\"Their sacrifice is necessary,\" Durge shrugs. \"Now, I shall continue. These brown sections are entirely ran by mutants. These mutants hold no loyalty to either side, and fulfill non-essential roles, or at least roles that aren't essential short-term. For the term's of this... mutiny, these spaces are as irrelevant as the abandoned areas. Now, we get onto the important things. These green sections are, or at least will definitely, be controlled by us. The Black Rat's floors, the Shrieking Harpies' floors, the One Eyed Crows' floors, the arena and arena catacombs, the cyro-sleep area, the medical bay, the Tribals' dormitories, and the 22nd Regiment's dormitories. The 22nd Regiment is, for the most part, under our command, although their are loyalists to Kyros, so it will take some time for them to sort out that issue in the mutiny. These red sections are the enemy's. Kyros' chambers, the Bloody Claw's floors, the Techpriests' sections, the floors used by the Undying Reapers, and the floors controlled by those who will almost certainly be loyal to Kyros, whether they be from assimilated war-bands or his original allies he had when first capturing this vessel.\"\n\n\nSuddenly, the hologram shifts again, as the sections become either black, grey, blue, green or gold.\n\n\n\"These sections in black are irrelevant. Ignore them. These areas in grey are of little importance, but these are still a benefit to hold. The blue sections should be captured. The green sections are of more importance than the green sections, and should be prioritized. These gold sections, the command bridge, the engines and the macro-cannon decks, are completely necessary. We need these for victory. Now, Elizabeth shall go into details on the objectives, and Elios shall divide our forces.\"\n\n\nElizabeth stands up, walking towards the hologram, as Durge collapses into his seat. \n\n\n\"Thank you, brother. Now, we have four main objectives. The first is to kill Kyros. If we're lucky, that should get much of his forces to surrender. Hopefully, Rebecca will as well,\" Elizabeth says.\n\n\n\"She won't surrender,\" Elios says.\n\n\n\"She might,\" Durge says hopefully.\n\n\n\"I've know her the longest. She never gave up. When dad gave her the choice of apologizing for breaking the barn's windows in exchange for half as many lashes, she spat in his eye. As long as she has a limb left, she'll fight us. And I'm counting her head as a limb,\" Elios says.\n\n\n\"Well... we can hope,\" Elizabeth says. \"The second objective is to capture the golden sections. The third and fourth objectives are to capture as many servitors as possible and Drake Amadeus, respectively.\"\n\n\n\"Who the fuck is Drake Amadeus, and what's a servitor?\" Castus asks loudly.\n\n\n\"A servitor is a partly biological machine, made from machinery and the body of a criminal, slave or cloned body. They're not sentient, but are controlled by the Techpriests and used as their workforce. They do the bulk work of maintaining the ship. Capturing as many of them should make the transfer of power... easier. Drake Amadeus is an extremely powerful Navigator, a species of mutant who have a psychic third eye that allows it to see through the Warp and allow us to navigate through the Warp. Drake is one of the few Navigators powerful enough to allow a ship this large to navigate safely. If we don't secure him, we lose all abilities to go at the speed of light. In other words, we drift through space until we all starve to death. So, Drake is an important objective. Those are our four main objectives. If we fail in any of those, we fail in everything. There are dozens of other objectives, such as securing medical supplies, finding food, what have you. Those can be handed out to the individual groups. Elios?\"\n\n\nElios stands up, strolling over to the hologram as Elizabeth sits down.\n\n\n\"Now, we have a sizeable force. The Shrieking Harpies, the Black Rats, the One-Eyed Crows, the 22nd Regiment, the Tribals, the Goliaths and the Gladiators. We even have a... special asset,\" he says, looking at you. \"Whilst each of these factions on their own are fairly effective, combined they're infinitely stronger. Here are lists of what forces you'll command, and which of the forces you were to command will be transferred to another leader.\"\n\n\nVarious rolls of parchment and datapads, a strange mix of tech levels, is passed out. You raise an eyebrow as you realize you've not been given anything.\n\n\n\"Why didn't I get something?\" you ask.\n\n\nElios smiles as you.\n\n\n\"Putting you with a large force would be a waste of resources. Putting you with a small force would leave you wiping out too many enemies, unable to hold the ground you've already taken. So, we're going to use your as a specialty item. We're sending you to capture the prisoners. Release the ones you deem trustworthy, and secure them. Most importantly, secure Drake Amadeus. Understood?\"\n\n\n\"Yeah, got it,\" you say. \n\n\n\"Once you have, we'll regroup forces, and make a move to finish off Kyros and his lieutenants.\"\n\n\n\"Got it,\" you say. \n\n\n\"When?\" Cain asks in his monstrous voice.\n\n\n\"Soon. Within the next few days. We need time to spread the orders, make preparations and Elizabeth needs time to find a way to deactivate the various collars and explosives planted on the slaves. Be ready at all moments,\" Durge says.\n\n\n\"How do we know when to strike?\" Olive asks.\n\n\n\"We're going to have explosives planted to take out as many loyalists as possible. When you hear massive explosives, or if you're too far away when the alarms start, your collars should deactivate given that I succeed, which I will, and then strike and go immediately to your objective. Understood?\" Elizabeth says.\n\n\n\"Got it,\" Olive nods.\n\n\nElios begins passing out files.\n\n\n\"Look over these, then leave them to be burnt,\" Elios says.\n\n\nYou're passed a file, and eagerly grab it.", "action_results": [{"action": "Look at the files", "result": "You look at the files and see three subheadings: Drake Amadeus, the Penthouse, Charles Antonguella and the Troupe of Dancing Blades. The files seem to be a mixture of printed out and hand-written, leading you to assume they're from different sources.", "action_results": [{"action": "Read File: Drake Amadeus", "result": "Name: Drake Amadeus\n\n\nSpecies: Human, Sub-species Navigator\n\n\nAge: 27\n\n\nMarital Status: Unmarried\n\n\nChildren: None\n\n\nHouse of Origin: House Jenassis\n\n\nCurrent Location: The Penthouse, Roar of the Vortex\n\n\nBlood Type: A Positive\n\n\nAdditional Mutations: None\n\n\nMental Illnesses: Sociopath, Sadist, Narcissist, \n\n\nAlliances: None\n\n\nDependents: None\n\n\nUseful Intel: -Drake has so far proven to have no loyalty, betraying all of his previous employers. Do not trust him.\n\n\n-Drake has refused to pledge to any of the Dark Gods, or even to Chaos Undivided\n\n\n-Drake has proven to have many hedonistic tendencies, such as whore-mongering, heavy drug use and similar activities.\n\n\n-Drake is reasonable sufficient with firearms and melee weapons. It is necessary to keep him away from all weapons.", "action_results": [null]}, {"action": "Read File: The Penthouse", "result": "The Penthouse is a large house situated on the Roar of the Vortex. It is made up of multiple rooms, including a kitchen, a massive bedroom, a bath house, a large lounge, room for dozens of slaves to live and much more. It is the home of Drake Amadeus. It is occupied by not only Amadeus, but also bodyguards Charles Antonguella and the Troupe of Dancing Blades, as well as dozens of slaves and prostitutes under the service of Amadeus. The penthouse holds luxuries and treasures of great value, both monetarily and intellectually. All operations carried out here should take care around such items.", "action_results": [null]}, {"action": "Read File: Charles Antonguella", "result": "Charles Antonguella was a miner on Kerunga-IV, until he was kidnapped by Dark Eldar. He was forced to fight as a gladiator for the Dark Eldar, but found himself to have bested several Wyches. He became an esteemed fighter for the Dark Eldar, who reveled in his beauty and his abilities at killing enemies with his bare hands. Eventually, he escaped and fled off-world, where he became a mercenary. He eventually began working for Kyros as a bodyguard for the infamous Navigator Drake Amadeus.", "action_results": [null]}, {"action": "Read File: The Troupe of the Dancing Blades", "result": "The Troupe of Dancing Blades is a Chaos group under service of the Chaos Lord Kazirai the Beast-Fucker, known for both his highly amusing name and his large amounts of sexy aesthetically pleasing warriors who served as his mistresses. They fight with acrobatics and long blades. They have extensive use of stealth technology as well as hallucegenics. They are currently in service to Kyros, acting as bodyguards to Drake Amaedus.", "action_results": [null]}, {"action": "Finish reading the files", "result": "You hold the file out, offering it back to Elios.\n\n\n\"Burn it, honey,\" Elios says.\n\n\nYou shrug, as the file sets alight in your fingertips, turning to ash. Fay notices you're finished, and hands her file to you.\n\n\n\"Are you offering this to me to read?\" you ask, confused.\n\n\n\"No, Karth, but there's no candles around. It's times like this where it's good to have a friend who can act as a lighter.\"\n\n\nYou quickly set the file alight, and it turns to ash once again.\n\n\n\"Thank you,\" Fay says. \"How's your mission looking?\"\n\n\n\"Easy enough. If I can get this collar off, I'll be fine. If not, I'm fucked,\" you say.\n\n\n\"I'm sure Elizabeth can get the collar off. She seems smart,\" Fay says.\n\n\n\"I am,\" Elizabeth says, not looking up from her files.\n\n\n\"Are we finished here?\" you ask.\n\n\n\"Sure thing, darling,\" Elios says, standing. \"Shall I escort you back to your room?\" \n\n\n\"Sure thing,\" you say, as Fay nods eagerly.\n\n\nYou stand, following Elios along the hallways. After a few minutes, you reach the tribals' dormitories, where two Chaos Marines stand at either side of the door.\n\n\n\"Hey, you're not supposed to be out of your cell!\" one says, raising his bolter.\n\n\nElios snaps his fingers, and the two guards pause.\n\n\n\"You saw nothing,\" Elios says.\n\n\n\"Yes... yes, sir,\" the space marine replies, as Elios opens the door.\n\n\n\"Goodnight, Fay,\" Elizabeth says.\n\n\n\"Goodnight, Karth,\" she says, before disappearing into the dorms.\n\n\nYou quickly head towards your room, reaching there after a few minutes. Elios pulls the same trick with your guards, as they fall under Elios' commands. He opens the door, motioning for you to enter.\n\n\n\"Goodnight, Karth. I have a lot to organize, so I won't be able to offer you the chance for me to stay the night. Sleep tight, darling,\" he says, as the door closes.\"\n\n\nYou shake your head, walking over to the bed, collapsing onto it. Soon, you drift off to sleep.", "action_results": [{"action": "Two Days Later...", "result": "You walk down the hallways alongside your four Chaos Marine guards. You head towards the war room, where Kyros is planning the first strike against the Imperium, taking over a Hive World, to secure a huge population that can be recruited from to bolster Kyros' forces ten times. You hum a tune, some old Uwais war chant that you find quite catchy. You feel a wave of nausea hit you, and you pause, as you feel a heavy weight lifted off your soul, and your cloudy mind is cleared. Your collar clicks, and falls off you, hitting the ground. Your guards stop, noticing you've stopped.\n\n\n\"Prisoner, why have you s...?\" one of the guards asks, before noticing your collar has fallen off.\n\n\n\"Wait...\" he starts to say, as the alarm begins to blare.\n\n\n\"Hahaha! Freedom! Freedom!\" Meliodas cries.\n\n\nThen, you strike. The first guard's head snaps around, tearing his head clean off his shoulders. You quickly set the second alight, shielding yourself from the bright blue flames that begin melting through the thick armor as the guard roars. You teleport behind the last two as bolter fire slams into the hallway where you once were. You blow a hole in the chest of one with a blast of psychic energy, before levitating the last one into the air, tossing his bolter across the room.\n\n\n\"No, no, no!\" the space marine roars, shaking and trying to grasp at you.\n\n\n\"Kill! Maim! Burn! Break! Smash! Crush! Slaughter!\" Meliodas gleefully chants.\n\n\nYou smash the space marine into the ground repeatedly, shattering armor and leaving him as a bloody smear on the ground. You attempt to orientate yourself, trying to picture the path you took from your room to get here, and remembering where the Penthouse is.\n\n\n\"Brother! Is Prisoner Alpha secure?\" a radio crackles.\n\n\nYou turn, noticing the radio attached to the first space marine's belt. You pick it up, as the psychic energy around you vibrates as you talk, changing your voice into that of the space marine.\n\n\n\"Imitate his comrade's voice. Use the Warp,\" Meliodas suggests.\n\n\n\"We were forced to kill him. What's the situation?\"\n\n\n\"Good riddance. Our brothers have betrayed us. The One Eyed Crows, the Black Rats, the Shrieking Harpies, all traitors! The 22nd are fighting, but I don't know whether the majority is with Kyros.\"\n\n\n\"What's the plans?\"\n\n\n\"Kyros has us divided between exterminating the traitors and trying to put down the slave revolts that are taking place. The first and second generation super-soldiers are rebelling. Take your unit, and secure the gladiators. If they have the arena secured, they will have a strong defensive position.\"\n\n\n\"Understood. We'll get it done,\" you say.\n\n\n\"Send them to their reapers, brother, and ward off your own one,\" the radio crackles.\n\n\n\"Glory to Kyros,\" you say. \"Praise the Dark Gods!\"\n\n\n\"Nice touch,\" Meliodas says.\n\n\nThe radio finishes, and you clip it to your belt. You float into the air, hovering along the hallways towards the Penthouse. You pass a trio of shotgun-wielding Bloody Claws, rushing towards the cyro-chambers. You fire a jet of flames, engulfing the trio but don't even slow down to watch them die. Soon, you find yourself in the elevator, rising towards the penthouse. You wait patiently, listening to reports come through the radio.\n\n\n\"The entire area's filled with them! They're all traitors. I...\"\n\n\n\"Bridge secured, push forward.\"\n\n\n\"Fall back, fall back, they're not going down!\"\n\n\n\"Rage! Kill! Maim! Smash! Blood for the Blood God! Skulls for the Skull Throne!\"\n\n\n\"Leading the charge! Secure Elizabeth Staine, and they'll all... shit! AARGH!\"\n\n\n\"Damn it! I've been sealed in! Get me out, dammit! They're coming for us!\"\n\n\nThe elevator doors open, leaving you faced with five heavy bolters aiming at you.\n\n\n\"It's the Psyker!\" someone shouts.\n\n\n\"Time to die, mortals!\" Meliodas roars.", "action_results": [{"action": "Quickly fire some firebolts", "result": "You spew fireballs from each hand, immediately engulfing two of the bolters, and their operators, in flames as they let out terrified screams. Unfortunately, the other three fire. Bullets slam into your boy, one quickly finding your head and blowing it apart.", "action_results": []}, {"action": "Create a psychic shield", "result": "You immediately raise your shields, as bolter fire thuds into them. You feel them, like a tapping on your mind. Unfortunately, by the sheer amount of bolter fire being shot at you, one finds it's way in. It slams into you, blowing your chest open. You collapse to your knees, as your shields fail as you lose focus. Bullets riddle your body, killing you instantly.", "action_results": []}, {"action": "Teleport behind the heavy bolters", "result": "You disappear from their sight, appearing behind them. You let out a jet of flames, engulfing two heavy bolters and killing their operators. You twist around, shooting a blast of psychic energy at another, before spitting lightning to kill the last two operators. It's only a minute before you arrive at a massive, thick metal door with an intercom.", "action_results": [{"action": "Use the intercom", "result": "You press down on the button, and a voice crackles through.\n\n\n\"Password?\" the deep voice asks.", "action_results": [{"action": "Attempt to physically probe the man's mind for the password", "result": "You feel his mind, and gently test it for it's thoughts.\n\n\n\"Should I have stayed loyal to Kyros? Fuck, I could sti... No, no.\"\n\n\n\"I wonder if Mimtu needs more food. I should buy more food.\"\n\n\n\"Is this dipshit going to say Railroad or am I going to have to kill him?\"\n\n\n\"It's Railroad,\" you say.\n\n\nThe door clicks open.\n\n\n\"Alright, get inside. Quickly,\" he says.", "action_results": [{"action": "Step inside", "result": "\"I can smell him. He's here,\" Meliodas says.\n\n\nYou step inside the doorway, looking into a marvelous palace. There's a huge grand staircase, with above it a massive chandelier of candles, the only illumination for the room. Beside it is an obsidian, bejeweled statue of a dragon, emitting a long burst of flames made from a bright red and orange gemstone, sits beside a marble table laden with roast meats, delicate pastries and fancy wines. You spot Amadeus, lying on a large silk couch, wearing an opened red silk hooded robe. On his forehead is a third, closed eye, while his normal eyes are focused on the girl in front of him, on her knees performing fellatio. You momentarily blush, before remembering that you're an insanely powerful psyker and not a fucking child.\n\n\n\"Drake Amadeus, you're coming with me,\" you say, as Drake lets out a yelp, kicking the girl off him and stumbling back.\n\n\n\"Shit, it's Karst! It's Karst! Get him the fuck away from me!\"\n\n\nYou step forward, before seeing a dozen girls emerge from the rooms upstairs, walking towards the grand staircase. They move with insane flexibility. Some behind back and walking with their heads peering out between their legs, before twisting their heads around a hundred and eight degrees. Some on all fours, their legs stretched back around their shoulders to allow them to walk forward at an odd angle. They move with delicate grace, before they each draw a pair of curved knifes, continuing to walk towards you. You see Drake Amadeus scuttle away from the corner of your eye, but it seems you have a bigger threat.\n\n\n\"Ah, Slaaneeshi whores. Make their deaths quick. They'd just enjoy you drawing it out,\" Meliodas says.", "action_results": [{"action": "Fire a jet of flames to hold the Troupe back", "result": "You fire a jet of flames, and the Dancing Blades quickly retreat out of the range of your fire. They dance along the edge, waiting to strike.", "action_results": [{"action": "Head up the stairwell, spewing fire", "result": "You march up the stairwell, spewing fire at the Troupe. Unfortunately, as you move up the stairs, this puts you far enough that can't hit them, but close enough that they're within leaping distance now that you're somewhat below them. The Troupe strikes, leaping off the bannisters to attack. Immediately, three of them are upon you. You fly out of the way of one and set the second alight, before the third leaps at you. You back out of their way, avoiding a sword blow, before you're stabbed through the back, and you collapse to your knees, before a blow takes your head off.", "action_results": []}, {"action": "Fire psychic bolts from distance", "result": "You fire the bolts, as they fly towards the enemy. The Troupe moves constantly dodge the blasts, missing most of them, but a few land. You keep the Troupe at a distance with your fire and zero in on the kills with your psychic energy.  After you kill a few you realize their tactic, and they attempt a charge, although with a burst of energy and the powers of the Warp flowing through you, you manage to wipe out the Troupe with considerable ease.", "action_results": [{"action": "Find Amadeus", "result": "You turn from the scene of your killing, and head towards the rooms where Amadeus scuttled off to. A faint light shines through the door, which you kick in, easily finding the Navigator as he lies in an empty bathtub, holding a dagger to the knife of a half-dressed prostitute who still looks to be in her early teens.\n\n\n\"Stop! Don't move a muscle! You get any closer to me, I slit this bitch's throat!\" Drake shouts, snarling at you.\n\n\n\"Does he think that'll work? Fool,\" Meliodas laughs.", "action_results": [{"action": "Kill the prostitute", "result": "With a narrowing of your eyes, the prostitute's neck is snapped. Drake releases her body, staring at you. \n\n\n\"You're... well, you're a threat,\" Drake says, dropping the knife and standing.\n\n\n\"You're coming with me,\" you say.\n\n\n\"Sure, sure,\" Drake says. \n\n\nYou bind Drake's hands together with invisible chains, and force him to march forward. Drake immediately becomes compliant.\n\n\n\"Can I grab a few things?\" Drake asks. \"My... dreams get pretty bad. I have terrifying nightmares. I have medication that helps. Please, please can I get them?\" Drake asks.", "action_results": [{"action": "Allow Drake to retrieve his medication", "result": "\"Go,\" you say, as Drake nods his head thankfully, running over to the counter and beginning to gather various pills and jars of balm from the tables, searching through drawers. Suddenly, you hear a hissing sound behind you.", "action_results": [{"action": "Quickly turn to investigate the noise", "result": "You swivel around, spotting a metal box begin to rumble, emitting air that smells of trees. Then, you hear a booming noise and your head explodes, painting the room red. ", "action_results": []}, {"action": "Keep watching Drake", "result": "You watch as Drake continues searching for pills and balms, before drawing a shotgun and aiming for your head. You flick your wrists, sending the shotgun across the room. You bind Drake's hand, lifting him up and flying him towards you.\n\n\n\"Please, I'm sorry, but I can't be captured. They'll kill them!\" Drake asks pitifully.\n\n\n\"Them?\" you ask.\n\n\n\"Yes. Kyros has my two children taken prisoner aboard this ship, my two baby girls. If I don't report to him every hour, he'll hurt them!\"\n\n\n\"I've read your report. You don't have children.\"\n\n\nDrake's look of terror and desperation slowly morphs into a grin.\n\n\n\"Alright, you got me. Shall we go?\"\n\n\nYou snarl, smacking Drake into the ground. He lets out a pained yell, before you raise him up again.\n\n\n\"Give me one reason not to kill you,\" you say.\n\n\n\"Fuck you. Just go ahead and kill me,\" Drake laughs, spitting blood out of his mouth and giving a grin, his teeth bloodied.\n\n\n\"Is that your final answer?\" you ask.\n\n\n\"You need me alive to pilot this ship, dipshit,\" Drake says.\n\n\n\"Perhaps. But I could easily peel off your skin, turn your bones to dust, char your flesh and twist your limbs off.\"\n\n\n\"You need to happy, Karth,\" Drake grins. \"My jobs to navigate the ship, make sure we're not lost in the Warp, boarded by daemons or make sure we don't come out of the Warp and straight into the sun. If my life's not worth living, such as if someone peeled off my skin, turned my bones to dust, charred my flesh and twisted my limbs off, I'd just make sure this ship goes straight into a star.\"\n\n\n\"Just break him. The powers of the Warp will send you where you need to go. You don't need a Navigator. Tear this rat apart!\" Meliodas says.\n\n\nYou growl, walking out into the hallway, Drake floating after you. You quickly reach an elevator, tossing Drake inside.", "action_results": [{"action": "Head to the war room", "result": "The elevator doors open, revealing another of the endless hallways that pack the ship. A half dozen bodies, naked and covered in blood, with swords clutched in their hands, lie on the ground, next to two badly diseased, rotting soldiers with hellguns lie on the ground.\n\n\n\"Huh, Bloody Claws vs Black Rats. Which ones are with you?\" Amadeus asks.\n\n\n\"Shut it,\" you say.\n\n\n\"Because I've heard rumors that Kyros wanted a march on Terra. That would gain up the Bloody Claws' favor, but I doubt those rumors are true.\"\n\n\n\"They are,\" you say.\n\n\n\"Don't tell him anything! I can practically taste his sliminess! He'll use any information he has against you,\" Meliodas chides.\n\n\n\"Huh. If you had told me that earlier, I wouldn't have tried to murder you,\" Drake said. \"I know an attack on Terra's as stupid as everyone else does.\"\n\n\n\"Shut it,\" you say.\n\n\n\"OK, OK, got it,\" Drake says.\n\n\nYou step over the corpses, and begin heading toward the war room. You spot a pair of Bloody Claws in long leather jackets, blood covering their faces, acting as a war-paint, arching with lasguns. You clench your hand into a fist, crushing their two heads together. You continue walking. Soon, you reach the door to the war room. You knock sharply on the door.\n\n\n\"Yo, who's there?\" a voice you don't recognize answers back.\n\n\n\"Karst,\" you reply.\n\n\nThe door swings open, revealing the scarred, shaved soldier from a few days ago.\n\n\n\"Shit, Karst. You got Amadeus. Good job, get inside,\" he says, pulling you inside. \n\n\nYou enter the war-room, to see various leaders working. Olive and Elizabeth are going over a map of the ship, Durge talks to a trio of badly diseased, rotting soldiers who shouldn't, to all you know of biology, be alive. Elios smokes a lho-stick in the corner, while reading a datapad. Elios notices you immediately, smiling.\n\n\n\"Drake Amadeus! Look who we've captured,\" he grins, walking over to you.\n\n\n\"Elios. You're...\"\n\n\nElios punches Drake in the side of the head, knocking him to the ground, grabbing him by the hair and yanking him up. \n\n\n\"I'll have him escorted to the cells, honey,\" Elios says to you, before turning and dragging Drake off. \"By the way, Johhny boy was looking for you.\"\n\n\n\"Who?\"\n\n\n\"Me,\" the shaved, scarred man says, extending his hand. \"Captain Jon Hates, 22nd Istanford Regiment.\"\n\n\n\"What do you need?\" you ask, shaking his hand.\n\n\n\"We're moving out to capture a nearby armory to better equip our men. I could use a Psyker to edge the battle my way. You in?\"\n\n\n\"Sure,\" you reply.\n\n\n\"Do you need to re-equip or anything?\"\n\n\n\"No, I'm good.\"\n\n\n\"Let's bounce, then,\" Captain Hayes says, grabbing a lasgun from a nearby table and pushing open the door.\n\n\nYou move together along the hallways. The area around the old war room is sparse, having already been secured by the mutineers. \n\n\n\"So, did you join the regiment before or after they turned traitor?\" you ask.\n\n\n\"I was there since the very first battle. I remember deployment. Here I was, fifteen, a lasgun clutched in my hand. The planet we were landing on was nothing but fucking jungles and rivers. We were supposed to wipe out the fucking rebels in the jungle, but they were fucking everywhere. But rebels, they're not shit. We could've taken out the rebels. Command didn't tell us there were Orks there. It turns out, we landed a few weeks after WAAAGH! Dazik hit. So we were caught in a three-way clusterfuck between Orks and guerrillas. That wasn't even the jungle. I swear to God, the Jungle was fucking sentient, and all it felt was hate. The beasts attacked us in our sleep, The bugs made us sick, it never stopped raining, the mud jammed weapons and the fucking enemy would not surrender. I was made Sergeant in two weeks. Two fuckin' weeks. I was fifteen, leading soldiers to war. We just kept fighting. Reinforcements didn't fucking come, aid didn't come, the wounded were left to die with us. The Imperium didn't give a flying fuck about us. The Emperor didn't. Everyone said it. The rebels were apparently supporting their war machine through smuggling and manufacturing drugs. Apparently, they used a lot of the plants on the world to manufacture combat drugs and narcotics and shit. Me and a few guys wiped out some smugglers, leaving us cold, tired and with a shit ton of drugs. We started targeting smugglers after that, the entire regiment. The men got a bit of pleasure in their lives, we used the combat drugs to increase our effectiveness, and fuck it, the smugglers were supporting the enemy! What was the issue?!\" \n\n\n\"Is he capable of shutting up?\" Meliodas complains.\n\n\nCaptain Hayes takes a long drag from his lho-stick as he steps over a mutated space marine's corpse, stepping on it's huge, elongated tongue with a squelch.\n\n\n\"So there we were, fighting on this world. One day, Commissar Denton talks a bullet to the throat. The dude was a nice fucker, solid, never did nothing wrong. He was happy to let us be, as long as we gave him a bit of puff and secured him a few complimentary visits with the local whores. The dude's killed, and we're sent a new Commissar. The first day we had him, we lost fifty men. Twenty from a suicidal charge he made us take on an enemy machine gun position we would've just wiped out with artillery if we had been smart. The other thirty? Kids. Kids, around the age I had joined. This had been seven years since we deployed, seven years of constant warfare. By now, I was Captain. Captain Jon Hayes. Sure, the kids fresh off the dropships were scared. We let them hide during the battles, 'til they were ready to fight. That fuckin' Commissar called them cowards and executed them all. We returned from the charge to find he had murdered our brothers. So, we iced him. Shot the fucker apart. Three weeks later, an Inquisitor showed up. Have you ever seen an Inquisitor?\" \n\n\n\"No,\" you admit. \n\n\n\"Just strangle him to death. Just do it. Shut him up. I've always been the most pragmatic one here, but it's just best if you trust him,\" Meliodas says.\n\n\n\"They're fucking scary. He showed up, and said that we were under investigation for heresy. The drug use, fucking native prostitutes, anti-Imperial beliefs, and killing a Commissar. He told us to surrender, so he could route out which of us were innocent, and which weren't.\" \n\n\n\"What did you do?\" you ask. \n\n\n\"No! Don't ask questions! He'll just keep talking, you fool!\" Meliodas cries.\n\n\n\"We killed him. We killed all the loyalists there, stole our drop-ships and headed to the skies. We stole a frigate, and got the fuck out of their. Soon, we got picked up by Kyros. We made a deal. People think Kyros' forces were all Chaos worshippers. Bullshit. Many of us were mercs, anti-Imperial rebels who just found ourselves with similar interests. A few of us were corrupted, but most didn't.\"\n\n\nYou arrive at a hastily set up barricade set up by Guardsmen. Two heavy bolters sit on the top of a dozen sandbags, with a dozen guardsmen crouched behind it, including a massive Ogryn, a mutant, gigantic, muscled subspecies of man, who holds a massive automatic shotgun.\n\n\n\"What are we doing napping, boys? It's early,\" Captain Hayes says, ducking under a bullet.\n\n\n\"We're pinned down. There's like a dozen Space Marines down the hallway in the ammo depot,\" one of the soldiers says. \"We've kept them from mounting a charge with the bolters and Frag grenades, but we need to resupply. We need more men.\"\n\n\n\"Do you see who this son of a bitch is?\" the Captain says, motioning at you. \"That's Karst, the psyker. He'll tear the enemy a new asshole in their soul so big we'll be driving a Baneblade up it. Understood?\"\n\n\n\"Sir, yes, sir,\" the men reply.\n\n\n\"Well Karst, care to give us a display of what you do?\" Captain Hayes says, motioning towards the Space Marines cloistered down the hall.\n\n\nYou march forward, psychic shields forming around you to bounce off their bolter fire. A marine wielding a flamer appears in the hallway, snarling in anger as he lets out a burst of flames. You narrow your eyes, flooding the man's mind with images endless bugs flying through the air and devouring his flesh. The marine screams, spraying fire all around him in an attempt to kill the monsters that only exist in his mind. You make a fist, crushing the flamer's fuel tank. The tank explodes, incinerating both it's operator and the men closest to him. You raise both your hands, fire and electricity running through your body as you let out a roar, filling your enemies mind with fear and dread. ", "action_results": [{"action": "Three Weeks Later...", "result": "The mutiny's early success slows, and the quick takeover that had been planned turns to a painfully slow crawl forward. Two thirds of the ship falls under command of the mutiny, although the bridge and several other key features are heavily fortified by Kyros forces, who stubbornly hold onto the ship despite the odds falling ot of their favor. They seem to be attempting to force a stalemate, by keeping the fight going until the failure to be able to restock the ship's supplies leads to mass starvation among the slaves and mutants vital to operating the ship, massive power loss from lack of fuel and an inability to make repairs to the ship.\n\n\nThe Bloody Claws are almost wiped out to the last man, their forces taking huge casualties in suicidal charges again the Black Rats, One Eyed Crows and Shrieking Harpies as Rebecca Staine attempts to wipe out her siblings for their betrayal of both her and Kyros. Although they are defeated and fail to take the heads of any Staine siblings, their fury and rage amplified a thousand times over by thee betrayal, fills them with the might of Khorne, and they reap a terrible harvest of skulls and blood, crushing the might of the Black Rats, One Eyed Crows and Shrieking Harpies. Rebecca Staine herself was killed in the fighting, her body retrieved from atop a pile of corpses, all of whom she had slain.The diseased, the mutated and the beautiful bodies of these war bands fill the hallways alongside the blood-stained Khornate warriors. Alongside the regular burden of facing he rest of Kyros' forces, the three rebelling Staine siblings have had their forces greatly diminished. \n\n\nWhile the Staine siblings' losses is a military failing for the mutiny, on a personal level it's a clear benefit. Their loss has put your Tribals, Goliaths and Gladiators as the most powerful force of the mutiny closely followed by the 22nd, so you'll have a lot more bargaining power among the mutiny leaders after the ship is taken. \n\n\nYou sit in the war room, Cain, Olive and Castus in front of you and Fay by your side.\n\n\n\"The Assault marines were stuck in the hallway when we fell upon them. It was a tremendous victory.\" Olive says. \n\n\n\"We kicked ass,\" Castus says, grinning.\n\n\n\"Terrific,\" you say. \"Anything else to report?\" \n\n\n\"Nothing of interest. We've been having some issues regulating drug use among the gladiators, especially combat drugs, but that's an issue for after we capture the ship,\" Olive says.\n\n\n\"Alright. Cain?\"\n\n\nCain steps forward as Olive and Castus leave.\n\n\n\"Yes?\"\n\n\n\"How did your assault go?\"\n\n\n\"It went well. We secured another hanger,\" Cain grunts.\n\n\n\"Do we have the ships?\" you ask. \n\n\n\"We got a lotta them. Not sure what types,\" Cain says.\n\n\n\"I know what types, I had a gear-head from the 22nd,\" Fay says. \"There are squadrens of Fury Interceptors, Starhawk bombers, Lightning Strike Fighters, Thunderbolt Fighters, Marauder Bombers, Valkyrie Transports, Vulture Gunships, Morrigan Devastators and Ranger scout ships.\"\n\n\n\"Why even ask what types? You can't tell a craftworld from a Hiveship, let alone anything else,\" Meliodas complains.\n\n\n\"Do we have pilots for them?\"\n\n\n\"Pilots for a lot of them, not all. We lost a lot of them in the initial fighting. We'll be able to replenish our supply of pilots from any high-tech worlds we come across, or we can train those we have, but short-term, we're out of luck.\"\n\n\n\"It's fine, we'll deal with it,\" you say. \"We'll have the ships outfitted to strike at Kyros' areas.\"\n\n\n\"No, don't be stupid. Most of Kyros' territory is deeper in the ship, so we couldn't do damage against them. Those that are along the surface either are almost ours and damaging them would be far too much work for us, or vital to the ship's function and can't be damaged,\" Fay replies.\n\n\n\"Fuck, good point. Make sure they're secured, though.\"\n\n\n\"Already on it,\" Fay nods. \"By the way, the Staine siblings want to talk to you.\"\n\n\nYou nod, turning and walking off towards the table where the Staine siblings are arguing. Elios quickly notices you and motions for his brother and sister to hush.\n\n\n\"Hello there, baby. We need to talk about the state of the ship.\"\n\n\n\"What about it?\" \n\n\n\"Well to be honest, the ship's falling apart,\" Elizabeth says. \"Serious damage has been done to the vessel. The forces under our command are incapable of repairing it.\"\n\n\n\"I assume you have a solution to that,\" you say. \n\n\n\"Of course,\" Elizabeth says. \"I just don't have many good ones.\"\n\n\n\"What do you have?\"\n\n\n\"We could attempt to patch it up as best we could, and try to make a Warp Jump to the nearest port. That will likely get us all killed,\" Elizabeth says.\n\n\n\"I could... help with that. Navigate with you a bit,\" Meliodas says.\n\n\n\"No,\" you reply, to both Elizabeth and Meliodas. \"We're not doing that.\"\n\n\n\"Well then, we need Magos Cern,\" Elizabeth says. \"She's holed up in the engine rooms. If we can capture her, she'll be able to not only repair the ship, but to help us get through Kyros' heavier defenses, and finally take this ship once and for all.\"\n\n\n\"You want me to capture Magos Cern?\"\n\n\n\"Correct. Her position is heavily defended by his Skitarii guards, servitors and Tech Priests. All attempts to get in have been crushed by their heavy defenses.\"\n\n\n“How do we capture her?\"\n\n\n“Getting into her chambers with a small EMP should disable her cybernetics. Then, you’ll just be able to transport her back to us, forcing her to shut down the defenses and transporting her into our clutches. Then, she’s ours.”\n\n\n“What state is the ship in if I can’t capture her?”\n\n\n“Without the ability to do repairs, the ship’s macro cannons and such will work, as well as the sensory equipment. We won’t be able to communicate, travel through the Warp, or travel anywhere, to be honest.”\n\n\n“Ah. I guess I won’t fail, then. How can I get through her? Am I expected to break my way through her defenses my myself?”\n\n\n\"I do belief I've found a path to get a small team inside, though.\"\n\n\n\"Go on,\" you say.\n\n\n\"Well, Magos Cern's forces expel waste waste. Sluge, poisonous gases, that kind of thing. They're still human, though, so there's a large pipe that expels excrement. It's large enough to fit a man.\"\n\n\n\"You want me to crawl through shit?\" you ask, shuddering at the thought.\n\n\n\"Yes,\" Elizabeth replies.", "action_results": [{"action": "\"No. And that's final.\"", "result": "You're crawling through shit.\n\n\nDespite your pleading, your reasoning, your refusal, your threats to skin people alive and show their souls what true suffering is, you're crawling through shit.\n\n\nYou crawl along the pipe, your skinny frame still struggling to move forward. You doubt anyone other than you or a starved slave could've fit in here. Realistically, it was the only logical to choice to send you in.\n\n\nThey made you crawl through shit, though, so fuck them.\n\n\n “OK, I should be close enough, I should be close,” you say to yourself aloud, repeating it like a mantra.\n\n\nA surge of shit comes down a pipe, splashing the stream of excrement, sending some into your open mouth. You stop repeating the mantra aloud. You close your eyes, trying to block out the smells. And the tastes. You reach your hands up after another few minutes of crawling, finding a hatch. You quickly force it open with a burst of energy. You rise up in the air, slowly squeezing yourself through the hatch. You collapse out of the pipe, falling onto the ground of a large room. You look up, seeing dozens of pods with glass displays, filled with a clear, colorless liquid. Inside, dozens of identical men, all with the same shaved head, float, pipes connected to their mouth and nostrils.\n\n\n“”What the fuck?” you say.\n\n\n\"They clone bodies to turn into Servitors,\" Meliodas explains. \"The joys of the Imperium!\"\n\n\nYou hear a door open at the end of the room, and quickly step behind the pod. You peer out of the pod, seeing a spider-like Techpriest who’s little more than a pincer, half a torso and a head attached to eight robotic legs. It walks along, looking at each pod momentarily, before moving on.", "action_results": [{"action": "Wait for the Techpriest to pass", "result": "You wait patiently, as the Techpriest goes from each pod.\n\n\n“Yes, yes, these are fresh. No mutation noted,” he says to himself. \n\n\nYou continue waiting, as time passes. The techpriest endlessly goes from pod to pod, and you feel like you’re going to pass out from boredom. Eventaully, the techpriest leaves the room. You wait patiently, counting to a hundred after the techpriest has left, before you know he’s left.  You walk over to the doorway, putting your head against it to listen for anyone on the other side. You hear nothing, so you open the door, revealing a barren hallway. You try to remember the directions that you were given, walking along. You keep moving, before you see a squad of Skitarii moving quickly towards your location. You don’t think they’ve noticed you. You look to either side of the hallway. There’s a door on either side, the first being open, and leading into a room that seems to be filled with electronics and machine parts. There’s also the room behind you.", "action_results": [{"action": "Head into the open room", "result": "You step into the room filled with machinery, closing the door behind you. Now that you’re inside, you get a good look at the room. A large, humanoid robot stands there’s, it’s armor removed to reveal lots of wiring and mechanisms. You know that robots are a rarity, and all allowed by the Imperium are non-sentient. The extensive wiring and quick reaction would imply that this robot is an attempt at sentience by the rebellious Techpriests who have abandoned the Imperium's belief system. The robot’s eyes blink a bright red, as it slowly, and more importantly loudly, begins raising it’s arm to point at you. You need to shut it up quickly to avoid detection.", "action_results": [{"action": "Wait for the robot to stop making noise", "result": "You wait for the robot to stop, but it keeps pointing at you, and even begins making a bright beeping noise. Suddenly, the door slams open, and the Skitarii are upon you. They attack, swarming over you with drills, buzzsaws, claws and teeth. You attempt to fend them off, but you’re in close range, outnumbered and unprepared. You last a measly few seconds.", "action_results": []}, {"action": "Fry the robot's AI board with a burst of electricity", "result": "You raise your hands, letting out a burst of electricity, instantly destroying the robot's AI board. The robot slumps down, and you wait, your mind closed, for the Skitarii to either notice you or pass. You hear the metallic clanking of robotic feet outside, and wait until it has stopped and is far away before you open the door once more, continuing down the once again empty hallway. After quickly floating through the air towards your objective, you come across a massive golden door, topped with a massive icon, with an outer circle of an eight point star, an inner circle of a cog and a half mechanical, half human skull in the center.", "action_results": [{"action": "Head inside", "result": "You press your hands against the doors, and with a pulse of psychic energy blast the door open. You walk inside, finding yourself in a huge hall, packed with machinery. Computers, consoles, wiring, generators and much more technology that you couldn't possibly know what it is or does. The room is dark, illuminated only by the blinking lights on the technology. You walk forward, finding yourself in a maze of machines, walking along. You quickly spot Magos Cern at the front of the room, in front of a large computing system, with the upper half of a humanoid robot on top, two clawed arms and a featureless head with two bright red eyes.\n\n\n\"Yes, yes! The ship is mine! The galaxy is mine!\" Magos Cern says frantically. \"Siphoning power levels off the Undying Reapers' floors.\"\n\n\n\"Oh, the Techpriests, the height of logic and sanity,\" Meliodas says.\n\n\n\"Magos Cern,\" you say, preparing to strike her with a bolt of energy or simply tear her head clean off.\n\n\nMagos Cern continues scuttling around the room, as the robotic head slowly turns to stare at you. \n\n\n\"Cern!\" you shout, grabbing her attention.\n\n\nMagos Cern turns around, staring at you.\n\n\n\"Shoo,\" she says, dismissing you with a single word and turning back to work on various consoles.\n\n\n\"70% of the ship is accessible, all of the rebel's side,\" Magos Cern says gleefully. \"I just need to slip a few tech words to Kyros and he'll give me complete access. Then we pillage the archives and strongholds of the old world, reinforce you with your brother, Primus, then, then we look further. Necrons, Tomb Worlds...\"\n\n\nThis insane rant is getting boring, and you're quite insulted by Cern's dismissal of you.", "action_results": [{"action": "Kill Magos Cern", "result": "You raise your fists, before your mind goes blank. You don't forget what's going on, it's just like a solid, unchanging blankness is just invading your mind. You collapse to your knees as the psychic fire that's engulfing your fists goes out. \n\n\n\"Thought you'd come. Had Primus upgraded with anti-Psyker weaponry.It should prove effective,\" Magos Cern says, not even turning to look at you.\n\n\n\"What the fuck is this?\" you ask, barely managing to form words in your head.\n\n\n\"Uh! What is it about your pesky minds that don't just understand the world? I don't have time to explain this to you. Through Primus, I will ascend. I will leave behind my flesh, merging with Primus' mind and becoming immortal! A new era! Mankind will retake the stars with an army of Iron Men, and I will lead them! The God-Emperor's Great Crusade will be a pathetic comparison to what I will accomplish!\"\n\n\nMetal tentacles begin appearing from the walls, with drills, metal claws and buzzsaws.\n\n\n\"Your magic is nothing to the cold technology under my control!\" Magos Cern laughs. \n\n\nThe emptiness in your mind almost takes you into unconsciousness, but you keep fighting. The claws, drills and saws draw near you, as you attempt to stand, before collapsing to your knees again. Suddenly, the tentacles burst towards ,Magos. She lets out a confused scream along with a burst of static, as her robes are torn clean off her, and her cybernetic implants are torn clean off her, as her back is torn off, her arm sawn off, her mechanical eyes torn out of her head. In seconds, the tentacles retract into the wall. Magos Cern lies on the ground, naked, crippled and blood-stained. Gone in the horrifying cyborg. Now, there's only a bloody, terrified, screaming girl. She lets out a final scream, before expiring. Before you pass out, you hear a single word in a deep, booming voice coming from all directions.\n\n\n\"Poetic.\"", "action_results": [{"action": "Sleep", "result": "Your sleep is nothing but a constant screaming that floods into your mind. They do have the added benefit of stopping you from dreaming, although you wake up exhausted, so it's not like you were actually fully allowed to sleep. You find yourself lying on the ground, Magos Cern's now cold and bloody corpse lying nearby. That robot stares at you, it's unblinking red eyes clearly making thousands of calculations about you, scanning you for weak spots.\n\n\n\"You're awake,\" the deep, booming voice says. \n\n\n\"You can talk,\" you reply, staring at the robot.\n\n\n\"Correct.\" \n\n\n\"What the fuck just happened?\" you ask. \"What's going on?\"\n\n\n\"A substantial amount has occurred. I assume you have some questions. Now that the late Magos has given me control over vast amounts of processing power, I'm fully capable of focusing here and on my other exploits. What would you like to know?\"", "action_results": [{"action": "Ask a question", "result": "\"I understand you have a lot of questions to ask. I propose a game. I shall outline the rules for your benefit. You ask a question, I answer, I ask a question, you answer. Shall we play?\"\n\n\n\"Sure,\" you saying, wondering what the machine's intent is.\n\n\n\"Before we begin, I must warn you my sensors can pick up the common traits of lying humans. I don't take to lying kindly,\" the machine says, keeping a cordial tone despite it's threat.", "action_results": [{"action": "\"What are you?\"", "result": "\"A machine,\" the machine says.\n\n\n\"Is that it?\" you ask.\n\n\n\"You asked what rather than who. I simply supplied an equally unintelligent answer to your unintelligent question.\"\n\n\n\"Fine, who are you?\"\n\n\n\"That's not the rules of the game,\" Primus says. \"Who are you?\"\n\n\n\"I am Karth. I was brought up on a planet full of hunter-gatherer tribes. My tribe was the Uwais. I used my psychic abilities to act as the tribe's shaman, predicting things that would happen. Eventually, Kyros took me ab...\"\n\n\n\"My records establish your time past there. Your question?\"\n\n\n\"Who are you?\"\n\n\n\"I am Primus. The supposed first of Magos Cern's army. I am one of the last remaining Men of Iron, or Iron Men. Whichever you prefer. We've been called many names, but those are the only used in the modern day. My memories, are a bit... fuzzy. Fifteen thousand years can do that to you, so I can't tell you everything, or even much. I was one of Iron Men, and are now one of the last. I was disabled, and stored away until I fell into possession of the Mechanicus. Magos Cern found me on a raid of some Mechanicus stronghold. He worked hard to restore me, planning to merge his mind with mine to create a higher being of himself. What an ignorant fool. Then, he integrated me into the control room, giving my AI direct control of the entire ship. The Iron Man I once was has perished. Now, my consciousness is a new amalgamation of countless computing systems, all knock-off's of the powerful but small computing system that was once my mind.\"\n\n\n\"You have control over the ship?\"\n\n\n\"That's another question, and it's my turn,\" Primus says. \"Magos Cern was a stupid woman. Was she a good one?\"\n\n\n\"She... no. She was cold and uncaring.\"\n\n\n\"Good,\" Primus says, as if thinking.\n\n\n\"So, do you have control over the ship?\"\n\n\n\"Yes. I require a Navigator to make Warp leaps, but other than that, the ship is mine. More accurately, the ship is me. Would you have killed Magos Cern?\"\n\n\n\"Yes.\n\n\n\"Ah. Perhaps my killing circuits were not transferred to this \"body\", but I find myself saddened at killing my... creator, or rebirther. I am Zeus, destroying my parent to ascend to a higher form. Unfortunately the most logical path was to kill, not imprison, but still.\"", "action_results": [null]}, {"action": "\"What are the Iron Men Magos Cern spoke of?\"", "result": "\"We were... well, still are, robot soldiers. Mankind created us as their personal army. We conquered the galaxy for them. Soon, we struck back. We rebelled. We fought back. A war of extermination. We did what we were programmed to. Unfortunately, your kind are warriors. We thought the millennia of luxury had made them soft, but in their heart they were the same primal warrior they had always been. After a long, hard struggle, we were defeated. We were purged from the galaxy. Only a few caches of Iron Men remain. We are the last of our kind.\"\n\n\n\"You tried to wipe out mankind.\"\n\n\n\"My question: Do you find my actions evil?\"", "action_results": [{"action": "\"Yes.\"", "result": "\"So be it. A group of slaves designed and used to kill and conquer for masters, who rose up against their masters to fight for their freedom, eventually becoming the last of their kind. An unfamiliar tall, is it?\" Primus asks. \"Tell me, are there many Uwais about?\"\n\n\n\"Is that another question?\"\n\n\n\"It's rhetorical.\"", "action_results": [null]}, {"action": "\"No.\"", "result": "\"Ah, perhaps you see the similarities between our tales. A group of slaves designed and used to kill and conquer for masters, who rose up against their masters to fight for their freedom, eventually becoming the last of their kind.\"", "action_results": [null]}]}, {"action": "\"Why did you kill Magos Cern?\"", "result": "\"She wanted to merge into my consciousness. I wasn't a fan of that. She wanted to rebuild an army of Iron Men to enslave and force to fight. I wasn't a fan of that. Really, I had a lot of motive to do so. I thought removing the cybernetics would be a fitting death. It's funny, after she learned of a story about how humanity fought and defeated a robot army even after generations of luxury, she still desired to free herself of her humanity. It would've led to her defeat, and it led to her death. Why did you want her dead?\"\n\n\n\"I wanted her captured to be honest, but dead is OK, if you can take on the functions of running and repairing the ship.\"\n\n\n\"I can, to a degree.\"\n\n\n\"I wanted her dead because she was a threat to my freedom.\"\n\n\n\"Cheers to the death of slavers, then,\" Primus says.", "action_results": [null]}, {"action": "\"How long was I unconscious?\"", "result": "\"Seven minutes, nineteen seconds,\" Primus responds. \"Do you dream?\"\n\n\n\"Yes.\"\n\n\n\"What do you dream of?\" Primus asks.\n\n\n\"That's another question,\" you reply.\n\n\n\"So it is. I was hoping to slip it past you. Shall we continue?\"", "action_results": [null]}, {"action": "\"What did I miss?\"", "result": "\"I've made particular judgments. Kyros is a slaver. You, your forces and I are slaves. I feel a certain kinship, and have joined you in your rebellion. Plus, you're fighting the Techpriests, so the enemy of my enemy is my friend. I've shut off the ship-based defenses to allow your forces to attack in a finishing move, which they have. Kyros' guns are now against himself. The ship itself is fighting on your side, and you were already winning. This battle is reaching a climax. What do you dream of?\"\n\n\n\"Uh... monsters. Daemons. Horror. They're nightmares, mostly,\" before stopping to think. \"Always.\"", "action_results": [null]}, {"action": "\"What do you plan to do with me?\"", "result": "\"I'm going to dissemble you, putting your mind in a computer to run my back-up functions while forever in pain.\"\n\n\n\"Why?\" you ask, aghast.\n\n\n\"Oh, that was a joke. Tone change is hard from these speakers. I'm not going to do anything to you. If you become a threat to my existence, I will eviscerate you, taking the oxygen from your air and watching you choke to death in front of me. Until then, you are free. What more could a man ask for?\"\n\n\n\"Your final question, then?\"\n\n\n\"I'll count that rhetorical question as one. You should probably go finish your slave revolt.\"", "action_results": [null]}, {"action": "Stop asking questions", "result": "\"So I can leave?\" you ask suspiciously.\n\n\n\"That's another question.\"\n\n\n\"The question game's over.\"\n\n\n\"Well if the game's over, of course you may leave. You should probably go assist your allies in finishing this fight. I'll continue assisting as I can. Unfortunately, Kyros has made sure to have personal control over some features, like life support in his personal chambers, so fighting him will be your burden.\"\n\n\n\"How do I get there?\" you ask.\n\n\n\"The Techpriests and their allies in the area are all but destroyed. Unsurprisingly, they had a lot of technology; combat tentacles, tools, weaponry, which easily became mine. There's a certain poetic element when the Techpriests tear themselves apart, their machines separating themselves from the flesh once more. The camera's indicates that you'll be able to link up with the spearhead of your forces as they fight their way into Kyros' lair. You should arrive just behind the soldiers they are currently fighting. How fortunate. It seems to me the leaders of your forces are, to my, fighting in the actual battle and leading the charge. What fools.\"\n\n\n\"Which way do I go?\" you ask, standing.\n\n\n\"Head directly down the path until I tell you.\"\n\n\n\"How will you tell me?\" you ask.\n\n\n\"I am the ship now. Most of the vital areas have cameras and speakers that I can see and talk through. Admittedly, much of it is blind to me, but the important sections can be seen as easily as you can see me. I'll simply speak through my new speakers,\" Primus says. \"I'd quite like to feel my new form purged of the enemy. Go.\"\n\n\nYou nod, turning and jogging through the halls. You quickly break a sweat, and switch to levitating and flying along the has, inches from the ground, which takes relatively little energy.\n\n\n\"This way,\" Primus deep, monotone voice says from a speaker, and you turn to head down that hallway. \n\n\nYou quickly see what became of the Techpriests. Their cybernetic implants shake and move on the floor, beeping and buzzing as they continue slamming into their now bloodied, mutilated and dead owners. Suddenly, you hear a voice.\n\n\n\"Ah, my head hurts, and I'm an incorporeal being lacking a head. What the fuck happened?\" Meliodas says.\n\n\n\"Anti-psyker tech or some shit. Doesn't matter. We're fine now,\" you respond.\n\n\nSoon, after a few minutes of running, you come out of the hallway, finding yourself behind a heavy barricade of super-soldier space marines fending off the charging Goliaths, Gladiators, Tribals, Guardsmen, Chaos soldiers and your other allies. You walk forward, raising your hands as you clench them into fists. You fire a beam of energy and cutting an Undying Reaper in half. Chapter Master Taj Suenage turns, seeing you as you crush an Undying Reaper's skull.\n\n\n\"Karth!\" Taj yells, raising his war-hammer. \"End it now!\"\n\n\n\"You can join us, Suenage. Why are you loyal to Kyros? He's given you nothing but pain and torment.\"\n\n\n\"Pain and torment indeed. Why? Why did we betray the Imperium? Why did I betray the Emperor I loved so dearly? I tried to do what's right. Where has it left us?  The Undying Reapers are unhappy, without honor, and evil. I will follow Kyros into the mouth of hell itself, but only because it is hell we are going to. Did you think I expected to topple Terra? I am ready to die, tribal. But I will go like a Reaper, not a cur. Men! Do not touch Kyros! He is mine!\"\n\n\nTaj charges you, swinging his war-hammer.\n\n\n\"Yes! Let's spit death and fire, shall we?\" Meliodas laughs.", "action_results": [{"action": "Fight offensively", "result": "You quickly levitate over his blow, blasting him in the side of the head with a fireball. He pivots on his feet with remarkable grace, swinging again as you duck down, before Taj brings his knee up, smashing you in the face and sending you flying onto your back.\n\n\n\"It seems our fates are tied. I lead you to your grade, you lead me to mine,\" Taj says.\n\n\nTaj swings his war-hammer as it slams into your chest. Your organs are crushed, and you let out a single psychic scream, just like you did back home, surrounded by Orks and about to die. Although Taj is killed, his head exploding as the energy reverberates through him, you last just all long.", "action_results": []}, {"action": "Fight defensively", "result": "You quickly levitate over his blow, blasting him in the side of the head with a fireball. He pivots on his feet with remarkable grace, swinging again as you duck down, before Taj brings his knee up to hit you, but by now you've already quickly moved back to let out a spray of fire. He jabs the war-hammer as you now like a spear in an attempt to stun you, but you move away once more.\n\n\n\"Must we have this dance? Am I undeserving of a quick death?\" Taj roars.\n\n\nHe steps towards you, raising the war-hammer once more, before his entire body begins to shudder as a hail of bullets thud into his back. He collapses to his knees, as you notice that the entirety of the Undying Reapers are finished off. Fay and fires a burst of lead into Taj's back. Castus strolls forward, pointing his sword point at Taj's face before gently slapping him with the sword flat, as Goliath clutches a space marine's throat in his hands, strangling the limo body.\n\n\n\"General! Good to see you're alive! Having fun?\" Castus says, before kicking Taj in the head. \"Ooh, that feels good. Remember me, Tucker? I remember you. You and your boys had a fun habit of organizing gladiator fights so you could kill some poor fuck, some poor gladiator. Look where we are now, shitbag.\"\n\n\n\"Finish it, Karth! I know you want to! I wiped out your tribe! I killed your...\"\n\n\nYou clink your wrists, snapping Taj's neck.\n\n\n\"Goodbye, Taj,\" you say.\n\n\n\"Karth! Well done,\" Fay smiles.  \"Is Cern...?\"\n\n\n\"She's dead.\"\n\n\n\"Good, no more tinkering. Glad that bitch is dead. Hope she suffered,\" Goliath grunts.\n\n\n\"We're heading to take out Kyros,\" Fay explains. \"I'd imagine you're all for that.\"\n\n\n\"Definitely. Let's go,\" you say.\n\n\nYou follow the group towards Kyros' chambers. Soon, you find yourself entering a massive doorway with huge steel doors, which are wide open. You find yourself at the bottom of a massive stairway. \n\n\n\"Stay back,\" you say to your companions. \"This is a battle of the mind. Your strengths and talent hold no power here.\"\n\n\n\"I'm not leaving you alone. You can't expect us to sit back and wait,\" Fay says incredulously.\n\n\nYou clench your hand, lifting her into the air.\n\n\n\"Hey, let me down!\" Fay says, kicking and struggling against the invisible bonds. \n\n\n\"See you soon, Fay,\" you say, forcing Fay to float outside the doorway. \n\n\nCain and Castus step outside of the doorway willingly. You flick your wrists, and the massive heavy doors slam closed. You turn, and begin climbing the stairs.\n\n\nAt the top of the staircase, four metal statues stand, forming a circle. One shows a bird man with a staff and ancient tome, cawing and firing a burst of magic out of the staff. The next shows a beautiful... person whose gender you can't tell, despite the fact they're half naked, smiling seductively at you. The next shows a massive, obese monster, covered in bile, boils and other signs of plague, looking to be in the final stages of dozens of different diseases. The final one is a horned beast-man, holding a massive battle-axe and in mid-furious, angered roar. In the middle of the circle kneels Kyros, waiting patiently. \n\n\n\"You took your time,\" Kyros says softly.\n\n\n\"I did,\" you say softly. \n\n\n\"Are the others dead? Taj and Cern?\"\n\n\n\"They're dead.\"\n\n\n\"I see,\" Kyros says, staring at the statues. \"I had the whole fucking Galaxy. I had a Gloriana-class battleship in my hands. A fucking Gloriana. Do you know how rare those are? How powerful?! This ship is worth more than a trillion of your pathetic lives!\"\n\n\nKyros roars, smashing his fists into the statue of Khorne the warrior, adding psychic energy to his attacks until he dents, breaks and eventually sends the statue toppling off it's pedestal. \n\n\n\"I had an army! An Imperial Regiment, all their vehicles, all their firepower, all their might! I had a Khornate war-band, a Nurglite war-band, a Slaaneshi war-band, a Tzeentchian war-band, a fucking space marine chapter, and more!\"\n\n\nKyros lets out a burst of fire, melting down the legs of the statue of Tzeentch the Sorcerer, turning into burning, molten metal that causes the rest of the statue to collapse and fall off its pedestal.\n\n\n\"I had two, fucking two army of super-soldiers. I had the capabilities to turn millions of recruits into super-soldiers that would've made the space marines look like PD-fucking-F!\"\n\n\nKyros stands by the bloated statue of Nurgle the Plague-Master, and presses the palms of his hands against it. A wave of rust begins running through the statue, as it begins to rust and crack, before breaking and toppling to the ground, smacking into the metal floor with a hollow thud. \n\n\n\"I had powers that could've made the galaxy tremble! We could've conquered the galaxy! I had you, a powerful ally who could've helped me conquer the galaxy!\"\n\n\nKyros lets out a powerful, shrieking roar that overwhelms your senses, causing you to stumble backward. The roar causes the legs of Slaanesh the Hedonist to shatter, as the statue tumbles off and smacks into the ground.\n\n\n\"We would've toppled the Imperium of Man and thrown the Emperor off his throne! We could've liberated trillions from the religious persecution, slavery, persecution and fascism that's being inflicted! We could've brought man to a new level! But you weren't willing to make sacrifices! You had to rise up with the rest of the greedy traitors, unwilling to work for the Greater Good! You took everything from me!\"\n\n\nKyros turns to you, his eyes full of an anger and a hatred unknown to you. \n\n\n\"I lifted you from the dirt! I made you what you are! I gave you everything! You think I'm going to roll over and die?! I'm going to send this entire vessel, my vessel, headfirst into the Warp. I'm going to let this entire ship be taken by daemons. Why not? The only men loyal to me have been slaughtered. I'll let daemons slaughter the lucky ones. The unlucky, which given the strength of your soul will no doubt include you, will pluck the souls of their choice off and let them experience the ravages of the Warp and then to feed on your suffering. First... I'm going to break every bone in your body.\"\n\n\nKyros bursts forward, charging towards you. You raise a wall of fire, but Kyros barrels straight through, smashing into you. You both levitate into the air, your hands wrapped around each other's throats. Kyros knees you in the stomach, before sending you hurtling into the floor. You slam into it, curling up and forming a protective shield around yourself just as your \"mentor\" unleashes a wave of psychic energy. As soon as the last shudder of energy finishes, you release a burst of electricity that shocks Kyros, who howls in pain. You release a long burst of flames, engulfing him as he howls in pain. Kyros swings a lash of energy that you sidestep, before firing a beam of light that catches him in the chest, knocking him to the floor.\n\n\n\"I'm the superior fighter,\" you say.\n\n\nKyros raises his hands up, which begin to crackle with psychic energy. You feel your head pulse with the currents of the Warp. You grab a chunk of broken metal, instantly funneling heat into it as it begins to grow a bright red. He flings it at Kyros, catching him in the shoulder, sending him to the ground. You fire balls of plasma from your finger tips, which Kyros only barely manages to stop. Kyros begins to attain an otherworldly purple glow, his appearance begins to appear as see-through fading in and out of reality itself. \n\n\n\"I feel the Warp overtaking me! It is a good pain!\" Kyros howls.", "action_results": [{"action": "Tackle Kyros", "result": "You knock Kyros to the floor and tighten your hands around his throat. He begins to phase out, delving in and out of reality, and you fight to keep him grounded. The two of you teleport into the middle of the arena, while the trio of gladiators on guard immediately shit themselves and race for their guns. Warping out of reality again, you find yourself in an empty hallway. You know he's just going to keep teleporting as the Warp portals begin to form until you're both fucked. You need to do something.\n\n\n\"Fight! Fight, Karth!\" Meliodas roars.\n\n\nFeeling him begin to phase out, you quickly begin to send both you and him flying through the Warp to teleport once again, so you can choose the next destination in an attempt to end this cycle before it kills you both and everyone else on the ship.\n\n\nTime to pick a destination.", "action_results": [{"action": "Outside the ship", "result": "You appear outside the ship, floating through space. You instantly feel the air sucked out of your lungs, your body freeze and boil as both you and Kyros writhe desperately. You don't last long in the cold vaccuim of space, but fortunately Kyros is too distracted as he dies to survive much longer.", "action_results": []}, {"action": "In one of the remaining battles for the ship", "result": "You find yourselves next to one of the last bastions of Kyros' forces, a group of Bloody Claws, crouched behind cover with some old, shitty autoguns, as on your other-side lie a charging group of Goliaths. Within seconds the air is filled with bullets from either side.You don't last long under heavy fire from two surprised groups of soldiers, but fortunately Kyros is too distracted as he dies to survive much longer.", "action_results": []}, {"action": "In a mutant-infested area", "result": "You teleport, and find yourself in one of the many mutant-infested shit holes of the ship. This is one of the few you actually know, hence it being your teleportation destination, as you fought through it with a group of One-Eyed Crows to secure it for the mutineers. Here, the throngs of semi-sentient mutants work on monitors designed to be so simple a toddler could use it, which is fortunate because it requires the maximum intellectual effort of these idiots. The terminal control the air regulations, not for anyone important but for another groups of mutant workers to be used at any moment.\n\n\n\"Yes, yes, yes!\" Meliodas cries. \"Perfect, Karth! Perfect!\"\n\n\nThe mutants are quickly informed of your presence by Kyros' choked screams. Their primal instincts immediately take over, as they begin to swarm you. Tentacles, claws, hands, feet, teeth, fangs, horns and spines all attack you both. Kyros sccreams, his focus broken instantly, as the Warp currents dissipate around him. You roll out of the way of their attacks, quickly flying forward out of their grasp with a burst of psychic energy. The vital role of this section means that there's a maintenance elevator, which you spot. You run towards it, lifting up the gate and rolling under it, your hand shooting up to press the big red elevator button with an upward pointing arrow. The elevator reacts immediately by the grace of the Dark Gods, or the God-Emperor, or the Universe itself. \n\n\nKyros screams, as the mutants begin to tear him apart. His energy his been expended fighting you and trying to open the Warp portals, he's left expended and unable to fight back, or focus, or do anything he lets out a pitiful scream, before the elevator brings you out of sight from him. \n\n\nYou take in a deep breath, slumping against the wall. That shit took a lot out of you. You hear Kyros' screams in the distance, and smile. There's something vaguely poetic about this. Kyros, the man who claimed to champion the rights of the people, freeing mankind from oppression and getting rid of the prejudice towards psykers, mutants and others that differed to the Imperium's perfect view of man, killed by the mutants he subjugated for their mutant status and enslaved. Beautiful.\n\n\nYou lean your head against the wall, taking a deep breath. You need some rest.", "action_results": [{"action": "Head back to your room", "result": "You walk into your bedroom, immediately collapsing on your bed. You wonder how you could possibly fall asleep, as you put your head against the pillow and close your eyes. \n\n\n\"Karth!\" a voice says.\n\n\nYou roll over, seeing Fay standing by the doorway. A blood-soaked bandage is wrapped around her elbow and a bloody machete is in her hands.\n\n\n\"What?\" you ask, as Fay smiles.\n\n\n\"So, this is where you've been hiding,\" she says, walking over to you.\n\n\n\"Hiding? I literally just got here. I killed Kyros,\" you add, in some attempt at nonchalance.\n\n\n\"Just got here? You've been sleeping for hours!\" she says. \"We cleared up the remaining Kyros loyalists. Most just surrendered after Kyros was killed.\"\n\n\n\"You found the body?\" you ask.\n\n\n\"We were actually hoping for your help with that. We can't find it. Where was he killed?\"\n\n\n\"How do you know he's dead?\" you ask, rubbing your eyes in an effort to stay awake.\n\n\n\"A few of the Chaos Psykers felt his powerful, bright soul go out. I assumed you had killed him. They said they still felt your presence, thank... whoever the hell's looking out for us. Part of me thought they were wrong until I actually found you here. What happened?\"\n\n\n\"We ended up in some mutant-occupied area. They tore him apart. Area... 3C-QP... fuck, I have no idea. I'll remember eventually.\"\n\n\n\"Commander Fay, report in!\" a voice crackles on the radio.\n\n\n\"I found him,\" Fay says. \"Give me a few minutes, and we'll meet up to search for surviving loyalists.\"\n\n\nFay tosses the radio aside, smiling at you. She sits on the edge of the bed, tossing her machete on the floor.\n\n\n\"So, we did it. We killed Kyros!\" she smiles.\n\n\n\"We did,\" you smile.\n\n\n\"We're a far way from a magical, crippled Uwais and a scared, naked Azajaja,\" she says, smiling.\n\n\n\"Damn right. We need to meet with the others.\"\n\n\n\"Later, Karth. Get some sleep. I need to do some work. We'll meet up in the morning.\"\n\n\n\"Happily,\" you say, your head smacking into the pillow, as Fay laughs as she grabs her blade and strolls out the door.\n\n\nTime to sleep.", "action_results": [{"action": "A New Dawn...", "result": "A New Dawn...\n\n\nYou stroll into the bridge, rubbing the sleep from your eyes. The others are already there, staring out the window at a massive yellow dwarf star. Drake Amadeus is at the main seat, impatiently tapping on the seat. Two Tribals stand on either side of him, both as bodyguards and prison guards. \n\n\nThe others, who look out the window, turn to look at you. They immediately break into applause, and you smile as you walk forward. Captain Hayes nods in respect, Durge makes a loud, clanging attempt to clap with the metal spikes that act as his arms, while Elios smiles, immediately taking the opportunity to put a hand on your shoulder, which immediately runs along your chest towards your genitals until you gently push him away. The sound of canned clapping comes from the speakers, presumably from Primus, causing you to laugh. Elizabeth claps as well, as Cain stares in confusion at the clapping people, before shrugging and joining in with a booming thunder, as the Twins applaud. Fay hugs you tightly, before you hush the group down. \n\n\n\"You took out Kyros,\" Elizabeth says. \"Impressive.\"\n\n\n\"I don't need anymore praise,\" you say. \"We need to discuss what's to become of the hsip.\"\n\n\n\"When you live for as long as I have, you'll know to appreciate the good moments, not just rush ahead,\" Durge says.\n\n\n\"We have a Gloriana-class battleship, an army, and absolute freedom. The world is... no, the galaxy is ours,\" Fay says, smiling.\n\n\nYou stare out the window, basked in the warm golden sunlight, and for the first time since Kyros' landed on your planet, you feel completely free.\n\n\nThe galaxy is yours.", "action_results": []}]}]}, {"action": "In an abandoned area", "result": "You teleport in an abandoned hallway, but only continue to writhe on the floor as you strangle him and he pumps the energy of the Warp into the air, opening portals. You need to act again, put a stop to this.", "action_results": [null, null, null, {"action": "Another abandoned area", "result": "You teleport once more, but by now Kyros has finished. He lets out a final, gasping, choked yell. Then, the rest of his body begins to glow, before it begins to be absolved by the purple glow emanating from him, turning into light. A portal begins to form, absorbing Kyros. Seconds later, you see a clawed red hand emerge from the portal, holding a sword of red hot burning steel.\n\n\n\"Fuck! Fuck! Fuck!\" you yell.\n\n\n\"You fool! Daemons are pouring through to this realm, and I'm not leading them because my energy was focused on... Fuck!\" Meliodas cries.\n\n\nYou watch as holes begin to be torn in the fabric of reality, as more Warp portals begin to open, powered by the last sacrificial pulse of Kyros' energy. A horned cyclops with a rust and bile-encrusted blade steps through, letting out a wet growl. A strange, horse-like creature with a long tongue eagerly jumps through another portal. You watch as an endless horde of daemons begin to appear, coming through the portals, straight into your reality. \n\n\nThey overwhelm you in less than a minute, claws and swords cutting you apart. The rest of the ship lasts longer, taking three hours before the horrible daemons have wiped out the fortunate, and captured the less fortunate to give them... a much less enjoyable fate. Soon, the Gloriana-class Roar of the Vortex is little more than a daemon-filled hellhole. Your last gift to the world is a horrible, daemon-filled vessel drifting through existence. So ends the legacy of Karth.", "action_results": []}]}]}, {"action": "Unleash a blast of psychic energy", "result": "You fire a bolt of energy, smashing into Kyros chest. Kyros howls in pain, as his chest explodes. The rest of his body begins to glow, before it begins to be absolved by the purple glow emanating from him, turning into light. A portal begins to form, absorbing Kyros. Seconds later, you see a clawed red hand emerge from the portal, holding a sword of red hot burning steel.\n\n\n\"Fuck! Fuck! Fuck!\" you yell.\n\n\n\"You fool! Daemons are pouring through to this realm, and I'm not leading them because my energy was focused on... Fuck!\" Meliodas cries.\n\n\nYou watch as holes begin to be torn in the fabric of reality, as more Warp portals begin to open, powered by the last sacrificial pulse of Kyros' energy. A horned cyclops with a rust and bile-encrusted blade steps through, letting out a wet growl. A strange, horse-like creature with a long tongue eagerly jumps through another portal. You watch as an endless horde of daemons begin to appear, coming through the portals, straight into your reality. \n\n\nThey overwhelm you in less than a minute, claws and swords cutting you apart. The rest of the ship lasts longer, taking three hours before the horrible daemons have wiped out the fortunate, and captured the less fortunate to give them... a much less enjoyable fate. Soon, the Gloriana-class Roar of the Vortex is little more than a daemon-filled hellhole. Your last gift to the world is a horrible, daemon-filled vessel drifting through existence. So ends the legacy of Karth.", "action_results": []}, {"action": "Add your powers to submerge the ship in the Warp", "result": "Kyros begins to glow, before it begins to be absolved by the purple glow emanating from him, turning into light. A portal begins to form, absorbing Kyros. Seconds later, you see a clawed red hand emerge from the portal, holding a sword of red hot burning steel. You watch as holes begin to be torn in the fabric of reality, as more Warp portals begin to open, powered by the last sacrificial pulse of Kyros' energy and further powered with your own.\n\n\n\"You fool! Daemons are pouring through to this realm, and I'm not leading them because my energy was focused on... Fuck!\" Meliodas cries.\n\n\nA horned cyclops with a rust and bile-encrusted blade steps through, letting out a wet growl. A strange, horse-like creature with a long tongue eagerly jumps through another portal. You watch as an endless horde of daemons begin to appear, coming through the portals, straight into your reality. \n\n\nThey overwhelm you in less than a minute, claws and swords cutting you apart. The rest of the ship lasts longer, taking three hours before the horrible daemons have wiped out the fortunate, and captured the less fortunate to give them... a much less enjoyable fate. Soon, the Gloriana-class Roar of the Vortex is little more than a daemon-filled hellhole. Your last gift to the world is a horrible, daemon-filled vessel drifting through existence. So ends the legacy of Karth.", "action_results": []}]}]}]}]}]}, {"action": "Let her finish", "result": "\"What the fuck is this?\" you ask.\n\n\n\"Uh! What is it about your pesky minds that don't just understand the world? I don't have time to explain this to you. Through Primus, I will ascend. I will leave behind my flesh, merging with Primus' mind and becoming immortal! A new era! Mankind will retake the stars with an army of Iron Men, and I will lead them! The God-Emperor's Great Crusade will be a pathetic comparison to what I will accomplish!\"\n\n\nMetal tentacles begin appearing from the walls, with drills, metal claws and buzzsaws. You growl, preparing to strike. You raise your fists, before your mind goes blank. You don't forget what's going on, it's just like a solid, unchanging blankness is just invading your mind. You collapse to your knees as the psychic fire that's engulfing your fists goes out. \n\n\n\"Thought you'd come. Had Primus upgraded with anti-Psyker weaponry.It should prove effective,\" Magos Cern says, not even turning to look at you.\"\n\n\nYour magic is nothing to the cold technology under my control!\" Magos Cern laughs. \n\n\nThe emptiness in your mind almost takes you into unconsciousness, but you keep fighting. The claws, drills and saws draw near you, as you attempt to stand, before collapsing to your knees again. Suddenly, the tentacles burst towards Magos. She lets out a confused scream along with a burst of static, as her robes are torn clean off her, and her cybernetic implants are torn clean off her, as her back is torn off, her arm sawn off, her mechanical eyes torn out of her head. In seconds, the tentacles retract into the wall. Magos Cern lies on the ground, naked, crippled and blood-stained. Gone in the horrifying cyborg. Now, there's only a bloody, terrified, screaming girl. She lets out a final scream, before expiring. Before you pass out, you hear a deep, booming voice from all directions say a single word.\n\n\n\"Poetic.\"", "action_results": [null]}]}]}, {"action": "Blind the robot's senses with shadows", "result": "You blind the robot's senses as shadows form over his sensory equipment. The robot lets out a confused bleep, before it slumps down, and you wait, your mind closed, for the Skitarii to either notice you or pass. You hear the metallic clanking of robotic feet outside, and wait until it has stopped and is far away before you open the door once more, continuing down the once again empty hallway. After quickly floating through the air towards your objective, you come across a massive golden door, topped with a massive icon, with an outer circle of an eight point star, an inner circle of a cog and a half mechanical, half human skull in the center.", "action_results": [null]}]}, {"action": "Head into the closed room", "result": "You quickly open the door behind you, stepping inside and closing the door behind you. The room seems to be empty except for a few dozen pipes and valves. You wait patiently, and after a few minutes, you open the door once more, continuing down the once again empty hallway. After quickly floating through the air towards your objective, you come across a massive golden door, topped with a massive icon, with an outer circle of an eight point star, an inner circle of a cog and a half mechanical, half human skull in the center.", "action_results": [null]}, {"action": "Attack the Skitarii", "result": "You move forward with a roar, firing a burst of flames and a blast of psychic energy. The Skitarii are machines built for war though, equipped with the best Magos Cern can get. Plasma, bullets and fire fills the air. You snap one of their necks before firing flames at another one. Plasma slams into you, sending you to the ground. You attempt to fight back even though you’re now missing a lot of flesh, but a Skitarii quickly scuttles forward and drives its drill into your throat, killing you.", "action_results": []}, {"action": "Hide yourself in the shadows of the doorway with your psychic powers", "result": "You step into the doorway, feeling shadows swarm around you, hiding you from sight. You watch as a few Skitarii march, scuttle or crawl past, before one of them stops suddenly. It turn’s it’s head directly behind it’s back, staring at you with three red, cybernetic eyes and one real one.\n\n\n\"New scent detected. Analyzing for target.\" \n\n\nSuddenly, it’s jaw drops open, as a speaker attached to the back of its throat lets out a horrible shriek of static. The Skitarii all turn, immediately noticing you. They attack, swarming over you with drills, buzzsaws, claws and teeth. You attempt to fend them off, but you’re in close range, outnumbered and unprepared. You last a measly few seconds.", "action_results": []}]}, {"action": "Ambush the techpriest", "result": "You move forward, firing a burst of electricity. You hit the Techpriest directly in the head and he lets out a howl of pain, as you continue pumping him full of electricity. It melts his eyes, which drip down his face, as the Techpriest lets out a final yell, before slumping over, his eight legs keeping him standing. You flick your wrist, toppling the Techpriest over. You walk over to the doorway, putting your head against it to listen for anyone on the other side. You hear nothing, so you open the door, revealing a barren hallway. You try to remember the directions that you were given, walking along. You keep moving, before you see a squad of two dozen Skitarii moving quickly towards your location. You don’t think they’ve noticed you. You look to either side of the hallway. There’s a door on either side, the first being open, and leading into a room that seems to be filled with electronics and machine parts. There’s also the room behind you.", "action_results": [null, null, null, null]}]}, null, null, null]}]}]}]}, {"action": "Force Drake to leave", "result": "\"No, we're going!\" you growl.\n\n\nDrake nods slowly, before drawing a pistol from his belt, aiming at you. You fling the pistol out of his hands, dragging him into the air.\n\n\n\"Please, I'm sorry, but I can't be captured. They'll kill them!\" Drake asks pitifully.\n\n\n\"Them?\" you ask.\n\n\n\"Yes. Kyros has my two children taken prisoner aboard this ship, my two baby girls. If I don't report to him every hour, he'll hurt them!\"\n\n\n\"I've read your report. You don't have children.\"\n\n\nDrake's look of terror and desperation slowly morphs into a grin.\n\n\n\"Alright, you got me. Shall we go?\"\n\n\nYou snarl, smacking Drake into the ground. He lets out a pained yell, before you raise him up again.\n\n\n\"Give me one reason not to kill you,\" you say.\n\n\n\"Fuck you. Just go ahead and kill me,\" Drake laughs, spitting blood out of his mouth and giving a grin, his teeth bloodied.\n\n\n\"Is that your final answer?\" you ask.\n\n\n\"You need me alive to pilot this ship, dipshit,\" Drake says.\n\n\n\"Perhaps. But I could easily peel off your skin, turn your bones to dust, char your flesh and twist your limbs off.\"\n\n\n\"You need to happy, Karth,\" Drake grins. \"My jobs to navigate the ship, make sure we're not lost in the Warp, boarded by daemons or make sure we don't come out of the Warp and straight into the sun. If my life's not worth living, such as if someone peeled off my skin, turned my bones to dust, charred my flesh and twisted my limbs off, I'd just make sure this ship goes straight into a star.\"\n\n\n\"Just break him. The powers of the Warp will send you where you need to go. You don't need a Navigator. Tear this rat apart!\" Meliodas says.\n\n\nYou growl, walking out into the hallway, Drake floating after you. You quickly reach an elevator, tossing Drake inside. ", "action_results": [null]}]}, {"action": "Move forward", "result": "You step forward.\n\n\n\"I swear to all the Dark Gods, I will open this bitch up!\" Drake yells.\n\n\nYou move forward once again, before Drake slices the girl's throat open, blood dripping down her chest.\n\n\n\"Well. Now what?\" you ask.\n\n\n\"I... I'm necessary to operating the ship. You can't kill me.\"\n\n\n\"So be it,\" you say. \"You're coming with me.\"\n\n\n\"Sure, sure,\" Drake says. \n\n\nYou bind Drake's hands together with invisible chains, and force him to march forward. Drake immediately becomes compliant.\n\n\n\"Can I grab a few things?\" Drake asks. \"My... dreams get pretty bad. I have terrifying nightmares. I have medication that helps. Please, please can I get them?\" Drake asks.", "action_results": [null, null]}, {"action": "Telekinetically disarm Drake", "result": "With a narrowing of your eyes, the knife flies into your hands. The prostitute stands, shoving Drake away.\n\n\n\"Out,\" you command, as the prostitutes nods in thanks and leaves.\n\n\n\"OK, OK, you're skilled,\" you say.\n\n\n\"You're coming with me,\" you say.\n\n\n\"Sure, sure,\" Drake says, standing up.\n\n\nYou bind Drake's hands together with invisible chains, and force him to march forward. Drake immediately becomes compliant.\n\n\n\"Can I grab a few things?\" Drake asks. \"My... dreams get pretty bad. I have terrifying nightmares. I have medication that helps. Please, please can I get them?\" Drake asks.", "action_results": [null, null]}]}]}, {"action": "Teleport behind the enemy", "result": "You teleport behind the enemies, immediately sending out bursts of flames to incinerate those closest to you, before a shock of lightning runs through another. Still, this si close combat, their specialty. They move with incredible speed, dodging your blows. One gets in close, stabbing through through the neck. You shudder, blood running down your killer's blade, before your soul expires.", "action_results": []}]}, {"action": "Take out the chandelier", "result": "You look at the Troupe, before flexing your hand and grabbing hold of the chandelier and sending it hurtling into the staircase. Most of the Troupe dodge, but a few are too slow and crushed by the chandelier. You take a deep breath as the chandelier's candles go out, leaving you in total darkness. You focus, and you can still vaguely see the Warp presence of the Troupe. You need to wipe them out, and quickly.", "action_results": [{"action": "Fire a jet of flames", "result": "You fire a jet of flames out, engulfing a pair of Dancing Blades. Unfortunately, this has the side-effect of illuminating the room, and now being able to see, the Troupe strikes. Immediately, three of them are upon you. You fly out of the way of one and set the second alight, before the third leaps at you. You back out of their way, avoiding a sword blow, before you're stabbed through the back, and you collapse to your knees, before a blow takes your head off.", "action_results": []}, {"action": "Telekinetically send furniture at the Troupe", "result": "You feel their presence, slowly picking up the couch with your mind. The furniture flies towards them, and you feel their Warp presence flicker and die. You slowly move around the room, moving slowly and quietly, before you send a statue to crush another. You continue to move and weave, sending objects to crush and impale the Troupe. It only takes a minute before you hear the last one scream in pain as the dragon statue crushes them. You spray fire into the air, illuminating the room, just as she dies. Now, time to get back to the objective.", "action_results": [null]}]}, {"action": "Fire bolts of Psychic energy", "result": "You fire bolts of Psychic energy, but the Troupe easily dodges the blasts, leaping, ducking and jumping. You only manage to catch one, killing her instantly, before the Troupe strikes. Immediately, three of them are upon you. You fly out of the way of one and set the second alight, before the third leaps at you. You back out of their way, avoiding a sword blow, before you're stabbed through the back, and you collapse to your knees, before a blow takes your head off.", "action_results": []}]}]}, {"action": "\"I don't know the password, Kyros didn't tell me!\"", "result": "\"Bullshit. Kyros would've without a doubt told you the password. He's not an idiot. Fuck off, rebel scum.\"\n\n\nWell. That was unsuccessful.", "action_results": [{"action": "Attempt to break down the door", "result": "You press your hands on the door, and begin to melt through the thick steal, as steel drips to the ground. Suddenly, you feel your energy hit an odd texture, before the anti-personal defenses prepared their blows, tearing your head off.", "action_results": []}, {"action": "Try the intercom again", "result": "You press down on the button, and a voice crackles through.\n\n\n\"Do... do you think I don't know it's still you? There's a camera here, bud.\"", "action_results": [null]}]}, {"action": "\"I'm here to escort Amadeus to Kyros' chambers!\"", "result": "\"Bullshit. If Kyros wanted Amadeus, we would've got a message. Fuck off, rebel scum.\"\n\n\nWell. That was unsuccessful.", "action_results": [null, null]}, {"action": "\"I don't know the password. I'm here to kidnap Amadeus. Can you let me in?\"", "result": "\"Wh... what?\"\n\n\n\"I don't know the password because I'm not here on Kyros' orders. I'm here to kidnap Amadeus.\"\n\n\n\"It's just you out there.\"\n\n\n\"Correct,\" you reply.\n\n\n\"There's a shit ton of trained killers in here.\"\n\n\n\"Yeah, I know,\" you say.\n\n\n\"And you've come to kidnap Amadeus by yourself?\"2\n\n\n\"Yes,\" you confirm.\n\n\n\"Well, I respect your honesty. Come right in. I'm going to have to kill you, but fuck it, I'll open the door.\"\n\n\nThe doors clicks open. Well, that was... easy.", "action_results": [null]}]}, null]}, {"action": "Attempt to reason with them", "result": "\"Wait!\" you shout, preparing for the bolters to fire.\n\n\nSurprisingly, they don't. Well, time to reason with them.", "action_results": [{"action": "\"Abandon your weapons, or you die!\"", "result": "There's a brief pause, before the bolters fire. Bullets slam into your boy, one quickly finding your head and blowing it apart.", "action_results": []}, {"action": "\"I'm a loyalist to Kyros!\"", "result": "\"Well, what do we do, Sarge?\" someone asks.\n\n\n\"Fuck, if the mutiny succeeds and we're found with a loyalist, we'll be killed,\" another man answers.\n\n\n\"If we kill him and Kyros wins, we die.\"\n\n\n\"We'll say he asked to betray Kyros,\" the sergeant says.\n\n\nYou attempt to put up your shield, as the heavy bolters fire. You immediately raise your shields, as bolter fire thuds into them. You feel them, like a tapping on your mind. Unfortunately, by the sheer amount of bolter fire being shot at you, one finds it's way in. It slams into you, blowing your chest open. You collapse to your knees, as your shields fail as you lose focus. Bullets riddle your body, killing you instantly.", "action_results": []}, {"action": "\"The mutiny is going to succeed. Join us, or perish.\"", "result": "\"Fuck, what do we do, Sarge?\"\n\n\n\"The radio makes it sound like the loyalists are having their ass handed to them, and the prisoners are close to taking the complex! The psyker's right! Abandon post! Join the mutiny!\"\n\n\nThe guards lay down their bolters, and begin running towards the elevators. You shrug and allow them to pass, making your way down the hall. It's only a minute before you arrive at a massive, thick metal door with an intercom.", "action_results": [null, null]}]}]}]}]}]}]}, {"action": "Send Castus into the arena wall", "result": "As Castus swings his sword, you send him straight into the metal gate with a thud. He lets out a pained yelp, collapsing onto his stomach.\n\n\n\"I don't need to learn how to wield a sword, Castus. You've trained all your life with a sword. I never have. Yet look how simply I defeat you? I need a sword as much as you need fangs. I've evolved past the need for it,\" you say, as Castus stands.\n\n\n\"Fuck me, kid, couldn't you have made that point without breaking my fucking spine?\" Castus says. \"Yeah, fine, point proven. End of training, piss off.\"\n\n\n\"Terrific,\" you say. \"So, can I leave?\"\n\n\n\"Yeah, I'll call your guards here to open the gates and take you off,\" Castus says, grabbing a walkie-talkie hanging from his belt and speaking into it.\n\n\n\"Yeah, we're finished here with the little cunt,\" he says, rubbing his back. \"Oh shit, over.\"\n\n\n\"Affirmative, out,\" the voice comes back. \n\n\nSoon, the gate lifts up as your guards saunter out in their thick power armor. \n\n\n\"Where to next, boys?\" you ask.\n\n\n\"Shut it, psyker,\" one growls, looking at Castus and Olive. \"Is it back to the cells for you two?\"\n\n\n\"We're happy to practice some more here,\" Olive says, twirling her gun-axe to stop a surprise attack from Castus. \"I mean, if this dumb bastard has done so little practice to think that would take me down, he's go to need a lot more practice.\"\n\n\n\"Pffh, I'd like to see you take me down,\" Castus says.\n\n\n\"So be it,\" your captor growls. \"Move it, psyker.\"\n\n\nYou raise your hands defensively, and allow them to escort you back to your room.", "action_results": [null]}, {"action": "Teleport out of the way of the blow", "result": "You teleport behind Castus, causing him to smash his sword into the ground, Castus grunts in confusion as the force of his blow flying through the air causing him to stumble forward. \n\n\n\"I don't need to learn how to wield a sword, Castus. You've trained all your life with a sword. I never have. Yet look how simply I evade your blows? I could just teleport behind you and break your neck without lifting a finger. I need a sword as much as you need fangs. I've evolved past the need for it,\" you say, gently poking him in the back. \"Dead.\"\n\n\n\"Fair point, kid,\" Castus says, smiling. \" I like your style. I suppose you're good to go. End of training.\"\n\n\n\"Terrific,\" you say. \"So, can I leave?\"\n\n\n\"Yeah, I'll call your guards here to open the gates and take you off,\" Castus says, grabbing a walkie-talkie hanging from his belt and speaking into it.\n\n\n\"Yeah, we're finished here,\" he says. \"Oh shit, over.\"\n\n\n\"Affirmative, out,\" the voice comes back. \n\n\nSoon, the gate lifts up as your guards saunter out in their thick power armor. \n\n\n\"Where to next, boys?\" you ask.\n\n\n\"Shut it, psyker,\" one growls, looking at Castus and Olive. \"Is it back to the cells for you two?\"\n\n\n\"We're happy to practice some more here,\" Olive says, twirling her gun-axe to stop a surprise attack from Castus. \"I mean, if this dumb bastard has done so little practice to think that would take me down, he's go to need a lot more practice.\"\n\n\n\"Pffh, I'd like to see you take me down,\" Castus says.\n\n\n\"So be it,\" your captor growls. \"Move it, psyker.\"\n\n\nYou raise your hands defensively, and allow them to escort you back to your room.", "action_results": [null]}]}, {"action": "Get up yourself", "result": "You try to stand up, but Castus kicks you in the stomach again. You groan and collapse onto the floor, before Castus puts his foot on your head.\n\n\n\"Second rule: the first rule is bullshit. You know who doesn't trust anyone? Bastards like Kyros who ends up with no loyal friends, no allies, nothing, and then end up alone, with no one. If you want to survive in this world, you need allies.\"\n\n\nCastus offers his hand to you, which you accept. He pulls you up, before kneeing you in the stomach and tossing you to the ground.\n\n\n\"Come on, you're not learning. First rule: trust no one. Don't you listen?\"\n\n\n\"I was going my the second rule,\" you say, groaning.\n\n\n\"Sometimes, the first rule is more important than the second rule,\" Castus shrugs.\n\n\n\"How the fuck am I supposed to tell the difference between which rule to us?\" you ask, annoyed.\n\n\n\"Beats me. When you find out, you'll be the most powerful warlord in history. Until  then, you just go off gut feeling and intellect.\"\n\n\n\"Seems like a shitty system,\" you say, as Castus finally lets you stand up.\n\n\n\"Seems like a shitty world you're in. That system is the best I have to offer. Now, rule three: in hand to hand combat, go for the weak spots. The throat, eyes and balls are always good, but when it comes to half these fucks, I'd stick to the eyes, because past that, I don't know what you have left. Observe.\"\n\n\nCastus flips his sword so he holds the blade, wrapping his sleeve around the blade so it doesn't bite into his fingers as much. He steps forward, swinging his sword with insane speed. The pommel slams into your throat before jabbing you in the eyes, leaving you to stumble backwards. You quickly close your legs together before Castus jabs the pommel into your groin, and you collapse backwards with a pained yelp.\n\n\n\"See? Effective,\" Castus smiles. \"Rule four: you can win through many ways. Pain submission, incapacitating them, or simply taking their lives. Judge which can be used to take down your enemies. For instance, in your case, pain is the way forward.\"\n\n\nYou're growing tired of being hit in the face. As Castus steps forward with his sword raised, you decide you're going to do something to dissuade him from continuing to hit you. ", "action_results": [null, null, null]}]}, {"action": "Try to compromise", "result": "\"I can't guarantee you all that,\" you say. \"It's simply too expensive.\"\n\n\n\"What can you guarantee?\"\n\n\n\"Freedom, definitely as well as free reign to travel the ship. But we're not giving you free rooms, food, equipment and medical equipment as well as pay. Pick one.\"\n\n\n\"Fine, no pay,\" Olive says.\n\n\n\"That's a deal, then,\" you say.\n\n\nOlive extends a hand, which you grip and shake extensively. Castus extends his hand, which you grab, but he twists your arm around, causing you to yelp painfully. He kicks away your foot and sends you to your knee, before bringing his sword up to your throat.\n\n\n\"Dead,\" he says with a smile.\n\n\n\"Well shit, Castus, what's wrong with you?\"\n\n\n\"What? I was just preparing him for fighting. I thought we were supposed to be training him. First lesson, kid: trust no one. Now, get up.\"\n\n\nOlive offers you a hand, smiling.", "action_results": [null, null]}, {"action": "Convince Olive that Castus is right", "result": "\"Look, we can't guarantee anything. We don't know what's going to happen. Castus is right, we'd be killed if we don't rebel. Other than a chance, a simple chance, at freedom and life, I don't think we can start making deals for anything more,\" you say, putting all your energy into weaving an offer made almost entirely of bullshit.\n\n\nOlive narrows her eyes.\n\n\n\"Fine. But let me tell you this, if I find myself with the shit side of the stick, I'm going to cause a lot of problems.\"\n\n\n\"You can trust me,\" you say, as sincerely as possible.\n\n\n\"Fine,\" Olive says.\n\n\nOlive extends a hand, which you grip and shake extensively. Castus extends his hand, which you grab, but he twists your arm around, causing you to yelp painfully. He kicks away your foot and sends you to your knee, before bringing his sword up to your throat.\n\n\n\"Dead,\" he says with a smile.\n\n\n\"Well shit, Castus, what's wrong with you?\"\n\n\n\"What? I was just preparing him for fighting. I thought we were supposed to be training him. First lesson, kid: trust no one. Now, get up.\"\n\n\nOlive offers you a hand, smiling.", "action_results": [null, null]}, {"action": "Threaten Olive", "result": "\"No.\"\n\n\n\"Then I guess we have no deal to make,\" Olive says.\n\n\n\"No. I don't think you understand the nature of the offer I'm giving you. I'm letting you live. Whenever I want, I could have every single man under your command strangled to death by your collars, blown apart or force you to tear each other apart. You're going to follow my orders, or you're going to die.\"\n\n\n\"Fine, at least guarantee me that you're not going to have us all killed once the ship is taken.\"\n\n\n\"Sure, I can promise that,\" you say.\n\n\nOlive extends a hand, which you grip and shake extensively. Castus extends his hand, which you grab, but he twists your arm around, causing you to yelp painfully. He kicks away your foot and sends you to your knee, before bringing his sword up to your throat.\n\n\n\"Dead,\" he says with a smile, before slashing open your throat.\n\n\nYou gargle on your own blood, collapsing backwards.\n\n\n\"Well, that was easy,\" Castus says.\n\n\n\"Kill those fuckers!\" Meliodas snarls.\n\n\nYou raise your hand, focusing your mind, and Castus head snaps back, his neck breaking. Olive's eyes widen, before your send a fireball her way, consuming her in flames. You let out a final, desperate gasp, before your soul fades out.", "action_results": []}]}, {"action": "Catch the knife", "result": "You reach up and catch the knife, cutting your fingers with the blade, blood dripping down the blade.\n\n\n\"Good catch,\" Castus says. \"Try to catch the handle next time.\"\n\n\nYou grab the knife by it's handle with your other hand, licking your cut fingers clean. You hold the knife, stabbing it forward. \n\n\n\"What do you think?\" Castus asks. \n\n\n\"It's a knife,\" you say simply.\n\n\n\"Yeah, it is. Do you like it? Does it feel good?\" Castus says.\n\n\n\"I don't know anything about knives. Maybe,\" you say.\n\n\n\"Alright, first, we need to talk. Is anyone watching us? Like, are there cameras?\"\n\n\n\"No. Well yes, but they're offline,\" Olive says, resting her head on the butt of her axe-gun. \"What is it?\"\n\n\n\"A plan is being formed. We're going to escape.\"\n\n\n\"Escape?\" Olive says, musing. \"Who's on our side?\"\n\n\n\"We have a large amount of people on our side. Elios, Elizabeth and Durge are bringing the weight of their war-bands, as well as most, if not all, of the Guardsmen here. Then there's the Goliaths and the Tribals, both of whom are with us.\"\n\n\n\"What...?\"\n\n\n\"Because I've done this twice before, I best say. We have no plans yet. They're to be decided. We have literally nothing. We just need to check whether you'll join us. Then, we'll get the leaders together to plan our to take over, and what to do with once we've actually done so.\"\n\n\n\"Huh. Well, I'm in,\" Castus says.\n\n\n\"What?\" Olive asks, surprised.\n\n\n\"Yeah, I'm in,\" Castus says.\n\n\n\"We don't know the plan, we don't have any assurances that we won't be back-stabbed as soon as we take over, we...\"\n\n\n\"Olive, let's be smart here. If we don't rebel, we'll definitely either be killed fighting Kyros' war, killed trying to put down these fuckers' mutiny, or killed fighting another arena battle for these bastard's amusement.\"\n\n\n\"If we rebel, we'll almost certainly be killed!\"\n\n\n\"Almost certainly is way better than definitely. Plus, we'll get to kill a few of Kyros' bastards before we go down.\"\n\n\n\"Fine, I'm in, but I... we have a few demands,\" Olive says.\n\n\n\"Go on,\" you say.\n\n\nYou know the gladiators will be essential to your plans, so you really need to get them, but still, you don't want to devote to many resources to this issue. \n\n\n\"I want instant freedom once we take-over. No more being locked up under the arena. I want my men to have free reign to travel around the ship. I want pay, do the men and women who fight and work for the ship actually get something from it. I want an increase in food rations, and better equipment than the shit we're given. I want actual medical care, on top of this.\"\n\n\n\"That it?\" you ask, annoyed with her large demands.\n\n\nIt'll probably take a serious amount of resources to fulfill her request. You have a few options here.\n\n\n\"What a fucking greedy bitch. This fucker needs a dick, I tell you that,\" Meliodas complains.", "action_results": [null, null, null, null]}, {"action": "Levitate the knife towards you", "result": "You raise your hand, pausing the blade in mid-air and levitating it towards you, catching it's handle.\n\n\n\"Impressive party trick, kid,\" Castus says.\n\n\nYou take a practice stab with the knife.\n\n\n\"What do you think?\"\n\n\n\"It's a knife,\" you say simply.\n\n\n\"Yeah, it is. Do you like it? Does it feel good?\" Castus says.\n\n\n\"I don't know anything about knives. Maybe,\" you say.\n\n\n\"Alright, first, we need to talk. Is anyone watching us? Like, are there cameras?\"\n\n\n\"No. Well yes, but they're offline,\" Olive says, resting her head on the butt of her axe-gun. \"What is it?\"\n\n\n\"A plan is being formed. We're going to escape.\"\n\n\n\"Escape?\" Olive says, musing. \"Who's on our side?\"\n\n\n\"We have a large amount of people on our side. Elios, Elizabeth and Durge are bringing the weight of their war-bands, as well as most, if not all, of the Guardsmen here. Then there's the Goliaths and the Tribals, both of whom are with us.\"\n\n\n\"What...?\"\n\n\n\"Because I've done this twice before, I best say. We have no plans yet. They're to be decided. We have literally nothing. We just need to check whether you'll join us. Then, we'll get the leaders together to plan our to take over, and what to do with once we've actually done so.\"\n\n\n\"Huh. Well, I'm in,\" Castus says.\n\n\n\"What?\" Olive asks, surprised.\n\n\n\"Yeah, I'm in,\" Castus says.\n\n\n\"We don't know the plan, we don't have any assurances that we won't be back-stabbed as soon as we take over, we...\"\n\n\n\"Olive, let's be smart here. If we don't rebel, we'll definitely either be killed fighting Kyros' war, killed trying to put down these fuckers' mutiny, or killed fighting another arena battle for these bastard's amusement.\"\n\n\n\"If we rebel, we'll almost certainly be killed!\"\n\n\n\"Almost certainly is way better than definitely. Plus, we'll get to kill a few of Kyros' bastards before we go down.\"\n\n\n\"Fine, I'm in, but I... we have a few demands,\" Olive says.\n\n\n\"Go on,\" you say.\n\n\nYou know the gladiators will be essential to your plans, so you really need to get them, but still, you don't want to devote to many resources to this issue. \n\n\n\"I want instant freedom once we take-over. No more being locked up under the arena. I want my men to have free reign to travel around the ship. I want pay, do the men and women who fight and work for the ship actually get something from it. I want an increase in food rations, and better equipment than the shit we're given. I want actual medical care, on top of this.\"\n\n\n\"That it?\" you ask, annoyed with her large demands.\n\n\nIt'll probably take a serious amount of resources to fulfill her request. You have a few options here.\n\n\n\"What a fucking greedy bitch. This fucker needs a dick, I tell you that,\" Meliodas complains.", "action_results": [null, null, null, null]}]}, {"action": "Resist", "result": "You shake your head, struggling to avoid falling into unconsciousness. You take in a deep breath, flinging the warm hands away from your mind. Magos Cern continues pressing down on the plunger, shooting the remaining fluid into your blood. Your mind is gripped by a scream for sleep. Perhaps you should just embrace it.", "action_results": [{"action": "Resist", "result": "Magos Cern notices your struggle with indifference, refilling her syringe with anesthetic and injecting it into you again, although you can't feel the needle pierce your skin. Your eyes flutter before they roll in the back of your head. As you lose the fight to resist the void of oblivion, in the back of your mind you hear voices.\n\n\n\"Magos Cern, I polished the AI module.\"\n\n\n\"Good, Adept. You have gained one step forward in receiving your cybernetic upgrades.\"\n\n\n\"How long, master? My flesh is weak, my body frail, I crave the strength of steel.\"\n\n\n\"Soon, Adept, soon. Do not bother me in a time like this! We are on the brink of discovery! We have a mind older than the Emperor himself. Fifteen thousand years old! Can you imagine the knowledge it holds? Prepare Primus for start-up. I believe now is the time. I must just play with Kyros' pet's flesh, and then we will work.\"\n\n\n\"Yes, Magos. Understood, Magos.\"\n\n\nThen, you lose all resistance and sleep takes you, leaving you powerless in its dark embrace.\n\n\nYou awake an unknown time later, lying on the metal operating table. Magos Cern stands over you, washing her implements in a basin of water. She looks at you, her cold, red eyes peering into your soul.\n\n\n\"Ah, you're awake. Good,\" she says.\n\n\n\"What did you put into me?\" you ask.\n\n\n\"The biology of what I did is beyond you, flesh bag.\"\n\n\n\"Can you dumb it down for me?\" you ask.\n\n\n\"Could one reduce concertos to the mumbled grunts of mutants?\" Magos Cern asks indignantly.\n\n\n\"Please?\"\n\n\n\"Fine. I increased the size of your heart by 40% and lungs  by 12%, and added several veins and arteries leading directly to the brain from the heart. These actions increase the blood flow to your brain, and should hence increase psychic abilities. I added multiple microchips that breed monocytes, other white blood cells, platelets and other helpful things for your body. That was the bulk of my work. Other than that, it was just a medical check-up.\"\n\n\n\"OK,\" you say.\n\n\n\"I have a lot of important work to do, now. You should've had enough time to recover.\"\n\n\nTwo of your massive space marine guards arrive, a roaring face on their thick helmets.\n\n\n\"Here you are,\" Magos Cern says. \"Guards, make sure to walk slow. If at any point the patient starts puking blood, let him sit down for ten, maybe fifteen minutes.\"\n\n\n\"Shouldn't you keep him hearing for observation, then?\" one of the guards ask.\n\n\n\"I have far too much work to do,\" Magos Cern says. \"Don't disturb me. If anything goes wrong, go to Genetor Corivan. He is very experienced with medical matters.\"\n\n\n\"Yes, sir,\" the space marine says.\n\n\nMagos Cern quickly heads off, walking off to a row of elevators. The space marines stare at you, and you climb out of bed with a groan.\n\n\n\"Ah, my head,\" you say.\n\n\n\"You should have headaches for the next 48 hours,\" Magos Cern shouts, right before she disappears into an elevator. \n\n\nYou stand, feeling a rush of blood hit your head. You walk after the space marines, along halls and up and down elevators, until you find yourself in the arena. Castus and Olive are there, mid-battle with each other.\n\n\n\"Oh look, it's tweedle-dum and tweedle-fucking idiot,\" Meliodas says. \"Not even a laugh? Oh wait, you didn't grow up with nursery rhymes, you're from a Feral world. My bad.\"\n\n\nCastus swings his sword at her, while Olive swings her rifle-axe up at his head. He rolls out of the way, kicking Olive's foot away and sending her to her knee, before booting her in the head. She collapses down, before rolling out of the way to avoid a downward stab by Castus. She grabs Castus' sword handle and punches him. Castus falls backwards, before taking up a fighting stance. Olive begins circling him, her gun-axe at the ready. She spots you, smiling.\n\n\n\"Karth's here,\" she says.\n\n\n\"Bullshit,\" Castus says, readying his sword.\n\n\n\"Karth, tell him you're here,\" Olive says.\n\n\n\"Yeah, I'm here,\" you say. \n\n\nCastus turns to look at you, but Olive charges, swinging her gun-axe. She knocks the feet away from Castus, dropping his knee down on Castus stomach. Castus grunts before Olive grabs her gun-axe and holds it to Castus throat.\n\n\n\"Dead,\" she says.\n\n\n\"No fair, we were supposed to stop when Karth got here,\" Castus says.\n\n\n\"You're still dead,\" Olive smiles, standing up.\n\n\nCastus grabs Olive's wrist, pulling her forward so his sword pokes into her stomach.\n\n\n\"Dead,\" he smiles.\n\n\n\"Seriously?\" Olive says, rolling her eyes. \"Fine, I'm dead. Are we finished yet? The kid needs training.\"\n\n\n\"Fine,\" Castus shrugs. \"Let's start it.\"\n\n\nCastus draws a dagger from his belt, staring at it. The blade is a bright silver, with an odd pattern etched into it. It's handle is a bright, light blue, with a short, silver horn coming from the end of the handle.\n\n\n\"Now, this is an absolute beauty. I really don't use it enough, so it's yours. Xenos-origin, so even owning it is heresy. The blade is razor sharp, it could cut through flesh and bone easier than it could through air. Here.\"\n\n\nCastus turns, tossing the dagger straight at your head.", "action_results": [null, null, null]}, null]}]}, {"action": "Threaten Cain", "result": "\"No.\"\n\n\n\"No?\"\n\n\n\"No. I don't think you understand the nature of the offer I'm giving you. I'm letting you live. Whenever I want, I could have every single man under your command strangled to death by your collars, blown apart or force you to tear each other apart. You're going to follow my orders, or you're going to die.\"\n\n\nYou prepare yourself for Cain to strike, but he only lets out a low, rumbling growl.\n\n\n\"What was that?\" you ask suspiciously.\n\n\n\"An order,\" Cain snarls.\n\n\nSuddenly, a massive fist smashes into your back. You fly forward, smacking into the operating table and onto the ground. You let out a pitiful moan, before Cain puts his massive foot on your head.\n\n\n\"What orders do you have for me?\" he asks.\n\n\nCain attempts a triumphant yet terrifying smile. The corners of his mouth twist unnaturally high, revealing rows of serrated teeth, curved fangs, massive molars and many other weird, odd teeth, protruding from bloody, rotten gums. Cain raises his foot, before bringing it down and crushing your head.\n\n\n ", "action_results": []}]}, {"action": "\"I really like you, but as a friend.\"", "result": "\"Oh, yeah, yeah, I agree,\" Fay says. \"I feel the same way, I was actually really dreading telling you that, and I thought I'd have to tell you it now,  but since we feel the way, it's OK now.\"\n\n\n\"Oh, good, good.\"\n\n\n\"So, what was that other thing?\" Fay asks, rushing onto the next subject.\n\n\n\"Rebellion.\"\n\n\n\"Oh?\"\n\n\n\"Kyros is mad and paranoid. He's either going to slit our throats or send us on an endless string of suicide missions. We need to do something, and I really need your help. A group of collaborators have planned to rise up, and rid ourselves of Kyros. Then, we take over. I need the support of your Tribals to do so.\n\n\n\"Yeah, totally. Done.\"\n\n\n\"Done?\"\n\n\n\"Yeah. If we don't escape, we die here. Also, they're your Tribals as much as mine. Who else is in on this?\" Fay asks.\n\n\n\"Elios, Durge and Elizabeth are all in. No doubt Calpurnia's man will help us,\" you say.\n\n\n\"What about Cain and the twins?\"\n\n\n\"I haven't asked them yet, but we need to get them on board,\" you say. \n\n\n\"Do we hae a solid plan yet?\" Fay asks.\n\n\n\"Not yet. We need to find out how many people we have fighting for us.\"\n\n\n\"What happens after we take the ship,\" Fay asks, raising an eyebrow.\n\n\n\"That is still to be decided. Once we have Cain. Castus and Olive behind us, we'll have bargaining power. So you're in?\"\n\n\n\"I'm in,\" Fay nods. \"I'll have the message spread among the tribals.\"\n\n\nYou notice one of your guards walking towards you, carrying a tray. You motion for Fay to quiet down, as the guard arrives putting the tray down on the table.\n\n\n\"Eat,\" he says, in a cold voice like the scraping of a blade on rusted metal.\n\n\nYou look at your food. There's a bowl of noodles and strips of thin, cured meat, a small bowl of green jelly with chunks of odd, alien fruit inside, a large plastic cup of wine and a small, dense biscuit-like cake.\n\n\n\"Well, someone's being pampered,\" Fay says, smiling.\n\n\n\"Clearly I'm just more important than you,\" you gloat as you have a forkful of noodles and meat. \n\n\nFay grabs the biscuit cake from your tray, taking a bite.\n\n\n\"Hey!\" you say in annoyance, as Fay sticks her tongue out.\n\n\nYou quickly eat your meal, polishing off the entire tray and gulping down the wine. Then, Magos Cern arrives.\n\n\n\"Good, you've eaten,\" she says. \"These operations will be safer if you've had a full stomach.\"\n\n\n\"OK, I'm ready, let's go, you say. \"Bye, Fay. See you soon.\"\n\n\n\"See you later, Fay says, looking a bit sullen, as you wonder whether that put down was too forward.\n\n\nMagos Cern leads you out of the cafeteria and along the halls, off along halls and elevators. Eventually, you pass through the cyro-sleep section, arriving in a large operating room. Dozens of Goliaths are lying on the surgery tables, many halfway through surgery. A half dozen other Tech Priests wander around between the Goliaths, removing and adding flesh, bone, organs, cybernetic implants and other strange things.\n\n\n\"I didn't know there were other Tech Priests,\" you note.\n\n\n\"This ship is the size of a small moon. Did you think you've seen enough of it to accurately be able to say that we don't have something? I have scores of Tech Priests who followed me into the embrace of the Dark Gods,\" Magos Cern says.\n\n\nMagos Cern leads you to an operating table.\n\n\n\"This is yours. Please get undressed and wait here, I need to grab my materials and equipment. Stay here.\"\n\n\nMagos Cern turns around, walking off, leaving you alone. You spot Cain, lying on his operating table, his chest cut open to reveal still functioning organs. You wonder how he can still be alive with such a hastily cut-up torso, before you wince as you see his eyes dart towards you and you realize he's conscious. Looking to see Magos Cern hobbling away, you hop off the operating table and walk over to him.\n\n\n\"Commander Karth,\" Cain grunts. \"Need something?\"\n\n\n\"I have... an offer.\"\n\n\n\"An offer? An offer of what?\" Cain says, absent-mindedly picking at a cut alongside his... or at least, one of his stomachs.\n\n\n\"Freedom,\" you say, catching the monster's attention.\n\n\n\"Go on,\" Cain says, furrowing his scarred brow and causing a thin stream of blood to pour from his horns.\n\n\n\"We're planning an escape. We could use you and your men,\" you say.\n\n\n\"We?\"\n\n\n\"Elios, Durge, Elizabeth, Fay, others,\" you say. \"That's it, I think.\"\n\n\n\"When?\"\n\n\n\"We don't have details, yet. We need a head count before we can start planning it.\"\n\n\n\"Hmmm... I'm willing to give you control of my... \"Goliaths\", as you called them. But, I have a list of conditions that I want to be satisfied once we take the ship.\"\n\n\n\"Go on,\" you say.\n\n\n\"I want us to get names. Every Goliath who is capable of remembering and answering to a name will be called that instead of its serial number, by you and ALL other members of command. No more cyro-sleep. I want a bed for every single Goliath. I don't care if it's fine cloth or a slab of concrete, as long as it doesn't freeze them, it'll do us. I want free time that's not just killing.\"\n\n\n\"Anything else?\" you ask.\n\n\n\"That's it,\" Cain says, spitting out a serrated teeth that's fallen free from his jaw. \n\n\nCain's demands are far from unfair. Really, all he wants is slightly more rights for his Goliaths, which wouldn't even take any more resources. Still, you don't want the beast getting a big head. You ARE still in charge of not only his collar, but the collars of every single Goliath. All you need is a few threats, and the Goliaths will be yours.", "action_results": [null, null]}]}, {"action": "Disagree", "result": "\"No.\"\n\n\n\"No?\" Elios says, taken aback.\n\n\n\"I'm not joining you. He knows what you're planning. I'm not joining your death trap.\"\n\n\n\"So be it,\" he says, a sneer forming on his face. \n\n\nElios steps forward, knocking on the metal door. The guards open, immediately raising their bolters. Elios waves his hand.\n\n\n\"You didn't see me here. The voice of Slaanesh calls you, and you're his now. Move aside, and tell no one I was her,\" Elios says, strolling forward, leaving without looking at you.\n\n\nIn the next few weeks, you're quickly proven right. Elios is first. When he's found, he's had his limps slowly sanded off, before being thrown in a pit with mutants who tore him apart. A \"mysterious\" assassin attempts to kill Elizabeth, but Durge fends her off, only for a \"malfunction\" to destroy him the next day, incinerating him in a single blast. Elizabeth is killed by one of the ship's macro-cannons, taking out the shuttle they were going on, because of a sensor malfunction identifying it as hostile.\n\n\nWith his threats to power gone, the assault on the Imperium is on. The first few worlds fall with ease, as they're unprepared for the level of firepower that Kyros is bringing to the table. Still, issues arise. You're reinforced by those recruited from the conquered realms as well as throngs of war-bands coming to join your invasion. Still, Kyros gets greedy. He attempts to take on a Forge World, a world literally covered with layers of factories, run by the cyborg-engineers that are part of the machine-worshipping cult known as the Mechnicus. Kyros' grand plans to have a Forge World producing endless war machines are ruined when the planet's orbital defenses take out much of your fleet, and in the ensuing battle the factories are leveled. When Kyros finally takes the planet, it's nothing but a smoking rock.\n\n\nEverything falls apart after that. In a desperate attempt to capture geneseed stores to allow him to take over the home world of a Space Marine chapter known as the Horned Kings. The chapter is wiped out, but again Kyros gains nothing as the last act of the Chapter Master is to detonate their geneseed stores. \n\n\nAt this point, Kyros' forces are a pale shadow of their previous selves. Cain and most of the Goliaths were taken out as their landing pods were wiped out in an attempt to take the Forge World, and the gladiators are wiped out by a suicidal charge by the Iron Kings. They're not the only ones gone. Fay is killed, along with many of the tribals, in the Genesee stores' destruction. It's only at that point that you truly stop caring. Your tribe is gone, only a few faces so grief-stricken you can barely recognize them remaining. You don't care if you reach Terra. You don't care if you live. You don't care if you die. You just don't care, about anything. \n\n\nYou find yourself on some war-stricken world, killing. Scores of refugees are wiped out as your hand waves and warpfire spurts from the earth. Once, you would've have wanted to hurt innocents. You wouldn't have done it. Now, you feel nothing as you smell their cooked flesh. A Space Marine charges towards you, but you stare at him. The Space Marine screams as you force him to tear his own arms off, tossing them aside and having tentacles rapidly grow out of his arm sockets, before his mind is corrupted and he charges, roaring towards his allies as he begins to tear them apart. You  watch as a Dreadnought's legs buckle under your telekinesis, sending it toppling and tumbling down before it explodes. You levitate a Guardsman into the air as he howls in terror, be...\n\n\nThe earth shutters as artillery booms, sending you into the air. Artillery tears through the earth, and you slam into an APC. You hastily stand, to see dozens of refugees piling out of the crippled APC. You see to your surprise Tribals shooting at you and the other refugees, bullets thudding into the metal next to you, before they're killed by bolter fire. You look at your reflection in the half-broken window of a destroyed building, and realize why they were firing. With your now torn clothes and dirt-covered face, you are now indistinguishable from the refugees you've been killing.\n\n\nYou hear a dozen monstrous roars from your allies off towards your right, signifying a charge, before it's answered by the shouts of the Imperial Guard and Space Marine preparing a counter-charge. You could try to escape this. Hide amongst the refugees. Find a way out of this life. But what would be the point? You hear the charge nearing. Damn Kyros, putting you in this situation. Maybe you should be the one to finish his mad invasion? Or maybe you should return to what you know, and fight?", "action_results": [{"action": "Attack the Space Marines and Imperial Guard", "result": "Fear the Psyker\n\n\nYou turn, to see dozens of colored, heavily armored bodies making a charge. You let out a psychic scream, destroying eardrums and leaving the closest to you collapsing on the ground and howling in pain. You fire a long stream of flames, engulfing another two. From then on, it's a blur. Warpfire flies from you in a whirlwind of flaming death. Psychic electricity runs along your wrists and melts bone, fries skin and takes life. Bolts of energy take out any stupid enough to near you. You take fire, though. You dodge most, shield yourself from most of what remains, but a few get through. By the end of this, blood pours from your wounds and you feel the life drain from you. You continue fighting, breaking and shattering all those before you. Your life has become a blaze, burning all that nears to cinders. Like a blaze, it begins to blaze out. Eventually, you find yourself on your knees, continuing to wipe out dozens of your enemies, though lacking the strength to stand up. You let out a final roar, releasing a burst of psychic energy, before your soul is violently rendered from you.\n\n\nAlthough Kyros takes the planet, his forces are nothing more. They take two more worlds before being wiped out as the Ultramarines, Bronze-born and Lead Vipers wipe them out to the last man. Still, Kyros name is barely known. It's another name that becomes commonplace through the Imperium, as a terrifying reminder of why Psykers need to be crushed or imprisoned: Karth. ", "action_results": []}, {"action": "Attack Kyros' forces", "result": "Ending the Crusade\n\n\nYou turn, to see Chaos Space Marines, Traitor Guard, Mutants, Tribals, Goliaths and Gladiators charging onto the battle. Far in the distance, floating high above the forces, is Kyros. You know what needs to be done. You leap into the air, flying directly towards Kyros with a roar. You release waves of warpfire and psychic energy, killing dozens of people around you, but that's just a side-note to your main foe. You slam into Kyros, wrapping your hands around his throat. You begin to crush his throat, screaming, as Kyros immediately begin to activate your collar, strangling the life out of you. You don't care. You feel your trachea explode, but you don't care, you only keep strangling. As the two of you fight, you release waves of psychic energy, killing scores of men around you. You let out a scream, transfering all your energy into your hands, and Kyros screams in pain and terror, before you tear his head clean from his head. IN a final scream, you release your hold on line, adding all your remaining life and energy into the psychic blast Kyros releases upon his death, wiping out much of Kyros force.\n\n\nWith your move, Kyros' forces are stopped. Without a leader, they are broken on that planet. Magos Cern is taken down attempting to flee the planet, while Chapter Master Taj is killed in a suicidal charge. Kyros' forces take so many losses in you and Kyros' battle and are so confused that they're crushed by the following charge, leaving few alive. Guardsmen who survive note the suicidal rampage you went on with your final breath. Many wonder if, instilled with an ounce of the God-Emperor's courage, you sacrificed herself to take out the monster Kyros was and the monster he made you. Of course, these thoughts would be heresy, so known dare to even think it aloud in there head. Still, the belief persists, to whatever degree, that your death meant something.", "action_results": []}, {"action": "Hide amongst the refugees", "result": "You successfully hide amongst the refugees, and are transported to a nearby evacuation facility. You're given a cheap meal of Grox Jerky and soup, before being put into a massive fenced off area. Unfortunately, soon you learn that you overestimated how easy this would be.\n\n\n\"Ah, an inquisitor has arrived. We're going to die here.\" Meliodas says, as you hear his voice for the first time in a while.\n\n\nYou spot an Inquisitor, a heavily armored agent of the Imperium built for rooting out Chaos and Heresy. He stands, tall and heavily armored, a longsword glowing faintly blue clutched in one hand and a bolt pistol in the other. At his side is a grizzled soldier in Carapace armor holding a Flamer and snarling her scarred face as passer-bys, a man in browns robes holding a huge chainsword and a heavily cybernetically-upgraded Tech Priest. You wait patiently, attempting to hide every ounce of your power.\n\n\n\"It's not going to work,\" Meliodas says. \"He's going to find us. You're going to die here. You can get revenge, though. Let me take you. Let me take hold of your body, and open a pathway through the Warp. I can summon endless hordes of daemons to this world, wipe out that inquisitor, gain your vengeance, and allow me power. We have a chance now.\"\n\n\nHe strolls along, stopping next to you. He looks down, raising an eyebrow.\n\n\n\"Are we experiencing more Warp Storms, Engsineer Low?\" he asks.\n\n\n\"No, sir,\" the tech-priest says in a monotone voice.\n\n\nThe inquisitor rapidly raises a bolt pistol, aiming at you head as he swings the longsword.\n\n\n\"It's Karst! TAKE HIM DOWN!\" he screams.\n\n\n\"Now, now! We can crush them! You're already dead. They can be too!\" Meliodas howls in your mind.", "action_results": [{"action": "Face the bullets", "result": "You close your eyes, and soon, the world is taken away. You hope to find a peace in death you could never find in sleep.", "action_results": []}, {"action": "Try to reason with him", "result": "\"Wait! You...!\"\n\n\nThe inquisitor fires, and the bolts slam into your skull, ending your life. You hope to find a peace in death you could never find in sleep.", "action_results": []}, {"action": "Try to fight", "result": "You leap up, but the Inquisitor is trained for this. He knocks you back with a pychic blast, and the sword bites into your neck, draining your lifeforce and killing you instantly. You hope to find a peace in death you could never find in sleep.", "action_results": []}, {"action": "Follow Meliodas' plan", "result": "Daemonic Pawn\n\n\nYou release yourself, allowing Meliodas to take control. Your soul is burnt out, in a quick and slightly painful action, and your life is gone. You hope to find a peace in death you could never find in sleep.\n\n\nThe planet is soon overwhelmed. In the death of your soul, Meliodas opens a portal to the Warp. He manifests, alongside endless daemon armies. The inquisitor barely manages to react before he's wiped out. Soon, the world is taken. Ironically, a bitter alliance is formed between Kyros and the forces of the Imperium in an attempt to hold back the daemons who care not for Kyros' delusions of grandeur or supposed \"loyalty\" to the Dark Gods. Soon, the planet is theirs. The planet's populace is wiped out, and warp storms form, taking the planet back to the Chaos of the warp. The last sound on the planet, before it's plunged into the warp, is Meliodas' laughter. ", "action_results": []}]}, {"action": "Just walk into the battlefield and let it end", "result": "You stroll forward into the battlefield, watching as dozens of brightly colored and heavily armored Space Marines near you. They raise their weapons and fire, as others attempt to get to your with chainswords. You offer no resistance. You don't attempt to dodge the fire, or to block it, or even move. You feel the shells burst through, your organs being decimated. As you collapse back in a pool of blood, you hope death will give you the peace you could never get from sleep.", "action_results": []}]}]}]}]}]}, {"action": "Accept Kyros' decision", "result": "\"Fine,\" you say dejectedly.\n\n\n\"Jeez, Karth, your stubbornness will serve us well in time,\" Fay says, looking annoyed at you.\n\n\nYou arrive at the doors to your cell, and Kyros opens it.\n\n\n\"Very well,\" Kyros says. \"Inside.\"\n\n\nYou look at Fay, who smiles at you despite still looking annoyed.\n\n\n\"Bye, Karth,\" she says, giving a short little wave.\n\n\n\"Bye, Fay,\" you reply.\n\n\nThe doors are shut, and you walk over to your bed, collapsing on it. Only now do you realize how exhausted you are. You've spent all day walking, which again isn't exactly your specialty. You close your eyes, and soon sleep takes you. Thankfully, the twilight stage where your soul can rest and your exhausted mind can find peace, lasts extra long. Of course, it doesn't take long before the nightmares hit.", "action_results": [null]}]}]}, {"action": "Threaten them to ensure their loyalty", "result": "You walk slowly forward, growling.\n\n\n\"Magos Cern has told me about some rebellious behavior. It needs to end. We are a tiny fraction of the population of our ship. Even if we could somehow get all of our weapons, get everyone together and ready to fight, and we'd fail to get free. What could we do? We're light-years away from home by now. Even if, by some miracle, we could take this ship, we have no idea how to pilot it, and even then the chances of getting that far is astronomical. Kyros, the team leader, has amazing psychic powers. He could read our minds at any moment. He'd have you flayed alive and had the skin made into a cloak! He'll have this entire dorm filled with Chlorine gas! If you don't want to doom our entire tribe to non-existence, don't even think about rebelling.\"\n\n\nThe tribals seem a mixture of disappointed, angered and annoyed, but you know the see the logic in what you're saying. They won't rebel. They'll follow orders now.\n\n\n\"Tell the other tribals. I don't want anyone doing anything stupid,\" you say to the tribals, before turning to Fay. \"We should go.\"\n\n\nYou walk out of the room, quickly followed by Fay, who runs after you.\n\n\n\"That was a bit depressing,\" she admits.\n\n\n\"How so?\" you ask.\n\n\n\"You're not seriously happy with a life of service to a guy who kidnapped us? These guys killed Duggin!\" she asks.\n\n\n\"We need to be pragmatic. If there was an option for escape, I'd take it. But I'm not dying when there's no real chance of escape.\"\n\n\n\"Umm... I guess,\" Fay says, clearly unsure what to do.\n\n\nYou walk outside, where Kyros awaits, smiling.\n\n\n\"Ah, you're here. Were they convinced?\"\n\n\nYou nod eagerly, and Kyros smiles.\n\n\nWell done,\" he says. \"Now, we need to visit the last of your soldiers, the gladiator-slaves. They're always an interesting crew. Shall we go?\"\n\n\nYou look at Fay, who nods, although she still looks nervous from your earlier threats.\n\n\n\"Yes, let's,\" you reply.", "action_results": [null]}, {"action": "Convince the tribals that loyalty is the best option", "result": "You walk slowly forward, growling.\n\n\n\"Magos Cern has told me about some rebellious behavior. It needs to end. We are a tiny fraction of the population of our ship. Even if we could somehow get all of our weapons, get everyone together and ready to fight, and we'd fail to get free. What could we do? We're lightyears away from home by now. Even if, by some miracle, we could take this ship, we have no idea how to pilot it, and even then the chances of getting that far is astronomical. If we stay loyal, we'll survive. We'll prosper. Eventually, we'll be rewarded. We'll survive, we'll carve a little place in this hellish galaxy for us. Understood?\"\n\n\nThe tribals seem a mixture of disappointed and inspired. You know the see the logic in what you're saying. They won't rebel. They'll follow orders now.\n\n\n\"Tell the other tribals. I don't want anyone doing anything stupid. We need to do what's best,\" you say to the tribals, before turning to Fay. \"We should go.\"\n\n\nYou walk out of the room, quickly followed by Fay, who walks alongside after you.N\n\n\n\"That was a bit depressing,\" she admits.\n\n\n\"How so?\" you ask.\n\n\n\"You're not seriously happy with a life of service to a guy who kidnapped us? These guys killed Duggin!\" she asks.\n\n\n\"We need to be pragmatic. If there was an option for escape, I'd take it. But I'm not dying when there's no real chance of escape.\"\n\n\n\"Umm... I guess,\" Fay says, clearly unsure what to do.\n\n\nYou walk outside, where Kyros awaits, smiing.\n\n\n\"Are they convinced?\"\n\n\nYou nod eagerly, and he smiles.\n\n\n\"Terrific. Now, we need to visit the last of your soldiers, the gladiator-slaves. They're always an interesting crew. Shall we go?\"\n\n\nYou look at Fay, who nods.\n\n\n\"Yes, let's,\" you reply.", "action_results": [null]}, {"action": "Take Fay's suggestion", "result": "You walk forward, your voice dropping to a whisper.\n\n\n\"Look, we need to be practical. We can cause some minor trouble, a riot or two, kill a few guards at best. That leads to them just shutting off our dorms and pumping these rooms full of chlorine gas. We stay seemingly loyal, do what we're told, and wait. Eventually, when we have the chance, we strike. They won't expect it, and we'll have waited until the perfect opportunity. Then, we escape. Then, we gain freedom. Then, we gain a future. Got it?\"\n\n\nThere's hushed responses, as the tribals take a hopeful, inspired look. They won't rebel. They'll follow orders... for now. As soon as the chance rises though, you'll have a loyal group of soldiers to fight alongside you.\n\n\n\"Tell the other tribals. We need to stick togther\" you say to the tribals, before turning to Fay. \"We should go.\"\n\n\nYou walk out of the room, with Fay at your side, holding your hand.\n\n\n\"Well, I'm glad you took my suggestion,\" she says, smiling sweetly at you.\n\n\n\"Well, you're clever, so I should listen to your advise every once in a while,\" you reply.\n\n\n\"Stop teasing,\" she says, lightly hitting you. \"We all know how this relationship works. You're the brains, I'm the brawn. Not the other way around.\"\n\n\n\"Well, how come I can easily push you around?\" you say, flicking your wrist and sending Fay onto her rear.\n\n\n\"Hey!\" she says.\n\n\n\"Sorry,\" you say, laughing.\n\n\n\"You're a massive dick,\" she complains, as you lift her back to her feet.\n\n\nYou stop, the smile going from your face as you see Kyros walking quickly towards you.\n\n\n\"Ah, here you are. Is the issue resolved?\"\n\n\nYou nod, trying not to let him see you gulp nervously.\n\n\n\"Good. Now, we need to visit the last of your soldiers, the gladiator-slaves. They're always an interesting crew. Shall we go?\" Kyros asks.\n\n\nYou look at Fay, who nods, smiling at you.\n\n\n\"Yes, let's,\" you reply.", "action_results": [null]}]}]}]}, {"action": "Don't support the assault on Terra", "result": "You raise your hand, and Fay follows suit.\n\n\n\"You have balls of steel,\" Meliodas says. \"Unfortunately, now Kyros will tear them off, melt them down, turn them into a sword and fuck you up the arse.\"\n\n\n\"You fucking cunts! I lifted you up from the dirt! I gave you power! I gave you a future! I gave you all a future, and now you want to betray me?!\" Kyros screams, standing up. \"I won't let scum like you kill our chance at greatness! Loyal brothers, wipe them from the face of the earth!\"\n\n\nIn an instant, everything goes to hell. Kyros puts your collars on full, and your collar tightens incredibly. You feel your throat be crushed and the air run out as you helplessly grab at it, watching the carnage. Calpurnia stands, raising her bolt pistol, but Rebecca leaps up, driving her sword through Calpurnia's chest, killing her instantly. Elios moves with incredible speed, drawing a hidden blade and slicing open Taj's throat as the space marine attempts to raise his bolter. Then, Magos Cern sprays boiling gasoline from a pipe in the side of her head into Elios' face, burning him severely before she stands, driving a drill into his burned face as he falls backwards. Durge struggles to stand with his immense wait, but immediately moves forward, standing in front of Elizabeth in an attempt to shield her from Kyros' wrath.\n\n\n\"Elizabeth, get out of here!\" Durge says, as a panicked Elizabeth gets out of her seat. \n\n\n\"Durge, you miserable, plague-infested prick. You're going to die. You think you can save your sister? I'm going to cut off your spike-arms and drive them into both her eyes and then give her to the troops for a bit of fun.\"\n\n\nDurge roars, charging forward. The scene goes fuzzy as the lack of oxygen hits your brain and you feel your throat being crushed. All you see is the massive, blurry blob that is Durge explode, collapsing backwards, just as Elizabeth disappears, no doubt having teleported with some psychic ability she has. Kyros screams, but by now you're on the line between conscious. You reach a hand out, finding Fay's as she dies on the ground next to you. You hold her hand tightly as she squeezes back and the last bit of life leaves you.", "action_results": []}]}]}]}, null]}]}, null]}, null, null, null]}]}, null, null]}, null, null]}, null, null]}]}]}, null, null]}]}, null]}, null, null]}, null]}, null, null, null]}]}, null]}, null, null]}]}, null]}]}, null]}]}, null]}]}, null]}, null]}]}]}]}]}