{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=8035", "context": "", "first_story_block": "Its another day and you feel nothing...\n\nYou're 18 years old and very socially inept. Naturally you're not popular in high school, you're not even worthy to be routinely picked on. This isn't to say you aren't at all, but most people just find you very creepy and stay away from you. You're mom's strict upbringing has made you very emotionally detached and repressed. At this point you barely feel any kind of emotions at all.\n\nMaybe that changes today.\n\nYour Mom is calling you down to eat.", "action_results": [{"action": "Go downstairs", "result": "You head downstairs, like you always do. No point in breaking tradition.\n\nWhen you get downstairs your Mom is arguing with your 17 year old sister as usual. She isn't like you at all, she's popular for one thing, but then again being a very pretty and extroverted will do that for a person.\n\nShe's a bit of a wild child though which your domineering mother can't stand. You wonder why your sister acts the way she does, Mom's just trying to look out for her.\n\nThey're really arguing today.", "action_results": [{"action": "Sit down, eat and stay out of it", "result": "You sit and eat your breakfast quietly while the two argue as usual. It doesn't involve you, so why get into it?\n\n\"You little fucking whore! You keep staying out all night, and you can just forget about living under my roof! Go fucking sleep in the street with the rest of the sluts!\"\n\n\"Oh go fuck yourself Mom! You're just mad because you're a fucking bitter old harpy with nobody in your fucking life!\"\n\"Why you fucking little bitch!\" your Mom says and slaps your sister across the face.\n\nYour sister holds her face and shuts up. She picks up her school stuff and heads toward the door, before exiting she says one last thing, before slamming the door.\n\n\"Don't worry Mom, I'm not staying in this fucking house another day!\"\n\nYou finish up your breakfast, your Mom doesn't even acknowledge you're there, she leaves the kitchen in a huff rather quickly.\n\nShe must be really pissed.", "action_results": [{"action": "Head to school", "result": "Mom's strong, she doesn't need you checking up on her. You head to school as normal. What else would you do?\n\nYou get to school just in time for you to see Henry the school bully kicking the hell out of your \"friend\" Aaron. Aaron isn't so much your friend in that he's such a social reject that you're the only one who doesn't treat him like a leper, so he's attached himself to you. Of course you could really care less about him. Sometimes you wish he'd leave you alone, since he only makes you stand out more, when all you want to do is blend into the background.\n\n\"Get the fuck up you faggot!\" Henry shouts abusively at Aaron while kicking him gleefully.\nAaron looks at you in the hopes that you'll help.", "action_results": [{"action": "Go to class", "result": "Its between Henry and Aaron. Why get involved? Henry would just draw his attention to you, and you have no desire for that.\n\nYou go to your classes as usual and do your work again as usual. In your computer class you see Jessica. She's one of your sister's friends, but isn't as wild as most of them. Doesn't stop her from being a normal teenager though, assuming you had any idea of what normal is. You don't know what it is about her, but she stirs some kind of feeling inside you. She doesn't really know you at all, other than you're Mary's \"creepy\" brother.\n\nShe looks like she's having difficulty with today's computer lesson.", "action_results": [{"action": "Continue with your work", "result": "She's never made any effort to talk to you, so you don't feel the overwhelming need to talk to her. You continue with your work until that class is over.\n\nLunch time comes around, you expect Aaron to come sit next to you, but he's nowhere to be seen. You wonder if Henry beat him up so bad he had to go home.\n\nAs you sit by yourself eating quietly, you overhear Butch at the next table.\n\n\"Yeah that fucking bitch sucked my dick last night! Haw Haw!\"\n\nButch is your sister's jock boyfriend, even though they're constantly breaking up and making up. The break ups are mainly due to him cheating on her all the time, but she always ends up forgiving him. You don't know why, even you think your sister could do way better.\n\nRight now Butch is bragging to his buddies about his latest conquest, which apparently wasn't your sister.", "action_results": [{"action": "Finish eating and go to class", "result": "Your sister is aware of Butch's infidelity, its up to her to leave him. What good would it do to confront him? After all it isn't really your concern.\n\nYou finish eating and head back to class. On your way there, you pass Henry. Normally Henry doesn't bother with you, save the occasional name calling, but he's looking for a fight.\n\n\"Hey dickhead! I saw you looking at me kicking that faggot Aaron's ass! I know you two fucking butt boys hang out, aren't you pissed off that I kicked your boyfriend's ass?\" Henry says getting in your face and pushing you.", "action_results": [{"action": "Ignore him", "result": "You step aside and walk around him. Henry's a little surprised.\n\n\"Hey faggot, I'm talking to you bitch!\" he shouts as you continue to ignore him. Henry hits you in the back of the head with a thrown pencil which you continue to ignore. Sensing his actions aren't getting the desired effect, he stops harassing you.\n\"Fuck this creepy faggot.\" Henry mutters to himself and goes in search of different prey.\n\nYou attend the last of your classes and then leave the school. You run into your sister outside. She walks up to talk to you.\n\n\"Hey, I'm gonna stay with Butch tonight, and I think I might just stay over there permanently, his parents all cool enough to let me stay there. I'll be moving all my stuff out a little bit at a time, but I'll try to be quick, so you can tell that controlling bitch that she won't have to deal with me anymore.\"\n\nWow, your sister wasn't joking about moving out.", "action_results": [{"action": "Tell her you'll relay the message to Mom", "result": "You nod and say okay unemotionally. Your sister looks at you a little worried.\n\n\"You know, you should get out of that house too. I mean look at what Mom has done to you. You're a fucking emotionless robot! You just do everything Mom tells you. Is that really how you want to go through life?\"\n\nYou don't say anything.\n\n\"Look, take care of yourself and remember that you don't need to do everything that Mom says.\"\n\nShe hugs you goodbye and leaves.\n\nYou head back home and when Mom comes back home from work you explain what happened to your sister. Your Mom looks angry, but also relieved, almost as if having her out of the house is a blessing.\n\n\"Good, that little disobedient bitch can stay gone then. Well what are you doing still standing around for? You know you have work to do around the house!\"", "action_results": [{"action": "Do as Mom says", "result": "You do some cleaning and other chores, then you go up to your room and occupy your time until your Mom tells you to go to sleep, which you comply. You go to sleep until morning, then you wake up.\n\nIts another day and you feel nothing...", "action_results": []}, {"action": "Disobey Mom", "result": "You tell her no.\n\nShe slaps you. \"What was that?\"\n\nYou don't make anymore trouble, and do what you're told. Your sister's advice only got you punished, and what has her rebellious nature gotten her? She's been kicked out of the house. No, rules are made to be followed. To disobey invites punishment. You go to bed remembering that fact of life.\n\nAnother day arrives, and you feel nothing...", "action_results": []}]}, {"action": "Tell her that Butch has been cheating on her again", "result": "You suddenly realize that with your sister gone, you'll be the only one there to face Mom. Even you sense that isn't a good thing. Maybe underneath all your automaton type behavior you do have a certain sense of self-preservation. If anything you're concerned about the changes that your sister leaving might bring, and even though you might not show it, you fear change.\n\nYou tell your sister about Butch, she gets upset, but isn't really surprised. She'll probably break up with him, only to get back with him later. But for now its enough to convince her not to go move in with him. The status quo is kept in check.\n\nHome life continues as normal, your Mom yells at your sister and she yells back. There's something that is reassuring about that familiarity.\n\nAnother day arrives and you feel comfortably numb...", "action_results": []}]}, {"action": "Punch him", "result": "When Henry pushes you, you look confused at first, but then your expression turns to anger. Then your emotions soon follow...\n\nYou punch Henry straight in the nose causing it to explode in a gout of blood! Henry screams when he sees all that blood gushing from his nose. You don't just stop there though, you then take his pinky finger and break it. At this point you are drawing a crowd, while some others go to fetch a teacher.\n\nYou slam Henry's head into the hard ground until his skull cracks. Henry's already unconscious at this point, but you continue to kick him in the stomach until a teacher finally pulls you off, at which point to go quietly.\n\nThis act of wild unleashed anger gets you in severe trouble, namely prison for attempted murder. You don't seem to mind though, Its a structured environment that you're used to, and you welcome the chance to unleash your endless pent up anger on your fellow inmates.\n\nAnother day arrives in your cell you feel fury...", "action_results": []}, {"action": "Tell him you could care less about Aaron", "result": "Your detached answer, only causes Henry to believe that you're smarting off to him. He immediately kicks you in the balls and trust me you DO feel that!\n\nHe then drags you into the bathroom and beats the hell out of you and leaves you for dead. As you struggle to get your head out of the toilet you lose consciousness due to the massive gash in your head that's bleeding profusely.\n\nLater you're found by the janitor who manages to get you to a hospital just in time for you to live. Not in time for you to have not suffered brain damage though.\n\nOddly this has an interesting effect on your previous emotional condition. You revert back to a childlike state. Your Mom actually is nicer to you and in general, and sis seems to stop partying as much. Your unfortunate event has inadvertantly brought them closer to each other and to you. Of course you're unaware of such things, you just know that two pretty ladies take care of you.\n\nAnother day arrives and you feel playful...", "action_results": []}]}, {"action": "Confront Butch", "result": "Probably not the best time to act on your feelings...\n\nYou suddenly feel the need to defend your sister's honor by confronting Butch and his six football playing buddies. Needless to say, you don't win that confrontation.\n\nFor the most part you're more humilated than beaten beyond recognition. Still, its enough to deter you from displaying emotion ever again, you go back to your low profile emotionless lifestyle. Things are just easier that way for you.\n\nAnother day arrives and you feel nothing...", "action_results": []}]}, {"action": "Help Jessica", "result": "Under different circumstances, this might have worked, but your cold emotionless demeanor is still very much a part of you. When you approach Jessica to help her, she declines and gives you a funny look.\n\nYou go back to doing what you were doing. In fact you go about your usual routine for the rest of the day. The fact Jessica turned you down, seems to only make you supress your feelings and retreat into your own world even more. Eventually you go home and go to bed.\n\nAnother day arrives and you still feel nothing...", "action_results": []}]}, {"action": "Help Aaron", "result": "Sometimes attempting to do something positive doesn't work out.\n\nYou attempt to tell Henry to leave Aaron alone, but that doesn't help you. Henry just gets mad and attacks you instead. His anger for you interfering results in him beating you very badly. In fact you don't survive.\n\nOne last breath and then you feel nothing...", "action_results": []}]}, {"action": "Go check on Mom", "result": "For some reason you feel the urge to check on Mom, you head towards her room.\n\nShe's crying. You've never seen her like this! You've always known her to be a hard tough woman, its a little shocking to see this side of her.\n\nShe notices you and quickly wipes her eyes and reverts back to her old self.\n\n\"What the hell are you doing here?! Get the fuck to school!!\"", "action_results": [{"action": "Attempt to reach out to her", "result": "You ignore her abuse, you now know her lashing out is merely a reflection of her own unhappiness. You continue to ask what's wrong and that you're only here to help.\n\nYour genuine concern and her vulnerable state seems to cause her to open up a bit. She breaks down and says how, she's sorry for failing as a parent, and how she's losing your sister, and she doesn't want to lose you either.\n\nYou tell her if perhaps she was less controling, things might be better. You say you'll see what you can do about sis. Your Mom thanks you and after a few more hugs and reassurances, you rush off to school. On your way there, your emotions are a little less surpressed. You feel like you have a goal to accomplish now.\n\nYou get to school a little late, which results in you getting sent to the principal's office where you run into Henry, the school bully. He's there for beating someone up as usual. He gives you a dirty look and the finger.", "action_results": [{"action": "Attempt to reach out to him", "result": "That routine might work on those close to you, but not on anti-social miscreants who hate your guts!\n\nAs you attempt to ask why Henry feels the need to be hostile to everyone, his expression turns to repulsion. He thinks you're hitting on him.\n\n\"What the fuck are you, some fucking faggot or something?\" he says and then attacks you right in the principal's office! He beats you pretty bad before the principal manages to get him off of you. You end up having to go to the hospital.\n\nYour sister and Mom come to visit you and they get into an even bigger arguement resulting in a physical fight. Any goal you had of trying to patch up your family has been shattered forever. You don't seem to care anymore though, you realize playing peacemaker was a fool's quest anyway. Look what it got you. You fall asleep keeping that thought in mind.\n\nYou wake up the next day in your hospital bed and you feel nothing...", "action_results": []}, {"action": "Ignore him", "result": "You aren't here to be Gandhi and you aren't here to get into anymore trouble so you ignore Henry who gets called in soon.\n\nYou sit and think how you want a close family. One that isn't always fighting or being controling. You know you can patch your family up and make it functional rather than dysfunctional, you just have to figure out how to do it.\n\nIn the meantime the secretary tells you that the principal is going to be with Henry for a long time and since you're a fairly good student who never causes trouble, she says you can leave with a warning.\n\nYou go to lunch, still trying to figure out how to fix your family when over at the table behind you, you hear your sister's boyfriend Butch bragging to his friends about some girl he slept with who wasn't your sister.", "action_results": [{"action": "Confront Butch", "result": "Exposing your sister's cheating cad of a boyfriend was the right direction, but you definitely went the WRONG way about it.\n\nButch and his friends laugh at your attempt to convince him to confess to your sister or you'll do it.\n\nThey beat you and humilate you, then run off laughing. In a cruel twist you get sent to the principal's office again where he's less flexible. He assumes you're a trouble maker and suspends you effective immediately. You don't get a chance to talk to your sister, she and Butch take off early for some party. When your Mom gets home, your sister's run away event and your suspension put your Mom back in her usual hard ass mood. She screams at you and says your sister isn't her daughter anymore, can go to hell and stay there because she isn't welcome here anymore.\n\nYou've failed. Your attempts have been futile. You might as well not tried at all. You were the only one who really cared. You just thought that maybe if you had a more stable home life, you could feel like a normal person, but that goal is lost. You go to bed.\n\nAnother day arrives and you feel nothing...", "action_results": []}, {"action": "Keep quiet", "result": "You know that subtlety is going to be required here. This information can help bring your family together, but you have to do it right.\n\nYou attend your classes as usual, eventually school ends and you see your sister. You immediately reveal this information to her. She looks very upset, yet not entirely surprised. This certainly isn't the first time he's done this. She just keeps forgiving him, and taking him back. She was planning on staying with him to get away from Mom, but now she's conflicted.\n\nYou explain what happened with Mom after she left. Your sister looks skeptical, but knows even though you're a bit emotionless, you've never lied to her. Plus your latest deed has put you in better standing with her. Your sister agrees to give getting along with Mom a chance.\n\nYou both go home and wait for Mom to get off work. Mom arrives, she's a little more calmer, but you know this is a volitile situation.", "action_results": [{"action": "Stay", "result": "You all sit at the table, staring at each other. You're acting as a mediator. Mom and sis start out calmly, but it quickly escalates into name calling and criticism. The usual insults. You put a stop to it and demand that they get along! Family is the most important thing and you won't just let them dismiss it. You remind them both that things haven't always been this bad between them. You remind them of the good times that you all have had at one time. Good times that have occurred much too rarely and much too long ago.\n\nYou tell them you think that's why you shut down emotionally, because it was just easier to deal with the pain of seeing two people you care for in your life grow to hate each other so much. You say how you just want all of them to be a family again. You begin to weep.\n\nYour speech is probably the most emotional thing either of them has heard from you in years. Hell, they didn't even know you had any emotions anymore. You always did though they were just repressed, but no longer.\n\nYour Mom and sis also begin to cry at this point. Many apologies are exchanged.", "action_results": [{"action": "Say how happy you are", "result": "You wipe your tears and say how happy you are that you all have managed to at least come together on this night. Mom says she'll be less domineering and sis says she'll reign in her wild side. You hold both of their hands and say you know this all won't be easy, but you have faith that you're all on your way to being a family again.\n\nAnother day arrives and you feel happy...", "action_results": []}, {"action": "Group hug", "result": "You all gather in a circle and hug one another. This is the closest you've all been in years and its all thanks to you.\n\nAs you hug your Mom begins to rub her hands up and down your back, she then kisses you on the lips...passionately. You're a little surprised. Your sister then puts your hand on her ass, looks lovingly at Mom and kisses her as well.\n\nOf course! This makes sense now! You all alway felt greater intimacy for each other, but society's laws forbade it, and you all grew detached and hostile to each other because of it. But now that barrier has been shattered forever and you're able to pursue this love.\n\nThings eventually end up in the bedroom where you all express your love for each other in a physical way. You know that after tonight your family will be closer in ways you never dreamed about. After all family is the most important thing.\n\nAnother day arrives, you wake up beside your sister and Mom and you feel complete euphoria...", "action_results": []}]}, {"action": "Let Mom and sis work it out themselves", "result": "You seriously can't expect these two to work it out themselves without your help! You were the architect in all this and now you've just going to abandon your project? You're either naively optimistic or you don't want it bad enough. In either case your lack of commitment shows in a spectacular way.\n\nYour Mom and sister eventually start disagreeing in a physical way, when this occurs you attempt to break them up. Unfortunately Mom happened to have a butcher knife at the time, you get in the way and Mom accidently stabs you right in the throat.\n\nYou feel a sharp pain briefly then you feel nothing...", "action_results": []}]}]}]}, {"action": "Go to school", "result": "You obey and go to school. There was a real opportunity to change things here, but you failed to take advantage.\n\nThe rest of your day pretty much follows the same pattern until you come home and go to bed.\n\nAnother day arrives and you feel nothing...", "action_results": []}]}]}, {"action": "Side with Mom", "result": "You know Mom's just looking out for the best interest of your sister, and you say as much. Your Mom looks a little surprised as does your sister, who then gets really angry.\n\n\"Fuck the both of you! You don't know me! You're a fucking cold hearted bitch who's wallowing in her own loneliness and you're her fucking lap dog who does everything she says!\" you sister screams.\n\n\"Maybe because he actually cares about my feelings! Unlike you, you little slut!\" your Mom says and then slaps her. Your sister looks like she might attempt to slap your Mom back, but your presence stops her. Instead she runs out the door, with one last comment.\n\n“I’m leaving this fucking house of insanity! The both of you two can go straight to hell!” she says slamming the door.\n\nYour Mom waves her hand in disgust and then turns to you.\n\n“Thanks for taking my side. You’re such a good son.” She says and then hugs you, you return the gesture.\n\n“Okay now head off to school, I have to go to work.”", "action_results": [{"action": "Head to school", "result": "As you obey Mom, your budding emotions seem to shrink back again. Maybe it was just a fluke that you acted like you did, because you certainly don't display any follow up feelings towards Mom or anyone else the entire day.\n\nYour day follows as unemotional as usual until you go home and go to bed.\n\nAnother day arrives and you feel nothing...", "action_results": []}, {"action": "Ask Mom to drive you", "result": "Your Mom again looks surprised, but also a little happy.\n\n\"Well okay, its on my way to work. Are you sure you want me too though? Won't it embarass you in front of your friends?\"\n\nMom sure doesn't know you very well at all. You don't really have any. Of course even if you did, you wouldn't care.\n\nYour Mom drives you to school just like you remember she used to when you were little. She always seemed a lot happier back then. She almost looks that happy again right now.\n\nAs she drops you off, she lets you out, but before she does, she kisses you goodbye...on the lips.\n\nAs she drives off, you're left feeling a little strange. You've never been very emotional, but something in you has changed. You head to your classes a little preoccupied, until Jessica comes up to you in computer class.\n\n\"Hey, can you help me with this?\" she asks.", "action_results": [{"action": "Help Jessica", "result": "You kind of don't want to think about your Mom kissing you the way she did. It makes you uncomfortable. You take the opportunity to help Jessica to take your mind off of things.\n\nAs you help Jessica, she thanks you and becomes more friendly. She says she's always wondered about you, since you're very different than your sister who she's friends with. You open up a bit more than you normally would probably because you're still trying to get your mind off of Mom.\n\nIts probably what makes you blurt out asking Jessica for a date after school. Jessica's a little surprised, but accepts.\n\nWhen the class ends you realize you've just recieved a date with the one girl who seemed to stir some emotions in you. You begin to shake and rush to the bathroom to throw up. This is all a lot to take in. Your Mom kissed you on the lips and now you have a date with the girl of your dreams for all intense and purposes. You don't feel very hungry so you spend your lunch hour working on something for another class.\n\nYou attend the rest of your classes and eventually school comes to an end, and Jessica meets you outside.\n\nYour emotions are all mixed up and your mind is going a mile a minute.", "action_results": [{"action": "Take her home", "result": "You tell her you want her to meet your Mom. You still got her on your mind. You have to show her that what she wants can't occur! And by bringing Jessica home, you'll be able to show that. Of course you're really nervous about what's going to happen. You barely manage to keep yourself from throwing up again.\n\nJessica meanwhile is a little puzzled by your choice of \"date\" but agrees. You get home and you and Jessica talk for a little while longer getting to know each other better, but still in the back of your head you worry about Mom.\n\nThen she arrives. And she looks really surprised to see you with a girl in the house. Speechless in fact.", "action_results": [{"action": "Introduce Jessica", "result": "You muster up all your inner strength and introduce Jessica to Mom.\n\nMom is surprisingly cordial. You don't get it, you thought she'd be mad. Maybe she realized that what she wanted to pursue with you was wrong, and is glad you found someone to be with in a healthy relationship. Your nervousness decreases almost completely. Your Mom leaves you and Jessica alone, your previous niceness to her has put her in a good enough mood to let you have some fun, especially since you don't cause much trouble.\n\nEventually you take Jessica home, and despite having a rather strange first date, she agrees to see you tomorrow and you promise to really take her somewhere.\n\nYou go home thinking about today's events. You still have a great deal of devotion to your Mom, but are glad it wasn't taken to THAT level. You wonder though, Jessica looks a lot like your Mom when she was younger. Is that why you were attracted to her?\n\nYou don't want to dwell on that too much! You go to bed.\n\nAnother day arrives and you feel slightly warped...", "action_results": []}, {"action": "Beg for Mom's forgiveness", "result": "You suddenly lose it. You beg for Mom's forgiveness. Your devotion to your Mom is too great and if she wants you as a lover as well then you'll comply.\n\nYou say all this while groveling at her feet weeping. Jessica AND your Mom look at each other and then slowly back away from you.\n\nYou look up, and see Jessica run past your Mom and out the door saying \"Ewwwwww! I KNEW you were creepy!\"\n\nYour Mom tells you to stay away from her. You comply but you don't understand why. You thought she had those feelings for you. She asks where the hell did you get a sick fucking idea like that. You mention the kiss.\n\n\"It was a peck on the lips! Nothing more!\" Your Mom shouts. You suddenly feel very very small. You curl up in a ball not knowing what to think anymore.\nYour Mom sees that you need many years of professional help and eventually has you put away in an institution where drugs work wonders on your screwed up thought process. No more emotions. Back to normal.\n\nAnother day in your cell and you feel nothing...", "action_results": []}]}, {"action": "Go to the movies", "result": "You want to avoid Mom for as long as possible! You take Jessica to the movies.\n\nYou and Jessica get some food and sit to watch the film. You can't seem to relax. You're still anxious and nervous about going home. You begin not to feel well again. Just as Jessica asks you what's wrong, you puke up popcorn and gummy bears all over her.\n\n\"EWWWWWWWW!\" she screams and runs out of the theatre.\n\nNot really knowing what to do next you head home, still worrying over what Mom is going to do. When you get home, Mom sees you and starts screaming. She asks where the hell you've been. You say the movies, to which she screams at you some more for saying you never told her you were going there and you need to check in with her first. You'll be getting kicked out of the house like your sister, if you feel the need to disobey the rules she continues to say.\n\nThis seems like the Mom you know and are comfortable with! You guess you were mistaken about Mom's feelings towards you and that relieves you. You don't feel as nervous now, it reverts back into that familar numb feeling again. You decide that acting out of your normal routine was a great risk that nearly drove you over the edge. You won't be doing that again.\n\nAnother day arrives and once again you feel nothing...", "action_results": []}]}, {"action": "Ignore Jessica", "result": "You barely acknowledge Jessica's presence. She's one of your sister's friends anyway, which makes you even less inclined to help her. You say something about being really busy and having a lot to do on your own computer right now. As Jessica leaves, you continue to think about Mom, and that kiss.\n\nLunch time comes around and you sit to ponder it even more, fortunately without your idiot \"friend\" Aaron buzzing in your ear. You hear your sister's boyfriend Butch bragging at the next table about some chick he slept with last night, that apparently wasn't your sister. This is why your sister SHOULD listen to Mom! She knows what's best, and knows how to protect you from bad people.\n\nLunch ends and you attend the rest of your classes without incident. Finally after school lets out, you run into your sister. She sees you, but refuses to talk to you.", "action_results": [{"action": "Go talk to your sister", "result": "Even though you know your sister doesn't like Mom, she's still family, and needs to realize that Mom's only looking out for her. You have to convince her.\n\nYou go up to your sister who doesn't want anything to do with you after this morning, but you tell her what Butch was bragging about. She doesn't care and while she claims she doesn't believe you, you can tell she does, but her dislike for you and Mom is greater than Butch's infidelity. You start to get angry and start to yell at her saying that she doesn't know what's good for her, you attempt to get physical, but Butch stops you as he's coming out of the school.\n\nThis results in you picking up a nearby rock, and smacking him in the head with it a couple times knocking him to the ground, your sister runs off and you go chasing after her in an attempt to show her the \"light\".\n\nYou finally catch her in the park, where you give her an ultimatium of either obey Mom's rules or die. Your sister can't believe how over the edge you've gone until you start choking her. So enthusiastic you are to display your loyalty to Mom by \"punishing\" your sister, you don't even hear a passing police officer say \"GET YOUR HANDS OF THE GIRL OR I'LL SHOOT!\"\nThe officer was enthusiastic too.\n\nYou feel three bullets hit you in the body, one more in the head and then you feel nothing...", "action_results": []}, {"action": "Ignore her and go home", "result": "Your sister is hopeless. You feel anger towards your sister, you can see that she doesn't appreciate all the sacrifices Mom makes for her. You hope she does move out, that'll leave you and Mom more time to spend together.\n\nYou head home and wait for Mom to arrive. When she steps in, you hug her as she comes in the door, she hugs you back.\n\nShe tells you to do some chores, but you don't mind, in fact you're happy to do them. You and Mom talk a little more than you normally do at dinner, now that your sister is out of the way and not around to cause trouble everything is good, and you feel wanted for the first time in your life.\n\nYou talk into the night with her, until she tells you its time to go to bed.", "action_results": [{"action": "Go to bed", "result": "You do what Mom says and go to bed. You wonder if you should've pursued another path, with her, but you quickly dismiss such thoughts. You realize that if Mom wanted anything else from you, she would've told you. For now, she wants you to be a good and obedient son, just like you've always been. No strange thoughts, just total subservience to her. Submission of your will to her, emotions just make things more complicated. You make it a promise to yourself to do just that.\n\nAnother day breaks, and once again you feel nothing...", "action_results": []}, {"action": "Insist on talking more", "result": "You want to stay up all night talking with your Mom, you've never felt closer to her than you ever have in your entire life. Underneath her cold exterior, you can see a gentle and caring woman. She's just lonely...\n\nYour Mom says she has to go to work tomorrow and has to go to bed herself. She says you can stay up though if you want, but not to bitch about it when she wakes you up tomorrow.\n\nShe leaves, and you feel a little confused, you're not sure how to proceed.", "action_results": [{"action": "Watch TV", "result": "You sit and watch TV dejectedly and wonder about what just happened.\n\nCould it be that you imagined things? Let it run wild? You suddenly realize what has been occurring in your mind. And it isn't right. You realize you've been thinking VERY sick thoughts about your mother. You couldn't help it though, she seemed so nice to you today...\n\nBut no! You have to supress these feelings! Its the only way. you struggle all night with your derranged mind until you fall asleep with the TV still on.\n\nThe next day you awake, something's different...it worked.\n\nYou feel nothing...", "action_results": []}, {"action": "Follow her", "result": "You realize that she wants YOU to take the initiative! She already showed she was interested. She called you a good son, she kissed you, and now she's hinted about going to bed. It doesn't get anymore obvious to you.\n\nShe loves you the same way you love her...\n\nYou enter her room and see her sleeping. You slide into bed next to her. You feel like when you used to crawl into her bed when you were scared of the dark as a little kid. And much like then, you feel so safe being this close to her. She doesn't seem to mind, she cuddles up next to you, but she's still asleep.", "action_results": [{"action": "Go to sleep", "result": "You just want to be next to her. Nothing wrong with that. As you drift off to sleep, your Mom begins grinding even closer on to you. There's no doubt that she doesn't know who you are now...\n\nSomehow it doesn't matter. She wakes you up with a kiss. Her loneliness for physical pleasure is too great and her love for you is too strong. This feels so right to you. You realize why the girls at school never \"did it\" for you, it was always Mom you lusted for, you've always known, and now its all coming true. She begins to mount you and guides your hands all over her body. She is your teacher, she is your master, she is your life.\n\nYou and Mom spend a night of hot taboo passion as your virgin seed enters the very womb that bore you. You fall asleep nestled in her protective bosom, just like when you were a baby.\n\nThe next day you feel much different. You FEEL. You're not repressed anymore. Your love for your Mom, is now finally out and she knows about it and feels the same way. Of course this will have to be your little secret, but right now all that's important is:\n\nIts another day and you feel love...", "action_results": []}, {"action": "Take it one step further", "result": "You begin to caress and kiss her beautiful body. Your Mom begins to stir a little and opens her eyes...\n\nAnd is horrified!\n\n\"WHAT THE FUCK ARE YOU DOING?!!? I'M YOUR MOTHER YOU SICK FUCK!!!!\"\n\nYour mother throws you off of her and begins to beat you mercilessly!\n\nYou don't understand, you thought she loved you. You thought you understood...but it was all just a fantasy that YOU made up in your twisted mind. Your mother never hinted that she had any interest in you in that way! Even her kiss was just a peck on the lips. Nothing more, but you turned it into something else, along with everything else she did.\n\nYou feel betrayed, you did everything she ever said, only to find out she doesn't love you afterall. You feel rage like you've never felt before, you attack!\n\nYour Mom isn't like you though, she's strong with a fighting personality. She isn't a push over like you are. She throws a table lamp at your head as you attempt to assault her. As it smashes into your skull, you fall crashing to the ground unconscious.\n\nWhen you wake up, you're in a holding cell. A decision is still being made if you should be going to jail or a mental institution.\nIts ultimately decided that you belong in a mental institution. You're doped up silly for the rest of your life.\n\nOnce again, you feel nothing...", "action_results": []}]}]}]}]}]}]}, {"action": "Side with sis", "result": "You know, you've really had it with Mom picking on your sister all the time. Sure she's a little wild, but she isn't a slut and doesn't deserve to be called one, you tell Mom as much.\nYour sister and especially your Mom are both VERY surprised! Your Mom gets even angrier and slaps you!\n\n\"So both of you ungrateful shits turn against me! Get the fuck out of my house right now! NOW! And don't fucking return if you aren't going to live by my rules!\" She yells and storms out of the kitchen.\n\nYou and your sister leave, but as you both head off to school, she thanks you for taking her side.\n\n\"Thanks, its nice to have an ally for once against that fucking harpy!\"\n\nYou feel a little pleased. Its nice to be appreciated for once.\n\nWhen you get to school, you see Henry the school bully kicking the hell out of your \"friend\" Aaron. You don't really care for Aaron, but he looks at you in the hopes you'll help him.", "action_results": [{"action": "Help Aaron", "result": "You step up to Henry.\n\"What the fuck do you want faggot?\" he demands.\n\nYou don't even answer, you just punch Henry. Henry punches you back! Any other time you might run away, but this is different! Somehow when you stood up to Mom today, you feel a lot more confident! You and Henry begin to wrestle in the hallway, until a teacher breaks you up. Normally you'd get sent to the principal's office, but the teacher just yells at you instead. Aaron thanks you profusely and states how he'll do all your homework for you.\n\nYour sense of accomplishment grows. You like being praised for your deeds.\n\nWhen you get to your computer class, you notice that your sister's friend Jessica, is having problems with today's lesson.", "action_results": [{"action": "Help Jessica", "result": "You go up to Jessica and explain what she's doing wrong and how she NEEDS to be doing it. You proceed to take completely over.\n\nWhile Jessica wouldn't have minded your help, she doesn't particularly care for how you approached her. She didn't ASK you for your help and your arrogant manner has turned her off. And the fact you told her that she may \"thank you now\" made things even worse.\n\nYou've lost your shot at her, but that doesn't seem to bother you, the fact that she didn't praise the ground you walk on for your help, bothers you more. Some people are just ungrateful you guess.\n\nLunchtime comes around and Aaron begins thanking you again, for helping him. You enjoy his praise until you tire of him and tell him to shut up and get you another can of Coke, which he complies.\n\nAt this point you overhear your sister's boyfriend Butch brag to all his friends about some girl he slept with last night. A girl that wasn't your sister.\n\nYou wonder if you should confront him, but you don't see how this could be readily advantageous to you.", "action_results": [{"action": "Confront Butch", "result": "Your sister has been getting fucked around by this guy for too long. He constantly cheats on her and she always takes him back. Well it stops today, because YOU know what's best for her.\n\nYou immediately confront Butch, he turns around wondering what you want, and you tell him to stay away from your sister. He laughs in your face and tells you to fuck off. This once again prompts you to resort to violence.\n\nYou punch Butch in the face, but the guy's a jock, he can easily withstand anything you can dish out. Not to mention he's got six of his buddies to help him.\n\nThey beat the hell out of you and throw you in the Cafeteria garbage can, and take off laughing before an authority figure catches them.\nYou get sent to the principal's office for getting into your second fight today!\n\nAfter getting suspended for the next three days, you run into your sister outside of school who walks up to you pissed as hell.\n\n\"What the fuck did you think you were doing picking a fight with Butch?!\"\n\nYou attempt to explain, but she's not listening.\n\n\"He stopped doing that! He loves me! You're just trying to control my life! I heard about how you acted towards Jessica today. You're trying to dominate everything just like Mom!\"\n\nAt this point you get enraged with her, for not showing you the gratitude that you deserve! You tried to help her out and this is how she repays you?\nYou slap the shit out of her! She holds her face, hits you back and runs off crying, stating how she's moving out of the house.\n\nGood, you think, if she doesn't know what's good for her, she can get the fuck out.\n\nYou head back home and do what the hell you want, until that bitch you call Mom comes home. She immediately starts her shit.\n\n\"Don't think I haven't forgot about that shit you pulled this morning!\" she begins saying.", "action_results": [{"action": "Argue back with her", "result": "Mom's reign of domination ends fucking today. YOU'RE the fucking man of the house and she needs to recognize that NOW.\n\nYou call her every name in the book, as she returns in kind. She begins slapping you, threatening to kick you out of the house again. You push her down, and overpower her. All your repressed anger is directed towards her. And the shit you've ever had to put up with from her and everyone else is ALL directed at her.\n\nSHE NEVER APPRECIATED ANYTHING YOU EVER FUCKING DID!\n\nYou snap her neck, thus proving you're the dominant one here.\n\nYou feel a great emotional release, but then it disappears. Strange, killing her has completely deadened your emotions again.\n\nYou decide to go to bed.\n\nYou awaken to police taking you away. Your sister ended up coming home in the middle of the night to pick up some things, and she found Mom still laying on the floor where you left her.\n\n\nAnother day in your cell, and once again you feel nothing...", "action_results": []}, {"action": "Simmer and just take it", "result": "You say a few things back, but nothing too bad, you HAVE to live here and are too fearful of getting kicked out. Your Mom reads you the riot act and uses vulgar language that would shame a sailor. She verbally emasculates you to a degree that assures she's still in control of this house. All the feelings you had before fade. As quickly as gained your sense of \"rebellion\" your Mom has crushed it within a blink of an eye.\n\nYou go upstairs to bed, your spirit utterly crushed.\n\nAnother day arrives, and once again you feel nothing...", "action_results": []}]}, {"action": "Keep quiet", "result": "No advantange in getting your ass kicked by Butch and six of his friends. No you know what to do. You attend all your classes as usual and wait until after school where you rat on Butch to your sister. She's really upset and confronts him about it. As they start to argue, you see Aaron and tell him that if Butch gets rough with your sister, he should step in and help, since she'll find that attractive and might go out with him.\n\nPoor Aaron already blindly loyal to you, readily believes your lies and sure enough as soon as Butch grabs your sister, Aaron attempts to defend her and gets the shit beaten out of him very badly. Your sister see first hand the brutality of Butch and screams for someone to help, where upon one of the teachers from the school removes Butch and has someone call the paramedics for Aaron.\n\nButch will soon be paying legally for what he did to Aaron. For now though your sister is a bit distraught over all this, she's going to go home, despite the fact she'll have to face Mom.", "action_results": [{"action": "Go home", "result": "You decide its time to take control of the household. After all you're the fucking man of the house, and that bitch Mom of yours better realize that, besides the shift in power is in your favor with your sister on your firmly on your side now.\n\nYour prepare your sister for the coming confrontation with Mom, she looks less than excited to do it, but you helped her a lot today and agrees it needs to be done.\n\nWhen Mom comes home you immediately go on the offensive, totally catching her off guard. You do most of the fighting, your sister only piping up when you ask her to, you unleash a litany of cruel truths to your Mom. You mention how she's a lonely dried up over the hill woman who needs someone in her life because she's an unhappy person. So if she knows what's good for her she'll start treating you both with more respect. And that's just one of the things you say. Not that she isn't totally without ammo, but you feel actually energized by the battle. Like you're getting off on the conflict. Eventually you wear her down and she half-heartly gives in.\n\nYou know that your Mom is never going to be docile, but you've effectively changed the balance of power. You go to bed totally pleased by your victory. Your confidence transformed into arrogance and finally into outright manipulative nastiness.\n\nAnother day arrives and you feel like Mom...", "action_results": []}, {"action": "Stay out", "result": "Heh heh, let sis handle Mom, you're going to do something you've never done. Party all night!\n\nYou end up going to a club and even though you haven't really had any previous experience with these places or any other major social gathering you seem to fit in very well. It amazing how far your new outlook on life has taken you within a short period of time.\n\nYou realize that following all those rules was idiotic. You're going to have fun and anyone who tries to stop you is going to pay the price. Nobody is more important than you.\n\nYour home life changes quite a bit. Now its Mom yelling at you constantly rather than your sister, who seems to have calmed down quite a bit. Strange how things balance out.\n\nAnother day arrives and you feel rebellious...", "action_results": []}]}]}, {"action": "Ignore her", "result": "Jessica didn't ask for your help, and you don't want to make an annoyance of yourself, so you go to your seat and quietly do your work.\n\nSoon, Jessica comes up to you and asks you for your help, since she knows you're good with computers. You're glad to lend her a hand. You've always liked her to some degree even if you never showed it. Now you have the perfect opportunity to do so.\n\nAs you explain things to her you get the feeling she no longer thinks of you as your sister's \"creepy\" brother anymore. She really welcomes your help.\n\nClass ends and your confidence increases. You think you might even ask Jessica out tomorrow!\n\nLunchtime comes around and Aaron sits next to you as he normally does. He continues to thank you for what you did earlier. He says you've inspired him a bit.\n\nMeanwhile you happen to over hear your sister's boyfriend Butch, who's bragging about his sexual exploits to his friends.\n\n\"Yeah I fucked that bitch straight in the fucking ass last night! Haw Haw!\"\n\nYou're about to get up to defend your sister's honor, but suddenly you realize he's talking about a completely different girl. It appears Butch has been cheating on your sister again.", "action_results": [{"action": "Confront Butch", "result": "Butch has been treating your sister like this for too long. Its time to stand up to him, since she won't do it.\n\nYou immediately pull him aside and tell him to stay away from your sister.\nHe laughs in your face and pushes you to the ground. Then his six friends stand up...\n\nHowever your recent actions of defending Aaron cause him to try to help you out, by kicking Butch in the shin. Butch winces in pain, but immediately turns his attention to Aaron. He and his friends ignore you and beat the shit out of him. Seriously injuring him.\n\nThe following events occur due to your hubris...\n\nAaron has to be hospitalized and never fully recovers from suffering minor brain damage.\n\nButch and his friends are charged, but ultimately nothing comes of it, since most of their parents are rich and Aaron's weren't. Charges are dropped. They're all expelled and school is sued however.\n\nYou are also expelled since its determined that you started the fight in the first place, not to mention you your previous actions of fighting with Henry earlier that day, displays that you're a trouble maker.\n\nYou sister blames you for Butch dumping her permanently, despite the fact you were actually trying to help her.\n\nFinally Mom gets SUPER pissed off at you for causing all this shit, causing her to miss lots of work. She sets you straight by breaking your will once more which is rather easy since you blame yourself for all of what happened. If you hadn't indulged you emotions this all would've never came about. You make sure it won't happen again.\n\nAnother day arrives and once again you feel nothing...", "action_results": []}, {"action": "Keep quiet", "result": "Maybe you've gained a little more confidence in yourself, but you're not an idiot. You can see Butch has six of his friends there. They're all bigger and stronger than you, being on the football team and all.\n\nYou aren't going to let this go though. Lunch ends and you head to the rest of your classes as normal. After school you run into your sister, who looks happy to see you, until you mention what you heard Butch say.\n\nShe get mad, but not at you. She sees Butch coming out of the school and immediately confronts him and starts yelling at him. He starts yelling back.", "action_results": [{"action": "Stick around", "result": "You aren't just going to leave, you stick around just in case Butch gets violent. Good thing you did, his temper gets worse and he raises his hand to your sister, which you immediately stop. He turns and can't believe you would dare confront him.\n\n\"Huh! You think just because you kicked Henry's ass today, you think you're fucking tough shit? I'm gonna fucking kick your nuts up through your fucking throat! An there ain't no teachers around to break this up!\"\n\nButch swings at you and you dodge. You land some hits, but he's very strong. You feel a great crushing force to your stomach as he slams his fist into it. You fall trying to catch your breath, almost expecting him to finish you off, but Aaron comes out of no where and kicks him in the back of the head! Your earlier actions of defending Aaron have caused him to return the favor. He has distracted Butch long enough for you to punch him in the nuts as hard as you can three times.\n\nButch falls and is in no condition to do anything. Your sister then proceeds to tell him its over for good this time and kicks him a couple times as well.\n\nWell you've accomplished a lot today at school. You've become a real defender, all your previously repressed energy has been channeled positively. However, home still awaits you and you know who awaits you there.", "action_results": [{"action": "Go home", "result": "No point in avoiding it. You have to go home eventually. Your sister isn't staying out tonight, since she's just broken up with Butch. You take this opportunity to convince her that you should put up a united front against Mom. She agrees completely and says its about time Mom's tyranny came to an end.\n\nYou both get home, and psychologically prepare yourself for the battle with Mom, and then she enters the door...\n\nThe battle is joined! Mom starts in on both of you right away! Its a very intense and long arguement, but you have the confidence to finally stand up to her and you also have your sister to back you up. As much as Mom continues to threaten to throw you both out of the house, you can tell she's bluffing. She doesn't REALLY want either of you to leave her. If you guys weren't there, she'd have nobody around and then she'd truely be alone.\n\nThe arguement lasts into the night, but it finally ends, with you as the victor. Mom eventually half-heartedly gives in, but not before telling the both of you, what ungrateful brats you are.\n\nYou go to bed that night, with a complete and total feeling of liberation. You have confidence that you've never had before and you can FEEL. By god, you can finally feel!\n\nAnother day breaks, and you feel absolute joy.", "action_results": []}, {"action": "Stay out", "result": "It could be that you're feeling rebellious, or it could be that you're just not confident enough to stand up to your Mom in a knock down drag out arguement. That little one this morning will be nothing compared to what will await you tonight if you went home. After all you gotta live with her and she still commands a very intimidating presence. 18 years of indoctrination is hard to completely shake in one day.\n\nYour sister suggests a club that doesn't check IDs, since she isn't eager to go home either, but she won't be staying at Butch's anymore.", "action_results": [{"action": "Party time!", "result": "Well its not really your thing, but you don't really have any other ideas at this point, so you agree.\n\nThe bouncer at the club lets your sister in immediately when he sees her since she's a regular here. She explains you're with her, he doesn't seem to like you, but he lets you in.\n\nYour senses are instantly assaulted by loud music and flashing blinding lights.\n\n\"Woohoo! I'm getting liquored up tonight!\" your sister says and disappears into the crowd heading towards the bar.\n\nYou quietly sit in an empty booth, for some reason you start to feel a little less adventurous again. Less emotional. School was a \"controled environment\" This place is like a sensory overload to you. Too much chaos.\n\nYou sit and watch all the people going by engaging in various activities. Soon an incredibly friendly girl comes up to you wanting you to follow her.", "action_results": [{"action": "Follow her", "result": "You follow her on to the dance floor. You of course have no idea how to dance, but that doesn't seem to matter to the girl, who's grinding all over you.\nA few minute go by and you begin to realize this isn't that bad! You're starting to enjoy yourself. You guess it just took you a little time to get accustomed to this environment.\n\nIt seems the girl wants you to follow her somewhere else now...", "action_results": [{"action": "Follow her", "result": "You follow the girl into one of the bathrooms, specifically one of the stalls.\n\nStill a little naive about certain things, you're not exactly sure what's going to happen until she kneels in front of you...\n\nAfterwards, you feel a little bewildered about what happened. Its definitely not a common occurence for you. You can't say you didn't enjoy it though.\n\nYou leave the club and sneak back to your house, carefully not waking Mom up.\n\nYou go to bed, thinking about the unusual day and night you've had, and realizing that you should've been having fun like this in the first place.\n\nTime passes and things have improved for you at school. At home its a living hell. You argue with Mom as much as your sister does now, but nobody gets kicked out. You start staying out all night whoremongering, you also start to not feel well though in the coming months.\n\nAnother day arrives, and you feel deathly sick...", "action_results": []}, {"action": "Go do something else", "result": "You decide you don't want to spend the entire night dancing with one girl, so you spend the night looking for other girls to dance with. (Yes, you WERE oblivious to what the first girl had in mind!) You have fun without going overboard, and that's probably for the best since all this is brand new to you.\n\nEventually you leave the club and sneak back in your house, making sure you don't wake Mom up.\n\nYou lie in bed thinking about the unusual day and night you had and realize there isn't anything wrong with not following the rules ALL the time, and you also realize you're secure enough not to do something stupid. And Mom's just going to have to get used to that idea.\n\nAnother day arrives, and you finally feel normal...", "action_results": []}]}, {"action": "Stay put", "result": "Nope, you just can't get into it. Its all too much for you. You decline her offer and continue to just observe.\n\nPretty soon, you see your sister stumbling around, she's not drunk enough to pass out, but she is drunk enough to be acting like an idiot. You notice other guys attempting to take advantage of this fact, you step in, and start escorting her out. When you get outside, you half expect her to start yelling at you for ruining her fun, but she doesn't. Instead she starts getting all weepy. Stating how you've been looking out for her all day and that no guy has ever done that, since they all treat her like shit.\n\nYou tell her to just calm down and take her to the car. Since she's in no condition to drive (Though that's never stopped her before) As you put her in the back seat, she kisses you on the lips, with full tongue. You recoil back a bit in surprise.\n\nSurely its the alcohol...or is it?", "action_results": [{"action": "Drive her home", "result": "Alcohol definitely! You know that she gets pretty friendly after she's been drinking. You dismiss it. You can't possibly believe that she'd have that kind of interest in you. She may be a bit wild, but not to that extent!\n\nAs you drive back home, she falls asleep in the back, thanking you for looking out.\n\nYou get back home, unfortunately you're carrying your sister back in and you wake Mom up. She's pissed and iching for a fight. Normally her tirades would effect you more, but not after what you've been through. You're tired of her ordering everyone around, she has no idea how to REALLY look out for someone. If she did, your sister wouldn't be the mess she is.\n\nYou put your sister on the sofa, and yell at your Mom telling her she needs to stop acting like a fucking dictator and to start acting like a mother, because she's going to drive away the both of you if she keeps this up.\n\nYour words seem to have somewhat of an effect. Your Mom still doesn't want to admit defeat though, she says you're ALL going to talk about this tomorrow. You're tired, and don't want to argue anymore tonight, so you agree.\n\nYou head up to bed, realizing that your actions today have worn you out! Being a defender isn't easy. Its very taxing, but somehow you like it. Its much better than being the emotionless android you were acting like before. Its like you have a purpose in life now.\n\nAnother day breaks, and you feel fulfilled...", "action_results": []}, {"action": "Drive her \"home\"", "result": "That wasn't the alcohol. You know how much your sister can drink. And she hasn't drank nearly enough to not know what the hell she's doing.\n\nYou kiss her back, as she begins to take off her tight clothing. Suddenly it occurs to you that this is right. Your sister NEEDS someone to look out for her, otherwise she'll get into all kinds of trouble. All your helpful actions today have lead up to this moment. The natural progression of your relationship with her. You've always felt that you had a special connection with her, you're her balancer, her anchor if you will. That's why you were so repressed, you felt these emotions were wrong, but now you realize that was just society's rules being forced on you and its apparent that your sister had felt the same way, why else would she put herself in abusive relationships on purpose? She was attempting to run away from her own feelings in a different way. Well no more, tonight you both commit to your true feelings.\n\nYou and your sister proceed to make passionate forbidden love in the backseat of her car where you both fall asleep afterwards.\n\nThe next day when you wake up you both feel a little weird, but somehow satisfied. You don't say anything to each other, you both just slip your clothes back on and drive home. She holds your hand as you drive, occasionally smiling at you. You're fully prepared to hear Mom bitch at the both of you, but it doesn't matter anymore because together there's nobody that can get in your way.\n\nYes, its a brand new day, and you feel absolute contentment...", "action_results": []}]}]}, {"action": "Go find something else to do", "result": "That may be your sister's path, but it isn't yours. You decline the offer, and she tells you goodbye and thanks you for sticking up for her today.\n\nYou begin to walk around wondering where to go, where all of a sudden Jessica calls out to you.\n\nYou stop and wait for her to arrive, she says she heard what happened with Butch and she said she's glad to hear that your sister finally dumped him for good. Jessica had been telling your sister that for a year now, but she never listened to her.\n\nJessica seems impressed by your actions today, looks like you won't have to wait until tomorrow to ask her out, she's interested now!", "action_results": [{"action": "Go to the park", "result": "You decide to go for a nice leisurely walk in the park, you can get to know her as you talk and walk in the full bloom of nature.\n\nYou and Jessica are having a relatively good time, as the approaching evening makes the moon come out, making this \"date\" just a little bit more romantic.", "action_results": [{"action": "Find some place to make out", "result": "While you attempt to find a secluded spot, the approaching evening brings out bad elements of society. Particularly ones you've had run ins with today.\n\n\"Thought you were gonna get away with that shit? Bleed motherfucker!\" Henry shouts jumping out of nowhere and stabbing you repeatedly. Jessica attempts to help until he slaps her and begins to assault her.\n\nBeing a \"good guy\" has its drawbacks, the world is very unfair when people like you aren't allowed happiness, but that's life. As you lay bleeding to death, hearing Jessica's screams, you realize it would've been better for all, if you hadn't felt the need to turn into a crusader today.\n\nYou feel life ebb away then you feel nothing...", "action_results": []}, {"action": "Take her home", "result": "All these new feelings are still a bit overwhelming to you, so you decide not to take it to that level just yet. Besides you don’t really want to be hanging out in the park too long at night.\n\nYou take Jessica home who agrees to go out with you again and gives you a big kiss before she goes in which puts a perfect end to this day.\n\nYou sneak back to your house, carefully not waking Mom up. You know you’ll have to deal with her in the morning, but that doesn’t seem to bother you. You’ve accomplished a lot today and that fills you with a sense of achievement that you’ve never felt before.\n\nAnother day arrives and you feel triumphant…", "action_results": []}]}, {"action": "Go to her house", "result": "Her Mom works nights so you take advantage of the fact you won't be disturbed. You and Jessica have a good time getting to know each other a little better, a lot better in fact.\n\nOkay not THAT much better! Jessica may be a friend of your sister's, but she's not the \"free spirit\" she is. Jessica stops you from going any further and says she's just not ready to do that yet, especially since this is basically your first date!", "action_results": [{"action": "Get agressive", "result": "You know its always tragic to see how easy it is to fall from a positive path...\n\nMaybe it was your built up confidence crossing over to arrogance. Maybe you felt all your \"good deeds\" today should be \"rewarded\". Maybe it was just an overload of different emotions in one day from a previous complete lack of social interaction. Maybe it was a combination of all three factors as well as other ones, but your choice has lead you to perform a dispicable action, effectively erasing anything positive you've done today.\n\nAfterwards, you feel different, like something shut down inside your head. Perhaps it was a left over shred of morality reminding you of the evil you just committed. Whatever it was, you end up running off, leaving Jessica behind. You feel panic, fear, shame, regret, and disgust all at the same time. As these emotions assault you, you clutch your head, scream and end up collapsing in the park.\n\nYou're awakened the next morning by the police, who've been looking for you, you meekly and quietly go with them.\n\nIts a brand new day and you feel everlasting anguish...", "action_results": []}, {"action": "Respect her wishes", "result": "You didn't very well expect everything to go your way on your very first day of acting like a real person did you? Part of being a \"good guy\" is not necessarily expecting a \"reward\" for things you've done. Fortunately even with your low social skills you've realized this fact.\n\nYou tell Jessica how you can't wait to see her tomorrow, and how you'll take her on a real date after school. She says she looks forward to it and kisses you goodnight before you leave.\n\nAs you sneak back into your house, you think about how much you've changed in one day. For the most part you stood up against things you saw as unjust, yet you still recognized you have to have your own life as well. You'll still have to put up with your Mom's domineering personality and your sister is still a party animal, but you can't change people overnight, let alone the world. All you can do is TRY to do the right thing and hope everything works out for the best.\n\nAnd so far it looks like it's working out for you. Small victories will lead to bigger ones eventually, you know it will.\n\nAnother day arrives and you feel hopeful...", "action_results": []}]}]}]}]}, null]}]}]}, {"action": "Ignore him", "result": "You leave Aaron to his fate. Your emotions have become dead again. You just don't care anymore. What happened at the house was just an usual oddity in your \"normal\" behavior you guess.\n\nYou go through your day numb as usual, when you get home, Mom reads you the riot act for this morning. This only makes you realize that speaking out against her wasn't a good idea in the first place. You go to bed.\n\nAnother day arrives and you feel nothing...", "action_results": []}]}]}, {"action": "Stay in bed", "result": "You don't get up. Today is different somehow. You don't know why, but it is.\n\nYour mother is screaming at you to come down.\n\nIt doesn't even faze you. Her threats meaning nothing anymore.\n\nYou hear her coming up the stairs.", "action_results": [{"action": "Stay in bed", "result": "She enters the room, screaming at you as usual. You don't even hear her. You've heard it all before.\n\nShe begins to prod you, as you still lay in bed, oblivious to her. She shakes you and hits you, still nothing. Finally she drags you out of the bed and onto the floor...\n\nYou're totally catatonic.\n\nYour mom screams for your sister to help her, and some confusion occurs. You are completely still from the time, the ambulance come to pick you up, to the time you're put in the catatonia ward.\n\nAs you remain in your cell, you feel something. Freedom. Its ironic, in this place of walls and bars, and your catatonic state, you finally feel free. Your mind is completely free of the problems of the real world, and best of all free of Mom.\n\nAnother day arrives as you lay motionless in a bed and you feel free...", "action_results": []}, {"action": "Get ready for her", "result": "Your mother comes bursting in the room.\n\n\"What the fuck are you still doing in fucking bed? Its time for you to get your ass up and go to fucking school! What the fuck are you doing with your hands under the covers? Are you fucking jerking...\"\n\nBefore your mother can finish her rant, you flip your covers off and shoot her in the head.\n\nWow. You didn't realize you were that good of a shot, you weren't even aiming.\n\nYour mother slumps to the floor and you jump out of bed, fully dressed for today. You hear your sister running up the stairs screaming, wondering what's going on.", "action_results": [{"action": "Go meet your sister", "result": "You appear suddenly as your sister comes from around the corner of the stairs, she has just enough time to see Mom's dead body and the pistol you're aiming at her.\n\nYou shoot twice, the bullets can't miss at this range. Your sister goes flying down the stairs and is already dead by the time she hits the bottom.\n\nYep, today is a different day...", "action_results": [{"action": "Go to school", "result": "You collect all the other weapons you had stored in your room. You always knew this day would come.\n\nYou kiss your Mom and sister goodbye. It wasn't their fault, you just had to do it.\n\nJust like you have to do it again.\n\nTaking your Mom's car, you get to school, just in time to see your \"friend\" Aaron, getting beat up in the parking lot by the school bully Henry.\n\nYou double check your weapons before getting out of the car. Henry and Aaron both notice the amount of firepower you're packing.", "action_results": [{"action": "Dispense Mayhem", "result": "\"Hold on don't...\" Henry says before taking a shotgun slug to the chest, killing him instantly.\n\nAaron at first looks at you as a savior from his tormentor. His expression soon changes to fear when that same shotgun is then pointed at him, exploding his head like a ripe mellon.\n\nYour actions have now attracted a bit of attention. Students who were in the parking lot are now running for their lives or attempting to drive off.", "action_results": [{"action": "Enter the school through the gym", "result": "You run around to the back of the school in the attempts to do what you have to do as quickly as possible.\n\nYou throw the doors open and gym class is in full session. You see so many...targets. Your eyes especially focus on Butch. Your sister's boyfriend. You immeidately take out your sub-machine gun and begin spraying the place. Some escape, some die instantly, some lay wounded on the floor begging for mercy. You take the opportunity to shoot the wounded one by one in a calculating manner.\n\nYou do this very calmly. Like stepping on ants...\n\nButch attempts to crawl away, but you spray him again with bullets. He lies still in a bloody mess.\n\nAt this point, a majority of the school has been alerted of the things you're doing. The cops should be here shortly.\n\nYou make your way down the corridor...", "action_results": [{"action": "Head towards a classroom", "result": "You know EXACTLY which classroom to enter.\n\nYou go straight to it, shooting the janitor on the way there and a couple of students that you catch in the hallway.\n\nYou enter your designated target area. And its still full. The class was cowering, hoping you'd pass by, but fate was not with them today.\n\nYou see her. Jessica. Your sister's friend. She looks very frightened, but then again everyone in the class does.\n\nYou assess the situation with your shotgun in hand...", "action_results": [{"action": "You know what to do", "result": "There's no other way. You begin blasting the room with buckshot, and don't stop shooting until you're sure everyone is dead.\n\nThe room is covered in gore. You look at Jessica and kiss her blood soaked lips. There just wasn't enough time.\n\nYou exit the class room. You hear police sirens and bullhorns screaming at you to give up. Most of the school has been evacuated at this point.\n\nJust you alone in the school and the cops waiting for you outside now.", "action_results": [{"action": "Let's finish it", "result": "You reload all your weapons calmly and exit through the front door.\n\n\"DROP YOUR FUCKING WEAPONS NOW!\" you hear a cop shout.\n\nYou immediately open fire on them. You barely get off a few rounds before they fill you with lead, dropping you.\n\nYou fall to the ground, and breathe your last breath.\n\nNobody ever really knows why you did the terrible things you did that dark day. The only clue is the note they found in your pocket saying:\n\nI feel nothing...", "action_results": []}, {"action": "Surrender", "result": "Something over comes you. You suddenly feel a sense of self preservation. The only thing you HAVE felt during this bloody day.\n\nYou drop all your weapons and exit the school completely unarmed. The police quickly take you down and drag you away.\n\nYou feel completely numb during the trial, its ultimately decided that you're completely nuts to do what you did (Despite outcries for your death) so you are put in a mental institution. To this day nobody can figure out exactly why you did what you did.\n\nA reporter comes in to do a special on mass murderers and you were on the top on the list. He doesn't get too far with his questions though, he asks WHY you did it. You just say it had to be done. He asks you how you feel about killing all those people. But you give the same answer you gave at the trial\n\nYou feel nothing...", "action_results": []}]}, {"action": "It's all for her", "result": "There's no other way. You pull out your pistol and begin shooting people with deadly accuracy, until only you and Jessica are left.\n\nJessica is paralyzed with fear. She doesn't realize though, that this has all been for her. She never noticed you before. How much you cared for her. How much you loved her. Well she'll ALWAYS remember you now. You've made sure of that.\n\nAs she cowers and shakes expecting you to kill her, you hand her your pistol. She's too frightened. She just wants you to leave her alone. You have to help her.\n\nYou put the pistol in her hand and force her to squeeze the trigger until it releases its bullet into your heart.\n\nAt last you don't feel the nawing pain of unquenched love anymore.\n\nYou feel nothing...", "action_results": []}]}, {"action": "Try to escape now", "result": "Suddenly a sense of fear builds up inside you. You realize what you've done. You can't take what you've done back and worse you're not going to get away with it.\n\nYou begin to run. You don't know where to go though, so you head back home. You hear sirens. They're closing in.\n\nIts too much for you, you're afraid. You feel the fear, until you realize, you don't have to be afraid. At least not of death! Death is peace. Its unfeeling peace. You want that feeling again.\n\nYou sit down on the sofa and blow your brains out, just as the cops bust the door down. But they can't do anything to you now though because\n\nYou feel nothing...", "action_results": []}]}, {"action": "Attempt to stop escapees", "result": "You begin spraying the parking lot randomly, attempting to stop people from either running or driving off.\n\nPeople are screaming and ducking from the hail of bullets you're peeling off. People and cars are being hit indisciminately\n\nThe funny thing about shooting at a car, is the small possiblity of hitting the gas tank. The possibility of you going on a killing rampage today was actually greater than one of your bullets hitting a gas tank. Probabilty has played a strange role in today's events, because you succeeded in accomplishing both of those odds.\n\nUnfortunately you were standing too close to the explosion when the first car went up and igniting the others in a domino effect. (Thus accomplishing yet another small possibility)\n\nYou feel a painful burning sensation all over your body for a brief moment then\n\nYou feel nothing...", "action_results": []}]}, {"action": "Dispense Justice", "result": "\"Hey wait, no...\" Henry utters before you blast his internal organs to hamburger with your shotgun.\n\nAaron looks upon you as a savior. You are. You now know why you came to school. To right the injustices that have occurred. You immediately make your way to the gym. You see Butch, your sister's boyfriend. HE was responsible for leading your sister astray, most of the jocks in here deserve to die. Long have they taunted those they percieve as weaker.\n\nYou catch them completely off guard, you manage to blast Butch first and then pick off his friends as they attempt to run for their pathetic lives.\n\nYou then single out teachers who attempted to bully you with their \"Rules\". Their rules are meaningless to you. You serve a higher power. Justice. You sneer as one woman begs you not to kill her for the sake of her son. Her son will be much better off without the likes of her...\n\nPeople are running in terror from you, but its only because they FEAR the justice you may dispense if they are found guilty.\n\nThe police soon arrive and they are here to dispense their OWN brand of justice. You do not acknowledge this though. What you've done today, will be remembered, nobody can judge you and nobody will.\n\nYou turn one of your guns on yourself. You feel a great sense of pride, before squeezing the trigger.\n\nThen you feel nothing...", "action_results": []}]}, {"action": "End it now", "result": "You think about going to school, but you just don't feel like it. Its all so futile anyway. Everything. What you did didn't change anything, so why bother continuing with this pointless carnage?\n\nYou decide there is no point, you sit next to your Mom's body, calmly put the gun in your mouth and then\n\nYou feel nothing...", "action_results": []}]}, {"action": "Go out the window", "result": "You panic! You don't know what came over you. It was just her constant nagging, her verbal abuse, it just got to the point where you couldn't take it anymore. You don't want to kill anyone else.\n\nAs you attempt to go out your window, but your sister is already up the stairs and sees what you've done. She also calls out to you.\n\n\"Stop! You don't need to run away! Its okay. Just come back inside.\"", "action_results": [{"action": "Listen to your sister", "result": "You stop to listen to your sister, you're still scared and panicked, but she's never caused you harm.\n\n\"Its okay I understand, you just couldn't take it anymore. Look what she did to you...okay, I know what to do. You just have to stay calm for me okay?\" she says.\n\nYou shake and tremble, but you nod your head. She tells you she's going to leave for a little while, but she'll be back. You don't want her to go, but she says she has to, if she's going to help. You reluctantly agree.\n\nAfter sis leaves, its just you alone in the house with Mom's dead body.", "action_results": [{"action": "Try to hide it", "result": "Weird scenarios enter your head in your state of panic. What if some insistant vaccum salesman knocks on the door and demands to demonstrate his product? Or maybe someone checking for Radon levels in the house?\n\nYou have to hide the body!\n\nYou pick Mom up, trying to figure out where to put her. You decide your closet, unfortunately your closet is full of crap, so you attempt to stuff her in there throwing your entire body into it. As you begin to breathe hard, you catch the fragrence of the perfume still lingering on her body, you notice her dress has been lifted up as you've been attempting to shove her in your closet. You're aroused as you also notice you're positioned between her legs, you begin to have BAD thoughts as you stroke her thighs.\n\nYou can't stop yourself...\n\nDuring this completely immoral act, you don't feel panic anymore, you feel power. Total power. All that shit she did to you, you're returning in kind. Now YOU have the power over her. You feel so fuckin' alive!\n\nAs you finish up, you hear your sister come back home.", "action_results": [{"action": "Demonstrate your power again", "result": "You calm yourself, quickly get your pants back on, and head downstairs.\n\nYour sister seems to have gone shopping for \"body disposing\" supplies. How thoughtful. She explains that Mom's body could be disposed of, and it sounds like sis has thought about killing the bitch herself, but was too weak to do it. Her weakness sickens you...\n\nYou grab the shovel and smash your sister in the face with it until you're pretty sure she's not moving anymore. You feel that orgasmic rush again. No panic at all this time. No fear. Just a release.\n\nYou've at last realized your repressed emotions have never really been repressed. You just don't have any, at least not in the traditional sense. You only feel rage and loathing for those who would try to control you and contempt and disgust for those weaker than you. You only feel happy when you kill. And you want to feel happy ALL the time...\n\nYou pack up as much of your things as you can and prepare to leave for the road tomorrow.\n\nTomorrow arrives and you feel unrelenting hate...", "action_results": []}, {"action": "Try to place the body back and act like nothing has happend", "result": "Suddenly you begin to panic again, and you start to fumble with Mom's body which has obviously been violated with the ripped up clothing and all. Of course even without that evidence, you standing over her with your pants off is enough for your sister to draw her own conclusions when she walks in on your attempt to make things \"normal\" again.\n\nYour sister won't help you with this. Instead of looking like a sympathetic emotionally abused victim who was driven over the edge, you now look like a sick homicidal incestuous necrophiliac (And you are)\n\nShe screams and runs out of the house before you can stop her. You know she's going to get the police and you can't say you blame her. You're revolted by your actions. You throw up.\n\nYou don't know why you did the things you did today, but you're sorry you did. You begin to cry and scream as your tortured mind attempts to make sense of the situation, up until the time the police take you away.\n\nEventually it's decided you should be in a mental institution, it doesn't matter to you though since all you want to do is die.\n\nAnother day arrives, you wake up in your cell and feel torment...", "action_results": []}]}, {"action": "Leave it where it is", "result": "You don't even want to look at it, let alone touch it. Besides sis told you everything would be okay if you just stayed calm. You downstairs to watch TV, but you start to worry about where your sister is at. You begin to panic again, you feel so lost.", "action_results": [{"action": "Run", "result": "You totally lose it! You know your sister went to go get the cops! They're probably on their way here right now! You run like a mad man down the street until you pass out from hyperventilation.\n\nWhen you wake up, your sister is standing over you, scolding you for running off like that. You were fortunate that she saw you lying face first on the sidewalk. This doesn't reassure you though and you continue to gibber about being caught. Your sister gets irritated by your behavior and ends up having to dispose of the body herself. Later a story is made up that your Mom just up and left and never came back, unfortunately your constant nevousness give you away and you blab everything.\n\nBoth of you get charged, but since your sister never actually killed anyone, she get a lesser sentence. You feel completely relieved by all this even though you're going to jail for life. The fear and panic have left you, and have been replaced by a welcomed numbness again.\n\nAnother day arrives in your cell and you feel nothing...", "action_results": []}, {"action": "Wait", "result": "You wait patiently because you were told to do so. Something about realizing that makes you a lot calmer.\n\nYour sister returns with \"body disposing\" items. She says you could either chop her up in the bathtub and then dispose of her in garbage bags or just wait until night and bury her in the backyard.\n\nIt almost looks as if your sister had thought about doing it herself at one time. You hadn't even planned it out that far. You tell your sister whatever she thinks is best, but you'll carry it out whatever she decides.\n\nAfter she makes her decision, you go about performing the duty casually. Its almost as if you feel like yourself again. Later your sister makes up an elaborate story about your Mom's disappearance, you back her up without any problems and it is believed.\n\nLife continues as normal for the both of you, sis feels complete freedom to do what she wants and you take care of the more mundane matters that she tells you to do when she doesn't feel like bothering to do them (Which is all the time)\n\nYou now know why you felt fear and panic after you killed your Mom. It was because after so many years of being told what to do you'd destroyed your shackles. Freedom can be frightening and you realized it wasn't for you. Thank god sis has taken over Mom's role now. Its not exactly the same, but its calmer and secure.\n\nAnother day arrives and you feel safe...", "action_results": []}]}]}, {"action": "Continue out the window", "result": "You're still too scared, you go out the window and try to climb down, unfortunately your panic prevents you from climbing as efficiently as you'd like.\n\nYou fall off and impale yourself through the chest on the fence surrounding Mom's rose bushes. You gasp for breath, coughing up blood. You feel fear overwhelm you as you approach death.\n\nThen you feel nothing...", "action_results": []}]}]}]}]}