{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=57114", "context": "", "first_story_block": "Everything hurts.\n\nWaking up is as bad as it usually is. Aches and pains along with a soured stomach are things you expect after chasing the dragon, though you usually don't have a screaming headache like the one currently pounding beneath your skull. The floor beneath you is cold and dirty, concrete that hasn't been cleaned in years. This isn't the first time you've woken up in some abandoned building you can't remember going to, but as your eyes slowly come into focus you aren't so sure if this really is the norm or not.\n\nThe light in the room comes from candles placed around the place, sitting on pieces of abandoned furniture, crates, and tables. The walls are decrepit, covered in graffiti and stained filth. It wasn't really that unusual to wake up in a place like this. Junkies love abandoned buildings and it is kind of nice to ride out a high in a nice candlelit room instead of a pitch black one. Whoever set out the candles didn't think to toss down a mattress though, a shame really.\n\nYou don't quite feel like getting up just yet, but the sooner you do the sooner you can make some cash to score another dose.\n\nStanding up, you flap your arms a bit in an attempt to rid yourself of the numb, tingling sensation that seems ever present in them now. You really should start injecting elsewhere, but what does it really matter at this point? The crooks of your elbows look like shit and that won't change. Sure it hurts like a bitch to stick a needle there now, but the reward after is worth it.\n\nLooking around at the flickering candles, you notice that there are pictures hanging from the ceiling on strings or placed around the candles. Shuffling toward one half rotten table, you pick up one of the photographs. It isn't easy to see in the dim lighting, but as you hold it up in one hand and a candle in the other you recognize it. It's been years since you've seen this picture. A family portrait from when you were just a kid. One corner of it is torn, effectively removing one person from the picture.\n\nSwearing under your breath, you pick up other pictures and frown as you see that all of them are of you or people you know. Childhood photos of yourself and your parents, pictures of an old boyfriend, pictures of friends you haven't heard from in a decade or more.\n\nAs you continue sorting through all of the photographs, you come across a tape recorder with a small cassette already loaded inside of it.", "action_results": [{"action": "Listen To The Tape", "result": "Pressing the play button, you hear a voice start speaking from the recording. It's clearly been distorted, but you can hear the words well enough.\n\n\"Hello, Ciara. For most of your life, you have been a victim. But, you have never truly tried to rise above this victim status you have held for so long. Within this room, are photographs of your childhood. Your pictures progress from a happy little girl to that of a criminal, but what fueled this change? For years you have been too busy blaming others and using past wrongs against you as an excuse for your own misdeeds. Today, you will face your inner demons. Beyond the door of this room wait a series of tests. But, first, you must prove to yourself that your life is worth more than the addiction that rules it. The door out is locked and the key is within your reach, so is your drug of choice. Will you reach for the key to your freedom or will you stay a slave to your addiction? Live or die, Ciara, make your choice.\"\n\nThe tape goes silent as you feel fear start to take over the haze of cravings and the pounding of the migraine in the back of your skull. Looking around, you spot the door and hurry to it. Just as the tape said, it is locked with a heavy bolt. You've never seen a door like this before, it's solid steel and doesn't budge when you push against it. The bolt has a keyhole in it, but you don't see a key anywhere.\n\nLooking around, all you can see are pictures hanging up illuminated by the flickering candlelight, some photographs on a crate surrounding by a circle of candles on the floor, and what looks like a binder laying on the floor in a dark corner of the room.", "action_results": [{"action": "Look At The Hanging Photographs", "result": "You pluck the hanging pictures from the strings, tossing them to the floor as you go. None of them seem particularly significant. Each one is a picture of your child self, teen self, or mugshots. Scratching at your arms, you stop to gaze at one from when you were in high school. The girl in the picture is beautiful and smiling, but you know better than to be fooled. You remember what it felt like to force the smile for that picture, what was going on behind the pearly white grin.\n\nLetting the picture fall to the ground, you continue around the room until you have looked at all the pictures that were hanging from the ceiling. None of them seem to be of consequence really, but it does feel strange to look at them all.", "action_results": [null]}, {"action": "Look At The Photographs On The Crate", "result": "Walking over the crate encircled by candles, you pick up a few of the pictures on top. They're all family pictures of you and your parents, plus a few with old friends from your childhood. All people that you have long since left behind. What good had any of them ever done you after all? It certainly seems fitting that they are here in picture form to mock you while you are trapped in this room.\n\nAs you pick up the last picture you find yourself staring at a picture of you and your stepfather. His arm is laxily draped over your shoulder and he smiles for the camera, you smile as well for the picture. But there is a tenseness to your face. Flipping it over, you see there is a note scrawled on the back in neat handwriting.\n\nLook beneath the facade\n\nFrowning, you glance around the room again. It isn't that hard to follow the note's instructions. You had spent your entire childhood maintaining a facade, you can see through it in every single picture here. The forced smiles, the tense posture, the baggy clothing that covers everything. Your childhood had been a lesson in learning to not stand out, to not be pretty. To just go unnoticed as much as possible and survive long enough to see a better life.\n\nThat better life had never come though.\n\nLooking down again, you realize that the pictures on top of the crate had hidden a small hole beneath them which has a flashlight settled down inside it. Picking up the flashlight you flip it on, glad for the extra light. Aiming it about the room, you are able to spot a corner of the room that was previously unlit. There are what looks like two glass boxes there.", "action_results": [{"action": "The Choice", "result": "Walking over to the corner of the room, you find two glass boxes filled with what looks like razor wire. Bending down you shine the flashlight into the first box, trying to see through all of the wire and spotting something in the back of it. Craning your neck you eventually are able to make out a key at the back of the box. A quick study of the other box reveals a syringe at the end of it.\n\nThat sick feeling in your stomach is back, making bile rise up inside your throat. Sticking your hand inside either box is going to be extremely painful. A thought slides into your mind that it may be for the best if you just go for the syringe. Dying doesn't really concern you if you're completely honest with yourself. You've been gambling with your own life for a decade now. Clinging on to another year or two of prostitution, robbery, and drugs seems so pointless. Maybe one last high and dying here in this room surrounded by pictures and candles wouldn't be so bad? It certainly would be a kinder death than what may await you out on the streets or an overdose.\n\nBut, life is life. Maybe if you make it out of this place you can hang on for another few years. You're past the point of telling yourself that you will check into a rehab somewhere. You won't do it and you don't care to lie to yourself anymore. But a few more years of life sounds less scary than being entombed in this place forever.", "action_results": [{"action": "Reach For The Heroin", "result": "One last high doesn't sound so bad and you can always go for the key later after all.\n\nSlowly, you start to push your hand into the box. At first, the wires only graze your hand but once you are wrist deep into the box the razors start to cut into your skin. It's a sharp pain that's all too familiar, but you push past it. You feel a sharp wire cut into the soft flesh between your fingers and you have to pull back a bit to find your way through the maze of razor wires.\n\nIt feels as if your skin is being peeled off, making you cry out as you make one final shove toward the back of the box. Elbow deep in the box, it feels as if a hundred knives are cutting into your forearm, blood drips down onto the floor from the opening of the box. After feeling about with your blood slicked fingers, you finally feel the syringe.\n\nGripping it as best you can, you pull backward but the string holding the syringe in place holds fast. Gritting your teeth, you pull back steadily as the razor wires cut deeper into your flesh on the way back out. Suddenly it gives and you nearly fall backward before the syringe's string goes taut again after only a few inches of slack. Only your hand is inside the box now, still tightly gripping your prize.\n\nTugging at it, you cuss in frustration as it holds fast before you notice a quiet ticking sound coming from the box. Frowning, you lean down and peer inside past your hand. You can't see anything, but the sound is definitely coming from the back of the contraption. Yanking on the syringe again, you try to pull the prize free but it just won't give as you try to see what it is caught on.\n\nThe ticking stops and you pause for a moment before a gunshot rings out in the room. Searing hot pain rips through your face as you fall flat onto your back from the impact. There is a ringing in your ears and a stench of something burning in your nose. It feels as if you have just inhaled fire, the inside of your mouth feels burnt and so does your throat. Reaching your uninjured hand up to your face you feel the part of it that hurts.\n\nPanic starts to run through you as you realize there is a hole where your cheek once was. Blood is pouring out from your face and the hole is too big for you to cover it with just your one hand. Bringing the hand up you freeze when you see the state of it. Strips of your skin dangle from your hand and forearm were the razor wire had ripped it clean off the flesh. You can see the exposed tendons working in your hand as you flex your fingers.\n\nLooking around, you can't see anything in the darkness of the room. The candles have nearly burned themselves out, it won't be long now before you are plunged into true darkness. You try to call for help but all that comes out is a wet gurgle and a lot of pain.", "action_results": [{"action": "Reset Game", "result": "Everything hurts.\n\nWaking up is as bad as it usually is. Aches and pains along with a soured stomach are things you expect after chasing the dragon, though you usually don't have a screaming headache like the one currently pounding beneath your skull. The floor beneath you is cold and dirty, concrete that hasn't been cleaned in years. This isn't the first time you've woken up in some abandoned building you can't remember going to, but as your eyes slowly come into focus you aren't so sure if this really is the norm or not.\n\nThe light in the room comes from candles placed around the place, sitting on pieces of abandoned furniture, crates, and tables. The walls are decrepit, covered in graffiti and stained filth. It wasn't really that unusual to wake up in a place like this. Junkies love abandoned buildings and it is kind of nice to ride out a high in a nice candlelit room instead of a pitch black one. Whoever set out the candles didn't think to toss down a mattress though, a shame really.\n\nYou don't quite feel like getting up just yet, but the sooner you do the sooner you can make some cash to score another dose.\n\nStanding up, you flap your arms a bit in an attempt to rid yourself of the numb, tingling sensation that seems ever present in them now. You really should start injecting elsewhere, but what does it really matter at this point? The crooks of your elbows look like shit and that won't change. Sure it hurts like a bitch to stick a needle there now, but the reward after is worth it.\n\nLooking around at the flickering candles, you notice that there are pictures hanging from the ceiling on strings or placed around the candles. Shuffling toward one half rotten table, you pick up one of the photographs. It isn't easy to see in the dim lighting, but as you hold it up in one hand and a candle in the other you recognize it. It's been years since you've seen this picture. A family portrait from when you were just a kid. One corner of it is torn, effectively removing one person from the picture.\n\nSwearing under your breath, you pick up other pictures and frown as you see that all of them are of you or people you know. Childhood photos of yourself and your parents, pictures of an old boyfriend, pictures of friends you haven't heard from in a decade or more.\n\nAs you continue sorting through all of the photographs, you come across a tape recorder with a small cassette already loaded inside of it.", "action_results": [null]}]}, {"action": "Reach For The Key", "result": "You reach into the box with the key, balling your hand into a fist to keep your fingers from getting snagged in the maze of razor wires. Gritting your teeth, you slowly push toward the back of the box. The wire slices into your fist and forearm, but it is a familiar enough pain that you manage to make it to the back of the box and grab the key.\n\nRemoving your hand is more painful than putting it into the box was. The razors drag across your already bleeding flesh, but you eventually pull your hand free of the contraption. Just as you are almost out, you feel your wrist snag on wire. Taking a deep breath, you decide to treat this like a bandaid and just yank your hand out. The pain is sharp and takes your breath away, but you make it out of the box with the key in hand.\n\nLooking down at your blood slick arm, you wince as you see a strip of skin dangling from the top of your hand. You aren't sure if you should finish the job and remove the skin flap or set it back in place over the top of your hand and use some cloth to secure it in place.", "action_results": [{"action": "Remove the Skin", "result": "Putting the key in your pocket for now, you try to think of how to remove the skin that is dangling from the back of your hand. It is torn up from the wrist and still attached at your knuckles. If you aren't careful you'll just tear it up from your fingers as well. You've never been one for doing your own first aid. A wound like this would score you some good quality painkillers at the ER, but that isn't an option yet. Maybe after you get out of here you'll drop by for a prescription.\n\nThe flap of skin hanging from the back of your head looks daunting as you grip it with your other hand. The blood covering it is slippery and you can't get a good grip on it. Looking around you try to find anything that might be able to trim it off, but nothing catches your eye.\n\nAfter a few moments of thought, you bend over and ball your injured hand into a fist against the floor so that the flap of torn skin lays on the ground. Planting your foot on top of it, you yank your hand up as hard as you can. Pain licks up your arm as the skin rips down past your knuckles and tears some off of your fingers as well. But it does come off of your hand completely, freeing you from the loose skin.\n\nTaking a moment to breathe through the lightheadedness brought on by the pain, you try not to look at what you've done. Ripping the skin off the knuckles had also taken it off your fingers to a degree. It turns out there isn't a whole lot of meat on a finger, mostly bone and tendon which you can now clearly see.", "action_results": [{"action": "Open The Door", "result": "Taking the key back out of your pocket, you hurry toward the door. Your injured hand burns where the skin has been ripped off and the raw flesh is exposed to the air, but you push through the pain and push the key into the lock. It turns and you can hear the loud sound of the mechanism turning as the metal door screeches open.\n\nStepping through, you find yourself in a hallway with harsh fluorescent lights in the ceiling. You walk down it, but many of the doors are chained shut with warnings against trying to open them painted in red letters. It is cold and damp out here, making you shiver as you hurry down the corridor.\n\nFinally, you come to a door with no warnings and a cassette labeled 'play me' taped to the middle of the door. Plucking it from the confines of the tape, you put it into the recorder and hit play.\n\n\"If you are listening to this, then you chose freedom over your addiction. This is just the first step to reclaiming your life, Ciara. For years you have blamed the people who came into your life for what you have become. Perhaps, you are right to blame them after they made you feel powerless over your own fate. But your obsession with blame keeps you from moving on. Beyond this door is someone who influenced your life early on. Today, you choose whether he lives or dies.\"\n\nThe tape comes to an end, leaving you feeling apprehensive about what is beyond the door in front of you.", "action_results": [{"action": "Go Through The Door", "result": "Opening the door, you have to squint as bright lights cut on when you walk inside. The room is harshly illuminated as you step inside, the door crashing shut behind you and locking. As your eyes adjust to the harsh lights, you find yourself staring transfixed at the scene before you.\n\nA man is strapped into a large mechanical device of some kind which holds him upright facing you. His eyes are locked onto you as you step forward. His mouth is sewn shut, but he isn't staying quiet. He struggles against the binds that hold him in place, making incoherent sounds as an old television on a stand nearby cuts on.\n\nThe tape plays, showing a puppet like head on the screen with painted white skin, red spirals on the cheeks, and red eyes. It's mouth opens and closes as the voice from the tapes begins to speak again.\n\n\"Hello again, Ciara. You should remember the man before you very well. When you were still a girl, the two of you were inseparable. You thought it was love, that he would save you from your own personal hell. But, instead, he introduced you to the drugs that have ruled your life ever since. He used you for years and when he was done with you, he burned you one last time for good measure. Now he is the one who will get burned unless you are willing to pay the price for his freedom. But, does he deserve that freedom, Ciara? Make your choice.\"\n\nThe screen goes to static before showing a clock counting down from sixty seconds. Turning back towards the man in the device, you now recognize Forrest as you look at him strapped down into the device. It's been over a decade since you saw him last, the memory of it is burned into your mind and no high has ever been able to erase it.\n\nFor years the two of you had been a teenage Bonnie and Clyde. Mostly robbing convenience stores more than anything, using the money to buy weed, cocaine, and any pills you could find on the market at any given time. At the time, you had believed he was your ticket to freedom. He had sold you so many stories of taking you away from your family and getting an apartment together. But, he never did save you. Instead, he damned you.\n\nAs the years went on, Forrest had gotten deeper and deeper into drugs and crime. Eventually, he was dealing for a man who had his filthy fingers in on every kind of black market scheme in the entire city. He was too stupid to be careful and ended up owing the man money. Not having any money, Forrest had offered to give him the only thing of value he had.\n\nYou.\n\nHe waited until you were too doped up to fight back, then Forrest had stuffed you into his car and driven you to a filthy house in the middle of the worst part of town. There he traded you over to a man you didn't know and walked away free of debt.\n\nNow here he is, strapped down to this contraption completely at your mercy. You have hated him for so long, wished for an opportunity just like this. To watch him suffer for what he did to you. His eyes are wide as he stares at you, watching you contemplate just what it is you want to do as the clock quickly races toward zero.", "action_results": [{"action": "Taunt Forrest", "result": "\"You ruined my life,\" You spit out at him, watching as he struggles to get free.\n\n\"Do you know what he did to me?\" You can't help the bark of near hysterical laughter that escapes you. It's a pointless question though, he can't answer you with his mouth sewn shut like that.\n\nFidgeting a bit, you glance over at the screen once more. It's now counting down from ten seconds. You don't know what happens when it reaches zero, but you step back a bit just to be safe. Forrest ruined your life in so many ways, it feels fitting to be given this kind of power over him.\n\nThe countdown finally hits zero and you jump as flames shoot out of small metal pipes at his feet. Forrest's screams are muffled by his mouth being clamped shut, but the sound still rattles around inside your head even as the acrid odor of burnt flesh hits your nostrils.", "action_results": [{"action": "Try to Save Forrest", "result": "You look frantically around the room as Forrest begins to scream in pain through his closed mouth, the muffled sounds an agonizing groan that fills the room. Spying what looks like a large box covered in a tarp, you hurry over to it. A card set on top simply reads: Which one has the key?. Tossing it aside, you rip off the tarp and find yourself staring down at a metal box with three holes in the top just big enough to reach your arm down inside, but it looks like the box is deep enough to go up to your shoulder.\n\nForrest's screams of agony spur you into action. He's a horrible person, but you aren't sure if you want his death on your hands. Taking your already injured hand, you dip it down into the first hole in the top of the box. Nothing happens at first, but once you are elbow deep a loud whooshing sound like air explodes up from the box. Intense heat scorches over your hand, causing you to yank it back out with a shriek of pain.\n\nHolding your hand, you look down at the skin that isn't covered in the cloth. It is a dark red, but not blistered, at least not yet.\n\nMore mechanical sounds behind you cause you to look over your shoulder as the next series of three torches cuts on, burning Forrest's thighs, hips, and middle. He screams in agony, no longer able to form words. He just screams and struggles. The smell of his meat burning makes you want to vomit.", "action_results": [{"action": "Keep Trying", "result": "\"Fuck...FUCK!\" You shriek, turning back around to the box.\n\nYou don't know which one has the key, but it's the only way to open the locks on the straps keeping Forrest trapped. Taking a deep breath, you shove your hand back into the first hole as fast you can. The steam cranks on and burns hot, but you reach the bottom. You feel around for a second, but find nothing and yank your arm back out of the oven of steam.\n\nPulling it back out your enter arm is now covered in heat blisters and an angry, shiny red color. It surges with a pain you can barely stand. Tears stream down you face as you cradle your burnt arm.\n\n\"I can't do this...\" You mutter to yourself as Forrest continues to scream in agony.", "action_results": [{"action": "Keep Trying", "result": "Taking a shuddering breath, you plunge your arm into a different hole in the top of the box. The steam burns hotly, but this time you feel something when your burnt hand reaches the bottom. Gripping it, you pull it back out and stare at the key as you hold it in your horribly burnt hand.\n\nTurning back to Forrest, you hurry towards him. You fumble with the lock for the strap around his neck, but get it undone after a moment. His squirming and screaming doesn't help. The next series of torches cuts on just you finish undoing the last strap, burning one arm and his sides before he falls forward to the floor, free of the trap.\n\nHe's still groaning and screaming in pain, writhing about on the filthy floor as you stand over him. His feet burnt down to the bone, as is most of his legs. There is no way he'll walk out of this room. But you did your part. He can crawl out of here for all that you care past this. It's his problem now, not yours.\n\nYou startle as the final set of torches cut on in the now empty machine, flames shooting out where his shoulders and head had been just moments before. It would have cooked his brain if you hadn't gotten him out when you did. He might still die, but at least now it won't be your fault.\n\nCradling your burnt arm, you look around the room as a creaking metalic sound catches your attention. The door out is now open, beckoning you through it. Stumbling around Forrest as he cries and shrieks, you hurry toward the door and into the next room.", "action_results": [{"action": "Go Through The Door", "result": "Walking through the door, you find yourself in a hallway once more. Many of the doors are marked with warnings not to try and go through them, prompting you to pass them by for now at least. Watching Forrest burn to death still has your stomach churning, but at the same time you can't help but think about how he deserved it in so many ways. He ruined your life, set you on a destructive path and then left you with no way out of it. Just as the tape said, he burned you one last time before he left. But, he was the one burnt nearly to ash now.\n\nComing to the end of the hallway, you find another tape and put it into the recorder and hit the play button. That same voice starts speaking to you once more.\n\n\"Hello, Ciara. Beyond this door, are the two people truly responsible for putting you on the wrong path for life. They chose not to save you from themselves and now you must choose whether you save them from each other. In the next room, you will find yourself as the spectator of their game. You can watch and see which of them has the will to live, or you can intervene. Make your choice.\"\n\nTaking a deep breath, you push through the door and into the next room. The lights inside the room trip on when you step inside, triggered by the door opening. A large cage takes up more than half of the room where two people jolt startle and shield their eyes as the lights blind them momentarily.\n\nYou swallow nervously as you recognize your mom and stepfather in the cage. Both of them have strange metal devices around their heads. It looks almost like a medical halo, but with thicker metal and two large screws on either side of their skulls as thick a rail spike. The devices clasp beneath their chin and are locked in place by a lock around the neck.\n\nThey recognize you once their eyes adjust to the light, both of them hurrying toward the bars of their cage and calling out to you. A numbness settles in your stomach as the adrenaline starts to pump through your veins. Watching Forrest nearly burn to death before you could get him free had been hard enough, now it's your parents? This is all just too much...\n\n\"Ciara? What's happening?\" Your mom asks, her voice sounds panicked as you continue to finger the metal device around her head.\n\n\"I don't fucking know,\" You snap, glancing furtively at the television on the stand to the side of the cage.\n\n\"She did this. We're in a cage and she's walking around free,\" Your stepfather, Greg, nearly snarls out the words.\n\nLooking at him through the bars, you feel nothing but disgust for him. Not that your mother is any better for marrying him, much less staying with him all this time. The man was a monster of a different sort than Forrest. It had started shortly after he had gotten together with your mom when you were still young, too little to understand what was going on.\n\nIt started with visits to your room in the middle of the night. Confusing conversations that you couldn't comprehend as a child, then it turned into late night games of dress up. Then it had become something much worse. For years it had gone on and no one did anything. No one saved you.\n\nAnd she knew. You know that even as you stare into her eyes now. Her gaze is as accusing as always. She had never seen it as you being a victim, rather she had blamed you as if you were some kind of seductress trying to steal her new husband. The older you had gotten, the worse things got. But, she wasn't angry enough about it to rat him out to CPS when they came calling. She covered for the son of a bitch then they both made sure you never talked to anyone about your nightmare of a homelife ever again.\n\n\"Ciara, get us out of here.\" She demands, her voice somehow both fearful and accusing at the same time.", "action_results": [{"action": "Refuse to Help", "result": "\"Fuck you,\" the words come out as a growl from your throat as you stand still and watch them through the bars.\n\n\"She's a junkie, a whore. That's all she's ever been and all she'll ever be,\" Greg spits out the words like bullets, but the insults feel empty in the current situation. You have the power here, not him.\n\n\"That's rich coming from you. I'd rather be a junkie whore than a pedophile, you sick fuck. You deserve whatever is about to happen to you,\" You lean forward as you growl out the words, \"And I'm going to enjoy watching you die.\"\n\nThe television cuts on before any more words can be said, the now familiar voice commanding everyone's attention.\n\n\"Hello Greg and Karen. The lives you have lived have brought nothing but harm to those around you. A pedophile who abuses his stepdaughter and a mother who turns a blind eye and allows it to continue for years. You have lived your lives caring only for yourselves. Today your will to live will be tested. The devices you wear can only be unlocked with the key that the other has down their throat. You only have to pull the line out of the other's mouth to free yourselves. The screws on either side of your head will slowly drill into your skull once the time starts. You have three minutes before they pierce your brain. Live or die, make your choice.\"\n\nThe screen cuts to static then begins a countdown from three minutes. You watch as both of them try to pull at what appears to be fishing line hanging from their mouths and secured to their shirts to prevent them from swallowing it completely. Both stop pulling almost immediately, gasping in pain. Moments later you hear the drills start up, slowly cranking their way continuously tighter as the clock ticks by.", "action_results": [{"action": "Try To Help", "result": "Not able to watch anymore, you quickly glance around looking for some way to help. After a moment, you spot a card hanging from one corner of the cage on your side. There is metal sheeting keeping anyone inside the cage from reaching through to the card. Walking forward you head toward it, only to feel the tile beneath your foot give way and a sharp pain stab through your foot.\n\nLooking down, you can see that the tile floor has given way under your weight and nails have come up through small holes in the floor to prick your feet. You slowly pull your foot back, feeling the nails piercing the sole of your foot slide back out roughly. Blood stains the tile floor now and your foot throbs painfully where the nails went through to the bone.\n\nAngry swearing draws your attention back to your mother and stepfather in the cage, they seem to have turned on each other now. Greg has your mother by the shoulders and is trying to force her down to the floor, likely to rip the key out of her throat. If you're going to help, you'll have to act quickly.\n\nStill, the thought enters your mind that she never did help you when you had been the one he was hurting. How many times had he come into your bedroom as a child, hurting you and you had looked over at the door to see her watching with disgust on her face. But, she never intervened. Just looked at you as if it were all your fault before walking away and going back to sleep, leaving you at the mercy of a grown man many times your child self's size.", "action_results": [{"action": "Push Through It", "result": "You try to guage the distance between yourself and the note then make a jump for it. The nails rip into your feet on the landing, but the momentum lets you pull your feet up from the nails quickly enough. The pain shoots up your legs as you stand on your bleeding feet, but at least you made it past the bed of nails hiding beneath the floor. You pick up the card and read it, surprised that is much more straightforward than Forrest's. According to the note, all you have to do is press the button to speed up the bolts being drilled into their skulls. Both of them have their own button welded onto the metal sheet on the wall of the cage facing you. It must be remotes. Your mother's name, Karen, is on the left and your step father's name is on the right. You could kill one to save the other... Or both.", "action_results": [{"action": "Kill Greg", "result": "You slam your hand down onto the button under Greg's name, peering around the metal sheeting to see through the uncovered part of the cage wall. Barely a heartbeat passes before the bolts drilling into his skull speed up, the sound filling the room as he falls to his knees and grips the device in his hands. A pained grunt escapes his mouth as he thrashes about, trying to get the clunky metal device off of him with no luck.\n\nYour mother scurries to the other side of the cage, her own device still drilling the bolts at the same slow pace. It isn't long before the bolts break through Greg's skull, sending his body into convulsions as foamy saliva drips from his mouth. The bolts drill in a little deeper and her goes still, blood dripping from his nose.\n\n\"Get the key!\" You urge your mother.\n\nShe seems to be in pain from the bolts on her own device as she hurries over to Greg's body and yanks on the fishing line down his throat. It comes up slowly, but she manages to get the key and remove her own device. The bolts have already made their way into her skull, but not all the way. She thrashes about for a moment before it finally comes loose, blood trickling down either side of her temples where the bolts were.\n\n\"Thank you...\" She mutters as she looks your way, gingerly touching the spots where the bolts had been drilling their way into her head.\n\n\"You never helped me, you know.\" You blurt out before you can stop.\n\n\"I'm so sorry, Ciara.\"\n\n\"Fuck you,\" You spit out the words as a door opens off to the side of the room, your exit.\n\nShe doesn't say anything else, the guilt is written blatantly on her face. Every time she saw him hurting you and doing nothing about it flashes through your mind as the anger wells up in your chest. The times she had accused you of seducing that sick fuck. As if a girl not even in her teens would ever do something that sick.\n\nAfter staring at her hard for a few moments longer, you swallow down the anger and turn your back to her. She isn't worth it and all you want is to get out of this shithole.", "action_results": [{"action": "Leave", "result": "Stepping through the doorway, you find yourself in another dimly lit hallway. Looking at the doors that are blocked off with warnings painted on them, you wonder if perhaps the warnings are empty? Maybe escape from this place is just a matter of breaking the rules?\n\nStopping at the door you are meant to walk through, you pick up the tape waiting for you and put it into the player.\n\n\"Hello Ciara, you are so close to facing all of your demons. Only two more remain. Beyond this door lies a woman you might not recognize, but her choices directly affected the direction of your life from early on. Inside the next room you will find everything you need to know about her in order to make your choice regarding her fate. Will you show her the mercy she did not show you? Make your choice.\"\n\nThe message makes you frown, unsure just what it could mean. Looking at the door in front of you, you can't help but be afraid of what is in the next room. You've already seen enough people suffer, even if they did deserve it. Glancing back down the hall you just walked through, you eye one of the doors warning you from opening it.", "action_results": [{"action": "Try One Of The Other Doors", "result": "Tired of playing this sick game, you walk back down the hall and look at the door which has warnings against opening it painted in red letters. After staring at the door for a few moments, you try the doorknob and feel surprise when it is unlocked. Pushing the door open, you see a dark room beyond it.\n\nAs you step through the door, a strange sound from above startles you as a mist of water sprays down from a hose nozzle above you. For a moment you stand still in confusion, but within a few heartbeats, the liquid then begins to burn. You try to wipe it away, but it covers you and even your clothes are starting to dissolve beneath the acid.\n\nYour skin feels like it is melting as you frantically search for a way to get it off of you but there is nothing in the hallway or the room you have just opened to help. The pain is excruciating as you fall you to the floor, still trying to wipe the acid off of you. A horrible slipping sensation brings your attention to your arm as you see the skin has come loose with your attempts to wipe away the liquid covering it. Blisters bubble up where the skin is still attached as you feel the acid start to burn down into your muscles.\n\nThrashing about on the filthy floor, you lose all concept of thought. You just want to get this stuff off, but there is no way to achieve that. Instead, all you can do is wriggle about and cry in pain as the acid slowly eats you alive.", "action_results": [null]}, {"action": "Go Through The Door", "result": "Resisting the urge to break the rules, you instead go through the intended door and find yourself in a well lit room once more. In the center of it, you see a woman you don't recognize strapped to a chair. Above her is what looks like some kind of pipe that opens up over her head. She begins to struggle and cry once she sees you, but with the gag in her mouth you can't make out anything she is saying. Begging for help if you have to make a guess.\n\nThere is no television in this room, instead, a table covered in binders and manilla folders is off to the side. There is no tape to give you instructions either, instead, it seems you have to do your own detective work and go through the various bits of information. Walking over to the table, you look down at all the different stacks of binders and folders.\n\nPicking up one folder you are surprised to find that it contains several forms going over case information from the time CPS was investigating your parents after teachers at your school grew concerned over your change in behavior after your stepfather began to pay you late night visits as a child.\n\nSkim reading the papers, you see details of why they were investigating. Unusual behavior at school on your part. You had apparently informed a teacher that your privates hurt after a game with your stepfather the previous night. It turns your stomach to even think about it. You had been so young when that started. You never really had a chance.\n\nFlipping through the papers, you find the notes from the CPS investigation. There was nothing but glowing notes on what good parents you had, how clean the house was, and so on and so forth. Confusion fills your mind as you think back to your childhood. The house had never been particularly organized or clean, you had your stepfather visiting you at night and your mother ignoring it, not to mention she also blamed you as some kind of kid sized seductress. How had none of that been seen and noted?\n\nYou open one of the binders and find some photographs. Most are of you as a little girl right before your mom had remarried. You look so happy in those pictures. Just a regular little girl with a big grin, not a care in the world. Then as you flip further back you find yourself staring at a little girl with dead eyes and no joy to her expression, flanked by your stepfather in every picture. It makes you feel sick to your stomach to see the way he looks at you in some of the pictures, how his hand is often possessively gripping your shoulder.\n\nAs you continue to look through the items on the table, you come across what looks like some kind of badge. You recognize the woman's face as the same one you're now in a room with. She works for CPS and according to the name on the badge, she's the same one that filled out the paperwork with the glowing reviews of your family...", "action_results": [{"action": "Confront Her", "result": "You look at the woman, Monica according to the badge you found, and try to remember her from when you were just a kid. Vaguely you do remember her. A stranger you didn't know who was there to talk to you and your family a few times. Her presence had made your parents nervous, your stepfather was angry that she was there at all. The night before she visited for the last time, he had come to your room and the game he wanted to play was rougher than usual.\n\n\"You worked with CPS?\" You ask sharply, feeling your chest start to tighten in anger.\n\nShe can only nod her head, the gag muffling anything she might try to say.\n\n\"Those papers over there say you came to my house when I was a kid. My stepdad was... he was hurting me. You left me there,\" You swallow roughly as the emotions start to bubble up to the surface, far to sharp and clear in your unwanted sobriety, \"You could have helped me... But you didn't.\"\n\nShe begins to cry again, just shaking her head and mumbling into the gag in her mouth. In this moment, you almost hate her more than your stepfather. It had been her job to save you from that hellhole... From him. And instead, she had just left you there to rot.", "action_results": [{"action": "Another Choice", "result": "A strange rattling sound pulls you out of your thoughts. It's coming from the pipe over the woman's head, but nothing but the noise seems to be coming out. Looking back at Monica, you notice that there is actually an envelope sitting on the ground near her feet.\n\nYou pick it up, eyeing her as she struggles against her binds before opening up the envelope and pulling out a newspaper clipping. Recognizing Monica's face on the article, you read over it quickly and feel your blood start to run cold. According to the article, Monica was part of a scandal in CPS where certain caseworkers had accepted bribes. Had she possibly taken a bribe to write off the allegations against your parents?\n\nA small flashcard behind the newspaper article is written in the same handwriting as the other notes you have found so far.\n\nLet her drown in the money she valued over the welfare of children or pay the price to forgive her.\n\nTo your surprise, a small key is taped to the back of the card. Though, you aren't so sure she deserves to be set free. She could have saved you from years and years of hell. But, she had left you to rot for cash? She was as much of a monster as your stepfather.\n\nA metallic clacking sound catches your attention and brings it back up to the pipe. Something clatters down the pipe then falls down, landing on Monica's head before bouncing to the floor. Crouching down, you pick up what looks like a penny. It is hot to the touch, almost enough to burn. Another one comes clattering down the pipe, but this one lands on the floor and splatters slightly, halfway melted down.", "action_results": [{"action": "Try To Help", "result": "You look at the key and back to Monica, unable to help but feel like this is far too easy. The note said you would have to pay a price to free her. But, the key had just been handed to you so carelessly. Taking a deep breath, you hurry over to Monica's side and look at the locks keeping the bindings on her wrists and ankles secured in place.\n\nPutting the key into the first lock on her wrist, you twist it around until the lock comes undone. All you have to do now is unbuckle the leather restraints. You start working on that when suddenly a glowing mass of molten copper splatters out of the pipe, landing on Monica's shoulder, some of the splatter landing on your hip and burning clean through your pants.\n\nOn reflex you throw yourself backward away from her, watching as she starts to scream while the molten copper burns into her shoulder. The scent of her burning flesh stings your nose.", "action_results": [{"action": "Give Up", "result": "You grit your teeth and take a few more steps back from Monica as more molten copper splatters out of the pipe to land in her lap. It sounds like cold water being thrown onto a hot pan and smoke rising from her as it burns through her clothing and skin. She screams through the gag and thrashes about, but nothing she does is going to get her free.\n\nYou aren't willing to risk yourself for the woman who left you to the mercy of your stepfather. The pain you feel from your hip is like nothing else. The molten metal had burnt your skin to a deep blister when it had splattered onto you while you were trying to free her.\n\nYou watch in awe as a flood of molten copper pours out of the pipe, completely dousing Monica from head to toe in the stuff. She stops screaming, going oddly quiet as her body twitches under the liquified metal as smoke rises up from it. A moment later she goes still, the smell of her burnt skin and still cooking flesh mixing the scent of the molten copper in the air.\n\nAnother door opens in the far side of the room. You don't look back as you head out.", "action_results": [{"action": "Leave", "result": "The next room doesn't have a tape waiting for you outside the door, instead, you go in without any warning about what is to come. Once inside, you find yourself in a dimly lit room that smells foul. There is a man hunched forward in a chair like device, the sound of his sobbing fills the room almost as much as the foul smell does. Walking closer, you recognize him easily enough once you get a good look at his face.\n\nTrigga was what he was called. He had his filthy hands in everything pretty much. Drugs, prostitutes, the black market. He was the one selling drugs to Forrest and he was the one who owned the debt Forrest owed when he traded you to pay it off. You had been so high when he dragged you into the trap house Trigga was using to sell drugs and prostitutes that you didn't even fully understand what was happening.\n\nThen Forrest had shook hands with Trigga and left. You had learned very quickly that keeping Trigga happy was the most important thing in your life. Refusing him was dangerous, often times deadly. One of the girls had bitten him when he forced her to give him head, he had brought in some kind of black market chop shop surgeon who harvested her organs to sell. After that, all of the girls behaved, including you.\n\nLiving in that trap house, servicing Trigga and his clients had been hell on earth. One of the worst parts of the entire experience had been the branding. Each girl had to endure a tattoo on their groin with Trigga's name. He didn't want anyone to think any of you were owned by someone else. And if someone paid him enough, they could do whatever they wanted to the girls. There was no act too violent or obscene for him to turn down cash money for. At times there had even been children kept down in the basement for short periods of time, used in pornographic films that he could sell to the right demographic. He never kept the kids there long and you don't know what happened to them after they had been used for their few films then removed from the house.\n\nHe looks up at you as you stand before, brown eyes as hateful and accusing as always. But, he knows who you are. It's only been a few years since the two of you had last seen each other after all. You feel yourself wither a bit under his glare, taking a step back to avoid his gaze. Even though he had been crying when you walked in and the tears still shine wetly off his cheek, you know what he's capable of.\n\n\"What the fuck is going on, Ciara?\" His voice cracks a bit, but you still flinch reflexively.\n\n\"I don't know... Someone took a bunch of people and is making me go through the rooms-\"\n\n\"Shut the fuck up and get me out of here,\" He cuts you off.", "action_results": [{"action": "Assert Yourself", "result": "\"No, you shut up. I don't have to help you.\" You do your best to keep your voice level and firm.\n\n\"Bitch, I will do things to you can't imagine. I will fuck you up,\" He tries to reassert himself.\n\n\"Only if I don't let you die,\" You snap back, feeling more than a little satisfied when he goes quiet.\n\nFeeling confident, you start to examine the device he is stuck in. It's a metal chair with several additions made to it and clockwork of various metal pieces, gears, and other things. Straps have him forced into a hunched over position with his legs spread wide, you quickly realize that he is naked.\n\nSome kind of shallow metal bucket covers his groin and duct tape has it secured in place to his skin. You can hear a strange scurrying sound inside that makes him flinch. Looking closer at it, you can see a blow torch mechanism similar to the ones Forrest's device had had at the bottom of the bucket. His arms are tied behind him and forced upward onto the back of the chair in a very uncomfortable angle. As you walk around behind him, you blink when you realize there is a rifle in some kind of device that seems to make it fire behind him. It is angled toward him and the end of the barrel disappears into his asscheeks.\n\nBehind the device holding the rifle in place, you spot a tape laying on the ground and hurry to pick it up.", "action_results": [{"action": "Listen To The Tape", "result": "Putting the tape into the recorder, you hit play and listen as the voice starts to speak.\n\n\"Hello Jermaine, for years you made your living off preying on the most vulnerable people. Addicts, troubled youth, children, and so many more. So many people have been at your mercy over and you so very rarely have been merciful to them. You have murdered, raped, and abused again and again. But, today, you find yourself on the other side of the cycle. You are now at the mercy of someone who was once at the mercy of you. Will she show you the same mercy you showed her? Or will she forgive you? Once the device activates, you won't have long before the bucket gets hot enough to burn anything inside. The rat trapped inside will do whatever it takes to escape, even if that means chewing through your body to do so. Such injuries are survivable if Ciara chooses to forgive you, but you should convince her quickly though, in sixty seconds the choice will be made for you. Let the game begin.\"\n\nYou jump when you hear the torch beneath the bucket turn on, the flame hitting the metal and causing the scurrying sounds inside to grow louder. Trigga, or Jermaine as seems to be his real name, begins to scream and squirm though he is held firmly in place within the device.\n\nLooking over the device some more, you see that his wrists and ankles are held together by only belted leather restraints. There are no locks or keys this time and you don't seem to have to pay a price either... Except perhaps your dignity. Forgiving this monster seems impossible after everything he has done. The world would be a better place without him.\n\nThe clock on the side of the device that holds the gun reaches twenty seconds and Jermaine's screams turn from fear to pain.\n\n\"It's eating me! It's eating me, get me out. I'll give you anything. I have money.\" He begs.", "action_results": [{"action": "Set Him Free", "result": "\"Three hundred grand, I'll forgive you for that.\" You bargain, standing back as the sounds of squeaking and scurrying inside the metal pan around his genitals gets louder.\n\n\"I'll do it, now let me out.\" He begs and with that, you hurry to undo the restraints.\n\nOnce free, he lurches out of the device and falls to the floor with a squeal of pain. The rat inside the pan flees to safety, but you can see it chewed up Jermaine's favorite tool badly. A strong smell hits your nose and he scrambles out of the line of fire where the gun is aimed. A trail of liquid shit follows him, leaking out of his now unplugged ass.\n\nThe gun goes off, the bullet lodging into the wall at the far side of the room.\n\nJermaine slowly stands up, looking back at the device and then at the floor as if in a daze. He didn't deserve life, but three hundred thousand dollars would buy you a house, a car, and set you on the right path. You can get out of town, get clean, buy a house and start over somewhere far away.\n\nYour happy thoughts turn sour when Jermaine lurches toward you and barrels into you with his full weight. A big man, he is easily twice your size and heavily muscled. He pins you down on the floor easily and squeezes his hands around your neck as you batter him with your fists and kick your legs.\n\n\"Stupid bitch. I ain't paying you nothing. You're nothing.\" He spits as he talks and the edges of your visions start to blur as you struggle to get air.\n\nWith your lungs burning, you feel your body start to give out and everything goes to black.", "action_results": [null]}, {"action": "Watch Him Die", "result": "\"Go to hell,\" You growl, making sure to move off to the side of him to make sure that you aren't caught in the crossfire if the gun goes off.\n\nThe sounds of scurrying and squeaking from the rat get louder. Considering that he is naked, you have to appreciate that the animal has likely chewed up Jermaine's favorite tool in the process of trying to escape the burning metal. The man's whimpering and blubbering pleas for help don't make you feel guilty, on the contrary, you have never enjoyed watching someone in pain before now.\n\n\"You deserve this, you sick fuck,\" You taunt him, smiling a bit as the stopwatch hits sixty seconds.\n\nThe gun goes off with a deafening bang. Blood explodes out of his mouth and a horrible smell fills the room as feces leaks down onto the floor around the barrel of the gun that is still lodged in his ass. You stand there and stare at him a little longer, watching as a mixture of blood and shit falls out of his mouth. He twitches a bit at first, a terrible groaning sound escaping him before he goes still.", "action_results": [{"action": "Look For The Exit", "result": "A door opens on the other side of the room after a few moments and you hurry to go through it to escape the smell of blood and shit that now permeates the room. The room past the door is pitch black, but you hurry through it anyway. The door slams shut and locks behind you, making you jump while the light in the room turn on and illuminate your surroundings.\n\nThis is different from the other rooms. You can't see anyone else in here with you and you are confined to a small place inside what looks like plexiglass. A door leading out of the glass cage is on the other side of it, but as you look closer you can see several devices on the ceiling that you aren't sure about.\n\nYou hear a door open from beyond the plexiglass and a woman you don't know walks in, staring at you from the other side of the cage. She holds a tape recorder in her hand as she walks up to the glass, hitting play you hear the familiar voice start to speak.\n\n\"Hello, Annette. If you're hearing this, then you survived all of your trials and have come to the final test. By now, you have watched the footage showing a series of choices made by the individual before you. She was given the opportunity to forgive or punish the people who hurt her in the past. Now you will be given the same opportunity... Three years ago, your daughter went missing. Since then your life has been consumed with trying to find her. But, every new lead comes up empty. The woman before you now was once taken like your daughter, forced into a life of sexual slavery and drugs. But, three years ago the man who owned her gave her a choice. She could either stay his property or bring him a substitute to trade for her own freedom. Ciara then went to the club where your daughter was last seen and lured her away, drugging her and then taking her back to her pimp. Ciara was set free that day and your daughter took her place, trafficked for sex and moved outside of the country before anyone could save her. To forgive her, all you have to do is buzz open the door to her cell and let her out. Or, you can walk away and leave her to her deserved fate. Make your choice.\"\n\nA tear falls down your face as your darkest secret is announced into the silence of what could very well be your tomb. The woman, Annette, has quiet tears streaming down her face as she watches you with hate etched into her face.\n\n\"I'm so sorry. I was desperate, I just wanted to be free.\" You plead with her through the glass.\n\n\"You could have gone to the police. You didn't have to play his game. You didn't have to take my daughter.\" Her voice is surprisingly strong for a person with tears falling down their cheeks and it cuts to your very core.\n\n\"It was the first time he had let me out in years. He was watching me. He would have killed me,\" You explain, hoping she believes you.\n\n\"My daughter bought your life, what have you done with it?\" She asks suddenly, her hand pressing against the glass as she leans forward.\n\nYou swallow dryly, able to picture the poor girl you had tricked into taking your place perfectly. She looked just like her mother it seems. The girl had been young and beautiful, so full of life. Seeing her so free and happy in that club had been why you chose her. Something in you hated her for having everything that had been denied you in life. Freedom, happiness, and friends. She had been so trusting, chatting with you at first then dancing with you. Slipping the drug into her drink had been so easy, then you had simply led her away from her friends to the waiting car driven by one of Trigga's men.\n\nThe way her face had looked when she had been given to Trigga was burned into your memory no matter how many drugs you took. In so many ways, she had been with you all this time. Her terrified face looking back at you in accusation every time you look in a mirror.\n\nNot able to look at her mother anymore, you instead fix your eyes to the floor, \"I tried to get clean, but I had nowhere to go. I'm homeless... I'm nobody.\" You admit, feeling hot tears spill onto your face.\n\n\"You saved that boy, the one you used to date. Why?\" She asks quietly, making you look up at her in confusion.\n\n\"I thought he loved me... But, he owed money to the pimp that I took your daughter too. He gave him me to pay off his debt... I should have let him die.\" You admit.\n\n\"You killed that man, your stepfather?\"\n\n\"He... you don't know what he did to me when I was just a little girl. He was a monster. He would have killed my mom to save himself if I didn't stop him. He deserved to die.\" You snap back, no doubt in your mind that you are right.\n\n\"What about that woman, the CPS worker? You didn't save her.\"\n\n\"She could have saved me when I was little and she didn't. She signed off on my stepfather being ok even though he was hurting me. She was taking bribes.\" You explain.\n\n\"You're sure she took a bribe for you? It wasn't just a mistake?\"\n\nYou just shake your head, not wanting to think about that too hard right now.\n\n\"That man, Jermaine? He was your pimp?\" She asks, the expression on her face going cold and hateful.\n\n\"Yes, he deserved worse than what he got. I would have never given him your daugther if I had any other choice. He would have killed me... I was getting too old he said. I could either give him a new girl to take my place or he would find some other way to make money off of me... I know what he's willing to do to make money... I was scared... And I'm so sorry.\" You blurt out, sobbing a bit at the end as you start crying once more.", "action_results": [{"action": "Judgement", "result": "Annette's face goes cold as she steps away, looking at you hard for a moment before she speaks, \"You took my baby from me... She was my whole world. She was a good person. She wanted to be a nurse, to help people. And you took that away from her so you could whore and do drugs some more?\"\n\n\"I'm so sorry. I wish I could take it back, but I can't. I'm so sorry.\"\n\n\"It's too late for that. You can't bring my daughter back. She's gone. I know I won't find her again. But, at least I'll know you got what you deserve,\" She says, turning away from you and heading for a door in the corner.\n\nOpening it, she steps through and leaves you behind in the room.\n\nA strange sound brings your attention to the devices above you, a strange whirring noise. Then they suddenly burst with light and noise, startling you before sudden pain sets in. Shrapnel tears through the air around you, lodging into your body and tearing apart your face and limbs.\n\nFalling backward, you land on your side staring out through the plexiglass into the empty room. Blood pours out of your wounds and fills your mouth. You can't manage to make a sound as you try to call for help that won't come. The bleeding is slow, not fast. You lay there for what feels like an eternity before the lights in the room go out, plunging you into darkness.\n\nAt least once the shock sets in you feel less pain, more of a dulled hurt and a wooziness as you drift in and out of consciousness. You never asked for this game. You didn't kill anyone that didn't deserve it... But, that girl in the club... she certainly hadn't deserved what you did to her. And for what? Three years of freedom that you spent whoring despite your freedom so you could buy drugs and avoid ever being sober enough to think about her?\n\nMaybe this is what you deserve...", "action_results": [null]}]}]}]}]}, {"action": "Study The Device", "result": "You swallow down your fear of the man who had owned you for years and walk around the device he is stuck in to get a better grasp of the situation. It's a metal chair with several additions made to it and clockwork of various metal pieces, gears, and other things. Straps have him forced into a hunched over position with his legs spread wide, you quickly realize that he is naked.\n\nSome kind of shallow metal bucket covers his groin and duct tape has it secured in place to his skin. You can hear a strange scurrying sound inside that makes him flinch. Looking closer at it, you can see a blow torch mechanism similar to the ones Forrest's device had had at the bottom of the bucket. His arms are tied behind him and forced upward onto the back of the chair in a very uncomfortable angle. As you walk around behind him, you blink when you realize there is a rifle in some kind of device that seems to make it fire behind him. It is angled toward him and the end of the barrel disappears into his asscheeks.\n\nBehind the device holding the rifle in place, you spot a tape laying on the ground and hurry to pick it up.", "action_results": [null]}]}]}, {"action": "Keep Trying", "result": "Gritting your teeth, you hurry back to Monica and work on unlocking her other hand. Just as you get it free, you can hear more molten copper coming down the pipes. She seems to hear it as well, throwing herself from the chair to lay out on the floor with her ankles still bound while you also moved away from the splash zone. When more molten metal falls from the pipe, it hits the chair and burns through the wood but only barely spatters onto the backs of her legs.\n\nHurrying, you work to free both of her ankles as well then help her move quickly away from the chair just in time to avoid a huge flood of the melted down copper as it was dumped down over the chair. The wood breaks down quickly under the hot metal, but the two of you are safe from any more burning splatter at least.\n\nRemoving the gag from her mouth, you watch as she breathes through the pain of her burns before thanking you for saving her.\n\nYou just shrug, unsure what else to say. You probably could press for answers about her investigation into your parents, but that's all in the past and can't be changed anyway. Why reopened old wounds?\n\nShe's still blubbering various thanks when a door opens on the far side of the room. You stand and feel confused when she doesn't move to follow you.\n\n\"I can't go through that door.\" She says, still gingerly touching at her burnt shoulder and the backs of her legs.\n\n\"Why not, it's the only way out.\"\n\n\"When I first woke up in here, there was a voice in the room. It sounded like a recording. It said that if the person that came through the room saved me, then I had to stay here when they went through the door. If I go through that door I'll die.\" She explains through tears, still half hysterical.\n\n\"Fine, whatever,\" You mutter, moving away from her and toward the door. You had saved her, what she did with that was her own damn business not yours.", "action_results": [null]}]}, {"action": "Do Nothing", "result": "You aren't sure what is about to happen, but Monica hadn't given much thought to what would happen to you when she had left you with your family instead of removing you. Bribe or not, she could have saved you and she didn't. Why should you do any differently for her?\n\nStepping back a bit, you watch as she continues to struggle against her bindings to no avail. The sounds coming from the pipe get louder with the occasional half melted coin dropping down it. One lands on her head, the melted copper burning into her skin and making her howl through the gag in a mixture of pain and panic.\n\nSuddenly, you hear a very different sound coming down the pipe and jump a bit as a stream of molten copper suddenly falls from the pipe. It splatters onto Monica's side, burning into her shoulder and arm. She shrieks into the gag, struggling in an attempt to move the chair she is stuck in. It is secured in place, as is she.", "action_results": [{"action": "Let Her Die", "result": "You continue to watch as Monica writhes about in pain from the burning of the molten metal landing on her. Another large glob of the stuff falls from the pipe, this time splattering onto her lap. The melted down pennies look oddly pretty you have to admit. A warm glowing color, like the shiniest new penny you have ever seen. But, Monica's thrashing and screaming as it burns through her clothes and skin like acid makes it hard to appreciate the color of the stuff.\n\nStill, you can't help but feel a little warm inside at the scene unfolding in front of you. She deserves this. And now she can't let any other children down like she did you. In fact, she'll never let anyone down again after this.\n\nYou watch in awe as a flood of molten copper pours out of the pipe, completely dousing Monica from head to toe in the stuff. She stops screaming, going oddly quiet as her body twitches under the liquified metal as smoke rises up from it. A moment later she goes still, the smell of her burnt skin and still cooking flesh mixing the scent of the molten copper in the air.\n\nAnother door opens in the far side of the room. You don't look back as you head out.", "action_results": [null]}, {"action": "Give In and Help", "result": "Not able to listen to her muffled screams, you grip the key and move in to try and free one of her hands. Getting one free, you quickly do your best to get the other loose as well. Just as you get it free, you can hear more molten copper coming down the pipes. She seems to hear it as well, throwing herself from the chair to lay out on the floor with her ankles still bound while you also moved away from the splash zone. When more molten metal falls from the pipe, it hits the chair and burns through the wood but only barely spatters onto the backs of her legs.\n\nHurrying, you work to free both of her ankles as well then help her move quickly away from the chair just in time to avoid a huge flood of the melted down copper as it was dumped down over the chair. The wood breaks down quickly under the hot metal, but the two of you are safe from any more burning splatter at least.\n\nRemoving the gag from her mouth, you watch as she breathes through the pain of her burns before thanking you for saving her.\n\nYou just shrug, unsure what else to say. You probably could press for answers about her investigation into your parents, but that's all in the past and can't be changed anyway. Why reopened old wounds?\n\nShe's still blubbering various thanks when a door opens on the far side of the room. You stand and feel confused when she doesn't move to follow you.\n\n\"I can't go through that door.\" She says, still gingerly touching at her burnt shoulder and the backs of her legs.\n\n\"Why not, it's the only way out.\"\n\n\"When I first woke up in here, there was a voice in the room. It sounded like a recording. It said that if the person that came through the room saved me, then I had to stay here when they went through the door. If I go through that door I'll die.\" She explains through tears, still half hysterical.\n\n\"Fine, whatever,\" You mutter, moving away from her and toward the door. You had saved her, what she did with that was her own damn business not yours.", "action_results": [null]}]}]}]}, {"action": "Say Nothing", "result": "You look at the woman, Monica according to the badge you found, and try to remember her from when you were just a kid. Vaguely you do remember her. A stranger you didn't know who was there to talk to you and your family a few times. Her presence had made your parents nervous, your stepfather was angry that she was there at all. The night before she visited for the last time, he had come to your room and the game he wanted to play was rougher than usual.\n\n\"You don't talk to her. You tell her you love your parents and that we treat you nice. You don't tell her about our playtime after bed. Or we'll play a new game and you won't like it at all,\" your stepfather's voice had been cruel as he whispered the threat into your ear that night.\n\nThe next day, you had done exactly as he said. It hurt to sit down and talk to her, so you had shifted back and forth to try to find a sitting position that didn't make you feel sore. She had attributed it to you being a hyperactive child and nothing else. You don't remember what all she asked of you, only that you didn't tell the truth for them. Your stepfather was scarier and than some stranger, you didn't know anything about after all.\n\nBut, she was a professional. Monica should have seen through all of that. It was her job to save children. But, she hadn't saved you. She left you there with your stepfather and his fucked up games. He got bold after that. Every night for years he had come into your room until you were finally old enough in your teens to spend most of your nights couch surfing at friend's houses. It was better to be arrested for sneaking out of the house and loitering somewhere at night than to have to play another one of that monster's games.\n\nMaybe she did deserve this.", "action_results": [null]}]}]}]}, {"action": "Kill Your Mom", "result": "You slam your hand down onto the button with your mother's name over it. Greg may have been the one to hurt you, but she was the one who let it happen over and over again. The one person in your life that was supposed to protect you and she had invited the monster into the house and then turned a blind eye to what he was doing to you. At times she had even blamed you for it, accusing you of seducing him on multiple occasions.\n\nPeering out from around the metal sheeting hiding the buttons from the view of the occupants within the cage, you watch as your mother suddenly starts screaming as the bolts in her device begin to turn faster. They drill into her skull before eventually breaking through with a sickening crunch.\n\nGreg moves away from her for a moment, watching as she starts to convulse on the floor and spit foam. Eventually, she goes still, blood dripping from her nose now that the bolts have pierced her brain. Greg yanks the fishing line up her throat until it pops out of her mouth with a spurt of blood. Strips of the inside of her throat dangle off the hooks as he clasps the blood soaked key in his hand.\n\nIt doesn't take him long to unlock his device, though he has to really yank on it to get the bolts off of his head. The heavy metal of the thing hits the floor with a loud sound that makes you jump as you watch Greg slowly turn towards you.\n\nHe snickers a bit, looking you up and down in the same way that always made you feel so dirty as a young girl, \"Couldn't let me die, huh? I knew you wanted it all along. I'd give you another ride when we get out of here, but you've been passed around too many times now.\"\n\nYou bite down on your inner cheek as his words cut straight to your gut, making you feel simultaneously revolted and enraged, \"Don't you mean I'm too old for you now?\"\n\nHis face loses some of the smugness when you spit the words back at him. If you're lucky, he'll die some other way before he escapes this place. But, for now, you have other places to go. The exit is now open, beckoning you away.", "action_results": [null]}, {"action": "Kill Them Both", "result": "Looking at the two buttons, you can't help but think about how both of them deserved to die. They had both worked together and destroyed your childhood. Both had hurt you in different ways. And neither of them had ever faced any sort of consequence for it. Until now at least.\n\nYou press both of the buttons at the same time before peering around the metal sheet to see into the cage. Greg has Karen pinned, trying to get to the fishing line in her mouth. But, now both of the devices around their heads suddenly begin to drill the bolts into their temples at an enhanced rate.\n\nGreg falls backward from the pain, thrashing about as the bolts drill through his skull with a sickening sound. Your mother falls over as well, screaming as the bolts pierce through her skull bone and into her brain. Their bodies go into convulsions shortly after, bringing silence to the room broken only by the sound of the drill turning the bolts and their limbs kicking about.\n\nFinally, the bolts are all the way in and the devices fall silent, as do their convulsing bodies go still. Blood trickles from their noses and foam from their mouths. Both dead as far as you can tell.\n\nA door opens up in the corner of the room, beckoning you to leave this tomb. They deserved this. A pedophile and a worthless mother that let it happen. They belonged together in here. Now you can leave them to rot.", "action_results": [null]}]}, {"action": "Give Up", "result": "You continue to watch as Greg finally turns to slinging your mother around the cage until she finally slips and falls. He's on her before she can scramble back up. She screams and begs for you to help her, but it's too late for that. How many times had you begged for her help as a little girl? What had she ever done to help you? Now she would know how it felt.\n\nHe raises his heavy fist and brings it down into her face hard, blood exploding out of her nose from the blow. A few more hard hits to the face makes her go limp so that he can then grip the fishing line and pull hard. Blood oozes from her mouth as the hook on the end of the line rips her throat on the way up, popping out of her lips with both the key and shreds of flesh hanging off of it.\n\nGreg quickly puts the key into the lock on the device around his head, unlocking it so that he can then get about taking it off. The bolts on his skull are still drilling inward and he has to rip it off of his head, scraping some of the skin off as it does. But, he stands there free finally except for the bit of fishing line still down his throat.\n\nThe bolts on your mother's device keep drilling into her skull, faster and faster now that the countdown is below one minute. The sound as her skull starts to crack from the pressure is sickening, but Greg just stands there looming over her watching as it happens. He doesn't even look sad that his wife is dying because he sacrificed her to save himself. Not that he was ever the kind of man to feel remorse.\n\nFinally, the clock hits zero just as your mother's body goes into convulsions, thrashing about as blood oozes around the bolts drilling their way into her temples before going still as bloody foam drips from her mouth. Greg finally looks over at you, those cruel eyes of his glinting like they always do when he thinks he's won.\n\nA door opens off to the side, your escape into the next little slice of hell. The sound of his voice cursing your very existence echoes in the room as you turn your back on him and leave. He always did like getting the last word in, didn't he?", "action_results": [null]}]}, {"action": "Keep Watching", "result": "Stepping away from the spiked floor, you instead turn to watch as your stepfather advances toward your mother. He's a monster, but then so is she in a different way. They aren't worth skewering your feet to save. Unlike Forrest, they are capable of saving themselves or each other if they just try. What happens will not be on you.\n\nHe catches your mother around the shoulders and it isn't until then that she seems to register what he is doing. As he reaches for the fishing line hanging from her mouth and attached to her shirt, she starts to struggle and try to move away from him. The grip he has on her shoulders is strong enough to keep her from getting away, but he can't get a grip on the fishing line without letting her go and they just struggle back and forth cursing each other for a few moments while the bolts drill tight enough into their skulls to draw blood.", "action_results": [null, null]}]}, {"action": "Look Around", "result": "Gritting your teeth, you start to look around the room for what you are sure is here somewhere. In the room with Forest there had been a way for you to help, there is probably one here too. Finally, you spot what looks like a card dangling from one corner of the cage on your side. There is metal sheeting keeping anyone inside the cage from reaching through to the card.\n\nYou step forward, but the TV cutting on stops you mid stride as the now familiar voice fills the silence.\n\n\"Hello Greg and Karen. The lives you have lived have brought nothing but harm to those around you. A pedophile who abuses his stepdaughter and a mother who turns a blind eye and allows it to continue for years. You have lived your lives caring only for yourselves. Today your will to live will be tested. The devices you wear can only be unlocked with the key that the other has down their throat. You only have to pull the line out of the other's mouth to free yourselves. The screws on either side of your head will slowly drill into your skull once the time starts. You have three minutes before they pierce your brain. Live or die, make your choice.\"\n\nThe screen cuts to static then begins a countdown from three minutes. You watch as both of them try to pull at what appears to be fishing line hanging from their mouths and secured to their shirts to prevent them from swallowing it completely. Both stop pulling almost immediately, gasping in pain. Moments later you hear the drills start up, slowly cranking their way continuously tighter as the clock ticks by.\n\nLooking back at the note hanging from the string, you walk towards it again. After a few steps, you suddenly feel the floor give way and sharp pain makes you yank your foot back. Looking down, you see that the floor in this part of the room is filled with small holes. Pressing on the corner of some of the tile, you see that it pushes down under pressure and sharp nails go through the holes from underneath.", "action_results": [null, null]}]}]}, {"action": "Let Him Die", "result": "You jump slightly as the second series of torches start burning him at his thighs, hips, and waist. Watching as Forrest writhes about in his bonds and screams in agony, you steel yourself for what you are about to witness.\n\nHis feet are nearly burnt down to the bone and the thicker parts of his legs are starting to bubble with huge heat blisters. The skin is gone where the flames hit directly, the meat of him being burnt now. It is a sickening stench that fills the room and turns your stomach sour, you've seen a lot of horrible shit in your life. But this is something else entirely.\n\nThe next series of torches cut on, lighting up his arms and shoulders. He howls in pain, his face red with effort and veins bulging in his forehead. His eyes are wide in terror, tears streaming down his cheeks. It's too late now to save him, even if you wanted too he was beyond it now.\n\nA few moments later, the final series of torches fire up. Flames lick up his throat and on either side of his ears. It lights his short hair on fire, engulfing his head in flames as his horrified shrieking intensifies then goes silent as his body goes limp. The flames keep cooking his corpse for a while as you stare transfixed at the scene, watching as his face burns away to reveal charred skull underneath.\n\nWhen the torches finally turn off, you are left staring at a burnt corpse. The air is so thick with the stench of his burnt flesh and the smoke from it that you can barely breathe. The grinding sound of a metal door opening on its own catches your attention, but you vomit when you have to walk right past his body to get to it. The smell is overpowering and you have nothing in your stomach but acid to puke up.\n\nThis room will be his tomb, you know that as you walk out of the door. But, it won't be yours.", "action_results": [null]}]}, null]}, {"action": "Watch", "result": "Crossing your arms, you stand firm and fix him with a cold stare. The stench of him cooking makes you nose burn and smoke is starting to rise up from his lower legs. The skin on his feet is gone where the flames hit, but the skin not in the direct heat is developing huge blisters rapidly before your eyes.\n\nHe continues to scream in muffled agony as you watch. It feels somehow justified to see him in pain like this. His will just be momentary, but yours lasted for years. He ruined your life. He used you and then traded you like a worthless trinket when he was done with you. There were years of your life that you could never get back.\n\nBut, his shrieking eventually leads to the thick threads holding his lips shut tearing through the skin. His once unintelligible noises are now words, screamed in pain and terror as blood oozes down his chin. It hurts to hear him in pain like that, no matter who he is.", "action_results": [null, null]}]}, {"action": "Study The Trap", "result": "Ignoring Forrest, you instead circle the machine he is trapped inside. It looks like what once was a metal gurney, rigged to support him and strap him into the device. Hoses come up from a drain in the floor, more than you can count, where they then travel up the device and latch into what looks like small welding torches situated in intervals around his limbs, torso, and head.\n\nLooking around the room, you spy what looks like a large box covered in a tarp with a note lying on top. Picking up the note, you open it to find printed text on the inside of the blank card.\n\nWhich one has the key?\n\nPulling the tarp off of the box, you find yourself staring down at a metal box with three holes just big enough to stick your arm into. Unlike the boxes before, you cannot see what is inside them. But, the tape had mentioned paying the price for his freedom. It isn't hard to guess that whatever is inside those holes isn't just a key.\n\nYou jump as a mechanical whirring starts up, bringing you to look at the countdown and finding it at zero. Glancing back at Forrest, you see flames erupt out of the welding torches positioned at his feet, calves, and knees. He squirms and shrieks in pain through his sewn shut lips, eyes wide in horror.", "action_results": [null, null]}]}]}]}, {"action": "Wrap it Up", "result": "You shove the key into your pocket for the moment and survey the damage to your hand. An injury like this can score some good quality painkillers at the ER. Unfortunately, that isn't an option at the moment, but you're sure you'll get there eventually now that you have the key out of this hell hole.\n\nUsing your uninjured hand, you stick your fingers into one of the holes in your shirt and start ripping the fabric away. You end up with a nice strip of cloth, though you aren't sure if it will be enough. Gritting your teeth, you carefully place the flap of skin back into place on the back of your hand. It burns horribly as you place the cloth over it then your hand over the top of it. Pressing it into your stomach to hold the skin flap and fabric in place, you use your hand to wrap tie it tightly into place. It isn't perfect, but it should keep the loose skin from flopping about.", "action_results": [{"action": "Open The Door", "result": "Taking the key back out of your pocket, you hurry toward the door. Your injured hand burns as the cloth cinches the degloved skin tightly into place, but you push through the pain and push the key into the lock. It turns and you can hear the loud sound of the mechanism turning as the metal door screeches open.\n\nStepping through, you find yourself in a hallway with harsh fluorescent lights in the ceiling. You walk down it, but many of the doors are chained shut with warnings against trying to open them painted in red letters. It is cold and damp out here, making you shiver as you hurry down the corridor.\n\nFinally, you come to a door with no warnings and a cassette labeled 'play me' taped to the middle of the door. Plucking it from the confines of the tape, you put it into the recorder and hit play.\n\n\"If you are listening to this, then you chose freedom over your addiction. This is just the first step to reclaiming your life, Ciara. For years you have blamed the people who came into your life for what you have become. Perhaps, you are right to blame them after they made you feel powerless over your own fate. But your obsession with blame keeps you from moving on. Beyond this door is someone who influenced your life early on. Today, you choose whether he lives or dies.\"\n\nThe tape comes to an end, leaving you feeling apprehensive about what is beyond the door in front of you.", "action_results": [null]}]}]}]}]}, {"action": "Look At The Binder On The Floor", "result": "Walking over to the binder on the floor, you pick it up and move back into a better lit area of the room.\n\nOpening it up, you find an old family scrapbook. The first few pages are filled with family pictures and little notes that your mother had written about them, but as you flip through the pages you find that your mother's scrapbook has been changed. The pages show mugshots from your teen years, progressing on into recent ones.\n\nIt's a stark change as you look at each picture. You go from from a beautiful young girl to a battered junkie with each page you turn. The final page has the words 'Cherish Your Life' written in flowing script on the back.\n\nWhat was there to cherish about your life exactly? This entire thing is fucked up. You've heard of the Jigsaw killer and the horrific things he does to people. But, what would he know about your life? There is nothing to cherish and no one would miss you if you die here.\n\nIn fact, you're sure the only person that might even notice your absence is your drug dealer would likely forget his regular customer after a few days .", "action_results": [null]}]}]}