{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=43910", "context": "", "first_story_block": "You are Ben Higgins, a person of no consequence living in the town of Van Hove. The town was large but not big enough to be a city, not that it matted to you since your world is mainly your home and the small yard around it. For most of your life the idea of going out into the world made you uncomfortable, along with the idea of social interaction. Of course when the situation called for it, like getting food or mailing a letter at the post office, you could handle it no problem, but you found it joyless and were glad when it was over. In addition you rarely watched TV or even the news on the internet, unless it was happening on your property it didn't affect you or at least that's what you believe. As for money you work from home on your computer fixing problems on other people's computers via remote desktop connections. The company you work for pays enough so you have enough food and pay the bills. What is most important is that they leave you alone while you work.\n\n\nYour little sister Victoria says you do want to go out and do more, but you're afraid. Victoria is your main source of social interaction and the only person who have any real connection to. Several years ago, your parents died in a car crash and Victoria has been living with you ever since. The two of you get along for the most part, you have the same squabble that all siblings have but you genuinely care for each other. It's summer now and in the fall Victoria is leaving for college, which is going to leave you more alone than ever. Oh sure, she is going to visit and stay here between semesters, but you know this is the beginning of her going off to forge her own path and living her own life, something you never got around to doing.\n\n\nAlas you are happy for her and would never want to hold her back. Certainly you would not want her to live the same dull and somewhat depressing existence you have. You do wonder if she is right and you do want to go out in the world and make friends but the fear is simply more than you can handle, while giving up and crawling back into bed is just too easy. If Victoria is right then what exactly are you afraid of? Not being able to fit in, or perhaps it's the shear unpredictably of life. It doesn't make a difference as you have no plans on changing your lifestyle in the foreseeable future.\n\n\nYou wake up late one morning, planning on spending the day working, you head into the narrow hallway and into the kitchen. The kitchen is cramped and needs to be cleaned soon, as you brush crumbs off the kitchen table you notice something is off. It's relatively quiet, normally when you get up Victoria is making noise doing one thing or another. She can't still be asleep, she was always an early bird, maybe she is feeling ill, you decided to check on her as you head back into the hallway and knock on her bedroom door.\n\n\n\"Vic, you alright?\" You call out while knocking.\n\n\nNo response, you open the door just a tad to peek in and see her bed is empty. After this discovery you head back into your room and grab your cell phone off your dresser. There are no text messages or voicemail, Victoria always leaves one when she heads out. You send her text asking where she is. Several minutes pass and there is no reply. Victoria is glued to that phone and she always responds quickly, even though it's usual a text to stop bugging her. You begin to worry, but perhaps you're being overprotective. Your sister is an adult and unlike you has a life, although this is a big departure from her usual behavior. Her best friend is Moira Estacado, she owns the bar and restaurant \"Moira's\" located in the center of town. Maybe she would know where your sister is, or you could search Victoria's room, there might be something there you could find.", "action_results": [{"action": "Go to Moira's", "result": "Moira Estacado is Victoria's best friend and a mother figure to her since your mother died. She's a bit older then Victoria which made her instantly cool in your sister's eyes. The fact that she owned a bar and restaurant just increased the cool factor. Personally, you can't stand her, she's obnoxious, annoying and in general a pain. Vic tries to explain that Moira likes to tease and it's just harmless fun, but you aren't convinced. Still if there is someone who would know where sister is it's her. You leave your house and get into your car noticing that the rust on the hood is beginning to spread.\n\n\nA bit of drive later you arrive at Moira's, it's still early, but you know she will be there. Moira is very dedicated to the bar and restaurant, always making sure it is running smoothly and her workers aren't slacking off. She spends as much time there as you spend secluded in your house. There is plenty of parking as it's too soon for the lunch crowd. After parking your car near the front you head in and see the waiter and hostess talking to each other, not expecting a customer so soon after opening. They seem a bit puzzled by your presence and attempt to interact with you, but you're focused on asking to Moira about Victoria and ignore them. You spot her at the bar cleaning a glass, her shoulder length red hair makes her stand out easily. She notices you approaching and a mischievous smile appears on her face. \n\n\n\"Well look who decided to crawl out from under a rock,\" Moira greeted. Her attitude was already getting under your skin, but you had to see if she knew about Victoria.", "action_results": [{"action": "\"Hello Moira, nice to see you\"", "result": "\"Hello Moira, nice to see you,\" You manage to say without showing how annoyed you are at her greeting.\n\n\n\"Wow, who are you and what have you done with Ben?\" Moira responded, getting you more annoyed.  \"I mean not only did you leave your house, but you're talking without sounding like a dick.\"\n\n\n\"Look, I can't find Victoria, can you tell me where is she, she's not answering her phone and I just want to make sure she's alright.\"\n\n\n\"Will you relax, she's probably still at Steve's house, they left here together last night.\"\n\n\n\"Who the hell is Steve?\"\n\n\n\"You mean you don't know, wow just wow, Victoria always said you were a bit obvious to things, but I didn't know it was to the point where she can date a guy for a month and you remain completely clueless.\"\n\n\nThe mention of Victoria having a boyfriend caught you off guard. You're pretty sure Victoria never mentioned him, maybe she was worried you'd get upset or maybe simply she never told you because you never asked. Are you really that withdrawn? Now is not the best time to worry about this, it's better stay focused on finding her.\n\n\n\"Are you sure she's there?\" You ask.\n\n\n\"I'm not positive but it makes sense, last night Victoria was here for a bit then Steve came and picked her up, I assume she spent the night there since she isn't at your house,\" Moira explains.\n\n\n\"Why would she spend the night there?\"\n\n\n\"Jesus, are you really that socially inept, do I really have to explain why she would spend the night at her boyfriend's house?\"\n\n\nYou ponder for a second and then as the realization hits you, a look of disgust appears on your face.", "action_results": [{"action": "Ask where Steve lives", "result": "\"Please, I need to know where Steve lives so I can check on Vic,\" You plead.\n\n\n\"Alright, since you're actually making an effort to be pleasant, he lives on 48 Kerr Road, but you didn't here that from me,\" Moira reveals.\n\n\n\"Thanks Moira,\" you say as you quickly head out.\n\n\nYou get into your car and drive off to Kerr Road. You know where it is since you use it to reach the grocery store in town. As you approach the house, you notice there is a car in the driveway blocking any other car from using it. In addition there is no parking on this street, forcing you to go to the supermarket, use their parking lot and then walking several blocks back to the house.  You get quite annoyed of how complicated this is becoming but you need to make sure everything is OK with Victoria.\n\n\nWhen you're back on Kerr Road. You walk up Steve's house and ring the doorbell. A few minutes go by with no response, as you go to ring the bell again, you notice that near the door knob are scratch marks. Looking close you see that the wooden frame surrounding the door is damaged near the knob and the lock is broken, somebody had broken in. Worried about your sister you rush into the house.\n\n\n\"Victoria!\" You shout but there is no response.\n\n\nAs you run down the foyer you notice out of the corner of your eye someone sitting in a lounge chair in a room to the right. You walk in to talk to this man when you notice that his throat is slit and a \"W\" is carved into their chest. You need to get out of here now!", "action_results": [{"action": "Run out front door", "result": "In a panic you run back into the foyer and head out the front. At the same time the police have arrived and quickly get out of their cars to draw their guns on you.\n\n\n\"Get the fuck on the ground!\" One screams at you.\n\n\nThey completely ignore you as you try to explain what happened and that you didn't kill the man in there. They handcuff you quickly and place you in the back of one of the cruisers. You later learn that the dead man is Steve, Victoria's boyfriend and spend the next several days in a jail cell. Finally you're let go since there is no evidence that you killed him, but soon that doesn't matter, as upon being released you learn the police have found Victoria's body.", "action_results": []}, {"action": "Find a back exit", "result": "You run out of the room and head towards the back of the house hoping to find a back way out. At the end of the foyer is a glass sliding door that is already opened, whoever killed that man must have taken the same route. You dash outside and find yourself in the backyard. Still running at full speed you reach the chain-link fence surrounding the perimeter and are able to jump over it. As you jump you hear the sounds of sirens, the police have arrived at the house. You run across a few more yards before you feel you're a safe enough distance away and begin to walk back to the super market. You can only hope no one saw you enter or leave Steve's house.\n\n\nAfter making your way back home, you head into your room and sit at your computer. You begin searching for the internet for clues on who murdered the man back in Steve's house. You search for \"murder victims with W carved in them\" and along with seeing several graphic photos, you learn it is the MO of a crime lord named \"Westfield\". Further searching and you find a web page explaining who this \"Westfield\" is:\n\n\nReal name: Unknown\n\n\nAlias: Westfield\n\n\nCrimes believed to have committed or involved with: murder, human trafficking, drug trafficking, drug dealing, armed robbery, illegal gambling and extortion\n\n\nBio: Westfield runs a gang simply called \"Westfield's gang\", operates in several counties but base of operation is believed to be in Van Hove. One of the gang's most famous MO's is carving a \"W\" on the body of people murder by them. Due to real name and appearance being unknown, rumors of West actually being several people have circulated along with rumors that several high ranking members of the Van Hove police are on Westfield's payroll, hence the lack of progress on catching or even identifying the crime lord. Van Hove Police have denied these allegations and internal investigations have turned up no evidence.\n\n\nYou turn off the computer. While the details aren't clear you know that Westfield is connected to your sister's disappearance. Calling the police would be the most logical choice, but if the rumors about some of them on Westfield's payroll are true, you could put yourself and Victoria in danger. A second option is to do an independent investigation, Victoria used to have a friend named Sophie Glass, their friendship ended when Sophie developed a drug problem and got involved in the seedy underworld where Westfield would reside. It's extremely dangerous, but being under the police's radar might save Victoria.", "action_results": [{"action": "Call the police", "result": "Trying to find your sister and possibly going up against a wanted criminal would be suicide. Corrupt or not calling the police is the more logical thing to do. You pull out your cell phone and call 911\n\n\n\"911, what is your emergency?\" The operator on the other end inquiries.\n\n\n\"My sister is missing and I think Westfield murdered her boyfriend,\" You answer.\n\n\n\"I need your name, sister's name and sister's boyfriend name.\"\n\n\n\"I'm Ben, Ben Higgins, my sister is Victoria Higgins and her boyfriend's name is Steve, I don't know his last name.\"\n\n\n\"What's your address?\"\n\n\n\"219 Okonedo Street.\"\n\n\n\"Alright, I'm sending someone over.\"\n\n\nSeveral minutes later a police car pulls into your driveway shortly followed by a knock at the door. You open the door to find a young women with light brown hair in a bun and eyes also light brown. You would find her pretty if wasn't for the serious look on her face.\n\n\n\"Hello, I'm detective Carla Northcutt are you Ben Higgins?\" She questions you with a no non-sense demeanor.\n\n\n\"I am, come on in,\" you respond in a direct way.\n\n\nThe detective walks in and turns her attention back to you.\n\n\n\"I got to admit, I'm a bit confused here, you called in saying your sister is missing her boyfriend has been murdered and you think the notorious Westfield is behind it, do you mind telling me in detail what happened?\"", "action_results": [{"action": "Tell the truth", "result": "\"When I woke this morning my sister was missing, I waited around a bit for her to come home, around two I went to see her best friend Moria to see if she knew, it turned she had a boyfriend so I went to his house to see if she was there, the lock on the door was broken and I walked in, I found who I believe was Steve sitting in a chair with his throat slit and a 'W' carved in his chest, I freak out, ran out the back door, I heard police sirens but I had parked a couple of blocks away at a grocery store so I assume they didn't notice me and then I came home, when I learned that the W was a trademark of a violent criminal named Westfield I called you\", You tell honestly.\n\n\nCarla gives you an odd look, as if trying to figure out what you said was the truth or not. After a few moments the look goes away. \"I believe you,\" She decides.\n\n\n\"You do?\" You respond somewhat surprised.\n\n\n\"I deal with liars all day, I've developed a talent for sniffing out lies, and I can tell you're being honest.\"\n\n\n\"So is this Westfield behind my sister's disappearance?\"\n\n\n\"All evidence points to that, we should-\"\n\n\nCarla stops in the middle of her sentence. You hear the sound of footsteps approaching the front door.\n\n\n\"Get to the back of the house!\" Carla demands.\n\n\n\"What's going-\"\n\n\n\"Go!\"\n\n\nYou sprint to your bedroom while Carla follows. \"Stay the fuck down!\" she continues to order.\n\n\nYou quickly hide under your desk as you hear the sound of your front door being kicked in. Footsteps get close to the bedroom as Carla pins herself against the wall adjacent to the wall. A man with a gun walks in, completely unaware of Carla, he still fails to notice her as she points her gun at his head and pulls the trigger.  Your stomach is immense pain due to the combination of fear and the site of seeing the man's brains getting blown off. A second set of footsteps is heard outside.\n\n\n\"I know you're out there asshole\" Carla yells.\n\n\n\"Detective Northcutt, there is no need to worry, I'm under strict orders to bring you in alive, Ben if you're in there, the same goes for you,\" The man calls out from the hallway.\n\n\nCarla steps back and turns facing the wall. She points her gun at it and fries through it, you hear the sound of the man scream and then a thud. \"These fuckers never seem to realize walls aren't bulletproof,\" Carla states.\n\n\nSlowly you emerge from out under the desk. \"What the fuck is going on?\" You yell.\n\n\n\"Calm down, Ben\"\n\n\n\"Don't tell me to be calm, my sister is missing, there are bullet holes on my wall and two fucking corpses in my house.\"\n\n\nCarla walks over and grabs you by the shoulders. \"Those were Westfield's men, when you called in about the murder, your sister disappearing and that you believed Westfield was behind it, I took the case so that an officer on his payroll couldn't get to you first, however someone in the department tipped him off where I was and what I was doing, so those thugs were sent to deal with me and you as well since you're a lose end, now right now you're the only person I know who is on my side and I need you to get a grip.\"\n\n\nYou take a deep breath and recompose yourself.", "action_results": [{"action": "\"Westfield has cops on his side?\"", "result": "\"Westfield has cops on his side?\"\n\n\n\"Yes, it's an open secret, when I became a detective, some of the officers tried to convince me to join their team, I didn't and then they tried to convince me not to interfere with anything related to Westfield's gang, I didn't and they responded by making sure I got shit assignments and never moved up in the force, that didn't stop me from trying to bring this monster down, you're lucky I was able to respond that call, another hour and my shift would've been over and who knows what would've happened to you, anyway I guess that was the last straw for them, so they sent those goons to kill me and you as a loose end\"\n\n\n\"Why not go to FBI? You suggest. \"There has to be someone high enough up who isn't on the take.\"\n\n\n\"It would just be their word against mine, there's more than enough of them to portray me as some overworked paranoid detective, destroying any credibility I have, even if the FBI where to do an investigation they wouldn't find anything because they don't want to find anything, it's always been easier to pretend a problem doesn't exist then actually fix it.\"", "action_results": [{"action": "\"What about Steve's murder?\"", "result": "\"What about Steve's murder?\" You wonder.\n\n\n\"Homicide won't get anywhere with that case, if a cop isn't being paid off, then they are most likely scared shitless of the ones who are, that 'W' that is carved on Steve isn't a trademark, it's a message to the police to back the fuck off,\" Carla points out.", "action_results": [null, {"action": "\"What do we do now?\"", "result": "\"What do we do now?\" You ask Carla.\n\n\n\"First thing we need to do is get out of here, if we stick around more of Westfield's grunts are going to show up\" Carla warns.\n\n\nThe two of you head out of your bedroom and into the hallway, the man Carla had shot through the wall lays on the ground when he begins to groan.\n\n\n\"Holy shit he's still alive\" You say in amazement.\n\n\nCarla walks to him, takes out her gun and points it at him.\n\n\n\"Where's Westfield?\" Carla interrogates.\n\n\n\"Versweyveld...Chemicals...his office...is in... the administration... building\" The man revels.\n\n\n\"How do I know you're not fucking with me?\"\n\n\n\"He'll...kill you...if you...go...there...you...should leave...town\" The man says before succumbing to his wounds.\n\n\nCarla checks his pulse and confirms he's dead.\n\n\n\"Getting that information was easy\" You notice.\n\n\n\"The police have likely known Versweyveld chemicals has been Westfield's base of operations for years, if they had wanted too they could've brought him down a long time ago, the place is on the outskirts of town, we need to get there now\"\n\n\nBefore you head it Carla walks into the kitchen and rummages through the drawers, pulls out a steak knife, and places it in a hidden ankle holster under her pant leg.\n\n\n\"Just in case,\" She answers the question you were thinking.\n\n\nThe two of you head out of the doorway into the front yard.\n\n\n\"We need to take your car, they'll spot a police car a mile away\" Carla tells you.\n\n\nYou go inside to grab your car keys, while you're doing that Carla grabs a shotgun out of her squad car, when you unlock the car doors she places it in the back seat.\n\n\n\"Just in case\" She informs you again.\n\n\n\"What exactly is the plan?\" You ask with uncertainty in your voice.\n\n\n\"We go down this chemical plant, I'm going to find Westfield and then I'm going to kill him, if Victoria is there, I'll get her out if she is there, if not, I'll at least be able to find out where she is, finally I'm going to find something that will prove certain officers are linked to Westfield\" Carla lays out.\n\n\n\"Don't we need a warrant for the evidence to count or something?\"\n\n\n\"There's a journalist named Ryan Walker, if we find something proving corruption he can publish an article about it and the FBI will be forced to investigate\"\n\n\n\"How come you trust me?\"\n\n\n\"I said earlier, I've dealt with liars, I've also dealt with criminals, people with ulterior motives and plenty of scumbags, you're none of those things, not to mention I have very few people on my side right, now if you're done asking questions I'd like to get going.\"\n\n\nYou get into your car while Carla sits in the passenger seat. Night has fallen as the two of you drive to Verseweyveld chemicals. The drive is mostly silent as you're solely fixated on making sure Victoria is rescued while Carla mentally plans how she is going to break into a place that is mostly likely filled with armed guards who will shoot on sight. After about twenty minutes of driving you arrive near the entrance of the chemical plant, but far enough away to avoid being spotted. The plant itself consists of several buildings and is surrounded by a razor wire fence. The sole way in and out is through an open gate with a security booth behind it.\n\n\n\"Keep the headlights off, if I'm not back in half an hour, you get the hell out of here,\" Carla instructs.\n\n\n\"And go where?\" You inquire.  \n\n\n\"As far from Van Hove as you can get.\"\n\n\nCarla grabs the shotgun in the back seat and gets out of the car, the detective walks through the entrance of the gate and arrives at the security booth. She points the gun at the doorway of the booth and a man walks out with his hands up, they briefly talk before Carla hits the guard with the butt of the shotgun, knocking him out.  She searches the guard and takes his gun off him, you begin to wonder if it's determination or obsession that is driving her. Carla walks  further into the courtyard of the plant and vanishes into the darkness. Thirty minutes later she has yet to reappear, you need to decide what your next course of action should be.", "action_results": [{"action": "Drive off", "result": "Carla told you to get hell out of dodge if she didn't return and you decide to do just that. You make a U-turn and drive out of town, not bothering to return to your house. After an hour of driving you figure you're a safe enough distance away from Van Hove and stop at a motel. After checking into a room, you lay on a bed too tired to figure out what to do next and doze off. For the next two days your life is hiding away in the motel, not stepping outside and using your debt card to have food delivered. It's not all that different from the way life was before, except now you have even less social interaction and you are confined to a much smaller space. Late afternoon on the second day you hear a knock at the door, through the peephole you can tell it's a police officer, you don't if this a good thing or a bad thing, but you do know you can't keep this life of hiding in a motel room forever so you decide to open the door.\n\n\nThe officer had a patch on his uniform that says \"V.H.P.D\" and his tag read \"Miller\".\n\n\n\"You can come back to Van Hove now, Ben,\" The officer informs you.\n\n\n\"Who are you?\" You demand to know.\n\n\n\"There's no need to fear me, I mean at first we were going to kill you but after he cooled down, the boss gave specific instructions to let you go back home and live out your life, providing you keep you're mouth shut of course, hell we even took care of the 'guests' you had over, you're quite lucky, the boss is almost never this generous.\"\n\n\n\"How'd you find me?\"\n\n\n\"We just searched every motel in the county, it was quite easy\"\n\n\n\"What about my sister and Detective Northcutt?\"\n\n\n\"Victoria's at the Van Hove city morgue, waiting for someone to claim her, the boss was kind enough to allow to give her a decent burial, as for Northcutt, well the less you know the better\"\n\n\n\"Why did Westfield take my sister?\"\n\n\n\"Son, questions like that are going to get you in a heap of trouble, best to just let it go\"\n\n\nOfficer Miller walks out and heads to his police cruiser in the parking lot while sit on the bed and process everything that has happened.\n\n\n ", "action_results": []}, {"action": "Enter the chemical plant", "result": "This is most likely going to get you killed, you have no weapon and no idea what to do if you actually run into Westfield, but you need to save your sister and possibly save Carla as well. You exit your car and head towards the entrance. While walking past the security booth, you spot the guard Carla knocked out still inside, even though he was hit thirty minutes ago. You notice his chest is still moving indicting he isn't dead. You reach the courtyard where you last saw Carla and approach a sign in the middle of it. The sign has the names of the different buildings in the area and arrows point where they are, as you look at the sign you try to remember what the guy back at your house said where Westfield would be.", "action_results": [{"action": "The administration building", "result": "You remember the man telling Westfield's office was in the administration building and that's where Carla definitely went. The sign informs you that administration is straight ahead and you go in that direction.  When you arrive you see the building itself is a two story building made of brown brick. It would be foolish to go head with a wanted criminal without a plan, but before you can think of one you hear a loud popping sound coming from within the building. You're about to run off when two large armed men approach you with their weapons drawn. With no place to go you put your hands up.\n\n\n\"Keep him here, I'm going to find out what the fuck is going on,\" one of the men tells the other as he heads into the building.\n\n\n\"Don't think about moving shithead,\" The second man threatens you.\n\n\nSeveral minutes later the first man comes back out. \"Bring him in,\" He instructs the other man.\n\n\nYou're brought into the building at gun point and taken down a long corridor.  At the end of the hallway is a pair of doors with the words \"Conference\" written on one of them.  One the men opens the door while the other shoves you inside. In the conference room you see a man sitting at the head of a long table with his feet resting on the table. He has slick backed blonde hair and is wearing a white t-shirt and jeans. On his right hip is a holstered revolver. To the left of him is a third large well built man holding Carla by the arm, she now has a bruise on the side of her face. Standing to the right of man sitting  is Victoria who understandably looks terrified.\n\n\n\"Vic!\" You call out to your sister.\n\n\n\"I'm sorry Ben it's my fault we're in this situation,\" Victoria responds.\n\n\n\"What the fuck are you doing here Ben?\" Carla yells at you.\n\n\nBefore you can answer the man sitting in the chair gets up, turning his attention to you. \"So you're Ben, I have feeling you have a lot of questions,\" The man correctly assumes, \"Well to answer your first question, I'm Westfield, I'm the one who is responsible for the bad day you're having, you see your sister's boyfriend Steve, had a gambling problem and wound up owing me a lot of money, since he wasn't able to come up with the money, he offered you're little sister instead, see I run this brothel, and Victoria would be a great addition to it\"\n\n\n\"Then why kill Steve anyway?\" You ask while absorbing the information Westfield has told you.\n\n\n\"The man literally sold out his girlfriend, It's just common sense not to keep a man like that around,\" Westfield explains, \"Well I suppose that explains almost everything, I'm sure Northcutt here has bored you to death about the details of her crusade against me, the only question that is left is what I'm going to do with you three?\"\n\n\n\"Just let us go, we're no threat to you,\" You beg.\n\n\n\"You know I went through a lot of trouble to get your sister, if I gave her back I'd be losing money, but I'm in a generous mood tonight, I'll give you my word I'll let you and Victoria go as long as the two of you never speak of this to anyone, Northcutt on the other hand I've given plenty of chances to keep her nose out of my fucking business but she wouldn't listen, my generosity only goes so far.\"\n\n\n\"Don't worry about me, just focus on getting yourself and Victoria out of here,\" Carla advises.", "action_results": [{"action": "Insist on letting Carla go", "result": "\"Let Carla go, you've already proved your point,\" You plead.\n\n\n'This isn't a negation you idiot,\" Westfield says while getting impatient.\n\n\nYou notice out of the corner of your eye you see Carla slowly reaching down to her ankle with her free arm. The man who is holding her by the other arm doesn't seem to notice this as he is currently focused on you, as are the two men behind you. Quickly it occurs to you that Carla still has the steak knife she took from your house, if you can just distract everyone for just another moment, she'll be able to reach it.\n\n\n\"Ok fine you win, can you let Victoria go now?\" You say while Carla inches her hand closer to the knife.\n\n\n\"Smart move,\" Westfield says as he turns his attention to your sister. \"You can go to your brother now.\"\n\n\nVictoria runs to you and the two of you hug. \"Let's get out of here,\" Victoria strongly suggests.\n\n\n\"Are you alright, did they hurt you?\" You say with both legitimate concern and to buy Carla more time.\n\n\n\"I'm fine, please let's get the hell out of here,\" Victoria begs.\n\n\nYou begin turn around to head out of the conference room, when Carla reaches the knife under her pant leg and quickly swings it into the stomach of the guy holding her by the arm. Westfield gets up and pulls the revolver out of its holster, but Carla is able smack it out of his hand and it lands very close to you. Carla and Westfield begin to grapple with each other and the two appear to be of even strength. The two men who were once behind you begin to run to help Westfield, you have to do something before Carla gets outnumbered.", "action_results": [{"action": "Tackle one of the men", "result": "You run up to one of the men and try to tackle them. Unfortunately the man is very muscular and you are not. When you try to bring him down you feel like you've ran into a brick wall and stumble back. The man turns around and shoots you several times, while the second man helps Westfield get the edge on Carla. The good news is that when you were shot Victoria ran out of the room and the remaining people are focused on Carla, giving your sister lots of time before anyone notices she's gone.", "action_results": []}, {"action": "Grab Westfield's revolver", "result": "You grab Westfield's revolver that Carla knocked out of Westfield's hand. Despite your limited knowledge of using a gun, you figure it's the only chance you have. Aiming at the back of one of Westfield's thugs you pull the trigger. The bullet hits the man in the right arm and falls to the floor in pain. The kickback from the gun is more than you'd except and it causes you to lose your balance and fall backward. The second goon turns around upon hearing the gunshot and aims his gun at you, but before he can fire Victoria grabs his hand. He is easily able to knock her away from him, but your sister has bought you enough time to aim the gun at him and fire, before he can do the same to you. The shot you fire this time hits in thigh and like the first guy, he falls to the ground in pain.\n\n\nWestfield and Carla are still locked in a struggle, oblivious to what's going on around them as they are only focused on each other. You walk up to Westfield as he grapples with Carla, putting the gun a few inches away from his head and pull the trigger.  Westfield's body and Carla both fall to the ground. The detective takes a moment to analyze the situation and when she figures out the danger has passed she picks herself up.\n\n\n\"What the fuck were you thinking?\" Carla scolds you. \"I told you to wait in the car.\"\n\n\n\"You took more than thirty minutes and I got worried about you and my sister,\" You explain yourself.\n\n\n\"My brother just saved your life, show a little gratitude,\" Victoria sticks up for you.\n\n\nCarla takes a few moments to regain her composure. \"You're right, I'm sorry, are the two of you OK?\" Carla says more calmly.\n\n\n\"I'm all right, but I'm beginning to recognize I just shot three people,\" You respond.\n\n\n\"Try not to think about it, I can tell from experience that only makes it worse, just stay focused on the task at hand,\" Carla advises.\n\n\n\"Right, Vic are OK?\" You ask your sister.\n\n\n\"Yeah, I'm just tired, it's been a very long day\" Victoria answers.\n\n\n\"How'd they catch you?\" You ask Carla.\n\n\n\"I managed to get into Westfield's office, I was looking for something linking him to the corrupt cops, I must have lost track of time and then this guy enters, he wasn't even aware I was in the room, just by fucking chance he walks in, I managed to shoot his head off, but then more come in, I was outnumbered, they confiscate my guns and then take me into this room, Westfield was already in here with Victoria\" Carla recalls.\n\n\n\"After they killed Steve I was brought here, I had to listen to Westfield ramble for hours about how no one was respecting him anymore, something about a tombstone in Canada and  in the morning they were going to take some brothel, If you didn't find me, I...I don't want to think about it.\" Victoria describes.\n\n\n\"Well we should get out of here\" You suggest.\n\n\n\"Aren't Westfield's men going to looking for us?\" Victoria worries.\n\n\n\"They're going to be too busy killing each for the leadership position to care about us, over years I've learned that Westfield's gang was way too dependent on him to keep them unified, with his death they will fall apart and the cops who were getting kickbacks will now be in hurry to prove their innocence so we won't have to worry about them\". Carla answers.\n\n\nIn another room you can hear a phone ringing. \"That must be coming from Westfield's office\" Carla assumes.", "action_results": [{"action": "Answer the phone", "result": "\"It'll be suspicious if no one answers that phone,\" You decide.\n\n\n\"I'll take you to the office,\" Carla offers.\n\n\nCarla walks out of the conference room and you begin to follow, with Victoria following you. As you walk out of the room you look at the two henchmen you shot earlier, it's hard to tell if you've killed them or if they have simply passed out from the pain. As soon as you get out of this place it won't matter. You continue to follow Carla into corridor, she makes a right into a somewhat shorter corridor and finally stops at an office on the left hand side.\n\n\n\"Answer it, I'll keep a lookout\", Carla instructs.\n\n\nYou head into the office trying not too hard to look at the body with half of its head blown off on the floor. Leaning against the back wall is the shotgun Carla had brought with her, it was most likely taken from her when she got caught. Next to the gun is a window that has moonlight shining through it. In the middle of the room is a desk and you answer the phone on it.\n\n\n\"Hello?\" You greet.\n\n\n\"Is everything alright over there?\" The voice on the end asks, \"We heard a few shots being fired.\"\n\n\n ", "action_results": [{"action": "\"It's nothing\"", "result": "\"It's nothing,\" You respond.\n\n\n\"Uh, alright,\" The voice on the other end answers before hanging up.\n\n\n\"Well?\" Carla says as she and Victoria walk in.\n\n\n\"I don't think they bought it, there's probably going to be quite few guys here in a moment,\" You predict.\n\n\n\"Shouldn't we call the police?\" Victoria recommends.  You said they'd be helpful now that Westfield is dead.\"\n\n\n\"We'd dead before we get here\" Carla rejects, as she walks over to the window on the back wall and tries to open it, only to realize it's sealed shut.\n\n\n\"What are you doing?\" You ask.\n\n\nCarla doesn't respond, instead she grabs her shotgun resting against the back wall and smashes the window with the butt of the gun, destroying the glass.\n\n\n\"We'll head out this way and make a dash for the gate,\" Carla orders.\n\n\nShe leaps out the window with you and Victoria following suit. Your hand begins to bleed as you've cut yourself on the glass shards, but that is the least of your worries right now. The three of you run back towards front gate where you entered. You see men entering the administration building but they fail to notice you as the darkness provides cover. You reach the middle of the courtyard and see several men between you and the gate.\n\n\n\"Now what?' You say defeated.\n\n\n\"I'm going to create a distraction, you get your sister out of here,\" Carla commands.\n\n\n\"What about you?\" You object.\n\n\n\"Go!\"\n\n\nCarla runs to the opposite end of the courtyard and fires her shotgun in the air causing the men to run towards her direction and giving a chance to escape.\n\n\n\"We can't just leave her here,\" Victoria protests.\n\n\n\"There's nothing we can do,\" You bluntly state.\n\n\nYou and Victoria reach the front gate and run out to your car still parked on the narrow the street. The two of you quickly get in, followed by you starting the engine, making a very sharp U-turn and flooring it out of the area.", "action_results": [{"action": "Two weeks later", "result": "You sit at the bar at Moira's looking at the bottle of beer you've finished drinking a while ago. Moira is working behind the counter and comes up to you when she sees you in your sad state.\n\n\n\"What's on your mind hun?\" Moira asks with concern.\n\n\n\"Sill thinking about Detective Northcutt,\" You answer, \"She didn't hesitate for a moment to sacrifice herself for two people she  barely knew.\"\n\n\n\"From what I heard about her, she was the kind of person who always did what was right and not was convenient\"\n\n\nYour cell phone vibrates and you quickly take it out of your pocket.\n\n\n\"Please come home now\" A text from Victoria reads.\n\n\n\"I got to get going, how much do I owe you?\"\n\n\n\"It's on the house.\"\n\n\nYou get up off the bar stool and head out of the restaurant. Soon you're in your car driving, but before you head home, you make a stop at the cemetery. When you get out of your car it's pitch black, but you remember the way from the funeral a few days ago. You knew you'd found the right tombstone because it was larger and of a better quality then the others. The biggest giveaway however, was a light shining on it, all paid for by the city of course. A combination of both fresh and dry flowers lay in front it. You reach the tombstone and read the inscription:\n\n\nDet. Carla McGowen Northcutt\n\n\nMarch 3rd 1987- June 25th 2016\n\n\nDied in the line of duty, her bravery and courage will be the example all officers of the law will follow.\n\n\nYou put your hand on the grave.\n\n\n\"Thank you.\"", "action_results": []}]}, {"action": "\"Northcutt tried to sneak in\"", "result": "\"Northcutt tried to sneak in\" You reply.\n\n\n\"Oh shit really?\" The voice on the other end responds.\n\n\n\"Yeah, but we got it all under control.\"\n\n\n\"I always knew that bitch was going to do something crazy one day, does the boss need help?\"\n\n\n\"No, no, he wants alone time with her and doesn't want to be disturbed if you know I mean.\"\n\n\n\"I hear you, let me know how it goes.\"\n\n\n\"Will do\" You say and then hang up the phone.\n\n\n\"Well?\" Carla asks.\n\n\n\"I think they bought it, but sooner or later they are going to figure it out\" You deduce.\n\n\n\"Then let's go already\" Victoria impatiently suggests.\n\n\nThe three of you head out the front of the administration building, very quietly you walk across the courtyard and head towards the front gate. The man in the security booth is still knocked out, allowing you to reach your car still parked on the narrow road and drive off.\n\n\n\"Where to?\" You ask Carla.\n\n\n\"To the police station, they are in for a fucking shock\" Carla answers.", "action_results": [{"action": "One month later", "result": "You walk into Moira's bar and restaurant. It's very crowded but you're able to see Carla sitting at one of the tables. She had asked you to meet her here, although didn't explain why.  You wave to her as you make your way toward the table.\n\n\n\"Glad you could make it,\" She greets as you sit down.\n\n\n\"What's this about? You ask somewhat confused.\n\n\n\"I normally at suck at these, but I wanted to thank you for saving me back at the chemical plant.\"\n\n\n\"You helped me rescue my sister, there's no need to thank me.\"\n\n\n\"I'd be dead or who knows what if it wasn't for you, the least I can do is buy you a drink, how is Victoria by the way?\"\n\n\n\"Victoria is doing pretty well considering all that happened, she's really looking forward towards college, I think that's helping her cope.\"\n\n\nMoira arrives at the table carrying a tray with two beer bottles. She puts one in front of you and the other in front of Carla. \"How much do I owe you?\" Carla inquiries.\n\n\n\"No charge for the future chief of police,\" Moira insists before quickly heading off to severe another patron\n\n\n\"You're going to be the new chief of police?\" You inquire as you twist off the cap of your beer bottle.\n\n\n\"Most likely, nearly the entire police force is being gutted and it's going to be my job to rebuild it from the ground up, paperwork and politics aren't my forte\" Carla informs you before taking a sip from her beer bottle.\n\n\n\"At least you don't have to worry about Westfield anymore.\"\n\n\n\"Yeah but someday there is going to be another who will take his place and we will be right back where we started from.\"\n\n\n\"That's not true, you restored people's faith in the police force of this town and as chief, you can make sure it never losses that faith again.\"\n\n\n\"I'll drink to that,\" The two of you clink your bottles and each take a sip.", "action_results": []}]}]}, {"action": "Don't answer the phone", "result": "\"Forget the phone, let's just get out of here,\" You decide.\n\n\nThe three of you head out of the conference room, run through the corridor and out of the administration building. Once outside you continue running towards the gate from which you entered. As you're about to exit, you see a black sedan driving behind you. The rear driver seat window opens, a man holding a gun leans out of it and open fires. You're hit in the back and fall to the pavement. The man then tries to fire at Carla and Victoria but they vanish into right. You will always be remembered as the man who heroically sacrificed himself to bring down Westfield and save your sister, there are worse ways to die.", "action_results": []}]}]}, {"action": "Take offer", "result": "\"Alright, I promise I'll never tell anyone what I know,\" You pledge.\n\n\n\"Smart man, telling people wouldn't do you any good anyway since the cops are in my pocket, but I can't risk another person like Northcutt try to take me down,\" Westfield tells you.\n\n\nWestfield turns towards Victoria. \"You can go to your brother now,\" He informs her.\n\n\nVictoria runs across the room to you, and the two of you hug. \"Ben, let's get out of here\", Victoria strongly suggests.\n\n\nThe two of you turn around begin to head out of the conference room, suddenly you hear a popping sound followed by a strong pain in your back, as you fall to the floor dying, you curse yourself for actually taking the word of a crime lord.", "action_results": []}]}, {"action": "Chemical Storage", "result": "You're pretty sure the man said Westfield was at the chemical storage building and that's where you'll most likely find Carla. The sign informs that the chemical storage building is to the right and you head off in that direction. You reach a warehouse with a large open shutter, on the right is a sign that reads \"Chemical Storage\", you're about to head in when you hear two men talking inside. You hug against the wall outside and briefly peek in. There are two men sitting at a table playing a card game, all along the walls are giant shelves with barrels on them. Before you can decide what to do next you hear loud popping noises coming from another building. It hits you that you're in the wrong place and that Carla must be where those gunshots came from. You're about to head off, but the men playing cards at the table also heard the noise and run out with their guns drawn, when they see you they are startled and open fire, killing you.", "action_results": []}]}, {"action": "Continue to wait", "result": "Entering the plant is too dangerous but it wouldn't be right to abandon Carla, so you continue to wait. After a few more minutes of waiting you hear loud popping sounds in the distance. You turn on the engine in case at any moment Carla comes running out.  Several more minutes later you spot a shadowy figure going out the gate but as it comes into focus you realize it's not Carla but a large man holding a gun. Without hesitation you put the car into reverse and begin to back up. The man with the gun shoots and hits your right tire causing it blowout. He tries to shoot the left one as well but aims to high and winds striking the hood of your car. The bullet bounces off and goes through the windshield and into your neck. The car rolls off the road and into a ditch, you bleed to death shortly afterwards.", "action_results": []}]}, {"action": "\"Why are you so determined to get Westfield?\"", "result": "\"Why are you so determined to get Westfield?\" You question.\n\n\n\"I always wanted to be a cop, I worked my ass off at the academy and it's all for nothing thanks to Westfield,\" Carla discloses.\n\n\n\"Everything the police stands for, Westfield has turned into a joke, instead of protecting serving the people, cops in this town will happily sellout their beliefs and even harm their collogues if the price is high enough, I want to make being an officer in Van Hove honorable again and that starts with brining that fucker down.\"", "action_results": [null, null, null]}]}, null, null]}, null, null, null]}, {"action": "Lie", "result": "\"My sister's best friend, Moira Estacado called me and said that she heard Steve had been murdered and had a 'W' carved on him, the trademark of Westfield, I got worried because my sister had spent the night there and now she isn't answering her cell phone,\" You fabricate.\n\n\n\"I find that hard to believe since the police haven't told the media about Steve's murder just yet,\" Carla informs you.\n\n\n\"I also find it difficult that your sister's friend knew anything since the only person outside the police who knew a neighbor that called in and reported a person breaking into Steve's house, they sure as shit didn't know he was killed let alone the fact that someone carved a 'W' on him,\" Carla continues as she shoots down your story.\n\n\n\"Something I would believe, is that a person who didn't like the person their sister was dating would decide to murder them and try to frame it a crime lord,\" The detective deducts.\n\n\n\"I had nothing to do with Steve's death, why would I call the police if I did?\" You try to defend yourself.\n\n\n\"People never think these things through, you know I took this case because I really thought it was connected to Westfield and this was a chance to bring him down but now I see you've just wasted my time,\" Carla concludes, \"Why don't we go to the police station and perhaps there you can tell me what really happened, now are you going to be cooperative or difficult?\"\n\n\n\"Fine, we'll do it your way,\" You submit.\n\n\nCarla walks behind you and handcuffs your hands behind your back. \"This is the smartest thing you've done all day\" Carla says as she takes by the arm and leads you outside. As you leave the house, you spot a black sedan stopping in front of the house. Two armed get out and turn their attention towards you and Carla. The detective immediately pulls her gun out and shots at them. The first one goes down with a shot to the head while the second one returns fire. Carla fires at him, hitting him several times in the torso. Her victory is short lived as you've been hit in the chest during the shooting and fall to the ground. Carla runs to her police cruiser to call an ambulance, but you're already dead by then.\n\n\n ", "action_results": []}]}, {"action": "Go see Sophie", "result": "The police can't be trusted, so it seems your only hope is a former drug addict. Even if Sophia is reliable you still have no idea how you're going to rescue your sister from the most wanted man in town. First thing however is finding where your sister is and then taking it from there. You remember when Victoria and Sophia were friends, they would hang out at Sophia's place at the Fuhrman Apartment Complex and as far as you knew she still lives there. You grab your car keys and head off to see her. Night is threatening to fall as you arrive at the apartment building. You head to the entrance and read the names on the intercom. One says \"Unit 102: S.Glass\", it looks Sophia still does live here and you push the intercom button.\n\n\n\"Yeah?\" A groggy voice greets.\n\n\n\"Sophia, it's me Ben\" You tell her.\n\n\n\"Ben who?\"\n\n\n\"Ben Higgins, Victoria's brother\"\n\n\n\"Oh, Ben, hang on a sec I'll let you in\"\n\n\nA second later you hear a buzzing sound and you enter the building. After walking up a set of stairs you reach apartment 102 and knock on the door. The door opens and you see Sophia standing in the doorway, she is around your age, but bags under eyes and lines on her face made her look older.\n\n\n\"Ben so good to see you, please come in\" Sophia greets.\n\n\nYou walk into the small apartment and follow Sophia to sitting area in the back. There are two stuffed chairs across from each other that were once green but had faded badly and each had a few stains.\n\n\n\"Please have a seat,\" Sophia requests while pointing at one of the chairs. \n\n\nYou sit down one of the chairs while Sophia sits in the others.\n\n\n\"So what can I do for you Ben?\"\n\n\n\"It's my sister Victoria, she's missing and I need your help in find her,\" You respond.\n\n\n\"I'm not sure how helpful I'll be, your sister and haven't spoken in years.\"\n\n\n\"I know she was taken by Westfield, because of your...past, I felt you'd know something,\"\n\n\n\"You mean because I was a lowlife junkie, you thought I would have knowledge on other lowlifes.\"\n\n\n\"That's not what I meant.\"\n\n\n\"It sure as hell sounded like that's what you meant, and not only do you want information on any scumbag, you information on Westfield, the top dog, if you try to fuck with him he'll kill you and he'd kill me too for leading you to him.\"\n\n\n\"So you do know something.\"\n\n\n\"Why I should help you?\"", "action_results": [{"action": "Bribe Sophie", "result": "You pull out your wallet and take out all the money you have in it.\n\n\n\"Look this all I have, it's yours if you tell me what you know,\" You offer.\n\n\n\"Do I look like some fucking whore?\" Sofia angrily responds. \"You don't talk to me for years and when you finally do, it's only because you want something, I think you should leave now.\"\n\n\nYou head out of Sophia's apartment feeling defeated, you always had trouble communicating with others and this visit was just another reminder of that. When you arrive back home, you decide to call the police. Despite the rumor of corruption you're out of options at this point. You take out your cell phone and call 911.\n\n\n\"911, what is your emergency?\" The operator on the other end inquiries.\n\n\n\"My sister is missing and I think Westfield murdered her boyfriend\" You answer.\n\n\n\"I need your name, sister's name and sister's boyfriend name\"\n\n\n\"I'm Ben, Ben Higgins, my sister is Victoria Higgins and her boyfriend's name is Steve, I don't know his last name\"\n\n\n\"What's your address?\"\n\n\n\"219 Okonedo Street\"\n\n\n\"Alright, I'm sending someone over\"\n\n\nSeveral minutes later a police car pulls into your driveway shortly followed by a knock at the door. You open the door to find a man in a police officer uniform with a buzz haircut.\n\n\n\"Hello I'm Sergeant Arthur Miller, are you Ben Higgins?\" The police officer kindly asks.\n\n\n\"Yes I am, please come in,\" You respond.\n\n\nAs you turn around you hear the sound of a gun being cocked. You look behind you and see Sergeant Miller pointing his weapon at you. Without thinking you grab his hand to try to wrestle away the gun from him. During the struggle the gun goes off and the bullet goes through your abdomen, causing you go down to one knee.\n\n\n\"Fucking idiot,\" You hear the officer say as you collapse completely.\n\n\n \n\n ", "action_results": []}, {"action": "Plead with Sophie", "result": "\"Please Sophie, my sister needs you right now,\" You plead.\n\n\n\"Years ago I when needed her most, she turned her back on me instead of helping, so why shouldn't I do the same?\" Sofia countered.\n\n\n\"The Sophie I remember, would always help someone in need even if the person had hurt her, she would never let someone suffer because she couldn't let go of a grudge.\"\n\n\nThe expression on Sophie's face softens after hearing this. \"You're right, no one deserves to go through the hell that Westfield inflict on people, I'll help you try to find her\".\n\n\n\"Thank you Sophie.\"\n\n\n\"If she was taken by Westfield, that most likely means he wants her to be one of his girls, and as far as I know there are two places where you can find them, a nightclub called Ellis and Hillside Apartments, which is actually a whorehouse.\"", "action_results": [{"action": "\"Tell me about Ellis\"", "result": "\"Tell me about Ellis,\" You request.\n\n\n\"Ellis is a bar, but it's also a front for an illegal casino in the basement,\" Sophie explains.\n\n\n\"What makes you think my sister would be there?\"\n\n\n\"They have girls who serve the gamblers drinks, but in actuality they are there to distract the gamblers so they will make mistakes, kind of like any regular casino, only in your sister's case they won't have to pay her and I can tell you from personal experience they will harm her if she acts defiant.\"\n\n\n\"They would kidnap her and force her to be a waitress?\" You query. \"That seems rather excessive\"\n\n\n\"Working in a secret casino run by a crime lord is not exactly the kind of job you can put in the wanted ads, besides the free labor speaks for itself.\"", "action_results": [{"action": "\"Tell me about Hillside Apartments\"", "result": "\"Tell me about Hillside Apartments,\" You request.\n\n\n\"It looks like an apartment building, but like I said it's a whorehouse\" Sofia explains. \"Guys will go inside, they tell the 'supervisor' what girl they want, hand over cash and are given an hour to fuck as much as they want, normally the girl gets a cut of the money she makes, but in your sister's case since she is being held against her will, they won't have to pay her shit, I heard rumors Westfield was losing money, I guess forcing people to do things against their will is a way to cut operating costs.\"", "action_results": [null, {"action": "Go to Hillside Apartments", "result": "\"I think I'll check out Hillside Apartments,\" You decide.\n\n\n\"Alright, it's on 197 Hillside Street, the 'supervisor' is a guy named Ivo, a real sleazy individual, he won't tell you anything so you'll need to seek another way to find out about Victoria,\" Sophie informs you.\n\n\n\"How do you suggest I do that?\"\n\n\nSophie walks to a corner of her apartment and kneels to the floor. She removed one of the floor boards and takes out a small gray bag hidden in a hole under the floor board. Reaching into the bag Sofia pulls out a roll of money.\n\n\n\"Bribery?\" You think out loud.\n\n\n\"When you see the manager you have to give him the password, Zhavgo, he'll have one of his men pat you down so don't bring any weapons, at that point ask for Tiffany, this should cover costs,\" Sophie says as she hands you the money.\n\n\n\"Who's Tiffany?\"\n\n\n\"She's a friend of mine, and more importantly someone you can trust, once you're with her, mention you're a friend of mine and she'll tell if you Victoria is there or not.\"\n\n\nYou look at the roll of money Sofia gave you. \"Sofia this is two hundred dollars, you don't have to give me this, I can pay the fee,\" You offer.\n\n\n\"I'm going to be honest, I also want you to help Tiffany get out of there, I was able to leave because I wasn't requested very often by the costumers, Tiffany doesn't have that luxury, Westfield won't let her go because she makes him too much money.\"\n\n\n\"Alright I'll help her however I can.\"\n\n\n\"Thanks Ben I appreciate this.\"\n\n\nYou leave Sophie's apartment, get in your car and drive to Hillside Apartments. When you arrive you notice that the apartment building doesn't look anything like you thought it would, in fact it looks ordinary. Since most of your knowledge of the outside world has been through TV and movies rather than firsthand experience, the events that have happened today have made you realize the world is for better or worse not quite what you thought it was. You pull into a parking spot in front of the building and head inside. The interior looks just as ordinary as the exterior as you make your way to the front desk.  In front of the desk was an enormous man and behind the desk was a heavy set man who might as well be wearing a sign that said \"sleazy\", he must be Ivo.  They both look at you with suspicion, you figure in this business it pays to be cautious.\n\n\n\"Zhavgo,\" You greet.\n\n\nIvo looks at you with less suspicion. \"Welcome, how can I help you?\" Ivo inquires.\n\n\n\"I want to see Tiffany.\"\n\n\n\"You have very good taste my friend, she's our most popular girl, and our most expensive, but after an hour with her you'll see why, so it's two hundred dollars for sixty minutes, deal?\"\n\n\n\"Deal,\" You agree as you take the money out of your pocket and place it on the front desk. Ivo glances at it and mentally counts it.\n\n\n\"Now you're new here so I'm going to have go over the rules, you have an hour and only an hour, you can get kinky but if Tiffany feels uncomfortable with something it's a no go and last if you hurt my girl in any way we will harm you tenfold, I'm sorry if I come off as a prick but you'd be surprised how many people I get who can't follow those basic instructions, oh yeah my friend here has to frisk you before you go upstairs\"\n\n\n\"Put your hands against the wall and speared 'em\" The enormous man forcefully requests.\n\n\nYou comply and the man gives you a rather rough pat down. \"He's clean\" The man informs Ivo.\n\n\n\"Great, Tiffany is in room 207, up the stairs and last door on the left.\"\n\n\nYou walk away from the front desk and head upstairs. On the second floor in the hallway, there is a man even taller than the one downstairs. You walk past him, ignoring the glare he is giving you and reach room 207. You walk inside and find the room deprived of almost all furniture except for a bed and a nightstand in a corner. Sitting on the bed is a girl with long black hair who looks around Victoria's age. She stares at you blankly for a moment before turning her attention to an egg timer on the nightstand.\n\n\n\"Alright buddy you have an hour, I suggest you make the most of it,\" The girl says as she sets the timer.\n\n\n\"Uh, Tiffany?\" You awkwardly ask.\n\n\n\"Yeah that's me, listen hun, an hour goes by much faster than you might realize, I doubt you want to waste it on introductions.\"\n\n\n\"I'm a friend of Sophie Glass, she asked me to help you get out of here\"\n\n\n\"You know Sophie?\" Tiffany responds. \"I'll admit I was worried she forgot about me when she left this shithole, now do you mind telling who you are?\"\n\n\n\"I'm Ben Higgins, earlier today my sister got kidnapped by Westfield and I think he is planning to force her to work here, Sophie said you could help and in exchange I'll help you escape this place, I understand Westfield won't let you leave.\"\n\n\n\"Well no new girl has arrived today but that piece of shit Ivo would know if anyone is being brought in the future, we'll have to get him to talk\"\n\n\n\"Did you have something in mind?\"\n\n\nTiffany reaches under the mattress of the bed and pulls out a combat knife. \"Something I keep with me in case a client gets too rough,\" Tiffany clarifies. \"If we can get to Ivo with and scare him, we'll able to make him talk and shit himself at the same time, but first we have to take care of his protection starting with that Neanderthal in the hallway\"\n\n\n\"It sounds like you've planning this for a long time,\" You notice.\n\n\n\"You have no idea, now I'm going to scream for help and when that beast gets in here one of us is going to have to jam this knife into him.\"", "action_results": [{"action": "Have Tiffany deal with the guard", "result": "\"You can deal with the guard,\" You suggest. \"I can only imagine how times you've fantasized about this.\"\n\n\nTiffany gives you an evil looking smirk as she leans up against the wall next to the door. \"Help he's getting too rough!\" She shouts.\n\n\nAlmost immediately the door swings and the guard comes running in with his gun drawn. He begins to walk towards you but as soon as he is in front of Tiffany, she sneaks up behind him and drives the knife into his neck. Blood comes pouring out has he falls to the floor. Within seconds he is dead and Tiffany bends down to retrieve the knife from his throat, completely unfazed by the pool of blood, and then wipes the blood off the knife using the dead man's shirt. She proceeds to pry the gun from the dead but still warm fingers.\n\n\n\"So do we deal with Ivo now?\" You ask as you take a seat at the foot of the bed.\n\n\n\"No, if you go back downstairs now, Ivo will get very suspicious that you're leaving early, we have wait for the hour to be up,\" Tiffany points out as she puts the knife and the gun on the nightstand and sits down next to you. \n\n\n ", "action_results": [{"action": "Ask Tiffany how she wound up here", "result": "\"Tiffany if you don't mind me asking, how'd you wind up here?\" You request to know.\n\n\n\"A few years ago I ran away from home,\" Tiffany answers. \"I was a trouble maker, cutting class, shop lifting, staying out all night, hanging out with bad boys, you name it I did it, I eventually got tired with dealing with my parents, my teachers, the police, so one night I left, taking several hundred dollars my parents had hidden and I took a bus to Van Hove where I'd able to do what I wanted when I wanted.\"\n\n\n\"Where are you originally from?\"\n\n\n\"The town of Ronan.\"\n\n\n\"That's a rather wealthy area.\"\n\n\n\"I know, rich girl rebelling against her parents by running off, can you get any more pathetic?\"\n\n\n\"So how'd wind up working...here?\"\n\n\n\"You mean how'd did I become a whore?\"\n\n\n\"Well I wasn't going to use those words.\"\n\n\n\"You don't have to be gracious, it won't get you far in this  town, anyway once I was here I quickly learned how little a few hundred bucks would get me, within a few months I was broke and in a shitty apartment, no place would hire a runaway sixteen year old, so my landlord got me in touch with Ivo and rather than swallow my pride and go home, I started hooking, about a year ago it finally hit me what an idiot I was being, but by then it was too late, I was making so much money for Ivo, he'd never let me go, I took what money saved up and bought this knife, not just for protection, but in hope one day it would help me get out here, and I can go home, provided my parents will take me back, now it's my turn to ask a question about you.\"\n\n\nThe comment catches you off guard. \"Why you do you want to know about me?\" You reply.\n\n\n\"In order for me to get out of here and you to find your sister, we need to trust each other and that'll be easier if we know one another better,\" Tiffany tells you.\n\n\n\"Ok then, what do you want to know?\"\n\n\n\"Tell me about yourself, tell me all about Ben Higgins\"\n\n\n\"I was born and raised in Van Hove, I work from home fixing people's computer's, five years ago my parents died in a car crash, so my sister had to live with me, she's all I have, this morning I discovered she was missing, later I learned that Westfield had murdered her boyfriend and possibly kidnapped her, so here I am.\"\n\n\n\"You're not very social are you?\"\n\n\n\"Is it that obvious?\"\n\n\n\"Painfully.\"", "action_results": [{"action": "Ask Tiffany how she knows Sophie", "result": "\"How'd you and Sophie become friends?\" You ask Tiffany.\n\n\n\"She came here about two years ago, she was buying drugs from one of Westfield's dealers and when she ran out of money, she started working here, mainly to able to buy more drugs,\" Tiffany explains. \"At first no one wanted to be near her because of her addiction so I started to talk to her mainly out of pity, but I found out she was actually a decent person when she wasn't high, so for over a year I helped her get clean and eventually she was off the stuff completely, I was still trapped here, but at least I had a friend.\"\n\n\n\"When did she leave?\"\n\n\n\"Well after getting clean she was able to get a job, she had plenty of time since she was rarely requested, anyway she saved enough money to get an apartment with used furniture, it wasn't anything special but it was paradise compared to here, Ivo didn't care that she was leaving, he was probably glad he could give her room to a girl who would make more money, before she left she told me that she wouldn't forget about me and would one day help me get out of here, that was six months ago, I was beginning to lose hope and then you came along,\" Tiffany revels. \"Ok, my turn to ask you how do you know Sophie?\"\n\n\n\"She was a friend of my sister, Victoria, after Sophie became addicted Victoria wanted nothing to do with her, at the time I didn't think anything of it, but now I'm beginning to wonder if what she did was right.\"\n\n\n\"People make mistakes, hell I know that better than most.\"", "action_results": [null, {"action": "Continue to wait", "result": "You continue to sit on the bed waiting for the hour to be up. Your eyes focus on the dead guard in the room and the sight makes you uneasy, which is immediately noticed by Tiffany.\n\n\n\"You're not going lily livered on me are you?\" Tiffany questions with concern.\n\n\n\"I just...being in the same room as a dead body is not something particularly enjoy,\" You answer.\n\n\n\"Look, more people are going to die before this is over and if you're not focused, you, me and your sister are fucked, not to mention you're the one who has to take care of Ivo and the brute with him.\"\n\n\n\"Why do I have to do it?\"\n\n\n\"When the hour is up, he'll except you to leave, if I go downstairs he'll very quickly figure out something is up.\"\n\n\n\"Killing people...I don't know if I can do that.\"\n\n\nTiffany grabs you by the wrists. \"Listen to me, those scumbags aren't people, they are monsters who do horrible things to others just to make money, if we don't do this, they are going to force your sister to fuck people.\"\n\n\n\"I don't know how to use a gun or any kind of weapon,\" You mention.\n\n\nTiffany gets up off the bed and picks the gun off the nightstand. \"It's easy, the safety is off so you just aim and shot,\" Tiffany instructs. \"Don't try for a headshot, it's much more difficult than it looks, a few shots to the torso is just as effective\"\n\n\nTiffany puts the gun down and picks up the combat knife. \"Do you mind standing?\" She requests.\n\n\nYou stand up and face Tiffany, once again she grabs your wrist and puts the knife in your hand. \"To use the knife just jam into the side of their throat, either side will do,\" She educates you. \n\n\nStill holding on to your wrist she takes your hand holding the knife and brings it dangerously close to her neck. \"Like so,\" Tiffany concludes.\n\n\n\"How are you so calm about all of this?\"\n\n\n\"Ben I learned a long time ago that freaking out doesn't help with anything.\"\n\n\nFor the rest of the hour Tiffany gives you a few more pointers on how to properly use the knife and the gun. After the egg timer goes off, Tiffany opens the draw of the nightstand takes out a sheath and places the combat knife in it. \"Alright, you can hide the knife pocket and the gun in your pants just don't wind up shooting yourself, when you get downstairs take out the guard first, he's strong but a dumbass, his reaction time should slow enough for you to get the jump on him, once he is dealt with, make Ivo tell you everything he knows, the man is a coward so it should be easy enough to get him to talk once he tells you what you need to know you can take him out, good luck,\" Tiffany directs.\n\n\nYou walk out of the room, into the hallway and down the stairs. Ivo comes out of a room behind the front desk.  \"So was Tiffany everything you hoped she would be?\" Ivo asks you as you approach the front desk.\n\n\n\"She was something alright,\" You responded try to act enthusiastic in order to avoid raising suspicion.\n\n\n\"Always happy to see a customer satisfied, as long as you got the cash feel free to come back here any time\" Ivo encourages as he returns to the backroom.  As you walk towards the front door you pass by the enormous guard, you have to choose how to deal with him.", "action_results": [{"action": "Use the gun", "result": "You stop in front of the door, pull the gun out from your waist band and turn around. Remembering what Tiffany had taught you in her crash course you promptly aim the gun at the guard and pull the trigger. He his hit several times in the midsection and falls to the floor. The noise however has alerted Ivo who comes out of the back room holding a shotgun. You fire at him but the bullet whizzes by his head. When Ivo returns fire his accuracy is better and you're hit in the center of your chest. The impact hits you so hard you are knocked off your feet and then fall like a rock.", "action_results": []}, {"action": "Use the knife", "result": "You stop in front of the door, and pull the knife out of your pocket. Once you remove the sheath you turn around and remembering what Tiffany had taught you in her crash course, you swing the knife towards the neck of the guard. Once he figures what you're doing he grabs your arm, but by the time he does the knife is already in his neck. You feel his grip loosen as he slowly falls to the floor and bleeds to death. With the enormous man dealt with you walk towards the front desk and take the gun out of your waist band.\n\n\n\"Ivo can you come out here?\" You call out.\n\n\nIvo comes out of the back room with a look of confusion on his face. This look quickly turns to dread when you point the gun at him. \"Whoa, easy there boss,\" Ivo responds frightened. \"I don't know what this is about but you don't want to do this, I'm part of Westfield's gang and he is somebody don't want to fuck with.\"\n\n\nBefore you can ask Ivo about Victoria you hear footsteps coming down the stairs. Still pointing the gun at Ivo you briefly look out of the corner of your eye and see it's Tiffany. She walks over to the body of the guard and as before pulls the knife out of its neck and cleans it on the dead man's shirt.  After patting down the corpse and taking a gun from a shoulder holster, Tiffany walks over to the front desk.\n\n\n\"There is no way in hell I'm going to miss this,\" Tiffany says she also pulls a gun on Ivo.\n\n\n\"Tiffany what the fuck is this?\" Ivo asks with fear in his voice.\n\n\n\"My friend here is going ask questions and you're going to answer them, if you don't I'll shoot your fucking head off.\"\n\n\n\"Westfield kidnapped my sister, her name is Victoria, she's twenty with black hair and a razor bob haircut, was she brought here?\" You demand to know.\n\n\n\"I haven't gotten any new girls in a while, although...wait I got a call earlier today, there is someone who is going to be brought in tomorrow morning around five.\"\n\n\nTiffany walks behind the front desk placing her gun against Ivo's head. \"Ivo you're not lying to my friend are you?\"\n\n\n\"No of course not, besides I had no idea she was kidnapped and being brought in here against her will,\" Ivo tries to explain himself. Tiffany lowers the gun from Ivo's head. He breathes a sigh of relief but before he can take another breath, Tiffany like she did with the guy upstairs, jams a knife into his throat and like his henchmen, Ivo falls to the ground and bleeds out.\n\n\n\"Sorry for the last minute change of plan, but the opportunity to kill that piece of shit was not something I could pass up, besides I knew you were uncomfortable with the killing so I decided to meet you half way,\" Tiffany explains. \"Now we have six hours before your sister arrives, we need to move the bodies and you need to hide, I'll deal with any johns that come in.\"\n\n\nTiffany picks up Ivo's body by the shoulders while you grab the legs. As you're moving the body, you become uneasy once again. \"Are you alright?\" Tiffany worries as she sees the expression on your face.\n\n\n\"I'm moving a fucking corpse in a brothel in the middle of the night, I'm fucking far from alright,\" You express yourself.\n\n\n\"Come on Ben, we're very close to getting your sister and getting out of here don't fall apart on me at the last moment, remember freaking out doesn't help with anything,\" Tiffany manages to calm you somewhat as you help her move Ivo's body and then the guard's body.  Once you are done moving the cadavers, you looks around the back room. There is a small bed with a small television on a TV tray. Underneath the TV tray is a shotgun.\n\n\n\"Don't tell me I have to wait in a room with dead people again,\" You whine.\n\n\n\"Yep and this time it's for six hours and you have deal with two stiffs,\" Tiffany informs. You sit on the bed, trying your best to ignore the bodies, as Tiffany heads out the door. Your stomach groans with pain and it dawns on you that you haven't eaten since lunch. In addition to your hunger, exhaustion is also taking a heavy toll on you. Trying to sleep proves to be a difficult task due to the events of the day, not to mention the fact the situation isn't over yet and fear of what may happen creeps into your mind. Somehow after a few hours you manage to doze off. Your peacefully break from the brutal reality you're in comes to end when you're awoken by someone shaking your arm. When your eyes focus you can see it's Tiffany.\n\n\n\"C'mon sleeping beauty, your sister and whoever is bringing her here, are going to arrive soon.\" Tiffany points out.\n\n\n\"So what's the next step?\" You ask while pulling yourself up off the bed.\n\n\n\"I'll take care of Victoria's escort, you stay hidden behind the desk, hopefully I'll able to handle it by myself but if things get dicey I need you to offer support.\"\n\n\n\"Sounds simple enough,\" You pick up the shotgun in the room and make your way to the front desk, where you place your weapons under the counter.\n\n\nBefore long you hear the front door open and you crouch behind the front desk. \"Hey Ivo,\" You hear a man's voice call out.\n\n\n\"Hi there, Ivo is busy at the moment, can I help you?\" Tiffany responds as she walks towards the front door.\n\n\n\"You can help me with a lot of thing gorgeous, but it's important we take this girl to Ivo first,\" Another man's voice answers Tiffany.\n\n\n\"He's in room 207.\"\n\n\nThe sounds of footsteps walks past you and you quietly lift up your head over the counter to see two men walking beside your sister while Tiffany walks behind them. As they are walking you see Tiffany take out a gun and shoot one of the men in the back of the head. The gunshot causes Victoria to scream and hit the floor as Tiffany move the gun to the second man. Before she can fire another round the man knocks the gun out of her hand. He then strikes Tiffany knocking her to the floor and pulls out a gun of his own. You need to aid Tiffany before she is killed.", "action_results": [{"action": "Use shotgun", "result": "Picking up the shotgun, you aim and fire at the man before he can shoot Tiffany. The good news is you mange to hit him and he is sent crashing into the ground.  The bad news is you forgot to take into account that a shotgun has spread and Tiffany gets hit as well and lays face down on the floor. Upon seeing this you rush out from behind the counter and run up to Tiffany. Picking her up off the ground you are amazed that she is still clinging to life.\n\n\n\"I...told you...I was...getting...out...of here,\" Tiffany manages to say before dying in your arms. The guilt causes you to breakdown crying.\n\n\nUpon hearing you, Victoria lifts her head up. \"Ben?\" your sister says slightly confused. \"How'd you find me, who was she?\"\n\n\nYou put Tiffany's body down, wipe your tears and turn towards Victoria. \"I'll explain everything in a bit, right now we need to leave.\" Victoria gets up of the floor and follows you as you head out the front door.\n\n\n ", "action_results": []}, {"action": "Use handgun", "result": "Picking up the handgun, you aim and fire at the man before he can shoot Tiffany. You strike the man in the side causing him to stagger. This buys Tiffany enough time to grab her gun off the ground and fire several rounds into his chest and he plummets to the ground. You rush out from behind the counter and run up to your sister who is still cowering on the floor.\n\n\n\"Get away from me!\" Victoria screams as you reach your hand to her.\n\n\n\"Vic, it's me Ben,\" You try to calm Victoria down.\n\n\nVictoria looks up and when she realizes it is indeed you, she quickly gets up and hugs you tightly. \"Ben, oh thank god, they were going to force me to do these horrible things and they said they would kill me if I didn't, it was just so awful.\"\n\n\n\"It's alright, you're safe now,\" You reassure your sister.\n\n\n\"I have a confession to make, I was dating this guy named Steve and I didn't tell you about him because I was worried you'd freak, anyway I was at his house yesterday and this guys showed up and Steve handed me over to them, I don't why and then they just killed him, it was so scary, I had no idea what was going on, then they took me to this chemical plant and held me in this room for several hours and then I was brought here,\" Your sister rambles due to being in a state of shock.\n\n\n\"Look you two, this family reunion is very sweet, but it won't be long before Westfield learns what happened here and we have to be long gone by then,\" Tiffany interjects.\n\n\n\"Who's she?\" Victoria inquired.\n\n\n\"Tiffany is a friend, you can trust her,\" You answer.\n\n\nThe three of you promptly exit the hillside apartment building. As you make your way out you can see rays of sun beginning to appear in the sky. \"I don't think I'll ever to repay you for helping me escape that place,\" Tiffany thanked you.\n\n\n\"You helped me rescue Victoria, I should be thanking you.\"\n\n\n\"Where are you going to go?\" Victoria asks Tiffany.\n\n\n\"A few blocks up the street is a bus station, around eight the RA-22 will stop by and it will take me to Ronan, once I'm there hopefully my parents will take me back in,\" Tiffany plans out.\n\n\n\"Thank you again for everything,\" She hugs you goodbye and begins walking up the street.", "action_results": [{"action": "Go home", "result": "\"C'mon Vic let's go home,\" You suggest to your sister.\n\n\n\"Don't have to tell me twice\" She responds. You and Victoria get into your car still parked in front of the apartment building and drive off.\n\n\n\"How were you able to find me?\" Victoria asks.\n\n\n\"I had help from Sophie, she was able to figure out where you might be,\" You answer.\n\n\n\"Sophie...I haven't spoken to her in years, I was such a bitch to her, she must have called me for help a hundred times when she got addicted to drugs and I just cut her off completely, why'd she help after all that?'\n\n\n\"I guess she thought it was still the right thing to do regardless of what you had done.\"\n\n\n\"I'll definitely call her later.\"\n\n\nWhen you arrive home you look in the back seat of your car and discover Victoria has dozed off. Quietly you open the back door and carefully pick her up to avoid waking her.  Carrying your sister with one hand you use your free hand to open the front door head towards Victoria room. You gently place her on her bed and make your way towards your own room and quickly doze off upon lying on the bed.", "action_results": [{"action": "Four hours later", "result": "You pick up the last bit off waffle off your plate with a plastic fork and place it in your mouth. After eating a very satisfying meal, you sit at the kitchen table in a relaxed mood. Your sister is safe and now all that is left to do is put the events of yesterday and last night behind you. It's going to be more difficult for Victoria to recover as being kidnapped due to the actions of a person she thought loved her and nearly being forced into prostitution is not going to be something you can just shrug off. Still the worst part is over and staying focused on the future is best thing you and your sister can do. Your thoughts are interrupted when your sister comes running into the kitchen.\n\n\n\"Ben, you should see this,\" Victoria says with a hint of fear. You follow her into her room and look at a news article she was reading on her laptop:\n\n\nShooting at Bus Station leaves one dead.\n\n\nA shooting at a bus station in Van Hove has left on person dead. According to Van Hove Police, an unknown gunman entered the bus station around 7 AM, he then took out a gun, shooting and killing a women waiting for a bus. The women has been identified as Tiffany Horowitz, 20, who had been declared missing five years ago when she ran away from her home in Ronan. Police have also said the victim had a \"W\" carved on her, which is the trademark of the violent Westfield gang. The town had already been on edge due to a similar murder yesterday, Steve Upton, 28, had been found dead in his home also with a \"W\" carved on him. Sergeant Arthur Miller of the Van Hove Police Department said this at a press conference:\n\n\n\"All evidence points to these murders being gang related, both victims had connections to Westfield's gang and were not random killings, we'll do everything we can to find the killers but in the mean time I'd like to reassure all citizens that they have nothing to worry about.\"\n\n\nYou look away from the laptop unable to read anymore as your eyes begin to water. Looks like you and Victoria are both going to take a while to recover.", "action_results": []}]}, {"action": "Offer to drive Tiffany to Ronan", "result": "You walk up to Tiffany as she is about to cross the street. \"Look Tiffany, after what we went through last night, the least I can do is give you a ride home,\" You offer.\n\n\n\"That's sweet of you, but you and your sister must be exhausted and Ronan is an hour away, I really don't mind waiting for the bus,\" Tiffany replies.\n\n\n\"Westfield doesn't know who I am, he doesn't know who Victoria is, but he knows who you are and will be hunting for you after he finds out what you've done, so I think it's a good idea to be far from Van Hove when that happens.\"\n\n\nTiffany ponders for a moment over what you said. \"You're right, it would safer this way, I'll tell you how to reach my parents' house once we arrive there.\"\n\n\nYou and Tiffany walk over to your car still parked in front of the apartment building where Victoria is already waiting. \"Vic, we're going to drive Tiffany to Ronan and then we can head home,\" You explain.\n\n\n\"But I want to go home now,\" Victoria protests, understandably stressed out from all that has occurred.\n\n\n\"I know, but it'll only take a few hours and the worst has passed,\" You reason with her.\n\n\nYou, Victoria and Tiffany get into your car and drive off. The ride is an uneventful affair as Victoria soon dozes off and you conserve your remaining energy on staying focused on the road. After almost an hour of driving you see signs welcoming to Ronan. Once you're in the high class town, Tiffany gives you directions to her parents' house. A few more minutes of driving you pull up to a French country house that looks like it cost more than your entire childhood. \"Well, here we are, guess I should I knock on the door or something,\" Tiffany says with her voice beginning to sound nervous.\n\n\n\"I'll be right here is case things go south,\" You reassure her. Tiffany gets out of your car, walks up the cobblestone driveway and to front door of her parent's house. She hesitates for a moment before ringing the doorbell. For a moment there is no answer and she looks back at you with uncertainty. Soon however the front door opens and a middle aged woman who somewhat resembles Tiffany stands in the doorway. She stares at Tiffany for a few moments before she registers who Tiffany is and once it becomes clear it's her daughter she hugs her tightly while breaking down in tears. They head inside and a faint smile appears on your face. You pull a U-turn and begin the drive back home.\n\n\n \n\n ", "action_results": [{"action": "Five months later", "result": "You stare at the snow as it lightly falls to the ground. The sight of falling snow was always peaceful to you, but you're brought back to reality when your sister calls out to you. \"Ben, let's get going\" Victoria insists. You turn your attention to the French country house and ring the doorbell. You and Victoria had been invited to spend Thanksgiving here. Within seconds the door opens and you're greeted by Tiffany. Her face lights up when she sees you.\n\n\n\"Hey Ben I'm so glad you could attend, please come on in,\" Tiffany greets as she gives you a hug.\n\n\n\"Wouldn't miss this for anything,\" You say with enthusiasm as you enter the house.\n\n\n\"How's college going for you Vic?\" Tiffany asks your sister.\n\n\n\"It's going great, the people are so nice, the classes are awesome and the best part is all the culture that's there,\" Victoria describes.\n\n\n\"When do you go back?\"\n\n\n\"In January, you have to promise me you'll keep an eye on Ben so he doesn't get in trouble when I leave.\"\n\n\n\"I'll do my best I promise, follow me to the kitchen.\"\n\n\nYou and Victoria walk further into the entranceway, your footsteps echo on the hardwood floor. Light comes shining down on you from a giant chandler hanging from the ceiling of the foyer. As you follow Tiffany you notice something is different about her, she's more relaxed and calm, the survive at all costs attitude she had back at the hillside apartment building is long gone. \n\n\n\"Where's the bathroom?\" Victoria asks in a rather direct way.\n\n\n\"Last door on the right,\" Tiffany informs.\n\n\nVictoria hurries way down the hallway as Tiffany turns towards you. \"My parents are really looking forward to meeting you, they want to thank you for all you've done, just be careful around my dad because he can talk  for hours on end without letting you get a word in, I'll introduce you to them when Vic gets back,\" Tiffany plans out.\n\n\n\"Sophie deserves a lot of the credit,\" You respond humbly. \"Without her I couldn't have found my sister or have been able to help you.\"\n\n\n\"You're so modest, you've got to be more assertive or people will walk all over you, luckily for you I've been assigned to keep you out of trouble.\" Tiffany playfully teases. You get a warm feeling of happiness that causes you to grin. You haven't felt like this in a long time, it's most likely brought on by the fact that your lifestyle of being isolated and withdrawn is finally at an end.\n\n\n ", "action_results": []}]}]}]}]}]}, null]}, null, null]}, {"action": "Deal with the guard yourself", "result": "\"I'll deal with the guard,\" You offer.\n\n\nTiffany hands you the combat knife. \"Stand against the wall next to the door, when he comes in, wait until he in front you and then take care of him,\" Tiffany instructs.\n\n\nYou get into position as Tiffany walks to the  middle of the room.\n\n\n\"Help he's getting too rough!\" Tiffany shouts.\n\n\nAlmost immediately the door swings and the guard comes running in with his gun drawn. You do as Tiffany instructs and wait until he is front you and walk up behind him. Before you are able to jab the knife into his back the realization that you're about to harm and kill someone enters your mind and causes you to freeze up. The guard turns around and when he sees you, he takes out his gun and shots you dead center in your head. Tiffany screams as her chance of getting out of this place has literally been killed.", "action_results": []}]}, {"action": "Go to Ellis", "result": "\"I think I'll check out Ellis,\" You decide.\n\n\n\"Alright it's on 25 Chambers Road, once you're inside you'll a staircase leading to the basement by the back wall. Give the password 'Gigi' to the bouncer in front it and he should let you in,\" Sophie informs you.\n\n\n\"If I find Victoria down there what should I do?\"\n\n\n\"Have her ask to use the bathroom, then exit the casino and head back up to the bar, the guards will get very suspicious if you leave so soon after leaving especially since they have never seen you before,\"\n\n\n\"Why would I want them to get suspicious of me?\"\n\n\n\"If they are paying attention to you then they aren't paying to attention to Victoria, she'll be able to leave without them noticing.\"\n\n\n\"Ok, I'll go to the bar, find Victoria and leave, simple.\"\n\n\n\"Please be careful Ben, Westfield's are extremely dangerous don't underestimate them.\"\n\n\nYou leave Sophie's apartment, get in your car and drive to Ellis. When you arrive you know you're at the right place due a giant neon sign over the door displaying the word \"Ellis\". The bar itself is a simple one story brick building. You're surprised by how ordinary the place looks. Nothing at all indicates that it houses a literal underground casino and is run by the most wanted man in Van Hove. It suddenly occurs to you that it's supposed to look ordinary and it would rather foolish to have it any other way. Perhaps living a life in isolation makes it harder to notice things that are usually obvious. After pulling into a space in the parking lot you head inside the bar. It's nearly deserted save for a bar tender severing a patron and a man near the stairs to the basement.  Despite only a few people being here you can feel all eyes on you as you make your way to the back.\n\n\n\"Gigi,\" You tell the guard and he allows to head downstairs although he can continues to keep a watchful eye on you. Once you reach the basement you that it is far more crowded then the bar upstairs. There are several tables of people playing poker, blackjack and roulette wheel. Several scantily clad women carrying drinks on trays are wandering around the casino. After quickly glancing you are able to tell none of them are Victoria. You don't want to leave just yet as it's possible Victoria is here somewhere.\n\n\n \n\n ", "action_results": [{"action": "Go to the poker table", "result": "It would raise suspicion if you just stood around and did nothing so you go over to a poker table. \"How much to buy in?\" You ask the dealer.\n\n\n\"One hundred,\" He answers.\n\n\nWhile getting the money out of your wallet you spot your driver's license. It dawns on you that you've snuck into a casino run by a criminal while carrying identification. You realize that you're in way over your head, but you still need to find Victoria. For the next hour you play poker while keeping an eye out for your sister. You've lost most of the money you've had on you because you were never good at the game and your mind is obviously elsewhere. It becomes obvious that Victoria isn't here and since you're almost out of cash anyway, you decide to leave. While heading towards the exit an intimidating man approaches.\n\n\n\"Come with me,\" The man orders rather suggests. You look at the staircase going back up to the bar and think about making a run for it but the guard upstairs could easily prevent you from leaving. With no choice you follow the man as he leads you to a door marked \"Private\". He opens the door, looks back at you and points inside. You do as he instructs and enter the room. It's appears to be an office with an expensive looking oak desk in the middle. Behind the desk is a man in a pinstripe suit sitting in a leather chair. The expression on his face gives the impression he isn't sure what to make of you.\n\n\n\"How'd you find out about this place?\" The man asks you.\n\n\nNot wanting to give up Sophie or disclose the real reason for you being here, you make up a half truth. \"I was looking for my sister .She gambles here, so I decided to see if I could her, but she isn't here so I was just to about to leave.\"\n\n\n\"You're not the gambling type, I could tell and so could the other gamblers, it makes them edgy, they begin to  think you're a P.I. or a journalist, don't take this the wrong way but don't come back here until you're better experienced.\"\n\n\n\"Sorry for the hassle, like I said I was just looking for my sister.\"\n\n\n\"What does look like, maybe if she comes by here I could let her know you were looking for her,\" The man suggest in a creppy way.\n\n\n\"She's twenty, has black hair in a razor bob hair style.\" You describe. The expression on the man's face changes from perversion to concern. Perhaps you were wrong to assume that Victoria wasn't here. Before you have the chance to react, you feel a sharp pain on your head and you blackout.", "action_results": [{"action": "Some time later", "result": "\"Ben, please wake up,\" You hear as it brings you back to reality. Your eyes focus and you see you're in a windowless room with unpainted drywall. As you try to move you discover you're stuck to a chair with your arms tied down to the arm chair. To your right is Victoria who is also tied to a chair and in the center of the room is a man with slicked back blonde hair, wearing a white t-shirt and jeans. On his hip is a holstered revolver. \n\n\n\"Vic, are you alright?\" You ask your sister.\n\n\n\"I'm fine, just please get us out of here,\" Victoria begs.\n\n\n\"What the fuck is this?\" You call out to the man.\n\n\n\"Doesn't anyone say hello anymore?\" The man responds curtly responds. \"Well, let's get introductions over with, I'm Westfield, I took your little sister since her boyfriend owed me money due to his gambling, the same casino where you just were believe or not, anyway he had no money so Victoria was the payment, afterwards I killed him because loose ends are a bitch, speaking of loose ends, I'm not quite sure what to do, you see Steve had told me your sister had no one who would miss her, but then you show up at Ellis looking for her,\" Westfield reveals.\n\n\n\"Please don't kill us, I don't care about what you do, I just wanted to find Victoria.\" You plead.\n\n\n\"If it makes you feel any better I'm not going to kill your sister, I mean I did go to some lengths to get her, but I'll tell you what, since I'm in a generous mood, I'll let you and her go if you can give me a good reason why I should.\" ", "action_results": [{"action": "Offer money", "result": "\"I'll give you money,\" You offer. \"Everything I have is yours if you let us go.\"\n\n\n\"I already have money,\" Westfield responds somewhat annoyed at your comment. \"I don't know if you've heard the rumors that I was going broke, but rest assured they are all bullshit, besides once your sister becomes one of my girls she will make me far more cash then you could ever offer, now since you've failed to convince why I should spare you, we have nothing more to talk about.\"\n\n\n\"Please don't do this,\" Victoria beseeches Westfield. It is to no avail as Westfield takes his revolver out of the holster and shoots you at point blank range while your sister screams in horror. At the very least it's a quick and painless death.", "action_results": []}, {"action": "Offer to do a favor", "result": "\"I'll do a favor for you, anything, there has to be something you want done,\" You offer.\n\n\nA look of curiosity appears on Westfield's face. \"I'll admit I'm intrigued, tell me just how far are you willing to go to save your life and your sister?\"\n\n\n\"Like I said I'll do anything.\"\n\n\n\"Really would you be willing to take a life in order to save another?\"\n\n\n\"Ben don't this, there has to be something else you can do,\" Victoria interjects. You really don't like what Westfield is hinting at either, but your options are limited at this point.\n\n\n\"Let's continue to this conversation in my office,\" Westfield says sounding a bit annoyed that Victoria butted in. He unties the ropes holding you're arms to the chair your in. \"Follow me and please try not to do anything stupid.\"\n\n\n\"What about Victoria?\"\n\n\n\"She'll be fine.\"\n\n\n\"Ben don't leave me here!\" Victoria protests.\n\n\n\"I promise I'll come back and get you out of here,\" You try to calm your sister. You lean over and hug her. \"Don't trust him,\" Victoria whispers in your ear.  Westfield walks out of the door leading out of the room and you follow suit. The next room is larger and also has unpainted drywall. There are barrels to the left and right of you. On the opposite wall is a shutter and another door to the left of it. You and Westfield continue into the next area, where there are large shelves with stacks of more barrels. Near the center of the room are the two guards who are playing cards. On the right there is a huge open shutter leading outside.\n\n\nAs the two of you walk towards the shutter the guards fail to notice anything. \"Fucking idiots,\" Westfield says under his breath. Outside you see a number of different structures: warehouses, an office building, smoke stacks and buildings with weird shaped pipes surrounding them. Along the perimeter there is a razor wire fence.\n\n\n\"Where the hell are we?\" You ask very confused.\n\n\n\"This is Versweyveld chemical plant, my base of operations,\" Westfield states proudly. \"My office is in the administration building,\" You continue to follow Westfield to administration which is a two story building made of brown brick. Once inside you are lead down a long corridor, making a left at an intersection which takes you to a shorter corridor and finally stopping at an office on the left hand side.\n\n\n\"Step inside,\" Westfield orders while opening the door. You head in and see an office somewhat similar to the one you saw in Ellis. Westfield sits down on a chair in front of a desk. He opens one of the desk draws and takes out a vanilla folder, which he hands to you. Looking through its contents you see a photo of a man who looks like he is in his thirties.\n\n\n\"His name is Ryan Walker, he lives on eight lost river lane, kill him and I'll let you and your sister leave here alive.\"\n\n\n \n\n ", "action_results": [{"action": "\"Why do you want him dead?\"", "result": "\"Why do you want him dead?\" You ask Westfield.\n\n\n\"Ryan is a journalist and he's obsessed with trying to take me down, not for any moral reasons mind you, he just wants his name out of there,\" Westfield answers. \"When you think about it he's no better than me, in fact he's worse for pretending to actually care about the people of this town, anyway for years he was getting nowhere and I just ignored him, but lately he's been finding out things he shouldn't know about it and if left uncheck he could wind up with evidence that will bring my whole operation down.\"", "action_results": [{"action": "\"Why don't you kill him yourself?\"", "result": "\"Why don't you kill him yourself?\" You ask.\n\n\n\"Well there's two reasons actually,\" Westfield responds. \"The first is that Ryan knows who my men are, if I send one of them he'll see them coming a mile away and will vanish before they can get near him, so I need an outside to deal with him, the second reason is that I find this all rather amusing, you're in a situation where you either must kill someone who has done nothing to you or get killed and have your sister be forced into prostitution, I'm curious to see what you'll do.\" ", "action_results": [null, {"action": "\"Let's get started then\"", "result": "\"Let's get started then,\" You agree reluctantly.\n\n\n\"Excellent, you'll be happy to know we brought your crappy car over here, I was going originally to sell it for scrap and I suppose I should give you back the other possessions you had on you,\" Westfield states has he opens another desk draw, takes out your car keys, wallet and cell phone and places them on the desk. \"Personally I found it rather odd that you took your driver's license with you, carrying ID while sneaking into a place isn't a particularly smart idea but anyway when you leave the guard at the security booth will give you a gun, after you kill Ryan you'll have to take a picture of his body with your phone as proof, come back here and after I confirm that Ryan is dead you and Victoria are free to go.\"\n\n\n\"How do I know you'll keep your word?\"\n\n\n\"You don't, you just have to believe me, but you do know I will kill you if you fail and that should be enough reason to do this.\" Westfield threatens. \"One last thing, it's currently slightly passed midnight you only have until six in the morning to get the job otherwise I will guarantee you'll never see your sister again.\"\n\n\nYou take your possessions off Westfield's desk and leave his office. Back outside you see the parking lot beyond the administration building and find your car underneath a light pole and amongst several black sedans. You get inside and begin to drive to the exit, all the while you wonder if you really can go through with this and if Westfield will keep his promise if do. Stopping at the security booth in front of the exit, the guard inside hands you a gun.\n\n\n\"Bring it back and don't do anything stupid,\" The guard warns. After placing the gun in the passenger seat you leave the chemical plant and begin the drive to eight lost river lane. You quickly find that that the plant is on the outskirts of town and it takes a good twenty to minutes to arrive. During the drive fear and panic creep into your mind, causing your hands to shake and steering the wheel become a challenge. You try to calm yourself by remembering you have to do this for Victoria.  You are able to steady your hands to an extent but they still tremble slightly. When you arrive you pick up the gun, hide it under your waistband and make your way to the front door. After ringing the doorbell you begin to wait, you're not surprised that it would take someone a while to answer the door in the middle of the night but nonetheless your anxiety takes hold for a moment. At last the door opens and a man who matches the photo in the folder answers it, this is definitely Ryan.\n\n\n\"Yeah?\" Ryan greets.", "action_results": [{"action": "Shoot Ryan", "result": "If there is any chance to save Victoria and yourself this man has to die. It's not fair but if it's one thing you've learned today it's that life isn't fair. Swiftly you pull the gun out of your waistband, Ryan notices this and tries to take out his own gun hidden in a holster under his bathrobe, but you get the jump on him and fire. The bullet hits him in the stomach and you turn away to avoid the horror of watching him die. Before you leave you remember Westfield wants you to take a photo of the body to prove Ryan's death. As you are about take out the phone you hear a strange gurgling noise.\n\n\nTurning your attention back to Ryan you discover he is still alive as blood come out of his bullet wound and his mouth.  With the gun in one hand and the other covering your mouth in case you vomit, you approach Ryan. Your hands tremble but since Ryan isn't in any position to move, accuracy really won't be an issue. Just like before you fire a round and it hits Ryan in the stomach. He continues to gurgle for a few more seconds until he stops completely.\n\n\nNow that you're sure he's dead you take your phone and snap a photo of the body, since the police are Westfield's pocket, having this piece of evidence on you really won't matter to them. You run out of the house as fast as you can and get back into your car. The ride back to Versweyveld Chemicals is less tense although only just. The only way you're able to maintain your grip is to the thought of Victoria being freed soon.  Entering the main gate of the chemical plant, several armed men approach your car. One comes up the driver's seat and you roll down the window.\n\n\n\"The gun,\" He demands. You comply and hand over the gun to him. \"Follow me,\" He further demands and you once again comply. You get out of your car and the man leads to the warehouse that you and Victoria were held in earlier. The man takes you to the room in the back where Westfield and your sister who is now untied from the chair are waiting. Victoria seems to perk up upon seeing you, almost making a smile.\n\n\n\"It's done,\" You confirm to Westfield.\n\n\n\"Are we happy?\" Westfield asks the man who brought you in.\n\n\n\"Yeah, Miller responded to the scene, Walker is dead.\" The man informs.\n\n\n\"Wait if you had the police tell you Ryan's dead then what the hell was the point of me taking the photo?\"\n\n\n\"That was just in case an honest cop got there before one of mine did,\" Westfield explains.\n\n\n\"He did what you wanted, now let us go,\" Victoria demanded.\n\n\n\"A deal's a deal, go to your brother,\" Westfield allows.\n\n\nVictoria runs up to you and hugs you tightly. \"Let's get out of here,\" she pleads.\n\n\n\"Before you leave can I have a word with you Ben?\" Westfield requests.\n\n\nYou are about to walk up to Westfield when Victoria grabs your arm, \"I'll be fine,\" You reassure her.\n\n\n\"I prefer to have this conversation in private,\" Westfield directs towards your sister. Reluctantly Victoria leaves the room.\n\n\n\"What's this about?\" You ask with dread.\n\n\n\"While you were out dealing with Ryan your sister told me quite a bit about you, how you hide from a world that doesn't understand you, no friends, no girlfriend, it's kind of sad.\"\n\n\n\"What are you getting at?\"\n\n\n\"After the events of tonight I see you have potential that is going to waste to be blunt I want you to work for me, no longer will people shun you instead they will tremble at the mere sight of you, the world has been pushing you around for years, I say it's time you pushed back.\"\n\n\n \n\n ", "action_results": [{"action": "Accept Westfield's offer", "result": "Westfield is right, the world rejects you simply because you have difficultly fitting in. Society doesn't give a shit about you so it's only right to the return the favor.\n\n\n\"I'm in,\" You tell Westfield.\n\n\n\"Excellent, now you must be exhausted why don't come by here tomorrow around noon and we can get started,\" Westfield says approvingly. You head out of the room and out of the warehouse, still a bit uneasy about being in this place. Victoria is waiting in the car still parked in front of the main gate. She looks at you with worry as you get in.\n\n\n\"What did Westfield want?\" Victoria asks.\n\n\n\"I'll tell you later,\" You avoid answering.\n\n\nDriving home your mind races from thought to thought. The fact that you've killed someone who was almost certainly innocent of any wrong doing and the fact it doesn't seem to bother you as much as it should. Your life is forever changed, there is no going back to the days of being isolated and withdrawn. You wonder how Victoria is going to handle things once you break the news you are working for Westfield now.", "action_results": [{"action": "One year later", "result": "You check your watch and it tells you it's almost noon, Westfield is going to be here soon. Sitting in your favorite leather chair the events of the past year occupies your mind. Your sister was upset to say the least when you broke the news to her that you were working for Westfield. She quickly moved out and stayed with Moira for a few months. When Victoria left for college she never came back to Van Hove. You haven't had any contact with her since. Part of you is a bit resentful of the fact that after all you went through to rescue her she repays by abandoning you. Sill there have been some positive changes that more than make up for this. The biggest change is the way people treat you, no longer are you a social pariah. Instead people fear you, they go out of their way to gain your approval. This may not be the most moral way to get respect but you're bothered by that.\n\n\nChecking computers for spyware or any monitoring program for Westfield and the rest of his gang is the main job you actually do. Ryan wasn't the only one who wanted to bring down Westfield and thanks to you that task is now much more difficult. In addition to people being scared shitless of you, working for a criminal gang has made you quite a bit of money, much more than your previous job. After several months you sold your house and your car and moved to a much more affluent area of Van Hove. You also now have a car that doesn't have any rust on it. Your thoughts are interrupted by the ringing of your door bell. Getting out of your leather you head to the hallway and to the front door. Opening the door you see Westfield along with two of his henchmen.\n\n\n\"Hello Ben,\" Westfield greets.\n\n\n\"Westfield please come on in,\" You return the greeting.\n\n\nWestfield and his men enter your home as you lead them to the living room. They take a seat on the leather sofa across your chair. \"Ben, do you remember the first task you did for me?\" Westfield asks.\n\n\n\"I killed Ryan Walker,\" You correctly answer.\n\n\n\"I know that you hated doing that and that's why I tried to avoid having you do anything similar since then, but I'm afraid your hour as come once again,\" One of Westfield's men takes out a vanilla folder out from his coat and hands it to him.\n\n\n\"There's this cop named Carla Northcutt,\" Westfield tells you as he opens the vanilla envelope and hands it to you. \"For years she has been trying to bring me down, at first I tried to get her on my payroll but she refused, after Ryan's death she doubled her efforts and I'm afraid I can't just brush her aside anymore, she knows you but thinks you're just some computer geek, she has no idea what you're capable of and that will be her downfall, I just need to know are you in?\"\n\n\n\"Always,\" You confirm.", "action_results": []}]}, {"action": "Decline Westfield's offer", "result": "\"Look Westfield, I don't want to get involved in this, all what I did was to save Victoria, I don't care what you do just leave me out of it,\" You point out to Westfield.\n\n\n\"What a shame, you would have been great addition to the team,\" Westfield expresses his disappointment. \"Well I guess you'll be leaving now.\"\n\n\nYou head out of the room and out of the warehouse, fearing any moment you'd feel a bullet hitting you. Your worries turn out to be unfounded as you get in your car still parked in front of the main gate, where Victoria is waiting.\n\n\n\"What's wrong?\" Victoria asks upon noticing the nervous look on your face.\n\n\n\"You know what I had to do tonight was to save you right?\" You ask Victoria.\n\n\n\"That was an extremely painful thing you had to do but it was us or him, this may sound horrible but I'm grateful for what you did, you saved my life, thank you Ben.\"\n\n\nDriving home your mind races from thought to thought. Guilt over the fact that you've killed someone who was almost certainly innocent of any wrong doing, the fear of Westfield coming after you one day and how close you came to almost losing your sister. For now you take comfort that you've rescued Victoria and the night is yours, tomorrow however could be a different story.", "action_results": [{"action": "Four years later", "result": "You sit in the auditorium watching your sister walk across the stage getting her diploma from the Dean and shaking her hand. Your mind wanders back to the events of the past few years that lead you to this point. For next few months after the night you killed Ryan and turned down Westfield's job opportunity you lived in fear that one day Westfield's goons would knock down your door and kill you. When Victoria headed off to college, you too left Van Hove and bought an apartment near the campus where Victoria went. At first she wasn't too keen on you moving into the same town where she went to college but she understood the situation. You continued to work from home fixing people's computers online. As the years went on the horrors of that day became a distant memory and life went to back to normal. About a year ago Victoria visited your apartment to introduce to you her boyfriend Nicolas Masters, six months later he purposed and the wedding is going to be held a few weeks after graduation. You don't like Nicolas but you put up with him for the sake of your sister. In all fairness you wouldn't like whoever was going to marry Victoria.\n\n\nYour thoughts are interrupted when your future brother-in-law puts his hand on your shoulder. \"C'mon Ben, let's go see Victoria,\" He suggests. You get up off the seat and follow Nicolas to the hallway where there is a sea of people. Finally you find your sister still wearing the cap and gown. She runs up and gives you a hug and then kisses Nicolas.\n\n\n\"Congratulations honey,\" Nicolas praises Victoria as he puts his arm around her.\n\n\n\"This is so exciting, but we should get to Luca's before they give our reservation away, we can celebrate there,\" Victoria advises.\n\n\n\"We can celebrate with a few rounds of scotch,\" You offer.\n\n\n\"Well Victoria can't,\" Nicolas mentions.\n\n\n\"Vic since when do you not drink?\" You wonder aloud.\n\n\n\"Hun we were going to tell him at the wedding,\" Victoria chides.\n\n\n\"Tell me what?\"\n\n\n\"Ben...you're going to be an uncle,\" Victoria revels to you.\n\n\n\"What?\"\n\n\n\"Uncle Ben, the name suits you,\" Nicolas teases. You hug Victoria as your eyes begin to tear out of happiness. You're not the loner you think you are, you have family and that's all you need to know.\n\n\n \n\n ", "action_results": []}]}]}, {"action": "Don't shoot Ryan", "result": "You just can't bring yourself to kill this man even though you fully understand the consequences. You simply stand there saying nothing, while he does the same and for a moment the two of you are like 5th graders at your first dance. The awkward silence is broken when Ryan spots the gun partially sticking out of your waistband.\n\n\n\"Oh shit,\" Ryan exclaims and he pulls a gun of his own from a holster hidden under his bathrobe. It makes sense that a man who is trying to take down a wanted gang leader would keep himself armed. Without thinking he fires several shoots that find their mark and you fall forward, dying shortly after hitting the ground.", "action_results": []}, {"action": "Try to explain your situation", "result": "You're not a murderer but if you do nothing you'll be putting yourself and Victoria in danger. You take the gun out of your waistband and aim at Ryan.\n\n\n\"Whoa easy there boss,\" Ryan responds in terror.\n\n\n\"Shut up and listen to me,\" You demand. \"My sister has been kidnapped by Westfield, who I'm sure you know quite well and if I don't kill you in six hours he's going to turn her into a sex slave and kill me.\"\n\n\n\"I can help you but first please lower that fucking gun.\"\n\n\nYou do as Ryan requests and put the gun away. \"Follow me,\" he requests. You enter the house as Ryan leads you down a foyer and into a room where on wall is are covered with newspaper clippings covering stories about crimes allegedly committed by Westfield.  Another wall has a map of Van Hove along with several pushpins over several locations, including the Hillside apartment building, Ellis and Versweyveld chemicals.\n\n\n\"I always knew Westfield would send somebody after me one day, pretty clever of him to use an outsider instead of one his own boys,\" Ryan states.\n\n\n\"Well when you're done admiring him maybe you can help me get out of this situation,\" You reply curtly.\n\n\n\"Relax I got this all figured out, while wearing a wire you go back to Westfield telling him I'm dead, get him to admit he planned to kill me and I'll release the tape to the press, the police will be forced to investigate, Westfield will be brought down, my career as a journalist will be made and you and your sister will be safe, it's win win.\"\n\n\n\"So I put my life on the line and you get all the glory?\"\n\n\n\"Look I'm in just as much danger as you and yes this will bring me renown but I'm sure that's the least of your worries.\"\n\n\n\"Westfield needs me to take a picture of you to prove that I've killed you, how are we going to stage that?\"\n\n\n\"We'll get something that looks like blood, but I know Westfield and he's most likely going to send a cop on the take here anyway to confirm I'm dead.\"\n\n\n\"How the hell do we get around that?\"\n\n\n\"Relax, I got this covered, there's this cop who isn't on the take, her name is Carla Northcutt, easy on the eyes but very uptight, anyway she wants to take down Westfield as much as I do and we help each other out sometimes, I'll contact her, let her know what we're doing, then we plant a phony 911 call, she and a few other good cops respond before the crooked one can show up and she'll call in my death.\"\n\n\n\"That'll never work, they will figure it all out when your body doesn't appear at the city morgue.\"\n\n\n\"Westfield will be arrested before that happens, now once you get your sister back, return to my house, I'll introduce you to Carla and she'll look after the two of you until Westfield's gang is dismantled, now first thing is first, I need something to use as blood.\"", "action_results": [{"action": "Use food coloring", "result": "\"We can use red food coloring,\" You decide.\n\n\n\"Great I have some in the kitchen, I'll go get it, head back to the front door, that's where we'll stage my death,\" Ryan plans out.  Returning to the entrance you wait for a moment until Ryan returns with his bathrobe stained with food coloring.\n\n\n\"How do I look?\" Ryan jokes.\n\n\n\"Can we get this over with please?\" You respond not amused. Ryan lays down on the floor while you take out your cell phone and take a picture.\n\n\n\"That should do it,\" You confirm.\n\n\n\"Great, I'm going to have to get rid of this bathrobe but it's a small sacrifice, now before you return to Westfield I'll put a wire you,\" Ryan goes back to the room with newspaper clippings and returns with a device about the size of your thumbnail.\n\n\n\"This is the microphone?\" You ask complete baffled.\n\n\n\"Yeah, won't set off metal detectors, almost impossible to detect during a pat down and nearly impossible to see if you're not looking for it, welcome to the twenty first century Ben,\" Ryan states as he clips the device on the collar of your shirt. \"Get to back to Westfield pick up your sister and come back here, nothing to it.\"\n\n\nYou head out of Ryan's house and back into your car. Part of you is reveled to be away from him as his love of himself is really off putting.  During the twenty minute drive, fear and anxiety reenter your mind, before the fear was there because you were unsure of how to deal with Ryan. Now it's here due to the fact you're unsure how Westfield is going to deal with you. At last you arrive back at Verseweyveld chemicals. Entering the main gate of the chemical plant, several armed men approach your car. One comes up the driver's seat and you roll down the window.\n\n\n\"The gun,\" He demands.\n\n\nYou comply and hand over the gun to him. \"Follow me,\" He further demands and you once again comply. You get out of your car and the man leads to the warehouse that you and Victoria were held in earlier. The man takes you to the room in the back where Westfield and your sister who is now untied from the chair are waiting. Victoria seems to perk up upon seeing you, almost making a smile.\n\n\n\"It's done,\" You confirm to Westfield.\n\n\n\"Are we happy?\" Westfield asks the man who brought you in.\n\n\n\"I don't know, Northcutt responded to the scene along with Lee, Wilson and Fanning but none of our boys,\" The man informs.\n\n\n\"Well this is why I wanted the picture to be taken, Ben can you show me the photo?\"\n\n\nYou hand over your cell phone with the photo of Ryan staging his death Westfield looks at it and a smug smile appears on his face. \"We're happy,\" Westfield tells the other man.\n\n\n\"How'd did Northcutt get there before Miller?\" The man asks Westfield.\n\n\n\"She must have recognized the address when the call came in, she and Ryan have worked together,\" Westfield assumes.\n\n\n\"He did what you wanted, now let us go,\" Victoria demanded.\n\n\n\"A deal's a deal, go to your brother,\" Westfield allows.\n\n\nVictoria runs up to you and hugs you tightly. \"Let's get out of here,\" she pleads. You want to leave just as badly you need to get Westfield to admit he conspired to kill Ryan.", "action_results": [{"action": "\"Why did you want Ryan killed?\"", "result": "\"Why did you want Ryan killed?\" You ask Westfield hoping to get his confusion of planning a murder.\n\n\nWestfield looks at you in a suspicious manner. \"What an odd thing to say, who asks why they want someone killed after they've already killed them?\"\n\n\n\"Who gives a shit?\" Victoria butts in as her heart begins to race.\n\n\n\"Not to the mention one of the few clean cops in this town got to Ryan so quickly, at first I was going to dismiss that but now I have the feeling there is something you're not telling me.\" Westfield takes his revolver out of  its holster and points it your head. \"Now do you mind telling me what the hell is going on?\"\n\n\nYou know if you talk Westfield will kill you and if you don't he'll still kill you. Knowing this is the end you take one last look at Victoria wanting to tell her everything is going to be OK. The reality is her life is about to become a living nightmare and perhaps if you did things differently this wouldn't be her fate. Your thoughts are interrupted by the firing of Westfield's revolver and then you stop thinking entirely. ", "action_results": []}, {"action": "\"Aren't you worried the police will find out you killed Ryan?\"", "result": "\"Aren't you worried the police will find out you killed Ryan?\" You ask Westfield hoping to get his confusion of planning a murder.\n\n\n\"I thought it was obvious that I decided what the police do, granted there's some people like Northcutt who I can't control but they won't able to  make a difference, the cops will never get anywhere trying to solve that murder just like they won't get anywhere solving Steve's murder, besides why do you give a shit on whether or not I get caught?\" Westfield asks with a hint of suspicion.\n\n\n\"If you get caught that puts me and Victoria in danger and I've been trying since yesterday afternoon to specifically get out of danger.\"\n\n\n\"Fair enough.\"\n\n\n\"Ben it's time to go,\" Victoria insists. The two of you head out of the room and out of the warehouse, fearing any moment Westfield's goons would open fire. Your worries turn out to be for nothing as you're able to get into your car still parked in the front of the main gate.\n\n\nYou quickly start the car and drive off. \"Ryan isn't really dead,\" You reveal to your sister as you exit the chemical plant.\n\n\n\"What do you mean?\" Victoria asks in a combination of fear and confusion.\n\n\n\"I went to Ryan's house and explained the situation, we're going back to his house.\"\n\n\n\"Westfield is going to find out you didn't kill him, we're fucked.\"\n\n\n\"No we're not, I had a wire, everything Westfield said I got on tape, Ryan is going to make it public and that will be the end of Westfield and his gang.\"\n\n\n\"Are you sure you know what you're doing, Ben?\"\n\n\n\"I wasn't going to kill a man and I sure as hell wasn't to let you become a sex slave, there's a cop named Carla Northcutt who's going to help us, she's the one who told the police that Ryan was dead so I would be able to trick Westfield.\"\n\n\nThe rest of the drive is silent as Victoria has obvious doubts about this plan and you do as well. When you return to Ryan's house you see a police car in the driveway. You pull up behind it and head to the front door. Before you can ring the bell a women slightly older then you with light brown hair in a bun and matching colored eyes opens the door and points a gun at you and Victoria.\n\n\n\"Who the fuck are you?\" The women demands to know.\n\n\n\"I'm Ben Higgins and this is my sister Victoria Higgins,\" You answer in a serious manor.\n\n\nRyan comes running up to the doorway. \"Whoa, easy Carla they're our side,\" he defuses the situation.\n\n\nCarla lowers her gun. \"Sorry, come on in.\"\n\n\n\"What the fuck is wrong with you?\" Victoria yells at Carla.\n\n\n\"I said I was sorry what more do you want?\"\n\n\n\"Since yesterday morning, I've had a man who I though loved me sell me to pay off a debt, I've been kidnapped by some gang leader who almost sold into prostitution, my brother has been putting his life on the line all day to rescue me and after surviving all I don't want to die at the hands of some paranoid trigger happy nutjob.\"\n\n\n\"Both of you cut it out,\" Ryan breaks up the fight. The four of you head inside Ryan's house as Carla gives a nasty glare to Victoria.\n\n\n\"So do did you get something on tape?\" Ryan eagerly asks you.\n\n\n\"Yeah I have it right here,\" You reply while taking the device off your collar and handing to Ryan.\n\n\n\"Atta boy, I'll load this up to my computer and it'll go public in no time.\" Ryan says with enthusiasm\n\n\n\"You better have gotten something useful, a lot of good people went along with this plan faking Ryan's death, if Westfield isn't in jail by tomorrow we're all dead, including you,\" Carla coldly points out to you.\n\n\nRyan heads into a den with a desk up against the wall and a very expensive looking computer on it He sits down on a very worn office chair and inserts the device in the computer.\n\n\n\"Aren't you worried the police will find out you killed Ryan?\" You ask Westfield hoping to get his confusion of planning a murder.\n\n\n\"I thought it was obvious that I decided what the police do, granted there's some people like Northcutt who I can't control but they won't able  to make a difference, the cops will never get anywhere trying to solve that murder just like they won't get anywhere solving Steve's murder...\"\n\n\n\"That was Westfield's voice, he admitted not just to trying to kill Ryan but about the corruption in the police department as well,\" Carla says in both admiration and shock.\n\n\n\"This is the fucking jackpot, I'll upload this and by tomorrow morning Westfield is going to be in handcuffs and in a week I'm going to be on every major news outlet in the country,\" Ryan states gleefully.\n\n\n\"Along with half of the force, the words 'law enforcement' might actually mean something in Van Hove,\" Carla says with a hint of happiness.\n\n\n\"Can we go home now?\" Victoria requests as her energy is running low.\n\n\n\"We're not of the woods yet, it's going to be sometime between that recording being up online and Westfield actually being brought down, you two are going to have to lay low for a while because Westfield's thugs are going to come after you in a desperate attempt to stop his downfall,\" Carla warns.\n\n\n\"Should we check in to a motel?\" You ask.\n\n\n\"No after they discover you aren't home, motels are going to be the next place they'll check, I have this place on the edge of town I use for people trying to hide from Westfield since the force won't do shit, you and your sister can hide there until Westfield is arrested.\n\n\n\"What about Ryan?\" You wonder.\n\n\n\"I got my own place where I can hide out.\"\n\n\n\"Ben can I talk to you second?\" Victoria requests.\n\n\nYou follow her out into the hallway. \"What's wrong Vic?\"\n\n\n\"I don't trust these people, that guy Ryan is clearly only interested in becoming famous and now we have helped him get what he wants, we're expendable and that women Carla is deranged, I think it might better if we just left and went home, besides in a few hours this whole thing will be over with anyway.\"", "action_results": [{"action": "Go to Carla's safehouse", "result": "\"Vic we've made this far and I don't want to myself or you in danger when we're this close to getting out of this mess alive,\" You reject your sister's idea.\n\n\nVictoria gives you an annoyed look as both of you head back into the den. \"When do we leave?\" You ask Carla.\n\n\n\"We can go right now,\" Carla informs. \"Ryan please be careful.\"\n\n\n\"I'm heading out after I make this public,\" Ryan reassures.\n\n\n\"Alright then let's go,\" Carla orders.\n\n\nYou and Victoria follow her into the foyer out of the house, once outside you head to your cars. \"I'll take my cruiser you can follow me in your vehicle.\"\n\n\nShe gets in her car as you get in yours and soon you're on the road.\n\n\nVictoria sits in the passenger seat still annoyed at your decision. \"You know I'm doing this because I care about you and want you to be safe,\" You mention to her.\n\n\n\"I know, I know,\" Victoria responds as she lightens up.\n\n\nYou continue to follow Carla for about ten minutes before pulling up to a rundown house that makes your place look like a palace. After pulling into the driveway, you and your sister get out of the car, the annoyed look she had earlier is back on her face.\n\n\n\"Sorry this place is a piece of shit but it's only for a day,\" Carla states as she steps out of the police car. \"This way please.\"\n\n\nThe three of you enter the house which has lights that barley illuminate anything, not there is anything worth seeing. Carla leads you to a room with horrible wallpaper that is peeling off and two beds. \"I hope you don't mind sharing a room,\" Carla says in a no nonsense demeanor.\n\n\n\"It's fine, I appreciate you doing this,\" You thank Carla as Victoria rolls her eyes at this statement.\n\n\n\"I'm going to be in the kitchen on lookout, let me know if you need anything.\"\n\n\nAs Carla walks away your sister quickly claims the bed on the right side of the room, leaving you with the one on the left side. While lying in bed Victoria turns to you a while you sit on your bed.\n\n\n\"I saw the way you were looking at Carla as you thanked her, I can't believe your mind would be focused on girls during a time like this.\" Victoria teases.\n\n\n\"You know it might be easier for me just to return you to Westfield,\" You tease back and Victoria shows a faint smile.\n\n\nAn hour later you and your sister still lie awake in your beds.", "action_results": [{"action": "Go to bed", "result": "It takes another hour but you and Victoria manage to finally fall asleep. The slumber is a welcome relief of cruel reality that life has become lately, like all good things it doesn't last forever as you're forced backed into reality when something starts shaking your arm.\n\n\n\"Ben you lazy bum wake up,\" Your sister demands as you slowly open your eyes and discover it's her who's shaking you.\n\n\n\"Is something wrong?\" You ask still half asleep.\n\n\n\"It's Westfield, he got arrested, it's all over.\"\n\n\nThe news causes you to sit up in your bed. \"Are you serious?\"\n\n\nCarla enters the room. \"I just got the call from Ryan, now before you go celebrating out in the streets, I want you two to stay here for the day just to be safe.\"\n\n\n\"Bitch,\" Victoria mutters as soon as she's sure Carla is out earshot.\n\n\n\"Glad to see this event didn't change you,\" You quip.\n\n\n\"Oh excuse me, I didn't you were paying attention, I thought you'd be too busy drooling over her, you have very strange taste in girls.\"\n\n\n\"At least I'm not the one who dated a kidnapper, you know I had plans yesterday and I had to put them all on hold to save you, that really made things inconvenient for me.\"\n\n\nVictoria picks up her pillow and chucks at you, getting you right in the head. It seems life is returning to normal much faster than you expected.", "action_results": [{"action": "Four months later", "result": "Looking out the window in your bedroom you see \"Walker for mayor\" sings in nearly every yard in the neighborhood.  Ever since Ryan took down Westfield, he has become the hero of Van Hove. Using his new found popularity he has turned his attention away from journalism to politics. Your name has been kept out of the spotlight during all of this and that's the way you wanted to be. You have no desire for fame and attention, all you care about is that your sister is safe and Westfield will no longer be able to harm her. Victoria is away at college now although she is coming home in a month for Thanksgiving and you're really looking forward to that.\n\n\nCarla is the new chief of police and now has the daunting task of rebuilding the force and getting people to trust them again. From what you've seen of Carla you have no doubt she'll be able to pull it off. Westfield will be spending the rest of his life in a maximum security prison coming to terms with the fact he'll no longer be feared. As for you, you remain a person of no consequence with lackluster social skills who makes money fixing people's computers from home. There was once a time when you resented being a recluse, but now you know how much worse life can be and that things aren't so bad for you. It may not be an interesting life but it's your life and you wouldn't want it any other way.", "action_results": []}]}, {"action": "Talk to Carla", "result": "\"I don't think I'll be able to sleep, I'm going to the kitchen,\" You state as you get up off the bed.\n\n\n\"Oh, has my big brother finally gotten the courage to talk to pretty girls?\" Victoria continues to tease you. Grabbing your pillow you playfully toss it at your sister's head and she manages to duck out of the way. She sticks her tongue at you as you leave the room. Walking to the kitchen which contains dated cabinets along with a table and chairs, you find Carla sitting down drinking a beer while other beer bottle stand together on the table.\n\n\n\"Do you mind if I join you?\" You request.\n\n\n\"Sure as hell beats drinking alone,\" Carla approves. You sit down across from her as she hands you one of the beer bottles.\n\n\n\"So how exactly did you wind up at Ryan's house, he told me how Westfield held your sister hostage and wanted you to kill him but I feel there is more to the story,\" Carla inquiries as she takes a sip from her beer bottle.\n\n\n\"I woke up yesterday morning and Victoria was missing, I found out she had a boyfriend which apparently everyone but me knew about it, I went to his house to see if she was there but instead I found a dead body which I later found out was her boyfriend, I also learned he was killed by someone called Westfield because of a 'W' carved on him, with help from a former drug addict I knew, I went to one of Westfield's underground casino, where I got captured and Westfield reveled he had Victoria and made me try to kill Ryan in exchange for our safety,\" You summarize as you take the cap off the bottle and take a sip.\n\n\n\"You're telling me in one day you went from not knowing Westfield exists to bringing him down?\" Carla says in astonishment. \"I've been trying to bring that asshole down for years, I don't know if you're the luckiest or bravest man I've ever met.\"\n\n\n\"Thanks I guess.\"\n\n\n\"You should become a cop, once it becomes public about the police corruption most of the force is going to be dismantled, we're going to need a lot of people like you to rebuild, I mean look at what you did without any training, just imagine what you'll be capable of.\"\n\n\n\"Let's just stay focused on surviving tonight for now.\"\n\n\nYou and Carla continue to make small talk for the rest of the night. When daybreak arrives Carla's cell phone rings. She answers it and listens for a few seconds before hanging up. \"It's done,\" Carla reveals to you. You think about telling Victoria the news but decide it's better to let her sleep.", "action_results": [{"action": "Eight years later", "result": "You walk in the hallway of the top floor of the police station. The chief of police Carla Northcutt has asked to see you although you aren't sure why. Life had become somewhat slow as of late due to crime in Van Hove reaching an all time low. Still being an officer of the law the phrase \"no news is good news\" definitely applies here. The credit for this time of peace mostly goes to Carla, after becoming chief and rebuilding the police from the ground up she worked tirelessly to restore law in this town. At first people were dismissive of Carla seeing as another political figure making empty promises. Other gangs tried to take Westfield's place but Carla refused to give in to corruption no matter how much danger she was put in. Over the years people saw she was the real deal and the police became trusted once again. As for Westfield he is going to be spending the rest of his life in prison along with several former officers of the Van Hove police department. \n\n\nYou enter Carla's office as sunlight pours in from a giant window behind her desk. She looks from her computer and nearly cracks a smile upon seeing you.  \"Officer Higgins,\" Carla greets.\n\n\n\"Chief Northcutt,\" You state formally.\n\n\n\"How's Victoria and her husband doing?\"\n\n\n\"They're quite happy, Vic had another baby a girl this time but I have a feeling you didn't ask to see me to hear about my family.\"\n\n\n\"You always like getting to the point, that's your best and worst trait, anyway you've been here for seven years now, before you even became a cop you were someone I could depend on even if it wasn't convenient for you, not to the mention all the work you've done since joining the force, you've earned your shield,\" Carla states as she takes a badge out of her desk.\n\n\n\"Congratulations detective.\" Carla praises as she hands you the badge. You hug Carla as tears of joy come out of your eyes. All your life you've drifted aimlessly because you didn't have a purpose. Now you've found your place in the world, with family, friends and a career that makes you feel like you're making a difference, your life finally has meaning. \n\n\n ", "action_results": []}]}]}, {"action": "Head home", "result": "\"You're right we should get out of here,\" You agree with Victoria.\n\n\nBoth of you reenter the den. \"Thanks for the offer, but we're going to head home.\" You tell Carla.\n\n\n\"I'm afraid I'm going to have insist, it's way too dangerous to go back there right now,\" Carla protests.\n\n\n\"Let it go Carla,\" Ryan steps in.\n\n\n\"Alright but be careful,\" Carla reluctantly gives in.\n\n\nYou and Victoria leave Ryan's house and get back into your car. \"Thanks for agreeing with me, I couldn't stand the idea of spending anymore time with that bitch then I had to,\" Victoria says to you.\n\n\n\"She was just on edge, as we all are,\" You defend Carla.\n\n\n\"Please, I saw the way you were looking at her even when she was pointing a gun at us, I can't believe your mind would be focused on girls during a time like this.\"\n\n\n\"You know it might be easier for me just to return you to Westfield,\" You tease and Victoria shows a faint smile, at last this nightmare would over. When you arrive home you open the door and head straight for your bed while Victoria heads to hers. You're way too restless to sleep but simply being back in your bed is very comforting. This comforting feeling doesn't last as an hour later one of Westfield's men approaches the window to your bedroom. He aims his gun at you and fires. The bullet goes through the glass and through your head. Victoria hears the gunshot and runs out of the house before the goon can catch her. Tomorrow Westfield will be behind bars, so Victoria won't have to look over her shoulder for very long, your death is not wasted.", "action_results": []}]}]}, {"action": "Use ketchup", "result": "\"We can use ketchup,\" You decide.\n\n\n\"Great I have some in the kitchen, I'll go get it, head back to the front door, that's where we'll stage my death,\" Ryan plans out.  Returning to the entrance you wait for a moment until Ryan returns with his bathrobe covered in ketchup.\n\n\n\"How do I look?\" Ryan jokes.\n\n\n\"Can we get this over with please?\" You respond not amused. Ryan lays down on the floor while you take out your cell phone and take a picture.\n\n\n\"That should do it,\" You confirm.\n\n\n\"Great, I'm going to have to get rid of this bathrobe but it's a small sacrifice, now before you return to Westfield I'll put a wire you,\" Ryan goes back to the room with newspaper clippings and returns with a device about the size of your thumbnail.\n\n\n\"This is the microphone?\" You ask complete baffled.\n\n\n\"Yeah, won't set off metal detectors, almost impossible to detect during a pat down and nearly impossible to see if you're not looking for it, welcome to the twenty first century Ben,\" Ryan states as he clips the device on the collar of your shirt. \"Get to back to Westfield pick up your sister and come back here, nothing to it.\"\n\n\nYou head out of Ryan's house and back into your car. Part of you is reveled to be away from him as his love of himself is really off putting.  During the twenty minute drive, fear and anxiety reenter your mind, before the fear was there because you were unsure of how to deal with Ryan. Now it's here due to the fact you're unsure how Westfield is going to deal with you. At last you arrive back at Verseweyveld chemicals. Entering the main gate of the chemical plant, several armed men approach your car. One comes up the driver's seat and you roll down the window.\n\n\n\"The gun,\" He demands.\n\n\nYou comply and hand over the gun to him. \"Follow me,\" He further demands and you once again comply. You get out of your car and the man leads to the warehouse that you and Victoria were held in earlier. The man takes you to the room in the back where Westfield and your sister who is now untied from the chair are waiting. Victoria seems to perk up upon seeing you, almost making a smile.\n\n\n\"It's done,\" You confirm to Westfield.\n\n\n\"Are we happy?\" Westfield asks the man who brought you in.\n\n\n\"I don't know, Northcutt responded to the scene along with Lee, Wilson and Fanning but none of our boys,\" The man informs.\n\n\n\"Well this is why I wanted the picture to be taken, Ben can you show me the photo?\"\n\n\nYou hand over your cell phone with the photo of Ryan staging his death, as Westfield views it, an annoyed expression appears on his face. \"The fuck is this?\" Westfield asks angrily.\n\n\n\"I killed Ryan,\" You insist.\n\n\n\"He did what you wanted, now let us go,\" Victoria demanded.\n\n\n\"You really thought a photo of a guy covered in ketchup would fool me?\" Westfield asks rhetorically. \"You tried to fuck me over and now you'll learn what happens to people who try to fuck me over, your sister's fate won't be as pleasant..\" Westfield takes his revolver out of  its holster and shoots you in the head. Victoria screams both because of your death and her fate being sealed.", "action_results": []}]}]}]}, null]}, null, null]}]}]}, {"action": "Watch and observe the room", "result": "You learn against the wall and observe the people in room, keeping an eye out for your sister. After a half hour of waiting and watching all the people come in and out, the hope you had of finding Victoria here is gone. You begin to think about leaving when an intimidating approaches you.\n\n\n\"Come with me,\" The man orders rather suggests. You look at the staircase going back up to the bar and think about making a run for it but the guard upstairs could easily prevent you from leaving. With no choice you follow the man as he leads you to a door marked \"Private\". He opens the door, looks back at you and points inside. You do as he instructs and enter the room. It's appears to be an office with an expensive looking oak desk in the middle. Behind the desk is a man in a pinstripe suit sitting in a leather chair. The expression on his face gives the impression he is not happy to see you.\n\n\n\"Who are you working for?\" He demands to know.\n\n\n\"I don't know what you're talking about,\" You answer truthfully.\n\n\n\"Did Northcutt sent you or was it that journalist?\"\n\n\n\"No one sent me.\" You insist.\n\n\n\"You except me to believe that?\" The man asks rhetorically. \"A person who I've never seen before enters my casino and decides just to stand around for the hell it, who the fuck goes to a casino without any intention to gamble?\"\n\n\n\"Look I'll leave and never come back.\"\n\n\n\"You got that right, but before you do I want you to deliver a message to whoever put you up to this.\"\n\n\nBefore you're able to ask what the message is, a sharp pain is felt on your head and you blackout. Slowly you open your eyes and it takes several minutes for your surroundings to come into focus. You notice you're lying in a bed and your left arm is in a cast, attempts to move it prove to be quite painful. Suddenly to dawns on you that you're in a hospital bed and you remember being in the casino hidden in Ellis. All things considered you're lucky that they just don't outright kill you.\n\n\nA call button is next to you and you promptly push it. Within a minutes a nurse and a police officer enter room. The nurse explains that you were found in a ditch on the side of the road covered in bruises last night and you were unconscious for most of the day. The hospital was able to identify you because they found your driver's license in your wallet. Now that you think about it carrying ID when entering a crime lord's casino wasn't the smartest thing you ever did, but that's the least of your worries now. Apparently the goons had broken your arm and given you a minor concussion although you're expected to make a full recovery. The cop begins to talk to you and his news isn't as pleasant. You learn Victoria's body had been found while you were unconscious.", "action_results": []}]}]}, null, null]}, null, null, null]}]}]}]}, {"action": "Demand to know where Steve is", "result": "You need to tell me where Steve is,\" You demand while rising your voice a bit.\n\n\n\"Now there's the Ben I know, but I don't think it's a good idea to have you go to his house while you're acting like an asshole, maybe when you learn proper etiquette I'll tell you,\" Moira says while clearly have too much fun with this conversation.\n\n\n\"Why are you doing this, you know going out and talking to people is not an easy thing for me to do and yet you decide to make it worse for me.\"\n\n\nMoira seemed slightly bothered by this remark as if noticing she was beginning to take things a bit too far. \"Alright, alright, I'll tell you what, you go home and in a bit I'll swing by Steve's house and let Victoria know you're concerned,\" She says in a softer tone.\n\n\n\"Fine,\" You reply as you turn around to head out.\n\n\nOnce back in your house, you sit at your kitchen table staring at your phone waiting for Victoria to respond. You're beginning to get impatient as you want to put this ordeal behind you and return to your regular routine. After waiting for almost an hour there is finally there is a knock at the door, it must be Victoria, you wonder why she didn't call, still you're glad this is over with. You walk up and open the front door only to find it's not Victoria, but Moira. Tears are flowing her eyes and her sclera's have turned red.\n\n\n\"Ben it's terrible,\" Moira bawls as she lets herself in your house. She puts her head on your shoulder as she begins sobbing uncontrollably.\n\n\n\"Moira, you need to calm down and explain to me what's wrong,\" You say, dreading finding out what caused Moira to act like this.\n\n\nMoira lifts her head up off your shoulder and wipes her tears with her sleeve. You grab the mug that is the least dirty from a cabinet above the kitchen sink and fill it with water. You hand it to her as she sits down at the table, you take a seat opposite of her.\n\n\n\"Now Moira, I need you to tell me in a calm manner what happened?\" You say politely but firmly.\n\n\nMoira takes a sip out of the mug and begins to explain \"I went to Steve's house and the police, they were...they were taking his body out, I think, think someone killed him,\" Moira begins crying again as you too begin to become overwhelmed with fear.\n\n\n\"What about Victoria?\" You shout, instantly realizing that yelling at someone overcome with grief isn't the kindest thing to do.\n\n\n\"I don't know, she wasn't there if that's what you're asking,\" Moira answers before taking another sip of the water.\n\n\nYou take out your cell phone and call the police, hopefully they will able to find Victoria. \"911, what is your emergency?\" The voice on the other end inquiries.\n\n\n\"Yeah, um, I recently found out my sister's boyfriend has been murdered and I can't find her anywhere,\" You reply hoping that you don't come off as suspicious.\n\n\n\"What's your name, sister's name and her boyfriend's name?\"\n\n\n\"Uh, my name is Ben Higgins, my sister is Victoria Higgins and her boyfriend's name is Steve.\"\n\n\n\"What's his last name?'\n\n\nYou have no idea, it most likely would've been smart to know this before you called. You turn your attention to Moira. \"I need to know Steve's last name,\" You say rather impatiently, still the not best way to talk to someone who is somewhat traumatized.\n\n\n\"Upton,\" She informs you while still weeping a bit.\n\n\n\"His last name is Upton,\" you tell the operator.\n\n\n\"So your sister Victoria Higgins is missing and her boyfriend Steve Upton has been murdered?\"\n\n\n\"That's about it.\"\n\n\n\"I need your address.\"\n\n\n\"219 Okonedo Street.\"\n\n\n\"Alright, I'm sending someone over.\" The operator hangs up and you really hope they don't think you're behind this. Moira has somewhat calmed down.\n\n\n\"Will they find Victoria?\" Moira asks sounding worn out.\n\n\n\"I sure hope so\" you say with obvious uncertainty in your voice.\n\n\nSeveral minutes later a police car pulls into your driveway shortly followed by a knock at the door. You open the door to find a women slightly older then you with light brown hair in a bun and matching colored eyes. You would find her pretty if wasn't for the serious look on her face.\n\n\n\"Hello, I'm detective Carla Northcutt are you Ben Higgins?\" She asks you with a no non-sense demeanor.\n\n\n\"I am, come on in,\" you respond in a direct way.\n\n\nCarla walks in and sees Moira sitting at the kitchen.\n\n\n\"Who are you?\" Carla begins questioning as if doing an integration\n\n\n\"I'm Moira Estacado, Victoria's my best friend you need to find her,\" Moira pleads while beginning to cry again.\n\n\nCarla sits down at the table and turn her attention back to you, you figure she thinks you'll be easy to get information from. \"So start from the beginning, from when you noticed your sister was missing to when you called the police.\"\n\n\n\"I woke up, found Victoria wasn't home, I tried to contact her phone, got no response, I went over to Moira's place, she said she was at her boyfriend's and would go over there to let her know I was worried, then Moira came over here saying Steve, Victoria's boyfriend is dead and then I called you.\"\n\n\nCarla looks back at Moira with suspicion. \"When did you notice Steve was dead, you called the police not long after the incident was reported and the news hasn't picked up the story yet,\" Carla quizzes in an accusing manner.\n\n\n\"After Ben came into my restaurant looking for Victoria, I offered to see if she was at Steve's house, about twenty minutes later I headed over there and saw police at the place and they were taking his body out on a stretcher, there was a sheet but a hand was sticking out and was wearing a ring that Steve always wears, I knew it was him,\" Moira explains before sobbing again. \n\n\nYou walk over to Moira and put your arm on her shoulder to comfort her. Carla stops looking at Moira with distrust, you guess she could tell Moira isn't the killing type. \"Ben why didn't you just go to the house to check on your sister yourself?\"\n\n\n\"I had recently found out Victoria had a boyfriend in the first place and Moira thought she should do it since she's better with dealing with people.\"\n\n\nCarla doesn't look at you with same suspicion she had given Moira, you figure she knew you were telling the truth. \"From what I know, I believe Steve was killed by Westfield's gang and it is most likely the gang is connected to Victoria's disappearance as well,\" Carla mentions.\n\n\n\"Who's Westfield?\" You ask, completely puzzled.\n\n\nCarla and Moira look at you as if they are unsure your question was serious or not. \"You're telling me you've never heard of Westfield? The most wanted man in county if not the state,\" Carla's queries as her disbelief overpowers her seriousness.\n\n\n\"I don't get out much\" You confess.\n\n\n\"Trust me he doesn't\" Moira confirms.\n\n\n\"Westfield is a crime lord, illegal gambling, drug dealing, prostitution, armed robbery, human trafficking, extortion  and of course outright murder, Westfield's gang has done it all, the worst part is we don't know his real name, what he looks like or even if he is a he at all\" Carla explains.", "action_results": [{"action": "\"What makes you so sure this Westfield guy did it?\"", "result": "\"What makes you so sure this Westfield guy did it?\" You ask Carla.\n\n\n\"His MO is that his gang carves a 'W' on their victims, which Steve had, Westfield wants people to know when he has someone killed.\" Carla reveals to you. Moira sobs upon hearing about this brutality.\n\n\n\"What's to prevent someone from doing the same thing and having look like Westfield has done it?\" You continue with your questions.\n\n\n\"That would piss Westfield off and only an idiot would that\" Carla says confidently.", "action_results": [{"action": "\"What does this crime lord want with my sister?\"", "result": "\"What does this crime lord want with my sister?\" You ask with grave concern.\n\n\n\"My theory at this point is Steve was the target and Victoria was at the wrong place at the wrong time, hopefully I'll be able to figure out why Steve was killed in the first place, I don't know what Westfield plans to do with her, rest assured I will do everything I can to find her,\" Carla says rather sure of herself.", "action_results": [null, {"action": "Don't ask any more questions about Westfield", "result": "Detective Northcutt asks you and Moira a few more question, mainly about contact information. She then hands you a card.\n\n\n\"You can call me on this number if something comes up, do not under any circumstances call 911 again,\" Carla warns.\n\n\n\"Why not?\" You question.\n\n\n\"Some people in the department can't be trusted, I don't have time to go over details right now, just trust me\"\n\n\nCarla quickly exits the house and drives off, Moira then approaches you.\n\n\n\"Ben, can I stay here for the night?\" Moira requests rather straight forwardly.\n\n\n\"What? Why?\" You reply, demonstrating your lack of social skills.\n\n\n\"What do you mean why? The most dangerous man in the area has killed Steve and has done who knows what to Victoria, I'm freaking out and would feel a lot more comfortable if I wasn't alone.\"", "action_results": [{"action": "Let Moira stay", "result": "You find it a bit ridiculous that Moira doesn't want to be alone but considering all that she's gone through today, you can at least do this for her. \"Alright you can stay, you can sleep in Victoria's room but I got to warn you, she's a bit of a slob.\" You inform Moira.\n\n\n\"Thanks, you know when try, you're actually kind of pleasant,\" Moira compliments.\n\n\n\"Uh, thanks, I think.\"\n\n\nLater that night you decided to work some more at your computer since you can't sleep with all that is going on, there is a knock at your bedroom door. \"Come in,\" You say still focused on your work.\n\n\nMoira walks in and sits at the foot of your bed. \"I can't sleep,\" she states.\n\n\nYou turn your attention away from your computer. \"Me either, did you want something?\" You once again show off your lackluster social skills.\n\n\n\"God, Ben, why are you so... odd, I mean I can't believe you and Victoria are related.\"\n\n\n\"Victoria likes going out and being with people, as for me I'm quite content in being this house.\"\n\n\n\"You've got to want more then in life then just this, I mean there's a whole world out there to experience and you're telling me there isn't one thing in it you want?\"\n\n\n\"I tried it once, didn't like so I didn't do it again.\"\n\n\n\"So did something happen to you to make this way?\" You wonder why Moira is having this conversation considering all that is happening, but you quickly figure out she is talking to you specifically to get her mind off today's events.\n\n\n\"This may come to a shock to you, but I have difficulty talking to people, I don't know why, I just have trouble communicating and picking up non-verbal social cues, I'm different and when I was younger I learned different was wrong, people didn't want different, they didn't want me.\"\n\n\n\"So you hide in your home, because a couple of people were nasty to you? I hate to break to you but everyone has to deal with that, do you know how many assholes I have to deal at my restaurant every single day?\" Moira informs. \"Not to mention the drunks that hit on me when I'm working at the bar, but still I have my own business, I have a lot of friends, I love my life and I wouldn't trade for anything in the world\"\n\n\n\"That's easy for you to say, the only thing I have in my life is my fucking job and my sister and god only knows what's happened to her.\"\n\n\n\"Yeah, if you stay in this god damn house all day you'll never get anywhere, once Victoria is found and she will be found, I'll get you a job at my restaurant, getting out more is good for you and the social interactions will do wonders for your attitude.\"\n\n\n\"Don't you get it, my social skills suck and people find it easier to shit on me for it then actually help.\"\n\n\n\"Fine, I'll also help you learn how to talk to people, maybe you'll even make friends.\"\n\n\n\"Why would you do this all for me, you give me a hard time like everyone else.\"\n\n\n\"I'm sorry, I just like to mess around sometimes, I admit I don't know when to the draw line, but I want to help you because after everything that's going on, I can tell you're a good person, certainly a better person then that bitch detective, can you believe she talked to me like I had something to do with Steve's death?\"\n\n\n\"She was just doing her job.\"\n\n\n\"Oh, please, you were ogling her the minute she walked in, don't think I didn't notice that, you'll never get a girl if you keep gawking like you did, you need to know to properly woo someone.\"\n\n\n\"I'd able to woo if I wanted too, thank you very much.\"\n\n\n\"Oh yeah, why don't you demonstrate it for me then?\"\n\n\n\"I'm not doing this.\"\n\n\n\"Alright, fine, I'm headed back to Vic's room, be careful kiddo.\"\n\n\nMoira makes a faint smile before leaving your room, she liked having a break from the fear and uncertainty and you have to admit you did as well. An hour later you lay in bed, too tired to keep working but too alert to fall asleep. You hear noises coming from out in the hall followed by heavy footsteps that sound like they are headed toward your room. You can tell it isn't Moira and quickly lock your door. Seconds later someone tries to open your door and when they figure out its locked they begin banging against the door to force it open. It won't be long before they break in.", "action_results": [{"action": "Escape through the bedroom window", "result": "You dash to the bedroom window, open and jump out. The sound of your bedroom door being kicked is heard as the heavy footsteps head towards the window. You crouch down and learn against the wall, hoping whoever is in there doesn't look straight down. After a few agonizing seconds you hear the footsteps move away from the window and out into the hall. Slowly you get up and head towards the front yard. There is a black sedan parked in front of your house, before you can get closer, a large, well built man with a rough face walks out of the front door of your house. The darkness of the night provides cover for you as the man fails to see you and the only light is coming from the kitchen which makes its way outside since he failed to close the front door. You notice hoisted over his shoulder is Moira who isn't moving. The man walks over to the car and pops open the trunk placing Moira inside, who is hopefully just unconscious.\n\n\nThe man then gets in his car and begins to drive off. You quickly run back into your house grab your car keys and get into your own car. You speed off hoping not to lose the trail of the man, luckily not long you see the car has stopped at a red light. Remembering Carla's card you take it out of your pocket along with your cell phone. You try to dial the number but the light turns green and the black sedan drives off as you keep a safe distance. You figure it will be easier to call the Carla once you find out where this man going.\n\n\nAfter about twenty minutes of driving, you find yourself on the outskirts of town as the sedan drives down a narrow road that leads to the entrance of a group of buildings surrounded by a razor wire fence.  The entrance itself is an open gate that has a security booth behind it. The black sedan is able to drive in no problem but you doubt you would able to do the same. Near the gate you see a sign with lights on top of it:\n\n\nVERSEWEYVELD CHEMICALS\n\n\nNow is as good of a time as any to call Carla, as once again you take your cell phone it alerts there is no service, figures this would happen at the worst possible time. You get out of your car to try to get reception. It doesn't take long to find it but your relief is short lived as you feel a strong pain in the back of your head and everything goes black.", "action_results": [{"action": "Some time later", "result": "\"Ben, wake the fuck up!\" You hear as it brings you back to reality.\n\n\nIt takes a second for your eyes to focus as you make out a man with slicked back blonde hair, wearing a white t-shirt and jeans is standing over you. The more alarming part is that you see a holster with a revolver in it on his right hip. It takes a few more seconds to figure out you are in a chair with your arms tied down to the chair arms.\n\n\n\"Well look who is back in the world of the living, you didn't think you could follow one of my boys without them noticing did you?\" the man says as a creepy smile appears on his face.\n\n\nAs the man walks back away from you, you notice you are in a windowless room with unpainted dry wall. More importantly you're not the only one tied to a chair, as you can see Moira and your sister Victoria to your right and Detective Northcutt to your left, all in the same predicament as you.\n\n\n\"Vic, Moira are you alright?\" you cry out to them.\n\n\n\"Ben, you need to get us the fuck out of here!\" Moira shouts in a state of panic.\n\n\n\"I'm sorry Ben, this all my fault, if I wasn't dating that asshole Steve none of this would've happened,\" Victoria responds.\n\n\nYou turn your attention to Carla. \"Are you OK?\" You ask.\n\n\n\"Don't worry about me,\" Carla's reassure as her bravery doesn't buckle in the slightest.\n\n\nThe man stands in the middle of the room amused, by what's going on and turns his attention back to you. \"I suppose now would be a good time to tell you what the fuck is going on, you see I am Westfield, I run this fucking town but lately people seem to forget that, you see your little sister's boyfriend, Steve Upton, liked to gamble at one of my racket's but had some bad luck and ran up a lot of debt that he couldn't pay, but we came to a comprise, he offered Victoria as payment, she could make me a bit of money as of my girls since she's young and pretty\" Westfield explained.\n\n\n\"But you killed him anyway,\" You mention as you take all the information in.\n\n\n\"The man was willing to sell his girlfriend to pay off his debt, someone like that can't be trusted, I couldn't risk him deciding one day to tell someone who gave a fuck, all he knew about my operations, besides he lied to me, he told me your sister had no friends or family, that no one would miss her, how ironic that both a friend and a family member would come looking her\"\n\n\n\"Look he's dead, please just let us go, we never did anything to you, we won't tell anyone.\"\n\n\n\"If I was going to do that, I wouldn't have bothered to bring you here in the first place you idiot, you can blame Detective Northcutt for your current predicament, you see I have people in the police who for years had told her not to go after me but she wouldn't listen, we tried to dissuade by making sure she never moved up in the force but she still insisted, after she learned that I was connected to your sister disappearing and Steve's death and wouldn't bury the case I realized  I had to take more drastic measures\"\n\n\n\"Then just kill me you loquacious shit,\" Carla butted in.\n\n\n\"No, there's always someone like you who gets self-righteous, determined to good in a world gone bad, these same people don't care if they live or die, so simply killing them doesn't stop the problem, by killing other's they will learn that if you try to fuck with me you don't just put yourself in danger, you put everyone around you at risk, if  it's any consolation, I don't plan on killing Victoria, I mean I did go through a lot of trouble to get her, she's just here to watch you die, I think of it as a way to break her in, the memories of her brother and her best friend getting their brains blown out will crush any ideas about being disobedient \"  \n\n\n\"You fucking asshole!\" Moira shouts. Westfield turns his attention to her.\n\n\n\"Well maybe I'll spare you along with Victoria, killing a pretty little thing like you would seem like a waste,\" Westfield  suggests in a perverted way.\n\n\nWestfield continues to talk and with his back turned, you try to find a way out. You noticed the rope tying your right hand is lose, it seems that Westfield was in the process of tying your right hand when Moira shouted at you to wake up earlier. The distraction caused him not to finish the job properly. You are able to wiggle your hand free and soon untie your left hand. You need to end this quickly, you could try to sneak up on Westfield and take him out or you could sneak over to Carla, untie her and let her deal with him. Carla is trained for this and would have a better chance of succeeding, but walking over and untying her would take more time and if Westfield notices you, he'll kill you in a second.\n\n\n \n\n ", "action_results": [{"action": "Take on Westfield yourself", "result": "You run up to Westfield while his back is still turned to you. You deliver a right hook to the back of his head and he stumbles to the ground. Sadly you were never the kind of person who would be considered muscular and before long Westfield is back on his feet. You try to swing at him but he is able to avoid you as he takes his revolver out of its holster and shoots you several times. The screaming of Victoria and Moira is the last thing you hear.", "action_results": []}, {"action": "Untie Carla", "result": "Slowly you get up from your chair and carefully walk over to Carla.\n\n\n\"I could always use more girls, I bet you'd quickly become my most profitable harlot.\" Westfield continued to harass Moira.\n\n\nYou walk up to Carla who says nothing to avoid giving you away. Before long you have her freed from her restraints and she walks up to Westfield. He begins to around but by then it's too later as Carla gives a right hook that connects with his jaw and knocks him to the floor. You quickly go to untie Victoria as Carla unties Moira.\n\n\n\"Vic, thank god you're alright\" You say you as give Victoria a hug.\n\n\n\"Forgive me, I should've told about Steve but I was worried you'd start treating him like was no good, then it turns it he actually was no good\" Victoria rambles on in obvious state of shock.\n\n\n\"It's OK, you're safe and that's all that matters\"\n\n\n\"You did alright kiddo,\" Moira says with approval she hugs you.\n\n\nYou walk to Carla. \"So what do we do now?\"\n\n\n\"We need to call for help and figure out where the fuck we are,\" Carla explains.\n\n\n\"I think we at the Versweyveld chemical plant, I saw a sign before I was knocked out.\"\n\n\n\"Ok, stick together, follow my lead and we'll get through this\" Carla orders. Suddenly a gunshot rings out and you see Westfield as propped himself up against a wall holding his revolver while blood drips out of his mouth.", "action_results": [{"action": "Throw chair", "result": "You grab the chair that you were formerly tied and throw it at Westfield causing him to instinctively cover his head with his arms. With the gun briefly not pointed at her, Carla is able to run up and grab Westfield by the wrist, trying to prop the revolver from his hands. The two struggle a bit, but finally Carla gains the upper hand and pulls the gun from Westfield's hand.\n\n\n\"Don't move asshole\" The detective demands as she keeps the gun firmly pointed at Westfield. The warning proves to be fruitless as he charges at Carla anyway, prompting her to shoot him several times in the chest. Victoria screams at the sight, as Carla checks Westfield's pulse.\n\n\n\"He's gone,\" Carla confirms.\n\n\nYou turn around to comfort to your sister who is trying to adjust to both being kidnapped and seeing a man get shot to death. As approach Vic, you notice Moira is sitting on the floor, her hand over a wound on her leg, apparently when Westfield fired the first shot she got hit.\n\n\n\"Moira are you alright?\" You ask with grave concern as Carla rushes over to check on her.\n\n\n\"It hurts so fucking bad!\" Moira cries in pain.\n\n\nCarla walks over and briefly examines Moira's injury. She then rips off part of a sleeve of her shirt and wraps around the wound, \"The bullet went through and didn't hit any arteries, but we need get her to a hospital now,\" Carla concludes.\n\n\n\"Any ideas on how to do that?\" Victoria asks.\n\n\nCarla heads back over to Westfield's body and begins to check its pockets. \"Fuck\" she shouts in disappointment.\n\n\n\"What's wrong?\" You respond.\n\n\n\"That bastard took our cell phones when he brought us in here and he doesn't have one, we're going to have find a way out of here and call for help.\n\n\n\"I can't fucking walk!\" Moira screams.\n\n\n\"Moira please calm down,\" Victoria tries to reason.\n\n\n\"One of us is going have to carry her, Victoria won't be strong enough, so one either Ben or I are going to have to do it, and someone else is going to have to take point\"", "action_results": [{"action": "Take point while Carla carries Moira", "result": "\"I'll take point, Carla you should carry Moira, Victoria stay behind them,\" You instruct.\n\n\nCarla picks up Moira and carries her via piggyback. \"Couldn't you have taken that psycho's gun away, after you slugged him, you know so he couldn't fucking shot me,\" Moira criticizes.\n\n\n\"Shut up or we're going to get noticed,\" Carla snaps back.\n\n\nThe four head to a small door leading out of the room. The next room is larger and also has unpainted drywall. There are barrels to the left and right of you. On the opposite wall is a shutter and another door to the left of it. \"This must be a storage room,\" Victoria concludes.\n\n\nYou open the next door and find yourself in a large warehouse with a large shutter on the right that is open and leading to the outside world. As you head towards you fail to check your surroundings and don't notice two guards sitting at a table playing poker. They however, notice you and when they do they take their guns out and shoot you, a lot. Luckily during the commotion Carla, Moira and Victoria are able to make their escape.", "action_results": []}, {"action": "Carry Moira while Carla takes point", "result": "\"You should take point, I'll carry Moira, Victoria stay behind us,\" You instruct.\n\n\nYou pick up Moira and carry her via piggyback. \"You know, normally when a guy gives me a piggyback ride, it's much more enjoyable\" Moira teases to distract her from the pain.\n\n\n\"Be quiet or we're going to get noticed,\" Carla scolds.\n\n\nCarla slowly opens the door leading out of the room, after a quick scan she concludes the room is safe and the four of you head in. The next room is larger and also has unpainted drywall. There are barrels to the left and right of you. On the opposite wall is a shutter and another door to the left of it. \"This must be a storage room\" Victoria concludes.\n\n\nOnce again Carla opens the door slowly to check the next room. \"We got a problem,\" she warned, \"There's two men in there.\"\n\n\n\"They didn't hear the gunshots?\" You wonder.\n\n\n\"They probably did but thought Westfield was killing us,\" Carla explains, \"We need to find a way past them.\"\n\n\n\"What about Westfield's gun?\" Moira suggests.\n\n\n\"It's out of ammo,\" Carla informs.\n\n\n\"They don't know that,\" Moira mentions.\n\n\n\"How large is the next room?\" Victoria asks Carla.\n\n\n\"It's fairly large, I think we're in a warehouse, there's a giant shutter on the right that is open\", Carla answers.\n\n\n\"We could just sneak past if we stay far enough away from them,\" Victoria adds in.\n\n\n \n\n \n\n ", "action_results": [{"action": "Confront the the guards", "result": "\"Carla you can use Westfield's gun and stick them up, if they have cell phones on them we call for help\" You advise.\n\n\n\"Right, you three wait here\" Carla agrees.\n\n\nThe detective walks into the next room, there are large shelves with stacks of more barrels. Near the center of the room are the two guards who are playing cards. Carla approaches them with the gun drawn.\n\n\n\"Hands up assholes\" Carla demands.\n\n\nThe two men are startled by the situation.\n\n\n\"Where the fuck did you get that revolver?\" One of the goons asks.  \"That's the boss's gun\"\n\n\n\"I killed that piece of shit, now hand over your guns and cell phones before I kill you too\"\n\n\nOne of the goons complies immediately and hands over his phone and gun. The second goon calls Carla's bluff and when he takes out his gun he immediately points and shoots at Carla, killing her. Victoria screams at this and the two goons are alerted to your presence. You try to run back but carrying Moira slows you a bit and you both are quickly gunned down. You can only hope they take mercy on Victoria.", "action_results": []}, {"action": "Sneak past the guards", "result": "\"Let's sneak past them, it's too risky to approach them with an unloaded gun\" You tell the others.\n\n\n\"Right, follow me everyone.\" Carla orders.\n\n\nYou and the others walk into the room, there are large shelves with stacks of more barrels. Near the center of the room are the two guards who are playing cards. Hugging the wall your group slowly walks along the perimeter of the room and eventually make to the opened shutter on the right, the guards never notice your presence. Finally outside, you find yourself in a courtyard surrounded by warehouses and office buildings. To the left to is the open gate and the security guard booth.\n\n\n\"That booth has a guard who is most likely armed, if we get past him we're home free,\" Carla whispers to keep your presence unnoticed.\n\n\n\"Can't we just sneak past him last with the last guys?\" Victoria recommends.\n\n\n\"We could try but because the booth is near the entrance we'd have to get a closer to it then the goons in the warehouse,\" Carla responds.\n\n\n\"If he's not paying attention it shouldn't be too difficult,\" Victoria assumes.\n\n\n\"We can still use Westfield's gun to subdue him,\" Moira suggests as an alternative.\n\n\n\"Maybe but If he calls our bluff he'll kill us,\" Carla warns.\n\n\n ", "action_results": [{"action": "Subdue the guard in the booth", "result": "\"Carla can you take care of the guard in the booth?\" You request.\n\n\n\"Sure.\" Carla agrees. She walks up to the door of the booth and charges in with Westfield's revolver drawn causing the guard to jump.\n\n\n\"Hand over your gun asshole, try anything stupid and I will put a fucking hole in your head.\" Carla threatens. The guard quickly toss his gun to Carla.\n\n\n\"Ben put Moira down and get in here.\" Carla orders.\n\n\nYou gently place Moria on the ground and walk into the booth. Inside you see a chair in front of a small desk with a logbook and a landline phone on it. \"Call the police with that phone, I'll keep this piece of shit right here.\"\n\n\n\"I thought you didn't trust the other officers.\"\n\n\n\"Westfield is dead, his gang will fall apart without him, due to fighting over who should replace him and general stupidity, once word is out that Westfield will be no longer able to protect them, every cop is going to go out of their way to show they were never on his side, now call.\" You do as she instructs and after a few tense minutes you hear sirens approaching, finally this nightmare was over with.\n\n\n ", "action_results": [{"action": "Three months later", "result": "As you pick up two mugs of freshly brewed coffee you look out the kitchen and see the cloudless blue sky and the sun shining brightly, perfectly capturing your mood. You walk to the kitchen table and hand Moira sits down at your kitchen table a mug. \"Thanks.\" She says as you take a seat next to her.\n\n\n\"So how's Vic enjoying college life?\" Moira inquiries.\n\n\n\"She's crazy about it, every day she calls telling me how much loves it there, that they professors are awesome and the people are so nice,\" You answer.\n\n\n\"You really miss her don't you?\"\n\n\n\"Yeah, but she has to go out spread her wings and live life, something I should've done a while ago.\"\n\n\n\"Hey better late than never, I know you might not see it, but your social skills have improved drastically since working at my place, better then Carla will ever be, can you believe she's going to made the chief of police?\"\n\n\n\"She saved our lives.\"\n\n\n\"Bah, you had just as big of a role if not a bigger role in getting us out of there.\"\n\n\n\"You've been very helpful to me, I couldn't have been able to make such a big improvement without you.\"\n\n\n\"Hey it's the least I could do since you helped me while my leg was messed up.\"\n\n\n\"How's it doing by the way?\"\n\n\n\"There is always going  be a scar, but my leg is basically back to normal, although I'm going to insist you still give me those piggyback rides.\" Moira puts her hand on yours and kisses you on the check. The world may be a scary place but you can take comfort in knowing you don't have to face it alone anymore.", "action_results": []}]}, {"action": "Sneak past the guard in the booth", "result": "\"Sneaking worked last time, so let's stick that,\" You decide.\n\n\nYou, Carla and Victoria crouch down to avoid being seen in through the booth window, after you make it past the guard you walk towards the exit. What you didn't know is the guard was taking his job far more seriously than the one's playing cards in the warehouse. He spots you through the front window of the booth as you approach the open gate. He quickly runs out with his gun drawn. When you hear him running out, the three of you make a run for it but since you're carrying Moira you can't run as fast. The bullet goes through Moira and into you causing you to fall to ground. Victoria and Carla are able to get away, so at least your death isn't in vein.", "action_results": []}]}]}]}, {"action": "Run up to Westfield", "result": "You run up to Westfield in an attempt to take the gun out of his hand. Unfortunately, during the time it takes you to reach him, Westfield s aims his revolver at you and fires several shots. You get struck several times and get killed before you even hit the ground. The good news is that killing you used up the rest of the bullets, so at the least girls have a chance of getting out of here.", "action_results": []}]}]}]}, {"action": "Attack the intruder", "result": "You grab your wooden desk chair and hoist it above your head as your bedroom door is kicked open. A large, well built man with a rough face holding a gun stands in the doorway and is taken aback by you armed with the chair. While he hesitates, you swing the chair at him, hitting him in the ribs and breaking the chair in the process. He staggers back and inadvertently fries his gun hitting you in your ribs, causing you to fall back and land on the floor. As you lay on the ground dying, you can hear the man shout \"Damn it, I was supposed to bring him alive\".", "action_results": []}]}, {"action": "Don't let Moira stay", "result": "\"Moira, you're being paranoid, I'm just as worried about Victoria as much as you are, but the situation is only going to get worse if we don't act rationally,\" You point out to Moira.\n\n\n\"You're right, I'm just still in shock about everything and I feel like absolute shit, just promise to have your cell phone on in case I need to call you,\" Moira expressed while still overwhelmed with emotion.\n\n\n\"Of course, just put your number in my phone.\"\n\n\nYou hand your cell phone over to Moira who begins looking at. \"Christ, your only contact is Victoria?\" when this is all over with I swear I'm going to teach you how to make friends.\"\n\n\nMoira adds her number and hands the phone back to you. \"Be careful kiddo,\" Moira says as she hugs you before heading out.\n\n\nLater that night you lay in bed wide awake, there is no way you're able to sleep with all that is going on. Thoughts are racing through your head, when your cell phone rings, it's Moira. \"What's up Moira?\" You answer as you sit up on your bed.\n\n\n\"Ben there's someone in my house, you have to get over here now!\" Moira screams on the other end.\n\n\n\"Moira, what's going on?\" You ask very frantically.\n\n\nThere is no response. You call out Moira's name several times but no one on the other end answers. While you are doing this you fail to notice a large well-built man with a rough face holding a gun has broken into your house and your shouting gave away your location to him. He opens the door to your room and in a panic you throw your cell phone at him hitting him the head.  He staggers back and inadvertently fires his gun hitting you in abdomen, you fall back on your bed and your vision begins to blur. The last words you hear are \"Damn it I suppose to bring him in alive\"", "action_results": []}]}]}, null]}, null, null]}]}, {"action": "\"Where's Victoria?\"", "result": "\"Where's Victoria?\" You say in a rather angry tone.\n\n\n\"Not even a hello, now why should I help someone who has no manners?\" Moira asks.\n\n\n\"For Christ sake's Moira, can you stop being a bitch for one second and just tell me where Victoria is?\" You shout as your patience runs out.\n\n\nThe other workers in the building have heard your outburst and now all eyes are on you. \"I think it's time for you to leave, Ben.\"\n\n\nEmbarrassed and feeling like a jackass, you head out and drive back home. This incident will no doubt make going out in the future more difficult.  When you're back in the safety of your dwelling, you begin to calm down. You go to your bedroom, sit down on your computer and begin the work you were going to do today. Although you are still upset, working relieves your stress quite a bit. After several more hours Victoria still is missing and your concern now as some justification. After the incident at Moira's, you really don't feel like heading out but need to determine what you're going to do next.", "action_results": [{"action": "Call the police tomorrow morning", "result": "You decide to call the police in the morning. The rest of the day is combination of worry, anxiety and boredom. After the sunsets you go to bed. During the night you don't get much sleep during as you constantly check your phone to see if Victoria has contacted you. When morning arrives you dart out of bed and rush into Victoria's room not bothering to knock. Your worst fears are confirmed when you see her bed is still empty. With no other option you call the police.\n\n\n\"911, what is your emergency?\" The operator on the other end inquiries.\n\n\n\"I'd like to report a missing person,\" You answer.\n\n\n\"What's your name sir?\"\n\n\n\"Ben Higgins.\"\n\n\n\"Who is it that's missing?\"\n\n\n\"My sister, Victoria Higgins.\"\n\n\n\"How old is she?\"\n\n\n\"Twenty.\"\n\n\n\"How long has she been missing?\"\n\n\n\"Since yesterday morning.\"\n\n\n\"So your sister Victoria Higgins has been missing since early yesterday?\"\n\n\n\"That's about it.\"\n\n\n\"I need your address.\"\n\n\n\"219 Okonedo Street.\"\n\n\n\"Alright, I'm sending someone over.\"\n\n\nThe operator hangs up and you spend several minutes pacing back and forth until you notice a police car pulling into your driveway.  A few seconds later there is a knock at the door. You open the door to find a women slightly older then you with light brown hair in a bun and matching colored eyes. You would find her pretty if wasn't for the serious look on her face.\n\n\n\"Hello, I'm detective Carla Northcutt are you Ben Higgins?\" She asks you with a no non-sense demeanor.\n\n\n\"I am, come on in,\" you respond in a direct way.\n\n\nCarla walks into your kitchen as you notice she as a somewhat annoyed look on her face. It's hard to tell if she's annoyed at something in general or if this was her natural personality.\n\n\n\"So when did you last see your sister?\" Carla begins her investigation.\n\n\n\"Two nights ago a friend of hers picked her up, Vic told me she was going out and would be back later, pretty much routine, the next day  I noticed she wasn't back and she hasn't responded to any texts or messages, this morning nothing had changed so I called the police,\" You bring Carla up to speed.\n\n\n\"You wouldn't happen to know where she went or who picked her up would you?\"\n\n\n\"No I never really pried, she hates when I do that.\"\n\n\n\"I'd like to search her room.\"\n\n\nYou lead Carla to Victoria's room and open the door. The detective doesn't seem bothered by the mess and eyes Victoria's computer. \"This might be able to help us,\" Carla suspects.\n\n\n\"I tried that yesterday, it's password protected,\" You point out.\n\n\nCarla is undaunted as she sits at Victoria's desk and begins typing on the laptop, after several tries she manages to get past the login screen and gains access to Victoria's files. \"Jackpot,\" Carla exclaims.\n\n\n\"How'd you do that?\" You say with astonishment.\n\n\n\"The password was password,\" Carla explains.\n\n\n\"You've got to be kidding me.\"\n\n\n\"I learned a long time ago it's better not to over think things, now I'm going to see what your sister's various social media pages can tell us,\" Carla browses through Victoria's various online accounts while you watch over her shoulder. One account has numerous photos and Carla begins looking through them. Most of the pictures are selfies, Victoria with various friends, even one with you and her. Suddenly one picture catches both you and Carla's attention, a picture of her kissing a man you don't recognize.\n\n\n\"Looks like somebody has a boyfriend,\" Carla says with the satisfaction of finding a break in the case.\n\n\n\"She never mention this to me,\" You say in a surprised and annoyed tone.\n\n\n\"Let's see who is, once I find a name I'll go pay him a visit and see what he knows about Victoria's whereabouts.\" Carla begins to read the comments of the photo in order to identify the man.\n\n\n\"You and Steve look SO cute together,\" one comment reads.\n\n\n\"Soon I'll be calling you Mrs. Upton,\" another comment says.\n\n\n\"His name is Steve...Upton I'm guessing, but yesterday there was...oh fuck!\" Carla says as her tone goes from confidence to concern. She quickly gets up and turns to you.\n\n\n\"Now listen to me Ben, what I'm going to tell you isn't to make any sense, but you have to do exactly what I tell you if we are to have any chance of finding Victoria,\" Carla warns. \"Yesterday a man named Steve Upton was found murdered in his home and I'm positive it's the same guy your sister was dating, I'm also positive that the person behind it also is behind Victoria's disappearance, the less you know the safer you'll be, I'm going to give you my card and call you if I find anything, do not under any circumstances call the police again.\"\n\n\nUpon hearing this dozens of questions enter your mind but Carla quickly leaves the house before you can get answers for any of them. Something was going on and you're in the dark. You need to get more information but how exactly?", "action_results": [{"action": "Call the police for more information", "result": "Although Carla warned you not to call the police, she didn't tell you why, in fact she told you almost nothing at all.  There is no way you're going to accept not getting any answers. You take out your cell phone and call the police again.\n\n\n\"911, what is your emergency?\" The operator on the other end inquiries once more.\n\n\n\"I'm Ben Higgins, I called a while ago about my sister being missing and the detective you assigned to investigate found out my sister's boyfriend has been murdered and then just ran off without telling me anything.\"\n\n\n\"Do you remember the name of the detective?\"\n\n\n\"Carla Northcutt.\"\n\n\n\"I see...I'm going to sending another officer, he'll explain everything, I'd do it myself but it would take too long just hang in there for a few minutes until he arrives.\"\n\n\nThe operator hangs before you can ask any questions, this cloak and dagger is really beginning to bother you. True to the operator's word, another police car arrives in the driveway a few minutes later. You hurry over to the door hoping you'll soon get to the bottom of this. Opening the door to find a man in a police officer uniform with a buzz haircut, before a word is spoken he takes out his gun and shoots you right through the heart. You die with many questions left unanswered.", "action_results": []}, {"action": "Look for information on the internet", "result": "You need answers, even if Carla is right when said you'd safer knowing less, finding your sister is more important. Your gut is telling you that you should avoid the police let Carla said, so you chose to sit at Victoria's desk and try to find information on the internet about Steve's murder. After searching \"Steve Upton murder Van Hove\", you find an online news article and begin to read it:\n\n\nMurder on Kerr Road\n\n\nSteve Upton, 28, was found murdered in his home around noon. Police had gotten a call from a neighbor about a possible break-in at Steve's address and his body was found shortly after entering the house. A Van Hove police spokesmen says that Steve was found with a \"W\" carved in his chest, the trademark of the notorious gang leader who goes by the alias Westfield. Police have asked anyone with information to come forward.\n\n\nA second search for \"Westfield\" revels information about a gang simply called Westfield's gang. You learn about rumors of having police officers on the take may explain why Carla didn't want you calling the police again. The gang itself commits nearly crime in the book from drug dealing to armed robbery to downright murder. You need to find out why this gang killed Steve, why they took Victoria and how you plan to get her back, the first step is taking out your cell phone and calling Carla.\n\n\n\"Northcutt,\" Carla greets.\n\n\n\"Detective Northcutt, it's me Ben, I just found out my sister was taken by some guy named Westfield, I really don't like being kept out of the loop,\" You complain.\n\n\n\"Look Ben, Westfield is an extremely dangerous man and I didn't tell you anything to keep you out of harm's way, if you're so insistent on getting involved then come over to my place where at least I can keep an eye on you, I'm at 224 Shamrock way.\"\n\n\n\"Why do I have the feeling there is still more you're not telling me?\"\n\n\n\"Just come over here and I'll answer your questions I promise.\"\n\n\nCarla hangs up, you get the feeling she is a caring person but has a very hard time showing it. Heading out the door and into your car, it occurs to you that Carla believes you're in danger, granted dealing with a criminal gang is dangerous but how much is her worrying justified and how much is simply in her head. You figure it's not worth worrying about as Carla is most likely you're best chance of getting your sister back, since it seems the police are at best useless and at worst the very reason you're in danger in the first place.\n\n\nArriving on Shamrock way you pull into Carla's driveway and notice along with a police car there is two black sedans in the driveway as well. Carla didn't mention she was having anyone else over and you doubt she bought two identical cars. Perhaps you're over worrying as much as Carla is and is something else she neglected to tell you.", "action_results": [{"action": "Go around back", "result": "Something isn't right, you don't know what is as information is proving to be hard to come by today. You walk down the driveway and into the backyard. There is a small patio complete with two outdoor lounge chairs. On one of the chairs is a heavyset man smoking a cigarette. This man might as well wear a sign that says \"criminal\" and you're positive it's better to stay away from him. There is a backdoor leading into the house and plenty of space between the man and the open door for you to avoid drawing attention. You manage to get inside and find yourself in a kitchen. Ignoring the dirty dishes everywhere you walk out of the kitchen and into a foyer. Briefly glancing at the rooms along the hallway you find they are all empty and eventually you reach the front entrance.\n\n\nA stairway to your left is your only option as you quietly head upstairs. On the upper floor there are a few doors to the left and a few to the right. You hear footsteps that are too heavy to belong to Carla coming from the right so you head left, as you look into a room and at last you find Carla. The discovery is bittersweet as you notice she is tied to a chair with blood coming out of her nose and she has acquired a shiner along with several other bruises. Without thinking you walk in as Carla franticly shakes her head, then you feel something hit on the back which causes you to fall to the ground. You're vision is a bit blurry but you see a man with slicked back blonde hair, wearing a white t-shirt and jeans, along with a revolver in his hand.\n\n\n\"Hello Ben, I'm Westfield, selling of drugs and take of lives, yeah that was lame I have to work on that, anyway it has come to my attention you're looking for your little sister and to answer the two questions on your mind, yes I took her and the reason why was I wanted to make money off her by turning her into a whore, I'm sorry about this, I purposely only take girls that have no family to avoid situations like these, but that dumbass Steve lied to me, good thing I killed him while I had the chance, sadly this makes you a loose end and you know what happens to lose ends, but since this wasn't suppose to happen, I'll give you a chance to say your final words, make them count\" Westfield rambles.\n\n\nBehind Westfield you notice Carla beginning to free herself from the ropes tying her hands to the chair she is in. If you can continue to distract Westfield long enough, she should be able to free yourself. \"Well what are your last words?\" Westfield asks impatiently.", "action_results": [{"action": "\"What's your name?\"", "result": "\"What's your name?\" You ask in an attempt to keep Westfield's attention on you instead of Carla.\n\n\n\"It's Westfield, that's literally the first thing I told you,\" Westfield says somewhat baffled by your question.\n\n\n\"No, I mean your real name, if I'm going to be killed, I should have the right to know the identity of the person who is doing the killing.\"\n\n\n\"I see your point, alright I'll let you in a little secret, I was born and raised in a town called Westfield in New Jersey, I loved that town, of course when I first became a criminal I made a lot of mistakes and the police were closing in on me, I eventually had to leave and I resettled here in Van Hove, I learned that it's important to have an alias and to make sure the police are on your side, most people think nicknames are way to be cool but for me, they make staying out of jail a little easier, but if you really must know my name it's John Tiegel,\" Westfield  prattles. You can see Carla almost is free of her restraints. If you can just distract Westfield for a little bit longer Carla should be able to escape.\n\n\n ", "action_results": [{"action": "\"I won't tell anyone about this\"", "result": "\"I won't tell anyone about this,\" You plead to Westfield.\n\n\n\"Well it really wouldn't make a difference if you told anyone about this or not, I own the police in Van Hove as I'm sure you already know, but it doesn't matter since I have no intentions on letting you leave, you see I plan on keeping your sister as I went to some lengths to obtain her and I know you're not just to going to forget about it, one day you'd come after me, maybe in a week or several years to try to take your revenge,\" Westfield explains in a rather longwinded way.\n\n\n\"For years Carla has tried to bring me down, despite my repeated warnings, I bet your wondering why she took on this case despite the dangers, well part of it is because she believes in law and order but I'm willing to wager it has to do with what happened to her family.\" Westfield continues as Carla makes a muffled scream through the tape on her mouth as if the topic is causing her to become upset. The scream causes Westfield to turn his attention back to Carla and she is forced stop trying to wiggle free.\n\n\n\"You see Carla wasn't always planning to be a cop, she was originally going to be a doctor, but one day while she was away at college someone broke into her family's home, this home, and killed her parents and two little sisters and before you ask it wasn't me, after that incident she quit college and joined the force, perhaps saving your sister would allow Carla closure for the failure of saving her family, but now it won't matter, she won't save her, she won't save you and she won't save herself and now Ben it's time for you to die,\" After Westfield's speech he turns back to you and shoots with his revolver, another victim of Van Hove's crime problem.\n\n\n ", "action_results": []}, {"action": "\"Go fuck yourself\"", "result": "Go fuck yourself,\" you bark at Westfield. \"Go fuck yourself, that's what you want your last words to be?\" Westfield responds puzzled. \"It's not very original and not exactly something you want written on your tombstone, although there is- Westfield's rambling is interrupted by Carla who punches him squarely in the jaw knocking him down.\n\n\nWithout hesitation Carla grabs Westfield's revolver and points at him. \"Shut the fuck up, you annoying loquacious bastard,\" Carla demands. She offers you her hand and helps you off the floor.\n\n\n\"Are you alright?'\" Carla asks.\n\n\n\"Yeah, I'm fine what about you?\" You ask in regard to the injuries Carla obtained.\n\n\n\"Don't worry, it's nothing that won't heal in a few weeks.\" Carla says as she keeps her gun firmly aimed at Westfield.\n\n\n\"Well detective are you going to kill me or what?\" Westfield goads as he continues to lay on the floor. \"You've must have fantasized about this moment hundreds of time, don't chicken out now.\"\n\n\n\"As much as I'd love to shoot your fucking head off, I need you alive to tell me where Victoria Higgins is.\"\n\n\n\"Yeah and then you'll just kill me anyway, tell you what if you give me your word that you'll spare me, I'll lead you to her.\"\n\n\n\"You're going to take her at her word?\" You interrupt, somewhat baffled by what Westfield said.\n\n\n\"Ben, I've known Carla for years and if it's one thing I've learned about her it's how much pride she has in the fact she is honest and incorruptible, it would go her against her nature to say she'll let me live and then just kill me, she calls it honor but in reality it's just egotistical.\"\n\n\n\"Shut up,\" Carla snaps at Westfield.\n\n\n\"So what's it going to be detective, is letting me live worth the life of Ben's sister?\"\n\n\n\"Alright you fucking asshole, you have a deal but if try anything I'll hurt you very badly, now call your two thugs downstairs to get in here, this deal doesn't include them.\"\n\n\n\"Fair enough, they failed in their task to keep intruders out so it's no skin off my nose if you kill them.\"\n\n\n\"Ben, take cover,\" Carla warns you.\n\n\nYou hide behind a dresser in the room while Westfield calls for his men. \"Lewis, Jerry get you're asses up here!\" He yells. Walking into the room oblivious unaware of the trap, the two men enter the room. Carla using Westfield's own revolver shoots one of the thugs in the eye while the other reaches for his gun. His able to take out of the holster but is shoot in the throat before he can even aim it at Carla.\n\n\n\"Now tell me where Victoria is,\" Carla aims her gun back at Westfield.\n\n\n\"Hillside apartments, it looks like an apartment building on the outside but it's really a whorehouse, she was brought there early this morning, the address is 197 Hillside Street,\" Westfield informs.\n\n\n\"Let's go get her then,\" You say rather impatiently.\n\n\n\"Hang on Ben, how many men do you have at this building?\"\n\n\n\"There's the man in charge, Ivo and I think he was two guys with him,\"\n\n\n\"Just three guys?\" You interrupt once again baffled.\n\n\n\"I own the police, I don't need to waste money recruiting more muscle then I need, besides there is also going to be about eight girls and a few johns\" Westfield points out.\n\n\n\"Well we should get over there but before we do...\" Carla trails off midsentence. She heads to the dresser you hid behind earlier and opens the top drawer, all the while keeping an eye on Westfield. She pulls out a set of handcuffs and tosses them to Westfield.\n\n\n\"Put these on,\" Carla orders.\n\n\n\"Kinky,\" Westfield quips as he puts the handcuffs on his wrists.\n\n\nCarla goes to the body of one of the dead henchmen and takes the gun from its hand. \"Take this,\" she says in a way that makes it sound she isn't going to take no for answer.\n\n\n\"I don't know how use these thing,\" You whine.\n\n\n\"You just aim and shoot.\"\n\n\nReluctantly you take the gun from Carla as she goes back to Westfield. \"On your feet asshole.\"\n\n\nWestfield complies and the three of you head out of room and downstairs. \"Ben, we're taking your car it would be a dead giveaway if we show up in my cruiser, also you're going to have to drive, I won't be able to do the driving and keep an eye on this fucker.\"\n\n\nYou nod your head in agreement and go out the front door. Once in your car along with Carla and Westfield you drive off to Hillside apartments. When you arrive you notice that the apartment building doesn't look anything like you thought it would, in fact it looks ordinary. Since most of your knowledge of the outside world has been through TV and movies rather than firsthand experience, the events that have happened today have made you realize the world is for better or worse not quite what you thought it was. You pull into a parking spot in front of the building.\n\n\n\"So I'm going to head ask for your sister, once I get her it's mission accomplished, there's nothing to it,\" Westfield plans out.\n\n\n\"Let's get going,\" Carla instructs.\n\n\n\"Hold it there detective, my men know who you are they will shoot on sight, not that I care but it would put my life in danger as well, Ben has to bring me in, also you're going to have to remove this handcuffs, they will defiantly know something is wrong if I enter the building wearing these.\"\n\n\n\"Don't take your eyes off him,\" Carla warns you. \"If I here gunshots I'm coming guns blazing.\" Carla lets Westfield out of his cuffs as you get out of the car. Westfield soon does the same while you heed Carla's advice and watch every move he makes.\n\n\n\"I saw the way you looked at Northcutt, do you have a thing for cops or authoritative women in general?\" Westfield pokes fun at you. \n\n\nDue to being far more focused on finding Victoria you ignore Westfield and the two of you head inside. The interior looks just as ordinary as the exterior as you make your way to the front desk. Behind the desk was a heavy set man who might as well be wearing a sign that said \"sleazy\", he must be Ivo. He is looking into space when he noticed you and Westfield. Upon recognizing his boss he becomes much more attentive.\n\n\n\"Westfield sir, what brings you here? Ivo says somewhat surprised by Westfield's presence. \"Who's this with you?\"\n\n\n\"Never mind who this is, bring me Victoria,\" Westfield demands with a no nonsense attitude.\n\n\n\"Who?\"\n\n\n\"The girl that was brought in this morning you moron.\"\n\n\n\"Yes of course I'll get her right away,\" Ivo obliges as he scurries from the front desk and goes up a flight of stairs. Several tense minutes later he comes back down with a girl, it takes you a moment to figure this is your sister. She is covered in bruises, has an eye swollen shut and looks absolute petrified.\n\n\n\"What happened to her?\" You say very upset which causes Ivo to look at you awkwardly.\n\n\n\"My friend asked you a question,\" Westfield reminds Ivo.\n\n\n\"Oh yes, you see the first customer who requested her, nearly got his eyes scratched out, I had to break her, so she would understand the consequences.\" Rage fills your body of the thought of this lowlife causing harm to your sister, you remember the gun Carla had given you.", "action_results": [{"action": "Kill Ivo", "result": "This monster has caused harm to your sister and he will pay for what he has done. You take the gun Carla gave you and aim it at Ivo. Before he has a chance to react you pull the trigger and the bullet hits him just below his knee.  He falls backwards onto the ground grabbing his leg and screaming in agony. You're about to fire another shot when Westfield grabs the gun out of your hand. He quickly shoots you in the stomach and like Ivo you fall backwards onto the ground. Westfield stands over you and is about to shoot you again when a bullet hits him killing him and removing a portion of his face. His lifeless body slumps over and lands on its side. You manage to turn your head see it's Carla who shot him, she walks to the middle of the lobby ignoring you and grabs Victoria by the hand, she must figure it's already too late to save you. Carla begins firing at someone else but you don't have any strength to turn your head to see who, it's most likely the two men with Ivo that Westfield had mentioned earlier. Carla is able to get out of the apartment building with Victoria. Westfield is dead and your sister is safe, that fact comforts you and makes dying far less painful.", "action_results": []}, {"action": "Don't kill Ivo", "result": "You decide not to kill Ivo, it takes ever nerve in your body to resist the urge to point your gun at him and shoot. As badly as you want this monster to pay for what he did to Victoria, trying to kill him would put you and your sister in danger and you're very close to getting out of this situation. You know where Ivo works, there will be time to get revenge another day.\n\n\n\"I'm taking her, you don't need to know why,\" Westfield bluntly tells Ivo.\n\n\n\"Yeah sure, she'd but nothing but trouble for me anyway,\" Ivo presumes.\n\n\nYou take Victoria by the hand as you head out of the apartment building. You notice Victoria says nothing and doesn't acknowledge you in any way. When you try to make eye contact with her, she gives you the thousand yard stare with her eye that isn't swollen shut. As soon Westfield is dealt with you need to get her to a hospital.  You, Westfield and Victoria leave head outside and towards your car. Carla gets out of the back seat when she sees you approaching.\n\n\n\"Oh my god what happened to her?\" Carla asks in regard to Victoria.\n\n\n\"One of Westfield's men hurt her,\" You explain trying not to get too upset.\n\n\n\"I had no idea Ivo would that,\" Westfield defends himself.\n\n\n\"Like would give shit, now put your jewelry back on,\" Carla orders as she tosses the handcuffs back to Westfield.\n\n\nYou help Victoria into the passenger seat as Carla and Westfield seat in the back. After helping your sister you get into the driver's seat and head off. \"Where are we going?\" You ask Carla.\n\n\n\"Head out to Kennedy road,\" Carla requests.\n\n\n\"Kennedy road, there's nothing out there...oh shit!\" Westfield figures out what is happening. After fifteen minutes of driving in silence you turn on to Kennedy road. It's outside of Van Hove and as Westfield claimed there is nothing out here. The road seems to go for miles as two empty fields lie to the left and right of the road. After going along on the road for almost a mile Carla tells to stop the car. \n\n\n\"Alright get outside,\" Carla commands.\n\n\n\"You can't do this, I kept my end of the deal,\" Westfield protests. After exiting the car Carla grabs Westfield by arm and keeps her gun firmly pressed against his back.\n\n\n\"Ben get over here,\" Carla calls to you.\n\n\nYou follow her as she leads Westfield away from the road and deeper into the field. \"On your knees,\" She continues to order Westfield.\n\n\n\"You're not going to do this, you're too proud to do something so underhanded,\" Westfield tries to call Carla's bluff.\n\n\n\"True, I gave you my word that I wouldn't kill you, but I never said anything about Ben,\" Carla points out.\n\n\n\"What?\" You say as Carla's comment catches you off guard.\n\n\n\"Ben if you don't kill this monster, he'll just harm more people like he harmed Victoria, you need to put an end to this.\"\n\n\n\"I know a killer when I see one and Ben you're no killer.\"\n\n\n ", "action_results": [{"action": "Kill Westfiled", "result": "Holding up the gun you got from Carla you put the muzzle up to the back of Westfield's head. You pull the trigger immediately without saying anything knowing the longer you hesitate the more difficult it would get. Small bits of what used to be Westfield's head wind up landing on your shirt as his body falls forward. You stand in silence as the realization of what you just did sinks into your mind. Carla notices you're becoming uneasy.\n\n\n\"You did the right thing Ben,\" Carla comforts you as she puts her hand on your shoulder.\n\n\n\"What's going to happen?\" You ask.\n\n\n\"Westfield's gang will implode, the police will start doing their fucking job now that no one will be paying them to do otherwise and Westfield will become a meal for the vultures, now let's get your sister to a hospital.\"", "action_results": [{"action": "Three days later", "result": "Ivo sat in his room behind the front desk. With the death of Westfield the rest of the gang has either left Van Hove or fighting in a fruitless battle for control of what little power the gang still has. Once word had reached his brothel about what had happened, all of the girls who were working for him left. It always the fact the Ivo was connected to Westfield that kept girls living in fear of him, without Westfield he was nothing. The two men who served Ivo left shortly after in an attempt to save themselves. Ivo also thought about leaving but he had nowhere to go. His only hope would be that in time a new criminal would come in and take over Van Hove and Ivo could offer his services to him.\n\n\nThe sound of footsteps came from out in the hall. Ivo picked up his shotgun off the floor and head out. Running out of his room Ivo took cover behind his desk. Briefly peering out he saw nothing but he knew someone was there. \"Van Hove police department, drop your weapon and come out with your hands up!\" A voice called out.\n\n\nKnowing he couldn't bribe or shoot his way out of this, Ivo tossed his shotgun over the front desk and walked up with his hands in the air. In front of the doorway was Carla aiming her gun at him, yet she wasn't alone, you were standing beside her. The last time you were here you spared Ivo simply because it was too risky for you and your sister. Now there was no risk at all, Westfield is dead, Ivo's guards have abandoned him and Victoria is recovering at the hospital.\n\n\n\"You!\" Ivo shouts upon remembering you from your last visit. \"I knew you had something to do with what happened to Westfield.\"\n\n\n\"I killed Westfield for kidnapping my sister, you harmed her and now I'm going to kill you.\" You threaten.\n\n\n\"Detective Northcutt, you're a cop, you're not going to let him kill me in cold blood are you?\" Ivo tries to plea with Carla.\n\n\n\"All my life I played by rules and it wasn't until I broke them that I actually got where,\" Carla says as she aims her gun at Ivo and shoots him in the kneecap. Ivo falls face down and start screaming in pain. You approach him while Carla hands you her gun. Like with Westfield you put the gun on the back of Ivo's head and pull the trigger. Unlike with Westfield you have no doubts about what you did.\n\n\n ", "action_results": []}]}, {"action": "Don't kill Westfield", "result": "\"This isn't right,\" You tell Carla. \"It's wrong to kill someone in cold blood even if they are a monster.\"\n\n\n\"Are you fucking kidding me?\" Carla yells at you and for a moment you worry she is going to shoot you in addition to Westfield.\n\n\n\"In case you haven't noticed, because of this shithead your sister is psychically hurt and traumatized, all because he couldn't bother to earn money with a nine to five job.\"\n\n\n\"The reason why you never took Westfield's money or ignored his crimes was because you knew it was important to do the right thing no matter the cost, that's what being a cop is all about, you are last officer in Van Hove who is aware of that but if you kill Westfield you will become the very thing you're fighting against and you will be no different than the cops who took his money.\"\n\n\nCarla's express seems to calm a bit after listening to you. \"You're right, I will personally make sure Westfield spends the rest of his life behind bars.\"", "action_results": [{"action": "One week later", "result": "You walk into Victoria's room with a small vase holding water and flowers. As you enter you see Victoria resting on the hospital bed, a bandage covers her swollen eye and is still emotional fatigued from all that has happened. Upon seeing you however she lets out a smile.\n\n\n\"Some flowers should lighten things up here,\" You claim as you put the vase on a window still.\n\n\n\"Thanks,\" Victoria says weakly.\n\n\n\"The doctor says you should make a full recovery, next week you'll be able to come home,\" You try to cheer Victoria up.\n\n\n\"I have to see the psychologist they have here for next three months, I think her name is Dr. Nikol or something like that.\"\n\n\nYou walk to your sister's bed and hold her hand. \"It'll be alright,\" You reassure her.\n\n\nCarla suddenly walks into the hospital room. \"Sorry to interrupt this family moment but can I speak to you for a moment Ben?\" the detective bluntly asks you.\n\n\nYou look at Victoria who gives you a nod of approval and you head out of the room with Carla. \"What's this about?\" You ask.\n\n\n\"I wanted to thank you for stopping me from killing Westfield, I always thought so highly of myself but in the end I let my obsession with bringing him down consume me, thank you for helping me coming to my senses,\" Carla praised. \"Also I should let you know I persona lead the raid on hillside apartments, his men were gone but we caught that fucker Ivo.\"\n\n\n\"That's a big relief and please note that you're a good cop and a good person Carla, you could've easily ignore what I said and shoot Westfield anyway.\"\n\n\n\"You're too kind, but I resigned from the police force this morning, I can't let myself get consumed like that again, also I plan on leaving Van Hove because there's nothing but painful memories here, but thanks to you I know there are still good people in this word, goodbye Ben,\" Carla hugs you and begins to make her way to the elevator.\n\n\n ", "action_results": []}]}]}]}, {"action": "\"Why my sister?\"", "result": "\"Why my sister?\" You ask Westfield. \"Out of all the girls in Van Hove why her?\"\n\n\n\"That's a fair question, you see her boyfriend Steve liked to gamble but no matter how much he gambled he never could seem to win, he wound up owing me quite a bit of money and would never be able to make enough money to pay me back, then two days he calls me and says he has a girl he can offer as payment so the next day I have one of my guys go and get her,\" Westfield tells you.\n\n\n\"Why did you kill him?\"\n\n\n\"I learned he had been dating your sister for a month, a person who pretends to be in love with someone else for their own gain can't be trusted, maybe I overacted but it's better to be safe than sorry besides it's not like you feel sorry for that piece of shit, even a by the book cop like Carla here would waste too much time with his death.\" As Westfield says this his attention turns to Carla and she is forced to stop trying to free herself.\n\n\n\"Now it is time for you to die Ben,\" Westfield seals your fate as he turns back to you and shoots with his revolver and you are killed as Westfield again chooses to be safe rather than sorry.\n\n\n ", "action_results": []}]}, null, {"action": "\"Go fuck yourself\"", "result": "\"Go fuck yourself,\" you bark at Westfield.\n\n\n\"Go fuck yourself, that's what you want you're last words to be?\" Westfield responds puzzled. \"It's not very original and not exactly something you want written on your tombstone, although there is grave in Canada and I swear to god it has the words 'Fuck you' written on the side, but it's not obvious, you have to really pay to attention to see it but it's there,\" Westfield continues to blather but you can see Carla almost is free of her restraints. If you can just distract Westfield for a little bit longer Carla should be able to escape.", "action_results": [{"action": "\"What's your name?\"", "result": "\"What's your name?\" You ask in order to keep Westfield's attention on you instead of Carla.\n\n\n\"It's Westfield, that's literally the first thing I told you,\" Westfield says somewhat baffled by your question.\n\n\n\"No, I mean your real name, if I'm going to be killed, I should have the right to know the identity of the person who is going to do it.\"\n\n\n\"I see your point, alright I'll let you in a little secret, I was born and raised in a town called Westfield in New Jersey, I loved that town, of course when I first became a criminal I made a lot of mistakes and the police were closing in on me, I eventually had to leave and I resettled here in Van Hove, I learned that it's important to have an alias and to make sure the police are on your side, most people think nicknames are way to be cool but for me, they make staying out of jail a little easier, but if you must know-\" Westfield's rambling is interrupted by Carla who punches him squarely in the jaw knocking him down.\n\n\nWithout hesitation Carla grabs Westfield's revolver and points at him. \"Shut the fuck up, you annoying loquacious bastard,\" Carla demands. She offers you her hand and helps you off the floor.\n\n\n\"Are you alright?'\" Carla asks.\n\n\n\"Yeah, I'm fine what about you?\" You ask in regard to the injuries Carla obtained.\n\n\n\"Don't worry, it's nothing that won't heal in a few weeks.\" Carla says as she keeps her gun firmly aimed at Westfield.\n\n\n\"Well detective are you going to kill me or what?\" Westfield goads as he continues to lay on the floor. \"You've must have fantasized about this moment hundreds of time, don't chicken out now.\"\n\n\n\"As much as I'd love to shoot your fucking head off, I need you alive to tell me where Victoria Higgins is.\"\n\n\n\"Yeah and then you'll just kill me anyway, tell you what if you give me your word that you'll spare me, I'll lead you to her.\"\n\n\n\"You're going to take her at her word?\" You interrupt, somewhat baffled by what Westfield said.\n\n\n\"Ben, I've known Carla for years and if it's one thing I've learned about her it's how much pride she has in the fact she is honest and incorruptible, it would go her against her nature to say she'll let me live and then just kill me, she calls it honor but in reality it's just egotistical.\"\n\n\n\"Shut up,\" Carla snaps at Westfield.\n\n\n\"So what's it going to be detective, is letting me live worth the life of Ben's sister?\"\n\n\n\"Alright you fucking asshole, you have a deal but if try anything I'll hurt you very badly, now call your two thugs downstairs to get in here, this deal doesn't include them.\"\n\n\n\"Fair enough, they failed in their task to keep intruders out so it's no skin off my nose if you kill them.\"\n\n\n\"Ben, take cover,\" Carla warns you.\n\n\nYou hide behind a dresser in the room while Westfield calls for his men. \"Lewis, Jerry get you're asses up here!\" He yells. Walking into the room oblivious unaware of the trap, the two men enter the room. Carla using Westfield's own revolver shoots one of the thugs in the eye while the other reaches for his gun. His able to take out of the holster but is shoot in the throat before he can even aim it at Carla.\n\n\n\"Now tell me where Victoria is,\" Carla aims her gun back at Westfield.\n\n\n\"Hillside apartments, it looks like an apartment building on the outside but it's really a whorehouse, she was brought there early this morning, the address is 197 Hillside Street,\" Westfield informs.\n\n\n\"Let's go get her then,\" You say rather impatiently.\n\n\n\"Hang on Ben, how many men do you have at this building?\"\n\n\n\"There's the man in charge, Ivo and I think he was two guys with him,\"\n\n\n\"Just three guys?\" You interrupt once again baffled.\n\n\n\"I own the police, I don't need to waste money recruiting more muscle then I need, besides there is also going to be about eight girls and a few johns\" Westfield points out.\n\n\n\"Well we should get over there but before we do...\" Carla trails off midsentence. She heads to the dresser you hid behind earlier and opens the top drawer, all the while keeping an eye on Westfield. She pulls out a set of handcuffs and tosses them to Westfield.\n\n\n\"Put these on,\" Carla orders.\n\n\n\"Kinky,\" Westfield quips as he puts the handcuffs on his wrists.\n\n\nCarla goes to the body of one of the dead henchmen and takes the gun from its hand. \"Take this,\" she says in a way that makes it sound she isn't going to take no for answer.\n\n\n\"I don't know how use these thing,\" You whine.\n\n\n\"You just aim and shoot.\"\n\n\nReluctantly you take the gun from Carla as she goes back to Westfield. \"On your feet asshole.\"\n\n\nWestfield complies and the three of you head out of room and downstairs. \"Ben, we're taking your car it would be a dead giveaway if we show up in my cruiser, also you're going to have to drive, I won't be able to do the driving and keep an eye on this fucker.\"\n\n\nYou nod your head in agreement and go out the front door. Once in your car along with Carla and Westfield you drive off to Hillside apartments. When you arrive you notice that the apartment building doesn't look anything like you thought it would, in fact it looks ordinary. Since most of your knowledge of the outside world has been through TV and movies rather than firsthand experience, the events that have happened today have made you realize the world is for better or worse not quite what you thought it was. You pull into a parking spot in front of the building.\n\n\n\"So I'm going to head ask for your sister, once I get her it's mission accomplished, there's nothing to it,\" Westfield plans out.\n\n\n\"Let's get going,\" Carla instructs.\n\n\n\"Hold it there detective, my men know who you are, they will shoot on sight, not that I care but it would put my life in danger as well, Ben has to bring me in, also you're going to have to remove this handcuffs, they will defiantly know something is wrong if I enter the building wearing these.\"\n\n\n\"Don't take your eyes off him,\" Carla warns you. \"If I here gunshots I'm coming guns blazing.\" Carla lets Westfield out of his cuffs as you get out of the car. Westfield soon does the same while you heed Carla's advice and watch every move he makes.\n\n\n\"I saw the way you looked at Northcutt, do you have a thing for cops or authoritative women in general?\" Westfield pokes fun at you. \n\n\nDue to being far more focused on finding Victoria you ignore Westfield and the two of you head inside. The interior looks just as ordinary as the exterior as you make your way to the front desk. Behind the desk was a heavy set man who might as well be wearing a sign that said \"sleazy\", he must be Ivo. He is looking into space when he noticed you and Westfield. Upon recognizing his boss he becomes much more attentive.\n\n\n\"Westfield sir, what brings you here? Ivo says somewhat surprised by Westfield's presence. \"Who's this with you?\"\n\n\n\"Never mind who this is, bring me Victoria,\" Westfield demands with a no nonsense attitude.\n\n\n\"Who?\"\n\n\n\"The girl that was brought in this morning you moron.\"\n\n\n\"Yes of course I'll get her right away,\" Ivo obliges as he scurries from the front desk and goes up a flight of stairs. Several tense minutes later he comes back down with a girl, it takes you a moment to figure this is your sister. She is covered in bruises, has an eye swollen shut and looks absolute petrified.\n\n\n\"What happened to her?\" You say very upset which causes Ivo to look at you awkwardly.\n\n\n\"My friend asked you a question,\" Westfield reminds Ivo.\n\n\n\"Oh yes, you see the first customer who requested her, nearly got his eyes scratched out, I had to break her, so she would understand the consequences.\" Rage fills your body of the thought of this lowlife causing harm to your sister, you remember the gun Carla had given you.\n\n\n \n\n ", "action_results": [null, null]}, null, null]}, null]}, {"action": "Go to the front door", "result": "You dismiss you're worries as paranoia and walk up to the front door. After ringing the doorbell you patiently wait. Finally the door opens and you're greeted by a large man.\n\n\n\"Yeah?\" The man rudely greets.\n\n\n\"I'm looking for Carla Northcutt,\" You explain.\n\n\n\"Who are you?\"\n\n\n\"I'm Ben Higgins, Detective Northcutt asked me to come.\"\n\n\nThe man heads back into the house without saying anything. You continue to wait in the doorway unsure of what to do next. Another man soon comes to the entrance he has slicked back blonde hair, wearing a white t-shirt and jeans, along with a revolver holstered on his hip.\n\n\n\"Hey Ben, sorry for the rudeness of my friend, we're all a little on edge, Carla is upstairs,\" The man greets. You walk into the house, a stairway is in the middle of the foyer. You're about to head up when unknown to you, the man with the slicked back hair takes out his revolver and points it at the back of your head. You never hear the gunshot that kills you.\n\n\n ", "action_results": []}]}]}, {"action": "Don't call the police", "result": "You decide not to call the police and try to convince yourself that you are just overanxious and this will all be over with soon. After eating dinner you go to bed. The night mostly consists of you tossing and turning.  When morning arrives you are too tired and too stressed to get any work done and for most of the day you don't really do anything. Your boss isn't going to be happy about this but your mind is completely focused on Victoria at this point. The sliver of hope you still have slowly fades as the hours pass and you beg for this torture to end. Finally around evening time you hear a knock at the door and run to it like a kid to presents on Christmas. Sadly it isn't Victoria but two police officers who tell you the grim news that Victoria's body has been found. If only you weren't such a recluse afraid of the outside world, dealt with Moira better or actually bothered to call the police you might have been able to find Victoria alive, as it is you must now come to terms with the fact you are truly alone.", "action_results": []}]}]}, {"action": "Search Victoria's room", "result": "Victoria would kill you if she saw you entering her room, but you own the damn house so that gives you permission to go in. You walk in and find it a mess, clothes are thrown everywhere, there is a plate with bread crumbs on her nightstand that is beginning to attract ants, but you're not bothered since her room is always like this. You look around but can't find anything that would give a clue as to where she went. In a corner is a desk with her laptop on it, you turn it on but find it's password protected. It was you who insisted that she set up a password, why did this have to be the one time she would actually listen to you? Next to the laptop you find a framed photo of you and her. She has a big grin on her face while you look miserable complete with frown and tilted eyebrows.\n\n\nThe search has turned up nothing and you come to the conclusion you're simply overreacting, she's probably out having fun and enjoying life, something you should start doing someday. Her cell phone most likely has a dead battery or she lost it, hence the lack of response. She'll presumably be home in a few hours and that will be that. For now you head into your and sit at your desk to begin working on your computer. Your computer is your sanctuary, your escape from reality. Talking to people via online chat is far less stressful then dealing with them face to face. Not long after you log on to your company's website, you begin working on fixing someone's computer, most of the time the problem is a virus someone got while trying to download porn or a pirated movie. After a while your work is interrupted by the growling of your stomach which reminds you that you never had breakfast. You go into the kitchen and have breakfast which consists of stale cereal and milk that's only one day passed its expiration date. When you put the milk back in the fridge you spot a note that had fallen off the door and sailed underneath the refrigerator. Picking it up off the ground you read the message on it.\n\n\nBen, since you don't ever bother to check your phone, I'm leaving this note to remind you to wake up early so you can get me to Jan's dance studio tomorrow 6/26 at 10 AM. I can't get anyone else to do it and yes I know I should have my license, please try to remember because I hate going into your room to wake you up since it smells like feet in there  -Love Vic\n\n\nVictoria loved dance and wouldn't miss it for the world, the worry you had earlier comes back and is a bit more potent this time. You decide to call the police, it may be a bit extreme but you figure it is better to be safe than sorry and take out your cell phone.\n\n\n\"911, what is your emergency?\" The operator on the other end inquiries.\n\n\n\"I'd like to report a missing person,\" You answer.\n\n\n\"What's your name sir?\"\n\n\n\"Ben Higgins.\"\n\n\n\"Who is it that's missing?\"\n\n\n\"My sister, Victoria Higgins.\"\n\n\n\"How old is she?\"\n\n\n\"Twenty.\"\n\n\n\"How long has she been missing?\"\n\n\n\"I woke up and she wasn't here and she hasn't been answering her cell phone.\"\n\n\n\"I'm sorry sir, but the law states a person has to be missing for at least twenty four hours before we can investigate, in most cases the person comes back on their own, if she is still missing by tomorrow morning, call us back.\"\n\n\n\"Thanks, I guess.\" You hang up the phone, unsure of what to do next, you could wait to see Victoria comes back by tomorrow and call the police if she hasn't. It's also still possible to go to Moira's and see if she knows anything.", "action_results": [null, null]}]}