{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=52887", "context": "", "first_story_block": "Her eyes dart from Fire Sage to Fire Sage. Of course, they will all betray her too just as everyone else has, but she can’t banish them yet. They must crown her first, but it’s a meaningless title now anyway. Fire Lord. Bah, what nonsense. Go back a few hours and it’d be the most powerful position in the world. The Fire Nation rules almost the entire world now, but with her father deciding to make himself the Phoenix King, not the most creative title, it makes her nothing but an honorary… something. Honorary vassal?\n\nOh, I’m letting my mind wander again. How foolish of me. I’m raving like a madwoman. She’ll banish the Fire Sages in a few moments before they could betray her. It all started with Mother. No, it started when Zuko betrayed her, stole all their mother’s affection by simply being born. At least Father pretended to like her. Too bad he just dumped her off here when he no longer had a use for her. Helping him commit genocide against the Earth Kingdom would’ve made some fun bonding moments.\n\nWhat’s taking them so long anyway? Put the crown on my head! It’ll make her the youngest, fifteen, and the first female Fire Lord ever. She blows a strand of her hair that’s been dangling in front of her left eye. She should’ve hacked that one off too like all the other untrustworthy hairs. Maybe she doesn’t look perfect right now. She can’t tell. She destroyed her mirror after Mother wouldn’t stop talking to her, from the other side of the reflection of course. She had the gall to not age for over half a decade and not even speak to her in person!\n\nWhat little remains of the logical part of her brain screams at her, telling her that she’s not well in the head. That was a hallucination, not her mother. All her servants, bodyguards, and teachers weren’t trying to kill her.\n\nAzula ignores that little voice in her head.\n\nJust as the fools were about to put that crown on her head, she sees him. Him! There he is, returning at the most inopportune moment! He’s been a traitor to her and their nation for how long? Weeks? He’s been hiding somewhere with this glorious nation’s most hated enemy, but he arrives to fight- No! He comes to betray her again, like everyone has done to her and like everyone will always do to her.\n\nAzula stands up and faces him, grinning like a madwoman. She says one word to him. “Zuzu.”", "action_results": [{"action": "1", "result": "The baby reaches for the bright ball, but she can never grasp it. Why? Other balls come to her hands. That one doesn’t. It makes her angry, but it makes her want that bright ball even more. It warms her, lets her feel alive. She stretches her arms out to seize the ball again. She fails again.\n\nThe tall person says words to her. Of course, Azula doesn’t understand any of them, but the words seem harsh. She has a distant memory of those words once sounding nice, but not any longer. The being she will one day know as Mother doesn’t say nice things to her. Instead, she moves the baby under the shade of a tree.\n\nShe decides not to cry. It never does much good anyway. The bright ball disappeared under the green stuff above her now.\n\nThe tall person and the short person sit by the water. Azula understands water. Once a day, she is put in water even though she doesn’t like the feeling. The water feels bad. The bright ball feels good and warm even though she never reached it.\n\nThe two people throw something into the pond. Little fury things swim up and eat whatever the two of them toss into the water. Azula watches them until they run out of stuff to throw. She later learns it’s called bread. While the tall person stays by the water, the short one walks over to her.\n\nShe doesn’t understand what he’s saying, but his tone is happy. He stresses one word over and over to her. She watches his lip movements and listens to that sound her makes. Why not copy it? It’s how she learns many things after all.\n\n“Z…”\n\nHe looks happier with that sounds, so he repeats that word over and over again. Perhaps he’s broken? Maybe he’ll be fixed by making that sound again.\n\n“Zuzu!”\n\nIt’s the first word she ever spoke.", "action_results": [{"action": "2", "result": "Azula giggles. It amuses her to see so many metal men run around. They always stand still or walk behind her, but now they seem frantic. They bend away the fire from the stupid, ugly painting. fears their red armor and spiky helmets, but not Azula. No, she’s a big girl who doesn’t feel scared.\n\n“Azula!”\n\nThe girl feels scared as her mother stands in front of the… What was the word? Tapestry! It’s a tapestry. Mommy trembles. A tear falls down her face. Why is Mommy sad? I bended fire!\n\n“What did you do, Azula?” Azula lowers her gaze. How come Mommy gets so angry at her and only her? She smiles at everyone else, well, except for Daddy.\n\n“I…” Why am I in trouble? “I bended fire, like Daddy and Zuzu.”\n\n“Tell me the truth. You’re two. No one bends fire at two. It was rare for Zuko to bend fire at only four.”\n\n“But I am tellin’ the truth.” She crosses her arms.\n\n“Did you hide the candles? Please tell me the fire you burned this with isn’t still burning.”\n\n“I burned it with my fire!”\n\n“You burned my only reminder of my family. Stop lying.”\n\n“I am not lying. I am your family!”\n\nShe stomps her foot on the ground. The rug catches on fire where her foot made contact. Unlike before, pure joy, now she feels afraid. Will Mommy be angry about this too?\n\nInstead of saying anything else, Mommy walks away in a hurry. The metal men, maybe they are called guards, bend that fire away too. She watches. They do it so easily. Why doesn’t Mommy yell at them? They bend, but she doesn’t mind. Why doesn’t Mommy love her?\n\n“A… Azula?”\n\nShe turns her head. Zuzu stands in the doorway, eyes wide. Zuzu burned something too when he first bended. It was part of Mommy’s dress, a pretty and black one. Mommy was so happy when that happened even though the fire made her skin look a little red on her hand. She loves Zuzu.\n\n“What did you do, Azula?” he asks, echoing their mother’s words. Again, Azula lowers her gaze.", "action_results": [{"action": "Show Him", "result": "She shoots some fire. It catches Zuzu’s shirt on fire. He screams like a girl before throwing his shirt off.\n\n“Why did you do that, Azula?” He has tears in his eyes. Did I hurt Zuzu?\n\n“I…” She looks at the ground. “I wanted to show you.”\n\nHe glances at his arm again. “Fire can hurt. It can kill. It’s why we’re so good at conquering the world.” Azula nods at the last part. “Don’t do that anymore. I… I have practice coming up about control. Um…” He sighs, or maybe that was a groan. “You can come with me for that.”\n\nShe tilts her head to the side. “Really?”\n\n“Yeah, really.”\n\nZuzu will help her. She never got to do big kid things with him before. He did all of this after she burned him? Her big brother is either the nicest person ever or a giant dum-dum.\n\nThey hear a new set of footsteps. She turns and sees someone she only remembers seeing twice before besides their nightly, tense dinners. Mommy stands behind him. She looks angry and confused. Maybe she’s wondering why Zuzu’s shirt is smoldering on the ground.\n\n“Daddy?” she asks. Zuzu takes three steps backwards.\n\n“Azula, you bent fire.”\n\n“Yes.” She clenches her tiny fists. Will he be angry like Mommy?\n\n“Good job.” He smirks. At this time in her life, it scared her. Eventually, she will learn to desire such approval.", "action_results": [{"action": "3", "result": "Azula fires another blast of fire with every punch. She imagines a new Avatar, unlike that one who died generations ago, standing in front of her. Each blast burns off more of his face until he’s nothing but a screaming skull. She would laugh at the sight, but she needs to focus. Her breathing is already… what was the word her teacher used? Impeccable. That’s the word. Her breathing is impeccable.\n\n“That’s enough for today.” Her teacher’s words make the girl stop. She wipes the sweat from her brow and glances at the sun. It warms her aching limbs. As always, she pushes herself the very hardest to make Mommy proud. Not good enough. I must be better. Maybe Mommy will like it more.\n\nHer mother moves from the chair she and the teacher sit at. She rushes past Azula and coddles Zuzu, struggling for breath. That dum-dum hasn’t come close to mastering breathing, let alone firebending. She knows she should feel pride. Already, she is better than Zuzu, but that hasn’t done anything for making Mommy like her. Why isn’t she good enough now? No, that doesn’t matter. She’ll become the best. That way Mommy must love her. Who doesn’t love the bestest of them all?\n\nBut… she is already better than Zuzu. He is nice to her, but Mommy doesn’t like her. Even if she becomes the bestest ever, what if that doesn’t work? I need two plans. Maybe, if Zuzu does bad things too, like burning tapestries, then maybe Mommy wouldn’t mind the bad things Azula does. But Zuzu doesn’t do bad things. He is nice.\n\nShe scratches her head for a moment before smiling. Zuzu doesn’t do bad things, but Azula does. Mommy only needs to think Zuzu did those. Maybe then she’ll be nice and love her.\n\nWhat does Mommy like? Mommy likes plays, the beach, Zuzu, and Turtle-Ducks. Azula can’t destroy the beach, plus the beach is fun. There aren’t any plays around, thank goodness. She doesn’t want to hurt Zuzu. But…\n\nShe decides to do it at night. Night is dark, so most firebenders sleep. That means no one will see her, right? The girl waits until night. She refuses to let herself fall asleep and counts to six hundred before sneaking out of her room. She sneaks from corner to corner in the darkness.", "action_results": [{"action": "Go to the Rooftops to Sneak", "result": "Azula sneaks up to a second story window. It is a super far drop to the ground, but she isn’t afraid. I’m not afraid at all. This feeling is just excitement. She shimmies over the window and lowers her first foot to the roof. After testing for footing, she puts her other foot down.\n\nThe princess keeps her arms out to stay balanced. The roof has a small angle, so it will be easy to slip and fall. She looks around. Everything seems so different up here, but she sees where the pond rests. It isn’t far away, but right now it seems like an endless distance.\n\nShe gains confidence with each step. Her feet make small clicking sounds on the tile. I can do this to make Mommy love me. Her legs tremble. Almost there. Just a few more minutes.\n\nA tile snaps loose under her feet. She slips and lets out a squeal as she grasps for any handhold. Then, she falls for a moment. Pain engulfs her.\n\nMommy! Daddy! Zuzu, help me!\n\nShe never does get to see her brother again.", "action_results": []}, {"action": "Stay on the Ground to Sneak", "result": "The guards in their red armor are on the lookout for people going inside the palace. They wouldn’t expect someone to be sneaking into the palace’s pond, right?\n\nIt turns out, she was right… or perhaps lucky. It doesn’t matter. She made it by sneaking from shadowy corner to shadowy corner. Standing by the wall, she knows that the pond will be in the open. She’ll have to do this fast. After breathing in and out a few times, the girl sets her sight on one duckling. Unlike the others, that one sleeps away from her mother. The others all cuddle under the mother’s wings.\n\nAzula rushes forward. Some of the turtle-ducks wake up when she arrives, but not her target. She plucks it out of the water. It squawks and bites her hand. She lights her hand on fire while still grasping it. She keeps the blaze cold enough to make it a painful death for the creature. When it stops struggling, she drops it in the water and flees.\n\nBlood drips down her pointer finger, but the elation of victory drowns any of the pain. Tomorrow, she will blame everything on Zuzu. Then, Mommy will forgive him because she loves him. Mommy will then forgive her since everything Azula had done before wasn’t as bad a murder.\n\nWhen she reaches her bedroom, she wipes the few trickles of blood on her nightgown. She falls asleep with ease. Uncle Iroh always said killing something made him feel sad. Now, she knows he’s a coward. She doesn’t feel bad at all, yet she’s only three.\n\nShe falls asleep with a smile on her face.\n\nWhen she wakes up, she puts on her normal clothes. Zuzu has servants who do it. So does Mommy. Mommy hasn’t given Azula any servants though.\n\nShe sprints to the dining room. Mommy always eats dinner at sunrise, and Azula always wakes up with the sun.\n\n“Mommy! Mommy!” she calls doing the best to sound anxious. She pushes open the dining room doors. She sees Mommy and Zuzu, as expected. She also sees two others. One is her father. He seems curious about something. The other is being held in Mommy’s hands. It’s a baby Turtle-Duck, the same one she killed.\n\n“Azula.” Mommy’s voice sounds cold. “Why did you do this?” Why does she know I did it?\n\n“I did not.” She crosses her arms.\n\n“I see the bite mark on your finger.”\n\nZuzu tugs on Mommy’s sleeve. “Mom, maybe she didn’t.”\n\nUsing the temporary distraction, she comes up with a story. “I wanted to pet the Turtle-Ducks last night. They don’t like me, so one bit me. I left, but I saw Zuzu. He sneezed, and it burnt one. I wanted to tell you before you thought it was on purpose.” She will believe that.\n\n“How could you kill an innocent creature, Azula? Why must you always lie?”\n\nMommy marches up to the girl and grabs her by the ear. As she gets pulled to a day full of yelling and spanking, she looks back at the two males in the room. Zuzu looks hurt, maybe fearful. Daddy… Daddy looks proud.\n\nThe next morning, Azula wakes up with a sore bottom and salty stains streaking down from her eyes. She also doesn’t dress herself. Three servants come in and do it for her. Azula doesn’t have any doubts over who sent them.\n\nAzula learned a powerful lesson that day. She lost any chance of Mommy’s love and lost Zuzu’s trust, but she still won. Azula could always win. Yesterday, she won Daddy’s approval.", "action_results": [{"action": "4", "result": "Azula feels nothing. Fire needs emotion to burn from her body as it needs wood to burn in a fireplace. No firebender can bend without emotion.\n\nThe prodigy decides she will bend fire anyway.\n\nShe uses determination. It’s the one thing she and Zuzu have in common. She will be the best bender ever and Fire Lord. Being fifth in line for the throne is simply a puzzle to solve. While her brother is determined to take all of Mother’s love, Azula will become lord. Once she’s old enough, she’ll challenge her uncle and his son to an Agni Kai and win. Then, Azulon. That’d let Father be the Fire Lord. She could challenge her father to an Agni Kai. He loves her, the only one who does, but love profits no one. Then, she’ll challenge Zuzu and kill him too.\n\nShe shakes her head. She’ll burn him, not kill him. He… He should live to see how amazing she is and then feel bad. That’s why. Nothing else.\n\nStupid emotions. I have no emotions. I am determined. I will bend fire without emotions! Emotions are bad. Father said so. Emotions cloud her judgement.\n\nShe jabs another burst of flame at the guard. This time, she gasps. The man doesn’t deflect this one. Instead, he stands there awestruck. The blast hits his head and he tumbles to the ground.\n\nAzula looks around. Her instructor stands with his mouth agape. She looks at her hand again as if it became a new appendage.\n\nShe lights her hand aflame, though the fire doesn’t burn her. It sooths her, like the sun. Unlike the sun, this flame is now a brilliant, beautiful blue.\n\nIt’s too splendid to hide from others. Everyone should see this. It’s so… “Perfect,” she mutters. Looking down at the guard with his armor still smoldering, she demands, “Tell me where Zuzu is! I wanna show him this.”", "action_results": [{"action": "5", "result": "Azula inspects the knife. “What are you doing with that?” Everything about the girl seems normal, except the knife she uses to carve her fruit. It’s a throwing knife.\n\nThe girl doesn’t move to acknowledge Azula’s words. Instead, she sighs. “I’m taking off the skin.” Azula shakes her head. She picks up another fruit from the ground and bites into it. Maybe this will get a reaction. It does, since the girl raises one of her eyebrows before shrugging.\n\n“You’re that politician’s daughter.” It’s a statement, not a question. Azula likes to know who’s who in her palace. Well, it’ll be her palace one day.\n\n“Tragically.”\n\n“Yet they gave you a throwing knife.”\n\nThe girl takes a bite of the fruit. Some of the juices fall onto her clothing before her dull companion wipes it off. “Why not?”\n\nAt this point, Azula realizes that the girl has spoken in nothing but a bored drawl. Perhaps this is all a waste of time, but there could be a benefit remaining.\n\n“Do you throw it much?”\n\nInstead of answering her, she girl stands up. With perfect form, she thrusts her hand outward. The knife flies straight an into one of the tree’s fruits. Azula didn’t know that the girl was aiming for a different fruit, but it looked like she knew exactly what she was doing.\n\n“How much do you practice?”\n\n“Whenever I’m bored.” Judging from her character, she feels boredom every day.\n\n“You’re going to be my friend now.”\n\n“Whatever.” After retrieving the knife, she sits down and proceeds to carve more skin off the fruit.\n\nAzula nods, happy to gain an ally. If she has that girl’s accuracy along with her sheer power, then it will be one step closer to being the best firebender ever and the best Fire Lord the world has ever seen. It will be-\n\n“Excuse me?”\n\nShe speaks without prompt now? Why? “Go ahead.” Is she… blushing?\n\n“Is your brother… nice?” This girl has a blush, no doubt about it.\n\n“Nice?”\n\n“Yeah, he’s… he looks nice.”\n\nAzula holds back a laugh.\n\n“Does your silence mean he’s mean, like everyone else here?” The girl looks down.\n\nAzula sighs and looks at the sun. “He’s nice.” She shifts her gaze back to the girl while making a stern looking face. “But he’s still a giant dum-dum. Maybe you could talk to him.”\n\n“But, he’s so old looking. Is he eight?”\n\n“Seven.”\n\n“His name is Zuko, right? You’re Azula, the one who bends blue fire?”\n\n“Yes.”\n\n“I’m Mai.”", "action_results": [{"action": "6", "result": "“Who was that?” She didn’t think Zuzu was paying that much attention. He seemed much more focused on that sand… sand mound? Perhaps it was supposed to be a palace or castle. That dum-dum has no artistic sense.\n\n“A new friend.”\n\n“Like Mai?” His eyes shimmer with that word. After a moment of contemplation, she decides it’s a shimmer of fear. Poor Zuzu’s afraid of girls, herself included. That’s good.\n\nShe nods. “Uh huh, this one’s flexible and jumpy. I’m gonna be so good, no one could shoot me in an Agni Kai, even if I don’t bend.”\n\n“And she wants to be your friend?”\n\n“Of course.”\n\nActually, Ty Lee, apparently from a family with a surname, seems to do this out of selfish reasons. She has a bunch of sisters, so being friends with a princess would differentiate her. All her actions scream “look at me” anyway. She’ll be easy to control.\n\nZuzu crosses his arms. “Will that one be heading to the palace?”\n\nShe raises her eyebrow. Why would she not? I wouldn’t befriend people who won’t be around. “Yes.”\n\n“Oh.”\n\nShe puts her hands on her hips. “It’s not my fault if I have more friends that you.”\n\nHe smashes the sand mound with his fists. Mother would’ve yelled at me if I did that. She didn’t even notice her precious son doing it. Even if she did, Mother would coddle him. She doesn’t see regret in his eyes. If it wasn’t for Mother, maybe Zuzu would’ve had a small chance at being a warrior.\n\n“It’s not fair.” He stands up. “How come you have so many friends?”\n\nIt’s Azula’s turn to cross her arms. “I have two friends. That’s not much.”\n“More than me.”\n\nShe shouldn’t be so surprised. He either flounders in his training or gets coddled by Mother. Is he capable of doing those boy game? Probably not. She should’ve put two and two together. Her brother’s isolated. Azula has broken free.\n\n“Zuzu, how many kids have you ever talked to?”\n\n“Um…” He stares at the sand as if it has become the most interesting thing in the world.\n\n“Let me guess…” She talked to him. Mai… Has Mai? Maybe. It’s hard to tell. “Two.”\n\nHe doesn’t say anything, but his fist clench and he takes a quick breath of air. I’m right, as expected.\n\n“Do you even know how to play Hot Rocks?”\n\n“No.”\n\nOf course, you wouldn’t know. I made it up, just now.\n\n“You heat up a rock like this one.” She runs to the edge of the beach where there’s a stone, probably sandstone. She uses her flames to make it hot, but not enough to make it explode. She found out how painful those can be. “Then, we throw it at each other.” I can let the heat flow through me. Can you, Zuzu?\n\nShe tosses the rock at him. He caught it and gave a very feminine yelp. Why am I behind him for the throne? He tosses it from one hand to another before chucking it back at her. She catches it and glances at the sun. From that angle…\n\nShe tosses it at Zuzu, but she lobs it at a high angle. Her training with Mai will reap some fun rewards. He looks up but can’t see it. The rock is falling in his eyesight to the sun, a blind spot made of light. Of course, a warrior or anyone with common sense would move out of the way, yet Zuzu’s too stubborn for that.\n\nThe rock hits his head, and he falls into the sand. Would Mother believe a bird would’ve dropped a stone on his head? Probably not. Did anyone see this? Mother and Father are down the beach sitting on the sand. The guards are back at the house, since it’s safe here. No one else dares come close to part of the royal family, except Ty Lee, but that girl has already wandered off.", "action_results": [{"action": "Lie Down next to Him... Just to Make Things Look Normal", "result": "She walks up and lies down next to her dazed brother. She pokes his shoulder without a response. He’s unconscious. She snuggles closer to her brother feeling the burning warmth of the sand on her back and the rhythmic breathing of her brother. Maybe he’s playing dead to make Mother upset, but it won’t work. They’ll think we’re lounging around in the sand if they see my lying with Zuzu.\n\nShe feels the cool breeze drifting over the ocean carrying the faintest tinge of salt. The waters lap against the sand like a heartbeat. She clenches some of the sand and sprinkles it on Zuzu’s forehead. She giggles and some falls into his mouth.\n\nHe opens his eyes and groans.\n\n“You should’ve dodged, dum-dum.”\n\nHe rubs his forehead, brushing off some of the sand. “There’s no honor in running away.” And now he’s talking about honor?\n\n“There’s also no honor is being thunked by a rock. Firebenders break through flame, but our soldiers without bending must dodge.”\n\n“But I’m a firebender.”\n\n“A really bad one.” She pokes his side. Oddly, he hasn’t tried to get away from her yet. “Maybe you should act more like a soldier than a bender. Maybe try some swords?”\n\n“No son of Sozin or any firebender would use swords.”\n\n“Which’s why you should.”\n\nZuzu stares at her, trying to read her expressions. He’s trying to decide if she’s insulting him or offering advice. Who says I can’t do both? She can read others easier than she can read that awful old poetry Mother likes so much. Zuzu couldn’t tell if she was sad if she was crying, not that she ever would.\n\n“Why are you still here, next to me?”\n\n“Don’t you trust me, big brother?”\n\nHe cringes. “No.”\n\nOuch. “Fine. You don’t have to, but I’ll always be on your side when we’re in battle. Well, unless we’re in an Agni Kai. I’ll just beat you quickly instead.”\n\n“We haven’t had a princess in battle for centuries, right?”\n\n“Yeah, but I will. You can be my armor bearer or something.”\n\nHis demeanor darkens. Ug, that sounds like Ty Lee and those auroras. “I don’t think I’ll ever get to a battlefield. I’d just get in the way.”\n\n“Which’s why you should be my helper. That way, you’d have a purpose.”\n\nThey lie there on the beach until sunset. Neither wanted to leave, since both knew what’d happen. They’d revert to their normal ways. They’d fight for their parent’s attention. Azula would scheme.\n\nBoth were right. They didn’t have a quiet moment for the rest of the trip. When they got home, they’d either avoid the other of fight. Azula would come out on top. She had to. Only perfection can reach the throne, and she’ll prove she’s perfection incarnate.\n\nHowever, she didn’t lie, not when making that promise. Even though their daily lives are like a battle against the other, on the real battlefield, she’d be there for her brother. No matter how much she dislikes the dum-dum, she knows it’s the duty of a royal to protect the weaker members of the family. But, that’ll happen years from now, maybe a decade. The Fire Lord will probably be her tea-loving uncle by then.\n\nEven Azula with all her cunning could never predict that the battlefield will come so soon. It’ll come charging towards Zuzu not from assassins or enemy soldiers. He’ll be threatened by his family.", "action_results": [{"action": "7", "result": "Azula sits at the desk as the teacher tries to teach the class. The girl tilts her head. On second thought, that woman teaches the class but not the princess. She learned these things on her own by staring at Father’s maps. Who wouldn’t? Tragically, this is also the only class that is remotely interesting.\n\nOther firebending children go to military school or, at worst, a normal school. Alas, Azula has the double-edged sword called royalty. A fire nation princess must know the dullest of things. How does one brew tea? How to sit perfectly still while the men talk? Raising childing? To any other girl, this may be interesting, but Azula knows her destiny is far grander than being a Fire Lady or a princess of the court. She WILL be Fire Lord. Fire Lords don’t need to know the steps of brewing tea. That’s for her uncle and cousin.\n\nWhile keeping her eyes on the teacher, she studies her interesting classmates, the only ones worth noting, from her peripheral vision. Mai acts like the perfect lady. Her parents expect nothing less. At least it gives me control over her. What noble family would want their daughter to not associate with the only princess of the Fire Nation? What bored daughter of a noble family wouldn’t want to have exciting times with a firebending prodigy? And be closer to Zuzu. Ew. What does she see in him?\n\nOn the other hand, Ty Lee bounces her leg up and down even as she sits. She looks almost as bored as Azula right now. Is she even capable of being still? She wouldn’t make a good infiltrator, but she could be our distraction. That Chi blocking will be handy as well. Still, does she feel out of place? Like me? Every girl here is a noble, but I am the princess while Ty Lee is technically a commoner. A commoner from a rich family, but a peasant nonetheless. When I become Fire Lord, I will elevate her family to nobility.\n\nAzula nods. Is it unnecessarily nice? I believe so, but I will guarantee the loyalty of a family of Chi blockers. Why hasn’t any Fire Lord possessed the intelligence to do that yet? Oh well, their loss will become my gain.\n\nShe waits diligently until class is over. Patience is a virtue of earthbenders, but even those savages can occasionally have a correct idea. They leave for lunch, which is another class. Here they learn to eat properly which is something Azula knows how to do. Mother made sure of that.\n\nAzula and her two followers sit away from the other girls and eat their meals. Their etiquette instructor occasionally walks by, but they are otherwise left alone. Ty Lee rambles about a cute boy she saw on the street. On the street? Ew. Also, cute boy? Ew.\n\nHer ears perk up. Always listening, she hears a very important word. Ozai. And, it’s just Ozai, not the proper Prince Ozai. She focuses on that voice, and its conversation. It looks like two girls to their left. Aren’t those the daughters of Uncle’s… something. Is it Captains or Majors? Either way, their fathers are out on that overly long campaign. I would have won by now.\n\n“And why isn’t he in the battlefields? I thought he was a powerful bender, like General Iroh?” It’s Crown Prince Iroh to you, stupid noble girl.\n\n“Mom said they need a royal in court in case the general and Prince Lu Ten die in combat.” You dare insult Father?\n\n“That doesn’t seem honorable for Ozai.” You no good-\n“It isn’t.”\n\n“Azula?” Ty Lee sounds worried. “Your hands are on fire a little bit.”\n\nI should have more control than that. Azula ends her blue flames. “Mai, Ty Lee.”\n\n“Yeah?”\n\nMai simply nods.\n\n“We have a mission to defend our nation’s honor.” She pauses for a moment before smirking. “I know exactly what we’re going to do.”", "action_results": [{"action": "Murder Them", "result": "It takes three hours of waiting for the right moment, but Azula has achieved her goal. Those two girls rush into a washroom. Ty Lee accidentally spilled some of her paint on their dresses. How unfortunate. Then, a candle happened to be knocked over. Who could possibly have such precision? Since none of the teachers can bend, a great deal of screaming and panic erupted in the room. It provided ample time for Azula to slip away from watching eyes. She down the halls to the washroom door. If the girls were intelligent, then they may have heard the ruckus, but they wouldn’t be at the receiving end of Azula’s wrath if they were intelligent.\n\nShe opens the door as the girls grumble, cleaning the pigment from their dresses. Oblivious, as expected. She lights her hands on fire. Blue flames dances in her palm. Neither girl notices their impending, painful death. Too bad. There would’ve been more of a challenge otherwise.\n\nWith each hand, she blasts the heads of both girls. The fire burns for only a moment before she snuffs her blue flames. One lets out a short gasp. The other falls without a sound. Too easy. The girl who just fell twitches on the ground but can’t say anything. Her vocal cords must’ve been burned. Either that or the pain is too great. Her head does look like a shriveled shadow of a head. Part of the girl’s skin falls off, the left cheek.\n\nAzula smiles. “That’s what happens if you insult my father.” The twitching girl stops twitching. I guess she’s dead now. Pity. I hoped that would’ve lasted lo-\n\nThe princess lets out a gurgle. A sharp pain jams itself from her back into her chest. Falling, she looks behind her and sees the other girl, the one who gasped, staring at her with a hateful eye, since the other one seems mostly melted at this point. Coughing up blood, Azula fells her back, and her hand bumps into a hilt.\n\nSpitting out blood, Azula stutters, “Knives aren’t allowed here.”\n\n“So is murder.” The other girl collapses but won’t take her eyes off her enemy.\n\n“Oh well.”\n\nAzula blasts fire again this time ensuring that the stabbing girl dies. Her vision grows dark. I won’t let Father think I failed him. She looks at her blue flame one last time. It is pretty. Then, she puts all her remaining strength into burning herself. The pain lasts for just a moment until she feels nothing at all. Since Azula doesn’t want Father to ever think she failed, maybe doing this will make it seem like some form of assassination where the princess and two hapless bystanders were killed.\n\nShe never does find out, but her plan works. The name “Princess Azula” became a rallying call for Fire Nation soldiers as they battled against Water Tribe and Earth Nation. One of those two had to be the culprits, right?\n\nThe nation mourned their fallen princess. At the funeral, Azula’s father had a stone-cold gaze. His tool was broken too early. Her mother shed tears, five to be exact even though two were just due to the smoke of incinerating the corpse. Zuzu did cry on that day. He cried that night. He cried that week. For the rest of his life, he couldn’t look at hot fires for too long. Some of those fire had the faintest traces of blue. Blue fire made him weep.", "action_results": []}, {"action": "Humiliate Them", "result": "Three hours later, Azula watches those two girls rush into a washroom. Ty Lee accidentally spilled some of her paint on their dresses. How unfortunate. Then, a candle happened to be knocked over. Who could possibly have such precision? Since none of the teachers can bend, a great deal of screaming and panic erupted in the room. It provided ample time for Azula to slip away from watching eyes. She down the halls to the washroom door. If the girls were intelligent, then they may have heard the ruckus, but they wouldn’t be at the receiving end of Azula’s wrath if they were intelligent.\n\nAnd this is why I train in combat beyond firebending.\n\nShe opens the door as the girls grumble, cleaning the pigment from their dresses. Oblivious, as expected. Firebending would be preferable, but blue fire would be a giveaway. Instead, she uses her foot. And Mother complains how I always wear pants. With the utmost precision and flexibility, thanks to lessons from Mai and Ty Lee, she kicked the back of one girl’s head. As she crumples, she kicks the other one as well. You can’t do that in a skirt, Mother. You also wanted me to wear dainty shoes, not these wonderful boots Father gave me.\n\nBoth girls seem semi-conscious. Azula takes out her brooch. And people wonder why I chose to have a sharp Royal Brooch.\n\nOne at a time, she gathers the girl’s hair in her hand, lift it up, and fells the hair in a decisive swipe. Ha! You will never recover from losing your hair! It may grow back, but your honor shall be gone! No noble lady would have hair like a boy! Now, wallow in your upcoming misery and shame!\n\nAzula sneaks back to the class just as the flames are put out. No one noticed her absence. Victory tastes sweet. No one may insult Father.\n\nAs planned, word spread quickly due to some strategically placed rumors. No one may insult Prince Ozai of the Fire Nation.", "action_results": [{"action": "8", "result": "Four princes and princesses eat in a strangling silence. Each eyes their companions with mistrust. The tension seems to be destroying everyone’s appetites, even Fathers.\n\nAzula takes another bite of her meal, though it’s not nearly spicy enough for her tastes. Why let good food go to waste? Why not enjoy the moment? This must be like the battlefields. She imagines herself standing at the walls of Ba Sing Se at the break of dawn. Her troops and the enemy’s glare at the other, waiting for one to make the strike to start the battle for the Earth Kingdom’s mighty, walled capital.\n\nInstead of those dirty barbarians and patriots dressed in the finest armor, there’s Mother and her son facing Father and herself. They even sit at opposite sides of the table. I know we’re supposed to do things for the image, but this does seem slightly… ridiculous? We haven’t shared a meal as a family for months. Always an excuse by somebody not to eat together. Too bad we don’t throw flames at each other. Agni Kais are made for these situations. Have your duel of honor and let the winner be right. Then, suck up your pride and accept the consequences.\n\nPoor Zuzu tries to melt into his chair. He’d make the worst of Fire Lords, especially during wartime. If he can’t handle family drama, how could he handle the lives of our people? Stupid Mother. You twisted and pampered him until I’m manlier than him. And I’m not manly, at all. I’m a ferocious princess.\n\nShe realizes everyone’s eyes are on her. I was smiling, wasn’t I? Okay, time to make that seem intentional.\n\n“I was reading about different types of warfare today.” She keeps her voice conversational, casual. It seems more out of place for this diner than a waterbender inside a volcano. Huh, would a waterbender die faster than a firebender? What about earthbenders since the volcano is part earth?\n\n“Azula.” Is it possible for Mother to say her name without sounding so critical? “What kind of classes are you taking at the Girl’s Academy? When I was there, they’d never teach su-”\n\n“They don’t.” The timing of her interruption was perfect, as intended. This way, Zuzu could still follow the conversation. “I taught myself.” She puffs out her chest.\n\n“Good job.” Father’s voice is cold, but the tone, unlike the words, were intended for Mother. His glare seems too cold for such a powerful firebender.\n\nZuzu slinks further into his chair.\n\n“I was trying to apply what I learned to Uncle’s campaign in Ba Sing Se. The barbarians seem to be using a hybrid between conventional and attritional warfare.” Attritional is a big word. Zuzu wouldn’t know that one, would he? “While it’s purely defensive, they rely on their tested methods of combat. Mostly reigning down stones and dirt on our soldier’s heads from those walls.” One day, she’ll see for herself if the walls are higher than some mountains as the legends and soldier’s tales say. “That would make it conventional warfare, but their goals lines up with a war of attrition. They aren’t going for a decisive victory. They want to wear down Uncle and his soldiers until they give up.”\n\n“Uncle wouldn’t give up.” Zuzu finally speaks.\n\nAzula shrugs. “He would if he ran out of tea. Speaking about our glorious Crown-Prince…” Was that too much sarcasm? “Uncle seems to be using conventional war for an attritional objective while also utilizing blockade warfare.”\n\n“Correct.” Father nods in approval. Mother sits still, like a prim and proper noble. Ug.\n\n“It’s stupid.”\n\nHer bold statement caused everyone to look at her. Father raised his eyebrows. Mother glared daggers at her. Zuzu acted as if she just insulted his hero. Well, I did just insult his hero.\n\nNow, it’s time to defend my statement. “The city has the farmlands between the outer and inner walls. It should be self-sustaining until the outer walls are breached. It’s more as if Uncle is blockading the world from Ba Sing Se, not Ba Sing Se from the world.” She straightens her posture. “But, we already know this. That means the enemy is not desperate yet, thus conventional warfare. Eventually, Uncle and his forces will breach the outer wall. The enemy will then become desperate and gain two advantages, only one I believe Uncle anticipates.”\n\nFather appears amused. Mother seems angry at her daughter for insulting Uncle and for speaking about things a girl her age couldn’t possibly understand. Yet, I understand anyway. Zuzu looks like he’s paying attention to her, though he’s unhappy with her critiques.\n\n“They’ll be fighting inside the walls. Home advantage, more so than what Uncle has been experiences. Also, the population won’t be happy with our presence. Uncle doesn’t have the will to use violent population control. The only way to not get crushed by a falling boulder is to either dodge or smash. We can’t retreat, so he can’t dodge. He doesn’t have to will to smash the people.”\n\nIn other words, Uncle is too nice to be a competent Fire Lord.\n\n“Then, we have the problem Uncle won’t expect. The Earth Kingdom is known for doing the same thing, patience and consistency. All that stuff. He’ll expect them to use conventional war.” She shakes her head. “Mother, if Water Tribe barbarians raided the palace and would possibly kill Zuzu, would you use honorable warfare or do anything possible to protect him?”\n\nMother’s eyes opened a little. She expected me to not involve her in my analysis. “A mother would do anything to protect her son.”\n\nAzula forces herself not to wince. A mother would do anything to protect her CHILDREN. “The barbarians will do the same. Urban guerilla warfare. It’s be nasty, too nasty for Uncle or any of our commanders.” She shakes her head. “Maybe Zhao. Definitely me or Father. When we need to push just month longer to conquer the city, Uncle will leave. After all, Lu Ten fights on the front lines.”\n\nMother stands up and leaves without a word. Zuzu looks between mommy dearest and the rest of his family. Then, he follows her out of the room.\n\n“Interesting assessment, Azula.” Father takes a bite of his food. “Might I suggest another scroll to read?”\n\n“Of course.”\n\n“It is one of my favorites. In my personal library, read the scroll named Lighting, Infiltration Tactics. You made find the ideology appealing as someone who looks beyond conventional warfare.”", "action_results": [{"action": "9", "result": "Mother coddles Zuzu after his embarrassment. Should’ve brought your swords, brother. Father never would take us to the Fire Lord in his throne room without showing us off. Well, showing me off. You just fell on your butt.\n\n“Ursa, Zuko and Azula, you are dismissed.” The old man’s voice still carries some power. He used to be the greatest firebender in the nation before old age took its hold. Azula does her proper bow and leaves Father behind. Too bad I’m not a few years older, then I could challenge you to an Agni Kai, maybe even kill you. I always thought you were stronger than this, but you’re just an old, frail man. A man who never bothering seeing me, ever. The wall of flames surrounding his throne aren’t a display of power when one never has the courage to step outside of them.\n\nZuzu falls behind Mother, still sulking after his embarrassment. Mother wouldn’t be able to hear anything she whispers to him. Changing her plans around slightly, she adds another member to her infiltration party.\n\nAzula takes his hand. “Zuzu, follow me,” she whispers. She drags him around a corner to a curtain. From what she saw during her time in the throne room, her first time ever, she decided that this would be the best spot for hearing what was meant to be a private conversation. Information is power.\n\nZuzu protests a little, but he quiets down when they poke their heads between the rich, lavender draperies. Father planned something, something huge. Lu Ten died as I predicted and Iroh gave up after breaching the outer wall and experiencing urban guerilla warfare as I predicted. Now, their Crown Prince is technically a deserter and without an heir. How come I’m the only one who seems to know exactly what’s going on? Besides Father of course.\n\n“You would not put on that performance without purpose. Ozai, what do you want?” Well, he’s to the point at least.\n\nIn his most official sounding tone, Father says, “Lu Ten has fallen nobly in battle, and my brother has no more heirs nor a wife to sire more. With my brother’s retreat and desertion following the death of my nephew, no one knows if or when he shall return. However, I am here, Father, and my children are alive. Let your humble servant ensure your bloodline will continue on the throne.” He bows before the old man.\n\nIn one day, will Father pass both Lu Ten and Uncle for his place on the throne?\n\n“Fool!” Father miscalculated. The flames around the throne rise to the ceiling from the old man’s fury. She holds Zuzu’s hand. If not, he’d flee in fear.\n“You dare wish to punish Iroh further? He lost his son! My son has suffered enough, but your suffering has just begun for your arrogance.”\n\nZuzu breaks free of her grasp and flees. If it wasn’t for the fiery inferno blazing around the Fire Lord, they would’ve heard him. Next time, only allow Mai and Ty Lee for infiltration operations. They’d keep their heads on straight.\n\n“Father, I only wish what is best for the Fire Nation.”\n\n“No, you wish only for power and do not understand the feeling of loss. Only you have not experienced the battlefield. Only you still have your family in the land of the living. In your arrogance and pride, you could not see the pains of others. Now, you will know the heartache of sacrifice. Iroh lost his son. You will lose yours, by your own hand.”\n\nIf you knew anything about your son, Fire Lord, you’d know he has no love for the boy. Still, I did not expect you to ask something so impossible for any Fire Nation prince to accept.\n\n“I accept your punishment.” What! “It will be done tonight.”\n“Go.”\n\nFather leaves. Azula stands motionless, trying to process a scenario that she never imagined.\n\nZuzu is going to die? Of course, he’d make a horrible general and a worse Lire Lord, but…", "action_results": [{"action": "Defy Father and Save Zuzu", "result": "She slinks into the shadows. No one can know that SHE knows. Information is power and in this… battle… I have only two weapons. Information and manipulation.\n\nShe sits against the walls and buries her head between her legs. Father has the physical and legal power. He has the backing of the Fire Lord, so doing anything to stop this would be treason. I’m not old enough to challenge him or the old man to an Agni Kai, nor would I survive such a suicidal tactic.\n\nShe clenches her fists. Who’s the enemy? The main combatant on the enemy side is Father. Sorry, Father for my temporary misalignment of goals. The leader is the Fire Lord, thus the entire Fire Nation would be on the opposing side. That includes all the palace guards. Anyone who aligns to me would do so out of personal selfishness or loyalty. It’s me versus everyone else.\n\nShe suppresses the urge to scream in rage. I cannot switch sides. I made a promise. “I’ll always be on your side when we’re in battle,” she whispers to herself as if to reaffirm her commitment. Mai and Ty Lee would follow, but Mai’s family is on some boring vacation. Ty Lee went to watch some circus in a miserable port town with her family. Fate has aligned with the Fire Lord. Who do I have?\n\nI have Zuzu, but he’s the problem, not an ally. Too bad he never bothered making friends with anyone. Uncle and Lu Ten would take his side, but they’re too busy abandoning their nation or being dead. That means there’s no one else… Mother. No, I am not involving her. I’ll save Zuzu myself. All I have is information and manipulation.\n\nShe sneaks away to the one place Zuzu would go at a time like this. Azula would flee for the docks to secure passage to the barbarian lands or hide among her friends. Zuzu would… be Zuzu.\n\nThe princess enters his bedroom as he sits in bed, covers up to his chin. Beds are flammable, dum-dum.\n\nHe looks scared. He should be due to his imminent and approaching death, but her brother doesn’t know that yet. He’s just being a scared little boy.\n\nI might as well be direct. She sits on the side of his bed and stares at him. “Father’s going to kill you.”\n\n“What?” He backs away from her. Oh, right. I’m Father’s beloved child just as he’s Mother’s. I ALWAYS lie. Ug.\n\n“He’ll sacrifice you. The Fire Lord wants him to experience the supposed pain of losing his son.”\n\nHe shakes his head. “Dad would never do that.” Denial? At a time like this?\n\n“Father doesn’t love you. He doesn’t like you. Maybe some Earth peasants would.” Zuzu’s really good at being a lovable idiot. Maybe some peasants would take pity on some lost Fire Nation noble. Then again, Zuzu would somehow tell them he’s a prince and get killed.\n\n“Run away?”\n\nShe shrugs. “Mopping the decks often gets free passage on merchant ships.”\n\nHis eyes move to the doorway. She sees the recognition on his face. I thought Father said he’d do it tonight. Salvage the situation, Azula. Maybe I could act like I was trying to kill him?\n\n“Azula.” Fate must be on Father’s side. “What are you doing here?”\n\nI’m saving your son, Mother. “Talking.”\n\n“Come with me.” The tone and the tight grip on her arm don’t allow for protests.\n\nAs she drags Azula out of the room, she hears Zuzu muttering, “Azula always lies.”\n\nThat HURT. She doesn’t struggle at all as she’s practically dragged through the halls. I’m the only person in the bloody world that’s trying to save Zuzu, but you’ve entrenched your ideas so far into his head that he refuses to believe me. You aren’t good for him, Mother. You aren’t good for anybody. Father’s going to kill him, but you’re the one who made him weak enough to kill. I wish you were gone. I wish you were dead.\n\nHer eyes light up. Dead. Gone. She sees a new opportunity. It’d kill two birds… four birds with one stone. Father would be so proud if she could ever tell him. Too bad she can’t and won’t.\n\nThey stop in Mother’s chambers. She stopped sleeping with father two years ago. Also, ew.\n\n“What were you doing, Azula?” And she thinks I’m the baddy here.\n\n“You once said you’d do anything if barbarians wanted to kill Zuzu.”\n\nHer eyes narrow. For once, Mother looks dangerous. Maybe I inherited a few things from her, besides beauty, after all. “Tell me the truth.” Her grip on the girl’s shoulder becomes painful. Maybe, it’ll leave a bruise.\n“Father’s going to kill Zuzu tonight because the Fire Lord asked him to.”\n\nShe doesn’t believe me. “Tell me one reason why I should believe you.”\n\n“Four. Zuzu won’t die. The Fire Lord will die. Father will get the throne, and you will be gone forever.”\n\nHer shoulders slouch. I don’t always lie. I’m occasionally nice. More importantly, sometimes the truth hurts more than the lie.\n\n“You have a plan, don’t you?”\n\n“Yeah.” Azula smirks.\n\nLater that night, the palace erupts into chaos. Azula stands watch in the shadows outside Zuzu’s door. He sleeps, blissfully unaware of the subterfuge and murder that just occurred. No matter what happens, she will not let anyone into his room tonight. Well, except that one. A figure gracefully approaches his bedroom. Unaware of the hidden prodigy, Mother rushes into his room. She shakes him gently.\n\n“Wha? Mother?” He rubs his eyes. None of the guards are aware of the woman in his room. Father happened to ensure no one was around his son’s bedroom tonight. Too late, Father. We spilt blood before you could.\n\n“Zuko, please, my love, listen to me. Everything I've done, I've done to protect you.” She wraps his in a tight embrace. She loves you, brother. Now, she’ll never see you again. “Remember this, Zuko. No matter how things may seem to change, never forget who you are.”\n\nBefore he could say anything in reply, she leaves. To where, Azula doesn’t know. All she knows is Mother will never return. She’ll always live with blood on her hands instead of her son.\n\nAzula smiles, a real one.\n\nI saved you, Zuzu.", "action_results": [{"action": "10", "result": "Azula stares at the smoldering corpse. Her offspring fuss around her body, fearful at their mother’s sudden lack of response. The girl knows Mother would’ve yelled at her, called her a monster. Mother isn’t here anymore. Ty Lee and Mai don’t criticize her. Father would praise her for having the guts to take a life. He killed every man who faced him in an Agni Kai, all twelve of them. Zuzu... What would her brother do?\n\nAs if Agni wanted to answer her question, Zuzu suddenly sat beside her. Azula squints, since Zuzu’s head lines up with the setting red sun, Agni’s presence in their world. She notices her heartrate increases. Why? The realization dawns on her. Mother saw me as a monster after I killed that baby turtle-duck. Now, Zuzu sees this.\n\n“Why’d you do it, Azula?” He sounds calm for the situation, far too calm than what she’d expect.\n\nShe shifts on the cold earth beneath her. “I wanted to see if they’ll make it.” She points to the seven turtle-ducklings.\n\n“You know they’re too young to live without their mother.” There’s pain in his voice. She always hears it whenever he speaks about Mother.\n\n“What doesn’t kill you only makes you stronger.”\n\nShe rubs her shoulder. Father had increased Azula’s training to more intense levels ever since his ascension to the throne. School drags by during the day. Firebending training comes at evening. She falls asleep every night reading scrolls about strategy and the human mind. Every morning, she practices her aim and agility. It hasn’t killed me yet, and there were so many chances during the firebending. I’m not dead, just stronger.\n\nZuzu picks up the dead turtle-duck mother from the pond and places it at Azula feet. “What are you doing?” she hisses.\n\n“We’re Fire Nation. We don’t let corpses rot or throw them to sea like the Water Tribe or burry them like the Earth Kingdom. This animal was Fire Nation.”\n\nShe tilts her head. You always had a fondness for animals. Maybe you would’ve fit better as the son of a farmer. Once again, Azula burns the animal, but this time she doesn’t stop until even the bones turned to ash.\n\nHis shoulders slouch. “I miss her too.”\n\n“I don’t. There’s a reason why no one talks about her. A good Fire Lord would never let personal loss cloud her judgment.”\n\nShe clenches her fists. The remaining turtle-ducklings won’t stop fussing. They continuously call out their high-pitched squeaks for a mother that will never come back to them. Their mother abandoned them. She wasn’t strong enough to stay. She never loved most of them anyway. She gave all her love to just one child. She…\n\nAzula shakes her head. I DON’T MISS, MOTHER!\n\nHer palms open to make blue flame. It’s time to end the noise.\n\nHe places his hand on her shoulder. “Azula, let me take care of them.”\n\nShe douses her flames. “Fine.”\n\n“I have one question.”\n\n“Fire away.”\n\n“Do you feel bad for killing?”\n\n“Not at all.” She crosses her arms. “I’m a monster after all.”\n\n“Remember this, Azula. No matter how things may seem to change, never forget who you are.” His words echo Mother’s final words to her beloved son.\n“I haven’t forgotten who I am.”\n\n“You’re my sister.”\n\nHe stands up and walks away.\n\nAzula never did tell him, but she kept track of Zuzu and his attempt at saving seven hopeless, motherless lives. All year, she checked… hoped… to find them dead. They never died. In one year’s time, they all grew up. It was just in time for Zuzu to leave them too. Like Mother, it wasn’t by choice.", "action_results": [{"action": "11", "result": "Azula smiles in utter glee as Zuzu screams in agony. In front of nearly two-hundred generals and nobles, Father burns off part of his son’s face.\n\nZuzu is going to live!\n\nHe didn’t see any of this coming either. Unlike last time, there wasn’t anything Azula could do. Uncle, who finally returned from his desertion almost a year ago, let her buffoon of an older brother into a war meeting. I been attending them for over a year, but I’ve always been smart enough to not speak a word. Her brother, on the other hand, almost immediately protested a general’s strategy. To make it worse, he protested due to morality and not strategy.\n\nOf course, the strategy was idiotic. Send a battalion of new recruits as a distraction to get killed? We already fully integrated women into our military because of a shortage of manpower. A war that lasts over a hundred years tends to whittle down a population, even to the winning side. Throwing away new blood instead of keeping them alive long enough to be veterans… Old men like to use old strategies.\n\nDue to her brother’s blatant lack of disrespect, he was challenged to an Agni Kai which he accepted without hesitation. With your newfound testosterone, you turn thirteen, so you accept the first honor duel that you’re able to legally accept. You thought you’d fight against an old man.\n\nHe screams again.\n\nThat war meeting, like all war meetings, took place in Father’s throne room. He would be the one to duel you.\n\n“Prince Zuko.” Father’s voice seemed to calm and collected compared to the convulsion and shrieks of her brother. “You are banished from the Fire Nation from this day forward. Leave tomorrow or be executed. If you wish to return, you must capture the Avatar and bring him to me. Go.”\n\nUncle rushes onto the dueling grounds faster than she ever seen the man move. He carries her brother away. At least my brother won’t be alone.\n\nWhen Zuzu saw that our father was the one he’d have to duel, he refused to fight. He fell on his knees and begged for mercy. It probably saved his life. If he fought, Father would kill him, but it would be far too aggressive to kill a begging child. I should’ve advised him to do that, but it looks like his idiocy pays off occasionally.", "action_results": [{"action": "Let Others Do the Saving", "result": "I ended up saving his sorry butt once already. Uncle should do something about this. He’s the one that got Zuzu in trouble after all. He should stop guzzling tea for a few minutes and save my brother’s life.\n\nShe walks to the training grounds and practices her firebending. The blue seems deeper today. The fire feels hotter. She notices how her stands of hair fall out of place more commonly, but that doesn’t bother her now. She lets her movements flow into the next with savage punching followed by wild kicking. Each time, blue flames come out and hit the target.\n\nIt hardly registers with her that it became dark outside. Firebenders draw their power from the sun, so they lose some of their power after the sun no longer gives its light. However, Azula’s fire hasn’t diminished, for each fireball has only increased her… confusion.\n\nI don’t feel anything!\n\nHer heart aches for her brother. No one else loves her like he does. Mother never gave her love. Father loves her because of her perfection and results. Zuzu loves her because she is Azula.\n\nI’m not sad!\n\nHer hands twitch on their own accord. She feels an emotion for only the most pathetic, weak excuses for human life that ever set foot upon the living world. Zuzu must feel it all the time. She feels fear. Fear of being alone. Fear of loosing her kin.\n\nI’m not afraid.\n\nHer lips twist into a ferocious snarl that would make the most battle-hardened men squirm. Her blood boils as if her fire has roasted it. She feels fury, rage. No one will save Zuzu, so he will die. He will lie all night being tended by their uncle. In the morning, he will realize his mistake and try to secure passage out, but he will be moments too slow. Her father will ensure Uncle Iroh will be too slow, so he can kill Zuzu.\n\nFine. I’ll admit I’m angry.\n\nGrumbling all the way, the princess marches to her room. Opening her lowest dresser’s drawer, she pulls out a small chest of coins. There never was much point to buying things when anyone would gift or give them to her instead. Putting more money in a bag than most peasants would see in twenty lifetimes, she slinks through the back passageways to the infirmary. Zuzu and I used to explore these. Father wouldn’t want her to help the old idiot and her dum-dum, but Azula isn’t a mindless servant. I’m not. I’m definitely not.\n\nShe creeps through the doorway and spies only two figures. One slouches in a chair. His breathing patterns suggest he fell asleep or meditates. Knowing him, the latter. The other lies in a bed with a bandage covering the entire left side of his face. Will Zuzu be half-blind?\n\n“Have you come to gloat, my niece?” Uncle raises his head from his meditation. Azula forces herself not to shake her head. Why does everyone always assume the worst about me? Oh, right. I’m a monster. I always lie. Thanks for nothing, Mother. Thanks for never bothering to love me.\n\nInstead of arguing, she hands her uncle the bag of coins without a word.\n\n“What is this?” He squints, trying to read the symbols without adequate lighting.\n\nShe shrugs. “Since you probably wasted all your funds of tea, here’s something to ensure you don’t kill my brother immediately.”\n\n“Why are you doing this?”\n\n“Despite popular opinion, I find breathing brothers as more useful than dead ones.” She glances at Zuzu. “I may not see him for a long time. Tell him he better be able to bend at least pathetically bad instead of horrifically bad.”\n\nAzula takes one more look at her brother and memorizes the sight. She sears it into her memory. Will she even recognize him next time they meet? Probably not. He won’t recognize her either. She will be wearing the regalia of Fire Lord as she welcomes back her brother from exile. Then, he will thank her for rescinding his banishment and pay respects to their recently deceased father.\n\nShe walks back to her bedroom and falls into her bed. When sleep overtakes her moments later, a small smile graces her lips.", "action_results": [{"action": "12", "result": "Azula didn’t bother to waive goodbye as the ship sailed away. Ty Lee would’ve been crying, but the airhead joined the circus. That’s… that’s for runaways and inconsequential people. Ty Lee could’ve been so much more if she stayed. Instead, her talents will be used to entertain the peasants of the Earth Kingdom and Fire Nation like some uninteresting vagabond.\n\nThe princess clenches her fists. Of course, Father would “gift” Mai’s parents with the governorship of a colony. Her parents jumped at the opportunity and were gone by the end of the week. She wonders if Mai stands on the stern and stares back. The distance is already too great. She can’t see her anymore.\n\nI don’t feel lonely. I don’t FEEL.\n\nShe sits in a palanquin. No princess could dream about walking like a normal human being… or a warrior. On either side, she and her bearers are flanked by her royal guards. The citizens back away from the procession as Azula peeks outside. Children stop playing. Mothers gather their toddlers close by. Men step between their families and her.\n\nOnly the footsteps of her procession break the silence.\n\nIt’s not that she misses Ty Lee’s eternally positive attitude or Mai’s steadfast dedication. She doesn’t miss bickering with Zuzu and annoying him in the most childish manners. She doesn’t long for her sparring matches against her two friends nor plotting various ways to take the throne from Zuzu without killing him. She doesn’t miss Mother. Not at all.\n\nAfter arriving at the palace, she rushes to the training grounds. Everything burns that can be. The grass, the targets, anything. She throws fire at it all. I am not lonely. She focuses on a metal pole. With a continuous whirlwind of blue flame, she watches the gray metal become red with heat. I am not lonely! The pole tilts to the left as the heat destroys the foundation. I FEEL NOTHING!\n\nThe blue flame in her hands become something else entirely. It’s still blue, but it cackles and arches. Surprised, she stops bending.\n\nHer insides feel as though they were torn apart and sewn back together. That was power. That was… Recalling what she read in ancient, royal’s only scrolls, she swings her arms in a circular motion and embraces the feeling of… Nothingness.\n\nElectricity dances around her fingertips as Azula’s mind and body tremble from the power. She points at the pole. The lightning soars through the air and strike the pole. A roll of thunder follows in its wake.\n\nFeeling exhausted, Azula sits down on the scorched grass. She holds the position for a moment before lying down. The sun beams down on her, and it seems to be warming her. I feel so cold, so empty.\n\nShe doesn’t know how long she lies there. Minutes? Hours? Either way, it ends when a figure steps between her and the sun.\n\n“Azula, get up.”\n\n“Yes, Father.” She stands though her legs wobble.\n\n“You generated lightning.” He doesn’t sound impressed. “It is time for you to improve. You’d die on the battlefield because this helplessness.”\n\nShe represses a wince. “Yes, Father.”\n\nUp until today, a Crown Prince over three hundred years ago was the youngest to generate lightning. He was twenty. Azula is twelve.\n\nAt least Zuzu would’ve been impressed. She readies into her combat forms, ignoring the pain and her headache. It’s too bad perfection won’t allow for praise or rest. Such is the life of a future Fire Lord. All she needs to do is try harder, think cannier, and never show weakness. Then, I will get Father’s approval forever.", "action_results": [{"action": "13", "result": "Azula feels sore in so many places. She never thought she could feel such aching pain everywhere. She wraps herself with a robe as she steps out from the tub. I don’t feel dirty. It’s just because I’m sore. Today was the most taxing training session she had with Father yet. It was alone, secluded. Not even the guards could witness what he decided to teach her today.\n\nHe called it a birthday present. It’s the first present he ever gave her. Other nobles gave her gifts, trinkets and jewelry. They’re piled in the corner of her room, all but a few unopened. None were as amazing as Zuzu’s knife. Uncle gave her a doll, but she always was fascinated by the craftmanship of the barbarian’s weapon.\n\nHe said I’m a woman now.\n\nShe stares in the mirror. It’s not something she would do often. Her servants prettied her as fitting for a princess. Rubbing her hand down her pristine jawline, she wonders if this is why men… look at her differently now. All of them do. ALL.\n\nWould Uncle give me a stare like them? Tales of his… exploits and even more numerous attempted exploits still echo in the palace halls even two years after his departure with Zuzu. Zuzu… You’d just see your sister, wouldn’t you? I could’ve used one male underling I could count on. You’d do stupid things act like a blubbering savage, but you were an honest dum-dum.\n\nShe focuses back on the mirror.\n\nStumbling backwards, she shoots flames at HER out of pure reflex. She shouldn’t be here! There’s no screaming. Azula hit her target. There’s no smell of burnt flesh of melodic cries of pain.\n\nShe looks at her target… and laughs. Except in the fake, mocking laugh she uses for manipulation, she hasn’t laughed in months.\n\nThe princess looks around and listens. No one noticed this. Her bedroom and washroom doors are closed. She stands and walks to the mirror. Scorch marks cover the once pristine surface. She raises her hand and touches the figure on the other side of the reflection.\n\n“I look like Mother.” Her voice trembles, a clear sign of weakness. Father can’t hear her, so he won’t be disappointing. Right now, she is weak.\n\nThe jawline, the curve of her forehead, her lips. They’re the same as Mother’s. The realization hits her harder than any pain she receives during training. She has her nose, her eyebrows, her hair. Everything is the same.\n\n“How could you?” She imagines Mother standing in place of her reflection. Azula’s voice turn venomous. “You gave me your… beauty. You must’ve known I looked like you in your youth. Could you not love yourself?” She slams her fist against the glass. It shakes but doesn’t break. “I am from you! You carried me, birthed me, and were supposed to love me. I am Azula. I am the perfect prodigy. You threw away your life to protect Zuzu but couldn’t bother even a moment to… to do anything for me?”\n\nAzula clenches her fists. If not, fire would burn the walls. “Father loves me! He sees I’m worth training. Zuzu loves me because he’s Zuzu. Everyone else fears me, respects me. You couldn’t even show fear? Why was it just disapproval? I tried everything. I saved your son, twice now!”\n\nHer voice becomes strained. “Should I conquer Ba Sing Se and become a hero? Should I become a better bender? What can I DO? Tell me, and I’ll do it. I can do anything.”\n\nShe hears silence.", "action_results": [{"action": "Run Away", "result": "Azula flees from her mother. She runs through the halls with all her might. Every step acts as more distance between her and Mother. People yell at her to stop running, but she pays them no heed. Don’t they know Mother hates her? Now, she won’t have to see that woman any longer.\n\n“Mother!” Azula throws a blast of fire at another mirror. She turns and sees another and another. Spinning in a circle, she sees Mother everywhere. A small portion of her brain screams at her that she sees only her reflection. She only stepped into a changing room. That part of her brain gets crushed by bestial fear.\n\nI must escape Mother!\n\nSeeing one avenue of retreat, she blows out a window’s glass with her blue fire. She leaps through the hole. For a moment, she flies free of her Mother’s presence. Then, she falls, since she was high up in the palace.\n\nBlue had always been Azula’s color. It made her special, different from the reds and yellows of everyone else. She would’ve laughed at the irony of her death. She died in a pile of red, her blood. No matter how special she was, she still bled red just like everyone else.", "action_results": []}, {"action": "Burn the Mirror", "result": "To reply, she unclenches her fists. Fire burns the mirror until the blackness overtakes any ability to reflect. She stands in front of the mirror one more time before leaving. Now, it shows only darkness.\n\n“I will become Fire Lord, but that won’t make you love me either, will it? You killed my grandfather. You’d kill me too if it protected Zuzu. Well, I’ll do that for you. I’ll take your job when I become Fire Lord. I already took your looks. Zuzu will never be in danger again. Then, you will love me because you love Zuzu.”\n\nShe leaves her washroom for a restless night of sleep. In the morning, she finds out her father will train her privately from now on. At least he loves her, right?\n\nAzula avoids mirrors from then on.", "action_results": [{"action": "14", "result": "Zuzu attacked her for the third time.\n\nLooking back on it, she should’ve seen his betrayals coming. The first time Father told her to capture them. Of course, she would’ve ensured her brother’s safety, even from Father. They got away due to the idiots that other people call royal guards.\n\nThe second time, he fought her when she was about to capture the Avatar. Maybe he wanted to be the one to do it. Taking that stupid, bald child to the Fire Nation does happened to be the only thing that allows him to come home. Until I become Fire Lord. It was a hard battle, especially after the Avatar’s waterbending teacher, his earthbending teacher, and some idiot with a boomerang all showed up too. Also, Uncle got his fat butt to the battle. Since everyone seemed intent on killing the horrible, evil monster, she blasted Uncle in the chest with fire and ran.\n\nZuzu’s change in attitude must be because of Uncle. He must’ve poisoned his mind against me just like Mother did. Uncle and Mother must’ve conspired against me. They want to take my only nice family way from me. Plus, Uncle must’ve never mentioned how she was the one who got him out of the Fire Nation when no one else could or would. Huh, he also never learned I was the one who made Mother save his life too.\n\nThere was no way Zuzu would run into her again, not until the war was over. Azula focused on beating the Avatar. Along the way, she happened to conquer Ba Sing Se. Well, she’s about to, since this’s where the Avatar has been around for weeks. Instead of the old men’s tactics of bloodshed, she used infiltration and manipulation. Using the uniforms of an all-female squad of soldiers they captured, Azula and her friends infiltrated the city. I always knew taking Mai and Ty Lee with me would be worth it. Plus, Mai was bored, and Ty Lee realty needed to get away from that circus.\n\nEverything was easy after that. Ba Sing Se is a police-state. She took over the police, recently undermined from the Avatar’s meddling. The police seemed to believe the enemy of my enemy is my friend. Gullible idiots. She took over the police, so it’s just a matter of waiting for the right moment before taking the city. Not a drop of blood will be spilt. She’ll be done under a week.\n\nThe Earth Kingdom will fall. That isn’t what excites Azula. Instead, it was that waterbender’s news. While the Avatar and his other friends left for… somewhere like a bunch of morons, that girl instead stayed behind and visited a tea shop. She came running back to the palace yelling moments before their coup.\n\n“The Fire Nation has infiltrated the city, I just saw Prince Zuko and his uncle!” she screamed to the first people she saw. Those people happened to be “friends and warriors” who were Azula and her infiltrators. She captured the girl. The waterbender looked to be her age. Perhaps she is a waterbending prodigy, the barbarian version of me? Ty Lee was happy to learn they won’t torture the girl. Azula must scheme ways to get her brother back.\n\nShe came up with a simple plan. She would give a rousing speech to the traitorous police. Why are they called Dai Li anyway? All she then had to do was organize a simultaneous coup where all five Earth Kingdom generals were captured, use the police to break down the wall with earthbending, and request Zuzu and Uncle’s presence for some believable reason. To anyone but Azula, this would be too difficult, but she’s the perfect princess of the Fire Nation. She couldn’t… can’t fail.\n\nShe couldn’t stop laughing when she learned what her brother and uncle were up to. They were small business owners. They owned a tea shop! The “great” general Iroh and the prince of the Fire Nation were serving tea to the snobbish high-born barbarians of the Earth Kingdom. In that case, she sent them a letter claiming the Earth King, who was nothing but the police’s moronic and unsuspecting puppet, wanted them to serve tea just before sundown. Zuzu is more gullible than a toddler and Uncle would be glad to have such a “powerful” person request his tea.\n\nAll she then had to do was wait. She’d convince her brother to join her, the city will fall, and the two of them will wait for the Avatar to return. He doesn’t seem like the kind of boy who’d leave behind a member of his entourage.\n\nThat’s when things went wrong. If someone surrounded Azula with the police force and started talking to her, she’d stall and see what they want. Zuzu and Uncle ran before her brother’s honor got in the way. He stopped an challenged her to an Agni Kai. Since she didn’t feel like burning and embarrassing him, she told her Dai Li to capture him. They placed him with the waterbender in an underground cave. An odd place for a prison cell, but these people are barbarians.\n\nNow, she waits for the Avatar. She can reason with Zuzu once he calms down. Who knows? Maybe he and the waterbender could get to know each other. No Fire Lord could ever have a waterbender as a wife or concubine, and that’d guarantee Azula’s status as the next Fire Lord. Father will be so proud.\n\nThey do the coup. Everyone gets captured as planned. The leader of the police tries to double-cross her, but the police have more sense than their leader. Would execution or life imprisonment be better? She smiles. Maybe I could let the peasants of this city decide. I get rid of him and gain loyalty.\n\nOh, the earthbending teacher and the boomerang idiot also showed up during the coup. They’re in a cell with the Earth King now.\n\nThat means only Iroh and the Avatar are unaccounted for. Azula sighs. Knowing Uncle’s lack of patriotism these days and the Avatar’s boyish gullibility, I’d suspect they’re looking for Zuzu and that waterbender together.\n\nShe and her police head down to the underground prison. She left Ty Lee and Mai behind. Things could get ugly, so she wanted only expendable minions this time.\n\nShe sees all four of them. They aren’t fighting. They’re just… talking. Why isn’t Zuzu fighting the Avatar?", "action_results": [{"action": "Zuzu Betrayed Her", "result": "He… he must’ve betrayed the Fire Nation. He gave up on his quest to capture the Avatar, and now he joined forces with the boy.\n\nZuzu betrayed me!\n\nShe should tell the police to ambush the four, but rage clouds her judgement. She swoops down and fires lightning at the four. Uncle takes the blast and redirects it back to her police.\n\n“Azula!” Instead of fighting, her brother grabs both the Avatar and the waterbender and drags them away. Uncle fires blast after blast at her. She stays on the offensive, but firebending power runs in the family. Well, Zuzu is the exception.\n\nSeeing the three run away, she fires another blast of lightning at them. I might not be able to give much more. Zuzu doesn’t see it in time. You fool! You weren’t supposed to get hit! The Avatar does notice the cold, electric flame. He pushes her brother out of the way. Thunder erupts as the boy’s body falls limp. The waterbender screams in anguish. Zuzu stands there like a dum-dum.\n\n“Go!” Azula is forced to put all her attention on Uncle. He fights with a renowned fury. “I’ll hold them off! Get the Avatar out of here. Be safe, my nephew!”\n\nZuzu nods with tears in his eyes. He slings the boy over his shoulder and drags off the waterbender with his other. Bye Zuzu. Uncle fights only long enough to hold off Azula and the police. Of course, the police only regathered themselves at the end of the battle, unable to regain their nerve after a few were fried when Uncle redirected lighting at them. Wimps.\n\nHe holds up his hands. “I surrender.”\n\nAzula strides up to Uncle with blue flames in her hand. The police earthbend the terrain around the aging man until only his face can be seen. She raises her hand to burn off the enemy’s face but stops herself for a moment.\n\n“Why, Uncle? Why did you make Zuzu join the Avatar?”\n\n“I did no such thing.”\n\nShe moves her hand closer but not close enough to hurt him. “Zuzu loved me, but now he joined the Fire Nation’s enemy. That doesn’t happen without manipulation.”\n\nHe shakes his head, but his head doesn’t move much in his earthen encasing. “You did that Azula. Your brother was tired of chasing the Avatar, but not one part of his heart wished to join them. You were the one who did that. You forced him to.”\n\nAzula turns her face away from Uncle to hide her cringe. Stupid! How could I be so stupid?\n\n“Take him away. I don’t want to see his face again,” she says to the police. They nod wordlessly. She walks away, eager to leave this cavern of sorrows.\n\n“Azula.” She pauses. “You said Zuko loved you. That is not entirely true, since I’m sure he still loves you.”\n\nShe breaks into a run.", "action_results": [{"action": "15", "result": "“Zuzu.”\n\nAfter everything that happened to her in those fifteen years, it all comes down to this moment.\n\nThere he stands. Behind him, there’s the waterbending girl. The Avatar didn’t die. He attacked the capital during an eclipse. They couldn’t bend. Only a dishonorable enemy would do that, but the Fire Nation repelled their attack.\n\nWhy! Why does Zuzu fight with the Avatar? He betrayed her! She wanted him to come home, but he sided with the Fire Nation’s greatest enemy. Why? She knows why. MOTHER. It’s her fault! It’s not Azula’s fault. Mother was the one who poisoned his mind ever since his birth. After she had to leave, Uncle continued. They turned Zuzu away. He even became the Avatar’s firebending teacher! WHY!\n\nThen, Mai betrayed her. She did it so Zuzu could’ve escaped. He was in her clutches! Azula was going to subdue her, then Ty Lee attacked her. WHY! It doesn’t make sense. It doesn’t compute. The world… the world doesn’t work this way. She’s Azula. She doesn’t fail.\n\nThen, Father left her behind to kill a bunch of Earth Kingdom civilians. He didn’t see her as useful anymore. Why would? Everyone betrays her, so he discarded her like a used concubine. Why must everyone betray her!\n\nShe knows why. Mother was right. This entire time, she was right. I’m a monster. It simply took Zuzu longer to realize it.\n\n“Sorry, but you're not gonna become Fire Lord today.” He lights his hands on fire. “I am. I challenge you to an Agni Kai. You tried to kill me too many times already. Let’s settle everything right here, right now.”\n\n“I accept.”\n\nFor the first time in her life, she tries to truly injure her brother. She tried to hurt him countless times, but never did she want to cause so much damage. He fights backs using forms she never saw before, but the girl hardly recognizes anything. She focuses on trying to burn him, hurt him.\n\nWhy can't it all be better, when we were young? It was nice then. He didn’t think I was a monster.\n\nShe did so much for him. He said she was his sister. LIER! He knows she’s a monster. Monsters don’t have brothers. Monsters don’t have joy. They don’t have friends or happy ending. Monsters have pain, and they give pain. That’s it.\n\nWhy is everything on fire? Oh, I forgot. Today is Sozin’s Comet! That’s why Daddy’s killing people and babies. Last time this came, my great-grandfather killed every airbender except the Avatar. Daddy’s just gonna use this to kill more people! Why’d I forget that?\n\nSome part of her mind tells her something inside is wrong. She’s breaking, slipping. She ignores that voice.\n\nTheir flames are more like tornadoes. The palace, the courtyard, everything. There’s fire everywhere. It’s so hot. She uses her flames to propel her. Maneuverability is… good? Tactical. It’s tactical for fights. Daddy says so.\n\nThen, Zuzu throws a really big fireball at her. She keeps it from burning her, but she falls on the ground. That hurt. Zuzu hurt me!\n\n“No lightning today? What's the matter?” He sounds angry. Why is Zuzu angry with me?\n\nTwo little voices in the back of her head tell her not to fire. One says he’s her big brother, and she shouldn’t hurt her big brother. Mommy wouldn’t want that. The other one, one that has been getting quieter and quieter, tells he’s planning something. He wouldn’t taunt her into using her lightning unless he had a good reason.\n\nShe ignores both. She tries to clear all feelings, but she can’t. The lightning comes anyway, not because she’s amazing or perfect. She isn’t amazing; she isn’t perfect. The comet merely provides her with enough power. The lightning seems to be burning through her body, her mind, and her soul. Pain. So much pain.\n\nThen, she sees the waterbender. She’s close enough to be in the courtyard. Agni Kai’s are for two fighters, but that girl stepped into the courtyard. It’s a technicality but a victory. Azula won by default because Zuzu had an ally step into the dueling grounds.\n\nI still want to hurt Zuzu.\n\nShe fires at her brother. He outstretches his hand as the lightning sink into his palm. He should be dead, an instantaneous death. Instead, the lightning seems to move through him for a moment. He raises his other hand and the lightning comes back out. Uncle taught him how to redirect lightning.\n\nA great heat bites at her feet. An explosion rips through her ears before silence deafens her. For a moment, she feels wind blowing past her. No, she blows past the wind. The lightning hits the ground, and it launched her across the battlefield. She hits the stone ground with a crash. Her chest tightens. She doesn’t get up. She can’t get up. Instead, the girl spasms on the ground.\n\n“Azula!”\n\nHer vision darkens, but she sees her brother run towards her.\n\n“Zuko, what are you doing?” It’s that waterbender. She looks unhappy, unlike Zuzu. He looks scared.\n\n“She isn’t getting up!” He kneels beside her, but she doesn’t stop him. She can’t. I don’t have a heartbeat, do I? He presses his hand on her chest for a moment. “No heartbeat! Azula will die!”\n\nWasn’t that the point of this fight, dum-dum?\n\nHe cries and holds her hand. What a baby. “Katara! Can you save her?”\n\n“No, I can’t restart a heart. Maybe shock her again?” But Zuzu can’t do lightning. He’d need perfect emotional control. Ha! As if. “What’s the point though? This’s Azula.” Azula the monster.\n\nHe shakes his head and stands. “I’m saving her because she’s Azula.”\n\nAs her vision fades, she sees him waive his arms in circular motions. My big brother is trying to bend lightning as he’s crying? If she wasn’t dying, she’d be laughing at his stupidity. The dum-dum can’t generate lightning when he’s crying. Right now, he’s anything but emotionally stable.\n\nAzula’s body convulses again from the shock. The tension from her chest goes away and her vision returns. The first thing she sees is Zuzu with the last traces of electricity fading away from his fingertips. He bent lightning for me?\n\nHe picks her up in his arms. “Katara, she needs healing. I know where there’s water.” Oh, she’s a waterbender and a waterhealer. He runs and takes deep breathes.\n\nHer body lies limp in his arms. Everything tingles and aches. Using all her fleeting strength, she asks a single question. “Why?”\n\n“You’re my sister.”\n\nNo, I’m an evil, scary monster. Even as a child, I was unlovable. Not even Mother could love me.\n\n“It’s gonna be alright, Azula. I promise.”", "action_results": [{"action": "All Monsters Must Be Caged", "result": "Azula doesn’t move. They say she acted bad today, so they put the straightjacket on her again. It’s also dark. Her cell doesn’t have a window. The sun means fire. Fire means power. They want her weak, like a chained animal. It makes her scared.\n\n“It’s alright. I’m here for you.”\n\nNo! No! Get away from me! You… You aren’t real!\n\nHer mother bends down, so they look eye to eye. “I will always love you, Azula.”\n\n“Shut up!”\n\nFor the first week or so, the guards would’ve responded to that. They would’ve asked the little princess why she told them to be quiet even though they hadn’t said a thing. Now, they ignore her words.\n\n“Azula, I will always love you.”\n\nShe lets out fire from her mouth like a dragon from older times. It scorches the opposite side of the cell, but it doesn’t change color. Ever part of the floor, walls, and ceiling are already a charred black.\n\nAzula tries to get up, but she loses her footing and tumbles to the ground. Her head smacks against the cold stone. Her head rings.\n\nShe cries. It’s just not fair. Everything is so scary. Part of her mind is… broken. She knows that. Maybe all of it. They try so many things. Some of them don’t do anything. Other hurt. Nothing works. The doctors fear her. She burnt one of them just once, and now they’re almost as scared as the princess.\n\n“Azula.”\n\nTHAT isn’t Mother. She looks up, bleary from hitting her head so hard. She sees one person, but this time it isn’t Mother.\n\n“Zuzu?”\n\nHe smiles. “Yeah. Can I trust you for a moment?”\n\nShe sniffles. “No, I’m a monster.” She closes her eyes.\n\nHe lifts her onto her bed and set her down. Not once did he grunt, nor did she feel his arms strain. The entire time, he continued to smile. Then, her brother loosens the straightjacket and takes it off her. She shivers from bad memories, but Zuzu isn’t Father.\n\n“Better?” He takes out a small cloth and wipes the blood on her forehead.\n\n“Why are you here?”\n\n“I visit every Tuesday, remember?”\n\n“Oh…” She notices the crown on his head. “Are you Fire Lord?”\n\nHe nods. “I have been for over a year now, remember?”\n\nShe scrunches her eyebrows together before shaking her head. “Are you a good one?”\n\n“I’m trying to be.”\n\nHe sits down next to her. She looks at the ground, not knowing what to do. I never know what to do anymore.\n\nShe whispers, “I still see her everywhere, Zuzu.” If she spoke too loudly, maybe Mother would hear it and haunt her again.\n\n“Did you know I have ghosts too?”\n\nShe perks up. “Really?” She rests her chin on his shoulder.\n\n“Yeah.”\n\nHe touches his scar. It’s a nasty looking thing. Why did Father hurt Zuzu?\n\n“This is my ghost, Azula. I see it whenever I see myself. It haunted me for three years.”\n\n“But now it doesn’t?”\n\n“No.”\n\n“How? Tell me. Please.”\n\nHe takes her hand in his and places her fingers on his scar. It feels lumpy. It looks like a red splotch, almost like blood on a battlefield.\n\n“I accepted it, made friends with it. This scar is a part of who I am whether I like it or not. Azula, you will always be the daughter of our mother.”\n\nShe frowns. “Then why did she never treat me like her daughter?”\n\nHe pulls her into a hug. “I’m sorry, but I don’t know.”\n\nShe hugs him back.\n\n“But I’ll always be here for you. You’re my sister. I’ll get you through this, and we’ll do it together.”\n\nThey end their embrace. Azula wipes more tears from her eyes. She leans into his shoulder and listens to his breathing. He just sits there, but the sound soothes her.\n\n“Zuzu?”\n\n“Yeah?”\n\nShe closes her eyes in fear. What if he says no? “Can you stay with me for a little longer?”\n\nAzula feels his fingers wrap around hers. “Of course.”", "action_results": []}, {"action": "Everything Will Be Alright", "result": "Azula takes a deep breath before entering the highest floor of the prison. It was specially refurbished for the sole occupant. That person should’ve been me. The Fire Lord decided to place over six dozen guards on this floor alone. They are on constant alert for him trying to break out or anyone trying to break in. I do wonder if the latter would break in to kill him or to free him.\n\nThe guards eye her with suspicion. With one exception, everyone does. And everyone should. I’m a m… I’m me after all. You’re such a dum-dum, Zuzu. Her footsteps click across the floor in the otherwise silent floor. No one dares to speak. Everyone seems on edge. Zuzu really wanted to come with her, but she refused. This is something I must do myself.\n\nAzula stops in front of the cell. She doesn’t smirk. She doesn’t spit on him. She doesn’t laugh at him. He doesn’t deserve that. Instead, she keeps her face as a stone-cold gaze. Nothing more, nothing less.\n\n“Father.” Her tone holds the slightest touch of disgust.\n\n“Azula.” He doesn’t bother looking up.\n\nShe stares at him in silence. He continues to sit on his bed with his eyes transfixed on the floor.\n\n“You disappoint me, daughter.” He looks up. She sees his eyes filled with hate, but they are also the eyes of a broken man. “After all you were, here you are. A broken little girl serving as an imbecile’s lackey. Have you come to see me fallen as well? That way, you can feel better about your utter submission to another man.”\n\nI won’t show anger. I won’t give him that. Plus, Zuzu told me not to kill him, so I can’t do that either.\n\nAzula smirks. “Father.” She pauses to spit on the ground. “You were the leader of the world’s only superpower. You have fleets or war zeppelins and the unlimited power of a comet for a day. What did you do? You lost a battle to the Avatar, a twelve-year-old BOY.” She pauses for dramatic affect. “Then, that kid took away your bending. Now, your son, the one who you banished and said was worthless, reigns as Fire Lord. By Agni, he’s doing a good job with it all too.”\n“Yet here you still are, coming back to Daddy.”\n\nAzula shakes her head. How did this man bind me to his will for so many years? “Yes, here I am. I am free, a royal under my brother’s rule. There was even a non-sentimental reason for it all. Rebels wanted to revolt against Zuzu. As the last real symbol of your empire, it stuck a deep blow against them to know I wholeheartedly pledged myself to the throne and not to you.” She clenches her fists. “Not anymore. I’m free. Zuzu and the Avatar didn’t just free the nations and the land from your shadow, Father. They freed the people, myself included.” She turns around and strides away without saying farewell.\n\n“Azula!” Father calls out. “Azula, come back here!” His rage fills the room. “You cowardly, idiotic monster! Come back to me!”\n\nThe princess doesn’t look back. She shuts the door before curling up in the fetal position. He isn’t watching anymore.\n\n“Would you be proud of me, Mother?” She whispers it to herself. Her mother lives out there, somewhere. One day, they’ll find her, so Azula can finally receive the answer to that question.\n\nShe stands up and straightens her armor. Then, she leaves the jail.\n\nAzula smiles as she basks in the warmth of the sun.", "action_results": []}]}]}, {"action": "Zuzu Must Be Biding his Time", "result": "Zuzu fought the Avatar more than enough times now to know he can’t take that boy alone. Plus, her brother looks like he wants to bite off the Avatar’s head. It’s time to get Zuzu back. She waits until the Avatar and the girl walk away. Perhaps those two are romantically involved? Ew.\n\n“Capture Iroh,” she whispers to the agents.\nThey nod.\n\nAs she comes into their view, Uncle becomes encased in the cave’s rock. The dramatic effect works perfectly.\n\n“I expected this kind of treachery from Uncle, but Zuzu, Prince Zuko, you're a lot of things, but you're not a traitor, are you?” You said you’re my brother. You said you don’t think I’m a monster. Prove it, Zuzu. This’s your chance.\n\n“Release him immediately!” You have a one-minded devotion that’d be wonderful if directed correctly. Just give me that devotion.\n\n“It’s not too late for you. You can still redeem yourself.” The Avatar is walking away from you this moment, dum-dum. Just capture him. Well, I will, but you can have the credit for all I care.\n\nUncle speaks up. Her agents didn’t muzzle the old man. “The kind of redemption she offers is not for you.” For the past three years, what lies have you been weaving in his head? Zuzu, I shouldn’t have let him come with you.\n\n“Why don't you let him decide, Uncle?” Shut up, old man!\n\nShe sighs. Her shoulders slouch. “I need you, Zuko.” THERE. I said it. I missed you. You’re an idiot, but you’re my idiot. “I've plotted every move of this day, this glorious day in Fire Nation history. We can win this together. You will have your honor back. You will have Father's love. You will have everything you want.” I will have what I want. I’d have my family again. My real family, not Mother.\n\n“I am begging you.” Uncle does sound like he’s begging. “Look into your heart and what it is you truly want?” Ug, did you find that line out of a fairy tale? I’m getting your nephew’s life back together out of the kindness of my heart. I could execute him for treason, but I’m offering him exactly what he wanted for the past three years. “You are free to choose.” And that’s the truth, brother.\n\nAzula walks away to confront her two enemies. She knows… she trusts Zuzu will be close behind.\n\nShe lets herself slip into her battle mentality. In some ways, it is like a dance. She moves. The Avatar moves. That waterbender moves. It’s a state of equilibrium through actions and responses. The Avatar has power. The waterbender has rage. Why is she so angry anyway? Azula has perfection.\n\nA blast of fire flies between her opponents and herself. She doesn’t have to turn to know who’s here. She smiles as she gains her dancing partner. It’s great to have you back, brother.\n\nThey work well together, not perfectly. No one can match Azula’s perfection, but their cooperation exceeds all others. Even Mai and Ty Lee can’t compare to her brother. He doesn’t have her power or intelligence, but he has her trust. On a battlefield, trust is more important than anything else for Azula’s allies.\n\nTheir enemies are overwhelmed. The Avatar mostly dodges. For some, it would wear down his attackers, but Azula could do this for hours while Zuzu seems determined enough to press through well past the Avatar’s strength. The waterbender puts up a noble fight, but the girl is a minute away from defeat. Exhaustion will take her.\n\nThe Avatar proceeds to bend then hide inside a dome of rocks and crystal. The waterbender fights out of desperation. Why would he abandon her? The Avatar State… No!\n\nAzula runs to where she’d expect to see the back of the Avatar when he comes out. He’s entering the Avatar State. I could probably survive, but Zuzu… She narrows her eyes. You aren’t going to take Zuzu from me.\n\nShe swirls her hands around and clears any feelings from her mind. Electricity cackles from her fingertips.\n\nThe Avatar rises from his earthen shelter with his eyes glowing white. He’s about to unleash death and destruction on his enemies. Azula points and fires. The lightning strikes his back, and he falls to the ground. The waterbender screams and unleashes a wave of water sweeping up his body.\n\nZuzu and Azula step towards her. Just give us the body, girl.\n\nA blast of fire forces them to jump back. “You've got to get out of here! I'll hold them off as long as I can!” Uncle’s words seem to tear through Zuzu’s heart. The police, Zuzu, and Azula all fight Uncle, but he is one of two firebenders Azula couldn’t easily destroy in combat. The moment the waterbender leaves, the old man stops fighting and holds out his hands in surrender. The police take him away without a word.\n\nAzula takes Zuzu away from the cave. It seems to be killing him on the inside. She leads him to the Earth King’s throne, and not once does he ask her to stop. Azula smiles as she sits on the throne. Zuzu looks broody. It’s time to cheer him up.\n\n“Zuzu, we’ve done it. The war is over. The Avatar is defeated. You can go home, with me.”\n\n“I betrayed Uncle.”\n\nShe stand and walks to him. She pokes him in the chest forcibly. “You. Did. Not. Were you the one to throw fire at him first? Were you the one who wanted to help the Avatar, the very person who’d rip down everting we and our ancestors worked for? Uncle betrayed you. I didn’t. I won’t.”\n\n“But I don’t have the Avatar. What if Father doesn’t accept it? What if he doesn’t restore my honor?”\n\nShe puts her hand on his shoulder. “He doesn’t need to, Zuzu. Today, you restored your own honor.”\n\nShe looks at him for a moment longer. Then, she does something she never did before. She wraps her arms around him and pulls him into a hug.\n\n“Welcome home, Zuzu.”", "action_results": [{"action": "15", "result": "“Zuzu.”\n\nAfter everything that happened to her in those fifteen years, it all comes down to this moment.\n\nThere he stands. Behind him, there’s the waterbending girl. The Avatar didn’t die. He attacked the capital during an eclipse. They couldn’t bend. Only a dishonorable enemy would do that, but the Fire Nation repelled their attack.\n\nWhy! Why did Zuzu chose to leave them? He betrayed her! They were getting along! Even he and Mai were getting all lovey-dovey. Ew. He left. Why? She knows why. MOTHER. It’s her fault! She was the one who poisoned his mind ever since his birth. After she had to leave, Uncle continued. They turned Zuzu away. He even became the Avatar’s firebending teacher! WHY!\n\nThen, Mai betrayed her. She did it so Zuzu could’ve escaped. He was in her clutches! Azula was going to subdue her, then Ty Lee attacked her. WHY! It doesn’t make sense. It doesn’t compute. The world… the world doesn’t work this way. She’s Azula. She doesn’t fail.\n\nThen, Father left her behind to kill a bunch of Earth Kingdom civilians. He didn’t see her as useful anymore. Why would? Everyone betrays her, so he discarded her like a used concubine. Why must everyone betray her!\n\nShe knows why. Mother was right. This entire time, she was right. I’m a monster. It simply took Zuzu longer to realize it.\n\n“Sorry, but you're not gonna become Fire Lord today.” He lights his hands on fire. “I am. I challenge you to an Agni Kai.”\n\n“I accept.”\n\nFor the first time in her life, she tries to injure her brother. He fights backs using forms she never saw before, but the girl hardly recognizes anything. She focuses on trying to burn him, hurt him.\n\nWhy can't it all be better, when we were young? It was nice then. He didn’t think I was a monster.\n\nShe did so much for him. He said she was his sister. LIER! He knows she’s a monster. Monsters don’t have brothers. Monsters don’t have joy. They don’t have friends or happy ending. Monsters have pain, and they give pain. That’s it.\n\nWhy is everything on fire? Oh, I forgot. Today is Sozin’s Comet! That’s why Daddy’s killing people and babies. Last time this came, my great-grandfather killed every airbender except the Avatar. Daddy’s just gonna use this to kill more people! Why’d I forget that?\n\nSome part of her mind tells her something inside is wrong. She’s breaking, slipping. She ignores that voice.\n\nTheir flames are more like tornadoes. The palace, the courtyard, everything. There’s fire everywhere. It’s so hot. She uses her flames to propel her. Maneuverability is… good? Tactical. It’s tactical for fights. Daddy says so.\n\nThen, Zuzu throws a really big fireball at her. She keeps it from burning her, but she falls on the ground. That hurt. Zuzu hurt me!\n\n“No lightning today? What's the matter? Afraid I'll redirect it?” He sounds angry. Why is Zuzu angry with me?\n\nTwo little voices in the back of her head tell her not to fire. One says he’s her big brother, and she shouldn’t hurt her big brother. Mommy wouldn’t want that. The other one, one that has been getting quieter and quieter, tells her there’d be no tactical advantage. Her brother can redirect lightning, so he’d fire it back at her.\n\nShe ignores both. She tries to clear all feelings, but she can’t. The lightning comes anyway, not because she’s amazing or perfect. She isn’t amazing; she isn’t perfect. The comet merely provides her with enough power. The lightning seems to be burning through her body, her mind, and her soul. Pain. So much pain.\n\nThen, she sees the waterbender. She’s close enough to be in the courtyard. Agni Kai’s are for two fighters, but that girl stepped into the courtyard. It’s a technicality but a victory. Azula won by default because Zuzu had an ally step into the dueling grounds.\n\nI don’t want to hurt Zuzu now.\n\nShe fires at the girl instead.\n\n“No!” Zuzu dives in front of the lightning bolt. He must’ve realized she was firing at his friend. No fair. He gets all the friends.\n\nThe lightning hits him in the chest. He redirects some of it, but not all. He convulses on the floor dying before her eyes. It’s just like that moment four years ago when Daddy burnt off part of Zuzu’s face.\n\nI killed Zuzu! I KILLED ZUZU! I’m a monster! I killed him!\n\nWitch! Water witch! You tricked me into killing Zuzu!\n\nShe chases the girl. She throws fire. She says… things. She doesn’t know what the words are, only her mouth moves and sound comes out. Nothing else matters. The waterbender must die because Zuzu will die.\n\nI’m so sorry, Zuzu! Mommy was right. I’m a monster, and I killed you!\n\nThe enemy hides behind pillars and slides on her ramps of ice. Azula chases. She won’t fail. The girl stops moving under a covered walkway. Every tactical part of Azula’s mind tells her to stop. That girl must be planning something. She doesn’t listen. Zuzu needs to be avenged.\n\n“There you are, filthy peasant!” She raises her hand to burn off the witch’s pretty face. Then, everything becomes ice cold. She can’t move.\n\nLooking down, she sees the water below them, a small canal running under their feet. They’re standing on a grated covering. The waterbender lifted the water up and froze it.\n\nThe witch melts the water around herself. She takes a chain and wraps it around Azula’s hands. Then, she ties it to the floor. She chained her like a wild animal, like a monster. She melts all the ice. Azula drops to the floor.\n\nShe’s alone. Zuzu’s dead. Father doesn’t love her. She doesn’t have any friends.\n\nAzula breathes out fire trying to burn everything like the monster she is. She tugs at the chains to free herself. It won’t budge. She falls on her back. Her head smack against the stone floor, but it doesn’t matter. No one loves her. I killed Zuzu.\n\nShe cries. She wails like a little girl. Mommy! Mommy! Come back! Save Zuzu! You love him, so save him. Give… Give him a kiss! That would make it feel all better. Mommy, please. Save Zuzu from me.\n\nThrough her tears, she sees two figures standing, staring at her. Zuzu? She blinks a few times. The figures come into focus.\n\n“Zuzu!” she screams. “You’re all better!”\n\nThe wound on his chest is gone! Why hasn’t her tears stopped?\n\n“Stay away from me, Zuzu! Stay away! Mommy was right. I’ll hurt you again. I’m a monster!”", "action_results": [{"action": "Never Hurt Zuzu Again", "result": "Azula sits in the dark room. It’s scary. I’m old. I’m not supposed to fear the dark. It scares her anyway. She could light a candle or open the curtains, but the fire scares her too. What if she knocked over the candle and burnt something? What if she couldn’t stop the fire from her hands?\n\nShe hears muffled voices growing louder as they walk by. Then, the voices drift father and father away. Some fear her. Others pity her. Azula just wants to be their friends. The doctors said she got better. What was it that was wrong with me? She clutches her head. Sometimes, bright lights or sharp noises hurt her head so much. It makes her want to cry, but she won’t cry. Not anymore. She’s a big girl now, and Mother never cried.\n\nOne day, she’s going to be helpful. Zuzu has been the best older brother ever. Every week, he visited her in her special room. No one else did that. Mai saw her a few times. Ty Lee would do it most weeks. Zuzu never missed her once. It makes her feel happy. He forgave her, so she wants to help him. She wants to be a good little sister.\n\nShe remembers things about the courts. The doctors said she kept her cunning mind. Maybe Zuzu could use her as an advisor? He is such a good Fire Lord. All the kingdoms like him too because he’s nice to them. For a hundred years, the Fire Nation attacked the other countries. Zuzu stopped it because he didn’t want anyone else hurt.\n\nAzula nods. Zuzu is smart, so that is a good idea. Not hurting people is good. She killed only one man in the last month after all. Just one! It made her cry, but no one can know that. She must be a big girl. He wanted to hurt Zuzu when her dum-dum was visiting her. Azula knows Mother would’ve protected Zuzu, so she blasted him apart with lighting. It was so scary. She didn’t know she could still do that, but Zuzu said she shouldn’t do it for fun. Like fire, lightning hurts people if she isn’t careful, but that man wanted to kill Zuzu. She will hurt anyone who wants to hurt him.\n\nNow, Azula decided she’ll be the most careful bender ever. She doesn’t want to hurt anyone, even the bad people. Still, Zuzu can never be hurt. She will do anything for him.\n\nThe door opens.\n\nAzula smiles. “Zuzu! I missed you!”\n\nHe smiles back to her. He wears the robes of the Fire Lord and the crown too. It makes him look so strong. “You can see me any time. I told you exploring is fine if you stay with the guards.”\n\n“But…” She points outside. “What if a bad man tries to hurt me or if I lose control? I don’t want to hurt anyone. Never again, but I know I will if he wants to hurt you. If I stay in here, then even the bad men are safe from me.”\n\nHe extends his hand. “Wanna take a walk? Just me and you.”\n\n“Sure!”\n\nShe wraps her arm around his elbow. Together, they leave her room and walk through the palace. She waives at the people even if they look afraid. Zuzu said being nice to people is good, so she will be nice to them. She remembers all these halls. She ran down them when she was a little girl and went exploring.\n\nHe leads her to a little courtyard with a pretty pond. She stops as her mouth hangs open. She points at the pond and giggles. “Look,” she whispers. “Turtle-ducks. They’re babies.”\n\nShe tugs at him arm as she pulls him next to the water. The babies quack and swim around their mother. Azula sits down and watches the happy family. Zuzu sits next to her.\n\n“We’re still looking for her.”\n\nAzula’s shoulders slouch. “Will Mother like me?”\n\n“Yes.” He holds her hand. “You’re a nice person, and you’re getting better every day. You’re using Mother instead of Mommy. Soon, you’ll be your devious self again. I’m sure.”\n\n“I am better.”\n\n“Azula, we both know you’re… a little too young still.”\n\n“I’m sorry.”\n\n“Don’t be.”\n\nThe princess sees his smile and knows he isn’t unhappy with her. She leans on his shoulder and watches the babies swim. Two footsteps walk to her. She turns, ready to protect Zuzu. Oh, it’s Mai!\n\n“Hi!” She waives.\n\nMai nods, but her attention is on the bundle of clothes in her arm. She looks so tired. They say giving birth is the hardest thing ever.\n\n“Is that…” She points at the bundle.\n\nZuzu nods. “Yeah, that’s our Izumi.”\n\nAzula stands up and tip-toes to Mai and her niece. She looks at the newborn’s face. It’s so… squishy. “Hi,” she whispers. “You’re going to be so happy. Zuzu might look grumpy, but he’s super nice. Mai might look irked and bored, but I know she will always love you. Oh, I’m your aunt, but I want to be your friend.”\n\nMai raises her eyebrow. “Will you drop the baby?”\n\n“No.”\n\nCarefully, Mai places the baby in her arms. Azula acts careful, super careful. She cradles the baby in her arms. She’s holding a part of Zuzu, a new and living person.\n\n“I never thought I’d have more of a family, then Mai became my sister. Now, you became my niece. I thought babies were icky and annoying, but you’re nice.”\n\nShe sits back down by the turtle-duck pond. The baby sleeps soundly in her arms. “One day, I’ll show you this pond and tell you about turtle-ducks. Did you know they have a mom too? Mommy turtle-ducks will do anything for her babies just like your mommy. It took me a long time to learn that about my mother. I hope you’ll be smarter than me.”\n\nThe baby wakes up and grumbles like Zuzu would on a bad day. Mai takes the baby from her arms, but she doesn’t look angry. Instead, she walks away with the child.\n\nZuko sighs. “I won’t ever give up on you, Azula.”\n\nShe blinks. “Zu… Zuko?”\n\n“Yeah?” His voice turns serious.\n\nShe keeps perfect eye contact.\n\n“I’m thankful for everything you’ve done. I was a burnout. I gave everything to… Father.” She spits out his undeserving title. “You’re putting me back together, not because I’m a tool. You’re doing it because I’m your sister.”\n\nHe nods.\n\nAzula looks at the sun, the undying fire. She beams as she’s gifted with its warmth.\n\n“Thanks for being my brother, you big dum-dum.”", "action_results": []}, null]}]}]}]}]}]}]}, {"action": "Save Zuzu", "result": "Azula leaves the crowd behind and walks back to her quarters. Father wants Zuzu dead. There’s no way he could leave our nation by himself or with our tea-guzzling Uncle carrying him out. After she closes the door, she lets out a painful sigh. At least I’ll be able to help him now.\n\nHe needs to get out of her nation and to travel the world. That means he’ll need a boat, and since her brother has no navel experience, he’ll need a small crew. Of course, Father would ensure the crew would have someone who would “accidentally” burn my brother to death during some sparring match. Regardless of his reasons, when the Fire Lord wanted someone dead, that person ended up dead. Right now, that person is her wounded brother.\n\nSince I’d rather not have Father find out about my involvement… Azula waits patiently in her room. Today is Tuesday after all, a single blessing on what may be the worst day of her life.\n\nMai was the first one to arrive, prompt like any well-trained lady. Ty Lee was late as always. Since Mai seemed broody enough to kill someone and Ty Lee wouldn’t stop crying, Azula assumed she didn’t have to explain how her brother won’t be seeing them any time soon.\n\n“Have you finished your crying yet, Ty Lee?” Azula glances at the door. Ever since starting these weekly get-togethers, she convinced the guards not to listen in. All the Royal Guards are still men. The young lady simply ensured her first meeting with her fellow females would’ve made any man very… uncomfortable to overhear. It worked. The simplest plans are often the most effective.\n\n“No.” The girl continues to cry.\n\n“Too bad. We have work to do. Mai, are you even listening?”\n\nThe girl blinks. Her eyes focus on the princess. “Sorry.”\n\nNormally, that lack of respect would’ve angered Azula. She’ll give the girl a free pass this time. Her pre-arranged marriage to Zuzu will be called off by the end of the week. And that one would’ve been an instance where the couple actually liked each other. It would’ve made her sixteenth birthday more interesting to share it with a recently married sister-in-law. Oh well, it could happen anyway. Who knows what’ll happen in five years between now and then? Also, marriage… Ew.\n\n“Mai, your parents have enough political connections. Find as many soldiers as you can who are loyal to Uncle Iroh. I want them with navel experience on a small vessel. About thirty. Be sure to have a good captain, cook, engineer, and several firebenders. Oh, try to have at least a few women in there too. I wouldn’t want a whole bunch of men to carelessly get themselves killed.”\n\nEven Mai couldn’t hide the look of surprise on her face. Ty Lee stopped crying.\n\n“As for you.” She points to her acrobatic friend. “You parents work on the docks with their merchant trading. Find a ship that no one will miss. Be sure it’ll be well-stocked.” She takes a pouch of gold coins and drops in in the girl’s hands. In any situation other than this one, she’d never trust Ty Lee with half that much. “Maybe get some Komodo-Rhinos too. I want both of you done and to report everything back to me before morning. Go!”\n\nWithout a word, they leave her bedroom.\n\nAzula walks to her dresser and pulls out a small chest. Ty Lee always wondered why I horded my allowance away instead of wasting it on momentary pleasures. She looks at the currency. Even if it’s Fire Nation, our colonies would accept it. I think they’d be more lenient with the banishment rules. Maybe he could trade the rest for Earth Kingdom coins.\n\nUntil the sun sets, Azula meditates. She’d explode in frustration if she didn’t. It’s like being in a cage. She has no opportunity to do anything herself. Father can’t ever find out how she’s ensuring her brother’s survival, but relying on others to do that work is hard even if they’re her two most loyal assistants.\n\nTy Lee arrives not long after the sun set. The girl looked exhausted and not a coin was left in the bag. Even in the candlelight, Azula sees a smile on Ty Lee’s face when she hands her a piece of paper.\n\n“They should have enough supplies to last them until next month,” the girl whispers. Her brow scrunches. “That’s the name of the boat, the list of stuff I bought, you know… But, um, why are you doing this?”\n\n“You’d prefer to see my brother dead?”\n\n“No!” She shakes her head faster than what’s healthy for most people. “It’s great and amazing, but you always wanted the throne. Now, you’re the only option left so… Why?”\n\n“The Avatar hasn’t been seen since Avatar Roku died. The next incarnation probably died in the Avatar State during the Air Nomad genocide. Zuzu’s not coming back until I rescind that banishment after I become Fire Lord.” She’ll buy that.\n\n“Okay!” Her shoulders slouch. “I’m tired though and my parents might finally notice I’m missing. If you see him, tell Zuko I wish him good luck. Also, um…”\n\n“Spit it out.”\n\n“I think you’ll make a great Fire Lord.”\n\nTy Lee leaves the room. She was going to say something different. What? It’s Ty Lee, probably something incidental.\n\nThe moon rises in the sky and starts to make its descent when Mai slinks into her bedroom. If Ty Lee was exhausted, then Mai must be moments away from collapsing.\n\n“It took a while. They’ll be looking for Prince Iroh and Zuko at the docks tomorrow morning.” Mai hands her a piece of paper with thirty names on it, in alphabetical order. “Thank Agni my parents never found out what I was doing.”\n“Get some sleep.”\n\nMai turns around, but Azula takes her by the wrist.\n\n“Use my bed.”\n\n“But-”\n\n“I won’t be sleeping tonight. Tell your parents you spent all night ensuring you had the favor of the future Fire Lord.”\n\nShe raises an eyebrow. “I was ensuring your favor.”\n\n“Precisely.”\n\n“Thanks for doing all of this, Azula. Was… was the Agni Kai as bad as I heard?”\n\n“Probably.”\n\nAzula picks up the bag of coins, small enough to be hidden from the guard but large enough to fund Zuzu’s expedition for a while. She leaves Mai behind.\n\nShe takes the back passageways of the palace to the infirmary. It wasn’t hard to find Zuzu. He’s the only one in there.\n\nAzula approaches him. The room has only one lamp as a dim light, but she sees the bandages wrapping the left side of his face. I wonder if he’ll be blind in that eye. He sleeps, though it looks anything but restless.\n\n“Have you come to gloat, my niece?” Uncle slouches in a chair opposite of the bed. Azula forces herself not to shake her head. I should’ve realized he was the reason Ty Lee purchased so much tea in the supplies. He could’ve acquired all this himself, but someone had to watch over Zuzu. Maybe I should’ve told Mai to do that. Then, Uncle could’ve gone through this hassle himself.\n\nInstead of arguing, she hands her uncle the bag of coins and her two lists. “Here.”\n\n“What is this?” He squints, trying to read the symbols without adequate lighting.\n\nShe shrugs. “There’s a small ship, some of your former soldiers with seafaring experience, supplies, and a bag of money. The crew will meet you at the dock tomorrow morning.”\n\n“Why are you doing this?”\n\n“Despite popular opinion, I don’t agree with the Fire Lord on every decision.” She glances at Zuzu. “Ty Lee and Mai wish the dum-dum good luck. He’ll be broodier than normal and have more angst than anyone should experience. I wouldn’t like that. Goodbye, Uncle.”\n\nAzula takes one more look at her brother and memorizes the sight. She sears it into her memory. Will she even recognize him next time they meet?\n\nThe princess leaves the infirmary and slips back into her room. The first rays of sunlight rise as she closes her door. Mai sleeps in her bed, so she sleeps in a chair.\n\nWhen they wake up, Zuzu was on the open seas.", "action_results": [null]}]}]}]}, {"action": "Father Can't Be Defied", "result": "Father is going to kill Zuzu. I’d rather not have him killed. He is loyal, but I can’t defy the will of Father and the Fire Lord. I must accept these things, but…\n\nShe sighs. Zuzu is still her brother. Anyone, even the barbarians, deserve to have a fighting chance. Knowing Father, he’d slit her brother throat under the cover of darkness. It’d be effective but almost too effective. Zuzu will die no matter what happens, though he deserves to have a fighting chance.\n\nShe sneaks away to the one place Zuzu would go at a time like this. Azula would flee for the docks to secure passage to the barbarian lands or hide among her friends. Zuzu would… be Zuzu.\n\nThe princess enters his bedroom as he sits in bed, covers up to his chin. Beds are flammable, dum-dum.\n\nHe looks scared. He should be due to his imminent and approaching death, but her brother doesn’t know that yet since he ran away like a coward. He’s being a scared little boy.\n\nI should be direct. She sits on the side of his bed and stares at him. “Father’s going to kill you.”\n\n“What?” He backs away from her. Oh, right. I’m Father’s beloved child just as he’s Mother’s. I ALWAYS lie. Ug.\n\n“He’ll sacrifice you. The Fire Lord wants him to experience the supposed pain of losing his son, so he’ll get rid of you. It’s not as if he cares anyway.”\n\nHe shakes his head. “Dad would never do that.” Denial? At a time like this? Why can’t you understand that our father wants you dead?\n\n“Father doesn’t love you. He doesn’t like you. Maybe some Earth peasants would.” Zuzu’s really good at being a lovable idiot. Maybe some peasants would take pity on some lost Fire Nation noble. Then again, Zuzu would somehow tell them he’s a prince and get killed. Plus, I want him dead, not alive. I don’t like Zuzu, not at all.\n\n“Run away?”\n\nShe shrugs. “Mopping the decks often gets free passage on merchant ships.” I’m doing this just to be mean. Not to help him.\n\nHis eyes move to the doorway. She sees the recognition on his face. I thought Father said he’d do it tonight. Salvage the situation, Azula. Maybe I could act like I was trying to kill him?\n\n“Azula.” Fate must be on Father’s side. “What are you doing here?”\n\nI’m warning your son, Mother. “Talking.”\n\n“Come with me.” The tone and the tight grip on her arm don’t allow for protests.\n\nAs she drags Azula out of the room, she hears Zuzu muttering, “Azula always lies.”\n\nThat HURT. She doesn’t struggle at all as she’s practically dragged through the halls. I’m the only person in the bloody world that’s trying to help Zuzu, but you’ve entrenched your ideas so far into his head, Mother, that he refuses to believe me. You aren’t good for him. You aren’t good for anybody. Father’s going to kill him, but you’re the one who made him weak enough to kill. I wish you were gone. I wish you were dead.\n\nHer eyes light up. Dead. Gone. She sees a new opportunity. It’d kill two birds… four birds with one stone. Father would be so proud if she could ever tell him. Too bad she can’t and won’t.\n\nThey stop in Mother’s chambers. She stopped sleeping with father two years ago. Also, ew.\n\n“What were you doing, Azula?” And she thinks I’m the baddy here. I’m just a monster. Father and the Fire Lord are amoral. I have principles at least.\n\n“You once said you’d do anything if barbarians wanted to kill Zuzu.”\n\nHer eyes narrow. For once, Mother looks dangerous. Maybe I inherited a few things from her, besides beauty, after all. “Tell me the truth.” Her grip on the girl’s shoulder becomes painful. Maybe, it’ll leave a bruise.\n\n“Father’s going to kill Zuzu tonight because the Fire Lord asked him to.”\n\nShe doesn’t believe me. “Tell me one reason why I should believe you.”\n\n“Four. Zuzu won’t die. The Fire Lord will die. Father will get the throne, and you will be gone forever.”\n\nHer shoulders slouch. I don’t always lie. I’m occasionally nice. More importantly, sometimes the truth hurts more than the lie.\n\n“You have a plan, don’t you?”\n\n“Yeah.” Azula smirks.\n\nLater that night, the palace erupts into chaos. Azula stands watch in the shadows outside Zuzu’s door. He sleeps, blissfully unaware of the subterfuge and murder that just occurred. No matter what happens, she will not let anyone into his room tonight. Well, except that one. A figure gracefully approaches his bedroom. Unaware of the hidden prodigy, Mother rushes into his room. She shakes him gently.\n\n“Wha? Mother?” He rubs his eyes. None of the guards are aware of the woman in his room. Father happened to ensure no one was around his son’s bedroom tonight. Too late, Father. We spilt blood before you could.\n\n“Zuko, please, my love, listen to me. Everything I've done, I've done to protect you.” She wraps his in a tight embrace. She loves you, brother. Now, she’ll never see you again. “Remember this, Zuko. No matter how things may seem to change, never forget who you are.”\n\nBefore he could say anything in reply, she leaves. To where, Azula doesn’t know. All she knows is Mother will never return. She’ll always live with blood on her hands instead of her son.\n\nAzula smiles, a real one.\n\nI got rid of you forever, Mother.", "action_results": [null]}]}]}]}]}]}, {"action": "Sit Down next to Him", "result": "She walks up and sits down across from her dazed brother. Since he doesn’t whine about his thunked head, her dum-dum of a brother must be unconscious. Leave it to him to be the first firebending prince ever to lose a battle against a six-year-old girl and a little rock.\n\nHe opens his eyes and groans.\n\n“You should’ve dodged, dum-dum.”\n\nHe rubs his forehead and sniffs. Is he going to cry? “There’s no honor in running away.” And now he’s talking about honor?\n\n“The dead have no honor.”\n\nHe looks at her if she stabbed him. “But our great-grandfather killed the last Avatar. He beat the Air Nation. He started our war to spread our glory. How can he have no honor just because he’s dead?”\n\n“The war’s still going on. Sozin died before he could finish his work. He failed. No honor, just another power-hungry dead guy.”\n\n“No son of Sozin or any firebender would speak ill of our former Fire Lords.”\n\n“I’m no son, nor am I just any firebender.” She pokes her chest in triumph. “I’m THE firebender.”\n\nZuzu stares at her, trying to read her expressions. She reads others easier than she can read that awful old poetry Mother likes so much. Zuzu couldn’t tell if she was sad if she was crying, not that she ever would. Maybe he thinks I’m joking, but I’m dead serious.\n\nHe crosses his arms. “How come you’re so good at everything?”\n\n“Because I want to. I refuse to allow anything else to happen, so I become the best.”\nHe looks away from her. “It’s not my fault if you were born lucky. Dad says I was lucky to be born.”\n\nOuch. “So? You’re still related to the most amazing thing that happened in over a hundred years. Just don’t die or anything and I’ll let you be an armor bearing or something.”\n\n“We haven’t had a princess in battle for centuries, right? Why would I then bear armor?”\n\n“I will be a warrior. Plus, you’re too stupid to try to kill me, so I could trust you as my underling.”\n\nHis demeanor darkens. Ug, that sounds like Ty Lee and those auroras. “I don’t think I’ll ever get to a battlefield. I’d just get in the way.”\n\n“Which’s why you should be my helper. That way, you’d have a purpose. Plus, I promise I’ll try to keep your stupid butt alive when I’m already busy killing hordes of peasants or something like that. I’ll always be on your side when we’re in battle. See? Now you have a purpose. I don’t think you had a purpose.”\n\nThey lie there on the beach until sunset. Neither wanted to leave, since both knew what’d happen. They’d revert to their normal ways. They’d fight for their parent’s attention. Azula would scheme. She can’t remember the last time they just… talked.\n\nBoth were right. They didn’t have a quiet moment for the rest of the trip. When they got home, they’d either avoid the other of fight. Azula would come out on top. She had to. Only perfection can reach the throne, and she’ll prove she’s perfection incarnate.\n\nHowever, she didn’t lie, not when making that promise. Even though their daily lives are like a battle against the other, on the real battlefield, she’d be there for her brother. No matter how much she dislikes the dum-dum, she knows it’s the duty of a royal to protect the weaker members of the family. But, that’ll happen years from now, maybe a decade. The Fire Lord will probably be her tea-loving uncle by then.\n\nEven Azula with all her cunning could never predict that the battlefield will come so soon. It’ll come charging towards Zuzu not from assassins or enemy soldiers. He’ll be threatened by his family.", "action_results": [null]}]}]}]}]}]}]}, {"action": "Tell Him", "result": "“I bended fire.”\n\n“Really!” She looks up, and he smiles. “You bent fire? Now, you’re like me!”\n\nBut Mommy loves Zuzu but not me. Zuzu is not like me.\n\n“No.” She points to the tapestry. “I bended fire and burned that. Mommy was angry.”\n\n“That was Mom’s picture of her mom and dad.”\n\n“I didn’t wanna.” She crosses her arms.\n\n“I didn’t say that. Was it an accident?”\n\n“Yes, but I do better. I won’t burn more things.”\n\n“Good. Maybe we can practice together?”\n\n“Yes!”\n\nZuzu will help her. She never got to do big kid things with him before.\n\nThey hear a new set of footsteps. She turns and sees someone she only remembers seeing twice before besides their nightly, tense dinners. Mommy stands behind him. She looks angry.\n\n“Daddy?” she asks. Zuzu takes three steps backwards.\n\n“Azula, you bent fire.”\n\n“Yes.” She clenches her tiny fists. Will he be angry too?\n\n“Good job.” He smirks. At this time in her life, it scared her. Eventually, she will learn to desire such approval.", "action_results": [null]}]}]}]}