{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=49642", "context": "", "first_story_block": "Eyes fluttering open, you find yourself there in the Nightmare Realm again. You’re sprawled out on a soft, eerily warm ground. A dull, strange pulse that trembles through the ground. The ground's texture is unnerving as your fingertips run across it, closer to flesh than earth. You squint, making out thin veins spread out through the ground, pumping a black liquid through the flesh that stands in stark contrast to the brownish-red of the floor. You briefly look at yourself for any injury, but you don't see anything wrong, at least visibly. You're wearing a pair of simply cloth pajamas that hang off your pale, frail frame and some small, featureless blue slippers.\n\n\nStanding, you look around at the nightmare realm surrounding you. The sky is black and lifeless, not a single shining light to break the dull veil of oblivion that hangs over your head. You’re in the middle of a forest of jet black trees that spike out from the ground like pillars of obsidian, their trunks all charred and blackened by what you presume was fire. From the tree's branches hang red, glistening organs and chunks of flesh, blood dripping down from them. A length of rotting intestine, a split open stomach whose food has spilled out to the ground, a long strip of unidentifiable flesh, they all just hang their like some horrifying butcher’s display.\n\n\nIn contrast to the dark floor there’s several chunks of bleached white bone about the size of a child’s head in the ground, sticking out like everyday rocks. You grab the nearest one cautiously, turning it over in your hand to reveal the bottom of it is covered with beetle-like creatures, which make a strangely human-like panting. Thin, long pink tongues extend from their mouths towards you, before you frantically shake them off the chunk of bone. Nervously, you toss the chunk of bone back to the ground.\n\n\nYou look around for anything useful, something to help you get out of this insane hellscape. Next to one of the trees, leaning against the gnarled black roots is a red, plastic Zippo lighter, seeming out of place in the whole world of nightmares. There’s a lake of black, unreflective liquid that you stare at, its waters thick and oil-like. Sitting next to it, far enough away from you that you’re not too scared, is a figure.\n\n\nThe figure looks like a badly deformed child, although its face is closer to that of a hairless rat, a long snout that extends past its face. You pause, noticing its eyes are a pair of black buttons, stitched straight into its sockets with red thread. Its limbs are thin and frail, and although it seems to be naked. Its skin is pale and leathery, hanging off it in patches to reveal the black flesh underneath. It holds in its hand a fishing rod, sitting there casually as if nothing was wrong. You wonder if it’ll act as a friend or foe. Sitting next to it is a black oil lantern, from which the only light in sight shines out, brightening the area.", "action_results": [{"action": "Follow the pulse of the ground", "result": "Dropping to your knees, you press your thumb against one of the veins going through the ground, feeling the warm pulse of blood go through. You follow the vein, the pulse growing louder and louder, stronger and stronger with every beat. \n\n\nContinuing to follow it, you soon reach a thick mass of flesh, coils of muscle filled with the black, oozing blood. The thing spasms every few seconds, and you wince as you realize you’re listening to the beating of a heart.\n\n\nThe heart lies there, spasming and beating as you wonder what to do. ", "action_results": [{"action": "Attempt to kill the heart", "result": "You take a deep breath, looking around before seeing a chunk of bone. You lift it up, shaking off the bugs that cling underneath, before ramming it into the heart. It bounces back, but you feel there’s some leeway, so you heave it back into the air before bringing it down. The heart bursts open as you drive the chunk into it, spraying you with the black bile-like blood as it covers your arms up to your elbow as you plunge your hands inside. It spasms one final time, spraying blood out, before you toss the chunk aside.\n\n\nListening to the silent night air, you hear the faint beating of other hearts, keeping the nightmare realm alive. There must be hundreds of them. There’s no way you’re killing this hellhole. \n\n\n ", "action_results": [{"action": "Back", "result": "Eyes fluttering open, you find yourself there in the Nightmare Realm again. You’re sprawled out on a soft, eerily warm ground. A dull, strange pulse that trembles through the ground. The ground's texture is unnerving as your fingertips run across it, closer to flesh than earth. You squint, making out thin veins spread out through the ground, pumping a black liquid through the flesh that stands in stark contrast to the brownish-red of the floor. You briefly look at yourself for any injury, but you don't see anything wrong, at least visibly. You're wearing a pair of simply cloth pajamas that hang off your pale, frail frame and some small, featureless blue slippers.\n\n\nStanding, you look around at the nightmare realm surrounding you. The sky is black and lifeless, not a single shining light to break the dull veil of oblivion that hangs over your head. You’re in the middle of a forest of jet black trees that spike out from the ground like pillars of obsidian, their trunks all charred and blackened by what you presume was fire. From the tree's branches hang red, glistening organs and chunks of flesh, blood dripping down from them. A length of rotting intestine, a split open stomach whose food has spilled out to the ground, a long strip of unidentifiable flesh, they all just hang their like some horrifying butcher’s display.\n\n\nIn contrast to the dark floor there’s several chunks of bleached white bone about the size of a child’s head in the ground, sticking out like everyday rocks. You grab the nearest one cautiously, turning it over in your hand to reveal the bottom of it is covered with beetle-like creatures, which make a strangely human-like panting. Thin, long pink tongues extend from their mouths towards you, before you frantically shake them off the chunk of bone. Nervously, you toss the chunk of bone back to the ground.\n\n\nYou look around for anything useful, something to help you get out of this insane hellscape. Next to one of the trees, leaning against the gnarled black roots is a red, plastic Zippo lighter, seeming out of place in the whole world of nightmares. There’s a lake of black, unreflective liquid that you stare at, its waters thick and oil-like. Sitting next to it, far enough away from you that you’re not too scared, is a figure.\n\n\nThe figure looks like a badly deformed child, although its face is closer to that of a hairless rat, a long snout that extends past its face. You pause, noticing its eyes are a pair of black buttons, stitched straight into its sockets with red thread. Its limbs are thin and frail, and although it seems to be naked. Its skin is pale and leathery, hanging off it in patches to reveal the black flesh underneath. It holds in its hand a fishing rod, sitting there casually as if nothing was wrong. You wonder if it’ll act as a friend or foe. Sitting next to it is a black oil lantern, from which the only light in sight shines out, brightening the area.", "action_results": [{"action": "Inspect the tree trunks", "result": "You head over to the black tree trunks, running a hand over the ash-covered trunk. Some of the ash rubs off, and you roll it between your fingertips. You notice that there’s several deep gouge marks in the tree, no doubt from some horrifying beast.\n\n\nA drop of blood lands on your shoulder from the organs hanging above you, and you step back away from the tree.", "action_results": [null]}, {"action": "Fetch the lighter", "result": "You move over towards the gnarled, tangled roots of the tree, blood from the organs that hang above dripping down to you. You pause, seeing wrinkled fingers wrapping around your other hand. You’re torn through the air with a scream, smacking into the earth as you’re quickly dragged down a burrow hidden in the roots of the tree. You tumble to your ground, collapsing in front of a horrifying creature.\n\n\nThe creature looks to be a strange hybrid between a spider and an old man. It’s body is spider-like, covered in a pale, translucent ooze. Its head is that of a smiling old man, although the same ooze drips from the corners of its mouth. Its eyes are black, lifeless orbs. It’s eight long, spindly legs each end with a human hand covered with a wrinkled, grey skin. \n\n\n“Good evening, my child,” it says, with the voice of a kindly grandfather.\n\n\nIt’s long, spindly arms reach around, it’s wrinkled fingers grabbing your limbs and lifting you into the air. \n\n\n“A shame I won't be able to take you to the tea party soon, but I'm just so very hungry. I’m going to savor your young, soft flesh,” it says, as you scream into the silent darkness. \n\n\nHours later, when the last breath finally expires from your broken form, its long arm reaches out from its den, placing the bright, red plastic lighter in front of the den, waiting for the next fool to come. They always did.", "action_results": []}, {"action": "Head off into the trees", "result": "Heading off into the woods in a desperate attempt to find a way out of this place, you quickly hurry off out of the light of the lantern. You’re soon drowned in darkness, without the light of any light to guide you. After a few minutes, as you're feeling your way forward to avoid hitting a trunk, you hear the faint sound of someone weeping.\n\n\nA huge, towering creature of black fur with muscles that ripple underneath, standing like a gorilla with two massive, clawed hands appears out of the darkness, right in front of you. It’s face is a white, china mask of a crying woman, with tears of red flowing down its cheek. It continues to weep as it moves towards you, a hand wrapping around you. It lifts you up, moving you right in front of its crying face.\n\n\nSuddenly, it flings you into a tree, shattering your ribs. You hit the ground with a scream, as it continues weeping, although you can’t see where it is. You lie there in pain, listening to the sound of the crying growing fainter as the monster moves away.\n\n\nSuddenly, you hear the sound of laughter, growing closer and closer. You try to move, but you’re effectively crippled by pain, unable to move. You close your eyes and like your assailant, begin to weep, hoping whatever creature finds you first does its job quickly.", "action_results": []}, {"action": "Pull organs down from the trees", "result": "You move towards the branches, attempting to pull the organs down. When that fails, you wrap an arm around the tree trunk, lifting yourself up somewhat and shaking a branch. Several bloody organs plop down into the dirt.\n\n\nSuddenly, the soil begins to morph, as it cracks open to reveal small, human-lie mouths. The creepily human-like teeth bite and tear at the meat as they swallows the meat, devouring the organs.\n\n\n ", "action_results": [{"action": "Attack the mouths", "result": "You quickly look around for a bone chunk, grabbing it and shaking the bugs off it. Quickly, you smash the chunk of bone into a mouth, knocking bloody and broken teeth out. The mouths gnash soundlessly as you smash the chunk of bone into them repeatedly, smashing out countless teeth. The mouths shut closed, morphing back into the ground.\n\n\nCautiously, you collect a handful of broken, bloody teeth, but the mouths don’t make a reappearance.", "action_results": [null]}, {"action": "Quickly flee", "result": "You're unwilling entirely to let those mouths get you or get close to you. You quickly backpedal, heading to the relative safety of next to the lake.", "action_results": [null]}]}, {"action": "Approach the figure", "result": "You walk slowly towards the strange figure. It eagerly turns to stare at you as you approach, moving slowly and cautiously. When you’re standing less than a meter away, it begins to approach, it’s frail arms reaching up to your face, two pale, disgusting fingers entering your mouth and tapping against your teeth. Quickly, it jabs its finger forward, knocking a loose tooth free from your gums with a few drops of blood.\n\n\n“Mine,” it whispers in a soft, rasping voice.\n\n\nYou pull back frantically as it releases its grip, looking towards you with indifference again as it slowly picks up the loose tooth, raising it to its mouth and swallowing it whole. You step back, ready for it to strike, but it returns to its spot by its lantern, grabbing its fishing pole. You wiggle your tongue around in the new gap in your teeth, staring ahead nervously.", "action_results": [{"action": "Move away from the figure", "result": "You move nervously away from the figure, who seems indifferent to your slow but steady backpedalling.", "action_results": [null]}, {"action": "Offer it a tooth", "result": "Not knowing what else to do, you step forward, pointing to one of your teeth. \n\n\n\"A tooth. You get one tooth.\"\n\n\nThe figure nods happily, motioning for you to kneel down. You do, and suddenly its disgusting fingers force their way into your mouth. They're surprisingly cold, tasting of a mixture of soot and rotting flesh. Its fingers squeeze a tooth tightly, before tearing it free of your mouth in a single motion. You go to move away, but the creature doesn't seem satisfied with its single tooth now that its so close or doesn't understand your offer, grabbing another tooth.\n\n\nAt that point, you quickly panic, and begin to move desperately as you try to escape it as it tries to hold you in place to remove your teeth, shaking you violently in an attempt to get you to stop moving. You keep moving your head rapidly, trying to avoid it getting a grip on another tooth.\n\n\nIt lets out a rasping scream in frustration. Finally, holding your head tightly, it twists it around and forces your head under the black, murky water. The water oozes into your throat, flooding into your lungs as you try to scream, but instead the liquid just pours into your throat. As your body seems to realize its hopeless to fight, the last bit of strength drained from you.\n\n\nYour last thought is a morbid one, but you think that it'll be a lot easier to pull out your teeth once you're dead. ", "action_results": []}, {"action": "Try to take the lantern", "result": "You move towards the creature’s lantern, but it quickly grabs your hand. Its cold, semi-moist fingers wrap around your wrist as it gently but firmly pushes you back.", "action_results": [null]}]}]}]}, {"action": "Leave it", "result": "There’s no way you’re messing with whatever’s there. You’re just not willing to do it. You step back, moving away from the heart.", "action_results": [null]}]}]}