{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=15424", "context": "", "first_story_block": "INTRODUCTION: This game is stupid, unrealistic, and not time specific at all. There will be weird references to things that haven't happened yet, misplaced musical cues, and a bunch of other lazy mistakes. Hopefully it will be fun, though. Try to do the stupid stuff, as it's usually funnier. Dying doesn't matter much and please don't take this too seriously.  Good luck!\n\n\nAlso, you'll come across items which represent proficiencies that will enable you to overcome certain obstacles you'll face in the story or alternatively cooler ways to solve problems. Click them once, and you'll take them. You don't need to use an item, it'll just unlock alternative choices throughout the plot.\n\n\nIf you like music, we have also developed a few minute-long tracks to further induce the trance-like state that the '90s should provide for you.  download them here. You'll know you've unlocked a song when some text at the top of a node tells you. Or, feel free to just play the songs whenever you feel if it helps you get immersed.\n\n\n \n\nLike This if Time Travel is Real and I'm in the '90s Again\n\n\nThe calming glow of your computer screen splays a dim light across a complete collection of Nicktoon posters. You’ve liked your last 90s Remembrance page for the night, and close Facebook before settling back for another viewing of Jerry McGuire.  You’re 46 years old, your parents are dead, and Tony just got married.  You reopen Facebook, idly spitting some tobacco into your Catdog Licensed Cup, and navigate to Tony’s page.  Wow, looks like he just got another award for some bullshit science achievement.  You’re sure mom and dad would be proud of him, just like they always were.  Rocco jumps on your lap, purring excitedly, as she can sense some hot fire about to be spat on your idiot brother’s face.", "action_results": [{"action": "download them here", "result": "", "action_results": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}]}