{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=49200", "context": "", "first_story_block": "You thrust a final time, your ragged cry of release filling the air and startling a pair of birds overhead. As they wing away you clutch Mondy to you, whispering, “Thank you,” and kissing him passionately as the scarlet leaves overhead drift down onto his golden hair.\n\nThese last couple of years have been hell. The two of you had your love put to the test more than ever before. It’s been utterly draining--physically, emotionally, financially--but as you look into Mondy’s eyes you know it was all worthwhile, and you know he feels the same. Such a warm feeling of peace and joy suffuses you, and you can’t help but kiss him again.\n\nDays drift by, careless and lazy.\n\nThe two of you spend the evenings fishing, and during the day you glean whatever you can find from the overgrown fields. Mondy is still in recovery from his long illness and a bit weak, so the bulk of the work falls on you. Not that you mind. The days are quiet and peaceful, and it’s a joy just to be alive as you greet each sunrise, your love at your side.\n\nIt’s really just the two of you out here now; there were only a handful left in the village after the sickness came, and since then they’ve all packed up and left. No future out here. You heard those words often enough, even in your younger days, and there was even a time you believed it.\n\nAnd of course, there were uglier words.", "action_results": [{"action": "Days past", "result": "The first meeting with Mondy came while dropping off a necklace of your mother’s. The clasp needed repairing, and he was still a jeweler’s apprentice then. You’d always been considered eccentric, and Mother had stopped bothering to ask you when her dear boy Mirk was going to find a nice girl and give her a grandchild long ago. You’d expected you’d die alone, and a virgin, if you were being completely honest with yourself. But when you met Mondy...there was a spark between the two of you immediately, and before long it lit a bonfire in your heart.\n\nThe two of you had never tried to hide your love.\n\nAt first, when you and Mondy pledged yourselves to one another under the tree on the hill, and then again in the village square, the others had been...accepting enough, even if a few of them clearly thought the both of you mad. But your mother had given you her blessing, and took Mondy into her heart almost as a second son, and that was the most important thing.\n\nNear the end, however, things changed. Personally, you blame the priest. Or perhaps it was the sickness weighing so heavily on everyone’s souls that turned them twisted and cold. But the looks grew darker. The whispers grow uglier, and then stopped being whispers at all. They said the love you shared was an abomination. The priest stood in he doorway of the church and thundered that a demon had poisoned your mind.\n\nAny of that, all of that...you could have borne without complaint, and gone on about your life. Mondy’s love was all you needed. But when your mother lay on her deathbed, and her last words were begging you to leave the man you loved? It broke something inside of you.\n\nAfter her funeral you and Mondy had a long talk...a long cry, really, on your part. There was never a question of you leaving him, of course. For your mother to even suggest it felt like a betrayal, though you knew she wasn’t herself. She was weak, ill, just like Mondy had been, and being quite old and frail as well her mind had easily been poisoned against you.\n\nBut the two of you knew when you were no longer welcome, retreated from life in the village, and moved to a cottage on the other side of the hill. Eventually, the others all left. “Good riddance to that lot,” you’d muttered to Mondy, watching the last cart being drawn away. “We can do as we like now.”\n\n\nWhat would you like to do?", "action_results": [{"action": "Look around the cottage", "result": "The cottage--well, it’s more like a shack--has seen better days. And it wasn’t much even back then.\n\nThe fire has gone out, and the only light comes from the gaps in the boards that are now also letting in the icy bite of winter. It’s early for a first frost, and you have a feeling this year may be a bad one.\n\nOpening the pantry, you find nothing but a cloud of dust that drives you into a coughing fit. Sneaking a guilty glance at where Mondy is resting on the bed, you relax when you see you haven’t wakened him. He was sick for so long, on the verge of death, that even now he hasn’t recovered his strength, and you worry constantly he’ll have a relapse.\n\nThere’s no firewood in the box. How long has it been since you’ve replenished it? You really have been letting things slip around here. Perhaps it’s time you start thinking more seriously about what you’ll do in the coming days. To tell the truth, you’re not confident anything about this place will be enough protection in a bad freeze or heavy snow.", "action_results": [{"action": "Walk to your tree", "result": "This tree at the top of the hill--a sugar maple--as a lonely, awkward little boy you would play here, and when Mondy came into your life it was the place the two of you would sit and talk for hours, even before you finally mustered up the courage to say the words that had gone unspoken so long between you. You’ve been calling it ‘our’ tree for the last four years, whenever either of you speak of it.\n\nYour hand caresses well known lines in the bark; a heart with the names Mirk and Mondy inside. On impulse you pull out your knife and carve it all in deeper.\n\nThe branches are bare now, and the wind up here is quite a bit stronger, and carries a bitter chill. You really ought to find some firewood and supplies. Can’t have Mondy getting sick again.\n\nBelow, you see the abandoned shops and dwellings of your old village, huddled together around the little church you eventually came to hate.", "action_results": [null, {"action": "Walk to the village.", "result": "You have such mixed feelings about this place. You grew up here, you knew absolutely everyone and considered them your neighbors and friends. For a while your life was good, even if pretty obviously not going anywhere.\n\nSo much changed in the last couple of years. The sickness emptied the houses and filled the graveyards, and it was like a frost settled in the survivors’ hearts. Everyone became so intolerant and ugly. In the end, you were glad to see the last of them leave. Although the sight of the empty and staring husks of the buildings and the overgrown yards, abandoned now even by the feral cats and the stray chickens you’d happened across in warmer months, will never sit right with you.\n\nYour breath puffs clouds of white fog into the air, and the silence is absolute.", "action_results": [null, {"action": "Mother's House", "result": "Rusted hinges give a squeal of protest as you tug open the door, and a lump rises in your throat as you enter and look around.\n\nGrowing up, you had always been close to your mother. She’d never made you feel lacking for not being like quite the other boys, and there was nothing you couldn’t confide in her. Mother had cooked you and Mondy dinner many times over her old cast iron stove and served it at the table with the intricately carved legs that had been a wedding gift from her grandfather, a carpenter, to her own mother so many years ago.\n\nThe stove and table are gone now, like most of the rest of the furniture in the house. Your creditors had gobbled up their due the instant the place became yours.\n\nYou were so ready to remove yourself from village life by then you never did get around to selling the house, though the Lord knows you could have used the money. Mondy’s long illness and recovery had cost you literally everything, and the loss of your mother had come soon after.\n\nShe had taken such care of this house right up until the end, it hurts to see it this way.", "action_results": [{"action": "Search", "result": "In a partially unraveled wicker basket, half hidden behind with a few other odds and ends the debt collectors had found unappealing, you find a neatly folded quilt. It uses the same log cabin pattern as the one she’d given you and Mondy the night you’d moved from here to the place you’d purchased together on the other side of the square. The strips of cloth are more muted in color, but your eyes prickle with tears when you spot the burgundy fabric and tiny white flowers of a dress you remember helping her sew.\n\nThe blanket still smells like rose petals when you crush it to your cheeks, and the material is thick and invitingly warm. It will be a welcome defense against this early winter. You take it with you when you go.", "action_results": [null]}, null]}, {"action": "House of Healing", "result": "If you’d taken Mondy here sooner, would things have happened differently? You thought it was just the flu he’d had at first, and that you could care for him at home. The realization hadn’t sunk in yet just how serious things were going to get, for you or any of the other villagers.\n\nOnce the death bells started ringing and you did bring him in, the healer and her daughters were being run ragged, and so you cared for Mondy yourself. You don’t remember sleeping at all that month, and when the healer told you it was a lost cause, that there was nothing anyone could do and that the priest must be called and that the cot was needed for others, you took him home and continued to care for him yourself. You don’t remember sleeping that next month either, just spending and selling everything you could to bring in anyone, absolutely anyone who might be able to help from the villages and towns all around. Other healers, shamans, veritable witch doctors, and finally the men with the bright little knives and tiny bottles of expensive brews from the capital. You had paid dearly for it all, but didn’t regret it for an instant. Anything to save your love, and in the end you had saved him.\n\nNow he lies beside you in bed every night, and smiles at you every morning, because you weren’t willing to give up. Let the others say what they will, but the love the two of you share is an enduring one that the world can never touch.", "action_results": [{"action": "Search", "result": "You remember candles burning day and night, the wax fused with drops of cleansing lavender oil that hung in the air among the crowded cots, the stench of sickness and death. Lavender is not a scent you care for anymore. But some of the candles are still here in a drawer, and you do need the light. You take them with you when you go.", "action_results": [null]}, null]}, {"action": "Communal Kitchen", "result": "Not everyone had been so well off as to have a sturdy brick fireplace and iron stove of their own like your mother did, and so this had been the place anyone could go to cook their family’s meals, or wash dishes and clothes by the pump out back.\n\nYou and Mondy had come here almost every night for nearly a year, as giddy and fond of each other as any other newlyweds and making the young girls all giggle behind their hands. Both of you were terrible cooks, but you’d been determined to make a go of housekeeping on your own and not rely on your mother aside from her lavish Sunday dinners. Thankfully in this building there were enough veteran housewives around that were happy enough to teach the basics once they realized how utterly helpless you both were.\n\nYet in the end, those who were left hadn’t even allowed you and Mondy to come in here together. Not able to bear subjecting Mondy to their unfriendly stares, you’d taken on the burden yourself, cooking and cleaning in silence and then escaping as soon as possible, trying to pretend like you couldn’t hear the whispers.\n\nThe squeaking and scuffling of rats in a corner draws you from your reverie.", "action_results": [{"action": "Search", "result": "During the sickness and for much of its aftermath, hot stew had been kept bubbling here for those who had nothing else, and rummaging in the pantries in the back you’re able to find some fragments of beef jerky and a small sack of potatoes sprouting all over with pale eyes that never made it into the pot. You take them with you when you go.", "action_results": [null]}, null]}, {"action": "The Old Church", "result": "This place.\n\nYou don’t really have any good memories from here.\n\nAs a boy, the wooden pews were hard and uncomfortable, the scratchiness of your Sunday clothes was a constant irritation, and the priest’s voice droned on and on.\n\nYears later, the old man’s successor would declare you to be under the influence of demons and encourage your neighbors to send Mondy away. He poisoned the mind of your own mother against you. Even now it hurts to think of it.\n\nYou shiver, but not from the winter chill. The coldness you always feel here now has nothing to do with the weather.", "action_results": [{"action": "Search", "result": "On a whim you check one of the pews near the back. Yes, the same loose board is still there in the same place it was when you were younger. You used to sit right behind it and kick at it to annoy the glaring pug-faced little girl who always sat in front of you, whenever your mother wasn’t looking. All these years and they never fixed it.\n\nYou tug at the board, and it comes away in your hand. A sheet of paper flutters out, and you pick it up, noting it appears to be a poem of some kind before stuffing it in your pocket.\n\nThe wood of the board appears quite old and is cracking in places. “Hell, wood is wood. I can use this,” you tell yourself. It feels a bit like vandalism, but there’s no one left here, and it turns out to be surprisingly satisfying to break down the rest of the pew until you have a small stack of boards and fragments, enough to keep the fire going tonight. You take them with you when you go.", "action_results": [null, null]}, null]}]}]}, null, null]}, null, null, null]}]}