{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=52499", "context": "", "first_story_block": "    The Elken’s massive hoof slams into the snow-coated ground. The tired beast lets out a massive snort. You lean forward in the saddle and scratch just behind its antlers.\n\n\n    “Good beast,” you murmur. You give it a kiss, right in its furry mane. “Not too further boy, promise.”\n\n\n    The beast comes to a stop. It stands on the edge of the snowy, switchback trail that you’d been following for weeks. Beyond mountain, lies nothing but thick, snow-covered forest. You let out a sigh of relief. You’ve found the spring hunting grounds.\n\n\n    You’ve ridden ahead of the rest of the tribe, searching for this very forest. While they make the difficult trek over the mountain (exacerbated by the presence of women, children, and the elderly), you’ve ridden ahead in search for a camp sight for the tribe.\n\n\n    You drive your heels into its sides, and the beast begins to carefully plod down the mountainside. It stops only once, to leave a steaming pile of manure in the snow.\n\n\n    You wince as you hop out of the saddle, and the drop to the ground sends a jolt through your body. Taking a moment, you briefly insure that your spear and satchel of provisions are still on your back. Satisfied, you drop the reigns over the Elken’s head, and lead him into the forest…\n\n\n***\n\n\n    The clearing is in the same spot it's in every year. You know from experience that it can easily house the entire tribe and their huts; the Gods certainly know that this unusually harsh winter has not grown the tribe.\n\n\n    It takes a hours to find dry wood for the signal pyre. Eventually, you assemble a pyramid of dead wood and dry brush and set it ablaze with your flint and knife. The flames lick greedily at the cold winter air, and a thick, black plume of smoke reaches up in to the sky.", "action_results": [{"action": "The tribe arrives", "result": "    On the fifth day, the tribe arrives. Being the advance scout, you have the honour of setting your tent up first. You unrolled the furs that you stored on the Elken’s back, and strung them over a framework of thick branches. The tent will be able to house five or six of your tribe, easily. You leave a hole at the top to let the smoke from the life-saving fire out.\n\n\n    You’re standing in the middle of the clearing, cleaning the Elken with a coarse horsehair brush when the rest of your tribe approaches.\n\n\n    Some are walking, some are riding Elken. Mothers clutch their babes to their breasts, while fathers look cautiously to the woods; Fell Bears and wolf-packs have been known to hunt these woods. Disturbingly, gangs of legionnaires have also been stalking the woods. Those taken are presumably fed to whatever foreign gods lord over the Marble City.\n\n\n    Caelan, the most elderly man of the tribe, and the chieftain since before you were born, spots you immediately. A youthful grin splits open his aged face. He shivers in the cold, and lets out a cloud of smoke from his mouth, which rapidly dissipates in the frigid winter air. The old man wraps his fur cloak around him.\n\n\n    “You’ve done well by the tribe,” he says, as he approaches, “Your father would be proud.”\n\n\n    You dip your head in gratitude.\n\n\n    He presses his middle, index, and ring fingers into your forehead. “I release you from your duties as Torchbearer.”\n\n\n    “It’s good to see you, Caelan.” you say as you press your forehead into his — a salute as old as time.\n\n\n    “You as well, my boy.”\n\n\n    “How was the journey?”\n\n\n    “It was hard. The old paths were snowier than usual, there were some who thought you’d died, and we wouldn’t have a camp-sight to come to.”\n\n\n    “Still alive,” you say with a smile.\n\n\n    “And I’m glad to see it. Still, I shouldn’t complain too much about the journey. We only lost one, this year.”\n\n\n    “Who was that?”\n\n\n    “Waiola. Tacitus’ newborn daughter. The cold was too much for her.”\n\n\n    “That’s a shame. His first child, yeah?”\n\n\n    He nods, and gives you a wan smile. “He’s been taking it hard. When you see him around, be kind to him and his wife.”\n\n\n    You fall silent for a moment. Before you can speak, another approaches. Wrapped in furs with a bow strung across her back. She’s missing her left ear, and there are scars running from the tips of her mouth up her cheek by a few inches. Even still, she’s wearing a broad smile across her face.\n\n\n    “You’re the Torchbearer?” she asks jovially.\n\n\n    You glance at Caelan in confusion.\n\n\n    “This is Enya. She’s a tribe-less we picked up on the journey; didn’t feel right to abandon her.”\n\n\n    “It wouldn’t have been,” you agree, before turning back to Enya and extending your hand.  She takes it; her grip is firm.\n\n\n    She purses her lips and nods as you shake hands. “I’m glad you feel that way.”\n\n\n    You snort.\n\n\n    “I’m fucking tired,” Caelan says frankly, “we should see to setting up those tents.”\n\n\n    And so you do, for the rest of the day. All of the tribe works together erecting the massive  tents that will be their home for the coming months. Thick frameworks are nailed in place, and cured hides are set on the floor so as to avoid sleeping on the snow. Furs are strung from the oak frameworks to trap in heat and act as walls. Firepits in the centres are also constructed, for cooking and boiling water. You work with remarkable efficiency; at the end of the day, your campground resembles a tiny, bustling village.", "action_results": [{"action": "A morning hunt", "result": "    It’s before dawn. Tired of the rations brought by the tribe, you’ve decided to bring down the first hunt of the season. You grab your bow, arrows, spear,  and satchel, and step outside the warmth and pressed-together bodies of the communal tent.\n\n\n    You see Enya outside the tent. She’s sitting cross-legged on a large rock, scraping a piece of flint over a bone knife.\n\n\n    “Morning,” you say. You eye her with a slight amount of caution.\n\n\n    She returns the greeting, not looking up from the knife.\n\n\n    “Planning on going out for a hunt?”  you ask.\n\n\n    “Aye. Gonna bring down the first buck of the season, I’d reckon.”\n\n\n    You raise your eyebrows. “I think you should reckon something else, because I’m about to bring down the first buck of the season.”\n\n\n    She snorts, and stands up.  “Sounds like we have a competition on our hands, then.”", "action_results": [{"action": "Hunt alone", "result": "    “And a one-sided competition, at that,” you say with a sneer as you lift your weapons off the ground and set off into the forest. You privately savour the look of frustration on the newcomer’s face as you stalk off into the woods.\n\n\n    All thoughts of competition are lost once you enter the woods, however. You become one with the forest, once more; a spectre, silently moving over roots, branches and patches of grass. A finder of secret paths and animal tracks.\n\n\n    Perhaps you’re there for minutes. Perhaps you’re there for hours, days, or weeks. Time is ephemeral and meaningless when you’re in the forest. Soon, you find a handsome buck; skittish, along with all of its kind.\n\n\n    Over hours, you learn the animal’s personality. He’s cautious and smart, and will be a challenge to bring down. You don’t even knock an arrow until your second encounter with him. Finally, on the fourth meeting, you manage to creep up on him unawares.\n\n\n    You see his hot breath evaporating in the winter air. You become aware of his place relative to yours on the food chain. You are hunter, and he is prey; this is the way things ought to be.\n\n\n    You let go of the bowstring.\n\n\n    The arrow flies true, and the bolt tears right through the deer’s vitals. It stumbles for a few paces, before falling face-first into the snow. A crimson puddle seeps out from under him as he breathes his last.\n\n\n    You feel a twinge of guilt as you approach him. You slit the deer’s throat for good measure, causing it to leak even more blood out onto the snow. You tie a thick rope around its neck and antlers, and then begin the difficult task of dragging it back to camp…", "action_results": [{"action": "Return to camp", "result": "    You smell smoke long before you reach the camp. Without thinking of it, you drop the deer in the snow; if this is a false alarm, you can come back for it later. Then, you sprint off towards the camp.\n\n\n    Your intuition is correct. The camp is in ruins. Three out of the four communal tents have been razed to the ground, and the fourth is smouldering. Bodies litter the ground; killed indiscriminately. Women, children, infants, and a few men all lie in puddles of their own blood.\n\n\n    You see Tacitus lying spread-eagled in the snow. It would appear someone has taken pity on his recent misfortunes, and has taken it upon themselves to give him a bright-red smile, just below the chin.\n\n\n    Without thinking, you draw your bow and loose an arrow. The arrow embeds itself in the tower-shield of a legionnaire.\n\n\n    He shouts something in a language unbeknownst to you, summoning three of his comrades out from the burning tent; one is dragging a half-naked woman along with him.\n\n\n    He draws his shortsword and begins to charge towards you. You drop your bow in the sand, and withdraw your spear.\n\n\n    Your first thrust is deflected by the shortsword; he retaliates by pushing forward with his oversized shield, sending you scrambling through the snow. You narrowly dodge an overhead swipe from his blade.\n\n\n    Seizing an apparent opportunity, you leap to the left, and stab wildly at him with your spear; the blow strikes true, but your stone spear tip uselessly slides off his plated chest armour. You look on his face and see a cruel sneer.\n\n\n    With breathtaking speed, he dashes forward and kicks you square in the chest. The blow sends you reeling, and knocks the air clean out of your lungs. You try to regain your footing as he drops his shield and charges at you.\n\n\n     The two of you tumble to the snow. You fling your spear aside as you fall. He grabs your neck in one of his gauntleted hands, and begins to crush your throat in an iron grip.\n\n\n    Panic grips your world as you frantically look around for options. Your hand closes around your hunting knife. As black spots dance across your vision, you notice something; his armour only extends halfway up his arm, and the rest is covered merely by fur. You seize the initiative and shove the dagger into his exposed forearm. He curses as blood gushes out from the wound, and releases your neck.\n\n\n    You greedily inhale as much air as you can. The legionnaire punches you in the face, and his metal knuckles easily break your nose. Blood pours down your face and into your mouth. He punches you again, knocking a tooth down your mouth.\n\n\n    Time slows to a halt. His fists glance off your face, mangling it into a bloody ruin. You see your own clouds of hot breath seeping out into the air like a gushing wound. The legionnaires eyes narrow inside his helmet, and a cruel smile splits his face from end to end.\n\n\n    Before you’re submerged in darkness, he speaks two words in your language:\n\n\n    “Elf scum.”", "action_results": [{"action": "Taken as a slave", "result": "    You can’t stop throwing up. Even the nutrition-less gruel they serve the slaves is too much for you to handle. As the procession of soldiers and slaves travels South, you leave pools of vomit as a trail.\n\n\n    The conditions are harsh. Every day at dawn, you’re loaded into a wagon with a few dozen other slaves. You ride this way for fourteen hours, before a guard distributes furs to wrap yourselves in for the night. You’re given six hours to sleep. When you’re woken, you are let out to relieve yourself and collect water for an hour; then, it’s back to the cart.\n\n\n    This is exacerbated by the fact that you are having a hard time remembering your own name. There are other elves on the cart, some of whom you feel like you should recognize; but you find yourself unable to respond to their feeble attempts at conversation. Nothing more than a mewl escapes. You feel heavy and trapped in your own body.\n\n\n    On the fourth day of your imprisonment, a legionnaire takes notice and notifies the Centurion. You dimly remember him as the man who broke your head open and let your memories spill out.\n\n\n    He approaches. This time, his helmet’s off. If you squint against the painful light, you can see his square jaw, his scowling features, and the scar running the length of his right cheek.\n\n\n    “Walk, can this one?” his mastery of your tongue leaves something to be desired.\n\n\n    You finish vomiting, and wipe your cheeks. You stagger backwards, and shake your head. He looks disgusted. You barely have time to flinch before he kicks you in the chest, bowling you over in the snow.\n\n\n    “Get up.”\n\n\n    You comply. He shoves you. The force of the blow sends you sprawling again. You moan feebly.\n\n\n    “Get up.”\n\n\n    You stagger to your feet once more. He kicks your leg out from under you, laughing as he does it. You feel a forest-fire raging just beneath your skin.\n\n\n    “Get up.”", "action_results": [{"action": "Give up", "result": "    He exchanges a fast salvo of words with another soldier, who nods affirmatively. The Centurion withdraws his shortsword, and slits your throat. A slurred plea for mercy dies in your throat, as your lifeblood seeps out into the snow, and steam rises from your wound.", "action_results": []}, {"action": "Stand up", "result": "    He gives you an almost imperceptible nod. You stagger back to the cart, and climb on. Your arms nearly give out as you do so.  Later that night, as you moan softly in an agonized haze, the cart rolls to a halt. The other prisoners look about in confusion, and you wince as the stop causes a spike of pain behind your right eye.\n\n\n    A soldier steps on, and roughly grabs you by the arm. He leads you out of the cart. By the soldier’s torches, you can see into the woods aways. This is farther South than anyone you know has ever been; you’re not even sure what tribes have the right to hunt here.\n\n\n    You fall to your knees, and begin to retch loudly. At this point, there’s no more food or water for you to regurgitate. The legionnaire waits for you to finish, before dragging you back to your feet.\n\n\n    You are half-guided, half-dragged to a clearing in the woods. In the centre of the clearing is a massive stump, where a colossal oak might once have stood. A moonbeam illuminates the stump.\n\n\n    Standing next to the stump are the Centurion, and someone you’ve never seen before. He’s older than anyone else in the procession, and dressed in civilian’s clothes. He’s holding a satchel with tools poking out of it; a bottle of something mysterious, a few hammers, a saw, and a wickedly sharp-looking knife.\n\n\n    Him and the Centurion have a brief, conversation. The old man sounds irritating.\n\n\n    The Centurion clears his throat. “I beat… too hard. Doctor fix this. You fight.”\n\n\n    You nod, and find that the gesture causes a dagger-sharp pain in your head and spine.\n\n\n    The doctor pulls the bottle out of his flask, and passes it to you.\n\n\n    “Two sips,” the Centurion says tersely, “or it kill.”\n\n\n    You take the allotted two sips. A few minutes pass, and you feel whatever medicine is inside the flask begin to take effect. A sudden, irresistible drowsiness comes over you, and you slump forward. You’re only dimly aware of the doctor putting your head on the stump, and withdrawing a small hammer from his belt…", "action_results": [{"action": "Recovery", "result": "    You’re dreaming a dark dream, full of clawed things and concealed blades. You can smell smoke nearby. You can hear a beast growling in a foreign tongue,  inches behind you. You find that you cannot move. The beast’s tongue slithers into your head, worming past your skull and into your grey matter with ease. You can feel its tongue re-arranging your mind, twisting your memories and thoughts. You let out a silent scream as its tongue splits in twain, and begins to worm out your eyeballs…\n\n\n \n\n    ***\n\n\n    You awaken on a remarkably comfortable bed, wrapped in an actual blanket; a luxury you’ve never known. You open your eyes, and wince as light pours into them. For the first time in a few days, you remember your own name.  You also realize what is going to happen to you.\n\n\n    You’re to be taken as a slave, and fed to the Foreign Gods. You’ve heard tales of them whispered around the campfire; bloodthirsty war gods and hedonistic fiends, that can only be satisfied when the blood of innocents are shed on their altars, which stretch all the way up into the heavens. Sometimes, the Foreign Gods even make men fight one another for their sick amusement.\n\n\n    Your cry of alarm dies in your throat. You find that you’re still quite weak. Your feeble hands strain against the shackles around your arms — that’s new. You don’t recall being shackled.\n\n\n    You take a moment to collect yourself, and take in your surroundings. You are in a covered cart,  which is a nice change from the prisoner’s wagon that you found yourself in earlier. You are now in a covered cabin, which you assume is trailing behind one of the teams of horses.\n\n\n    There’s a piece of fabric hanging on the wall with a draft coming through it. Through it, comes the eternally-glowering face of the Centurion. Behind him is an elf with one ear and a scarred mouth.\n\n\n    “This one teach,” the Centurion declares.\n\n\n    “Teach what?” you speak the first words since your capture.\n\n\n    “Language.”\n\n\n    “I’m going to teach you their language. It’s important, for what comes next,” she adds.\n\n\n    “And what does come next?” you groggily wipe the sleep-crust from your eyes.\n\n\n    “The rest of the journey, first of all. Then, you’re going to fight.”\n\n\n    “Who am I going to fight?”\n\n\n    “Whoever you’re told. He’s going to claim you as his personal slave, and put you to work in the fighting pits.”\n\n\n    “Fuck.”\n\n\n    Enya laughs darkly.", "action_results": [{"action": "Arrival at the city", "result": "    On the fourth week of your journey, the city of Florentia Augusta appears on the horizon.  It’s marble structures and statues stretch into the sky; compared to the meagre tents and wooden cabins of your people, it’s an impossibility; a living, breathing paradox, that challenges your worldview purely by virtue of its existence.\n\n\n    Enya, meanwhile, has partially immersed you into the esoteric world of the Imperial tongue. In a month, you’ve learned more tenses, verb conjugations, and gendered nouns (of which there are three) than you’d ever care to learn. It feels like a brutal tongue, with harsh, almost mathematical requirements that dictate the laws of speech.\n\n\n    You’ve grown familiar with a few of the soldiers. Titus wants to marry a baker’s daughter on his return to the Marble City. Magnus looks forward to returning to his family’s ancestral home, to help with the planting season, now that the bitter winter has finally ended.\n\n\n    You sit in the cramped, but more comfortable cart that you first awoke in after your surgery. By virtue of being your tutor, Enya has also been given the privilege of staying in the cart, along with a pile of dusty grammatical scrolls.\n\n\n    The procession of slaves and soldiers travels through rows upon rows of wealthy farmers’ land, moving forward on the viae publicae; the famously well-constructed system of public roads that connect the Imperium from end to end, from the frozen North, all the way down to the never-ending forest of the Frontier.\n\n\n    Surprisingly, the procession of carts and infantry makes a left-turn, instead of heading directly to the city.\n\n\n    “Why are we turning?” you ask of Enya, cautiously trying your new language.\n\n\n    “We’re rejoining the Legion.” she says darkly.\n\n\n    “You are concerned by this.” a flat statement, but meant as a question. Your linguistic skills will improve, with time.\n\n\n    “I am. The last time I joined a Legion, I lost an ear, and my smile got bigger than it ought to be.”\n\n\n    You dip your head in understanding. “I think we’ve had enough language lessons for the day, yeah?” you say after a moment of contemplation.\n\n\n    “You’re not going to be doing much talking.”\n\n\n    ***\n\n\n    Enya leans into you to peer out the small, barred window on your side of the cart. She smells like sweat and fear.\n\n\n    “Fuck,” she breathes.\n\n\n    “What are you seeing out there?”\n\n\n    “We’ve rejoined the legion. There are so many…”\n\n\n    “So many what?”\n\n\n    “So many slaves. Thousands of carts, looks like.”\n\n\n    You try not to think about what kind of life all these people are heading into. “Mostly elves?”\n\n\n    “Some. Northmen, too. A couple of orcs, too; by the gods, I didn’t even think that orcs still existed.”\n\n\n    “What’s an orc?”  You don’t realize it, but you’ve both lapsed back into your mother tongue.\n\n\n    “I’ll tell you later.”\n\n\n    She leans back from the window, apparently satisfied with her surveillance. Suddenly, the cart rolls to a halt. You look out the window, and see an impromptu military camp; tents being rapidly erected, carts being parked, and hundreds of men wearing the red-and-purple of the legion. Coloured banners with eagles, bulls and thunderbolts dot the horizon.\n\n\n    You lean back, and press your head against the wall. You close your eyes, for a moment. Your head still throbs.\n\n\n    “What happens now?” you ask, groaning as another wave of pain washes over your head.\n\n\n    “I expect we’ll be separated, now.”\n\n\n    “Why’s that?”\n\n\n    “They’re not going to have women fighting in the arena. That would be uncivilized.”\n\n\n    You chortle.  Enya smiles. “Hey, thanks for teaching me some of this fucked up language.”\n\n\n    Her smile becomes a grin, albeit one tinged with sadness. Her scars stretch aways up her cheeks. “It’s been my pleasure.”\n\n\n    You reach forward in a handshake. She pushes your hand aside, and pulls you into a surprisingly strong hug. You pull back after a moment. You open your mouth for a second, and then close it; does anything really need to be said?\n\n\n    The cart rocks with the force of someone pounding on it with a gauntleted fist.\n\n\n    “Out!” declares the Centurion. You climb out first, and Enya follows behind you. You find yourselves in a grassy field, in the middle of a now-sprawling military encampment. “Have you taught him the language?”\n\n\n    “I have, sir,” Enya says, dipping her head down and sinking down low.\n\n\n    “Good,” he says, a small smile stretching across his face. He withdraws his sword and points to a line of slaves, off in the distance. “you’re no good as a brothel-girl… go join the labourers.”\n\n\n    She marches off without a protest. Enya throws a worried  glance over her shoulder at you, before shuffling into the line and vanishing completely.\n\n\n    “She’ll be a servus publicus; but I’ve something special in mind for you.”\n\n\n    “And what might that be, sir?”\n\n\n    “She really did teach you.” the Centurion says with a bitter and humourless snort.\n\n\n    “All that could be taught in a month’s time.” the thought occurs to you that he could beat you to death at any time, and none would give you anything more than a passing glance.\n\n\n    “Shut your mouth unless you’re answering a question, or I’ll cut your fucking tongue out.”\n\n\n    You open your mouth in stunned silence. He narrows his eyes. You close your mouth.\n\n\n    “You’ll be my personal slave. Now, I saw you fight, elf; and you were fast. I like that. I’ve had a long and venerable career, and I’m thinking it’s time I retire and get rich. How would you like to make me rich?”\n\n\n    You frown.\n\n\n    “You’re allowed to answer that one.”\n\n\n    “I would like that very much, sir.”\n\n\n    “If you ever say something that sycophantic and pathetic again, I’ll nail you to a cross and let the eagles rip out your guts.”\n\n\n    A crestfallen look falls across your face. The Centurion laughs, then extends a hand. You tentatively shake it.\n\n\n    “My name is Regulus, and we’re going to make each other rich.”", "action_results": [{"action": "A gladiator", "result": "    You bounce the training blade off the slave-boy’s skull. He falls into the sand like a marionette with its strings cut. You scramble into the sand to avoid a heavy wooden club, that buries itself in the ground where you were standing.\n\n\n    You snatch the shield from the boy’s unconscious fingers, and use it to ward off the next blow from the shield. You quickly look up at the burly man with the club, just in time to register his next overhand swing. You scramble to the left, and let him over-swing. While his momentum carries him forward, you slam the wooden sword into his kneecap. He screams in pain and falls forward. You drop the shield, and grip the wooden sword two-handed. You drive the point into the base of his skull, where his helmet doesn’t cover. You feel a satisfying crack as it drives into his spine. He sighs softly, and falls to the ground.\n\n\n    Bloody, wild-eyed and victorious, you toss the now-bloody training blade into the sand, laughing like a man possessed.\n\n\n    A beast of a man emerges from the wooden doors at the far side of the arena. He’s the largest man you’ve ever seen, easily; a dark-skinned giant, who could have stepped out of the sagas of your youth. You would expect a man like that to carry a sword, but he only carries a particularly large tablet. He’s always scratching something into it; from time to time, you wonder what it is he could be writing.   \n\n\n    “The elf never fails to surprise me!” he declares to no one in particular. His voice is jovial and booming.\n\n\n    “I do my best, Horatius,” you say. A wave of exhaustion sweeps over you, as the adrenaline begins to seep away.\n\n\n    “I think you killed that one!” he says cheerfully, pointing to the club-wielder. He’s right; blood is pooling from the man’s eyes and mouth, and his eyes are rolled over into his head.\n\n\n    “I didn’t mean to —“ you begin quickly. He silences you with a wave of his colossal hand.\n\n\n    “He was weak. If he couldn’t see a strike that obvious coming, he deserved to die.”\n\n\n    You nod noncommittally.\n\n\n    “I need to talk to you about something, boy.”\n\n\n    “Aye?”\n\n\n    “You haven’t fought in any games yet, have you?”\n\n\n    “I haven’t.”\n\n\n    “I’d like to change that. How would you like to fight in the Fisherman’s Games?”\n\n\n    “Aren’t those for…” you search around for the right word. The mastery of this foreign tongue still eludes you, sometimes. “experienced fighters?”\n\n\n    “They’re for good fighters,” he says with a mischievous smile, “and you, my friend are definitely one of them.”\n\n\n    “This is an offer?”\n\n\n    He shakes his head. “Only in the polite sense of the word.”\n\n\n    “Then I guess I’ll do it.”", "action_results": [{"action": "A bath and a conversation", "result": "    You enter your chambers. It’s a familiar room, by now. Twelve bedrolls to a row, four rows. You sit down in your designated bedroll, and let out a sigh of exhaustion.\n\n\n    “I hope you wash yourself before you fall asleep,” a familiar voice chides.\n\n\n    You turn to look at the voice, as its owner’s name eludes you temporarily. You look on the childish, perpetually-frightened face of Buchanan. “I’d expect that if I didn’t, you’d knife me in my sleep.”\n\n\n    “Why would I knife you, when you’ve got knives on your ears, friend?” he says with a wicked grin.”\n\n\n    “Fuck off,” you say with a snort. You pull off your sandals. Your tunic slides off after the sandals, carrying with it a flimsy set of scale armour that barely covers your chest.\n\n\n    “Maybe I will. But we’ve gotta chat, first.”\n\n\n    “What about?” undressed, you stand up and collect your armour. You jerk your head to the door.\n\n\n    He follows you out of the chamber and into the courtyard. For a slave pen, it’s fairly spacious. A marble bath occupies the centre of it. There’s a weapon rack on one of the walls. In one corner, there’s a small stall, accompanied by a pile of armour, attended by a one-armed slave.\n\n\n    “Someone told me you’re fighting in the Fisherman’s Games, friend.” Buchanan says with a wry smile. You deposit your clothing on the pile, and nod to the attendant.\n\n\n    “Who told you that?” you say as you walk to the centre of the courtyard.\n\n\n    “A reliable source.\n\n\n    “Was that as you were sucking his cock?” you ask, as you ease yourself into the bubbling, volcanic waters of the bath. You sigh contentedly.\n\n\n    “Laugh if you must, friend. But life has gotten far easier since Tibur and I came to our arrangement.”\n\n\n    You motion for Buchanan to join you in the bath.\n\n\n    “Don’t need it.”\n\n\n    “When did you last train? You reek.”\n\n\n    “Piss off,” he says as he undresses.   \n\n\n    The two of you sit in silence for a moment. The hot water feels like it’s seeping into your overtired muscles, washing the exhaustion out. “So, who else has been selected for the games?”\n\n\n    “You, for sure. The orc, I think — what’s his name?”\n\n\n    “Boris.”\n\n\n    “Aye, him too. Masters’ aren’t sure who the third’s going to be.”\n\n\n    “Who else is good enough?”\n\n\n    “Well, it won’t be me, that’s for goddamn sure.”\n\n\n    “Tibur see to that as well?”\n\n\n    “You know it,” he says with a wry smile.\n\n\n    You lean back, pressing the back of your shaved head against the marble lip of the bath. You close your eyes appreciatively.\n\n\n    “So what’s your story, anyway?” he asks.\n\n\n    “My story?”\n\n\n    “How the fuck you got here.”\n\n\n    “How else? The institution of slavery.”\n\n\n    “Oh, you’re a funny fucker. Seriously, though.”\n\n\n    “I got taken as a prisoner of war by some Centurion. Wound up getting sold to here for a fraction of the cost, but he gets some of the profits.”\n\n\n    “What profits?”\n\n\n    “Well, that’s what confuses me. He beat my head in so bad that his man had to dig through my brain to let the pressure out.”\n\n\n    “Wait, really?”\n\n\n    “Swear on any gods you want me to. He’s gone to a lot of trouble to make sure I survive long enough to get into the Games.”\n\n\n    “Odd,” Buchanan says, as he begins to wash his hair in the bathwater.\n\n\n    A third man joins the bath. You recognize him as Boris, the green orc that you discussed earlier. He grunts as he eases himself in.     \n\n\n    “Afternoon,” he grumbles.\n\n\n    “Well isn’t this just a gathering of the races?” Buchanan remarks.\n\n\n    “How’d practice treat you, Boris?” you ask.\n\n\n    “Short.”\n\n\n    “That’s how we like ‘em,” Buchanan declares jovially.\n\n\n    “Who’d you fight?” you ask of Boris.\n\n\n    “Some man.”\n\n\n    “This man still with us?”\n\n\n    “Aye. But I heard you took a life today,” Boris intones. In your few interactions with him, you’ve noticed something: rare is the day that he speaks in anything other than a slow, ponderous monotone.\n\n\n    “Who’d you kill? You sick bastard!” Buchanan jokes, “I’ve never heard of a gladiator school with a killer in it!”\n\n\n    “I’m afraid to disappoint you, mate, but it wasn’t intentional. Hit him weird, and it must have jolted his spine too hard.”\n\n\n    Boris grunts, and leans back in the bath. You notice a scarred-over burn on his chest.\n\n\n    Buchanan notices it, then turns to you with a cocked eyebrow.", "action_results": [{"action": "Ask about the scar", "result": "    “Someone in the arena give you that?” you ask, motioning to the scar with one finger.\n\n\n    “Different arena,” he responds.\n\n\n    “How so?” Buchanan chimes in.\n\n\n    Boris exhales through his flat nose. “My people’s laws are… different. We don’t practice slavery, and we don’t have prisons. If you do something wrong, you’re paying in pain.”\n\n\n    “What did you do wrong?” you ask, curiosity piqued.\n\n\n    “I bashed someone’s head, after they were… unchivalrous to my sister,” he smiles slightly.\n\n\n    “And they give you that for a fight?”\n\n\n    “No,” he grumbles, as his smile begins to spread across his face, “they gave me that for a murder.”\n\n\n    “Gods, how brutal are you people?” Buchanan asks in mock-horror.\n\n\n    “Hopefully you never find out.”", "action_results": [{"action": "New Page", "result": "    Before you can speak any further, Horatius enters the courtyard, wearing his usual disarming grin. “Rejoice, my brothers! Three of you are about to have a great honour! The three men heading to the Fisherman’s Games have been decided.”\n\n\n    You look up from your conversation, as does Boris and Buchanan. The rest of the gladiators, and the slave attending the armour-pile all look at the big man in anticipation.\n\n\n    “Our three lucky, lucky souls, are going to be Buchanan, that wiry bastard I’m sure you all know and love.”\n\n\n    Buchanan punches the ground. \"That son of a whore let me blow him, then he fucking lied to me!\" \n\n\n    “That’s not all, however! We’re also going to be bringing along our favourite elf, and our… cherished orc friend.”    \n\n\n    You feel the collective relief of everyone not selected. Strangely, no one finds the prospect of being cut open for the amusement of screaming peasants and horrified aristocrats particularly appealing.\n\n\n    “If you’re one of our lucky contestants, come talk to me. Immediately. That’s all, go back to your duties.”\n\n\n    You climb out of the bath, and approach Horatius. The water drips down from your body to the tiled floor. He looks you up and down, as Buchanan and the orc climb out behind you.\n\n\n    “So, are you fine folks ready to put on a good show?”\n\n\n    “Always.” Boris grumbles, robbing you of the chance to speak.\n\n\n    “That’s what I like to here. You lot are dining with me and the Masters tonight; go talk to him over there,” Horatius jerks a thumb to the one-armed slave, “and get some decent clothes to where, why don’t you?”\n\n\n \n\n***\n\n\n    That night, you dine in fine fashion.\n\n\n    You, along with Boris and Buchanan, lay on long couches with purple fabrics draped over them. There’s a table of food in front of you, with richer food than you’ve ever tasted; grapes, nuts, pieces of sugarcane, thin-sliced beef and pork, along with goblets of wine, perpetually refilled by slaves.\n\n\n    “How would you like to eat like this every day?” Argos asks of you. One of the two owners of the gladiator school, he hails from the senatorial class. You can tell he’s no stranger to the corridors of power, just from how calculated his mannerisms are. He’s a shrewd old man with features like an eagle, and the predatory instincts of one, too.\n\n\n    “I could get used to it,” Buchanan says cheerfully, stuffing his face full of spiced pork.   \n\n\n    “As well you should,” the other Master responds. You know little of him, save for his apparent dislike of interacting with others, and the fact that he bears the name “Gavrill”. You’ve never seen him around the ludus; and this is the first word you’ve heard him speak. “If you fight well, you could earn a handsome fortune.”\n\n\n    “There’s something else to be gained, as well,” Argos says meaningfully, “If you fight well, and you continue to fight well… you have your freedom to win.”\n\n\n    “What if I just like fighting?” Boris asks, uttering his first words of the evening.\n\n\n    “Then you’re in the right place,” Argos says with a smile. He snaps his fingers, and a slave steps forward; a girl, human, and no older than fifteen. She proceeds to wash his hands, and wash Gavrill’s hands as well. When she finishes, she washes yours.\n\n\n    “Everyone leave, save for the elf,” Gavrill says bluntly. There is no refusal, of course; he snaps his fingers, and the meal is over. Even the slave-girl leaves. Alone in the dining hall with Gavrill and Argos, you feel their eyes burrowing into your soul, ripping your intentions and thoughts apart, like an eagle would a piece of meat.\n\n\n    Argos clears his throat. “An elf gladiator stands to be very profitable, as I’m sure you know.”\n\n\n    “The Centurion understood this,” says Gavrill.\n\n\n    “As do we. If you win these Games, it will be an upset like never before. Men and orcs fight, but elves are something else entirely. The crowds will snap it up like hungry dogs,” Argos drops his voice and looks around, “But I’m sure you already know this. What you don’t know, is that the Emperor, in his infinite wisdom, has seen fit to modify the game’s this year. Not only will they be to the death, they will also be to the last man. That is, you’ll be fighting your teammates, should they survive as long as you.”\n\n\n    The weight of this presses down on your back. You’re not sure how you feel about murdering your allies.\n\n\n    “We tell you this, of course, in absolute secrecy,” Gavrill says, narrowing his eyes, “because it would be in everyone’s interest if you won these Games, and we feel that you can.”", "action_results": [{"action": "Time passes", "result": "    The night before the Fishermen’s Games, you rest uneasily. You and your team were carted off to a slave-pen on the other side of the city, closer to the forum where the Fishermen’s Games will be held.\n\n\n    It doesn’t feel like a slave-pen, however. It feels like a luxurious room. You and your teammates have been provided with a room separate from the other contestants; bought and paid for by the seemingly-infinite coin of Gavrill and Argos.  The Masters have also paid for an armed guard (an ex-gladiator, himself) to be posted outside the room, to avoid any last-minute “roster changes”.\n\n\n    You wonder if it would be best to tell your teammates. After all, full transparency might make them more likely to watch your back. If they don’t know the true nature of the Games, you might be at a tactical advantage, however.\n\n\n ", "action_results": [{"action": "Tell them the true nature of the Games", "result": "    Guilt wracks your mind as you lay awake. “Lads, they’re not being straight with us.”\n\n\n    “When are they straight with us?” Buchanan asks amusedly.\n\n\n    “They’re rarely as crooked as this. We’re supposed to be a team, right?”\n\n\n    “Right,” Boris rumbles, revealing that no one in the room is asleep.\n\n\n    “But if we survive the initial slaughter, they’re going to pit us against each-other like dogs.”\n\n\n    “What?” Buchan asks, sitting up from his bed.\n\n\n    “Aye. This is the kind of bout where only one man gets to walk away, I’m afraid.”\n\n\n    “Those sons of whores!” Buchanan curses. He punches an expensive pillow.\n\n\n    “Unsurprising,” Boris murmurs, “but shitty.”\n\n\n    “So what’s the plan, then?”\n\n\n    “We fight like devils,” Buchanan says flatly.\n\n\n    “And then? Are we willing to kill each other for their amusement?”\n\n\n    “We already do,” says Boris.\n\n\n    “I told you this because I didn’t want to stab you in the back, lads. It’s wrong to turn on your allies like this.”\n\n\n    “You could have just kept that information to yourself, it’s true,” Buchanan admits. Boris rumbles affirmatively.\n\n\n    “We shouldn't  fight each other, should we survive. We throw down our arms and tell them all to get fucked.” you continue.\n\n\n    “I’m all for defiance, but I’d rather not get killed in the process,” Buchanan argues.\n\n\n    “If they kill the winners of a bout, they’ll have a riot on their hands. No way they can kill us, not without it costing them.”\n\n\n    “So what now, then?” Boris asks.\n\n\n    “I say we try and get some sleep. We’ve still got to survive this fucking thing.”", "action_results": [{"action": "Fighting side-by-side", "result": "    You, Boris and Buchanan stand shackled to each other by the ankles, at the far end of a marble forum. All that separates you from the crowd calling for your blood is a line of private guards (likely slaves themselves), paid for by the Censor arranging the games.\n\n\n    There are seven other teams of three, shackled similarly to you and your team. They are equally spaced along the rectangular perimeter of the forum.  At the end of the forum opposite to you is an ornate ivory chair, upraised on a wooden platform. Upon which sits the Censor, who has organized these games and paid for them out of pocket. He nods to the crowd, upon which several men begin to distribute loaves of bread, which are quickly torn apart. A fervour begins to rise.\n\n\n    He raises a hand for silence. “In the name of the most gracious gods, who preside over us all. And in the name of the Emperor, whose infinite wisdom leads the Imperium into greater prosperity each year. On this most festive and holy of days, I demand that you fight!”\n\n\n    The forum descends into chaos.\n\n\n    You stick close to Boris and Buchanan as you move into the throng of bodies. Hot blood sprays across your face as you shove your spear into a man’s neck. Someone screams to the right of you; you turn, and see Boris flinging the broken body  of a man like a discarded toy.\n\n\n    You sidestep a heavy-looking sword, and riposte with a quick thrust into a man’s bare chest. You rip open a gash in his soft, exposed flesh. He staggers backwards, and someone finishes him off with a trident to the neck.\n\n\n    Your arms grow weary. You begin to back out of the throng. A vicious-looking barbarian, painted in blue, notices you.\n\n\n    “Your head is mine, elf!” he screams, charging at you. He leaps into the air and swings an axe at your neck. He moves with breathtaking speed, but the chain around his ankle quickly grows taught. He falls to the ground, and you quickly bury your spear in his side. He lets out a soft moan as his lifeblood spills out onto your sandals.\n\n\n    You hear Buchanan scream in pain. You turn, and see that he’s been knocked to the ground. A burly orc is strangling him, and his struggles are weakening by the second. You stab the orc in the shoulder, but it only enrages the thing, which looks more like a monster than a man. It lets Buchanan fall to the ground, but picks up its bloodstained axe off the ground, and squeals at you.\n\n\n    Boris slams his club into the side of its head, killing it instantly. The force of the blow warps its skull, and causes its head to forcibly rotate into an unnatural position. As it falls to the ground, you look around the makeshift arena, and realize that only one opponent remains. He’s frantically trying to free himself from his shackles by chopping the feet off his dead teammates with a hatchet.\n\n\n    You turn to the crowd in a grand gesture, relishing their applause. Then, you throw your spear like a javelin. It tears through his side, and he screams in agony and drops his hatchet. You watch as he pulls the blade out from his torso, only to invite a fresh torrent of blood. He bleeds to death while futilely trying to stem the bleeding with his fingers.", "action_results": [{"action": "A shocking victory", "result": "    The crowd erupts into a clamour. They praise you like the gods themselves.  The Censor raises his hand for silence.  “Fair citizens, are these games not to the death?” he asks.\n\n\n    The implication is obvious. A stunned silence falls over the crowd. Buchanan smiles grimly, and turns to you. “We’re really doing this?”\n\n\n    “Aye,” Boris rumbles, before throwing his club across the forum. The crowd gasps.\n\n\n    You realize that you’re unarmed, and raise your arms in an exaggerated shrug. The crowd laughs uproariously.\n\n\n    Buchanan eyes you both suspiciously. “You’re a couple of madmen,” he declares, before he, too, throws his blade away.\n\n\n    This act of defiance is met with screams and applause. The uproar grows again, and a wave of joyous celebration ripples through the crowd. The Censor raises his hands for silence, but he’s ignored amid the cheers; the people are drunk on celebration.\n\n\n    “Kill them!” he screams. Only two of his slave-soldiers hear, but they gladly comply; they break formation and begin to march towards you with terrible intent.\n\n\n    The celebration turns to rage. The crowd throw themselves against the shields of the guards, screaming profanity and curses at the Censor. Fists and rocks are thrown at the guards, who struggle to keep the crowd at bay with beatings.\n\n\n    “Stop!” he bellows. The two soldiers halt in their tracks. “It would appear, the people have spoken!’\n\n\n    The guards manage to shove the crowd back. For now.\n\n\n    “… And the Fisherman’s Games shall have three winners!”", "action_results": [{"action": "A victor's reward", "result": "    “That was an impressive show you put on,” Argos says with surprising humour. Both his hands are folded underneath his toga, but you can imagine that they’re clenched fists. “I had hoped it would unfold differently, but alas… one cannot always predict these things.”\n\n\n    The meeting-room, where you shared a dinner with Gavrill and Argos, is now bare. It looks like a dungeon cell. The thought strikes you that it would be a good place for a murder.\n\n\n    The door swings open. Gavrill enters. His face is flushed red, and he looks positively less civil than Argos. Argos raises cautionary hand to him. “Calm yourself, brother.” he advises.\n\n\n    Gavrill sighs. “You three must understand that insulting the Censor reflects quite poorly on us.”\n\n\n    “They’re not idiots. You do understand this, correct? You know what it looks like when two wealthy men cannot control their slaves?” Argos turns his pointed gaze to you.\n\n\n    “I — we, understand.” you say, nodding submissively.\n\n\n    “And yet, we would be idiots to punish you for this act.” Argos continues. Gavrill looks like he’s been struck. “For you have earned us a tremendous amount of coin, you just don’t know it yet.”\n\n\n    “And how is that?” Gavrill asks cholerically. You’re beginning to understand why Argos insists on managing their affairs himself.\n\n\n    “This display of loyalty is… it’s downright chivalrous!” Argos declares, laughing. “The people love it. A team of fighters, but also a team of best friends. It’s a novelty, even moreso than a team with only one human on it. The people will love it…”\n\n\n    “And the Editors of the Games will pay for them to appear,” Gavrill concedes.\n\n\n    “Precisely, my dear brother. The question shouldn't be ‘how do we punish these men?’. The question should be ‘how do we reward these brave, profitable souls’.”.\n\n\n    Argos turns his shrewd gaze to you once more. “What do you want, dear elf? If it’s within reason, I can make it so.”", "action_results": [{"action": "Ask for women and wine", "result": "    You ask for women and wine, of course.\n\n\n    A small villa is constructed next to the ludis. Slaves are purchased for your enjoyment. Some pour wine, but most just sleep with you when you request it. In exchange for shedding blood and thrilling the people, Argos and Gavrill fulfill your every bodily need. Men, women, elves, orcs. It doesn’t particularly matter. For the rest of your days, wine is given out as freely as lovemaking.\n\n\n    You’re still a gladiator, but you’re a comfortable one. When you return from a particularly brutal training bout, you simply have your servants drag a seat into the sun and fill you a cup of wine, and you watch the clouds drift lazily by…\n\n\nTHE END", "action_results": []}, {"action": "Ask to be the best fighter on the Continent", "result": "    Your request is simple. You ask to be the best.\n\n\n    Tutors are brought in from across the known world. In time, you develop your own unique school of fighting, centred around the defensive use of the spear, along with weaponizing every part of your body.\n\n\n    As your prowess grows, Argos and Gavrill eventually see fit to recall you from the Games entirely. You live comfortably, teaching the new slaves how to survive in the arena, and put on a damn good show doing it.\n\n\n    Being an elf, you naturally outlive Gavrill and Argos. At the end of his life, however, Argos sees fit to give you one last gift; your freedom. He buys you out from Reuglus, and makes you your own man.\n\n\n    You leave the ludi soon after, and depart the city. You live out the rest of your days teaching the newly-formed Science of the Spear to anyone who can pay your exorbitant fees. You train gladiators, auxiliaries, and the sons (and one daughter) of the wealthy.\n\n\n    You live out the rest of your days on your own villa in the country, with dozens of slaves and hundreds of acres of land to your name, the first elf in the Imperium to do achieve wealth of this kind.\n\n\n    When you finally die, you do so rich, and content.\n\n\nTHE END", "action_results": []}, {"action": "Ask for vengeance", "result": "    Your request confuses Gavrill and Argos, at first. You ask for the elves of your tribe to be brought to the gladiatorial school. They comply; the women are brought on as servants, and the men are taught to fight.\n\n\n    This proves to be their undoing.\n\n\n    They fail to notice the conversations in Elfin that end when they walk by. They fail to notice the growing resentment in their slaves. They fail to notice how you’ve taken a special interest in molding your people into effective killers. They fail to notice that you've even trained the women how to fight. \n\n\n    When Regulus arrives, you give the signal. The Centurion, now a much older man, has come to survey his investment (and perhaps purchase a few fitting men as mercenaries).  You give the centuries-old hunting cry of your people, and you all seize arms from the armoury.\n\n\n    The confused guards die in seconds, their throats gashed by the lightning-quick ambushes of enraged elves.\n\n\n    Regulus tries to run. You stab him in the back of the heel, crippling him. You beat his head with the butt of your spear, like he beat you, so many years ago. He’s coughing blood, and his tongue has been severed by his own teeth by the time you finally slit his throat.\n\n\n    You have the immense pleasure of cornering Gavrill and Argos. For all they’re benevolence, they still own you, and they still made you fight. You kill Gavrill first, by gashing his throat open. Argos lunges forward with a knife produced from his toga, but you trip him onto the floor, and plunge the spear into his heart. His last look is one of intense surprise.\n\n\n    You wish that Boris and Buchanan were there, in the end. But while you voluntarily stayed, they took their freedom.\n\n\n    A warning bell is rung. The survivors of the massacre all gather round you. Some clutch swords, others axes. Some fight with their bare hands, or a piece of discarded wood. Some are holding training weapons.\n\n\n    Even as the legionnaires kick down the door, you know one thing to be true.\n\n\n    You have spilled the blood of those who wronged you. You are vindicated.\n\n\nTHE END.", "action_results": []}]}]}]}]}, {"action": "Keep it a secret", "result": "    The marble  forum is empty, save for the eight teams of combatants.  Each team consists of three men, who are lashed together by the feet to discourage cowardice.\n\n\n    The crowd is bigger than you could have imagined. It feels as if every working-class freeman, citizen, and slave has gathered around to watch the slaughter that is sure to unfold.\n\n\n    An upraised seat on one end of the arena has been erected for the Censor overseeing the games. He’s an austere-looking man with grey hair and a large belly, and a flowing toga.\n\n\n    He raises a hand.\n\n\n    You glance at your compatriots. Boris looks disturbingly at ease, nearly nude, save for his roughly-hewn breechcloth. He holds a thick club of oak over his shoulder like a farm-slave might hold a plow. Buchanan’s expression is imperceptible underneath his bronze helmet. You can see the gooseflesh on his bare chest, and you can see that his fingers are white from how tight they clutch his sword and shield.\n\n\n    You try to steady the shaking of your hands as you clutch your spear like a protective charm.  You were allowed to paint yourself blue, in the custom of your people; a screaming, painted barbarian is good for the crowds, after all.\n\n\n    “In the name of the most gracious gods, who preside over us all. And in the name of the Emperor, whose infinite wisdom leads the Imperium into greater prosperity each year. On this most festive and holy of days, I demand that you fight!” The Censor’s voice booms out across the forum, and over the crowd.\n\n\n    For a brief second, there is silence.\n\n\n    The scream of the crowd and the scream of the gladiators’ charge nearly deafens you. Twenty four men collide in the centre of the forum. You enter a trance. You are dimly aware of the screams of dying men, and the sound of flesh tearing. You hear the rattling of chains, and the collision of armour.\n\n\n    You jam your spear into a man’s throat, turning his jugular into a red geyser. You’re blue and red, now.\n\n\n    You shove the butt of your weapon into someone’s nose, stunning him just enough that Boris’ gargantuan club can crush their head like a discarded piece of fruit, sending juice spraying all over you.\n\n\n    Someone scraps your forehead open with a knife. You turn, just quickly enough to see a spear-tip pierce their cheek, rip through their tongue, and punch out the other side.\n\n\n    The fighting ends in a few minutes. You stand amid a slew of ruined corpses; some of them gasp for air, unaware that they’re already dead. Weapons and discarded shields litter the forum. A stunned silence falls over the crowd.\n\n\n    And then they scream.\n\n\n    And then you scream. You let out a blood-curdling war cry that frightens and excites you. You look around the arena for something else to kill.\n\n\n    Your eyes fall on Buchanan. He’s alive and well, but breathing heavily, and he has a gash running down his side. He looks sadly at the corpse of Boris, who has a short-sword still lodged in his jugular.\n\n\nYou grab your spear and raise it, and then you remember; the charade of teamwork is still in place. You quickly shove the point into a wounded man’s jugular, pretending that the coup-de-gras was your intention all along.\n\n\n    You bask in the chants of the crowd.\n\n\n    “Blood-elf! Blood-elf! Blood-elf!”  they chant, throwing their fists in the air.\n\n\n    You look down, and realize it’s true. You’re covered in a thick, sticky layer of blood, so much so that it nearly covers the paint you wore into battle.\n\n\n    The Censor raises his hand in a pacifying gesture. The crowd falls into silence. “Fair citizens, are these games not to the death?”\n\n\n    Buchanan stares at you. You don’t make eye contact, and instead look at the chain connecting your leg to his.\n\n\n    “There are two contestants remaining! My friends, we have one more fight to watch!” the Censor continues, “So, gladiators! Put on a good final show, why don’t you?”\n\n\n    You swing your spear like a club, aimed at Buchanan’s head. When he steps back to avoid the blow, you kick your leg back, tugging on the chain. He loses his footing, and slips backward. He dashes his head against the marble, rattling his helmet.\n\n\n    You easily parry his half-hearted sword swing, and run his arm through, right at the joint. He screams in pain and drops the sword. You pull the spear-tip out, and toss the weapon aside. You pull his helmet off, and pick up his blood-stained sword off the ground. Raising one hand to the crowd and the Censor, you hold the sword to his throat.\n\n\n    “Death! Death! Death!” the crowd chants. They throw their fists in the air, thumbs upraised.\n\n\n    You turn to the Censor. He nods.\n\n\n    “Sorry, mate,” you say to Buchanan, before hacking into his throat with the edge of the blade. He gurgles, and uselessly paws at your legs. You withdraw the blade, then hack at his neck again; this time, you slice his head clean off.\n\n\n    His bloodied head lands with a schlick as it hits the blood-stained marble face-first.\n\n\n    “Blood-elf! Blood-elf! Blood-elf!”", "action_results": [{"action": "A champion's story", "result": "    You awaken, covered in sweat. Across from you, naked, and in a tangle of sheets and covers, is a woman whose name you can’t quite place. You take a moment to admire her features; a smattering of freckles across her cheeks, short blonde hair, and a small nose. Some aristocrat, who’d paid well for the privilege.\n\n\n    You step out of bed. Already you can feel your nerves building. You drop yourself to the floor, and do a few dozen push-ups to calm your nerves.  You’re sweating, now. You step outside your chamber, leaving the woman to sleep. You didn’t touch a drop of anything except for water last night, but you expect that she will be wrestling with a hangover all day.\n\n\n    You leave your house, and step out into the yard of your villa. You dip yourself into your hot-water bath for a few moments, washing the sweat off. Eventually, you step outside and let yourself dry off.\n\n\n    You look to the gate in your yard. Chained, but from the outside. You’ve always found that amusing.\n\n\n    Someone will be around in your chariot, with your weapons and armour. You sit on a marble bench until such time, watching the clouds. They don’t take long. Soon, the gate opens, and a nervous-looking freeman enters, carrying your belongings. You put on the leather armour, and don your shield and sword. You loop your belt through your helmet’s eye-socket for now.\n\n\n    As you leave, he stops.\n\n\n    “You have a client?” he asks.\n\n\n    “Yeah, but she’ll be asleep for hours yet. This won’t take long.”\n\n\n    He nods, and you both step onto your chariot. The man drives you through the streets of the Capital. You whip the crowd into the frenzy, blowing kisses and slapping hands as you’re driven by.\n\n\n    Soon, you arrive at the Coliseum. The grandest arena on the Continent by far, it’s a massive amphitheatre that forms the centre of culture for the entire city. When there aren’t gladiatorial games, it regularly hosts dramas and sporting matches of a less lethal variety.\n\n\n    The bouts before yours are all boring. Only one man is killed, and it’s an anticlimactic death; he bleeds to death after sustaining several minor injuries. When you step out into the sands of the arena, twirling your sword, you can feel the hunger of the crowd.\n\n\n    Your opponent steps out. His casualness is unnerving. He carries his trident like a walking stick. The weighted net in his off-hand, he twirls.\n\n\n    “Good morning, sir!” you say jovially. The crowd laughs.\n\n\n    “And good morning to you!” he responds.\n\n\n    You both stop, halfway across the arena, and salute the Emperor. After your salute, you sweep the tip of your blade across the crowd, whipping them up into a maddened state.\n\n\n    “Blood-elf! Blood-elf! Blood-elf!”\n\n\n    You flash your opponent a charming smile, before donning your helmet. When the helmet hits your head, the crowd falls silent; most have seen you work before. They know that the blood is soon to follow.\n\n\n    You bound across the arena and leap at him, plunging your sword towards his neck like a swooping eagle’s talon. He dodges with the grace of a bullfighter. The crowd gasps.\n\n\n    You twist, and avoid his thrust to your abdomen. You lash out at his neck, but he steps back, just in time for your blade to sail harmlessly through the air. He reaches out, and beckons you forward. Your blood begins to boil.\n\n\n    With a scream, you charge forward, keeping your shield in front of your chest. You shield absorbs his blow, and you stab outward at his exposed chest. He twists, but not fast enough; you scrape his chest open. His blood trickles down to the sand.\n\n\n    “Nice shot,” he bellows. The crowd laughs. You don’t respond.\n\n\n    He thrusts at your neck, but you scramble out of the way. Your riposte scrapes across his armoured forearm.\n\n\n    You swing your shield at his head. He ducks low underneath the swing, and stabs at your gut. You dash to the side, only to find that there’s a net blocking your path.\n\n\n    You fall into the dirt, wrestling with the net; you find that it’s impossibly heavy, and the harder you struggle, the more you become tangled.\n\n\n    “Let’s hope they’re in a giving mood,” he says, as he stomps on your right hand. It breaks two of your fingers, and forces you to drop your sword. He places a foot on your chest, and slowly lowers the trident to your neck.\n\n\n    Much to your horror, the crowd is more than happy to accept a new champion.\n\n\n    “Death!” cries a lone voice. The cry is taken up. “Death! Death! Death!”\n\n\n    Your opponent looks to the Emperor, in his high up seat. The Emperor extends his fist, and sticks his thumb into the air.\n\n\n    “Sorry, mate,” he says as he pulls off your helmet. You struggle like an animal in a trap, but he stomps on your chest, knocking the wind out of your lungs. As you gasp for air, he shoves the trident into your throat. You gurgle, spit, and ineffectually claw at the net.\n\n\n    Your head lolls to the side. You’re dimly aware of your blood spilling out onto the sand, and your killer waving his arms to his adoring audience.", "action_results": []}]}]}]}]}, null]}]}]}]}]}]}]}]}, {"action": "Hunt together", "result": "    You regard the defiant, scarred elf for a moment. “Not necessarily.”\n\n\n    “How so?”\n\n\n    “We’d probably catch more if we worked together, yeah?”\n\n\n    “Don’t think that’s how it works,” she says with a scoff.\n\n\n    You think on this, for a moment. “Yeah, you’re probably right,”  you say, before turning to depart into the forest.\n\n\n    She pulls on your arm. “Doesn’t mean we can’t go together, though.”\n\n\n \n\n***\n\n\n \n\n    Your arrow pierces the rabbit’s throat, killing it instantly, and pinning it to the ground. You break from your hiding place in the snow to retrieve the arrow, and tie the rabbit to a piece of rope that holds three other rabbits.\n\n\n    “Nice shot,” Enya says, motioning to the rabbit with her thumb, “right in the neck.”\n\n\n    “What can I say? I have a gift.” you say, grinning. You wipe the blood off the tip of your arrow, and stuff it back into your quiver.\n\n\n    She looks into the sky, and measures the sun’s progress against her fingers. “It’s nearly midday. Should probably head back, yeah?”\n\n\n    “Haven’t shot anything big yet, though.” your mouth still waters at the thought of  a piece of venison.\n\n\n    She grinds her foot into the snow. “Think it might be best for us to head back.”", "action_results": [{"action": "Head back to camp with Enya", "result": "    “Aye, you’re right,” you say, frowning slightly.\n\n\n    “Ah, cheer up. We’ll bring down an elk or something tomorrow. Besides, I would have kicked your ass anyway.” she unstrings her bow, and you do the same. You rest the bow over your shoulder, along with your spear and three rabbits.\n\n\n    “I seem to notice that I’ve three rabbits, and you have two.” you say mockingly,  as you begin to head back to camp.\n\n\n    “Maybe so, but I caught a squirrel.”\n\n\n    “No way a squirrel’s worth a rabbit. It’s half the size.”\n\n\n    “But it’s harder to hit.”     \n\n\n    “I’m sure all the hungry children back at camp will be pleased to note that your measly little squirrel was hard to hit.”\n\n\n    “I’m sure they will appreciate my expert marksmanship, thank you very much.”\n\n\n    “I’ll believe it when I see it.”\n\n\n \n\n***\n\n\n \n\n    As you approach the camp, you take a deep breath of the crisp winter air. It’s tinged with far more smoke than usual; something is terribly wrong.\n\n\n    You drop your kills into the snow, and immediately begin to string your longbow again.\n\n\n    “What’s wrong?” Enya hisses, dropping down into a crouch.\n\n\n    “Smells like a wildfire down there.”\n\n\n    “Maybe they lost control of a cooking fire?”\n\n\n    “Or maybe it’s a fucking raiding party.”\n\n\n    Her eyes widen, and she, too,  begins to string her bow. Soon, the two of you ghost through the snow-covered forest until you reach the clearing. Your suspicions are immediately confirmed. One of the tents is on fire. A couple dozen tribespeople are kneeling in the snow, and heavy iron manacles are being placed on them by stern-faced legionnaires with short-swords and tower shields.\n\n\n    “They’re being taken,” you whisper.\n\n\n    “I can see that.”\n\n\n    “We’ve got to stop them!” you knock an arrow.\n\n\n    “We cannot fight them! There are a bunch of them, and two of us.  If you give away our position, we die. We need to leave, and we need to do it now.\"", "action_results": [{"action": "Fight the legionnaires", "result": "    You loose the arrow. It strikes true, hitting a legionnaire in the throat. He sinks to the ground, clutching uselessly at his ruined neck. The rest of the soldiers move with frightening efficiency, even as you and Enya begin to fire arrows at them.\n\n\n    You manage to fell another, and strike one man in the exposed forearm before they assemble into a formation. Three huge, interlocking shields form an impenetrable barrier to your arrows. Four men in the back cover the heads of the two rows, so that they form a formidable shell of iron.\n\n\n    Then, with a slow and terrible deliberateness, they begin to march forwards. You see the wild-eyed terror in Enya’s eyes.\n\n\n    “Run.”", "action_results": [{"action": "Fight to the death", "result": "    “I’m not running,” you mutter as you drop your bow to the ground, and grip your spear two-handed in front of you. You leap over the snowbank, ready to fight the foreign interlopers who dare to invade your lands and shackle your people.\n\n\n    The iron turtle approaches, muttering its arcane, guttural marching-chants. Blades reach out from behind shields like sharp teeth.\n\n\n    You shove your spear through one of the gaps in the shield-wall. It bounces off a breastplate. Two shields slam shut, trapping your spear. You pull, but it’s hopelessly stuck.\n\n\n    Meanwhile, two men leave the back of the formation and begin to flank you. You drop the spear and draw your knife. You look to all sides like a wounded predator, as the phalanx circles in.\n\n\n    You scream as a white-hot blade buries itself in your thigh. You fall to the ground, and lash out at your assailant with your hunting knife. It scores across his exposed cheek, and he screams in pain. The blade remains stuck in your leg.\n\n\n    You try to stand as another soldier circles in. He easily catches your forearm as you stab at him. He holds it aloft in a crushing grip.\n\n\n    “Submit.”\n\n\n    You shake your head. He nods, and there’s a glimmer of respect in his eyes. He slits your throat, and drops your gurgling carcass to the snow. The last thing you see is a crimson pool forming around you, before you drown in your own blood and fear.\n\n\nTHE END", "action_results": []}]}, {"action": "Run", "result": "    You do as she says.\n\n\n    You turn tail and run into the woods, as fast as your legs can carry you. You leave the burning camp in your midst, leaving your people to whatever fate the legionnaires have in store for them.\n\n\n    Eventually, your legs can carry you no further, and you collapse into a snowbank, panting like an exhausted dog. You close your eyes and lean back into the snow, letting the cold seep in. You close your eyes…\n\n\n    \n\n***\n\n\n \n\n    You awake to a boot on your stomach. You quickly open your eyes, expecting the worst. Thankfully, it’s Enya. She scowls at you. Her eyes are red and puffy, and you can see red lines on her cheeks.\n\n\n    “We need to leave.” she says tersely.\n\n\n    You climb out from the snow, shivering. The two of you leave the burning camp behind, until the smell of smoke is gone, and you can no longer hear the sound of women being ravaged by legionnaires in front of their husbands and children.\n\n\n    You and Enya share a painful memory, and find it easy to part ways after a few weeks. Eventually, you depart the lands entirely, in search of a new tribe.\n\n\n    In time, the Imperium grows ever northward in its search for slaves and land. As its numbers swell, the trees are eventually stripped away, and the entire North succumbs to the might of the Eagle.\n\n\n \n\nTHE END.", "action_results": []}]}]}]}]}]}