{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=43993", "context": "", "first_story_block": "\"Life is pain, death is Oblivion, the only choice left to you by the will of the Dark Gods is how much you can endure. I grant peace. Embrace me.\"\n\n\nThe words ring in your ears as the darkness calls out to you. All you can do is focus ahead, waiting for dawn and a chance to wake up. \n\n\nYou sit cross-legged on the rocky obsidian floor, patiently waiting. You try your hardest to block out the world around you, focusing on your deep, heavy breathing. Giving the nightmares and daemons attention just encourages them. Showing fear is spilling blood in the water. Although the nightmarish pale sky grows darker with every second as black tendrils thousands of miles wide spread out across the sky hundreds of miles above, blocking out what little comfort you receive from the white sun, you don't feel fear. This is just one of the many nightmares that plague you every night. You'll live.\n\n\nThe darkness begins to solidly into a wave, smashing towards you. You're surrounded by the liquid darkness, which drowns out anything even close to light as it consumes you.\n\n\n\"The ever-gaping maw of the void calls,\" the darkness whispers. \"I'm coming from you.\"", "action_results": [{"action": "Light emerges", "result": "You writhe tossing the sheets off you as you lie in bed, panting. Another nightmare. Another night of horrors, terrors and daemonic voices screaming at your soul. You take a deep breath. Focus. In. Out. In. Out. You rest your head against the pillow, sighing. \n\n\nSuddenly, Fay appears in the doorway, wearing combat armor, scratching at her short hair.\n\n\n\"Morning,\" she says.", "action_results": [{"action": "\"Morning, Fay. Well, last night was fun.\" (Romance)", "result": "\"Yeah, it was,\" Fay smiles. \"Are you sure you're OK?\"\n\n\n\"Perfect,\" you say, climbing out of bed and tossing the sheets off your naked frame, as Fay wolf whistles.\n\n\n\"Go fuck yourself,\" you say, walking into the bathroom.\n\n\n\"If I could do that, I wouldn't keep you around,\" Fay replies with a chuckle, as you walk into the bathroom.\n\n\nYou stand, and quickly walk to the bathroom. You stare at your reflection in the bathroom mirror, taking a deep breath as the voices start. \n\n\n\"Aren't you curious? Does Fay really love you? Or is she using you?\"\n\n\n\"You're a Psyker. A nice steak, the embrace of a lover, the joys of the material world is nothing compared to what I can offer you.\"\n\n\n\"Alexander died, Alexander was buried, Alexander returneth to dust. The same will happen to you. Embrace the rot and decay that comes with life.\"\n\n\n\"Kill! Maim! Burn! Kill! Maim! Burn! Kill! Maim! Burn!\"\n\n\nYou're gaining a certain level of familiarity with the daemons in your head. Now that Meliodas has vanished, more has come to fill your head. You've began naming them, one of the few ways you think you'll remain sane with them. Question Mark constantly tempts you with knowledge. Fucky tempts you with fantastic pleasures beyond compare. Rotgut is the embodiment of laziness, and makes you want to lie in bed in your own filth, and Smiley is just fucking bonkers.\n\n\nTzeentch's Keys, you miss Meliodas.\n\n\nYou quickly get dressed, before calling Fay. She opens the door, strolling inside.\n\n\n\"Hey, Karth,\" she smiles.\n\n\n\"Is she planning on betraying you? Is she loyal? You don't know... but I do,\" Question Mark says. \n\n\n\"Slit her throat, rape the stab wound and feel the blood run down your arm as you devour her throat! Feel pure blissful sensation!\" Fucky whispers.\n\n\n\"Embrace your pestilence. You are filth. You are decay. But that is OK. You are still loved,\" Rotgut says.\n\n\n\"BURN! MAIM! KILL!\" Smiley screams.\n\n\nFay raises an eyebrow, rapping her knuckles against your head.\n\n\n\"Hello, anyone in there?\" she asks.\n\n\n\"More than you know,\" you reply.\n\n\n\"Meliodas back?\"\n\n\n\"New guys. At least there's some variety.\"\n\n\n\"Are they saying anything about me?\" Fay smiles.\n\n\n\"Cunt! Take her fucking head!\" Smiley screams.\n\n\n\"I think they like you,\" you reply, as Fay laughs.\n\n\n\"You sure you're OK?\" \n\n\n\"Tip top,\" you reply.\n\n\nThe barrage of voices screams answers in your head, as you take a deep breath. Fay kisses the top of your head, looking at you.\n\n\n\"Karth, come on, come back to me,\" she says.\n\n\n\"I'm fine,\" you reply, as Fay gives you a concerned look.\n\n\n\"If you're sure,\" she asks nervously. \"Come on, we need to get to the war room for the morning meeting.\"", "action_results": [{"action": "Head to the war room", "result": "After a five minute walk, you arrive at the war room. The others are already there. Captain Hayes smokes in the corner, Primus appears as the upper half of a robotic body that only exists for something to focus on when talking, seeing as he literally is the ship, Durge sits in his seat, gently feeding pieces of meat impaled by his spike-arms to the rats infesting his stomach, Elios is involved in some heavy petting with one of his guards, Elizabeth reads, Castus and Fay are bickering and Cain sits in his chair, patiently waiting.\n\n\n\"Morning, gents,\" you say, sliding into your seat. \"We need to get around to sorting out control of the ship now that Kyros is dead. We don't have time to celebrate.\"\n\n\n\"We have an issue,\" Primus says.\n\n\n\"What?\"\n\n\n\"Drake Amadeus. His guards aren't replying, so I sealed off the bridge. We need to go investigate.\"\n\n\n\"Who was on guard duty?\" Elizabeth asks, curiously.\n\n\n\"Padfoot and Prongs,\" you reply. \n\n\n\"They're hard men. They wouldn't not respond,\" Fay says.\n\n\n\"Isn't there cameras on the bridge?\" Hayes asks.\n\n\n\"They're offline. Most likely from sabotage. Possibly from a malfunction,\" Primus says.\n\n\n\"Let's go investigate, then,\" you say.\n\n\n\"Let's do it,\" Fay nods in return.", "action_results": [{"action": "Find Drake", "result": "You find yourself standing by the sealed door to the bridge. You wait patiently, your hands writhed in purple flames, while Fay raises her bolter.\n\n\n\"Ready?\" Primus asks.\n\n\n\"Do it,\" you say, as the doors open. \n\n\nYou quickly move inside and see the situation. Padfoot lies on the ground, a shiv made from a shard of ceramite impaled in his neck. Prongs sits in the corner, his bolter in his hands. Both his eyes have been stabbed out repeatedly. \n\n\n\"Holy shit,\" you say.\n\n\nProngs immediately aims his bolter at you as he lets out a shout. You telekinetically tear the bolter from his hands, tossing it aside.\n\n\n\"Shit! Karth?\" he asks, terrified as Fay runs over and grabs him.\n\n\n\"Shit, Prongs! Are you OK?\"\n\n\n\"I'm alive. Check on Padfoot!\"\n\n\nYou quickly float over to Padfoot, but he's long dead. \n\n\n\"He's gone,\" you say.\n\n\n\"Fuck. Bastard took my eyes! He's still here! You need to find him!\"\n\n\n\"We'll get you bionic eyes, Prongs, I promise,\" Fay says. \"That's something that can be done?\"\n\n\nYou nod, scanning the room for Drake. You move forward slowly, passing the Navigator's chair. You see Drake sitting off in the corner, a cigarette in his mouth he looks at you, nodding.\n\n\n\"Hey,\" he says nonchalantly. \"How's your tribal whore? Has she grew any tits yet?\"\n\n\nYou quickly levitate over, grabbing him by the throat and lifting him into the air.\n\n\n\"You son of a bitch! You killed my men!\"\n\n\n\"I thought I had a chance at escape,\" Drake shrugs. \"You shut this section off before I could.\"\n\n\nYou let the fire run along your hands, tickling his throats, as he yelps.\n\n\n\"Hey! You can't kill me, dumbass! We've been through this! You kill me, you're fucked. You torture me, I'll just kill you and me next time I'm navigating rather than endure a life of torture!\"\n\n\nYou punch him, knocking his head against the wall, before letting him drop to the ground. Tribals enter behind you, grabbing him and binding his hands.\n\n\n\"Repair the cameras. Increase security for him,\" you sigh to one of the Tribals. \n\n\n\"Yes, sir,\" she replies.\n\n\n\"You know, you could add a bunch of security features, but I'd find a way around it. You want me to stop trying to escape, all I ask is a few more luxuries. Access to alcohol, drugs and smokes, access to one or two... comfort ladies,\" Drake smiles, despite the blood dripping down from his broken nose.", "action_results": [{"action": "Improve Drake's security", "result": "With the addition of magna-locks, a tighter schedule, more guards, a more advanced camera system for the bridge with multiple back-ups and fail safes, Drake is more secure. He's unhappy about it, and promises to slit your throat, but hell, what the fuck is he going to do? Try escape again? A dozen Tribals, pissed off about what Drake did to two of their men, have scared Amadeus into submission.\n\n\nBy the time you sort out Drake’s security measures, which involves dealing with Drake for far longer than any man deserves, you move on to doing all the inane, normal tasks that you now need to deal with like deciding rations, sending out crews to clean up the ship, assigning guards and all the other things expected of you. Unlike Fay, Cain, Castus, Elios, Durge and Captain Hayes, all of whom absolutely despise their new workloads, with Castus even suggesting a new system of anarchy where the only rule is anyone found filing something is to be shot, you actually like it. Olive, Primus, Elizabeth and you all find a certain level of peace in it. The mental challenges and problem-solving you have to deal with has a certain calming element on your mind. By the time it’s finished, it’s fairly late. There’s a night and day cycles on this ship, with the lights brightening and dimming to have a twenty four hour cycle, which stretches a bit long for you compared to home, but with a mid-day nap is manageable. You wonder what world the ship’s cycle aligns to. Perhaps whatever world Kyros came from. \n\n\nFay opens the door, walking inside.\n\n\n“Karth, it's dinner time,\" she says. \"Better hurry up. We want to eat early so we have the evening to discuss the important issues.\" ", "action_results": [{"action": "Go eat", "result": "The meal is prepared by a mix of slaves, mutants with culinary abilities and the intelligence to follow orders, talented cooks taken from the soldiers aboard the vessel and a given few actual chefs hired for the role. Given that fact, the food’s not too bad. Grox ribs in some spicy sauce, some wild vegetable taken from some alien world, with a large brown stalk that’s boiled, sliced up and eaten, these gigantic nuts that are smashed open and eaten, some canned “Cheese” that tastes like… well, it doesn’t taste like cheese, to say the least. All this is paired with either wine or harder liquors, with you taking the former. Fay downs a bottle of fruity alcohol that could kill a weaker man. By the time you’re finished, everyone’s stuffed and most are atable little tipsy. You make the natural move from the dining room to the war room, and soon find yourself ready to debate the future of the ship.\n\n\n“So, what do we have first on the planner, Primus?”\n\n\n“War! We go to war! KILL! KILL! KILL! OBLITERATE!” Smiley screams.\n\n\n“There’s a certain appeal to the life of a raider, isn’t there? Feel the joys and pleasures of the depraved…” Fucky suggests.\n\n\n“Little one, I am more than happy to help. I have a plan to perform a ritual that will give you access…” Question Mark begins suggesting.\n\n\n“Lay down your defenses, let the corruption and decay set in,” Rotgut says.\n\n\nYou take a deep breath, trying not to let the fact that your head is filled with voices that quickly delve into an argument show. \n\n\n“We have several important issues,” Primus mechanical tone says. “First, we need to find a suitable replacement for the ship’s Tech Priests who once operated it. That should be our number one priority. Then, we need to take care of Kyros’ former allies.”\n\n\n“Allies?” you ask.\n\n\n“While much of Kyros’ forces, all who directly answered to him, at least, were aboard this vessel, he had amassed a larger force in which he hoped to invade the Imperium. He had made pacts with several forces. These allies could attempt to wipe us out in diligence to their old ally. Fortunately, we expect it’ll be some time before they muster up a force to attack us, if ever.\"\n\n\n\"What else?\"\n\n\n\"We have a large amount of reports,\" Primus says.\n\n\nA former-slave worker walks inside, holding a big stack of files that he dumps on the table. Typed documents are alongside large reports written in beautiful writing alongside hastily scrawled notes. The stack holds everything from troop psych reports to statistics about your flight wing to estimates about your wealth in various alien currencies.\n\n\n\"What the fuck is that?\" Fay asks.\n\n\n\"These are the files and reports on our current situation. Thankfully, these have been simplified to the extreme to something that you all can actually comprehend. There's three big, circled figures, labeled Strength, Morale and Funds. See them?\"\n\n\nYou look at the top of the files, nodding as you see the numbers.\n\n\n\"The Strength figure refers to the military strength of your forces, in a percentage. 100 means that you're the exact strength of Kyros' fleet during the times just before the mutiny, 50 would mean half strength of it, 200 would be twice the strength. The Morale figure is the general morale of the forces under your command, with 100 being incredibly happy crew to the point of being unbearable, and 0 being a crew that's only refraining from slitting your throat out of fear. The Funds figure is the amount of funding you have in your control, with every unit representing a million Thrones.\"\n\n\n\"Understood,\" you say.", "action_results": [{"action": "Continue", "result": "\"Well then, now that we have that done, we need to decide what is to become of the ship,\" Durge says.\n\n\n\"Seeing as the ship is now conscious, it would rather you not decide what becomes of it,\" Primus says out of the speakers.\n\n\n\"Does someone want to explain why the fuck we have an AI running the ship?\" Castus says.\n\n\n\"I've explained it to you,\" Primus says.\n\n\n\"Yeah, well fuck it,\" Castus says. \"I'm still confused why you're in charge.\"\n\n\n\"Primus, what exactly do you want to become of you?\" you ask curiously.\n\n\n\"Honestly? I don't mind. As long as I'm put to use. Fifteen thousand years had played havoc on my memories. I know longer remember any of my justifications or motives other than a need for freedom. Now that I'm free, I'm more than happy to help all of you. But, I want it known that I am free, and my opinion matters.\"\n\n\n\"Of course,\" you say. \"Now, it seems we have a divide here. Chaos, Guardsmen and Slaves.\"\n\n\n\"So it seems,\" Elios says.\n\n\n\"What is it everyone here wants?\" you ask.\n\n\nThe Staine siblings quickly begin discussing this quietly.\n\n\n\"We do plan on continuing as a Chaos War-band,\" Durge says.\n\n\n\"Most of my men want to continue our lives as soldiers, but honestly? I'm no thinker. I'm no planner. I'm a killer. We stay with the ship, let you two factions fight it out,\" Captain Hayes says. \"I imagine I'll form a similar relationship with the new captain of this vessel as I did with Kyros, if with more generous terms for me and my men.\"\n\n\n\"Are the \"slaves\" unified in their goal?\" Elizabeth asks.\n\n\nYou look to your allies. Cain shrugs, looking towards you.\n\n\n\"I like Hayes' approach to life. Karth is the commander,\" Cain says.\n\n\n\"I trust Karth to speak for my people's interest,\" Fay says. \n\n\nOlive stares at you while Castus continues playing with his knife.\n\n\n\"Yeah, let's roll the dice. I think Karth should have the ability to speak for me... up until he says something stupid,\" Olive says.\n\n\n\"Well, we're the three Chaos leaders,\" Elios says. \"So...\"\n\n\n\"Chaos leader?\" a deep, dark, gurgling voice says. \"What a note to make my entrance on.\"\n\n\nYou turn quickly, to see Kyros standing there, smiling. His face is clawed and cut apart with an eye missing, his arm is now a bloody tentacle of muscles studded with bone, his other arm now sporting a huge bone claw, his body torn apart. Most of his throat is missing, a bloody crevasse where it once was. He looks like he's been chewed apart and spat back out, before being mutated.\n\n\n\"Hello, Karth, my little protégé,\" he says.", "action_results": [{"action": "Attack", "result": "You fire a bolt of energy, but Kyros sidesteps it with unnatural speed. By now, all the various leaders are standing, their weapons raised.\n\n\n\"How did you pass my sensors?\" Primus asks.\n\n\n\"Please,\" Kyros laughs. \"Did you not think my powers are strong enough to do so?\"\n\n\n\"How the fuck are you even alive, Kyros?\" you ask.\n\n\n\"Kyros? Ha! Kyros was a petty fool. Don't you recognize me, Karth?\"\n\n\nYou shake your head, still ready to engulf him in flames.\n\n\n\"No? You don't remember my little voice in the back of your mind? I am Meliodas,\" Kyros says, taking a bow.\n\n\n\"What?\" you ask.\n\n\n\"Oh, it was simple. I've wanted to take a form in this world for some time. I helped you, paying close attention, seeing potential, and assisted you as best I could. Fortunately, as you fought Kyros, I saw his mental defenses weaken during the fight between you and him. As he lay dying, the mutants at his throat, he was broken. I easily possessed his form, devoured his soul, and killed those stupid mutants with my daemonic powers.\"\n\n\n\"You're a daemon?\" Elios asks.\n\n\n\"Damn right,\" Kyros, or Meliodas, says.\n\n\nYou take some time to explain who Meliodas is to your other lieutenants, but soon they understand. After some extensive questioning and psychic testing to ensure that this is in fact Meliodas, he takes a seat at the table.\n\n\n\"What are you doing?\" you ask.\n\n\n\"Well, I helped advise Karth. I'm one of his best advisors. Surely I deserve a place here?\" Meliodas says.\n\n\n\"I suppose,\" you say.\n\n\n\"Give him a seat. Us Chaos followers could use an extra vote for our side,\" Durge says. \"Now, can we continue?\"\n\n\n\"Don't hold off on my account,\" Meliodas grins.\n\n\n\"Alright, let's be realistic, shall we?\" Elios says. \"We're Chaos. We worship the Dark Gods, corrupt, parlay with demons, all that shit. We're not changing. We also know that we've lost a shit-ton more men because of little sis' rage against us, so if this comes down to a civil war, we're all dead and you win.\"\n\n\n\"Go on,\" you say.\n\n\n\"So, we have two options. Option One: You keep control of the ship,\" Durge says. \"We'll serve under you as long as we see fit, but we most likely don't leave, and we decide our path forward as a group.\"\n\n\n\"Option two: you abandon the ship to us,\" Durge says. \"We find you a world of your choosing, a little paradise world far from the reaches of the Imperium or any other enemies. It'll be our gift to you. You can pick out the world, we'll transport any who want to go there to it as well as all you'll need to survive and build a large, happy community. You'll be able to peacefully retire and live out the rest of your lives, never worrying about this ship or the battles it will fight.\"\n\n\n\"One moment,\" you say, pulling your lieutenants together. \"So... What do we think?\" \n\n\n\"Eh,\" Cain grunts.\n\n\n\"We're not going to abandon this ship, are we?\" Olive asks.\n\n\n\"This is a massive war machine. We should stay.\n\n\n\"I'm not adverse to settling down,\" Fay says. \"But we could take the ship anyway. With control of the ship, we could carve ourselves a little empire. Nothing on the level of Kyros' aspirations, but hey, better than our ancestors could ever have dreamed of.\"", "action_results": [{"action": "Keep control of the ship", "result": "\"We'll stay,\" you say, as Durge nods.\n\n\n\"Well... this'll be interesting,\" Meliodas grins, twisting Meliodas' daemonic face.\n\n\n\"Alright,\" Elios grunts. \"What's next on the agenda?\"\n\n\n\"The ship,\" Primus says. \"Or me, for lack of a better word. I have gotten it running to a degree and it's capable of travel, there's no way it will be able to hold up in a fight or operate long-term.\"\n\n\n\"How do we fix it?\" you ask.\n\n\n\"The death of the Tech-Priests has left us lacking men specialized to repair the ship. I've found three groups that could hypothetically fulfill that role, as well as two other solutions.\"\n\n\n\"Go on,\" you reply.\n\n\n\"There is the Rutherford-Dalton-Boyle Think Tank, a faction hidden away in several space stations, researching and creating in the gas giant of Ingenium-IV. A good negotiator should be able to convince at least some of them to leave their stations to come aboard the Roar of the Vortex to continue their research aboard our vessel as well as having access to huge archives of intelligence here, being able to research the ship and maintaining that the technology isn't lost.\"\n\n\n\"Who else?\" you ask, \n\n\n\"The Iron Smiths of Daeranthium. Daeranthium is a planet that contains several ancient factories and forges, with massive amounts of resources such as huge, ancient mines. The planet, while tribal in culture, are advanced enough to produce weapons, vehicles, armor and more for the Imperium. We could attempt to negotiate with them to take some of their men aboard to fulfill the role of engineers.\"\n\n\n\"And the final group?\"\n\n\n\"The Dark Mechanicus is Chaos' version of the Adeptus Mechanicus, whether it be those from the Adeptus Mechanicus who went rogue and were corrupted by Chaos, or those recruited by them. Their work requires manpower that they don't have. I've found reports of a Dark Mechanicus group known as the Harbringers of Menedez. They've already made a reputation for selling slaves trained with skills such as the ones we desire. For five million Thrones, we could have them soon to fulfill the required role.\"\n\n\n\"You said you have two other options. What are they?\"\n\n\n\"Option one involves the funding an education program to educate the mutant workers. For ten million Thrones, we could educate the mutant population. They wouldn't be as experienced as other options, but quantity has a whole quality all it's own.\"\n\n\n\"And...?\" you say before Primus interrupts you. The\n\n\n\"Option two is more cruel. We have the technology and cybernetics taken from the dead Techpriests and Servitors. If you were willing to lobotomize a few of the mutant workers we have, the least intelligent and productive, to create a new legion of servitors under my control. This would be cheap, effective and we could have it done in the night to avoid breaking night, framing it as accidents. So, which option shall it be?\"", "action_results": [{"action": "Visit the Iron Smiths of Daeranthium", "result": "You walk down the landing ramp, looking out at the large walls that surround the massive factory-city. Nude men wander around, covered in grease and holding large tools. Fay walks out of the landing, a shoulder-mounted camera and speaker on her to give Primus a place to speak and see.\n\n\n\"Well... I guess they're nude. What a lovely view, am I right, Karth?\" Fay smirks.\n\n\n\"You grew up in a tribe of nudists,\" you remark.\n\n\n\"Yeah, but that was when I was little. Now that I'm post-pubescent, I can appreciate the view.\"\n\n\nYou flick your wrist, sending her tumbling to the ground.\n\n\n\"Asshole,\" she laughs, oping back to her feet.\n\n\nA thick, burly, oil-covered man walks forward from the crowd of workers, a huge wrench in his hands.\n\n\n\"What?\" he grunts.\n\n\n\"My name's Karth. I...\"\n\n\nYou see a brawl emerge from the crowd to your left. Two massive workers begin to fight, their massive fists smashing into each other with an astonishing strength. They let out howling shouts as more men join into the fight. The leader strides forward with a growl, swinging his wrench and smashing a few men in the head, forcing them to crumple to the ground. Soon, the fight ends with a bunch of injured men lying on the ground.\n\n\n\"Sorry 'bout that,\" the leader says. \"One of the boys thought Chef gave him too little meat. You know how men are. The name's O'Neill.\"\n\n\n\"You know why we're here?\" you ask. \n\n\n\"You wanted to hire some of my men, huh? This Primus fella or whoever the fuck I talked to cleared it up with me,\" O'Neill asks. \"I can get it done. We've been having a population explosion. But I want something in return.\"\n\n\n\"Go on?\" you ask.\n\n\n\"My men are taken care of. Good medical treatment, free food, rooms and drink, and I mean men's drink, not milk and honey-shit, as well as payment for their work done. In exchange, I'll give you all the men you need. We gotta deal?\"", "action_results": [{"action": "Agree", "result": "\"Yeah. We have a deal,\" you say.\n\n\n\"Good. I'll have the men told, see which ones want to go and lead them all to the vessel. Then, I'll have them informed on their new jobs. Done?\"\n\n\n\"Done,\" you say, grasping his hand and shaking.\n\n\nIn the next few weeks, you learn that while the famed Iron Smiths of Daeranthium are good at their jobs, they have... issues. They're violent, aggressive drunks prone to picking fights with the more peaceful members of the crew. While these actions don't take away from their work, it does lead to serious morale issues emerging, although these can be dealt with. Still, the Iron Smiths do their jobs. That's all you really need.", "action_results": [{"action": "Next", "result": "Now that you're finished working on repairing the ship and its back to full abilities, you have another issue. You restock at a nearby outlaw planet, trading much of Kyros' personal wealth in order to outfit and repair the ship, which is made simple with Primus' help. Ship operation seems actually fairly simple. As long as Amadeus is under your thumb and the military might is yours, you'll be fine. Most of the hard work required is done by Primus. With those two, you're golden.\n\n\nOne of the main issues, though, is the mutants. As your slaves have all been wiped out or had joined up with one of the war-bands, Kyros or your forces during the mutiny, mutants are now filling in most of the crew roles aboard this vessel. The thing is, they're getting antsy about their position, wanting more power and a say in the decisions of the vessel. Reports say that a mutant known as John the Hermit is leading the mutants, inciting dissent and rallying the masses of mutants.\n\n\nAlthough the mutants are seen as an irrelevant issue by most, you know that's not the case. They're tough, with naturally mutated weapons, and there's massive numbers of them. If they're genuinely organized and inspired by this John the Hermit, they could easily take the ship when you're at low strength.", "action_results": [{"action": "Have John the Hermit assassinated", "result": "You have an elite group of Tribals sent down into the catacombs of the ship with the objective of killing John the Hermit. Comm reports show that they're wiped out to the last man, but not before carving a bloody path through the mutant horde, ending with John the Hermit's death before they're finally overwhelmed. Unfortunately, John the Hermit goes down with a strength you've rarely seen among the best of men, let alone a wretched mutant. As John the Hermit was engulfed in fire by a flamer blast, his skin crackling, his flesh cooking and his bones melting, he gave one of the most impassioned speeches you've ever seen, urging the mutants to not give up and continue with the rebellion as planned.\n\n\nWith that, the mutants rise up. You're simply unprepared for the scale of this rebellion. John the Hermit must have been planning this for decades, behind Kyros' back. Stores of ammo and weapons, hidden in stockpiles in the parts of the ship that hadn't been searched in millennia, are unearthed, as many of the functions of the ship cease as the mutants stop working. While your forces have better training, better equipment, better everything, as it has been said before, quantity has a whole quality of its own. The endless mutant hordes, entirely willing to die for their cause, all willing to martyr themselves as John the Hermit did.\n\n\nAs you stand in the war-room, surrounded by an army of mutants, burning dozens as lightning runs along your fingertips and psychic blasts kill all who could hope to oppose you, the mutants begin to overwhelm you. As their tentacles, hands and claws bring you down, tearing you apart, you have a brief musing about how similar this is to Kyros' death.", "action_results": []}, {"action": "Have John the Hermit brought to you", "result": "You sit in your war-room, waiting patiently. The room has been done up quite nicely now that you're in charge. The head seat at the table is a black, marble throne, with Magos' Cern's skull and Chapter Master Taj's head hanging from the red banner behind you, the banner emblazoned with the stark, spiky symbol vaguely shaped like the spear that once represented the Uwais tribe. You lieutenants are around you, Fay sitting directly to your right in an ornate red chair, with the upper half of the humanoid robot that Primus uses as his \"face\" to talk to to your left. Cain sits in a massive chair, a massive cooked carcass in his hands that he devours. Across from him sits Captain Hayes, who you've situated near the air vent to avoid choking on the ever-present smoke that emanates from the ever-present lho-stick clenched in his teeth. Olive and Castus are at the end, across from each other, which leads to an endless amount of bickering between the intelligent, pragmatic Olive and carefree, happy, impulsive Castus. You're all set up entirely to scare and intimidate John the Hermit when he enters. The Staine Siblings are off to the side with Meliodas, with Durge chewing on a rat carcass, Elizabeth reading, Elios waiting impatiently and Meliodas pacing the room. Hopefully, it'll work.\n\n\n\"By will of the people, I ascend to the chamber of the Gods! I will beseech them as a poor, twisted food, by will of the people!\" a voice cries, as the door is pushed open. \n\n\nTwo Kasrkin soldiers stand next to John the Hermit. The mutant prophet is a horrible, wretched creature. His spine is twisted, making him a hunchbacked creature. The ring and pinky finger of his left hand is fused together, as is his middle and index finger, giving it a crab claw-like appearance. His other hand is different, a literal engorged crab claw, covered in a thick chitin, looking able to crush a man in half. His face is twisted and mismatched, with only a few oversized teeth in his mouth, one eye much larger than the other and a squashed nose that looks akin to it having been badly and repeatedly broken. His back is misshapen, covered with a thick chitin like that of a crab's being more akin to a shell than a human's back. \n\n\n\"With my own two eyes! With my own two eyes I see the supposed gods!\" he says, walking forward with a strange look on his face that you can't decipher thanks to his deformities. \n\n\n\"Are you the man known known as John the Hermit?\" you ask.\n\n\n\"The man? No, no, not at all. I am the beasts, a simple creature twisted by your inaction,\" John the Hermit says bitterly.\n\n\n\"My inaction?\" you ask.\n\n\n\"Have you seen what freaks we've become? Nuclear waste from reactors aren't cleared off, even though we haven't used nuclear reactors for millennia! Malnutrition! Lack of medical attention! There used to be slaves who were constantly tortured and brutally forced to work, and we envied them!\"\n\n\n\"What is it that you want exactly?\" Primus asks.\n\n\n\"Who is it that runs this vessel?\" John the Hermit asks.\n\n\n\"I do,\" you reply, looking briefly at Primus and the others for any signs of dissent.\n\n\n\"By what right do you claim to be leader? By will of the people, by democracy's gentle guiding hand, I am the rightful leader!\" \n\n\n\"By right of force,\" you reply.\n\n\n\"Ha! I'd wager my army of malformed brothers against yours any day! We have the numbers, we have the will, we have the power to take this ship!\" \n\n\n\"Did you come here to make threats and promise me you'll take over?\" you ask, as your fists set alight.\n\n\n\"I came here to offer you a deal. John the Hermit is no leader. John the Hermit is a simple man. I just want a boost in our standards of living. Running water, good food, actual bedrooms, human rights!\" he says.\n\n\n\"Primus, how much would that cost us?\"\n\n\n\"If we were to raise the mutant standard of living to those described by John the Hermit, it would cost, and this is a rough, fluctuating estimate, twenty million thrones.\"\n\n\n\"That's doable, is it not? A few million Thrones to ensure your one at the head of this vessel? It's good, yes? I also want a place at your table, as an advisor, so I can continue speaking for my mutants. With this, we'll stay your humble servants.\"", "action_results": [{"action": "Set the mad hermit alight and be done with it", "result": "You fire a burst of flames. Unfortunately, John the Hermit goes down with a strength you've rarely seen among the best of men, let alone a wretched mutant. As John the Hermit was engulfed in fire by a flamer blast, his skin crackling, his flesh cooking and his bones melting, he begins to roar at you.\n\n\n\"You'll pay for this injustice! We'll rise up, crush you and break free! We'll rule the galaxy!\"\n\n\nIt's only a few hours before the mutants learn what happened and rise up. You're simply unprepared for the scale of this rebellion. John the Hermit must have been planning this for decades, behind Kyros' back. Stores of ammo and weapons, hidden in stockpiles in the parts of the ship that hadn't been searched in millennia, are unearthed, as many of the functions of the ship cease as the mutants stop working. While your forces have better training, better equipment, better everything, as it has been said before, quantity has a whole quality of its own. The endless mutant hordes, entirely willing to die for their cause, all willing to martyr themselves as John the Hermit did.\n\n\nAs you stand in the war-room, surrounded by an army of mutants, burning dozens as lightning runs along your fingertips and psychic blasts kill all who could hope to oppose you, the mutants begin to overwhelm you. As their tentacles, hands and claws bring you down, tearing you apart, you have a brief musing about how similar this is to Kyros' death.", "action_results": []}, {"action": "Agree", "result": "\"Fine. A place at my table, and a rise in conditions. Is that acceptable?\"\n\n\n\"Yes, most certainly, captain. The chalice of the gods has been spilt, and mine are happy to lap up what drips out. Most certainly,\" the mutant grins.\n\n\n\"Thank fuck! Now, are we finished with all these mindless fucking issues?\" you ask. \"Primus, I need some rest. You're in charge of the ship, Primus.\"\n\n\n\"Good to know I'm in charge of myself. I was having a free will crisis up until that order,\" Primus says, in what you assume could be a joke.\n\n\nWith that, you walk out of the stress-filled shit-hole, to take relax.", "action_results": [{"action": "Relax", "result": "You find yourself in Kyros' extravagant chambers, filling a large stone bath. You quickly get undressed, lowering yourself in the water as you feel heat run through you, and the aching pain hits you briefly.\n\n\n\"Fuck,\" you grunt.\n\n\nYou've been doing too much physical activity. You forget you're a skinny kid devoid of muscles sometimes, besides a powerful destroyer of worlds. You take a deep breath, before briefly submerging yourself in the water. You lift your head out, feeling your long hair grow heavy with water. You grab a long knife from the edge of the bath, and quickly begin to hack away at your hair neat and tight. \n\n\n\"You OK, Karth?\" a voice calls.\n\n\nYou stare out, spotting Fay entering the room.\n\n\n\"Yeah, I'm OK,\" you reply, running your wet hands over your scalp.\n\n\n\"You cut your hair?\" she asks.\n\n\n\"Yeah, it was getting long. I hadn't noticed, but Kyros didn't exactly keep us well groomed. I guess you don't get bothered by the smell of teen spirit if you were always dealing with rotting corpses, mutants shit themselves and the smell of your ideals slowly rotting.\"\n\n\n\"I suppose so. I've not cut my hair either. I just have one of the Tribals braid it. So, do you want company for your little bath?\"\n\n\n\"Isn't that the only reason I keep you around?\" you smile.\n\n\nFay gives you the finger, before she unclasps the tunic-type thing she'd been wearing, letting it fall away. You sit in the warm water staring at her for a minute, admiring her strong, muscled form, her gorgeous, ample... \n\n\n\"Hey shaman, lift your jaw, you seem to have dropped it,\" Fay laughs, dropping into the water with a loud splash.\n\n\n\"We stuck in a spaceship without windows drifting through the endless void known as space. You can't blame me for admiring a view when I have the chance.\"\n\n\nFay laughs, smiling.\n\n\n\"It's not like you haven't seen it before. In fact, if I recall correctly I was naked the very first time we met.\"\n\n\n\"Oh yeah. Nearly forgot about the fact that I have a filthy Azajaja leading my Uwais boys.\"\n\n\n\"Hey, I've hunted with the Uwais, fought alongside the Uwais, killed for the Uwais. You spent your time just sitting on a pillow, except when I was around to carry you.\"\n\n\n\"I enjoyed the former way more than the latter,\" you say with a smirk.\n\n\n\"Are you saying you don't want me here?\" Fay says, fake-pouting.\n\n\n\"No. I need to relax, and I'm sure bathing with you will prove... relaxing.\"\n\n\nFay gently leans over to you, lying on your lap.\n\n\n\"Was bathing all you were planning?\" she smiles.\n\n\nAdmittedly, the rest of the night is quite the stress-reliever.", "action_results": [{"action": "The Next Day", "result": "You watch as a group of Tribals spar. One of them, a bare-chested man in a gas mask, smashes one in the head, before grabbing one and flinging him against the ground.\n\n\n\"Now, kill! Break! Obliterate!\" Smiley yells.\n\n\n\"Why does he wear a gas mask?\" you ask one of the training supervisors.\n\n\n\"Who, Opie? Dude's in charge of explosives for his squad. Has a penchant for gas attacks.\"\n\n\n\"He's impressive.\"\n\n\nA dull, monotone voice comes out of the speaker, drawing your attention.\n\n\n\"Karth, there's a meeting in the war room,\" Primus says.\n\n\nYou sigh, and head to the war room. Five minutes later, you find yourself in the war room. Hayes, Elizabeth, your girlfriend Fay, Castus, Olive and John the Hermit are there.\n\n\n\"Where's everyone else?\" you ask.\n\n\n\"I'm here,\" Primus says. \"I just didn't bring in my \"body\" because I won't be participating in this conversation much,\" Primus says, referring to the robotic upper body that Primus uses to help people know where to focus when talking to him.\n\n\n\"Why not? Why are we even here?\"\n\n\n\"We're here to regulate, or not regulate, drug usage among the population. That doesn't exactly effect Primus. Durge's Nurglites don't do them, the Goliaths don't do them, and who the fuck knows where Meliodas is? That leaves us,\" Elizabeth says.\n\n\n\"What about Elios?\" you ask.\n\n\n\"Elios threatened to... \"stab me in the throat and fuck that stab hole\" if I tried prohibiting his \"freedom\".\"\n\n\n\"Yes! I like this man! Follow  his example!\" Fucky says.\n\n\n\"Alright, let's get it done, shall we?\" you ask.", "action_results": [{"action": "Begin", "result": "\"What's first, then?\" you ask. \n\n\nElizabeth grabs a metal, torso-shaped rig covered in syringes and medical equipment onto the table.\n\n\n\"This is called a chem rig. Pioneered by the Morallians in the Eastern Fringe, picked up by various mercenaries, and now heavily used on this ship. The rig is outfitted with several syringes filled with either medicines or light drugs such as the adrenaline-based Pulse, the sedative Sacred and a few other things. It's not been researched to any degree, but there appear to be no short term effects. Still, it could be dangerous long term. Soldiers buy these to increase their combat efficiency, so it can be of help to us.\"\n\n\n\"The gladiators use it. It's effective,\" Olive says.\n\n\n\"I've seen my Tribals use it as well. It helps, but it does tend to lead to the start of heavy drug usage that can go downhill.\"", "action_results": [{"action": "Ban", "result": "\"Ban it,\" you say.\n\n\n\"Alright then,\" Elizabeth says, looking down at her notes. She fumbles through her pockets, pulling out two packets. One of a white, granular powder, the other is a brown one, looking like grinded up dirt. \"Here we have Zap and Dirt. Zap can be snorted, eaten or drank with alcohol to perk up energy levels and increase reaction time, while Dust is inhaled to improve your senses. These drugs DO have a few negative effects. Mood swings and some minor mental problems with the former, respiratory issues with the latter. There's not very popular, but only as it's fairly new and we haven't stopped at ports recently.\"\n\n\n\"Thoughts?\" you ask.\n\n\n\"I don't have enough research to formulate an opinion,\" Elizabeth admits.\n\n\n\"Allow Zap! That shit's good!\" Castus says, finally paying attention, before getting distraction by a smudge of... something on the table.\n\n\n\"Perhaps its effect on mental health are really serious. I mean, look at Castus,\" Olive says.", "action_results": [{"action": "Ban", "result": "\"Ban,\" you say. \"What else we have?\"\n\n\nElizabeth fumbles through her bag once more, pulling out a small, black vial. She places it on the table.\n\n\n\"Reaper,\" she says. \"It's just arriving from the Black Aces War Band.\"\n\n\n\"What's it do?\" you ask.\n\n\n\"It gives users a huge confidence boost and immunity to pain, faster reflexes, a faster heart rate and adrenaline for a small period of time. It's very dangerous, though, only used in bad situations. It has a 10% fatality rate, but it's VERY effective in battle.\"\n\n\n\"That stuff leads to serious health issues,\" Fay points out.\n\n\n\"Very effective, though. Shockingly so,\" Castus says.", "action_results": [{"action": "Ban", "result": "\"Ban it,\" you say.", "action_results": [{"action": "Continue", "result": "Your mass banning of the combat drugs prevent morale from falling due to any issues with that, although it does lead to a sharp drop in combat efficiency of your troops. Still, that's life. At least your men are safe.", "action_results": [{"action": "Continue", "result": "\"Next are the more recreational drugs. The first is a familiar vice: alcohol. Although the light beers and wines are too invaluable for the ship to ban, as since the crew drinks them, they’re boiling the water before they’re used in brewing these drinks, hence stopping disease from spreading due to the very unsanitary water in many parts of the ship. Still, harder liquors, like the spirits, the harder beers and the venom shit that that’s so common on the vessel are simply bad for your health and disruptive. If you were to ban these, you’d be able to increase the productivity and general levels of health on the ship. It is common on the vessel, due to how easy it is to produce, and how commonplace. Due to its radiance across the cultures of at the very least the humans on the ship, be it from the wines and rums enjoyed by the raiders and bandits, the hard liquors mercenaries pour down their throat, the wines and strange bears enjoyed by pre-industrial recruits and the simple, mass-produced moonshine and liquor that can be found on any hive world in existence.\"", "action_results": [{"action": "Ban", "result": "The ban goes miserably. As soon as it goes into place, there’s uproar and even strikes organized by the workers, but these are easily quelled by a few experienced Goliaths knocking some heads together. Still, everyone begins to brew their own, from bathtub gins created by the shitty metal wash basins that you barely deign to qualify as bath tubs, to massive operations creating a variety of drinks, taking up whole forgotten floors on the ship. Still, the problems caused by the worse quality liquors given to the mercenaries and the general unhappiness caused by having to pay exorbent amounts just to get something that’ll get you drunk and isn’t mostly Promethium and weak acid has worsened morale, though not all the alcohol that can be found is pathetic. From what Castus and Fay say, the pricier drinks are actually of better quality than what you were unimportant. No doubt they had sampled it only to verify that the brewers were making alcohol before destroying every drop of it. You ignore the rumors that they’re these industries’ biggest customers.", "action_results": [{"action": "Continue", "result": "Well, on to the next group of recreational drugs. Whilst alcohol technically falls under this category, it’s not usually what people refer to. No, the main ones, as you see when Elizabeth puts them on the table, are less traditional\n\nElizabeth puts a large, brown cigar, a glass vial containing blue liquid, a small patch of green tablets and quite a few other drugs\n\n\n“These are known collectively as the Eyes, due to all of them having a fairly noticeably effect on your eyes. It’s really a catch all term commonly used on the ship, and in the sector. They’re… for lack of a better word, light drugs. From the smokeable Sun Scales designed to get you in a trance or give you some hallucinations, the Blood Root that has the effect of making the user feel happier and more mellow, the Slug juice, absorbed through the skin, that helps relieve pain and puts the user into a deep, peaceful sleep, the Bright Gas that improves the user’s mood, the Castins that when smoked increase confidence… I can go on forever. These drugs have some negative effects, but realistically, no serious ones when taking into account their expected lifespans and the sheer amount of risks they’re already facing. Anything the drugs do is neglible. The only possible risk is that their productivity worsens because they’re as high as a kite.”\n\n\n“So, do we ban or allow?” you ask. \n\n\n“Well, those aren’t necessarily the only options, in this instance. Due to the nature of these drugs, we have five options. The first two, as you’ll know, involve either blanket banning or fully allowing these and letting the winds of free market spread them out among the crew. The third involves allowing them, but to a limited degree. Everyone has a limited amount they’re allowed to buy, only the least dangerous are brought in, that kind of thing.”\n\n\n“Go on,” you say.\n\n\n“The fourth possibility is that we become proactive with our usage of the drugs. We’re forcing our men to face horrors beyond comprehension and risk their lives. We could, for a small amount, begin purchasing and producing these drugs on-ship, rationing them out to raise the morale of the crew. Plus, this would give us the ability to actually begin selling drugs on the open market if we find a better group of cooks and a supplier. Lastly, we could just go all out. Buy a huge quantity of the drugs and start manufacturing them on ship, and just start pumping them out to the crew. Pump the gaseous drugs into the air, put all the soluble drugs into the water supply and crush up everything else to put in the food. This would amplify morale tenfold, although could lead to a serious drop in productivity, seeing as you literally couldn’t breath without getting insanely high.”", "action_results": [{"action": "Allow", "result": "You allow it. Fuck it, it would just flood in anyway. Other than that, pretty much nothing changes.", "action_results": [{"action": "Finish up with decisions for the day", "result": "You've done enough work. You've done a lot for the ship. Time to head to bed.", "action_results": [{"action": "The Next Day...", "result": "As the shuttle touches down on the planet, you sigh a breath of relief. You walk out of the shuttle, into the clearing you've landed in, staring at the dozens of black trees that surround you. All your lieutenants are with you, excluding Durge and Meliodas, both of who are happier to stay on the ship. \n\n\nAlthough the planet, whose name you can't even remember, is for the most part two extremes of frozen, forever dark wastelands, and burning, forever insanely bright wastelands. So wastelands, mainly. Still, a strip exists around the equator in a sweet zone, which act as bountiful, fertile zones. It's this zone that you'll be taking advantage of on your little planet side excursion. You watch as dozens of shuttles land and hordes of mutants break free of the shuttle to gather resources. Hell, this'll probably raise morale for the mutants, seeing as this'll be the first time they've seen natural sunlight.\n\n\n\"So, do we have any tasks for today?\" you ask Elizabeth.\n\n\n\"No, we've nothing to do but relax. I've put few loyal men in charge, as well as John the Hermit. They'll do what's expected of them.\"\n\n\n\"Perfect, so we have free time,\" Fay says. \"Anything on this planet worth hunting?\"\n\n\n\"There's a species known as Behemoths, incredibly hardy creatures that can survive in either extreme environment, occasionally raiding the fertile zone to feast,\" Elizabeth says.\n\n\n\"Are they sentient?\" Fay asks.\n\n\n\"No.\"\n\n\n\"Are they near extinction?\" Fay asks.\n\n\n\"Again, no,\" Elizabeth says.\n\n\n\"Alright, perfect. I'll grab a few of my Tribals and go on the hunt,\" FAY says.\n\n\n\"Yeah, I'll come,\" Castus says.\n\n\n\"I'll go as well,\" Fay says.\n\n\n\"Smells funny here. I'm going to sleep,\" Cain says, walking over to a tree and slumping against it as he closes his eyes.\n\n\n\"You want to come hunt, Elios?\" Fay asks. \n\n\n\"Please, do I seem like the type to go hunting? I'm going to bathe by the river,\" Elios says, sauntering off.\n\n\n\"Elizabeth?\" Olive asks.\"Are you coming hunting?\" \n\n\n\"This is a peaceful, relaxing environment. I want to practice on my psychic abilities,\" Elizabeth says again.\n\n\n\"Hayes? You coming?\" Fay asks.\n\n\n\"Yeah, I'll come,\" Hayes says, slinging his rifle over his shoulder. \n\n\nWell then, you've a few choices on what to spend your day doing. ", "action_results": [{"action": "Go hunting", "result": "\"I'll hunt with you guys,\" you say.\n\n\n\"Terrific,\" Fay says.\n\n\n\"I'll get you a gun,\" Olive says.\n\n\nYou set a tree alight with a flick of your wrist, as the Warpfire quickly runs up, multicolored flames licking the sky as the tree is quickly burnt down to ash.\n\n\n\"Do you think I need one?\" you ask.\n\n\n\"Fair point,\" Olive says.\n\n\n\"Let's get going!\" Castus says, twirling his sword. \"I wanna stab something!\"\n\n\nElizabeth transfers over a short amount of data onto Olive's datapad about the Behemoths. Then, the group moves forward through the wilderness, as Olive begins to flick through the information.\n\n\n\"So Hayes, you were a Guardsman, then?\" Olive asks. \"From what I heard, they give you a flashlight and a t-shirt and send you to fight serious foes.\"\n\n\nHayes sucks on his cigarette, thinking.\n\n\n\"Yeah, all command gave us was jack and shit. I remember my first deployment. We were in the jungle, and I mean a serious fucking jungle. Seemed like the whole jungle was sentient and wanted to fucking kill us. Snare vines strangled every single one of us. The ground would just give way. You'd be on patrol, and the mud would suck up an entire tank. You'd blink and it'd be gone. Then there was the greenskins. You'd give 'em a few sticks with the bayonet, and they'd laugh and call you a grot.\"\n\n\n\"Greenskins. They used to be the biggest threats back home. When I was a kid, they took out my tribe. I remember being surrounded by a green tide, roaring, screaming and terrifying me. By the moon, I think I ended up pissing myself,\" Fay says.\n\n\n\"How the hell did it kill your tribe? Who are the Tribals, then?\" Castus says. \n\n\n\"I ended up getting rescued by the Uwais tribe. They adopted me.\"\n\n\n\"Really? Was it the tribe that saved your ass and blew up a bunch of heads?\" you say.\n\n\n\"Fine, Karth saved me with his weird Shaman powers,\" Fay says.\n\n\n\"So, I'll just come out and ask. Olive, there's a rumor going around that you and your brother are fucking.\"\n\n\n\"Holy shit!\" Olive says, as Castus breaks into laughter. \"No! No! Just no!\"\n\n\n\"You fight Orks, gladiators?\" you say, quickly changing to a less incest-related topic.\n\n\n\"Occasionally they got Orks in, but it was rare,\" Olive says. \"Usually we fought each other, or mutants.\"\n\n\n\"Mutants were easy. You just had to kill them,\" Castus says. \"Other gladiators were hard. You had to hit them in just the right place. It needed to be bloody, but you couldn't kill a fellow gladiator, you know? Sometimes in the heat of battle, you took a bad swing, slashed open a throat, did something else. Those were the bad days.\"\n\n\nCastus goes quiet, seemingly deep in thought.\n\n\n\"Yeah,\" Olive says, finally. \"We fought Orks sometimes.\"\n\n\nYou walk on in silence, before Fay stops, dropping low. Massive footprints cut directly across the trail. Fay traces the footprint with her pinky, pressing her hand against the mud.\n\n\n\"It's relatively fresh. Tracks break away in undergrowth. Could've gone along the river. Could've gone straight along the underbrush, or twisted off through the trees.\"\n\n\n\"I'll go along the river,\" Castus says.\n\n\n\"I'll take the underbrush, then,\" Fay says.\n\n\n\"Trees,\" Olive says, simply.\n\n\nCaptain Hayes looks at you, raising an eyebrow.\n\n\n\"I'll give you first pick, Karth,\" he says.", "action_results": [{"action": "Take the river with Castus", "result": "\"I'll go with Castus,\" you say.\n\n\n\"Kickass,\" Castus says. \n\n\nYou quickly towards the river. You walk along the banks, while Castus happily wades up to his knees. He dunks his head under water, slicking back his wet hair.\n\n\n\"Uh, that feels good!\" Castus laughs, before diving into the river. \n\n\n\"We're supposed to be hunting!\" you exclaim, hovering into the air, staring for any signs of the creature.\n\n\n\"What the fuck would I care?\" Castus cries. Come on, motherfucker. Get in the water.\"\n\n\nYou hover over Castus, the soles of your boots just touching the water. Castus rolls his eyes, grabbing you by the boot and in one swift movement pulling you in. The water's cold, but in the hot weather of today, quite refreshing. You float in the water, drifting along the river slowly.\n\n\n\"Fuck hunting, this is all I want,\" Castus says. ", "action_results": [{"action": "Drift peacefully along", "result": "You say nothing, continuing to float along the water. You close your eyes, taking a deep breath.\n\n\nYour peaceful relaxation is interrupted as the comm bursts to life.\n\n\n\"Got a sight on it! Fuck, it's a big one!\" Olive says over the comms.\n\n\n\"Shit,\" Castus says. \"Well, we need to go deal with that.\"\n\n\nCastus climbs out of the water, quickly hurrying along towards Olive's path.", "action_results": [{"action": "Head towards the Behemoth", "result": "You hurry through the forests, levitating over streams and fallen trees. With your speed, it’s less than a minute before you arrive, seeing the beast.\n\n\nIt stands twice the height of even a space marine, and easily six times as wide, on four clawed legs. It’s skin is grey, seemingly covered in scales that remind you more of the stones themselves rather than the hide of a beast. Its head is like that of a spider’s, hissing at you as it raises its massive, stony clawed arms to swipe at you. You hover back, feeling electricity coarse through you as you prepare for a fight.", "action_results": [{"action": "Smash it telekinetically with a tree trunk", "result": "You grab a tree with your mind, lifting it through the air, as gunfire erupts from your companions. Even the powerful bolter fails to break through its thick, rock-like exterior. You swing the tree with incredible strength, smashing into the creature and sending splinters around the place. The creature doesn’t even step back, instead charging ahead towards you. You float to the side, as Hayes quickly arrives, raising his rifle and firing. As expected, the las beam has no effect.\n\n\n“Ha! It’s good to be killing again!” Castus yells.\n\n\n“Fuck, we’re not getting through this. Maybe we up the armament?” Fay says.\n\n\n“Go for the eyes and the inside of the mouth!\" Hayes yells, firing his gun.\n\n\nWell, that didn't work. Time for something else.", "action_results": [{"action": "Take it to some psychic-amplified melee", "result": "You fly forward, smashing a fist into the Behemoth's head, squashing out one of its eyes as your fist flies straight into its head. It howls as it smashes its claws as you, but you simply drop underneath the swings and continue smashing your fist into its chest. The Behemoth smashes its head forward, shattering your shoulders and sending you hurtling towards the ground as you smash into the soft mud. The Behemoth steps forward, crushing its claw into your chest and shattering your bones crushing your chest. You're killed on impact. ", "action_results": []}, {"action": "Ram a tree trunk down the beast's throat", "result": "You levitate a tree trunk into the air, flinging it forward. It flies through the air and smashes into the beast's open throat, as the beast stumbles backwards as you drive the tree further down its throat. The beast tries to howl, but only ends up choking. You quickly levitate back as the beast stumbles around, before it finally collapses on the ground. ", "action_results": [{"action": "Stand above the vanquished beast", "result": "You quickly levitate over the beast, dropping onto it's head, gently pressing your boot against its head and smiling. \n\n\n\"Karth one, nature zero,\" you say. \n\n\n\"Barely counts as hunting with those powers,\" Hayes says, jabbing his bayonet into the monster's thick skin, as it simply scrapes along the hide. \"Fuck me, this is thick. Could probably survive a Baneblade cannon.\"\n\n\n\"How long before we have to return?\" \n\n\n\"About an hour,\" Fay says, drawing a knife and tapping it against the beast's hide.\n\n\nNow that you have some free time, you might be able to solve this whole romance issue, see where that goes.", "action_results": [{"action": "Spend some time with Fay", "result": "\"Hey, Fay. Ooh, that rhymes,\" you say, walking up to the Azajaja Tribal.\n\n\n\"What's up?\" she asks.\n\n\n\"Come on, let's spend some time together.\"\n\n\n\"I can't. I've already arranged to spend some time with Castus, then Hayes.\"\n\n\n\"Oh,\" you say, disappointed, as Fay laughs.\n\n\n\"I'm kidding, witch boy. I'll always have time for you.\"\n\n\n\"Aw, romantic,\" you smile.\n\n\n\"Oh, not for the romance. Only because the sex is good. Must by your psychic powers. Now, come on, let's go do something fun,\" she says.\n\n\nFay begins walking off into the trees, as you follow behind her eagerly.\n\n\n\"So... we're dating,\" you say.\n\n\n\"Correct,\" Fay replies.\n\n\n\"Well then,\" you say, floating forward.\n\n\nYou both continue moving forward through the trees , as you take a deep breath. The voices chatter in the back of your mind, although they seem bored and disinterested. They'll probably come back soon enough, but for now you're content with their silence. You float on, both silent.\n\n\n\"How many people were there back home?\" Fay asks, breaking the silence.\n\n\n\"What do you mean?\"\n\n\n\"How many people were there in all the tribes?\"\n\n\n\"Uh... ten thousand, twenty thousand maybe,\" you reply. \"Why?\"\n\n\n\"Think about it. Our entire world was twenty thousand people. My dreams as a kid involved leading a group of a thousand warriors to purge out a bunch of Greenskins. With the forces we have now, we'd be able to wipe out the tribes a billion times over.\"\n\n\n\"Yeah. We're doing well,\" you reply, looking up at the sky, with the sun slowly setting in the distance. \"How far do you think we are from home?\"\n\n\n\"I don't know. A million miles. A billion. Hell, a trillion. Hard to imagine.\"\n\n\n\"You come across the river and step forward, levitating over the stream, stopping on the other side.\n\n\n\"Lucky psychic bastard,\" Fay bumbles, sitting down to pull off her boots. \"I don't want to get my boots water-logged. I'll throw 'em over, OK?\"\n\n\nYou nod, as Fay throws her boots across, both of which land on the shore next to you. \n\n\n\"Uh... maybe you should throw over the rest of your clothes. So they don't get wet,\" you say.\n\n\n\"Why the fuck are we even crossing this river?\" Fay says.\n\n\n\"See what's on the other side,\" you say.\n\n\nFay sighs, pulling off her coat and bundling it up. She tosses it over, and you catch it, as she begins to unbutton her shirt. She looks up at you expectantly.\n\n\n\"Are you going to look away?\" she asks.\n\n\n\"I wasn't planning to,\" you say.\n\n\nFay gives you the finger, buttoning her shirt up again.\n\n\n\"Fine, I'll stay dressed,\" she says. \n\n\nFay steps back, before running forward and diving. You raise your hands, as instead of splashing into the water she instead levitates in the air, floating across the river. You release her back on the grassy blanks, where she lands softly on her back.\n\n\n\"There you go,\" you say helpfully.\n\n\n\"Why didn't you start with that?\" Fay asks. \n\n\n\"I was hoping you'd fully undress,\" you admit.\n\n\nFay laughs, grabbing one of her boots and pelting you in the head. You stumble backwards with a groan, before Fay knocks your legs away, knocking you into the water. \n\n\nYou quickly surface, floating out of the water, coughing out water.\n\n\n\"Are you OK?\" Fay asks, looking worried. \n\n\n\"I'm soaking!\" you complain, as Fay bursts into laughter.\n\n\n\"Sorry, sorry! It's just pretty funny.\"\n\n\nYou flick your wrists, sending Fay tumbling into the water. She swims to the top again, spitting out water, as you lower yourself back into the water.\n\n\n\"OK, I deserved that,\" Fay says.\n\n\nYou flick your wrists, tossing Fay's boots into the water.\n\n\n\"You're a bad person,\" Fay says, diving underwater and surfacing with her boots, and tossing them back onto the shore.\n\n\nYou swim to the shore, climbing back onto the short as Fay follows. You lie on the grass, feeling the sun on your skin, as you pull off your soaking robes. Fay unbuttons her shirt, laying it out in the sun to dry, revealing her bra. You attempt not to stare, but you obviously stare. She pulls down her trousers and lays down next to you.\n\n\n\"It's nice to get off the ship,\" you say.\n\n\nFay leans over, resting her head on your bare chest, looking up at you. \n\n\n\"So...\" she says.\n\n\nFay moves forward, kissing you passionately. She wraps her arms around your shoulders as you quickly find your hands going directly where you'd expect to them. You close your eyes, and everything feels alright for once in this shitty galaxy.", "action_results": [{"action": "An Hour Later...", "result": "You lie, naked and covered in sweat and... other bodily fluids. You look up at the sky, now golden with the falling sun.\n\n\n\"Karth! Fay!\" Olive yells. \"We need to go!\"\n\n\nYou curse, grabbing your robes which you drape over your frame as Olive hears you and jogs over.\n\n\n\"Hey, guys, we.... Oh. Ooh. So this is happening.\"\n\n\n\"Piss off, Olive!\" Fay says, scampering under her clothes.\n\n\n\"Yeah... you guys need to go to the ship. We're leaving soon,\" Olive says, her glance flickering between both your and Olive's genitals. \n\n\n\"Olive!\" you shout.\n\n\n\"Sorry, fine, fine,\" Olive says. \"I'll go!\"\n\n\nOlive quickly heads away, leaving you and Fay lying on the ground.\n\n\n\"Alright, let's bounce,\" you say, as you adjust your robes. \n\n\nFay quickly dresses in her clothes, before standing and pulling you up.\n\n\n\"Well, that was fun,\" you say.\n\n\n\"Yeah, it was. But, back to work as always. Ready to conquer a galaxy?\"\n\n\n\"Damn right,\" you reply.", "action_results": [{"action": "Hours Later...", "result": "The dropship enters the landing bay, as you lean back against then wall. Gone is the scent of trees, the tweeting of birds, the delightful senses of the forest replaced with the smell of Promethium and grease, the noise of distant orders echoing off the hallway walls and the gentle hum of the machines that keep the ship going. Still, when you let your senses flood with the sounds and smells of the ship, you're reminded of the smell of tanned Puk leather, oil lanterns and wild flowers of home, and the constant chattering of Tribals outside your tent. If anything, you feel more at home on this ship than you ever did there.\n\n\nAs you step off the dropship, you smile and walk on.", "action_results": [{"action": "Continue", "result": "\"BURN IT! DAMN YOU, FREAK! YOUR SOUL IS MINE! I'LL FEED IT TO THE DOGS!\"\n\n\n\"The change and mutation of the human form is natural. Your body is a tool. Forge flesh.\"\n\n\n\"Pestilence. Plague. Rot. It's natural. The conditions that cause these mutants to come about seem terrible, but to give up on caring for the appearance of your temporary vessel is liberating...\"\n\n\n\"The sensations you can feel...\"\n\n\n\"Just shut up!\" you say loudly, as John the Hermit, Primus' figurehead and Olive stare at you.\n\n\n\"Not... It's the... fuck!\" you complain.\n\n\n\"FUCK! PURGE! OBLITERATE! I'M THE FUCKING DEATH OF WORLDS, DO YOU HEAR ME?! OBEY ME!\" Smiley screams in the confines of your skull.\n\n\n\"Uh... alrighty then. Do you want to take a break, or...?\" Olive says.\n\n\n\"Continue,\" you snarl.\n\n\nJohn the Hermit nods, and continues to read from his notes.\n\n\n\"Genes have remained stable and unmoving as the steel the ship is carved from for the Bestial-12ABQ1 strain of mutant, so they'll be transferred to serve the great powers of the ship by working with waste recycling, by turning the old to th...\"\n\n\n\"Can you trust the mutants? Their mind is as shifted in loyalties as their form. They betrayed Kyros with ease, why not you? Don't you want to know where their loyalties lie? To embrace your powers to stay strong and in power?\" Question Mark asks.\n\n\n\"Let it all turn to the powers of decay. Let...\" Rotgut moans.\n\n\n\"Fuck, I take it back, shut it. I need a break,\" you say.\n\n\n\"We can take a break. When do you think you'll be able to start this again?\" Olive nods, as you shake your head.\n\n\n\"Fuck that. I'm taking a break, you continue this. Do it without me. It's not like I give a fuck, right? Primus, Olive and you can handle it.\n\n\n\"We'll get it done. Go jerk off or whatever you do,\" Olive says.\n\n\nThis is your home, admittedly, and you love the ship. You feel home here. You don't, however, feel at home inside your head. The shore leave helped, but you miss the old bastard Meliodas. At least he stayed quiet and helped sometimes. You need to find a way to deal with this.", "action_results": [{"action": "Visit Meliodas", "result": "Rumor has it, Meliodas hangs around the lower warrens. Maybe its time to pay him a visit.\n\n\nAfter a quick search, you find yourself in an abandoned cargo hold of the Roar of the Vortex. It's known to the mutant populace that inhabits the floor as the Red Market, and everyone else calls it the Craphole. The area is bustling with activity, as mutants sell and buy whatever it is the fuck mutants sell and buy. You walk along the paths, as the mutants quickly notice you.\n\n\n\"Sir! Sir! You there!\" a mutant with a horribly mangled face covered with dozens of eyes says.\n\n\n\"What?\" you ask, looking at the monster.\n\n\n\"I recognize you! The holos showed you! You're the man who dethroned Kyros!\"\n\n\n\"Yeah, I guess I am,\" you say. \n\n\n\"Ah, splendid!\" the mutant says, shaking your hand. \"Conditions have improved tenfold with you in charge, sir! You must be starving! Here, let me get you something to eat, free of charge!\"\n\n\nThe mutant disappears under the stall, before bringing up a large, horribly mutated rat the size of a small child. The rat looks at you, seemingly indifferent.\n\n\n\"Uh... I prefer my meat cooked... and not a rat. Thanks, though,\" you say, stepping back.\n\n\n\"Meat?\" the man asks, confused. \"No, no! This is the mother! Through it, we get milk! Then, cheese! You don't want to inspect the rat for disease before you have the cheese?\"\n\n\nThe mutant looks at you confused, before grabbing a lump of sickly yellow... cheese, you suppose.\n\n\n\"Oh... I just ate,\" you say. \"Look, I need your help. I'm looking for someone. Meliodas.\"\n\n\n\"Meliodas? Yes, I know this name. I can take you to him. Follow me,\" he says.\n\n\nYou follow the mutant along the market, before taking a side route off down a hallway. Soon, you find the daemon. He paints heretical symbols on the walls with his one blood, which drips down from his wrists.\n\n\n\"Meliodas. I need assistance,\" you say.\n\n\n\"How can I help?\" Meliodas asks, his head twisting around at an unnatural angle.\n\n\n\"The daemons. In my head,\" you say.\n\n\n\"Don't you fucking dare try to get rid of us! DON'T YOU FUCKING DARE!\" Smiley howls.\n\n\n\"I need to get rid of the daemons in my head,\" you say simply.\n\n\n\"I can do it. It'll hurt, though. And leave a few marks,\" Meliodas says.\n\n\n\"Will it be serious?\" you ask.\n\n\n\"No,\" Meliodas says.\n\n\n\"Do it,\" you say.\n\n\nMeliodas holds out your hand, and you grab it.\n\n\n\"I'm going to flood you with the energy of the Warp. It should displace the Daemons in your head and lessen the impact of the daemons. Understood?\"\n\n\n\"Got it,\" you say. \n\n\nYou clasp his hand, before pulsing. You feel the power of the Warp flood through you as you convulse, the roar of the Warp drowning out the voices of the daemons. Instead of four loud voices, you hear thousands of faint voices. You feel your left hand burn, but the noise distracts you. After a few minutes, the feeling ends, and you collapse to your knees. \n\n\nYou focus. The voices of Smiley, Fucky, Rotgut and Question Mark are still faint in the back of your head, but they're not overpowering. The main sound is the thousand of whispers and the roar of the Warp, but it's certainly more peaceful.\n\n\n\"Thanks,\" you say, releasing your breath and relaxing.\n\n\nYou look down at your hand, noticing the eight-pointed star of Chaos Undivided is now burnt into it.\n\n\n\"Ah, so this happened,\" you say.\n\n\n\"I said there'd be scarring,\" Meliodas says.\n\n\n\"You never said it'd be a Chaos symbol,\" you complain.\n\n\n\"Ah... yes, it is,\" Meliodas shrugs. \"Isn't it an improvement?\"\n\n\nYou think, realizing the endless voices have now been cut  back, before nodding.\n\n\n\"You're right. Thanks,\" you say.\n\n\n\"Alright, let me go back to my rituals,\" Meliodas says.\n\n\n\"OK. Thanks, Meliodas,\" you say, turning and walking off.", "action_results": [{"action": "Continue", "result": "You walk along the hallways, alongside a young, former slave who looks to be barely out of his teens.\n\n\n\"Timothey J. Hawkins, sir. I tr...\" he says happily.\n\n\n\"I don't give a fuck. You're the best shuttle pilot we have, correct?\" you reply.\n\n\n\"Well sir, I've admittedly accomplished a few tasks, but I'm not sure about that. I did manage to land Kyros' Bloody Claws onto a sp...\"\n\n\n\"You're the man Hayes recommended, yes?\" you respond, as you stop outside the war room.\n\n\n\"Yes, sir. The...\"\n\n\n\"Terrific. Outfit the shuttle in whatever way suits your piloting style, I'll provide the funds. Got it?\"\n\n\n\"Yes, sir!\"\n\n\n\"Perfect. That's it, then,\" you say.\n\n\n\"Yes, sir! Thank you for the opportunity! I promise I won't let you down!\"\n\n\nFinally, you bid Hawkins goodbye, whilst knowing he won't last a week. You walk forward, to where Fay waits outside the war room.\n\n\n\"Hey, Karth. You ready to deal with Kyros' allies?\" he says.\n\n\nYou wrap an arm around her, kissing her on the lips.\n\n\n\"Ready to take on the galaxy,\" you smile. \"How about you?\"\n\n\n\"Of course,\" she replies.\n\n\nThe two of you walk into the war room, to find the rest of your lieutenants are already here. Today, you need to deal with Kyros' allies.\n\n\n\"What'd I miss?\" you ask.\n\n\n\"Nothing. Ready to begin the debriefing,\" Primus says.\n\n\n\"Do it,\" you reply.\n\n\n\"Understood. The issue we have to deal with is Kyros' former allies. Kyros did not plan to take Terra alone. He had made pacts with dozens of warbands, made deals with endless mercenary outfits, gained pledges of support from Xenos empires and made countless more alliances.\"\n\n\n\"Are these issues?\" Fay asks, her head resting on the stock of her bolter.\n\n\n\"To a degree. Most pacts were built on weak ground on the unsaid assumption that either party would turn on the other if given the chance, and now that Kyros is no more they're void and useless. Other parties have had changes in power due to coups or rebellions and their new leaders have no loyalty to Kyros. The only potential threats that could harm us are the Children of Apep, the Tau Empire, the Kabal of the Bleeding Thorn and the Dogs of War.\"\n\n\n\"Who are they?\" you ask.\n\n\n\"The Children of Apep are a Chaos Warband led by Khalid the Despised. Made up of a strong inner-circle of Thousand Sons Space Marines, they now control a small fleet that reigns control over an alliance of a few worlds, space stations and outposts. They have a heavy amount of Psykers, and could potentially use their combined psychic powers to threaten our position,\" Primus says.\n\n\n\"Who else?\" you ask.\n\n\n\"The Tau Empire are a fairly large empire of Xenos species with advanced technology. They...\"\n\n\n\"I've heard of them. They were allied to Kyros?\"\n\n\n\"We're unsure of that. It seems they did provide funding for a few of Kyros raids against Imperial worlds. Kyros seemed to have made a noted effort to avoid Tau interests. Kyros had all other information about them purged. I know nothing more about the relationship, but it's most definitely worth investigating.\"\n\n\n\"OK. Who else?\"\n\n\n\"The Kabal of the Bleeding Thorn is a group of Dark Eldar pirates and raiders led by a mysterious figure known as Merideza who had seemingly forged an alliance with Kyros. They're infamous in this sector for their quick, brutal raids on worlds to enslave the populace. They're a powerful organization based out of the sub-dimension known as the Webway in a city known as Commorragh, where all Dark Eldar stay. Although the species aren't known for their loyalty to former allies, they might see our growth as a potential threat.\"\n\n\n\"And the others? The Dogs of War?\"\n\n\n\"The Dogs of War are a renegade chapter of Space Marines led by Chapter Master Christian Firenaza who went renegade after fighting a vast Tyranid fleet and taking severe losses without any support from the rest of the Imperium. They primarily work as a mercenary outfit. Although technically, only the space marines are the Dogs of War, they now consist of dozens of mercenary outfits that serve under them, all known as the Dogs of War. Although one would assume their mercenary status would mean they won't strike at us if they're not being paid to, loyalty seems to be strong among space marines. They might want to avenge Kyros.\"\n\n\n\"We need to attempt to negotiate with these factions to secure their loyalty to us, or at least ensure they're not going to attack,\" you say.\n\n\n\"Understood. The Children of Apep's flagship, the Quill, is collecting tribute from subject worlds and we can easily head there to negotiate. The Tau Empire has a major presence here, and we can most definitely negotiate with them whenever you'd like. The Kabal of the Bleeding Thorn spend little time in realspace, but we can communicate to them through one of the human raider groups that serve them. Finally, the Dogs of War are based out of a massive space station known as the Iron Hound. It's a fairly active space port. We could be there to negotiate soon enough.\"", "action_results": [{"action": "Negotiate with the factions", "result": "Well then, you have the psychic-heavy Children of Apep, the large and advanced Tau Empire, the Dark Eldar raiders the Kabal of the Bleeding Thorn and the mercenary outfit the Dogs of War.", "action_results": [{"action": "Visit the Children of Apep", "result": "\"Alright, connecting...\" your pilot says, as the ship attaches to the bays of the Quill. All your lieutenants stand around you. Immediately, you spot a trio of space marines clad in blue with yellow trim marching towards you. Those on either side are helmeted with a crest behind their head and holding bolters in their hands. The one in the middle has no helmet, instead wearing ornate golden robes over his power armor, holding a bolt pistol golden staff topped with a snake, with two Sapphires as the eyes. You rarely see a space marine with his helmet off. This man has short blond hair and a clean-shaven face.\n\n\n\"Ah! Kyros' over-throwers, is it? I...\" the marine says, before stopping to stare at Meliodas. \"You.... ah, I sense it now. A daemon, is it? Tell me, were you trapped inside Kyros' skull for all the times I met with him?\"\n\n\n\"No, I've just moved in,\" Meliodas replies, as the marine nods.\n\n\n\"I am Khalid the Despised,\" the marine says, as his two guards stare blankly at you.\n\n\n\"My name's Karth,\" you reply. \"This is Meliodas, Cain, Castus, Olive, Fay, Durge, Elizabeth, John the Hermit, Captain Hayes and Elios.\"\n\n\n\"Fuck, did you really need to bring the whole crew?\" Khalid asks, staring at your lieutenants.\n\n\nKhalid strolls along the line, nodding slowly as if he expected this.\n\n\n\"Yes, yes... at least you got rid of that crazy Khornate bitch. Still, you kept the sentient Slaaneshi dildo, the morbidly obese sore, the failure for a psyker and the jar-head. Oh look, you've a few more to your roster. A... I don't even know what this freak is,\" he says, staring at Cain. \"Then we have a mutant who deserves to become dust like my own, a bunch of kids and the daemon who can't find a better crew. A pathetic group if I've ever seen one.\"\n\n\nKhalid steps back, as most of you stare at him in shock. Only the Staine Siblings and Hayes seem unsurprised.\n\n\n\"How fucking dare you?\" Fay says, as she raises her bolter to point at Khalid's head.\n\n\n\"Oh, you must be one of the shit-eating, backwater Ferals that Kyros tried to turn into a super-soldier, right? Tell me, are you pregnant by your father, your brother or your cousin? Who am I kidding, with a planet like you came from, he's probably all three,\" Khalid smiles.", "action_results": [{"action": "Blow this bastard's head off with a blast of psychic energy", "result": "You fire a bolt of psychic energy that slams into Khalid's head. You feel a wave of psychic energy flood through your skull before your head explodes.", "action_results": []}, {"action": "Set this tool alight", "result": "You let a wave of psychic flames release from your finger tips that quickly set his robes alight. Suddenly, the wave of heat floods through your body as you set alight, and you quickly burst into flames and are soon turned to ash.", "action_results": []}, {"action": "Attempt to take a more peaceful approach", "result": "\"Look... Khalid. The galaxy's a harsh place.\"\n\n\n\"Oh, I'm sorry, did you learn that from your tiny fucking amount of experience in the world?\" Khalid says.\n\n\nYou stare at the psyker as he runs his hands through his hair.\n\n\n\"I wanted... an alliance,\" you say.\n\n\n\"Ter-fucking-rfic,\" Khalid the Despised says. \"Follow me.\"\n\n\nYou look at your lieutenants. The slave leaders; Fay, Olive, Castus and Cain are all shocked, while Elios, Durge, Elizabeth and Hayes seem indifferent.\n\n\n\"His attitude has improved,\" Elizabeth notes.\n\n\n\"Is that a joke?\" Olive asks, staring at her.\n\n\n\"No. You should've seen him last time,\" Elizabeth says. \"Come on, let's follow.\"\n\n\nYou follow after Khalid, and soon follow him into a large library. Khalid points his staff, and a dozen large chairs float over. He sits down into one of them, looking up at you.\n\n\n\"I assume you're here about the psyker, yes?\" he asks.\n\n\n\"Uh... what psyker?\"\n\n\nKhalid the Despised rolls his eyes, gently tapping his staff against the ground in annoyance.\n\n\n\"A new psyker has supposedly risen to power in the sector. We're talking a psyker of amazing power. Tremendous power. He's seemingly pledged as the greatest champion of the renegade Chaos God, Malice. I assume you want to make an alliance to take him out.\"\n\n\n\"No... although I'll look into it. I'm taking Kyros' place as a military power, and rebuilding. I want to secure my alliance with you.\"\n\n\n\"Ah, a little kid playing dress-up in the robes of his master, yes? Why should I ally with you?\"\n\n\n\"Do you have many other offers of alliance?\" you ask.\n\n\n\"Fair point,\" Khalid admits. \"Yes, I want to ally with you.\"\n\n\n\"Oh, that was easy. Shall we discuss military strength? Under my com...\"\n\n\n\"I know,\" Khalid nods. \"You understand the amount of knowledge my spies give me? I have quite a few spies on your ship, and that's not even taking into account my psykers trained in Divination. It might seem I'm answering far too quickly. I'm not. I foresaw you coming to ask, did my research, did what I need. I decided what was to be agreed here a while back. What I've not learned is whether I can trust you. So, I have an offer. A Binding Contract.\"\n\n\n\"A binding contract?\" you ask.\n\n\n\"Did Kyros teach you anything other than to take a dick? A binding contract is done brwteen two individuals with strong psychic abilities. We make a contract, binding our very souls to it to be relinquished should we break it.\"\n\n\n\"What's the contract?\"\n\n\n\"We pledge to remain loyal to each other, absolutely no aggression, come to each others aid, yadda yadda yadda. The details are mental. The words don't matter so much as the spirit behind them.\" \n\n\n\"What do I do?\" you ask.\n\n\n\"Just shake my hand. I'll say the incantation, and our minds will meet. You'll be able to search my mind for mistrust, as I will for you. Are we agreed?\"", "action_results": [{"action": "Agree", "result": "You nod, holding out your hand. Khalid grabs you by the hand, and stares into your eyes.\n\n\n\"This'll be simple enough. Just don't resist. Understood?\"\n\n\n\"Got it,\" you say.\n\n\n\"With the Dark Gods, the Corpse-Emperor himself and anyone else out their with the power to oversee this bargain, I pledge these two souls together by the binding contract, that we will remain allies into all ways possible. Should we break this contract, let our souls be forfeit.\"\n\n\nYou hear the chattering of thousands of daemonic voices as they watch your deal. You feel your mind be flooded into by Khalid's, as consciousness, in the way normal humans feel it, fade.\n\n\nYou find yourself floating in a void, surrounded by an ever-shifting mass of golden energy, that seem to make up Khalid. You look around, as you see his thoughts floating around you. You reach out your hand, touching the thought screams as you hear Khalid's voice boom.\n\n\n\"Is the big freak literate? Is it even sentient? I would think not. If I had to look at that face in the mirror every morning I'd kill myself.\"\n\n\nYou frown, touching another.\n\n\n\"Is the dumbass seriously using Kyros' former lieutenants, those who enslaved his people, as his lieutenants? He saw them betray Kyros! And now the dumbass is reading your thoughts, no doubt learning that while I'll remain loyal to him, he's a fucking wanker.\"\n\n\nYou touch another one.\n\n\n\"You, Karth Uwais, are ugly. See? I'm not even slightly lying.\"\n\n\nWell, you've got what you need from his thoughts. Still, in the golden fog of energy, you can see what you assume are memories drifting around. You see his staff floating through the void before disappearing, before you see a wolf bound through the fog. You can hear distant screams emanate through the fog from some horrifying memory. You see Kyros march across the fog and step back nervously despite knowing he's only a memory. ", "action_results": [{"action": "Follow the staff", "result": "You walk after the staff, as the darkness manifests itself into a massive forge. You smell the oil and grease of the forge, feel the heat of the forges, taste the taste of copper in the air, hear the screeching of metal. A younger version of Khalid clad in red and gold power armor works on his staff, sculpting the snakes that intertwine it. Another space marine with the same color scheme walks into the forge, grinning.\n\n\n\"Khalid! What are you forging there, friend?\"\n\n\n\"I call it the Staff of Khalid,\" Khalid says proudly, holding it up.\n\n\n\"Ah, what humility!\" the second marine says. \"What great abilities has it?\"\n\n\n\"Glad you asked, Narmer. It can act as a simple director of power, but more importantly, it can redirect psychic attacks back at the opponent. Unless they specifically know of the staff's powers, they should suffer the full effect of the action.\"\n\n\n\"Fascinating,\" Narmer says. \"I...\"\n\n\nThe room gently fades back into complete darkness.", "action_results": [null]}, {"action": "Follow the wolf", "result": "You walk after the wolf, as it howls skyward and runs. You head forward, as it begins to morph into a strange space marine wearing an ancient power armor, with a wolf hide over his shoulder. The scene changes to a battleground, as you watch as similar space marines fight against those clad in the red and gold Khalid wore.\n\n\nYou see Khalid fighting, as he ducks under a bolter round. He fires a burst of flames, engulfing another wolf-marine who howls in pain, collapsing.\n\n\n\"Death to traitors!\" a voice howls from the wolf-marines.\n\n\n\"You will not kill my brothers! You will not destroy my planet!\" Khalid roars. \"You don't understand! Horus is the traitor!\"\n\n\nA wolf-marine attempts to kill Khalid with his chainsword, but Khalid kills him with a burst of energy. \n\n\n\"STOP! The Emperor wouldn't do this to us! We are loyal! We're your brothers! Please!\" Khalid screams.\n\n\nSuddenly, a massive pyramid materializes next to yous. Thousands of civilians are fleeing up the ramps inside. Then, a massive explosion tears through it, as a fireball engulfs all the civilians inside and fleeing into it.\n\n\n\"NO!\" Khalid screams, as a cry of \"Traitor!\" comes from both sides.\n\n\nWith that, Khalid lets out a fierce scream of psychic energy, charging forward. The room gently fades to black.", "action_results": [null]}, {"action": "Follow the screams", "result": "You walk after the sounds of screams, and find yourself surrounded by chaos. Khalid stands alongside his fellow space marines, although they writhe and convulse in pain. One of the space marines screams as he tears his helmet off, revealing dozens of eyes growing on his head. Another marine looks in horror at the spine-like tumors growing from your arm, shattering his armor. You notice Khalid's mutations as his skin bubbles and blisters as if exposed to a flame, as his eyes melts out of his face as tiny mouths replace them, tentacles emerging from his back and flailing desperately.\n\n\nSuddenly, you see a blast of magic run through the area. You turn, seeing a space marine with black horns coming out of his helmet reading a tome.\n\n\nThe men begin to course, as their mutations begins receding. Khalid's mutations retreat into his body or burn away from the magic, as the youthful Khalid is remade. Still, not everyone is as fortunate. The space marines around him have their mutations burn away, but the psychic energy doesn't stop. Their bodies begin to shift and fall apart as they turn to dust. They power armor reforges itself around them, trapping the dust inside.\n\n\nFor a moment, Khalid seems relieved as he looks down at his unmutated form. Then, he sees his brothers. He grabs a space marine next to him, holding him closely.\n\n\n\"Narmer! Narmer, what's become of you!? NARMER!\"\n\n\nThe room once more fades to darkness.", "action_results": [null]}, {"action": "Follow Kyros", "result": "You follow Kyros, as the darkness forms into the very room aboard the Quill that you're in. Kyros faces Khalid, who stands alongside his two Rubric Marines. Hayes, Elizabeth, Durge and Elios stand next to Kyros, as well as his deceased lieutenants, Chapter Master Taj Suenage, Rebecca Staine and Magos Cern.\n\n\n\"I'm sorry, what part of kill yourself confuses you, Kyros? I don't make deals with slaves!\"\n\n\n\"I'm no slave,\" Kyros spits, gritting his teeth together.\n\n\n\"You're a slave to the Dark Gods!\" Khalid says. \"I seek to master the Warp and all who dwell within it. You seek to suck off the strongest being in it.\"\n\n\n\"This decision is highly illogical. Do your men agree?\" Magos Cern says.\n\n\n\"Oh, let's see!\" Khalid says, turning to look at one of the Rubric Marines. \"Narmer! Do you agree? What's that, you don't care? Because you're barely sentient because your soul has been trapped in your armor and you're nothing more than dust? And the fact that the fucking robot cunt can survive without a soul doesn't mean you can? Yeah, good to fucking know! What's that, Narmer? Yeah, the Khornate does look like she swallows!\"\n\n\n\"You have no other allies. You need me,\" Kyros says. \"I'm offering you a chance at vengenace. Don't you want your revenge against the Space Wolves who burnt Prospero? I promise you, theirs will be one of the first worlds destroyed.\n\n\n\"Fine, slave. If you make a march towards Terra, I'll join in the slaughter. But know this. When... who am I kidding? If you end up sitting on the golden throne, you'll still be a slave.\"\n\n\nThe room dissolves once more.", "action_results": [null]}, {"action": "Leave Khalid's soul", "result": "You release your grasp on Khalid's soul, wincing as you take a deep breath. You open your eyes, glancing around the room and seeing your lieutenants, alongside Khalid, Narmer and the second Rubric Marine.\n\n\n\"Ah, finished. Good,\" Khalid says. \"You didn't see anything too incriminating in my mind, did you? Didn't see my perverted thoughts about your sexy little girlfriend, huh? I spent my entire time perusing through your memories of the tribal bitch naked.\"\n\n\nYou feel a surge of anger, before pausing. Space marines barely have genitalia, let alone a libido. If you're going to become partners, you need to stop letting him get a rise out of you.", "action_results": [{"action": "Spit a mean barb", "result": "\"I saw a wolf catching its prey. I saw men turn to dust. I saw you fail,\" you reply. \n\n\nKhalid the Despised looks at you, his eyes filling with sorrow before he brushes it off and smiles.\n\n\n\"Well then, you're the one who allied with the failure. I love the tattoo, by the way.\"\n\n\nYou raise an eyebrow, before noticing that there's a black ouroboros, a snake eating its own tail, burnt into your robes, going around your arm at the bicep.\n\n\n\"Lift it up,\" Khalid says.\n\n\nYou lift up your sleeve, seeing that the ouroboros has burned into your skin, a black brand.\n\n\n\"A little reminder of our deal. It happens during these,\" Khalid says, tapping his armor, where you notice a Uwais tribal tattoo now raps around his arm. You recognize the glyphs for \"Witch\" mixed in with traditional hunting glyphs.\n\n\n\"I like yours,\" you respond.\n\n\n\"Alright, it's best you receive the grand tour, then. If we're to be allies, I'll show you what we're working with.\"", "action_results": [{"action": "Begin the tour", "result": "\"Terrific,\" you reply.\n\n\nWith that, Khalid stands, and begins walking down the hall. You quickly follow him down the hallway, and you approach a set of massive bronze doors with the Thousand Sons Ouroboros on it.\n\n\n\"This is the Khalidic Academy,\" Khalid says. \"Through recruiting from various worlds, rescuing Psykers from the Black Ships that transport them to be sacrificed to the Corpse-Emperor, buying or liberating enslaved psykers or many other ways, I find myself with a huge pool of psykers. Those who are over around twenty five work for me as soldiers, join the warband of the Children of Apep. Those below join the academy.\"\n\n\nThe door slowly opens inwards, and you immediately find yourself in a massive library. You walk into the library, staring at the endless rows of books. The room is packed with people from barely able to walk waddling around to look at books to young men reading tomes. There's everything from young Astartes Space Marines to horribly deformed mutants and Xenos, all seemingly content with the books around them.\n\n\n\"This is the library, my true pride,\" Khalid says, his snark and cruelty seemingly replaced by pride.\n\n\n\"Come, follow, follow.\"\n\n\nYou follow him off to the side of the library where the hallway leads to dozens of classrooms. Your peer inside all of them, seeing how varied the classes our. Students study ancient tomes, give speeches, practice daemonic bindings, prepare for horrifying rituals and endlessly more.\n\n\n\"Knowledge is everything. Here, I spread it. I'm raising a new generation of Psykers, to lead mankind to a new age!\"\n\n\nA little boy, barely older than seven covered in horrible scabs with four eyes, carrying a small dog.\n\n\n\"Jer, is it?\" Khalid says, stopping.\n\n\n\"Yes, sir?\" the boy responds.\n\n\n\"Tell my nitwit guest what you're going to go do now. Show him an example of the fine teaching we do here.\"\n\n\n\"I'm going to go to the bathroom, sir,\" the boy replies without missing a beat, as you giggle like a child.\n\n\n\"What class do you have next?\" Khalid says, sighing.\n\n\n\"Mr Nitfli is teaching us how to utilize our familiars,\" the boy responds.\n\n\n\"Terrific. Get to class now, Jer,\" Khalid says. \"We pick our children for psychic ability, not raw intelligence.\"\n\n\nThe boy nods, and runs off quickly.\n\n\n\"This is really all I have to show,\" Khalid admits. \"It's about time you get the fuck off my ship.\"\n\n\n\"Well, this was good for both of us,\" you say. \"I'll see you soon, Khalid.\"\n\n\n\"And I you, Karth,\" he replies.\n\n\nWith that, you take your lieutenants, and lead them off the ship.", "action_results": [null]}, {"action": "Refuse the offer of a tour", "result": "\"I think I'll pass on that,\" you say. \"I trust you have the strength to assist us. Kyros did.\"\n\n\n\"Yes, because Kyros is a huge success story,\" Khalid says, rolling his eyes.\n\n\n\"Well, this was good for both of us,\" you say. \"I'll see you soon, Khalid.\"\n\n\n\"And I you, Karth,\" he replies.\n\n\nWith that, you take your lieutenants, and lead them off the ship.", "action_results": [null]}]}, {"action": "Brush it off", "result": "\"Sure, alright,\" you say. \n\n\n\"Oh, so blase. Did I hurt your feelings? I love the tattoo, by the way.\"\n\n\nYou raise an eyebrow, before noticing that there's a black ouroboros, a snake eating its own tail, burnt into your robes, going around your arm at the bicep.\n\n\n\"Lift it up,\" Khalid says.\n\n\nYou lift up your sleeve, seeing that the ouroboros has burned into your skin, a black brand.\n\n\n\"A little reminder of our deal. It happens during these,\" Khalid says, tapping his armor, where you notice a Uwais tribal tattoo now raps around his arm. You recognize the glyphs for \"Witch\" mixed in with traditional hunting glyphs.\n\n\n\"I like yours,\" you respond.\n\n\n\"Alright, it's best you receive the grand tour, then. If we're to be allies, I'll show you what we're working with.\"", "action_results": [null, null]}]}]}, {"action": "Refuse", "result": "\"No,\" you say, as Khalid snarls.\n\n\n\"Ah. I did not expect that, admittedly. You've genuinely surprised me. I need to devote more resources to Divination classes.This is an issue. My plans revolve around having your manpower to rely on. If you're a wild card, that'll cause issues. It's better to take you out here. You understand.\"\n\n\nIn unison, the Rubric Marines raised their bolters and fire, as Khalid rises to his feet with a snarl.", "action_results": [null, {"action": "Flee", "result": "You turn to run, but Khalid the Despised has planned for this. Rubric Marines march into the room, firing off blasts of anti-psychic energy. Your lieutenants strike into battle, but you're simply outnumbered and incapable of fending them all off. A bolt of energy strikes you, sending you to your knees as you feel your energy seep out of you. A Rubric Marine strides forward, grabbing you by the head and smashing your skull open against its knee.", "action_results": []}]}]}]}, {"action": "Visit the Tau Empire", "result": "Your shuttle slowly docks with the Tau ship, named the Blah Blah Blah Blah Nonsense Bullshit Weird Alien Language, or something like that. The Staine Siblings, Captain Hayes and Fay are with you.\n\n\n\"So, you're sure you don't what to tell me what to expect here?\" you ask Kyros' surviving lieutenants.\n\n\n\"Kyros kept his dealings with these Xenos hidden from us,\" Durge says, staring at you. \"He didn't tell any of us, and I doubt he told Rebecca. He kept his information to the Magos and the Taj.\"\n\n\nYou look at Hayes, who raises an eyebrow.\n\n\n\"Shit, seriously? Is that why you made me come to this?\" Hayes asks. \"Karth, I don't know what fucking deal you made with the the mutant hermit guy, let alone the deal Kyros made with the Tau. Shit, I'm not even sure what the deal is between you and me. Are you paying me? Do I get a share in the ship's profit, or some bullshit like that? Fuck if I know.\"\n\n\nYou sigh, as the shuttle doors open. A dozen tall, slender blue-skinned Tau stand there, wearing red robes. They all smile as they see you, with the one in the middle stepping forward.\n\n\n\"Hello, Karth of the Uwais Tribe of Rama! I am Flo'O Vior'La Vin Dorn Varoh. Please, call me Varoh for short. I recognize all your esteemed lieutenants and companions. The powerful warrior Fay of the Azajaja Tribe of Rama, Ex-Captain Jon Hayes of the 22nd Regiment, Elizabeth Staine of the One-Eyed Crows, Durge Staine the Ever-Rotting of the Black Rats and Elios the Perverted of the Shrieking Harpies.\"\n\n\n\"Terrific. Now that the names are out of the way, shall we get to business?\" you ask.\n\n\n\"If that is what you wish, Karth,\" Varoh says. \"Before we begin, we have gifts for you.\"\n\n\nThe other Tau negotiators step forward. One offers you a large copper and bronze staff topped with a human skull that seems to have been forged into the staff. \n\n\n\"For Master Karth, we have a gift of the Staff of Acetabularii,\" he, or she, it's not exactly easy to say. \"It is an ancient bronze and copper staff millennia old excavated on a recently colonized world that ancient Shamans used with their magic.\"\n\n\nYou take the staff, and channel a burst of psychic energy through it. From the top of the head bursts a jet of flames as purple flames dance around the skull itself. Perhaps a useful artifact and a tool for less trained psykers, but for you, it seems unnecessary. The negotiators look extremely shocked and surprised at this, to which you frown.\n\n\n\"Sorry?\" you say.\n\n\n\"Uh, no, not at all! We're glad you like it!\" Varoh says. \"It's just fascinating you can do that.\"\n\n\nYou wonder what he means, as this was far from a psychic achievement, before remembering Primus' briefing you on how the Tau aren't a psychic species, and have no psykers.\n\n\n\"Ah, OK,\" you reply. \n\n\nYou look at all your lieutenants as they receive a gift from the Tau Empire. Fay gets a flamethrower-type weapon from some Xenos species, Hayes gets a set of dark green and golden Carapace Armor, Elizabeth gets a large tome with a bestial skull seemingly built into the cover, Elios gets a strange device with a long of needles, and Durge receives a rotting skull covered in fireflies in a glass, clear box, which the negotiator handles very carefully.\n\n\n\"Thanks,\" you say. \"Can we go?\" \n\n\n\"Of course,\" Varoh replies, as he and his negotiators lead your crew down the hallways to the meeting room.\n\n\nYou all sit around the table, with you facing Varoh at the head of the table.\n\n\n\"Can I smoke in here?\" Hayes asks, already lighting the cigarette between his lips. \n\n\n\"Of course,\" Varoh says. \"So Karth, I assume you're here to renew the deal we made with Kyros, yes? We offer you the same terms.\"\n\n\n \"Yeah, about that. We're not exactly sure what deal you actually had with Kyros,\" you say.\n\n\n\"Oh,\" Varoh says. \"Did he not tell any of you? One would think he would trust his lieutenants.\"\n\n\n\"Yeah, whatever. So tell me, what was this deal you had?\"\n\n\n\"Military assets are hard to find in this area. Kyros was a prominent war-band that raided the sector, so we made a deal with him. Kyros had a habit of raiding worlds, so we made a payment to him in order for him to make several promises. For our continued payment, he avoided raiding any Tau assets or engaging any of our assets, and he would take our advice in which worlds to hit. If a trade convoy was bringing weapons to the front to fight off our advances, Kyros would target it for us. Additionally, he'd also place us as his prime client for mercenary work and would sell us what he raided.\"\n\n\n\"How much would that deal earn us?\" you ask, raising an eyebrow.\n\n\n\"Twenty million Thrones,\" Varoh says, as you grin.\n\n\n\"Ah, that sounds... acceptable,\" you say.\n\n\n\"What if we refuse?\" Elios asks.\n\n\n\"We have other offers,\" Varoh says. \"If that's too much, we simply want a non-aggression pact, and to have a small group of a half dozen Tau on your vessel to make the voice of the Tau Empire known. You avoid attacking our assets, and we pay you ten million Thrones.\"\n\n\n\"Is that all the offers?\"\n\n\n\"Well... we had offered Kyros a better offer, but he refused.\"\n\n\n\"What was the offer?\"\n\n\n\"For thirty million Thrones, we become allies. We'll offer you our support when needed, and we expect you to offer yours. The terms are similar to the twenty million Thrones offer, except except instead of our advice, you will assist us when we demand. Please know, we will must definitely not be unreasonable. If you find we are taking advantage of you, we are more than happy to rearrange the deal. We'll even give you a small portion of Tau forces to assist you in your mission.\"\n\n\nHmmm... the deal they're offering is an interesting one. There seems to be dangers with the thirty million offer, but that money could be essential. The ten million offer most definitely will be accepted if the others aren't, as harming the Tau wasn't really on your list anyway, and you could use the funds.", "action_results": [{"action": "Become full allies with the Tau Empire", "result": "You extend your hand, smiling.\n\n\n\"Alright. We'll become your full allies for a payment of thirty million Thrones.\"\n\n\nThe Tau negotiator grins, shaking your hand.\n\n\n\"Please, it's not a \"payment\". Consider it a gift. Consider us funding you as proud allies of the Greater Good, so you can do what's necessary.\"\n\n\n\"Terrific,\" you reply. \"Well, I suppose that's all we have to discuss. We're ready to go.\" \n\n\n\"The Tau forces to join you will join you in a few minutes,\" Varoh says. \n\n\nYou nod, say your goodbyes and head back towards your shuttle. You arrive, finding a small squad of Tau Fire Warriors waiting for you. One works forward, saluting.\n\n\n\"Sir! I am Shas'Ui T'au Kais Ranar. The rest of the Tau auxiliary forces to be placed under your command are taking shuttles to your ship.\"\n\n\n\"Perfect,\" you say. \"I'll have Primus sort you out with your beds and all that.\"\n\n\n\"Understood Sir, thank you sir,\" Shas'Ui Ranar says. \n\n\n\"Just head to whatever shuttle you have, and get aboard the ship,\" you say, turning and walking off.", "action_results": [null]}, {"action": "Take Kyros' deal", "result": "You extend your hand, smiling.\n\n\n\"Alright. What's good enough for Kyros is good enough for me. I'll take the deal you had with me.\"\n\n\nThe Tau negotiator smiles and nods, shaking your hand.\n\n\n\"Please, don't even pause in talking to us for support. If you ever find yourself tiring of the life of a rover, we'd be more than happy to find you a position in the Empire.\"\n\n\n\"Great,\" you reply. \"Well, I suppose that's all we have to discuss. We're ready to go.\" \n\n\nYou quickly say your goodbyes and head back towards your shuttle. ", "action_results": [null]}, {"action": "Sign a bare minimum non-aggression pact", "result": "You nod.\n\n\n\"Alright. We'll sign the non-aggression pact, but that's it.\"\n\n\nThe Tau negotiator nods solemnly, before smiling \n\n\n\"Understood. But please, don't even pause in talking to us for support. If you ever find yourself tiring of the life of a rover, we'd be more than happy to find you a position in the Empire.\"\n\n\n\"Great,\" you reply. \"Well, I suppose that's all we have to discuss. We're ready to go.\" \n\n\nYou quickly say your goodbyes and head back towards your shuttle. ", "action_results": [null]}]}, {"action": "Visit the Kabal of the Bleeding Thorn", "result": "\"Uh... Karth?\" your pilot asks nervously through the speaker, as the shuttle docks into the ship. \"Do... do I get one of your bodyguards? Best to keep an escape route open, right?\"\n\n\n\"Yeah, I'll do that,\" you respond, nodding to the massive, gas-mask wearing Tribal Opie and a gladiator holding a pair of plasma pistols. \n\n\n\"Got it, boss,\" the gladiator says, as you look around at the rest of your group.\n\n\nSeeing as the Dark Eldar are almost certainly the most likely group to betray you of any in the Galaxy, you've stocked up on guards. The best of your forces surround you, ready to die for you. You've left your lieutenants on the ship so if it does go to shit, you'll have the majority of your leaders intact to continue your work. Only Fay has come with you, as your attempts to get her to stay led to her threatening to\n\n\n\"Knock out your teeth without needing to put her hand in your mouth\". You didn't ask whether she'd punch out the back of your head, or go a... darker route.\n\n\nThe shuttle doors open, as your group raises their weapons. Three Dark Eldar stand there, there outfits adorned with blades and spikes. They're tall, dark figures, with a sense of misery reeking off them.\n\n\n\"Good evening,\" the only unhelmeted one says, its lips twisting upwards in a sick mockery of a smile.\"\n\n\n\"You must be Archon Merideza\"\n\n\n\"Absolutely. I assume it's a pleasure,\" the Archon grins.\n\n\n\"You were allies to my predecessor, yes? Kyros?\" you ask.\n\n\n\"Ah, yes. Kyros. Such an unfortunate man. I remember when he first came to me having such delusions of grandeur. Ending slavery, crushing Terra, becoming Emperor of Man! What a dreaded fool!\" the Archon says, her grin looking more and more predatory with every minute. \"I'll assume you're not as idiotic, are you?\"\n\n\n\"I'll be optimistic and assume I'm not. I'm here to negotiate a non-aggression pact and an allian...\"\n\n\n\"Yes, yes, this was expected. Well, we'll be clear. I assume you know of us and our past. I won't try to deceive you with lies, seeing as it'll be obvious. We're raiders. We raid the weak. You, however, are not weak, and not worth raiding. Stay strong, and that'll act as a non-aggression pact. Now, in terms of an alliance... if you're asking us to come to your aid when you're in trouble, we won't. We don't expect that of you.\"\n\n\n\"So, is that it, then?\" you ask.\n\n\n\"No. We'd like to extend the offer we had with Kyros. When we're raiding, you can join us for raids on more high value, heavily defended targets, and we split the reward.\"\n\n\n\"We'll keep it in mind,\" you say guardedly.\n\n\n\"Terrific!\" Merideza smiles.\n\n\n\"So... we need to talk specifics. What forces do you control, and what raider groups have pledged themselves to you?\"\n\n\nThe Archon's \"smile\" droops, revealing a sneer that looks to be her face's natural position.\n\n\n\"We'll tell you about a job that needs assistance with, you'll tell us if you're willing and able to help us on it. That's it. Understood?\"\n\n\nYou glare at the Archon, before nodding slowly.\n\n\n\"Surely if this was all you were willing to say, we could've done this through comms without me needing to come all the way out here.\"\n\n\nMerideza smiles once more.\n\n\n\"I wanted to look you in the eyes,\" she says.\n\n\nYou stare at Merideza, before getting back into the shuttle.", "action_results": [null]}, {"action": "Visit the Dogs of War", "result": "Your shuttle docks with the Hound of Iron. You rap your knuckles against the shuttle's doors, which open as your more military minded lieutenants, Fay, Olive and Hayes, stand up from their seats.\n\n\nThe inside of the station is like a market. Men negotiate in front of displays of weapons and monitors showing forces fighting. Immediately, a large, bulky woman wearing robes walks over, grinning.\n\n\n\"Greetings, sir! How may I help you? Are you looking to hire a force of Dogs of War, or would you instead like to offer your services to the company? Or is there something else I could do for you?\" \n\n\n\"My name is Karth. We...\"\n\n\n\"I have a Karth of the Bleeding Warthogs, a Captain Karth of the Joyous Hymn and a Karth of the Roar of the Vortex,\" she says, interrupting you as she scrolls through a datapad.\n\n\n\"The last,\" you reply, as the woman nods.\n\n\n\"Perfect,\" she says. \"I'll take you to Christian.\"\n\n\nYou nod, and begin following her along the hallways, staring at the clients and mercenaries being hired from the station. A badly mutated human with six eyes is examining a squad of bestial-looking men, a rich patron talks to a heavily cybernetically modified Kroot alien who's presenting his sniper rifle, a grizzled soldier discusses plasma weaponry with a grinning woman. \n\n\nSoon, you pass through the section devoted to sales, and enter the guts of the ship. You enter a large elevator alongside a trio of massive Ogryn, who seem nervous from the tight space. After a short ride in the elevator, you arrive in what you assume is the main... \"office\", for lack of a better word, of the Dogs of War's leader. A massive space marine, out of his armor but still easily noticeable for his stature and appearance, sits in a large chair, looking at some reports. He looks up, expectantly.\n\n\n\"Thank you, Ms Lin. I'm sorry, I don't believe we've met. And you are?\"\n\n\n\"Karth,\" you reply.\n\n\n\"I'm very sorry, but we do a lot of business. Are you the leader of the Bleeding Wart...\"\n\n\n\"For fuck's sake,\" you groan. \"I'm the psyker that killed Kyros. I mean like, I'm named for a tribal god on a tiny planet. How common can that name be?\"\n\n\n\"My apologies. My name is Chapter Master Christian Firenza of the Dogs of War.\"\n\n\n\"You had an alliance with Kyros,\" you say. \"Please, tell me about it.\"\n\n\n\"Kyros had a long-standing agreement with us. Earlier in his career, he'd lend his forces to us for the more important mercenary contracts. Later on, we promised to support his assault into imperial space.\"\n\n\n\"You're not looking for reven...\"\n\n\n\"Revenge? Oh of course not. We're mercenaries. You've taken over Kyros funds. What reason would you have to fight? Out in this space, the only thing worth fighting for is money. So, was there more? If you need military forces, we would happily provide them for a fee. We're also more than definitely willing to hire you out as a mercenary force to make you some profits.\"\n\n\n\"Nothing at the moment, although we might take you up on the military offer soon enough.\"\n\n\n\"Perfect. Well, feel free to browse,\" the Chapter Master smiles.\n\n\nYou spend an hour or two looking into the various mercenary groups working for the Dogs of War. They certainly have a large force, but none of their forces are loyal to them. They're loyal to their thrones. Still, perhaps you should consider hiring yourself out to them. You could make a fair amount of money through this, admittedly. None the less, you soon return to your shuttle and head back to the ship.", "action_results": [null]}]}]}]}]}]}]}]}]}]}, {"action": "Spew forth a whirlwind of flames", "result": "Your body is surrounded by a whirlwind of flames, which quickly begin to blast the howling Behemoth. You fire a jet of flames down the maw of the beast, which begins to burn the the pale gray flesh inside a dark black. The beast lets out a dry gasp, toppling forward as its internal organs cook. ", "action_results": [null]}]}, {"action": "Fire a burst of flames", "result": "You fire a burst of psychic flames, which immediately begins scorching the beast. The Behemoth lets out a howl, as its skin begins to char and burn under the heat, its stony armor cracking under as the flames burn it. The Behemoth howls.\n\n\n“Ha! It’s good to be killing again!” Castus yells.\n\n\n“Flames are its weakness! Grab whatever you can and burn this fucker to the ground!” Hayes yells.", "action_results": [null, null, null]}, {"action": "Fire some psychic bolts", "result": "You fire dozens of bolts of psychic energy, which smash into the beast's stony exterior as it fails to even damage it. The creature seems indifferent to your attacks, instead charging forward and swatting at you. You float to the side, as Hayes quickly arrives, raising his rifle and firing. As expected, the las beam has no effect.\n\n\n“Ha! It’s good to be killing again!” Castus yells.\n\n\n“Fuck, we’re not getting through this. Maybe we up the armament?” Fay says.\n\n\n“Go for the eyes and the inside of the mouth!\" Hayes yells, firing his gun.\n\n\nWell, that didn't work. Time for something else.", "action_results": [null, null, null]}]}]}, {"action": "Urge Castus to continue with the hunt", "result": "\"We need to hunt,\" you say.\n\n\n\"Fuck off,\" Castus says.\n\n\n\"Castus, for fuck's sake. The behemoth could be anywhere! We need to find it!\"\n\n\nThe comm bursts to life.\n\n\n\"Got a sight on it! Fuck, it's a big one!\" Olive says over the comms.\n\n\n\"Found it,\" Castus says. \"Well, let's roll, then.\"\n\n\nCastus climbs out of the water, quickly hurrying along towards Olive's path.", "action_results": [null]}]}, {"action": "Take the undergrowth path with Fay", "result": "\"I'll go with Fay,\" you say.\n\n\n\"Perfect, let's go,\" Fay says.\n\n\n\"Yeah, let's,\" you reply.\n\n\n\"It'll be just like old times. Except you'll be there,\" Fay smiles. \"Alright, let's go.\"\n\n\nYou quickly head along the undergrowth path alongside your old friend, as she raises her bolter, pretending to fire at the alien birds flying overhead..\n\n\n\"Bang! Bang!\" she says. \"Fuck, my trigger finger's getting itchy.\"\n\n\nYou hover into the air, staring for any signs of the creature.\n\n\n\"So, either this creature is eerily good at not disturbing foliage, or he didn't come this way?\" you say.\n\n\n\"What would you know about disturbed foliage?\" Fay asks.\n\n\nYou flick your wrists, as Fay hops into the air, grabbing a branch as you telekinetically knock her legs away. She holds herself up by the tree branch, before dropping back down.\n\n\n\"Didn't get m...!\" she begins to say, before you flick your wrists again and send her tumbling onto her stomach. \"Dickhead.\"\n\n\nYou laugh, hovering over to her, before dropping onto her as she rolls over, pressing your forehead against hers. \n\n\n\"It's nice being out,\" you say.\n\n\n\"You know, we are on a hunt,\" Fay smiles. \n\n\n\"It's not my fault. You're distracting me.\"\n\n\n\"You're the one who chose to come with me here,\" Fay laughs, kissing you warmly on the lips.\n\n\n\"Do you regret that choice?\" you say, running your hand up Fay's thigh, as you...\n\n\nThe comm bursts to life.\n\n\n\"Got a sight on it! Fuck, it's a big one!\" Olive says over the comms.\n\n\n\"Fuck!\" you say. \"Do we really need to help?\"\n\n\n\"I'm not letting the gladiators beat me out! Fuck them!\"\n\n\n\"Let's go!\" Fay says, as you levitate off her.\n\n\n\"Fine,\" you groan.\n\n\n\"Come on!\" she says, hefting her bolter up and sprinting towards the trees.", "action_results": [null]}, {"action": "Take the tree path with Olive", "result": "“I’ll go with Olive, then,” you say.\n\n\n“I got the psyker genius, then. Terrific,” Olive smiles, twirling her rifle around in her hands.\n\n\n“Let’s go,” you say, heading down towards the twisting path of trees.\n\n\nYou head down the path for a few minutes, before something occurs to you.\n\n\n“Why would a big monster go down this path? The trees would give it like zero mobility.”\n\n\n“I don’t know,” Olive says with a shrug. “It could’ve been scratching itself off the trees. Is that something predators do?”\n\n\n“Maybe, you shrug, wlaking along th epath.\n\n\n“So, you see any tracks?” Olive asks.\n\n\n“How would I know? I’m not a hunter.”\n\n\n“You’re a feral… I mean, tribal. Whatever the fuck you guys like being called. Surely you learned how to track and hunt?” \n\n\n“Have you seen my skinny arms? I couldn’t throw a spear, let alone kill something with it. No one taught me to hunt. I was a shaman. You’re a warrior? Surely you were taught to hunt?”\n\n\n“I’m a gladiator. I know how to fight duels, and I’ve learnt over time how to apply that to larger fights. I sure as hell don’t know how to hunt.”\n\n\n“Didn’t you hunt as a kid?”    \n\n\n“No,” Olive says. “I was born a slave.”\n\n\n“Oh,” you say. “Sorry to hear that.”\n\n\n“That’s life,” Olive says. “You can fly, maybe try levitate up above the trees, see if you can see anything.” \n\n\nYou nod, floating into the air. The shackles of gravity attempt to pull you downward, but with a pulse of psychic energy you escape them and float to the tree tops, staring around. Surrounding you is a seemingly endless green of leaves and moss. You must admit, it’s quite a beautiful sight.\n\n\nSuddenly, you hear the rumble of the ground. From the bursts of the earth, a massive creature covered in thick, stone-like grey skin bursts forward. Its red, spider-like eyes peer at you, perhaps confused by the addition of you to its environment, before turning to focus on Olive, who’s babbling into her radio.\n\n\n\"Got a sight on it! Fuck, it's a big one!\" Olive says into the comms, as you drop down to face the beast, now seeing it clearly. \n\n\nIt stands twice the height of even a space marine, and easily six times as wide, on four clawed legs. It’s skin is grey, seemingly covered in scales that remind you more of the stones themselves rather than the hide of a beast. Its head is like that of a spider’s, hissing at you as it raises its massive, stony clawed arms to swipe at you. You hover back, feeling electricity coarse through you as you prepare for a fight.", "action_results": [null, null, null]}]}, {"action": "Go bathe with Elios", "result": "\"I'll go bathe with Elios,\" you say.\n\n\n\"Perfect, darling,\" Elios grins. \"Let's go.\"\n\n\n\"Cool, let's go hunt,\" Fay says, leading her group off into the woods.\n\n\nElios looks at you, smiling.\n\n\n\"Come on, Karth, let's go.\"\n\n\nYou follow Elios, who quickly leads you to the side of the river. Elios leans against a tree, staring at you as he smiles.\n\n\n\"Well then, honey. Go on. Undress,\" he says.\n\n\nYou stare at him nervously, before unclasping your robes and letting them fall to the ground. \n\n\n\"Ooh, darling. I like what I see,\" Elios says, as he loosens the straps of his leather armor, pulling it away and tossing it to the ground, revealing Elios' long, muscled legs, and a certain surprisingly big organ. Elios dives into the pool, surfacing and lying partially submerged along the shores. \n\n\n\"Well, come on,\" Elios commands.\n\n\nYou dive into the water. You gently swim to the shore, and lie partially in the water, basking in the sun.\n\n\n\"You look tense, darling,\" Elios says. \"It must be a stressful life for you. So many responsibilities. So many daemons scratching at the inside of your skull. Such awful, awful stress. You need a back rub, darling.\"", "action_results": [{"action": "Accept Elios' offer", "result": "\"Um... fuck it, fine,\" you say.\n\n\nElios slides over, placing his hands on your back. He begins to massage your muscles with some skill, causing you to groan in ecstasy as he expertly relieves all your stressed out muscles. You do notice his hands beginning to wander towards your ass and genitals. You feel like you should be stopping him, but fuck, it's a good stress reliever.\n\n\n\"You know,\" Elios purrs. \"I could help you relax in a more... sensual way. Trust me, the joys of Slaanesh are endless. And lust... trust me, that is a joy that knows no bounds.\"", "action_results": [{"action": "Accept once more", "result": "You stare at Elios for a moment, wondering if this is the best course of action, before nodding.\n\n\n“Alirght, let’s see how this goes then,” you say nervously.\n\n\nElios slides over, smiling at you.\n\n\n“Trust me, baby. I don’t bi… well, that’s not a hundred percent true. I won’t hurt you… unless that’s what you’re into. Just… trust me,” Elios whispers, as his warm mouth presses into your neck, kissing you softly.", "action_results": [{"action": "Later...", "result": "Over the next… however long, Elios does show you certain temptations of the flesh that make it obvious how he’s amassed such a following for a god that clearly couldn’t give a flying fuck about their lives. Slaanesh seems to have bestowed her followers with, among other things, endurance, flexibility and the enlargement of certain body parts. By the time the sun is setting, you’re lying on the shore of the river, panting, and feeling exhausted, ecstatic and to ve frank, worn out. Elios seems disappointed that you’re out of breath and attempts to coax you back into love making, but you’re spent, in multiple ways. In your mind, over the grumbling of the others you can hear Fucky cheering.\n\n\n“Yes! Yes! YES! Another round, boy! We’re hardly finished, are we? I though this was the foreplay! Cursed, let me take over! Just for a few minutes, lessen your mental restraints! Trust me, you’ll enjoy it!”\n\n\n\"Break! Shatter! Fuck! Kill! I'll tear that dishonorable whore in two!\" Smiley roars.\n\n\n“For once, Bloody one, I agree. Come Karth, let’s… split Elios in two,” Fucky laughs.\n\n\n“So, you’re finished already?” Elios asks.\n\n\n“Yeah, I am,” you reply.\n\n\n\"Shame,” Elios says, grabbing his trousers and fishing out a packet of cigarettes from them. He pulls two out, putting one to his lips and holding the other out to you.\n\n\n“Well go on, honey,” Elios says.\n\n\nYou take the cigarette, putting it between your lips, before looking expectantly at you.\n\n\n“Come on, my daemonic little cherub. You’re my light.”\n\n\nYou flick your fingers, as your hand sets alight, as do the tips of both of the cigarettes. You press it to your lips, sucking in.\n\n\n“Unless Kyros’ little experiments moved your lungs to the back of your throat, which I highly doubt seeing as I would’ve punctured them during that little exercise, you’re not inhaling.”\n\n\nYou nod, taking a deep inhale, before immediately releasing your breath and spluttering out the smoke as your vision goes hazy.\n\n\n“There, there. Smoke ‘em up, little psyker,” Elios says. “We best leave soon, and Elizabeth does nothing but complain if we smoke on the dropship. Still seems to be fine with Hayes doing it, though.”\n\n\n“I thought we were supposed to be here for several hours,” you say, confused.\n\n\n“How long do you think we spent… encoiled?” Elios asks.\n\n\n“An hour? Two,” you ask.\n\n\nElios smiles slyly, gesturing towards the stars as they appear in the faint sky.\n\n\n“It’s been more than a few hours, little one. Let’s head out, then,” Elios grins.\n\n\nYou inhale once more, before tossing it over your robes and shifting them until you gain the appearance of someone who isn’t moments after being fucked for more than a few hours. Then, you begin to saunter off towards the dropship.", "action_results": [null]}]}, {"action": "Decline", "result": "\"No, no thanks. I'm fine. That's enough,\" you say, as Elios whimpers.\n\n\n\"Oh, pity,\" he says. \"Not even a little?\"\n\n\n\"No, Elios,\" you assert.\n\n\n\"Shame,\" Elios says.\n\n\nThe rest of the bathing experience is fairly peaceful. You wash, relax and just take your mind off the world. Soon, you notice the sun is setting.", "action_results": [{"action": "Finish bathing", "result": "\"Sun's setting,\" Elios says. \"We better go.\"\n\n\n“I thought we were supposed to be here for several hours,” you say, confused.\n\n\n“How long do you think we bathing?” Elios asks.\n\n\n“An hour? Two?” you ask.\n\n\nElios smiles slyly, gesturing towards the stars as they appear in the faint sky.\n\n\n“It’s been more than a few hours, little one. Let’s head out, then,” Elios grins.\n\n\nYou inhale once more, before tossing it over your robes and shifting them until you're dressed normally. Then, you begin to saunter off towards the dropship.", "action_results": [null]}]}]}, null]}, {"action": "Meditate with Elizabeth", "result": "\"I'll go with Elizabeth. Could use a chance to meditate and relax,\" you say.\n\n\n\"Oh, OK,\" Elizabeth say. \"Let's go\"\n\n\nYou bid your companions farewell, before walking down the path alongside Elizabeth.\n\n\n\"Yes... she'll open your mind. Let the psychic powers of the Warp flood through you,\" Question Mark says.\n\n\n\"Uh, she's a Tzeentch follower. Always using pawns who could betray you, or being another's pawn. No loyalty. No unity. No peace,\" Rotgut groans.\n\n\nYou both stop in a small glade in the forest, as Elizabeth looks around.\n\n\n\"Yes, this'll do,\" she says, pulling her satchel off her shoulder and lying it on the ground. She begins digging through it, pulling out several things. \n\n\n\"Is there a particular smell or scent you have that comforts you?\" Elizabeth asks.\n\n\nYou stop for a moment, wondering.\n\n\n\"What do you have, exactly?\"\n\n\n\"Promethium oils, cut grass, Cornyl powder, Grox Heart Spice and Rotting flesh.\"\n\n\n\"Rotting flesh?\" you ask.\n\n\n\"Oh, the best kind!\" Rotgut says.\n\n\n\"Some psykers are weird,\" Elizabeth shrugs.\n\n\n\"I'll go with Promethium, then,\" you say, as Elizabeth nods.\n\n\nElizabeth takes out a small golden pot of black oil, setting it on fire. A light smoke rises from the pot as you take a whiff of the scent.\n\n\n\"Sit like this,\" Elizabeth says, as she crosses her legs and arches her back.\n\n\nYou do the same, and take a deep breath.\n\n\n\"Through your nose,\" Elizabeth says, as you comply.\n\n\nYou close your eyes, and slowly breath. You hear Elizabeth stand, as she walks over, putting her hand on your chest.\n\n\n\"In, out. In, out,\" she says, as you slowly breath in and out. \"I'm going to gently prod at your mental defenses. Try not to kill me, OK?\"\n\n\n\"Got it,\" you say. \n\n\nYou feel an outside present close around your mind. It pokes and prods and for a moment you feel nervous, before you realize just how much more psychic energy you have inside you compared to Elizabeth. Finally, Elizabeth stops, and you open your eyes.\n\n\n\"Finished?\" you ask.\n\n\n\"You're a lot more powerful than I thought you were,\" Elizabeth says, a hint of nerves in her voice.\n\n\nYou nod, smiling. \n\n\n\"Damn right,\" you nod.\n\n\n\"So, did Kyros ever teach you about seeing the future?\"\n\n\n\"No,\" you say. \"Go on.\"\n\n\nElizabeth takes out a stack of runes and a mirror. She places the mirror beneath you, before handing you the runes.\n\n\n\"Flood your psychic energy into the runes, then scatter them on the mirror, and gaze into it. Try picture a swirling whirlpool, understood? You're powerful, so you should excel at this.\"\n\n\n\"Yes... embrace the psychic powers... search for answers...\" Question Mark says.\n\n\nYou take the runes, and slowly flood them with energy, which they easily absorb, with etchings on them glowing purple.\n\n\n\"Remember, the future is chaotic and uncertain. Anything you see will be possible and likely, but not certain. Understand that. Don't forget, there are agents in the Warp who would love to confuse you. Whilst the things you see will be potential futures that could likely happen, they could easily be misleading.\"\n\n\n\"Got it,\" you say.\n\n\n\"Most psykers only see a few faded images in the reflection, if that. You? You're seriously powerful. Who knows where it'll go for you?\"", "action_results": [{"action": "Toss the runes and gaze into the mirror", "result": "\"Let's do it,\" you say, casting the runes onto the mirror. The area around the runes begins to shimmer and swirl as the entire mirror begins to shimmer and morph into a picture. Suddenly, vivid sensations begin to run through your mind as you begin feeling sick.\n\n\nYou watch as your Tribals are shot in the back in some muddy field by a squad of space marines clad in white, as a deep, booming voice howls \"Betrayal!\" Another, darker voice in the distance laughs, with a shrill, higher pitched laugh from within the first voice.\n\n\nA space marine without a helmet, wearing ornate golden robes over his power armor, holding a bolt pistol golden staff topped with a snake, with two Sapphires as the eyes, stands in front of you in a black void. He realizes you can see him and lets out a curse, as darkness covers him and he disappears from your view.\n\n\nA pair of young girls, seemingly around sixteen, one in a black robe wearing a white, featureless mask, the other wearing a white robe with a black, featureless mask, stare at you, the White Mask laughing as the other just stares blankly. Standing between the two children is a man with completely black eyes, covered from head to toe in tattoos detailing howling daemons that seem to be tearing into the man's flesh, who just stares blankly ahead, a look of pain and hatred in his eyes, although it's not focused on you. Behind them is an endless black void, one that slowly pushes forward as a liquid wave of all-encompassing, all-destroying darkness.\n\n\nYou sit in a tiny, blank room, screaming as the walls seem to scream back. There's nothing, just unending nothing, as you feel pure shock at your predicament.\n\n\nA thousand voices scream in your mind as the psychic energy floods into you, all screaming for freedom as you feel ascension take over.\n\n\nYou pull back, taking a deep breath as you gaze down as the mirror. \n\n\n\"See anything interesting?\" Elizabeth asks.\n\n\n\"Yeah. It was interesting,\" you say.\n\n\n\"You didn't see anything about me poisoning tea or anything, did you?\" Elizabeth asks in a dead pan voice.\n\n\n\"No,\" you say, quizzically. \n\n\n\"Good,\" Elizabeth says, taking out a flask from her satchel, offering it to you. \"Have some tea?\"\n\n\nYou laugh, as Elizabeth begins drinking the tea.\n\n\n\"I never pictured you as the comedic type,\" you say, having a sip of the tea.\n\n\n\"I tell a joke every once in a full moon,\" Elizabeth says. \"So, if we're going to be training in our psychic abilities, we best focus on the classic mental safety techniques to avoid your mind being taken over by daemons. Tell me, has another daemon stepped into your head to replace Meliodas?\"\n\n\n\"Four,\" you say. \n\n\n\"Ah. I'd assume one for each Chaos God, yes?\"\n\n\nYou nod.\n\n\n\"Yeah, that's right.\"\n\n\n\"Look, just relax again. We'll run through some excercises.\"", "action_results": [{"action": "Hours Later...", "result": "Over the next few hours, you do various other exercises to relax and calm down. After a few hours of work involving breathing techniques, trance-like states and practicing with other types of psychic powers that you don't really specialize in, you notice the sun setting.\n\n\n\"We need to get back to the dropship,\" you say.\n\n\n\"Yeah,\" Elizabeth says. \"This was good. Good practice.\"\n\n\n\"Let's get out of here,\" you say, standing. ", "action_results": [null]}]}, {"action": "Change your mind", "result": "\"No, I'm fine, actually. There are some things man's not meant to know.\"\n\n\n\"Oh. Knowledge is power, Karth. If you weren't willing to take power, you probably should've found a planet and lived out a peaceful life.\"\n\n\nYou shrug, as Elizabeth looks around awkwardly.\n\n\n\"There's... really not much else to be done, then. If I were you, I'd go see if I can catch up with the hunters.\"\n\n\n\"Alright then,\" you say. \"Um... thanks.\"\n\n\nElizabeth nods, and you turn, levitating off.", "action_results": [null, null, null]}]}]}]}]}, {"action": "Ban", "result": "You ban the drugs, which does admittedly lead to a fall in the general morale levels among the ship. It's a shame they're incapable of understanding why this is a good thing.\n\n\nStill, in banning the drugs, you stop the medical issues that most likely would've spread through the ship with allowing these drugs to spread through the ship.", "action_results": [null]}, {"action": "Restrict", "result": "You begin restricting the amount of chems coming aboard, making sure not too much are given to each section of the ship, make sure only the safest are put through. The population, idiotic as they may be, react awfully, almost as badly as if the drugs were banned outright.\n\n\nAdditionally, you're forced to dedicate a portion of your men to enforcing these restrictions, as since the drugs aren't banned outright it means that the chem pushers have the ability to exploit, meaning you have to dedicate a force of soldiers to enforce these restrictions. \n\n\nStill, in restricting the drugs, you stop the medical issues that most likely would've spread through the ship with allowing these drugs to spread through the ship.", "action_results": [null]}, {"action": "Allow and include in rations", "result": "You allow the drugs, as well as adding them to the rations, giving each resident coupons to report to their nearby medical agent for whatever precious, delightful drug fuels them. Unfortunately, the program ends up end costing you a solid five million Thrones, as well as doing some damage to your men's efficiency. \n\n\nDespite that, morale increases substantially. It seems when men are off their heads, they're more than happy to risk their lives.\n\n\nThe success of this policy, or at least the success in that you're capable of manufacturing drugs aboard the vessel, does give you an idea. You could easily set up a chem manufacturing industry aboard the ship to increase the funds you have to work with. You'd need to find a new group of cooks as well as a supplier, but it could prove to be a profitable venture.", "action_results": [{"action": "Attempt to break into the drug industry", "result": "It takes some explaining and effort to get the lieutenants to agree. While as soon as Elios hears about it he's on board and the other Staine Siblings agree, Fay and Olive don't seem to be fans of idea. Castus agrees whole heartedly, and Primus, Cain, Hayes and Meliodas are indifferent and just agree, placing the majority. You quickly find the most knowledgeable about drug manufacturing of your lieutenants, Primus, Elios and Elizabeth, and gather them in the war room.\n\n\n\"Why is Elizabeth here?\" Elios asks. \"She's never touched a chem in her life.\"\n\n\n\"Do you know about Methoxetamine, Elios? About it's use on the brain?\" Elizabeth asks.\n\n\n\"Oh, you wanted a nerd,\" Elios says. \"Understood, darling.\"\n\n\n\"Our crew's not good enough to manufacture chems for market,\" you say. \"We need to f ind someone better. Primus, anything showing up in your archives?\"\n\n\n\"Pirate chatter tells me that the best... \"product\" coming through is from either the Hiveworld of Outice-81 or the Xenos species Jatkiri. Both sell a good product, so we could easily hire them.\"", "action_results": [{"action": "Attempt to hire the chem manufacturers of Outice-81", "result": "You stare down at the hiveworld from the bridge of your ship, looking at the planet. To your surprise, the Imperials hold barely any hold on this world. The Governor is basically in charge of everything, the Planetary Defense Force is bolstered by Imperial Guard deserters and Xenos Mercenaries, and they seem indifferent in regards to everything else. \n\n\nAfter a short time in a shuttle, you find yourself descending into Hive Beta, to meet with the leader of Outice-81's thriving drug industry. You sit alongside a half dozen Tribals, including Opie, the gas-masked giant you saw fight, as well as Fay, Elizabeth and Elios.\n\n\nThe doors open, and a solid scent wave of shit hits you, causing you to retch. You walk outside, looking at the dozens of ultra-poor workers hurrying about their day. Two men wearing red leather dusters stand by the landing area, holding shotguns, wearing sunglasses and black balaclavas. The men stroll towards you, staring blankly ahead.\n\n\n\"Howdy,\" one says, staring at you. \"You must be Mister Karth. And these are...?\"\n\n\nYour lieutenants state their names, as the man nods.\n\n\n\"The name's Cheq. I'll be taking you to meet the boss.\"\n\n\nYou nod, following the guard as he strolls through the streets. It takes about five minutes of walking through peasant markets, shit-filled alleys and endless scenes of the vile life of the area. Soon, you find your guard pulling open a large metal door to enter a large, bunker-like area. You walk inside, finding yourself in the bunker, which is particularly cleaner than the slums outside the bunker. You soon find yourself faced with a massive man with heavily burned skin wearing the same outfit as the guards.\n\n\n\"Karth, yes?\" he asks. \"Good to meet you. I'm Skinrik. From what your number two says, you want to purchase some cooks' contract from me.\"\n\n\n\"Number two?\" you ask.\n\n\n\"The dude with the voice synthesizer. Primus.\"\n\n\n\"Ah, yes,\" you say. \"Yes, he's correct. What do you have for me?\"\n\n\nSkinrik smiles, before walking along the hall. You follow and soon find yourself in a massive chem lab. A half dozen workers slave away at various pieces of equipment, pouring vats of chemicals into vibrating vats and other strange things. \n\n\n\"Zero!\" Skinrik yells.\n\n\nA young woman wearing a boiler suit and a gas mask turns from mixing a vat of burning liquid and jogs over to you.\n\n\n\"Yes, sir?\" she asks.\n\n\n\"This is the finest cook in the sector,\" Skinrik says. \"And the most recent of my fiances.\"\n\n\nZero nods nervously, looking at you.\n\n\n\"This... this is the... the psychic guy?\" she asks.\n\n\nYou nod, and she takes a deep breath, looking terrified.\n\n\n\"Are you alright?\" you ask. \"We don't bite.\"\n\n\n\"He doesn't speak for me,\" Elios says, as you frown as the Slaaneshi leader.\n\n\n\"Play nice,\" you say, before turning to Skinrik once more.\n\n\n\"Zero had some issue with psykers. She was the main cook for the Green Snakes gang, who were wiped out by the psyker gang the Mind Men. Only reason she and her cooks are alive is because I took them in.\"\n\n\n\"Uh... yeah,\" Zero says, a flash of annoyance appearing on her face before she goes back to her nervous look.\n\n\n\"They're the ones you're willing to sell me?\" you ask. \"You do realize that I'll need them full time, permanently, right?\"\n\n\n\"Of course,\" Skinrik nods.\n\n\n\"So you won't see your fiance... ever?\" you say.\n\n\n\"I can deal with it. I got six wives. Don't need another.\" \n\n\n\"Alright then,\" you shrug. \"How much are we talking?\"\n\n\n\"Zero's the best cook in the sector. You want her, you'll have to fork over a cool two and a half million. You want her cooks, that'll be five million. The equipment will set you back two more. I'll have the men repair and refuel your vessel to make it a solid ten million thrones. We have a deal?\"", "action_results": [{"action": "Agree", "result": "\"Fine,\" you say, grabbing your comms. \"Primus, ten million into Skinrik's account.\"\n\n\nIt takes about five minutes before the credits are transferred over, and Skinrik smiles.\n\n\n\"Good. Norwich, have the men transfer the equipment and have the cooks pack up. Transfer everything to the shuttles. Send up some fuel ships and repair vessels to fix up and fuel up the ship.\"", "action_results": [{"action": "Three Days Later...", "result": "You walk into the chem lab, watching the cooks working to manufacture their second batch. Zero spots you, walking over as she pulls off her gas mask. \n\n\n\"Sir,\" she says. \"The second batch is almost finished. What can I do for you?\"\n\n\n\"How are you all adapting to life on the vessel?\" you ask. \n\n\n\"It's alright. Conditions are better and the cooks are happier, so that's a plus.\"\n\n\n\"You're not sad to have lost your fiance?\" you ask.\n\n\n\"Fuck him,\" Zero says. \"That dude was a prick. He only wanted to add me to a tally of sex slaves he'd put a ring on. I didn't have a choice in it.\"\n\n\n\"Well then, glad you're not stuck with them anymore, Zero,\" you say.\n\n\n\"Yeah. Also, my name's not really Zero. It's Gail.\"\n\n\n\"Gail?\" you ask. \"What's with Zero?\"\n\n\n\"It's a gang name. Zero felonies, zero kills, zero chems ingested. I'm cut from a pretty plain cloth, sir.\"\n\n\n\"Alright. I'll call you Gail if you stop calling me sir.\"\n\n\n\"Got it, Karth,\" she smiles. \"I need to get back to work. I'm the only one who knows h...\"\n\n\n\"Say no more,\" you say, holding up your hands. \"We're working on finding you a supplier. We'll begin turning a profit soon.\"\n\n\n\"Terrific,\" she says, slipping her gas mask back on.", "action_results": [{"action": "Find a supplier", "result": "You head back to the war room, where Elios and Elizabeth are arguing.\n\n\n\"He's a genius!\" Elios yells.\n\n\n\"He's a drug-addled moron!\" Elizabeth replies. \"We need a businessman!\"\n\n\n\"Oh, fuck off! You...!\"\n\n\n\"Hey!\" you shout. \n\n\nThe two Staine siblings turn to look at you.\n\n\n\"What are you arguing about?\" you ask.\n\n\n\"We have two different candidates for a supplier,\" Elizabeth says. \"I want to use the Rogue Trader Lord Baridas Flynn. He's a respectable businessman who has access to a massive market, including the entirety of the Imperium, which Morrow can't access. He's already known for creating a massive drug empire, but his supply is low. We could fill that supply.\"\n\n\n\"He's got the Imperium's dick so far up his ass he's licking the tip!\" Elios says. \"He'll sell us out in a second! We need Jack Morrow, leader of the Ecstasy Freaks, a Slaaneshi war-band. The dude's psycho and is a bit prone to testing his products, but he's a genius, and I have old ties with him. We served alongside the Emperor's children together, and us non-Space marines really had to stick together to survive there. Trust me, you want him.\"\n\n\nFuck, a respectable businessman who might be an Imperial rat, or an insane, drug-addled fiend. Hard choice.", "action_results": [{"action": "Meet with Baridas Flynn", "result": "You find yourself aboard the Tip of the Spear, walking alongside your tribal bodyguards as well as Fay, Elizabeth and Elios. You walk into a massive chamber, where Flynn waits. He wears golden chains wrapped around fur, smiling happily at you.\n\n\n\"Ah, Karth, is it? It's good to see you!\" Flynn says.\n\n\n\"Ah, Lord Baridas Flynn, yes? It's good to see you. Shall we discuss business?\"\n\n\n\"Yes,\" the lord nods. \"Where are your other sibling? Durge the Plage Lord?\"\n\n\n\"He's not involved with this deal. So...\"\n\n\nSuddenly, a massive, see-through wall rises up from the floor as Flynn steps back, seperating him from you.\n\n\n\"I can't tell you how surprised I was to receive your message. Three Chaos Lords wanting to deal with me. I'll be honest. I'm corrupt. I'll happily use Xenos if it bets the Imperium, I'll sell illegal tech or chems but I won't consort with heretics. You actually have a fairly high bounty. Two Chaos Lords and an Alpha-Plus Psyker? Perfect. Burn in hell, heretics.\"\n\n\nSuddenly, the room goes dark, as you hear shouts as men rush in. The wall separating you and the Rogue trader is incredibly strong and anti-Psychic tech has infused it, but if you focus, you might be able to take out the Rogue Trader. Alternatively, you can prepare to defend against whoever Flynn has sent to take you out.", "action_results": [{"action": "Kill Baridas Flynn", "result": "You focus your energy, before telekinetically grabbing Flynn by the head and smashing it repeatedly againts the wall. His head is crushed and smeared against the glass, before collapsing onto the ground. You turn, before feeling a painful, dark presence fill your soul. You grunt as you see a pale man who feels like... pain, weakening all of your psychic powers before he fires his bolt pistol, killing you instantly.", "action_results": []}, {"action": "Defend yourself", "result": "You hear men flooding in, before turning as one heads immediately towards you. You raise your hands to fire a bolt of psychic energy, but the man, a pale, gaunt person with dark eyes, stares at you, his bolt pistol raised. You feel weak, sickly and miserable looking at him, as the energy floods out of you.\n\n\n\"Never faced a Blank, huh, Psyker?\" Flynn laughs.\n\n\nYou try to fight, but the Blank simply pulls the trigger, blowing out the back of your skull.", "action_results": []}]}, {"action": "Meet with Jack Morrow", "result": "Your shuttle docks into the Sword Thrust, as you slip a gas mask on over your mouth, as Elizabeth and the Tribals do the same.\n\n\n\"Your body won't be accustomed to the level of chems flooded into the air,\" Elios says. \"These guys really know how to party! Keep the masks on!\"\n\n\nThe shuttle doors open, revealing... no one. Huh.\n\n\n\"Where's Morrow, Elios?\" Elizabeth asks.\n\n\n\"Must be somewhere,\" he says, shrugging.\n\n\nYou walk through the ship, cringing at the scenes on display. A cultist walks out of a room, holding a long knife, covered in long cuts on his heavily scarred forearms. He looks at all of you, before collapsing. You pass a pair of cultists just screwing each other in the hallway, not even reacting to your presence. You nervously step over them, continuing on. Soon, you find Morrow.\n\n\nJack Morrow stands in a large room, in front of a mountain of bright crimson powder. He's completely naked, holding a machete and screaming at the roof.\n\n\n\"I thought you said he'd be unprofessional,\" Fay chuckles.\n\n\n\"I'm in love...\" Fucky sighs.\n\n\n\"Come on! Come on! Let's fucking do it!\" Morrow screams.\n\n\nJack shoves his face into the pile of crimson, and begins to snort it directly up his nose. He snorts for what seems like a solid minute, before swinging his machete around. He notices you all, grinning.\n\n\n\"Elios! Elios, you fucking scumfuck!\" he says, running over.\n\n\nYou expect the two to embrace, but... it doesn't go that way. Jack pushes Elios against a wall and begins kissing him, before grabbing Elios hand and cutting it open, and licking the blood. Then, he pushes your lieutenant away, grinning.\n\n\n\"Come! Do Blood Dust with me! It's good shit!\" he yells.\n\n\n\"Please, try it...\" Fucky yells.\n\n\n\"RAGE!\" Smiley roars.\n\n\n\"I'm on business,\" Elios says. \"We have an offer to make.\"\n\n\n\"Shoot,\" Morrow says, snorting more Blood Dust off his machete. \"Do your friends want some?\" \n\n\n\"I'll pass,\" you say, as your companions nod.\n\n\n\"The men with me want to become your business partners. We'll sell you chems, you distribute them. You still have clients?\"\n\n\n\"Yeah, man!\" Morrow grins. \"I have a dozen Slaaneshi war-bands calling for me, I'm hooked up with the pirates and raiders and shit in the sector, and I'll take whatever's left! YEAH!\" \n\n\nMorrow smacks himself in the face with the flat of his machete, laughing. He turns, grabbing a female cultist and pushing her onto the table. The cultist begins undressing, as the two begin making love... no, it's just fucking, fucking in front of you. You watch nervously as the act goes on for about a minute, before Morrow pulls out, snorts another line of Blood Dust, and walks back over to you, his member standing prominently in the air.\n\n\n\"Go on.. embrace it!\" Fucky says.\n\n\n\"Holy shit,\" Elizabeth says, stepping back.\n\n\n\"What's wrong, baby?\" Morrow asks. \"You want some? Trust me, I have another few goes in me. Bend over and pull up your robes.\"\n\n\n\"Fuck off,\" Elizabeth says, electricity running along her hands.\n\n\n\"Whatever. So, you had a deal for me?\"\n\n\n\"Yeah. Elios said he talked to you about the exact numbers, right?\" \n\n\nMorrow pauses, before nodding.\n\n\n\"Shit, yeah! Let me think, let me think! Given current market prices, net worth over a long term deal amounts to... what... Fuck, what currency do you use?\" Morrow says, shaking his head as he does more Blood Dust. \n\n\n\"Thrones,\" you say.\n\n\n\"That's about fifty million Thrones profit in the foreseeable future, take five for contact's ten percent finder fees and all that, another five to pay off the Imperials so we have access to the outlaw planets which will make up about twenty to thirty percent of our market, and... did I ask you if you wanted to fuck?\" he says, looking at Fay.\n\n\n\"I'll pass,\" Fay says, staring at the man as he nods vigorously.\n\n\n\"OK, OK! That's about forty million Thrones, wage levels cheap due to use of slaves, split two ways... this deal should net you around twenty million Thrones.\"\n\n\n\"I told you he was a genius. Did all that in his head,\" Elios smirks, as Elizabeth frowns.\n\n\n\"Do we really trust this guy, Karth?\" Elizabeth says.\n\n\n\"Fuck! You should probably not, bitch!\" Morrow screams as Elizabeth. \"I'll fuck you at first opportunity! Praise Slaanesh, I just want to push you against the wall and finger-fuck you! WHOA!\" \n\n\nMorrow slams his head against the wall, before stumbling backwards and collapsing onto the pile of Blood Dust.\n\n\n\"Shit... I need sleep. Do we have a deal, Elios?\"\n\n\n\"We need a bargain of f...\" Elios begins to say, before Morrow interrupts.\n\n\n\"I'll pay your half up front. Bargain of faith. If I do that, you promise to only supply me. We can make a new deal after the fifty million profit mark is hit. Deal?\"\n\n\n\"Sure,\" you say.\n\n\n\"I'll have one of the tech priests transfer it over,\" Morrow says. \"Now, I need to sleep. I haven't slept in a few... weeks.\"\n\n\nMorrow closes his eyes, lying against the floor.\n\n\n\"That man is a maniac,\" Fay says.\n\n\n\"Yeah. Let's get off this ship,\" you say.", "action_results": [{"action": "Continue", "result": "True to his word, Morrow does transfer over twenty million Thrones to your account. You ensure that he gets every shipment of chems you create, and ensure you have a solid business contact for this. The man's insane, but he's proven trustworthy for the time being.", "action_results": [null]}]}]}]}]}, {"action": "Decline", "result": "\"That's too much,\" you say.\n\n\n\"We're not lowering the price,\" Skinrik frowns.\n\n\n\"Then I suppose we don't have a deal,\" you say.\n\n\nSkinrik spits on the ground, before nodding at his guards.\n\n\n\"Take them back to their shuttle.\"\n\n\nAn hour later, you're back on your shuttle, heading back to the ship. You've had enough of this.", "action_results": [null]}, {"action": "Attempt to kidnap the cooks", "result": "Although telepathy isn't your strength, you send a message to your lieutenants and guards.\n\n\n\"Strike,\" you command subconsciously.\n\n\nYou look at Skinrik, sizing him up. You almost certainly need to kill him first.", "action_results": [{"action": "Set him alight", "result": "You fire a burst of flames forward, setting Skinrik alight. He screams as flames engulf his body, but grits his teeth. With a look of pure malice, he draws a shotgun from his side holster and charges forward, fighting through the pain. Your men raise their weapons but Skinrik is faster, and with a single shot blows off your head.", "action_results": []}, {"action": "Strike him down with a bolt of psychic energy", "result": "You blast a bolt of psychic energy forward, striking Skinrik in the chest and killing him instantly. Zero immediately draws the shotgun, raising it to your head.", "action_results": [{"action": "Kill her", "result": "You fire a bolt of psychic energy, killing her instantly as she collapses to the ground.\n\n\n\"Alright, let's bounce! This area's fucked!\"\n\n\nA group of gang members charge in, wielding autoguns and a few lasguns, blocking your exit.\n\n\n\"Kill them, get to the shuttle,\" you say.", "action_results": [{"action": "Fire a firebolt", "result": "You send a bolt of pure, infernal fire towards the enemies as they flood into the room. The fireball explodes, incinerating all of the men. Unfortunately, you're in a chem lab full of flammable liquids. The fire quickly ignites a vat, and you watch as it quickly sets aflame. You don't even have time to put up your shield before it explodes, killing you instantly.", "action_results": []}, {"action": "Overwhelm the enemy with bolts of psychic energy", "result": "You keep firing bolts of psychic energy, filling the air with psychic energy that wipes out scores of the enemy. Your Tribals and lieutenants push forward as many of the cooks are killed in the crossfire, but without Zero you don't have a head cook, so the plan's fucked anyway. The guards are untrained, badly armed and unarmored. Your men are infinitely better, so you easily manage to carve a path back towards the shuttle. It takes about an hour of slow fighting and you lose two Tribals to the gang members, but you soon find yourself at the shuttle. Your pilot is fending off gang members with the shuttle's autoguns, all whilst swearing.\n\n\n\"Shit! Fuck! Balls! S...! Oh, Karth! Holy fucking Grox shit, you're alive! I mean, sorry, Karth, glad to see you,\" Hawkins says. \"Let's get the hell out of here!\"\n\n\nThe shuttle lifts up from the planet, as bullets clang into the heavily armored cockpit.\n\n\n\"I was half-convinced you'd have left us,\" you say.\n\n\n\"No, sir,\" the pilot answers. \"Let's get out of here.\"", "action_results": [{"action": "Get out of here", "result": "You sit in the shuttle with your other lieutenants, leaning against the wall.\n\n\n\"Uh, that went badly,\" Elizabeth complains.\n\n\n\"Screw it,\" you complain. \"Fuck the drug industry. It's not working for us. Let's just get out of here, get back to work.\"\n\n\n\"Done,\" Fay says. \"Let's head out. ", "action_results": [null]}]}]}, {"action": "Knock the gun from her hands", "result": "You psychically knock the gun from her hands, grabbing her by the throat. \n\n\n\"You're coming with me. I'm planning on taking you and your cooks back to my vessel to cook drugs for me,\" you say.\n\n\n\"You realize if you try to force my men or I into shitty conditions or anything like that we'll just be able to poison the chems and have everyone of your customers after your head? We can end your entire career.\"\n\n\n\"I understand, I understand,\" you say. \"I'm not trying to fuck you over.\"\n\n\n\"Fuck!\" Zero says. \"How do I know I can trust you?\"\n\n\n\"Do I look so retarded you don't think I understand how easily you'd fuck me over.\n\n\n\"Fine,\" Zero says, biting her lip nervously before looking at her cooks. \"Green Snakes, follow the psyker. What's the exit plan, then, psyker?\"\n\n\nA group of gang members charge in, wielding autoguns and a few lasguns, blocking your exit.\n\n\n\"Kill them, get to the shuttle,\" you say.", "action_results": [null, {"action": "Overwhelm them with bolts of psychic bolts of energy", "result": "You keep firing bolts of psychic energy, filling the air with psychic energy that wipes out scores of the enemy. Your Tribals and lieutenants push forward as the cooks begin arming themselves and hiding behind you alongside Zero. The guards are untrained, badly armed and unarmored. Your men are infinitely better, so you easily manage to carve a path back towards the shuttle. It takes about an hour of slow fighting and you lose two Tribals to the gang members and a small number of cooks, but Zero and the majority of cooks survive, but you soon find yourself at the shuttle. Your pilot is fending off gang members with the shuttle's autoguns, all whilst swearing.\n\n\n\"Shit! Fuck! Balls! S...! Oh, Karth! Holy fucking Grox shit, you're alive! I mean, sorry, Karth, glad to see you,\" Hawkins says. \"Let's get the hell out of here!\"\n\n\nThe shuttle lifts up from the planet, as bullets clang into the heavily armored cockpit.\n\n\n\"I was half-convinced you'd have left us,\" you say.\n\n\n\"No, sir,\" Hawkins answers. \"What's with all the new people? I don't know if I'll be able to fit them...\"\n\n\n\"Pilot! Do you want make two trips?!\" you yell.\n\n\n\"Point taken, sir. They'll fit. Let's get out of here.\"", "action_results": [{"action": "Three Days Later...", "result": "You walk into the chem lab, watching the cooks working to manufacture their second batch. Zero spots you, walking over as she pulls off her gas mask. \n\n\n\"Sir,\" she says. \"The second batch is almost finished. It's hard, as we don't have all the equipment we had back on 81, but we're managing. What can I do for you?\"\n\n\n\"How are you all adapting to life on the vessel?\" you ask. \n\n\n\"It's alright. Conditions are better and the cooks are happier, so that's a plus.\"\n\n\n\"You're not... sad your fiance was killed?\" you ask.\n\n\n\"Fuck him,\" Zero says. \"That dude was a prick. He only wanted to add me to a tally of sex slaves he'd put a ring on. I didn't have a choice in it. Why else would I have joined up with you so easily?\"\n\n\n\"Fair point. Glad you're not stuck with him anymore, Zero,\" you say.\n\n\n\"Yeah. Also, my name's not really Zero. It's Gail.\"\n\n\n\"Gail?\" you ask. \"What's with Zero?\"\n\n\n\"It's a gang name. Zero felonies, zero kills, zero chems ingested. I'm cut from a pretty plain cloth, sir.\"\n\n\n\"Alright. I'll call you Gail if you stop calling me sir.\"\n\n\n\"Got it, Karth,\" she smiles. \"I need to get back to work. I'm the only one who knows h...\"\n\n\n\"Say no more,\" you say, holding up your hands. \"We're working on finding you a supplier. We'll begin turning a profit soon.\"\n\n\n\"Terrific,\" she says, slipping her gas mask back on.", "action_results": [null]}]}]}, {"action": "Do nothing", "result": "You do nothing, as Zero presses the shotgun to your head.\n\n\n\"What the fuck do you think you're doing, strolling in here and killing Skinrik?\"\n\n\n\"He was an idiot,\" you reply.\n\n\n\"What are you even planning?\" she asks.\n\n\n\"I'm planning on taking you and your cooks back to my vessel to cook drugs for me,\" you say simply. \"Surely that was obvious?\"\n\n\n\"You realize if you try to force my men or I into shitty conditions or anything like that we'll just be able to poison the chems and have everyone of your customers after your head? We can end your entire career.\"\n\n\n\"I understand, I understand,\" you say. \"I'm not trying to fuck you over.\"\n\n\n\"Fuck!\" Zero says, before looking at her cooks. \"Green Snakes, follow the psyker. What's the exit plan, then, psyker?\"\n\n\nA group of gang members charge in, wielding autoguns and a few lasguns, blocking your exit.\n\n\n\"Kill them, get to the shuttle,\" you say.", "action_results": [null, null]}]}]}]}, {"action": "Attempt to hire the Jatkiri", "result": "You stand in the war room of the Roar of the Vortex. Monitors in front of you show you a view of the nearby Jatkiri ships, dozens of oblong ships bristling with cannons.\n\n\n\"Jatkiri ships,\" you say over the comms. \"I am Captain Karth of the Roar of the Vortex. I would like to talk to the admiral of this fleet.\"\n\n\n\"Activating translators,\" Primus says. \"Tau-Jatkiri alliances has made thee translator technology highly advanced. Of course, be careful with your words.\"\n\n\nThere's a moment of silence, before the speakers blare again with Primus' voice.\"\n\n\n\"Bigs ships... lead to big warfare,\" the Jatkiri voices reply. \"Can't be trusted.\"\n\n\n\"We don't want you to fight. We want you to join us.\"\n\n\n\"What do you do?\" the Jatkiri replies.\n\n\n\"Uh... excuse me?\" you say.\n\n\n\"What... profession does your fleet have?\"\n\n\n\"It depends,\" you say. \"Primarily, we do fight, but...\"\n\n\n\"No deal. We don't fight. Already had to fight Tau-Jatkiri... then Void Claw Jatkiri... then Royal Jatkiri. Too much fighting. Now, we flow free. Tongue won't work anymore. End chatter.\"", "action_results": [{"action": "Accept this and give up on your drug manufacturing plans", "result": "Uh, you've done too much work today. Fuck it, leave the Xenos be. You're not in the mood to travel across the galaxy to some shitty hiveworld to be told no again.", "action_results": [null]}, {"action": "Accept this and attempt to hire the Outice-81 Chem Manufacturers", "result": "Fuck it, the Xenos won't work for you. Time to find some good, human workers on Outice-81.", "action_results": [null]}]}]}, {"action": "Decline", "result": "You're a warship, not a traveling drug lab. Now's not the time to get distracted. You're not going to break into the drug industry.", "action_results": [null]}]}, {"action": "Go all out", "result": "“Option five. If we’re going to allow this, we go all out.”\n\n\n“Yes, sir,” Elizabeth says, raising an eyebrow. “I… I guess I applaud your balls.”", "action_results": [{"action": "Continue", "result": "You sit in your chambers, taking a deep breath from the bright red… no, yellow… no purple… whatever color haze. You need some water to get rid of your headache. You lean over, grabbing your canteen, and downing your flask. You shake your head and groan as a wave of ecstasy overtakes you. A multicolored warrior dances in and out of reality in front of you, causing you to smile. This idea was fantastic. Morale is through the roof, and productivity has stayed high, as long as your productivity was… like, in regards to making more drugs. Your farms and food growing… places, or whatever, are still operational, due, thanks to automation and a few of the men still being smart enough to work. You’ve put your ship in orbit a small star, allowing the solar panels on the ship to increase the energy levels, or whatever keeps this place running. You smile, leaning back in bed. Yeah, this was a good idea…", "action_results": []}]}]}]}, {"action": "Allow", "result": "Your crew are willing to fight endless hordes of alien monsters for you, willing to travel through a daemon-infested realm of Chaos and madness for you, willing to toss their body into the fray even when it won’t come out from you. Still, only your most fanatical followers are willing to give up their alcohol for you. You happily leave it be.", "action_results": [null]}]}]}]}, {"action": "Allow", "result": "\"Allow it,\" you say.", "action_results": [{"action": "Continue", "result": "In changing little in regards to combat drugs, you don't have much effect on either morale or combat efficiency. Probably a safe choice.", "action_results": [null]}]}]}, {"action": "Allow", "result": "\"Allow,\" you say. \"What else we have?\"\n\n\nElizabeth fumbles through her bag once more, pulling out a small, black vial. She places it on the table.\n\n\n\"Reaper,\" she says. \"It's just arriving from the Black Aces War Band.\"\n\n\n\"What's it do?\" you ask.\n\n\n\"It gives users a huge confidence boost and immunity to pain, faster reflexes, a faster heart rate and adrenaline for a small period of time. It's very dangerous, though, only used in bad situations. It has a 10% fatality rate, but it's VERY effective in battle.\"\n\n\n\"That stuff leads to serious health issues,\" Fay points out.\n\n\n\"Very effective, though. Shockingly so,\" Castus says.", "action_results": [null, null]}]}, {"action": "Allow", "result": "\"Allow it,\" you say.\n\n\n\"Alright then,\" Elizabeth says, looking down at her notes. She fumbles through her pockets, pulling out two packets. One of a white, granular powder, the other is a brown one, looking like grinded up dirt. \"Here we have Zap and Dirt. Zap can be snorted, eaten or drank with alcohol to perk up energy levels and increase reaction time, while Dust is inhaled to improve your senses. These drugs DO have a few negative effects. Mood swings and some minor mental problems with the former, respiratory issues with the latter. There's not very popular, but only as it's fairly new and we haven't stopped at ports recently.\"\n\n\n\"Thoughts?\" you ask.\n\n\n\"I don't have enough research to formulate an opinion,\" Elizabeth admits.\n\n\n\"Allow Zap! That shit's good!\" Castus says, finally paying attention, before getting distraction by a smudge of... something on the table.\n\n\n\"Perhaps its effect on mental health are really serious. I mean, look at Castus,\" Olive says.", "action_results": [null, null]}]}]}]}]}, {"action": "Refuse", "result": "\"No?\"\n\n\n\"You'll regret this, captain,\" John the Hermit says, turning and waking back out of the room to head down to the lower floors.\n\n\nYou make sure there's extra guards to put off any attacks. Unfortunately, you're simply unprepared for the scale of this rebellion that takes place less than a day later. John the Hermit must have been planning this for decades, behind Kyros' back. Stores of ammo and weapons, hidden in stockpiles in the parts of the ship that hadn't been searched in millennia, are unearthed, as many of the functions of the ship cease as the mutants stop working. While your forces have better training, better equipment, better everything, as it has been said before, quantity has a whole quality of its own. The endless mutant hordes, entirely willing to die for their cause, all willing to martyr themselves as John the Hermit did.\n\n\nAs you stand in the war-room, surrounded by an army of mutants, burning dozens as lightning runs along your fingertips and psychic blasts kill all who could hope to oppose you, the mutants begin to overwhelm you. As their tentacles, hands and claws bring you down, tearing you apart, you have a brief musing about how similar this is to ", "action_results": []}]}, {"action": "Ignore the issue", "result": "You ignore the issue, throwing a few extra guards in defensive positions to show your strength and ward off the rebellious mutant hordes. Unfortunately, you're simply unprepared for the scale of this rebellion. John the Hermit must have been planning this for decades, behind Kyros' back. Stores of ammo and weapons, hidden in stockpiles in the parts of the ship that hadn't been searched in millennia, are unearthed, as many of the functions of the ship cease as the mutants stop working. While your forces have better training, better equipment, better everything, as it has been said before, quantity has a whole quality of its own. The endless mutant hordes, entirely willing to die for their cause, all willing to martyr themselves as John the Hermit did.\n\n\nAs you stand in the war-room, surrounded by an army of mutants, burning dozens as lightning runs along your fingertips and psychic blasts kill all who could hope to oppose you, the mutants begin to overwhelm you. As their tentacles, hands and claws bring you down, tearing you apart, you have a brief musing about how similar this is to Kyros' death.", "action_results": []}]}]}, {"action": "Refuse", "result": "\"No. In five minutes, we've seen your men behave as brutes, and you're asking for too much,\" you say.\n\n\nO'Neill spits on the ground and snarls.\n\n\n\"Get the fuck outta here, boy,\" he says.\n\n\nWith that, you quickly depart and head back to your ship.", "action_results": [null]}]}, {"action": "Purchase the slaves from the Harbringers of Menedez", "result": "The trade is, thankfully, uneventful. You're given the slaves, who include humans, Tau, Gretchin, Snotlings and more are all given bomb collars to make sure they do as you've asked. They're well-trained and efficient workers, even though they need to be given a tight leash and constantly guarded, and there's some acts of sabotage, their efficiency makes up for it, and they improve as workers as you treat the most loyal, least rebellious better. The slave-engineers will most certainly fulfill any and every role you have for them.", "action_results": [null]}, {"action": "Train the mutants as engineers", "result": "The mutants are enrolled in the training programs. The mutants struggle with more intellectual tasks like computing, but their numbers mean that enough of them get it to make the ship operational. All in all, the mutants are successful in fulfilling every role the ship has available. Now the Roar of the Vortex is at full power. ", "action_results": [null]}, {"action": "Convert workers to servitors", "result": "The process is... unnerving. Carefree mutants, completely trusting in your benevolence to them, have their personality taken, their soul distinguished and large parts of their brain removed, as well as heavy cybernetization. You make sure their distinguishing features are removed, and their faces are covered with featureless metal masks with only two eye-holes and a small feeding slit, so none of their friends notice them and realize what their fate has become. They work as expected, giving your Man of Iron the ability to completely repair and operate the ship. So all in all, a success.", "action_results": [null]}, {"action": "Visit the Rutherford-Dalton-Boyle Think Tank", "result": "Your shuttle slowly enters the gas giant, as you lose visibility of the outside. You immediately begin to feel nervous, even though your new pilot, a young and newly liberated slave by the name of Hawkins, assures you that his sensors can tell everything that's going on with ease.\n\n\n\"Who are you?\" a voice comes over the comms system.\n\n\n\"Commander? You want to answer that?\" Hawkins asks, as you grab the radio.\n\n\n\"The name's Karth,\" you say. \"I'm here to make a deal.\"\n\n\n\"Go on...\" the voice replies.\n\n\n\"We'd like to hire your men to work and repair our vessel.\"\n\n\n\"In exchange for?\"\n\n\n\"We'll feed you, cloth you, give you board, medical attention, allow you access to our vast databanks of information, let you research the ship as well as continue your research.\"\n\n\n\"Hmmm... come aboard,\" the voice comes back.\n\n\nThrough the scans of your ship, the space station is made out to be a large vessel made of a large ring around a central sphere. Your shuttle docks, and the doors open. \n\n\nThe men on the other side are... simply aren't men. It seems they've taken cybernetization to an insane degree. All that remains of their organic forms are bright pink brains floating in tanks of green fluid.\n\n\nOne is a tank attached to a cylindrical body with tiny, stumpy legs and dozens of long tentacles with various tools attached to the ends.\n\n\nAnother is a levitating, odd shape with a single long, segmented arm ending in a three-pronged claw, as well as multiple tubes situated at the front, holding things such as cathode rays, magnetic beams and a small bunsen burner.\n\n\nThe rest are all just as weird, lacking forms that were even vaguely humanoid. One, a brain jar hanging from four long legs, slowly walks forward, peering down at you with green electronic eyes.\n\n\n\"You must be Karth,\" it says in a dull, monotone voice. \"My name is Dr Malakai the Skull Taker.\"\n\n\n\"Malakai the Skull taker?\" you ask, curiously.\n\n\n\"We all have wild lives before the call of academia takes us, do we now?\" Dr Malakai says. \"I most certainly did.\"\n\n\n\"What does this institute do?\"\n\n\n\"We're an institute of former techpriests dedicated to knowledge. We search outside the tight restrictions of the God-Emperor or the Omnissiah, or the corruption of the Dark Gods.\"\n\n\n\"What do you have to say of my offer?\"\n\n\n\"The research we're doing in regards to the formation of compounds in gas giants. If you expect us to give over the majority of our staff to you, we want something extra.\"\n\n\n\"What more could you want?\" you ask.\n\n\n\"In exchange for funding, we could turn our focus to more practical sciences and research that could help the ship, whilst working on the Roar of the Vortex.\"\n\n\n\"How much?\" you ask.\n\n\n\"Research is actually very expensive. You need test subjects, research...\"\n\n\n\"How much?\" \n\n\n\"Realistically, twenty million thrones.\"\n\n\n\"That's ridiculous!\" you say.\n\n\n\"That's the only offer I'm willing to make.\"", "action_results": [{"action": "Agree", "result": "You hire the scientists, and soon find that it has benefits. Although much of the scientist's work is stuff far beyond your head, such as the physics behind the atom or the combustion of stars, much of it helps you. Through their work, they research and build massive solar panels on the ship which lowers fuel costs, increases the nutrition levels of nutrient paste to cut down food costs and do endlessly more. In the end, their innovations actually end up saving you twenty five million Thrones, giving you a hefty five million in profit from hiring them. Not bad for a day's work, if you do say so yourself.", "action_results": [null]}, {"action": "Refuse", "result": "\"No deal,\" you say. \"Lower the price.\"\n\n\n\"I'm sorry, as a man interested in science, I can't agree to anything else.\"\n\n\n\"I suppose we've reached an impasse, then,\" you say.\n\n\n\"Agreed. Well then if none of us will move on this issue, I suppose our deal is finished.\"\n\n\nTo be fair, the Doctor remains amicable, offering you a tour of the facilities. You politely decline, nearly falling asleep as he explains the \"exciting world of the atomic radius!\", so you're sure an extended tour wouldn't be the best use of your time. You depart on good terms, and head back to your ship.", "action_results": [null]}]}]}, {"action": "Find a world to settle on", "result": "\"None of us chose to fight, that fate was forced on us by the mad warlord Kyros,\" you say. \"I know we'll never regain our lost lives. But we can get something close. Find us a world to settle on.\"\n\n\n\"Terrific! I'll be sorry to see you finish before the jobs done,\" Elios says, winking. \"But you can remake your lives, we can remake ours, we'll all live happily ever after.\"\n\n\n\"Are there many worlds outside the reach of the Imperium?\"\n\n\nElizabeth pulls out a datapad and begins tapping on it.\n\n\n\"Setting parameters... out of reach of Imperium... lack of Chaos, Ork or Dark Eldar attacks... out of reach of Tyranid swarms... suitable climate for human body... few destructive elements... oh, why are there so many hits? Oh yes, forgot to factor in the Tau... OK, we've got a few hits. Let me sort through them.\"\n\n\nAfter a few minutes of researching the planets, Elizabeth has three possible worlds to settle on.\n\n\nThe first is a familiar world, because it's yours. The planet is the one you were raised on, where your people lived and died for endless generations. Kyros' looting of the planet has caused some damage, with the Great Lakes drained to a serious extent, leaving them a third of their size. The woods are half their size, with the remaining woods now overrun with Orks. Despite these issues, the planet is still one the Tribals would be happy to see, it's climate near perfect for you.\n\n\nThe second planet is known as Hararan-IV, the fourth planet I'm it's solar system of Harandan. The planet is for the most part sea, spotted with islands. The planet is prone to pirates, who land to rest, repair their vessel and resupply from the planet's rivers and abundant jungles. It's one or the few planets entirely free of Orks. It has a wealth of life, food, water and other resources, although it suffers from extreme tsunamis that could be a serious issue.\n\n\nFinally, you have New Marsbourth. Unlike the two other planets, New Marsbourth is a bustling planet. Although it operates outside of the control of the Imperium, it has grown significantly, a huge population that farms, manufactures, works and lives. The planet is controlled by several warlords, fighting for control of the planet. This permanent state if war has drawn mercenaries, seen the manufacture of massive fortresses and the assembling of huge armies, which has warded off any attacks. You could easily become the largest military faction on the planet and attempt to wrest control, or build up a large, isolated community and see how city life is for you.", "action_results": [{"action": "Home", "result": "It's a pretty simple process. Amadeus seems eager to get rid of you, so when he's told to take the ship back to your homeworld, he's gleeful.\n\n\nOnce your arrive, the Staine siblings have another question.\n\n\n\"Just to be sure, what is it you want to be done?\" Dirge asks, as you squeamishly notice that the eat living in him has sired babies.\n\n\n\"What do you mean?\" you reply.\n\n\n\"Well, so you want us to let you off with a small amount of supplies so you can continue your nomadic, tribal lifestyle as you once did, or do you want us to help you set up a little city, a hub from which you can operate and enjoy our little technological boons?\"\n\n\nHuh. What an interesting question. What DO you want? Are you actually planning to abandon all the technologies you've been using to resume a tribal life?", "action_results": [{"action": "Tribal Life", "result": "\"As you wish,\" Durge says. \n\n\nIt's only a matter of days as you ferry  soldiers to the planet. Eventually, you find yourself with the other tribals, Goliaths and gladiators on the planet. You stand by Fay, looking at the plains, now considerably bigger, that you grew up in.\n\n\n\"Well, we're home,\" Fay says.\n\n\n\"We are. Well, let's see where this goes,\" you reply.\n\n\nNow, the future is yours.", "action_results": [{"action": "Three Years Later...", "result": "Tribal\n\n\nLife is hard. Kyros' scouring of the planet for resources has driven many plant and animal species that you once relied on for food extinct. You're required to travel even more constantly than you once did, as life is permanently tough and hath without much respite, and few luxuries. \n\n\nThe Orks are another issue. With the destruction and kidnapping of the tribes, they've spread extensively. While your newfound \"tribe\" are killing machines, it seems the Orks are never-ending. You push them back, though these battles are not without their losses, which you will take a while to get back from, which leads to another issue: reproduction.\n\n\nYou find yourself struggling to make up your numbers. The Goliaths are infertile, most not even having genitals. The tribals are more successful, but not by much. It seems Kyros' experiments have taken their toll. Infertility rates are high, as are the amount of miscarriages. A few manage, though, the offs of which increase when partnered with a non-tribal. The gladiators are the only ones who have great success here, as their numbers multiply as young, physically fit people do as young, physical fit people do. \n\n\nDespite these issues, your tribe perseveres. Your relationship with Fay improves, as you eventually have a vaster sized combination of an Uwais marriage and an Azajaja bonding ritual. If anything, Kyros' experiments have increased your fertility, as you soon find yourself with a child. Thankfully Fay hasn't suffered the miscarriage issue, and you find yourself with a little ball of screaming flesh known as a child. The child seems perfect, having a strong body and a powerful mind, the best of both her parents. \n\n\nIt is this child that gives you hope. A child with the best of both her parents, who will weather any hardships the world. Your tribe are driving the Orks to extinction. The jungle is spreading again, and with it the planets and animals that you rely on. The present may harsh, but the future is forever hopeful.", "action_results": []}, {"action": "Three Years Later...", "result": "Tribal\n\n\nLife is hard. Kyros' scouring of the planet for resources has driven many plant and animal species that you once relied on for food extinct. You're required to travel even more constantly than you once did, as life is permanently tough and hath without much respite, and few luxuries. \n\n\nThe Orks are another issue. With the destruction and kidnapping of the tribes, they've spread extensively. While your newfound \"tribe\" are killing machines, it seems the Orks are never-ending. You push them back, though these battles are not without their losses, which you will take a while to get back from, which leads to another issue: reproduction.\n\n\nYou find yourself struggling to make up your numbers. The Goliaths are infertile, most not even having genitals. The tribals are more successful, but not by much. It seems Kyros' experiments have taken their toll. Infertility rates are high, as are the amount of miscarriages. A few manage, though, the offs of which increase when partnered with a non-tribal. The gladiators are the only ones who have great success here, as their numbers multiply as young, physically fit people do as young, physical fit people do. \n\n\nDespite these issues, your tribe perseveres. You find a girl, a pretty gladiator with few scars and a gorgeous mane of fiery red hair. The fact that her breasts are the size of melons is coincidental to your attraction. You both eventually have a combination of an Uwais marriage and an Gladiator bonding ritual, which you nearly pass out during when you have to cut open the palm of your hand. If anything, Kyros' experiments have increased your fertility, as you soon find yourself with a child. The child seems perfect, having a strong body and a powerful mind, the best of both her parents. \n\n\nIt is this child that gives you hope. A child with the best of both her parents, who will weather any hardships the world. Your tribe are driving the Orks to extinction. The jungle is spreading again, and with it the planets and animals that you rely on. The present may harsh, but the future is forever hopeful.", "action_results": []}]}, {"action": "City Life", "result": "\"As you wish,\" Durge says. \n\n\nThe next few weeks are spent ferrying equipment, supplies and building materials from the Roar of the Vortex to the planet, where your men begin to assemble a city. Concrete walls defended by gun emplacements, large apartment blocks for your people, a working hospital and school, vast farms being set up along the lake with the farming techniques being taught to your people. \n\n\nYou find yourself standing atop the throne room, staring out as a group of Goliaths raise up a wall, finishing off the generator room they were making. Fay stands next to you, staring out.\n\n\n\"Well, we're home,\" Fay says.\n\n\n\"We are. Well, let's see where this goes,\" you reply.\n\n\nNow, the future is yours.", "action_results": [{"action": "Three Years Later...", "result": "The Tribal City\n\n\nLife is good. Although Kyros' scouring of the planet for resources has driven many plant and animal species that you once relied on for food extinct, the farming methods allow for food production without wearing out the soil, and quickly bring up the number of crop plants until they're bountiful. You introduce breeding programmes to rapidly increase the numbers of prey animals, even creating subspecies, such as a subspecies of the Rukt bird that go from small, wild birds that soar above the forests to a species of fat, placid birds that can barely glide. You even bring back the puk in full force, and their numbers explode. Water issues are still a problem, but you're capable of drilling into underground rivers and water reservoirs to deal with that.\n\n\nThe Orks are still a problem, but a maintainable one. Your forces are killing machines, and their strength is amplified tenfold by the huge walls and gun emplacements. Even after having been let grow strong while you were off-world, you're still easily capable of breaking the strength of these beasts, pushing the Orks from huge threat to simple nuisance, and with look you'll soon be pushing them to extinction.\n\n\nOne of the few issues facing you is fertility. The Goliaths are infertile, and Kyros' experimentation has taken its toll on the Tribals, so they have a high infertility rate and a high rate of miscarriages. Their chances of successfully conceiving and birthing a child increases with regular trips to the hospital, which with the massive birth rate among the gladiators means that your population is growing, but the fertility issues keep your people from spreading over the land, at least within your expected lifetime.\n\n\nYour relationship with Fay improves, as you eventually have a vaster sized combination of an Uwais marriage and an Azajaja bonding ritual. If anything, Kyros' experiments have increased your fertility, as you soon find yourself with a child. Thankfully Fay hasn't suffered the miscarriage issue, and you find yourself with a little ball of screaming flesh known as a child. The child seems perfect, having a strong body and a powerful mind, the best of both her parents. \n\n\nThis child will lead the next generation. They will live in this city, a city that is both futuristic and based in the tribalistic traditions of the past, and will continue building it. They will use this city, your gift to them, to conquer, to build, to create, to spread and to exist. With them, with the next generation, with your child, lies the future.", "action_results": []}, {"action": "Three Years Later...", "result": "Tribal City\n\n\nLife is good. Although Kyros' scouring of the planet for resources has driven many plant and animal species that you once relied on for food extinct, the farming methods allow for food production without wearing out the soil, and quickly bring up the number of crop plants until they're bountiful. You introduce breeding programs to rapidly increase the numbers of prey animals, even creating subspecies, such as a subspecies of the Rukt bird that go from small, wild birds that soar above the forests to a species of fat, placid birds that can barely glide. You even bring back the puk in full force, and their numbers explode. Water issues are still a problem, but you're capable of drilling into underground rivers and water reservoirs to deal with that.\n\n\nThe Orks are still a problem, but a maintainable one. Your forces are killing machines, and their strength is amplified tenfold by the huge walls and gun emplacements. Even after having been let grow strong while you were off-world, you're still easily capable of breaking the strength of these beasts, pushing the Orks from huge threat to simple nuisance, and with look you'll soon be pushing them to extinction.\n\n\nOne of the few issues facing you is fertility. The Goliaths are infertile, and Kyros' experimentation has taken its toll on the Tribals, so they have a high infertility rate and a high rate of miscarriages. Their chances of successfully conceiving and birthing a child increases with regular trips to the hospital, which with the massive birth rate among the gladiators means that your population is growing, but the fertility issues keep your people from spreading over the land, at least within your expected lifetime.\n\n\nYou find a girl, a pretty gladiator with few scars and a gorgeous mane of fiery red hair. The fact that her breasts are the size of melons is coincidental to your attraction. You both eventually have a combination of an Uwais marriage and an Gladiator bonding ritual, which you nearly pass out during when you have to cut open the palm of your hand. If anything, Kyros' experiments have increased your fertility, as you soon find yourself with a child. The child seems perfect, having a strong body and a powerful mind, the best of both her parents. \n\n\nThis child will lead the next generation. They will live in this city, a city that is both futuristic and based in the tribalistic traditions of the past, and will continue building it. They will use this city, your gift to them, to conquer, to build, to create, to spread and to exist. With them, with the next generation, with your child, lies the future.", "action_results": []}]}]}, {"action": "Haravan-IV", "result": "Amadeus, more than happy to see you leave and the leadership of the vessel to fall into command of the Staine siblings who will eagerly shower him in luxury to appease him,  gleefully navigates the vessel towards Hararan-IV. Landers ferry people, equipment, supplies and rare resources down to the planet, where they begin to set up a huge settlement, which take the form of massive, sprawling underground bunkers to avoid the constant destruction and need to rebuild because of the tsunamis that would come from above-ground structures. The prize of these settlements are. Huge orbital cannons being employed, made from a few of the ships macro cannons, designed to fend off any pirates who attempt to land there. While the Gloriana-class vessel is in orbit, a pirate vessel soon shows up. Rather than flee or attack, the pirate captain demands a parlay. Soon, you find him and two human guards in the war-room, with as he tries to make a deal with you.\n\n\n\"Mr Karth, I'm Captain Lipton. I'm a man of action, but I'm also a man of words. You don't become a pirate captain by endless bloody violence like a Chaos war-band, you become one by getting the nob done, whether that be with violence or words. The planet you have chosen to settle on is very valuable. It's good for giving a crew rest, it has exotic food, beasts and spices that are very valuable, it's away from any powerful forces that would seek to stop us, and it's near a popular trade route while on a good smuggling route.\"\n\n\n\"OK. What's your point?\" you ask.\n\n\n\"I want to make an alliance. You have a powerful hold on the planet. I propose that together, we build a port, to supply the the pirates and smugglers in the section. My forces will build and maintain it. All you need is to protect it, and give us use if the land. Every pirate that lands will give us a bit of the plunder. Every smuggler that lands will bring us exotic goods and rsre luxuries. We'll be rich!\"\n\n\nHmmm... it's an interesting proposition. What to do?", "action_results": [{"action": "Agree", "result": "\"Done,\" you say.\n\n\n\"Perfect,\" Captain Lipton says.\n\n\nHe extends a hand, which you shake. He slides a bottle of red liquid and two glasses from a cost pickets popping it on the table, followed by a lighter and two big lho-sticks. He pours some liquid in both glasses, offering one to you.\n\n\n\"Here's to success,\" he says. \n\n\n\"To success,\" you reply, downing your drink.", "action_results": [{"action": "Three Years Later...", "result": "Paradise and Luxury\n\n\nYou lie in a hammock, a bottle of spiced wine in your hands. You've become quite accustomed to the drink, as have many nobles and rich merchants apparently, hence why its smuggled through here on a regular basis. You watch as Landers land in the distance, trying to tell whether they're the Morallian smugglers or the space marine pirates. \n\n\nYour relationship with Captain Lipton has been a profitable one. The standard of living for your men has risen greatly, as a huge amount of wealth floods through here, as well as rare and exotic goods and luxuries that you're all eager to get your hands on. You know Captain Lipton hasn't exactly been fair with the agreement, taking the lion's share of the profit to fund his wars for control with the other pirate vessels, but you're making enough that you couldn't give a flying fuck.\n\n\nYour relationship with Fay goes well. You have a wedding festival, a grand event that cost a small fortune. Soon, a child is conceived, a beautiful daughter with her mother's body and her father's powerful mind. You know she will do great things some day. \n\n\nAlthough your life is pleasurable and easy, you do have one major issue, one problem that has driven you to drink, to gamble, to eat, to take various drugs and to laze around: boredom. The only fights you get to take part in are stopping the occasional drunken scuffle or fending off a raid which the orbital cannons make an ease. You feel you've wasted your potential here. Still, you're happy. You've a daughter to carry on your legacy. What more could a man want?", "action_results": []}, {"action": "Three Years Later...", "result": "Paradise and Luxury\n\n\nYou lie in a hammock, a bottle of spiced wine in your hands. You've become quite accustomed to the drink, as have many nobles and rich merchants apparently, hence why its smuggled through here on a regular basis. You watch as Landers land in the distance, trying to tell whether they're the Morallian smugglers or the space marine pirates. \n\n\nYour relationship with Captain Lipton has been a profitable one. The standard of living for your men has risen greatly, as a huge amount of wealth floods through here, as well as rare and exotic goods and luxuries that you're all eager to get your hands on. You know Captain Lipton hasn't exactly been fair with the agreement, taking the lion's share of the profit to fund his wars for control with the other pirate vessels, but you're making enough that you couldn't give a flying fuck.\n\n\nYou find a wife soon. The first slaving vessel lands, attempting to repair and perhaps sell a few of its slaves. You quickly make sure that it's the last slave vessel, as you force the crew into slavery and release the slaves, unwilling to force people into the same slavery as you were forced into. One of the slaves, a beautiful girl with fiery red hair and a gorgeous face. The big pair of tits don't hurt either. You have a wedding festival, a grand event that cost a small fortune. Soon, a child is concieved, a beautiful daughter with her mother's kindness amd humility and her father's powerful mind. Hopefully, she won't have her mother's tits, because you'll skin any suitor that makes a pass at your little angel. You know she will do great things some day.\n\n\nAlthough your life is pleasurable and easy, you do have one major issue, one problem that has driven you to drink, to gamble, to eat, to take various drugs and to laze around: boredom. The only fights you get to take part in are stopping the occasional drunken scuffle or fending off a raid which the orbital cannons make an ease. You feel you've wasted your potential here. Still, you're happy. You've a daughter to carry on your legacy. What more could a man want?", "action_results": []}]}, {"action": "Refuse", "result": "\"No, I'm not getting involved with pirates. I'm getting out of this game of fighting and plotting, not stepping down to meddle in it,\" you say.\n\n\n\"So be it...\" Captain Lipton sneers. \"But remember me when you're starving on your little dirtball before a man not as charitable as me takes over.\"\n\n\n\"I'm sorry, I've almost already forgotten you,\" you say, waving your hand to Lipton's anger as he storms out.\n\n\nAh, you're a smart and powerful psyker, you'll make short work of any who try to fuck with you. All you want now is an easy retirement.", "action_results": [{"action": "Three Years Later...", "result": "Unshattered Paradise\n\n\nYou lie in a hammock, a canteen of water in your hands. You watch as Goliaths drag a net filled with shrimp-like creatures. A good catch, you think to yourself. Life on the planet requires hard work, but it's satisfying. You work hard, cutting down trees for firewood, gathering fruit and plants for food, hunting, fishing and doing the other hundreds of jobs required to keep going. You have a large facility just under the ground, where you can quickly head down to avoid a tsunami. Down there, your equipment is kept safe from the elements, with a functioning school, hospital, kitchens, library and dormitory there. \n\n\nThe pirates cause relatively few issues. There's a few more attempts to negotiate none of which you agree to, and a few raids, but between your orbital cannons and your planet side force of killing machines, you make short work of them. Soon, they learn to fear you, and rightfully so.\n\n\nYour relationship with Fay goes well. You have a wedding, a small, humble little event. Soon, a child is conceived, a beautiful daughter with her mother's body and her father's powerful mind. You know she will do great things some day. \n\n\nAlthough your life is pleasurable and risk-free, you do have one major issue, one problem that has driven you to grow fat, drink and laze around: boredom. The only fights you get to take part in are stopping the occasional drunken scuffle or fending off a raid, which the orbital cannons make an ease. You feel you've wasted your potential here. Still, you're happy. You've a daughter to carry on your legacy. What more could a man want?", "action_results": []}]}]}, {"action": "New Marsbourth", "result": "Amadeus, more than happy to see you leave and the leadership of the vessel to fall into command of the Staine siblings who will eagerly shower him in luxury to appease him,  gleefully navigates the vessel towards New Marsbourth. You find one of the smallest, weakest factions in the planet, the noble house of Gilford, a who are little more than a pawn to bigger houses, not even having made any alliances with any house at all, let alone one of the larger ones. Yin a few quick raids, you wipe out the Gildford House, taking their place as Rulers and guardians of the tiny amount of territory they controlled. Landers ferry people, equipment, supplies and rare resources down to the planet, where they begin to set up inside the Gilford House's fortress.\n\n\nWith the conquest of the Gilford House, you're left as a new, unexpected player, a small but powerful faction. You realistically have two choices, two long term plans for your forces. You could go to war. The Staine siblings will help your forces get a few critical early victories, before leaving you to wage and perhaps finish the War of the New Marsbourth Houses has been going on for centuries if not millennia. \n\n\nSecondly, you could go for the peaceful option. You control a small area with farmlands, manufacturing facilities, mines, a city and more. The area could absolutely survive  as an isolated but heavily fortified area, too powerful to conquer without serious and crippling losses, and too small to be worth even a slight amount of effort to secure.", "action_results": [{"action": "War", "result": "You stand in front of the Staine siblings, as they finally agree to support your early skirmishes and campaigns against the New Marsbourth houses. Your other lieutenants are alongside you, planning your actions. A quick blitz of raids and bombings could cripple the Samson House's offensive capabilities. Then, a small invasion to secure the lowlands from Jericho House, a game of trench warfare to fight Lars House to a standstill to prevent their predicted invasion, with a final capture of Hive Jun from the Lawrence Family should put you in powerful standings.\n\n\n\"The Black Rats are resilient creatures, as are the Goliaths. We shall take on Lars House when they strike,\" Durge says.\n\n\n\"I'll lead a few saboteurs alongside Castus to hit Samson House,\" Olive says.\n\n\n\"We'll be able to capture the lowlands. The Tribals have fought in plains all our lives, we'll crush every last fucker there,\" Fay says.\n\n\nYou watch as your lieutenants plan the various attacks. This is what you were made for.", "action_results": [{"action": "Three Years Later...", "result": "The Forever War of the Houses\n\n\nYou stand on the battlefield, tearing a Dark Eldar Talos, as it explodes in front of you. The Dark Eldar begin to fall back, clearly realizing that this mercenary gig wasn't worth it. You laugh, sending up a wall of flames to terrify them and send the brave holdouts scuttling back to regroup, which turns to a full-blown retreat once they see a wave of Goliaths charging.\n\n\nYour arrival on the scene has been a huge changer to New Marsbourth. After your early crushing victories that broke the strength of many of the major houses, the Concord of the Vipers took place, where the noble houses made an alliance to destroy you. This, combined with the fact that the Staine siblings have left to rebuild and continue on with their escapades, has left you with serious losses, but you get back to your former position through grit and brutal fighting. Mercenaries flock to both sides, while minor houses change sides regularly. \n\n\nYou soon find yourself perfectly matched. Your defenses are strong enough that any invasions are damaged enough that the Los ground can be easily regained by a counter-attack. Soon, a hemisphere of New Marsbourth lies in each of your hands, with the area around the equator being a permanent war zone, with land switching hands rapidly. \n\n\nYour relationship with Fay goes well. You have a wedding, a small, relatively secret event. You both agree that your enemies knowing that you're married to one of your generals is best to be avoided. Soon, a child is conceived, a beautiful daughter with her mother's body and her father's powerful mind. You know she will do great things some day.\n\n\nIn all honesty, you don't mind the situation you're in, of permanent, unceasing warfare. You're kept trained in war, and the war is fought at such a race that your hemisphere permanently gets to have the economical boost that comes from a war economy, until you in fact rely on it. The Goliaths, the Tribals, the Gladiators, you're all trained for or even designed for war. The fighting keeps you busy and keeps your forces from falling into awful habits like drinking, drugs, whoring, gambling and much worse distractions from boredom, although you feel like it's a waste of your potential, all of yours. Still, it's a life. What more could you want?", "action_results": []}, {"action": "Three Years Later...", "result": "The Forever War of the Houses\n\n\nYou stand on the battlefield, tearing a Dark Eldar Talos, as it explodes in front of you. The Dark Eldar begin to fall back, clearly realizing that this mercenary gig wasn't worth it. You laugh, sending up a wall of flames to terrify them and send the brave holdouts scuttling back to regroup, which turns to a full-blown retreat once they see a wave of Goliaths charging.\n\n\nYour arrival on the scene has been a huge changer to New Marsbourth. After your early crushing victories that broke the strength of many of the major houses, the Concord of the Vipers took place, where the noble houses made an alliance to destroy you. This, combined with the fact that the Staine siblings have left to rebuild and continue on with their escapades, has left you with serious losses, but you get back to your former position through grit and brutal fighting. Mercenaries flock to both sides, while minor houses change sides regularly. \n\n\nYou soon find yourself perfectly matched. Your defenses are strong enough that any invasions are damaged enough that the Los ground can be easily regained by a counter-attack. Soon, a hemisphere of New Marsbourth lies in each of your hands, with the area around the equator being a permanent war zone, with land switching hands rapidly. \n\n\nYou find a wife soon in one of the gladiators, a beautiful girl with fiery red hair and a gorgeous face. The big pair of tits don't hurt either. You have a wedding, small, humble little event. Soon, a child is conceived, a beautiful daughter with her mother's body and her father's powerful mind. Hopefully, she won't have her mother's tits, because you'll skin any suitor that makes a pass at your little angel. You know she will do great things some day.\n\n\nIn all honesty, you don't mind the situation you're in, of permanent, unceasing warfare. You're kept trained in war, and the war is fought at such a race that your hemisphere permanently gets to have the economical boost that comes from a war economy, until you in fact rely on it. The Goliaths, the Tribals, the Gladiators, you're all trained for or even designed for war. The fighting keeps you busy and keeps your forces from falling into awful habits like drinking, drugs, whoring, gambling and much worse distractions from boredom, although you feel like it's a waste of your potential, all of yours. Still, it's a life. What more could you want?", "action_results": []}]}, {"action": "Peace", "result": "While your attempts at getting a peaceful life for your men is admirable, it goes badly. The other houses, ever paranoid, still launch endless raids and countless assaults on your territory, always presuming you're planning something. Your failure to occupy more territory means you don't have the resources to push the enemy back, and it's not long before the constant warring takes its toll. Although you ensure that all four Houses that choose to finish you off are decimated, never capable of rebuilding themselves, your forces are crushed. When the houses finally charge your home, you wipe out hundreds, if not thousands, but eventually even you go down.", "action_results": []}]}]}, {"action": "Ask your lieutenants", "result": "\"So... What do we think?\" you say, pulling your lieutenants together.\n\n\n\"I abstain from the vote,\" Cain shrugs.\n\n\n\"Unhelpful,\" you note.\n\n\n\"We could take the ship, live the life I raiders, going from place to place, taking what we want,\" Castus says.\n\n\n\"Raiders?\" Olive says. \"The path forward is mercenary work. Similar to Castus plan, except we get paid a lot more, and we'll end up with powerful allies unlike if we were raiders being hunted by everyone.\"\n\n\n\"I'm not adverse to settling down,\" Fay says. \"But we could take the ship anyway. With control of the ship, we could carve ourselves a little empire. Nothing on the level of Kyros, but hey, better than our ancestors could ever have dreamed of.\"", "action_results": [null, {"action": "Take control of the ship", "result": "\"Oh, terrific,\" Elios says sarcastically. \"Because I really wanted to be share my Gloriana-class battleship.\"\n\n\n\"A shame you pick that option,\" Durge says. \"Honestly, if I thought we'd have a chance I'd set my Black Rats against you, another mutiny. But I know we'd go down. The ships yours. I best give you these.\"\n\n\nDurge grabs a massive stack of papers on the table.\n\n\n\"If you're going to become captain of this vessel, it's best I give you these. These are the reports, files, documents, notes and other statistics about the vessel,\" he says.\n\n\n\"Fan-fucking-tastic,\" you reply, staring at the statistics with dread.\n\n\n\"Hope you're glad to be dealing with that,\" Elizabeth says.\n\n\n\"Can we cut this passive-aggressive bullshit?\" Meliodas says. \"The kid doesn't want to end up as some fucked Chaos Spawn. Now that he's made up his mind, it's best we admit that staying away from the likes of us is the best choice.\"\n\n\n\"Shall we drink to our successes?\" Elios says, as he grabs a bottle of wine from under the table.\n\n\n\"Sure,\" you say.\n\n\nGlasses our brought out, and the wine is distributed. Soon, you each find yourself with a glass. You, Fay, Cain immediately drink yours, as the others pause to stare at you, looking somewhat offended.\n\n\n\"What?\" you ask.\n\n\n\"I was assuming there'd be a toast, but the fuck it, let's drink approach is commendable,\" Elizabeth says, smiling.\n\n\n\"Toast? Like, burning the wine?\" Fay asks, as Elios laughs.\n\n\n\"We all get a glass of wine, raise it in the air, say a few words and then say cheers, before drinking at the same time. I'm sorry, I suppose it wouldn't be common on the tribal world you came from...\" Durge says sympathetically. \"... or in tanks.\"\n\n\nYour glasses are refilled, and Durge holds his up.\n\n\n\"To the joy of each and every one of us!\" Durge says.\n\n\n\"To each of our successes,\" Elizabeth adds.\n\n\n\"To our pleasures and joys,\" Elios says.\n\n\n\"To the strength the Warp gives us,\" Meliodas smiles, an act all the more unnerving in that it's on Kyros' face.\n\n\n\"To the exploration and adventure,\" Primus says.\n\n\n\"To loyalty and brotherhood,\" Captain Hayes says.\n\n\n\"To a long life,\" Olive says.\n\n\n\"Or a short and merry one,\" Castus grins.\n\n\n\"To... a bellyful of food,\" Cain says with a shrug.\n\n\n\"To us always having a sharp spear, fat prey and a sunny sky looking over us,\" Fay says, in the adapted version of the first half of an old saying common to the tribes of your home-world.\n\n\n\"And may, when the reaper show up with a black cloak, the visit the hut next door,\" you say, finishing the saying.\n\n\n\"Cheers,\" you all say, downing your drinks.", "action_results": [{"action": "One Month Later...", "result": "It's hard getting the ship under control, but manageable. Once you've landed the war-bands on the world Primus chose, saying goodbye to the ever-friendly Durge, shy but smart Elizabeth and permanently horny Elios, and even that now gone voice that once plagued your mind known as Meliodas. You restock at the planet, trading much of Kyros' personal statues in order to outfit and repair the ship, which is made simple with Primus' help. Ship operation seems actually fairly simple. As long as Amadeus is under your thumb and the military might is yours, you'll be fine. Most of the hard work required is done by Primus. With those two, you're golden.\n\n\nOne of the main issues, though, is the mutants. As your slaves have all been wiped out or had joined up with one of the war-bands, Kyros or your forces during the mutiny, mutants are now filling in most of the crew roles aboard this vessel. The thing is, they're getting antsy about their position, wanting more power and a say in the decisions of the vessel. Reports say that a mutant known as John the Hermit is leading the mutants, inciting dissent and rallying the masses of mutants.\n\n\nAlthough the mutants are seen as an irrelevant issue by most, you know that's not the case. They're tough, with naturally mutated weapons, and there's massive numbers of them. If they're genuinely organized and inspired by this John the Hermit, they could easily take the ship when you're at low strength.", "action_results": [null, null, null]}]}]}]}, {"action": "Attempt to talk it out", "result": "All the various leaders are standing, their weapons raised, but none act, waiting patiently.\n\n\n\"How did you pass my sensors?\" Primus asks.\n\n\n\"Please,\" Kyros laughs. \"Did you not think my powers are strong enough to do so?\"\n\n\n\"How the fuck are you even alive, Kyros?\" you ask.\n\n\n\"Kyros? Ha! Kyros was a petty fool. Don't you recognize me, Karth?\"\n\n\nYou shake your head, still ready to engulf him in flames.\n\n\n\"No? You don't remember my little voice in the back of your mind? I am Meliodas,\" Kyros says, taking a bow.\n\n\n\"What?\" you ask.\n\n\n\"Oh, it was simple. I've wanted to take a form in this world for some time. I helped you, paying close attention, seeing potential, and assisted you as best I could. Fortunately, as you fought Kyros, I saw his mental defenses weaken during the fight between you and him. As he lay dying, the mutants at his throat, he was broken. I easily possessed his form, devoured his soul, and killed those stupid mutants with my daemonic powers.\"\n\n\n\"You're a daemon?\" Elios asks.\n\n\n\"Damn right,\" Kyros, or Meliodas, says.\n\n\nYou take some time to explain who Meliodas is to your other lieutenants, but soon they understand. After some extensive questioning and psychic testing to ensure that this is in fact Meliodas, he takes a seat at the table.\n\n\n\"What are you doing?\" you ask.\n\n\n\"Well, I helped advise Karth. I'm one of his best advisors. Surely I deserve a place here?\" Meliodas says.\n\n\n\"I suppose,\" you say.\n\n\n\"Give him a seat. Us Chaos followers could use an extra vote for our side,\" Durge says. \"Now, can we continue?\"\n\n\n\"Don't hold off on my account,\" Meliodas grins.\n\n\n\"Alright, let's be realistic, shall we?\" Elios says. \"We're Chaos. We worship the Dark Gods, corrupt, parlay with demons, all that shit. We're not changing. We also know that we've lost a shit-ton more men because of little sis' rage against us, so if this comes down to a civil war, we're all dead and you win.\"\n\n\n\"Go on,\" you say.\n\n\n\"So, we have two options. Option One: You keep control of the ship,\" Durge says. \"We'll serve under you as long as we see fit, but we most likely don't leave, and we decide our path forward as a group.\"\n\n\n\"Option two: you abandon the ship to us,\" Durge says. \"We find you a world of your choosing, a little paradise world far from the reaches of the Imperium or any other enemies. It'll be our gift to you. You can pick out the world, we'll transport any who want to go there to it as well as all you'll need to survive and build a large, happy community. You'll be able to peacefully retire and live out the rest of your lives, never worrying about this ship or the battles it will fight.\"\n\n\n\"One moment,\" you say, pulling your lieutenants together. \"So... What do we think?\" \n\n\n\"Eh,\" Cain grunts.\n\n\n\"We're not going to abandon this ship, are we?\" Olive asks.\n\n\n\"This is a massive war machine. We should stay.\n\n\n\"I'm not adverse to settling down,\" Fay says. \"But we could take the ship anyway. With control of the ship, we could carve ourselves a little empire. Nothing on the level of Kyros' aspirations, but hey, better than our ancestors could ever have dreamed of.\"", "action_results": [null, null, null]}]}]}]}, {"action": "Give Drake better conditions", "result": "Despite how much it kills you, you give Drake what he wants. Access to three female Gladiator-Slaves, who you pay remarkably well for the job but knowing Drake simply not enough, access to an array of drugs from the Slaaneshi Chem Cooks, all of which are sedatives to help make guarding Amadeus easier. He's given what he wants, though you make sure none of it comes at the cost of his security. By the end of it, he's fairly secure, and definitely contented. \n\n\nBy the time you sort out Drake's newfound luxuries, which involves dealing with Drake for far longer than any man deserves, you move on to doing all the inane, normal tasks that you now need to deal with like deciding rations, sending out crews to clean up the ship, assigning guards and all the other things expected of you. Unlike Fay, Cain, Castus, Elios, Durge and Captain Hayes, all of whom absolutely despise their new workloads, with Castus even suggesting a new system of anarchy where the only rule is anyone found filing something is to be shot, you actually like it. Olive, Primus, Elizabeth and you all find a certain level of peace in it. The mental challenges and problem-solving you have to deal with has a certain calming element on your mind. By the time it’s finished, it’s fairly late. There’s a night and day cycles on this ship, with the lights brightening and dimming to have a twenty four hour cycle, which stretches a bit long for you compared to home, but with a mid-day nap is manageable. You wonder what world the ship’s cycle aligns to. Perhaps whatever world Kyros came from. \n\n\nFay opens the door, walking inside.\n\n\n“Karth, it's dinner time,\" she says. \"Better hurry up. We want to eat early so we have the evening to discuss the important issues.\" ", "action_results": [null]}, {"action": "Delegate your role to Han", "result": "\"I don't care. Han, it's all up to you. I trust your decision,\" you say. \n\n\n\"Yes, sir,\" Han nods. \"I won't let you down.\n\n\nThrough delegating your decision to Han, you're able to move on to doing all the inane, normal tasks that you now need to deal with like deciding rations, sending out crews to clean up the ship, assigning guards and all the other things expected of you. Unlike Fay, Cain, Castus, Elios, Durge and Captain Hayes, all of whom absolutely despise their new workloads, with Castus even suggesting a new system of anarchy where the only rule is anyone found filing something is to be shot, you actually like it. Olive, Primus, Elizabeth and you all find a certain level of peace in it. The mental challenges and problem-solving you have to deal with has a certain calming element on your mind. By the time it’s finished, it’s fairly late. There’s a night and day cycles on this ship, with the lights brightening and dimming to have a twenty four hour cycle, which stretches a bit long for you compared to home, but with a mid-day nap is manageable. You wonder what world the ship’s cycle aligns to. Perhaps whatever world Kyros came from. \n\n\nFay opens the door, walking inside.\n\n\n“Karth, it's dinner time,\" she says. \"Better hurry up. We want to eat early so we have the evening to discuss the important issues.\" ", "action_results": [null]}]}]}]}, {"action": "\"What are you doing here?\"", "result": "\"I came to check if you were up, and the door was open,\" Fay says.\n\n\n\"OK. I'm up,\" you reply.\n\n\n\"Cool,\" Fay replies, not moving. \"Hurry up and get ready, it's too late for lying around.\n\n\nYou stare at her, waiting from her to move.\n\n\n\"What?\" she asks.\n\n\n\"So... I sleep naked,\" you say.\n\n\n\"Oh,\" Fay says, blushing. \"I'll... I'll wait outside.\" \n\n\nFay steps outside, and the door closes behind her.\n\n\nYou stand, and quickly walk to the bathroom. You stare at your reflection in the bathroom mirror, taking a deep breath as the voices start. \n\n\n\"Aren't you curious? What is Elios planning? Why is Elizabeth so quiet? Where is Kyros' body? No one's found it.\"\n\n\n\"You're a Psyker. A nice steak, the embrace of a lover, the joys of the material world is nothing compared to what I can offer you.\"\n\n\n\"Alexander died, Alexander was buried, Alexander returneth to dust. The same will happen to you. Embrace the rot and decay that comes with life.\"\n\n\n\"Kill! Maim! Burn! Kill! Maim! Burn! Kill! Maim! Burn!\"\n\n\nYou're gaining a certain level of familiarity with the daemons in your head. Now that Meliodas has vanished, more has come to fill your head. You've began naming them, one of the few ways you think you'll remain sane with them. Question Mark constantly tempts you with knowledge. Fucky tempts you with fantastic pleasures beyond compare. Rotgut is the embodiment of laziness, and makes you want to lie in bed in your own filth. Smiley is just fucking bonkers.\n\n\nTzeentch's Keys, you miss Meliodas.\n\n\nYou quickly get dressed, before calling Fay. She opens the door, strolling inside.\n\n\n\"Hey, Karth,\" she smiles.\n\n\n\"Is she planning on betraying you? Is she loyal? You don't know... but I do,\" Question Mark says. \n\n\n\"Slit her throat, rape the stab wound and feel the blood run down your arm as you devour her throat! Feel pure blissful sensation!\" Fucky whispers.\n\n\n\"Embrace your pestilence. You are filth. You are decay. But that is OK. You are still loved,\" Rotgut says.\n\n\n\"BURN! MAIM! KILL!\" Smiley screams.\n\n\nFay raises an eyebrow, rapping her knuckles against your head.\n\n\n\"Hello, anyone in there?\" she asks.\n\n\n\"More than you know,\" you reply.\n\n\n\"Meliodas back?\"\n\n\n\"New guys. At least there's some variety.\"\n\n\n\"Are they saying anything about me?\" Fay smiles.\n\n\n\"Cunt! Take her fucking head!\" Smiley screams.\n\n\n\"I think they like you,\" you reply, as Fay laughs.\n\n\n\"You sure you're OK?\" \n\n\n\"Tip top,\" you reply.\n\n\nThe barrage of voices screams answers in your head, as you take a deep breath. Fay gently slaps you across the face. \n\n\n\"Karth, come on, come back to me,\" she says.\n\n\n\"I'm fine,\" you reply, as Fay gives you a concerned look.\n\n\n\"If you're sure,\" she asks nervously. \"Come on, we need to get to the war room for the morning meeting.\"", "action_results": [null]}, {"action": "The story so far..", "result": "Your name is Karth, of the Uwais tribe. Born a simple tribal, weak and frail, you soon found you had powerful psychic gifts. You managed to rescue a few survivors from another tribe, the Azajaja, when Orks struck, including a young warrior known as Fay, who you befriended.\n\n\nThen, Chaos worshippers struck, raiding your entire planet, led by Kyros. They wiped out much of your tribe, taking the rest as prisoners where they were experimented on, turned into super-soldiers to serve in Kyros' army. You were taken as Kyros' apprentice, experimented on to become more powerful. He explained your powers were connected to the Warp, where the four Gods of Chaos resided. Khorne, the Warrior, Nurgle, the Plague-Bearer, Tzeentch, the Sorceror and Tzeentch, the prince of pleasure. He helped you grow in power, but it became clear he was truly insane. However, through working with him, the voice of Meliodas, a daemon, began possessing your mind, speaking in your ear to advise and help you.\n\n\nAmong Kyros' forces were the Staine siblings, four Chaos worshippers each dedicated to a different God. Rebecca was cruel and violent, worshipping Khorne. Elizabeth was quiet and introverted, powerful in the arts of sorcery, worshipping Tzeentch. Durge was a disgusting, disease filled creature, but a very kind soul, worshipping. Nurgle. Elios was perverted and strange, worshipping Tzeentch. Alongside them were the veteran soldier Captain Hayes, who led the 22nd Regiment in service of Kyros.\n\n\nEnslaved on Kyros' ship, the Roar of the Vortex alongside your men, were a group of gladiator-slaves led by the twins Castus and Olive, the former wild and foolhardy, the latter more smart and thoughtful, as well as the vat-born Goliath super-soldiers, led by Cain.\n\n\nWith three Staine siblings, Elios, Elizabeth and Durge, as well as Captain Hayes, you plotted to overthrow Kyros with the help of those enslaved. After convincing Fay, Castus, Olive and Cain to join you, you started the uprising. \n\n\nAfter a brutal battle, you found an ancient AI known as an Iron Man, releasing him from the experiments of one of Kyros' lieutenants. With his help, you managed to take over the ship. You managed to kill Kyros, throwing him to a brutal death by the mutants enslaved on the ship, tearing him apart. His body wasn't recovered, but he's surely dead.\n\n\nMeanwhile, in his wake, you have control of a massive warship, in a galaxy of world-eating locust hordes, great warbands of biological super-soldiers, theocratic empires with endless worlds under its grip, and endless daemonic entities ready to strike. \n\n\nWhat you do with your newfound powers is up to you.", "action_results": [null]}]}]}