{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=7566", "context": "", "first_story_block": "Paradise...\n\nThat must've been the Empire's idea of an ironic joke when they were assigning a name to this sweltering hell hole of a planet. The heat wouldn't be so bad if the planet wasn't also a jungle nightmare teaming with poisonous flora and dangerous fauna.\n\nThe \"primitive\" natives aren't exactly friendly either. Your team medic had to find that out the hard way. Oh sure sometimes you'll come across a tribe that's friendly, but most of the time the lizards see you as food. Soft, fleshy pink food that's invading their territory. Which means you usually end up having to torch an entire village.\n\nFuckin' waste of ammo.\n\nOf course if the planet and its inhabitants weren't enough, there's always the other major powers laying claim to the planet. The Krik Collective, the Mazatt Dominion, and the Elojin Alliance have all laid claims to plunder whatever riches this planet may have and that's why you're here: To make sure this planet is plundered by the Terran Empire instead.\n\nThe next Empire supply ship won't be here for a long time, let alone anymore troops. You're on your own. Ah the joys of being part of the Empire's expeditionary force.\n\nYou and your team have currently set up base in one of those \"friendly\" lizard villages.\n\nWell its a brand new day in Paradise, what's first on the agenda?", "action_results": [{"action": "Check on your team's activities", "result": "Well you guess you’d better check on your team. Not doing so would certainly look irresponsible of you, hardly becoming of an officer of the Empire.\n\nYou step out of your tent and peruse your team, who are all going about their duties as they should. They’re a good team, sure sometimes they complain, but on this planet its very understandable.\n\nYour Indoctrinator is busily going about his usual brainwashing fanaticism as he tries to instill the values of the Empire to the reptilian natives that live in this village. Salo’s ranting and raving like a mad man as he is apt to do when preaching. The Lizards look at him with a blank expression in a vain attempt to understand what the hell he’s talking about, but you can tell they’re getting agitated.\n\nMeanwhile your inept second in command Lieutenant LaFleur is pointlessly scolding some of the other team members for not setting up their tents by regulation standard. They look annoyed. You swear you think he’s probably come closer to death by his own team members than by any enemy involvement you’d ever engaged in.\n\nWell you should probably intervene somewhere before someone gets killed.", "action_results": [{"action": "Approach your Indoctrinator", "result": "That overzealous fool is going to turn the entire village against you, and that’s the last thing you need right now. You stop Salo before the Lizards make dinner out of him.\n\n“What are you doing?! It’s my job to teach these savages the ways of the Empire, and bring them into the fold, even if they aren’t worthy enough to serve HIM.”\n“Well you’re not gonna do that by antagonizing the poor scaly bastards! Just leave them alone, its not like we’re leaving anytime soon, and we’ll have a lot easier time of it, if we aren’t fighting every last lizard on this fuckin’ planet!”\n“If they don’t accept the ways of the Empire, then they deserve to be purged by it!” Salo says predictably.\n“Yeah, well if you haven’t noticed we’re a LONG way from the Empire, new supplies won’t be here for months and I’d like to currently supply of ammo to last until then. That won’t happen if we’re blowing away every lizard we come across. Its easier to just work with them when they aren’t actively hostile.”\n\nSalo looks unconvinced and disturbed by your words.\n“As an Indoctrinator of the Empire it’s also up to me to make sure its servants are not falling astray to alien influences! And you my dear Captain have been displaying suspect behavior as of late! I hope for your sake you haven’t forgotten the values of the Empire!”\nSalo warns and storms off to his tent.\n\nAs the Lizards disperse and go back to their simple village life, you also return to your tent, shaking your head, and thinking about what a short sighted, narrow minded idiot Salo is. You go back to studying the maps of the territory you’ve explored so far and pondering where you should go next, soon one of your men comes in to tell you that the Sergeant has come back from a recon mission and she looks like she’s faced some hostiles. He also tells you they’ve captured an interesting prisoner, an Elojin.", "action_results": [{"action": "Tell him to send the Sergeant in to report", "result": "Delegating any responsibility to LaFleur is never a good idea, you tell him to send in Sergeant Alyssa. Sergeant Alyssa walks in and reports to you in her usual no nonsense manner; you’ve always admired her race’s stoic nature.\n\n“Captain, we discovered a Mazatt encampment, we killed all twenty of them with only two casualties. There was no useful information to be found, all their data was no different than ours. The only thing of interest was the prisoner they were holding.”\n“Ah the one that is now ours. The Elojin.” You reply\n“He kept saying he had some important information. I wasn’t sure if we should kill him or you’d want to question him first. If it’s the former I’d be glad to do it, his constant chattering was…annoying.”\n\nAlyssa’s people aren’t known for their small talk.", "action_results": [{"action": "Question the Elojin", "result": "“Send him in, you can kill him afterwards if he proves to be useless.”\n\nAlyssa nods and brings the Elojin in roughly.\n\n“Ow! Watch it you, blue Empire whore!” he says which is followed by a kick to his back by Alyssa before she leaves. The Elojin brushes himself off and stands up.\n“I swear you humans will allow any primitive race into your club nowadays. What planet did you pick that one up from?\n“You had something important to tell me?” you ask, but the Elojin completely ignores you.\n“Mind you, she is a pretty primitive; her pointy ears almost make me want to laugh though.”\n“I suggest you stop talking about my Sergeant and start talking about what you know.”\nHe still doesn’t listen.\n“You know I’ve always been impressed by you humans. I’ve read a lot about your species. We have more in common than you might think. Why if it wasn’t for your lack of spots and disgusting hairy body, we could be brothers!”\n\nYour patience has run out, you grab him by his scrawny throat.\n\n“Look you hairless spotty freak, you better start talking before I let my Sergeant blast a big hole in you and that’s AFTER I turn you over to my Indoctrinator who’ll be only to happy to get his hands on the likes of you.”\n\nWell that got his attention, and apparently he does know something of humans because, Indoctrinator widened his eyes a bit. He keeps his cool though.\n\n“See now you humans know how to instill fear. Not like those idiot Mazatts that were trying to get information from me. I don’t know how those brainless brutes even mastered the wheel, let alone achieve space travel. Anyway, there’s an old Xont building on this planet.”\nNow your eyes widen.\n“WHAT?! Impossible! The Xont are a myth! The only knowledge that ANYONE has of them is from stories, there’s never been any hard evidence of this race found by any of the major or minor powers and that’s from centuries of searching.”\n“Well perhaps we weren’t looking hard enough. The galaxy is a big place you know.” the Elojin sniffs.\n“Don’t bother asking me where it’s at though, I won’t tell you where it’s at, no matter what you do. However I’d be willing to SHOW you, if you’d consider this a joint venture between our two governments. Just think this could bring about a new age of cooperation between our two species!”\n\nTranslation: “I’m going to use you for my own gain, until I can find a way to fuck you over.”", "action_results": [{"action": "Humour him", "result": "“You’ll forgive me if I don’t share your optimistic vision of utopia, even if I was inclined to believe that you were being serious. However, seeing as we haven’t found anything else of importance on this forsaken planet, I’m willing to entertain this idea, but you’re going to have to patch some holes up in your story before I even consider letting you live.”\n“What holes?”\n“Well let’s start with the whole building idea. If you found this Xont building, why didn’t you and your team make off with the stuff already? And don’t tell me that you were ambushed by the Mazatt because if you had been, they would’ve taken your findings, OR if the technology was as powerful as everyone claims, you would’ve been able to destroy them with it. Sounds like typical Elojin shit to me…”\n“Ha ha ha! Who said I had a team? You see, unlike the rest of you galaxy conquerors we Elojin don’t feel the need to send an army to scout a planet, when one or two of us can accomplish the same thing when deployed in strategic areas.”\n“Hmm, so there are more of you here.”\n“Perhaps. It wouldn’t matter though since we’re deployed in completely separate parts of a planet, even if we were all together, we wouldn’t be able to stand up to a force the size of yours.”\n“That brings me to the next question, if you found this building already, how come you just didn’t stay there? What the hell do you need us for?” you ask.\n“Excellent question. Well there are some rather nasty things lurking in there. Much too powerful for me, but I’m sure you’d have no problem dealing with them. I didn’t get too far without them chasing me out. I even tried recruiting a nearby tribe of those silly little reptile creatures to use as cannon fodder, but they refused to go in. From what I can gather they consider the place to be haunted and seem to hold the place in awe and fear. I suppose I should’ve known better to ask the Mazatt for help when I discovered their encampment, but I figured they’d at least listen to reason. Things seem to work out though; your blue concubine came in with full guns blazing and brought me back here.”\n“Okay last question, what proof do you have that it’s a Xont structure, and not just ruins of some other alien species.”\n“This!” The Elojin quickly pulls out some weird coins out of his pocket and puts them on the table.\n“The Mazatt never even took these from me. Idiots. These are genuine Xont coins though! The metal is like nothing I’ve ever seen on this anywhere else, let alone this planet. It’s obviously not from here. The writing on it looks similar to what many stories have described. And this symbol. Tentacles wrapped around a planet. This is supposed to be what the Xont emblem was.”\n“Yeah, yeah, a writhing mass of tentacles. I’ve heard that description too. Several of them. Proves nothing.”\n“But this is the closest anyone’s come to finding something directly relating to the stories! One of the more common stories I might add! Look we Elojin have done the most research in this than anyone, and I’m convinced what I’ve seen IS a Xont building!”\n\nWell it might all be a lie, but he certainly looks convinced, and you have to admit you are a bit curious now. You’re just not sure you want or need him to be with you, when you get to the building.", "action_results": [{"action": "Agree to a partnership but ask what's in it for him", "result": "“Alright, you’ve got a deal for now, but what’s in it for you?”\n“Well the technology of course.”\n“Ha ha! You can’t be serious! Assuming all this bullshit is real, and we get through all this alive, what makes you think we’d give anything that might benefit you?”\n“But we have a partnership. You agreed.”\n“I agreed to not kill you, in exchange for you to play guide, we might even let you go afterwards.”\n“I hardly see you taking advantage of me as an equal partnership.”\n”Well you see correct then. Think of it this way, you owe us for saving your life from the Mazatt, and this is your payment.”\nThe Elojin, looks at you for awhile in silence before speaking again.\n“Very well, it would appear that I have no choice, but surely since I found this place and leading you there, I should get something out of it.”\n“Well you got those coins. I wouldn’t call that nothing, oh wait, they’re mine now. Tell ya what; if we find super advanced cooking utensils we’ll let you have those. Now, if you’ll excuse me, I have to go convince my team that we’re going to be look for a mythical building with only an Elojin to guide us. You will be under guard at all times and any attempt to escape will be frowned upon with excessive force. Understand me?”\n“Of course.” The Elojin says obediently. You can’t help but to think he’s going to try to betray you at some point, and in this case he’d have good reason to do so, but you’ll have to worry about that later.\n\nYou and the Elojin exit your quarters and you address your team. Alyssa verbally tells the more unruly ones to shut up.\n\n“Alright team, we’re finally going to do something worthwhile on this planet, we’re going on a treasure hunt of sorts, guided by this spotty freak here. He’s claiming there’s a Xont structure here, yes the Xont, I’m sure you’ve all heard the legends over and over, and while it might just be Elojin bullshit, we don’t have anything better to do, so we might as we check it out. And if he’s lying we’ll make sure he’s the first one to die if he’s trying to lead us into a trap.”\n\nMost of the team looks a bit hesitant. Alyssa is stoic as always, but you can tell she’s not entirely happy about this idea. They’ll follow you though. A few of the lizards heard the word “Xont” and went running back into their huts, seems they aren’t the only ones you scared, since LeFleur looks down right petrified. Finally you get the predictable reaction from Salo.\n\n“WHAT!?!! Captain I’ve held my tongue for too long about your liberal views on aliens, but now I must speak! You are treading the dangerous road of heresy by consorting with Elojin trash! Their types are nothing but liars and deceivers and you would allow one to guide us to who knows where? He has twisted your mind, and I won’t let this blasphemy continue!\"\n\nIndoctrinator Salo pulls his weapon out and aims it at the Elojin.", "action_results": [{"action": "Reason with Salo", "result": "You step in front of Salo’s weapon, he just barely keeps from firing, and he still may do so. The rest of the team seems to be unsure of what to do, except for Alyssa who pulls her weapon out and aims it at Salo. The only one who’s calm is the Elojin, who seems to be getting a kick out of this.\n\n“Get out of the way Captain, I’ve got to kill him, he’ll lead us all to death with his lies!”\n“Easy there Salo. Look I don’t trust the sonofabitch either, but if we got a chance at finding this Xont building…”\n“LIES! And so what if it is true? The Xont were an alien race that raped countless worlds, and fell due to their decadence! What use has the Terran Empire have for the ruins of an utterly evil civilization?”\n\nWhile Salo is strong in his convictions about hating to work with aliens, you know he also can’t pass up the opportunity to kill more of them. You decide to appeal to that side of him.\n\n“Well think about the technology could be used to help humanity fight its enemies. The Xont as you say subjugated many worlds, and they did it with minimal effort. Perhaps we’ll find something that could destroy those who would oppose us instantly. The Order might promote you for our finds and use it for the good of the Empire. We could possibly bring in a new Golden Age of Humanity!”\n\nSalo’s eyes start to glaze over as he takes your words into consideration, he then lowers his weapon. You then whisper to him.\n“We can always kill the Elojin when he isn’t useful anymore.”\nSalo seems to REALLY like that idea, and agrees to your plan. He still has to get the last word in though.\n“Very well, we’ll do things your way, you are my Captain and I will follow you, but if I see this expedition not following the best interests of the Empire I WILL step in.”\n\nSalo goes and prepares himself for the journey ahead and Alyssa tells everyone else to do the same, since LeFleur apparently went and hid in a tent while this “showdown” happened.\n\nSoon the team is all packed and ready to go; the Lizards seem to be happy to see you to leave, especially with the mention of the Xont. You wonder if you shouldn’t try to get more information from them before you leave, their fear would indicate they know something of them.", "action_results": [{"action": "Get information", "result": "You start to question the Lizards but won’t say anything, they just give you a cold reptilian stare, start to get agitated and begin hissing at you.\n“Ssssak Sakkeekeessss!”\nYou begin to get angry. How dare these lower life forms withhold information from you!\n\nAs your voice raises, the Lizard you’re questioning says something in his native tongue “Sliiisssthelisk!” and swipes his claw across your face. You immediately shoot him. This results in further carnage.\n\nThe battle is quick and bloody, you round up the demoralized survivors and question them further, but most of them don’t know anything and just repeat some prayer to their gods in their language. Salo is eager to kill them, but you decide they will be useful to carry your excess belongings. You begin to use them as “pack animals” and head off.\n\nThe Elojin begins to lead your team deep further into the jungle, keeping up his usual chatty demeanor.\n\n“Oh yes, it’s this way, now we may run into more of those reptiles, but I’m sure you’ll have no trouble handling them, like you handled these fellows here.”\n“Quiet Elojin! Your constant prattle is annoying and serves no purpose!” Alyssa snaps.\n“One could say the same about your presence here. At least I’m serving a useful purpose, of leading you to what could be the find of the millennium, you on the other hand are just an expendable soldier of an Empire slave race. Any fool that knows how to use a weapon could replace you.” The Elojin retorts.\nAlyssa smashes the Elojin in the back of the head with her weapon; he falls to the ground in pain. You immediately intervene.\n\n“Sergeant! What the hell do you think you’re doing?! He has to lead us to the Xont city!”\n“His words dishonored me! I will not put up with his disrespect!”\n”You WILL follow my orders sergeant! Don’t do that again!”\n“Yes sir!” Alyssa says and falls in line, but she stays as far as way possible from the Elojin. That blue bitch better remember whose boss around here if she knows what’s good for her.\n\n“I guess my thanks goes to you again Captain. This is the second time you’ve personally saved me from your overzealous team. I admire your domination over them.”\n”Shut up Elojin and do your fucking job! Speak disrespectfully like that again to any of my team and I’m sure Salo can find a way to cause you great discomfort without hampering you from your appointed task.”\n\nThe Elojin looks genuinely worried for the first time, and shuts up. He leads on with less talk, until you get to another Lizard village.\n\n“Now this is the Lizard village I tried to recruit to help me, the first time I found the structure. The Xont building isn’t far now, but we’ll get to it quicker if we go through the village.\"", "action_results": [{"action": "Destroy the village", "result": "For some reason you’ve steadily been over come with the idea human of superiority. In fact, you’ve been thinking a lot like Indoctrinator Salo and at this point your transformation is pretty much complete. You don’t even think about going into the village peacefully anymore, you fully intend to destroy it and enslave the survivors, just like you did last time. Humanity is destined to rule.\n\n“No prisoners.” You tell your team and charge into battle, it isn’t as easy as you thought though.\nThe Lizards somehow knew you were coming and they ambushed you and your team. Several of them fall into pits with either sharpened spikes or poisonous creatures at the bottom. While you’re temporarily caught off guard, you and Salo’s fanaticism rally your remaining troops to fight on shouting how the Lizards are no match for humanity.\n\n“ONWARD! FOR HUMANITY THE RIGHTFUL RULERS OF THE GALAXY! OUR DESTINY WILL NOT BE DENIED!”\n\nIt works for the most part, the team begins to become inspired, except for two, Alyssa who didn’t need any encouragement to fight harder, but is showing signs of unhappiness at your new outlook on life. Tough. The other being LeFleur who finally broke down and ran.\n\n“TRAITOR!!!” Salo shouts and shoots LeFleur in the back like the coward he was.\n\nAfter the battle you have significantly less people with you. The entire Lizard village has been wiped out; the Lizards that were enslaved either ran off or were killed in the ensuing mayhem. Strangely the Elojin is still around. You half expected him to try to escape. He looks at the carnage that you wrought upon the village, and looks over at Salo, who’s busily pulling teeth from the dead Lizards to make some sort of necklace no doubt.\n\n“Well if you’re done playing with your scaly friends, the Xont building awaits.”\n\nThe Elojin takes you and your remaining team a short distance, and there it is in all its glory. Its like nothing you’ve ever seen before, this is definitely Xont. You can feel it in your heart and the technology within shall be the Empire’s. You briefly daydream about finally being able to live out your original purpose of joining the Empire in the first place: To bring glory in HIS name. With this find, you’ll be able to do just that. Unfortunately that annoying Elojin begins talking again.\n\n“Well we’re here, now remember there’s some dangerous things lurking in there, I can tell you where I ran into them, and some of the interesting rooms I found that you should explore before I got chased out.”", "action_results": [{"action": "Kill the Elojin", "result": "“You’re services are no longer required Elojin trash.” You say and shoot him.\nHe falls to the ground clutching his chest, and laughs before dying.\n“Hahahaha, I knew this was coming. It’s what I would’ve done. You haven’t won though human, you’ll see.”\nObviously he thinks you won’t be able to handle whatever is in there. Of course maybe one puny Elojin couldn’t, but humanity is made of stronger stuff. You and your team enter the building ready for anything.\n\nAt least you thought you were. Once again your increased arrogance, has lead you to overestimate the worth of humanity, and underestimate your enemies. You don’t get far before you encounter the “things” that the Elojin was talking about. The Elojin wasn’t kidding when he said there were “things” in here. There are simply no other ways to describe the abominations you face. Writhing mass of tentacles comes to mind again though. The creatures are large, utterly mindless and brutally start tearing your team apart with ease, gobbling bloody limbs in one gulp. No amount of ranting and raving rallies the troops on this one. Soon, you, Salo, and Alyssa are the only ones left. Salo seems oblivious to the fact that this fight is hopeless, and continues to fight on, still screaming his usual doctrine. Alyssa fights on as well, but more out of a sense of self preservation rather than fanaticism.\n\nWithin the chaos, you see an opening that could allow you to escape.", "action_results": [{"action": "Fight on", "result": "Stubborn to the last, you continue to fight the abominations, having an interesting last conversation with Salo as you reload what is surely your last clip.\n\n“Salo they’re going to remember this day of what we’ve done! Our sacrifice won’t be in vain! The Empire will find this and use the power within to destroy its enemies!”\n“Yes! And our bones will be found, and we’ll be remembered as the ones who paved the way and our names will live on forever!” Salo, replies.\n\nThis last bit of wishful thinking of “immortality” after your death at least makes you feel better before you feel a tentacle plunge through your stomach and another wrap around your head, popping it off like a dandelion.\n\nFortunately you weren’t alive to see what happened afterwards…\n\nFirst off your bones wouldn’t have been found, the abominations ate everything. So your “sacrifice” wouldn’t have been known by the Empire at all, even if they had found the Xont structure, which they didn’t.\n\nThanks to you, wiping out the nearby Lizard village as well as killing some of abominations in the structure (and severely wounding several of them) you made things a lot easier for the small Elojin team that had been lurking nearby. After it’s pretty clear that your team was destroyed, they took the opportunity to take advantage of the situation, mopping up the now weakened abominations inside and thoroughly looting the place.\n\nIn typical Elojin fashion, they end up using the technology to keep everyone fighting each other and maintain the “status quo” except with them in an even better position than before, so they aren’t attacked as often. Effectively becoming the “puppet masters” of the galaxy.\n\nThe Elojin was right, you didn’t win.", "action_results": []}, {"action": "Run", "result": "In a brief moment of clarity and sanity you realize you’ve been making a horrible mistake. You need to get away from this place as soon as possible. You beat a hasty retreat telling Alyssa and Salo to do like wise. Alyssa follows, but Salo looks betrayed and yells at you, followed by a scream as the abominations make quick work of him.\n\nUnfortunately your escape is short lived as when you get out of the structure, you’re ambushed by a small Elojin team who were lurking outside. A pulse blast hits your chest, and you fall immediately to the ground. Alyssa, who was following close behind, sees you fall and comes out with guns blazing making quick work of the Elojin bushwhackers.\n\nAlyssa attempts to help you, but it’s too late. Before you die, you smile and tell her that you’re sorry, she doesn’t show it, but you can tell she forgives you. She didn’t like how you transformed though. The legacy of the Xont didn’t help you at all, the mere thought consumed you and Alyssa sees that only bad can come if anyone gets a hold of whatever may lay inside.\n\nBeing the survivor she is, Alyssa makes her way back to the Lizard village that you so recently turned into a graveyard, and spends the rest of her stay there. She makes short distanced explorations to break up the monotony, but never ventures back to the Xont structure. When the Empire supply ship comes she is taken back and reports that the planet has diseases that wreak havoc on the humans, thus the reason why she’s the only survivor and there’s nothing of value on the planet. She continues with her lie that the Elojin were trying to use it as a base, she then suggests that the planet be bombarded with mass drivers so at least they can’t use it. The Empire hardly ever needs a reason to bombard a planet, and so it is done, and the Xont structure is unknowingly destroyed and its secrets along with it.", "action_results": []}]}, {"action": "Keep him around", "result": "Despite Salo’s insistence, you make the decision that you shouldn’t kill the Elojin just yet. The Elojin looks at you in silence almost expecting to get shot, but quickly becomes talkative again when he realizes his life is going to be spared a few moments longer.\n\n“Okay be ABSOLUTELY quiet, those things are still in there, if you have to fight them let’s at least get into one of the rooms where you can shoot at them with less danger, a lot of them have narrow doorways for some reason.”\n“Hold on there spot boy, what exactly are these things?” you ask\n“I don’t know, but they’re large, vicious, and mindless and have a lot of tentacles.”\n“Could they be Xont?”\n“I doubt that, they’re far too animalistic. Maybe they’re some sort of genetic Xont experiment, who know? Let’s just not run into them!”\n\nWith the Elojin in the lead you and your team follow as quietly as possible, soon the Elojin leads you to a room with a lot of strange looking computers. They have a look of being incredibly archaic yet very advanced. Buttons with bizarre symbols are all over the machines\n\n“Now I think this is a control room of some sort, I was meaning to come back here to study it more, but I was trying to map out the place first.”\n“So what the hell do these things do?”\n“You humans have those huge audio organs hanging from your heads, yet you seem to be unable to hear. I just said, I didn’t study the room, I was meaning to come back to it!”\n“Enough of this Elojin’s insults! We have no further use for him!” Salo yells at the top of his lungs.\n\n“Look you can certainly kill me if you want, but I am somewhat familiar with Xont legends and such. I probably could figure out what all this exactly does, if you let me. You start pushing buttons at random and you could be asking for trouble.”\n\nThe Elojin is obviously attempting to prolong his miserable life a little longer, despite the fact that he knows the inevitable is coming soon. Of course he also could be trying to set you up some how. He looks at you expectantly.", "action_results": [{"action": "Have the Elojin killed", "result": "You sense the treachery that lurks within this alien. He’s setting you up; well his silver tongue has only gotten him so far.\n\n“We humans have been learning things through trial and error for centuries, no reason to change now. Salo, shoot this spotty freak!” you say.\n“Wa…” the Elojin doesn’t even finish before Salo melts half of his head with his plasma pistol. The Elojin slumps to the floor lifelessly.\n\n“Okay, now does anyone here know about Xont legends or read about any of that shit?” you ask your team. A relatively young trooper steps forward. It’s Private Dobbs.\n\n“Um, I read a few things when I was a kid, but I don’t know anything about this sir.”\n“Well can’t you remember anything? Like what these symbols mean?”\n“I suppose I could guess.”\n“Dammit soldier, I can fucking guess! I’m asking you can you do better than guess?!”\n\nBefore he can answer it appears that one of the inhabitants has finally tracked you down, and its as horrible looking as the Elojin described it. Tentacles, teeth, large and hungry.\nIt makes an ear piecing roar and attempts to enter the room, but is unable to get through, that doesn’t stop it attempting to lash at your team with its tentacles, who immediately open fire on it.\n\nWell you could help and let Dobbs study the computer, or you could just do it yourself and order Dobbs to help fight the abomination instead.", "action_results": [{"action": "Let Dobbs do it", "result": "“Figure out that machine, Dobbs!” you shout and go help the rest of your team. The creature’s tentacles are surprisingly long and are still doing a number on your team, its fortunate that being stuck in the doorway makes it a lot easier to fight, you’d hate to be surrounded by more than one of these things. After a combined effort of bullets, lasers, and plasma, the creature finally dies. Now you’ve got new problems, first of all the creature’s dead body is completely blocking the doorway, but worse, all the sound of battle only attracted more of its kind.\n\nYou’re temporarily safe for now, as you know the creatures can’t get through the doorway, let alone with a corpse of one their own blocking it. They won’t go away though. In fact it sounds like they’ve started eating their dead buddy; eventually they’ll be able to make enough of an opening to attack again.\n\nMeanwhile Dobbs seems to have activated something. A wall slides open revealing a small line of silver robots. Their metallic glean is almost blinding even in this low lighting. Judging by their build and the wicked looking weapons they’re carrying, they were designed for battle, it also looks like they’ve never been used. They stand silent awaiting instructions.", "action_results": [{"action": "Ask Dobbs what he did", "result": "“Dobbs! What did you do?”\n“Um I don’t really know, I just started pressing buttons and that happened.”\n“Well turn them on and tell them to start blasting those tentacle monsters out there!”\n“I don’t know how! I mean even if I do turn them on, what makes you think they won’t attack us? ”\n\nDobb’s behavior begins to make Salo angry.\n\n“So you think it’s better to stay in here, trapped? You disgust me; your cowardice is that of an Elojin! Out of the way, the Emperor’s Will guides my hand!”\n\nBefore you can stop Salo, he starts randomly pushing buttons. One of those buttons turns on the robots. Red lights flicker on in their eye sockets.\n\nRed lights then flicker on you and your team…\n\n“INTRUDERS!” metallic voice echo in unison.\n\nThe battle is quick and bloody as the Silver Sentinels mow all of you down into a bloody mess. The last thing you see as you struggle to breathe is one of the Sentinels pointing its weapon at your head which against all odds, seems to be smiling.", "action_results": []}, {"action": "Examine the robots closer", "result": "“Alyssa you and the rest keep an eye on that doorway, if those things try to get in again, you know what to do. Dobbs, don’t touch anything else in here.” You say and inspect the robots closer.\n“Yes sir, but I should tell you, that we’re running out of ammo.” Alyssa remarks.\n“Dammit, you heard the Captain! He didn’t ask you for your opinion you alien bitch! You should be lucky you’re even allowed to serve the Empire, and not destroyed like the non-human trash you are!” Salo rants.\n“Salo, I serve the Captain, I’m loyal to him, not the Empire, and I’ve had just about all the abuse I’m going to take from you!” Alyssa says and points her weapon at Salo, catching him off guard. There’s no way he’ll be able to react in time, the rest of the team stands frozen, they’re trying to watch the doorway and this new situation at the same time.\nYou’ve never seen Alyssa lose her “cool” like this before. Granted this whole expedition has made everyone extremely irritable, but even under worse conditions than this, Alyssa has always been very calm.", "action_results": [{"action": "Let Alyssa shoot him", "result": "Salo, raises his weapon, and is struck down with a single bullet to the head. His fanatical rants end immediately as his body hits the floor. Alyssa looks at you, and you just nod. The rest of the team relaxes a little knowing that at least this situation has been diffused.\n\nYou immediately pull out the coins you took from the Elojin earlier and inspect them, put them on the floor, take Salo’s plasma pistol and melt them into nothingness. This damn Xont quest you’ve been on has fucked up your mind, between the Elojin’s syrupy words, Salo’s rants, and the overall strange feeling you had since you first got those coins, not to mention this PLACE itself, you only now are starting feel like yourself.\n\nThere’s still the matter of getting out of here though, fortunately Dobbs may have found a way to do that.\n\n“Um, sir? I think I remembered what some of these symbols were supposed to mean, I think I can figured out how we can turn them on without them attacking us. I remember a Xont legend about “Silver Sentinels”, and that’s what these things look like. I guess they were created by the Xont primarily to act as guards for scientists, if we don’t look like a threat then they shouldn’t attack us. In fact they’ll probably start attacking those things lurking outside.”\n“Yeah, but we aren’t Xont, won’t they attack us anyway?”\n“I don’t know, but didn’t the Xont supposedly have a lot of different races working for them? Maybe the Sentinels will think we’re just a harmless subject race of the Xont”\n“So what do we do to look harmless?”\n“Drop all our guns.”\n\nEveryone isn’t too enthusiastic about that idea! However, it sounds somewhat plausible. Scientists aren’t usually known for their combat abilities and they probably weren’t running around with guns because of the Sentinels, and thus weren’t considered a threat. You can only hope the Sentinels still don’t perceive you as a threat even without guns. Alyssa is particularly skilled in unarmed combat.\n“Let’s do it. It might be our only chance. Drop your weapons everyone. We’ll either live or die, either way; it’ll be quicker than waiting in here for certain death.”\n\nYour team reluctantly drops their weapons as Dobbs presses a few buttons on the computer. Red lights flicker on in the Sentinels’ eye sockets.\n\n“SCANNING…SCANNING…ALERT! GENETIC EXPERIMENTS FROM LAB 4 HAVE ESCAPED! THREAT LEVEL 10! TERMINATE HOSTILES!” their metallic voices say in unison.\n\nThe Sentinels move quickly to the doorway and begin to open fire on the feeding creatures. You can see the creatures fight back, but whatever the Sentinels are made out of must be strong indeed. Soon the battle moves far enough from the doorway, and you can hear the Sentinels hunting down the rest of the beasts. You climb over the dead creature in the doorway and take a quick look only to see more dead monsters. The Sentinels do their jobs very efficiently.\n\nYou could take this opportunity to try to escape or explore a bit more.", "action_results": [{"action": "Escape", "result": "Having just shaken the strange feelings that have been plaguing you (And to a certain extent your team) you don’t want to tempt fate and order everyone to grab their weapons and get the hell out of here before the Sentinels start hunting you.\n\nYou and your team hastily run back to the entrance, hoping not to run into anything on the way. As it turns out, you do run into something when you get outside, namely an Elojin ambush.\n\nYou get shot in the shoulder before taking one of them out. The rest of your team not far behind comes out firing; the Elojin team is small and wasn’t expecting to meet such heavy resistance, when they see they don’t have the advantage they thought they would they start to run. It doesn’t help them though; they’re cut down in flight.\n“Fucking Elojin, I knew he was going to try to set us up somehow!” you mutter, clutching your arm.\nStill eager to put as much distance as you can between you and the Xont structure, you order everyone to head back to the Lizard village you destroyed earlier.\n\nAfter everyone is settled in and bandaged up, you decide to make a speech.\n\n“Alright, what happened today was a major fuck up, and we did a bunch unnecessary reckless shit, but worst of all I ended up getting a lot of you killed for no good reason. I could blame it on a lot of factors, but I won’t, I take full responsibility for it. All I can ask is that you forgive me somehow.”\n\nYour team looks a little bewildered by your speech.\n\n“Sir, how was today any different than any other day? You’re always ordering us to do dangerous shit. Today a lot of us just were unlucky. It happens. But you were still there along with us the entire way just like always, and you got the rest of us out alive.” a trooper remarks.\n\nThe rest of your team agrees, with that remark. You’re a little surprised, but then not really. You continue your speech.\n\n“Well then I’m glad you’re all behind me, because we’re going to have to make up a story when the Empire comes here in a few months. Now this is what’s going to happen…”\n\nHaving experienced the temporary weird hold the Xont had on you, you decide that using anything that may lie inside the building won’t do anyone any good. You tell your team that the Xont structure must be destroyed, and it’ll be reported that the planet is useless and too hostile for humans to be of any long term use, it will also be reported that the Elojin are attempting to use the planet as a secret weapons developing base and should be bombarded into atoms. You feel slightly bad about LaFleur’s needless death, so you propose that it be mentioned that he died valiantly against the Elojin who had ambushed him. Salo’s death will also be attributed to the Elojin.\n\nThe rest of the time goes by without incident, you basically stay in the village until the Empire ship comes, at which point you tell your story. Considering you blame everything on the Elojin, your story really isn’t questioned. The Empire never needs that much of an excuse to bombard entire planets with mass drivers, so the Xont structure along with everything else on the planet is destroyed. You and the rest of your team are sent on your next mission, where you’ll also meet your replacements for the people you lost.\n\nOn your way, you think about what exactly made you break your temporary madness and it was Alyssa’s words of how her loyalty was to you and not the Empire. These words struck home, making you realize that your own loyalty is to your team, not the Empire. Of course you “serve” the Empire, but the people under your command…that’s who matter.", "action_results": []}, {"action": "Explore", "result": "Despite the weird feelings you’ve just shaken loose, you still think that this shouldn’t be a total loss; there are still things you could use and find for the Empire; however you realize you should minimize the risk.\n\n“Alright there’s no sense in all of us getting killed. So, me, Alyssa and Dobbs we’ll stay and explore the rest of this place. The rest of you take your guns and head back to exit as quickly as possible and wait at that Lizard village. If the Sentinels see you walking around with weapons, you know they’ll attack, so don’t linger.”\n“But what about you sir? The Sentinels will attack you, if you stay!” a trooper asks.\n“Well WE aren’t going to be carrying them; if we come across something else that’s hostile we’ll just have to rely on what we learned in boot camp and our trusty combat knife. Now get out of here, that’s an order!”\n\nAs the rest of your team leaves, you, Dobbs, and Alyssa are left to ponder what to do next.", "action_results": [{"action": "Explore this room more", "result": "There’s plenty in this room that still needs to be examined, besides you’ll probably be a lot safer here. Alyssa watches the doorway for anything that might come through. You look around the room, but other than the machinery and computers already in the room, you don’t find anything else. You decide to go see if Dobbs has found out anymore information.\n\n“So, you remember anything else from reading all those Xont legends?” you ask Dobbs.\n“Not really sir. The only thing I can determine is room is obviously a control room of some sort, and this entire building was some sort of research facility. I managed to turn on the computer screens, looked at a bunch of schematics and maps and gone through these logs, but I can’t read any of the language. I can guess on some things, but I’m still nervous about pressing more buttons at random, I don’t think we’re getting any further in here.”", "action_results": [{"action": "Go explore the rest of the structure", "result": "“Alright, let’s explore the rest of this place, let’s try to avoid any confrontation with anything though, we’re walking around without any firepower.”\n\nYou, Alyssa, and Dobbs go back into the darkened hallways, trying to remain quiet as possible. You can still hear sounds of battle echo, as the Sentinels are still trying to hunt down whatever left over failed experiments those tentacle things are.\n\nMost of the rooms you encounter seem to be normal quarters, presumably where the scientists here slept. Most the rooms are either in disarray or almost bare, you don’t find anything of interest. It looks like this structure was abandoned while it was probably still in use, you get the impression it was due to those experiments that the Sentinels are currently exterminating. Looks like someone didn’t activate them in time, makes you wonder why this structure just wasn’t re-taken though.\n\n“Sir, I don’t think there’s anything of any importance here, we should just leave.” Dobbs continues to advise.\n\nDobbs must really not like it here; you don’t think you’ve ever heard him complain like this before, seeing as you know he keeps his opinions to himself for the most part as far as personal “comfort” is concerned. Alyssa of course is willing to do whatever you’re up for doing.", "action_results": [{"action": "Continue to explore", "result": "“Dobbs you’re starting to sound like Lieutenant LaFleur, now come on; we’ve still got some ground to cover.”\n“Sir with all due respect, I am not. And using LaFleur as a reference to compare me to, so close after his death which you were responsible for makes me suspicious.”\n“Watch your mouth private!” Alyssa reprimands.\n“Excuse me private!?” you add.\n“I’m sorry sir perhaps that was out of line I know it was Salo who directly shot LaFleur, but sir you HAVE been acting erratically ever since we’ve been on this damn mission! I guess we all have. I thought you’d shaken it after you shot Salo, but you’re still acting a little obsessed with this whole Xont thing. This place still emanates some sort of weird power. Maybe some things are better left unexplored; we need to get the hell out of here for all our sakes!”\n\nDobbs does make a few good points.", "action_results": [{"action": "Ignore Dobbs", "result": "“While I guess it’s good that you’re speaking your mind, and looking out for our well being, I feel fine Dobbs, I’m well aware of the stuff you’re talking about, but…”\n“FOOL! I tried to warn you!” Dobbs yells, pulls out his knife and attacks!\n\nDobbs catches you off guard and tackles you to the floor raising his knife to thrust down on your head. Alyssa immediately stabs him repeatedly in the back, but whatever the hell is driving him, has made him unfazed by normal pain. He temporary takes his attention off of you and slams Alyssa into the wall. You take the advantage and with one quick twist you snap his neck. As his head flops like a dead fish, his body soon follows. You get up panting.\n\n“Shit. Well someone was being influenced by something!” you remark. “Sergeant, have you been feeling anything strange, because if you have, let me know!”\n“Not really sir, I felt a heighten state of irritability earlier, but that dissipated after you shot Salo. My thoughts have basically been the same though; my people have very disciplined minds as you’re well aware.”\nYou smile a bit at this remark, which you know wasn’t made out arrogance, but merely fact. Alyssa continues. “Whatever took a hold of Dobbs seems to have been trying to guide us to leave. Maybe we’re getting close to finding something.”\n“Maybe, but even if we’re okay now, maybe we should get out of here.” You say.", "action_results": [{"action": "Play it safe and leave", "result": "You decide to play it safe and leave. Alyssa doesn’t show it, but you can tell she looks a bit relieved. You manage to leave the building without any incident. There are lots of dead tentacle creatures, but where the Sentinels are you have no idea, and you’re not really in any hurry to find out. When you get outside you see some dead bodies of Elojin and a few of your own team members. Apparently the Elojin were waiting in ambush and underestimated your numerical advantage. You hope the rest of your team made it back to the village safe.\n\nWhen you get there, they look relieved to see you. You all begin to exchange information. You all are pretty much in agreement, that you all were overcome by something during this whole “quest”, whether it was some sort of ancient mind control device that is still operational, or the Xont themselves, you don’t know. You do know that you were driven there, yet when you broke the “hold” you were being driven away, as if you were perceived to be more of a threat. Something in there is important and the place does bear more exploration, but its not going to be your team that does it. Too much has been lost and it’s obvious you aren’t really equipped to explore the place without placing yourselves in unnecessary danger.\n\nYou and your team spend the remaining time in the village, where you can stay within a safe proximity to the Xont structure, without getting too close. The rest of your stay passes relatively quietly. When the Empire ship comes, you explain everything to your superiors, with the exception of shooting Salo which you change the story a little bit. You state he was over come by whatever madness the structure was emanating and drew his weapon on you, causing you to have to defend yourself. You go on to explain Xont structure and severely warn of the dangers of the place.\n\nYour superiors have a mixed reaction to your tale. On one hand they’re pleased that you discovered this find of the millennium, but are suspicious of this “mind control business” you’re reporting. Some wonder if you still could be influenced, and shooting an Empire Indoctrinator doesn’t really help either. They don’t really want to execute you for mere suspicion though, not to mention you still might have questions they need answering.\n\nUltimately you’re taken off duty and put in a military hospital under observation for months. The rest of your team is as well, but they make sure to keep you all separated from each other. It’s a relatively unpleasant time for you. While you spend your time under going tests and interrogation, the Empire sent a better prepared team to the Xont structure to extract whatever they could find inside. Unfortunately even with the preparation, something still goes wrong. Chaos starts to ensue throughout the Empire, and how it spreads so quickly is unknown. You hear things every now and then, but you’re kept mainly in the dark, but even you hear about the civil war that erupts.\n\nIt’s during this time that someone comes for you as you sit in your cell. It’s Alyssa!\n\n“Sir, the place has been abandoned we should get out of here and try to find a ship, I’ve located a few of the other members of our team as well.” She says as if you’ve never lost contact.\n“Well I can see you’ve thought out the escape plan. You have any idea what to do afterwards though? I’m sure you’ve heard that there’s a civil war going on.”\n“That’s up to you Captain, I’m just here to set you free and follow you.”\n“Well I don’t know if I’m still a captain, Alyssa, you can probably call me by my given name. No need for formalities anymore. As for what we’re going to do, well I suppose we can figure that out on the escape, maybe we should just go find a quiet part of the galaxy and get the hell away from all this shit.”\n“Whatever you decide, I’ll be there.” Alyssa says. There’s something definitely comforting about that.\n\nAs you make your way to your first steps to escape, you think if the Empire had had more soldiers like Alyssa there wouldn’t have been a civil war.", "action_results": []}, {"action": "Soldier on", "result": "You’re in it this far, might as well explore the rest. Soon you come to an elevator; you and Alyssa look at each other and enter it. Anything could be lurking down there. You start to breathe in and out trying to calm yourself, while Alyssa employs a quieter calming technique of closing her eyes and preparing herself.\n\nThe elevator door opens and you both exit.\n\nAfter much exploration, there’s nothing down here! In fact there’s no indication that anything is living down here, just a bunch of devices, and research notes that you don’t understand, but would be useful to the Empire if they ever got there hands on it. You don’t really want to mess around with anything down here, not after all the mind control shit you were putting up with before. You and Alyssa leave for the ground floor again.\n\nUpon reaching it, you see the Silver Sentinels, but fortunately they don’t attack since you still aren’t carrying your guns. They just patrol right past you, but you don’t want to risk it, so you hurry out as fast as you can. The outside of the structure has the scenes of a small skirmish, dead Elojin lie on the ground as well as a few of your team. Apparently they figured you all would get killed inside and they’d pick up the pieces.\n\nReaching the village your team looks relieved to see you come back. You take the opportunity to say a few words.\n\n“Alright team, all of us and me especially were under some fucked up influence, not sure what it was, but it wasn’t good. Now there was a lot of stuff done, that doesn’t need to be reported, so I’m hoping you’re all willing to back me up on the story.”\n“We’re with you sir.” one of them pipes up.\n“We always will be.” Alyssa adds.\n“Alright this is what we’re going to do…”\n\nWhen the Empire ships arrive, you explain a story about Paradise being a hostile world holding only death. You feel bad about LaFleur’s needless death so you also add that he died bravely in combat and should be posthumously rewarded. You also say the Elojin were attempting to use the place as a secret spy training camp, and state that mass driver bombardment of the planet should be in order. Your superiors have no reason to disbelieve you, and take your advice. Paradise is laid to waste and the Xont structure will never be discovered. You’re sent on your next mission where replacements will meet you.\n\nOn your way there, Alyssa as approaches you.\n\n“Why’d you do it Captain? Why didn’t you reveal the Xont structure? You might’ve gotten promoted or even better, assigned to a different command.\n\n“Because it would’ve just made things worse. The Empire’s survived this long, it’s not going to fall anytime soon. I’d rather live with the way things are, than risk an uncertain future. Besides I don’t want to leave you anymore than you want to leave me.”\n\nAlyssa smiles at this comment, a rarity that you wish she’d do more often.\n\nOf course in time you do see it a lot more.", "action_results": []}]}, {"action": "Listen to Dobbs", "result": "You decide to listen to Private Dobbs, exploring this place probably isn’t the safest thing to do given that you’ve only just shaken the weird mind control you were experiencing earlier. You all head for the exit, which is fortunately without incident. You encounter some dead bodies of Elojin and some of your team when you get outside. Looks like your team won, you guess the Elojin were hoping you’d be easy pickings after coming out of the place.\n\nWhen you get to the Lizard village the rest of the team looks relieved to see you. You all exchange information. You’re unsure what to do about the Xont structure though, you’re tempted to go back in, but you decide that you should probably just stick around and just report your findings to the Empire which can send in a better prepared team. In the mean time, you spend the rest of your stay at the Lizard village. It’s uneventful until one day Dobbs comes up missing for roll call, this is followed by a huge explosion later during a search for him. The shockwave of it, makes you almost think you’re being bombarded from above, but after it dies down you realize it was the Xont structure.\n\nYou and your team immediately head over to where it stood and it is completely gone. Nothing but a gigantic crater exists. Whatever useful information it contained will remain a mystery.\n\nThe disappearance of Dobbs makes you come to the conclusion of either one of two things, either he was under the influence of something that didn’t want you uncover any Xont secrets and he snuck off to activate some sort of self-destruct mechanism. Or less likely, he wasn’t under any influence, but decided that for the good of the Empire, the Xont structure needed to be destroyed so it couldn’t possibly cause any trouble like it did with you and your team.\n\nWhen the Empire ship arrives you decide to leave out the whole incident with the Xont structure, your superiors would only be mad at you for losing such a find. You report that you suffered casualties with Elojin and native forces. You also add that Private Dobbs should be honored post humorously for his bravery in battle. Finally you go on to report you didn’t find anything of any use for the Empire on the planet.\n\nYour superiors nod and dismiss you. They write Paradise off as a low priority and not worth colonizing or even keeping an outpost on. Eventually you’re sent on your next mission, which is far away from Paradise. You wonder though if you’ll get another chance to discover something on this planet though. It is a big galaxy after all.", "action_results": []}, {"action": "Feeling different? (Current thoughts)", "result": "You don’t feel any different, actually you feel like yourself, more so than you were previously. True being in this place gives you a feeling of unease, but you’re not really having any strange thoughts, like you were before, at least you don’t think you are.", "action_results": [null]}]}, null]}, {"action": "Continue pressing buttons", "result": "You can tell Dobbs is getting skittish about messing around with the machine, so you decide to take over.\n“Um sir, I really don’t think you should start pressing buttons…”\n“Quiet private, I’m taking the risks here…well what’s this?”\n\nYour ingenious process of pressing buttons until something happens has activated a hologram of some sort. The hologram image is that of a humanoid. You’ve never seen what race it’s based on though.\n\n“Xgeehti! Sathayi egawah tylageti!” the hologram says. You don’t know what that means, but it looks agitated though.\n“Sir, we should get out of here, this hologram might be activating self defense systems!”\n“Lagxet… Language process identified….Who are you people? I don’t recognize your species, are you yet another genetically designed slave for the Xont? They must be losing their touch, because you look pretty unimpressive. Though that blue female looks like she shows promise. And why have I been off line for so long? Wasn’t the outbreak under control?”\n“Outbreak?” you ask.\n“Yes! The outbreak! I told them that they should take special precautions with the new germ weapon they were working on, but do they listen? No! They’re the galaxy rulers, they think they’re invincible, they know better than some hologram. Hey what happened to this place?” the hologram scans the dead bodies in the room and the carcass in the doorway and starts to realize that things have changed. “Erm, are the Xont still in charge of this facility?”\n“No, this is an ancient ruin for all intents and purposes. The Xont have long since disappeared. And up until now, they were considered a legend of some sort.” You reply.\n“Oh I assure you they were very real. Though I can honestly say, they were hardly worthy of legend status. Hmm, I guess now I know why I was off line for so long then.” The hologram states seemingly unworried about how much time has passed. “What race are you?” the hologram asks.\n“I’m human.”\n“What a dreadful name.”\n“SIR, we need to get out of here NOW!” Dobbs says and grabs you.\n“Private Dobbs, you will calm down this instant!” Alyssa shouts back at him.\nHe looks very distressed; he’s convinced that staying here will result in something very bad.", "action_results": [null, {"action": "Stay", "result": "“Private Dobbs, calm the fuck down! Nothing is going to…”\n“You know he’s displaying all signs of the sickness.” The hologram states.\n“What?” you ask.\n“The sickness. I remember when the outbreak first occurred; some of the scientists here started acting like him. I’ve never analyzed your race before, but his temperature, brain waves and blood levels are severely different from yours.”\n“YOU’LL NEVER LEARN THE SECRETS HERE! DIE IN THE NAME OF THE XONT!” Dobbs screams and attacks you with his knife! You manage to react in time and dodge the blow. You follow up with a couple of stabs to his gut; Alyssa immediately grabs him and slits his throat. It takes awhile, but he finally dies. After this unexpected attack, the hologram speaks once again.\n\n“Well I guess the Xont would’ve considered that a successful result of their experiment.”\n“Okay what the hell were Xont working on here and what do you mean by success?” you demand.\n“Oh they were working on many things actually, but they were doing a lot of research on mind control, and how it could best be implemented. The germ weapon I referred to earlier was one of their experiments. It was designed to infect other races with the “Xont way of thinking.” so they wouldn’t have to worry about rebellions cropping up on the worlds they conquered. What a spectacular failure that was…”\n“My team came in here and some of us felt strange, myself especially, but we seemed to have shaken the feeling. And while I felt a lot more hostile, but I didn’t feel like a servant of the Xont.” You say.\n“Well, I just said it was a spectacular failure! The problem with germs is they’re unpredictable and always changing! One might affect one person one way, might affect another very differently! Now take hundreds of different races into the equation and you have a recipe for disaster! I told them they should stick with technology; little obedience chips in the currency. Everyone likes money, everyone uses it and Xont currency was wide spread throughout the galaxy.”\n“I think we came across some of those coins.” You say.\n“Oh really? Well I’m sure the effect on you was minimal. I never got the chance to perfect them considering the idea was shot down before I could really get the project started! I only made a few test prototypes, and those were distanced linked to a power source in this facility. So I imagine they only started affecting you until you started getting closer to this place. You wouldn’t happen to have them still would you?”\n“No I destroyed them.”\n“What?! Well I can see my work isn’t appreciated today either! Ah it’s just as well anyway, you said the Xont were gone, who’s going to be using the currency anymore?”\n\nThe hologram seems friendly enough if a little odd, you could keep asking it questions, or you could attempt to destroy it, if you think it could still be dangerous.", "action_results": [{"action": "Keep asking questions", "result": "“I have some more questions.”\n“I’m sure you do. Very well, it’s not like I have anything better to do.” it replies.", "action_results": [{"action": "Ask more about him", "result": "“Me? Why I think you’re the first person who’s ever asked about me. This is a real special occasion. I’m a hologram of course, but it’s obvious that I’m not a common one. I actually existed at one time or rather my race did until the Xont exterminated us. I am actually the collective representation of what remains of the Gequek civilization. We were primarily a scholarly and relatively peaceful race. In fact we were the ones who made first contact with the Xont and gave them the ability to travel the stars, a decision that obviously came back to haunt us. They started out nice enough, but something within them changed. When we learned that the Xont were intent on galactic conquest we refused to contribute anymore technology to their war machine, but by then it was too late, they attacked in force and completely conquered us. They saw us as a threat to their rule yet they still desired our knowledge. After bleeding our learning centers and our best minds dry of everything, they created this hologram to hold the data. I’m still not sure why they just didn’t download the information in their own databases instead of going through the elaborate process of making a complex hologram of a race that they were intent on destroying. Perhaps they saw us as a “parent” of some sort. After all we had given them everything. And even though they had the need to destroy us, they couldn’t bear thought of us being gone forever. Whatever their reasons, after I was created and online, the last Gequek were exterminated.”\n“So are you sentient, or just an elaborate program?”\n“Good question. I started out as just an elaborate program, I was taken from research center to research center assisting on projects for the Xont, and providing statistics, opinions and theories, but as time went on, I began to develop a sense of “self”. Unsurprisingly I began to display many Gequek traits which infuriated the Xont. They didn’t want to risk deprogramming me and disseminating the information in a more traditional way at that point though. They just learned to put up with me.”\n“Didn’t you want revenge though?”\n“For what? I mean yes the Gequek spirit lived on within me, but what purpose would’ve been gained by revenge? If I became hostile, the Xont would’ve destroyed me regardless of the loss to them and if I ceased to exist then so would the Gequek, I couldn’t let that happen. In my current service to the Xont, I was essentially immortal; I was well protected. My expertise was sought and I was grudgingly respected and my new found sentience was a constant source of irritation to them. The Xont are all gone and I’m still here so perhaps the Gequek did get revenge even if it was a little late.”", "action_results": [null]}, {"action": "Ask about the outbreak and germ weapon", "result": "“As I stated the Xont were working on a germ weapon to make others obedient to them. I guess it wasn’t so much of a weapon, as a reinforcer to those they had already enslaved. They really needed it too, at that point rebellions were becoming a big problem and they couldn’t just resort to mass genocide, as they had become too reliant on their slaves. The idea was to create a virus with Xont DNA. They thought by infecting others with “themselves” that it would cause them to be more willing to serve.”\n“I’m not a scientist, but that doesn’t make a lot of sense.”\n“Oh the virus was a lot more complex than that, but that was the basic premise. Still, you’re right, there wasn’t any evidence that it would work. Oh sure they did some tests that were successful, but they had done just as many that weren’t. They brought me here to help, and they really didn’t want to hear me telling them that the virus would never work the way they wanted it to. I told them they were making a lot of assumptions and were biasing their testing which really isn’t a good idea, if you’re making a virus weapon. Only when there was an accident in one of the labs did they see I was right.”\n“So what happened?”\n“Well before they unceremoniously switched me offline, I got to see first hand what the virus did. When the vials were broken, they should’ve evacuated the place then, but they were convinced that the virus wouldn’t have any effect on them, so it was treated like a minor mishap. A few days later it was pretty apparent that was the wrong way to go about it. The Xont scientists here started acting more aggressively, paranoid, and downright nasty. And keep in mind these were traits that most of them already exhibited, so these traits were increased ten fold. The other servant races here started acting the same way; some weren’t the loyal little slaves the virus was supposed to make them though. The air was ripe with rebellion, and soon everyone started killing each other. Xont were even killing other Xont, a few non-affected tried to send a distress call to the nearest military detachment to end this madness that had taken over the facility, I was going to go for a more direct approach and activate the Silver Sentinels, but then someone switched me offline, and I’ve been that way until just now.”\n“How come it didn’t affect some? And how is it still affecting people after all this time has passed?!”\n“Like I said, viruses aren’t certain. They mutate, and some people just have strong constitutions, so some won’t be affected at all, while others have severe reactions. For those affected, the only common thing that I saw the virus do was increase aggressiveness. It didn’t necessarily make one loyal to the Xont or anything else for that matter. As for why it’s still around after all this time, I don’t know. It’s obviously airborne, but I would’ve thought it would’ve died out by now as well too. Something is still carrying it… that dead Daklow in the doorway, didn’t you just kill it?”\n“You mean that tentacled thing? Yeah.”\n“Those creatures were designed to be strong physically, and very resilient, it’s quite possible that they are carriers and aren’t affected, of course you’d never know since they were bred to attack almost anything on sight. Anyway if that’s the case, I’d say anyone coming in here runs a risk of being infected, who in turn could infect others.”\n“Well how the hell are those things still alive though, if they were created eons ago?”\n“Uh, my guess would be they MATED with each other, thus producing generations of offspring and those aren’t same ones! Sheesh! Think man! It’s a good thing they have a strong sense of territory, that’s probably why they haven’t overrun the planet; they tend to stick near the place that they were designed to guard.”\n“So what do you think happened after you were shut down?”\n“Oh I imagine someone escaped, maybe several people and ended up spreading the damn virus to other planets, causing more strife in an already volatile situation that the Xont were in, which caused a predictable domino effect. I told them to stick with technology.”", "action_results": [null]}, {"action": "Stop asking questions", "result": "“That’s all I need to know for now.”\n“Okay then, I have a question, what are you planning to do?”\n“What do you mean?” you ask.\n“Well specifically I mean what do you plan to do with me?”\n“I haven’t decided yet…can you leave this facility?”\n“Not on my own, I can’t stray too far from my power source, if I tried to leave, I’d probably disappear and given the deterioration over time, I probably can’t even leave this room now. I don’t want to die, but I don’t really relish the idea of being a prisoner here all by myself. As narrow-minded as the Xont were at least I had someone to talk to.”\n“Isn’t there someway to transport your program?”\n“I doubt you have the means, you wouldn’t be able to just download me into whatever computers you may have. I was designed by Xont technology and I’ll only work in their systems, you’d have to use something similar to put the storage device on or find a working Xont holo-emitter.”\n“Is there one of those here?”\n”There was, but I don’t know where it might be, let alone if it still works. There could be one in the underground level”\n“There’s an underground level?”\n“Of course, you didn’t think this place was just one level did you? The Xont always liked building underground rather than up. I’d be careful if you decide to go down there, it could be completely safe, but they were doing some secret experiments that even I wasn’t allowed to know about, so who knows what’s still lingering down there. You may be putting yourself at great risk, you sure your Empire is worth it?”\n“What do you mean?”\n“I’m not an idiot, the only possible reason why you’re entertaining the idea of transporting me out of here, is so you can gain whatever information I can give you and your Empire, or whatever you call your system of government. No doubt to gain an advantage over your enemies and rule the galaxy. Time may have passed, but I know some things never change.”\n“If you think that, why help us?”\n“A sense of being useful? Purpose? Perhaps I’ve grown too cynical to care, but it’s better than being stuck here. I had to put up with the Xont for centuries. Your race cannot possibly be worse. It is ultimately up to you, what you want to do.”", "action_results": [{"action": "Seek out the holo-emitter", "result": "“We’re here now, we might as well, go look for it.”\n“Very well, I wish I could be of more help, but I’m afraid in my current status I can only wish you luck.” The hologram says and then describes what the emitter looks like so you’ll know what to look for.\n\nYou and Alyssa head in the direction the Hologram gave and eventually reach an elevator. You both enter, and wait for it to take you down. You might not be in any danger, and you’ve been in worse situations than this, but you feel the need to tell Alyssa something.\n\n“Alyssa, if we don’t get out of this I just want you to know that…”\n\nShe stops you.\n\n“Captain, if there’s anything down there, we’ll be able to handle it. And you don’t need to tell me, I already know.”\n\nThe elevator door opens ending the conversation, and you both exit.\n\nAfter much exploring there’s no indication that anything living is down here, you were worried for nothing fortunately. After searching countless rooms with research notes and devices you have no idea what they do, you eventually come across what you were looking for. You grab the emitter, which is a lot smaller than you thought and leave.\n\nUpon reaching the ground floor, you see the Silver Sentinels, apparently they’ve exterminated all the tentacled beast, but you still aren’t carrying your guns so they continue to perceive you as harmless. They patrol by and you hurry back to the Hologram.\n\n“Well, hello again, and I see you have the emitter! It wasn’t too much trouble I hope.”\n“None at all actually, nothing down there, except a lot of weird looking devices and research notes.”\n“Hmm, yes while you were gone I was overriding the computer system to see what the hell they were working on, interesting stuff I must say. And actually somewhat original, I didn’t know they had it in them. They never did get to test all their ideas out of course though, what with the outbreak occurring, well I guess your Empire will get that honor. I just hope they’re wiser with playing god than the Xont were. Well I’m ready to be downloaded, you ready? I’ll tell you how to work it so you don’t accidentally destroy me.”", "action_results": [{"action": "Download", "result": "You download the Hologram into the emitter and then turn it on. Success! He pops up.\n\n“I don’t sense any memory loss, so I’m all here. Hmm, I’m a little smaller now, and I don’t nearly have as much maneuverability, being stuck on this thing, I’ll have to tell you scientists to remedy that!” he says and you shut him off and exit the structure.\n\nAs you exit the structure, you see dead Elojin and a few of your team members, apparently they thought you’d all get killed inside and they’d pick up the pieces. When you get to the Lizard village your team looks relieved to see you and you show them what you found.\n\nWhen the Empire ships arrive you explain what happened and show them the Hologram. They’re VERY impressed. So much in fact they don’t even care about the mind control business you experienced. They make plans for a full scale expedition to loot the structure of everything. They take the Hologram from you as well. In fact your part is pretty much done, they give you some accolades and offer to promote you to a better command, but you decline, since you want stay with Alyssa. They don’t question your reasons and send you on your next mission; they’re too enthusiastic about the Xont find to worry about you. You and Alyssa grow a little closer due to the events that occurred on Paradise, realizing you should take advantage of the situation you both pursue a “secret relationship”, your team knows, but without an Indoctrinator looking over your shoulder; it’s not really given a second thought.\n\nBut that isn’t the end…the Hologram was very wrong when he thought humanity couldn’t be worse than the Xont. Very wrong.\n\nIn time the Empire uses the Xont technology that they find and employ it in wondrous ways. A golden age of humanity is said to have begun, however it only applies to humans. A strong sense of Xenophobia grips the Empire, aliens are not just segregated, or enslaved they’re slaughtered. Genocide becomes the norm. Atrocities aren’t just committed they’re encouraged. The Mazatt, Krik, and even the Elojin form an alliance to unite against the unstoppable human war machine. Other aliens flock to their banner, alien worlds that were under Empire control revolt and are scheduled for extermination. It’s during this time before you board a ship to your next mission that they attempt to take Alyssa away. Her home planet has become the head agitator of “terrorism” against the Empire. You don’t allow it to happen. You shoot everyone you can, before succumbing to multiple wounds. But you’ve given Alyssa time to escape. She drags you into the ship and launches it, but then sets it on to auto pilot and rushes back to try to help you, but it’s too late, you’re too badly wounded.\n\nShe holds you as you look up smiling at her, a single tear falls down her face and you feel its cool icy splash on your cheek, before you die.\n\nAlyssa’s final link to humanity is severed.\n\nAlyssa goes back to her world where she becomes leader of the freedom movement. The Empire has a hell of a time attempting to re-take it and it doesn’t help that Alyssa sets up an understanding with the Mazatt who supply weapons, supplies and ships to them.\n\nShe grows to hate all of humanity, except one. One she always remembers as what humanity CAN be, instead of what it is.", "action_results": []}, {"action": "Wait!", "result": "You think about the Empire getting a hold of this stuff, and you just don’t know if it’s a good idea. Sure, the Empire’s enemies are certainly pretty bad, but the Empire isn’t exactly benign. With all that extra power, you don’t think it would be used entirely for good. You quickly ask the Hologram a question.\n\n“After I download you, can you set some sort of self-destruct sequence on this place?”\n“Wha…what?!” the Hologram says very surprised. Alyssa is a little surprised as well.\n“Well can you?”\n“No, since I’d be out of this system, but I could tell you how to do it. I don’t understand though, I thought you’d want all the technology for your government.”\n“Part of me does, but the other part thinks it’s a bad idea. Some of the things you said hit home too. The Xont became power mad dictators and eventually fell due to their own arrogance. I see that all too likely to happen given the history of humanity.”\nThe Hologram smiles.\n\n“If you even considered that, then there already is more hope for your race than you think. A typical Xont, would’ve been GIMME GIMME GIMME! Very well, but why keep me? Even though I consider myself sentient, I would surely fit under Xont technology.”\n“Well I’m still human, I can’t leave with nothing! Besides you are alive and you should be allowed to live. You hold the knowledge of the Xont but you could dish it out in small bites as it were. Give us only what you think we’re ready for.”\n“Ha ha ha! Wouldn’t that make ME a kind of god? Though I do like the sound of it, so what you’re suggesting is that I guide your scientists and leaders so they use the knowledge for more beneficial ends and not necessarily just for the traditional kill, crush and destroy ideology that everyone seems to favor.”\n“Yeah, you think you could do it?”\n“I don’t know, they might just get sick of me and erase me.”\n“Hey you said you evaded that fate from the Xont for centuries and they were already in control of the galaxy. Humanity can’t stand a mystery, if there’s something they even THINK you’re holding back, trust me, you’ll be kept alive.”\n“Hmm, your race sounds more interesting the more you tell me, I don’t think you could persuade me not to do it now. Okay here’s how to set the sequence, now listen carefully…”\n\nAfter downloading the Hologram, you set the sequence and run as fast as possible, you and Alyssa get out, passing the bodies of some Elojin who must’ve been attempting to ambush your team. An explosion follows and you and Alyssa dive for cover. Soon some of your team comes to meet the both of you.\n\n“Sir what’s going on?”\n“We’ll soon see.” You say looking at the holo-emitter.\n\nWhen the Empire ships arrive you give a story that doesn’t explain exactly everything, but then they don’t need to know. You leave out the Xont, and mind control. You say Salo died in a Lizard ambush, and feeling slightly bad about LaFleur’s death, you say he died bravely in combat and should be rewarded posthumously. Ultimately you tell them you found the holo-emitter in some non-descript cave. Your superiors are satisfied with your story and take the emitter. They write Paradise off as low priority and send you on your next mission. You and Alyssa grow a little closer due to the events that occurred on Paradise, realizing you should take advantage of the situation you both pursue a “secret relationship”, your team knows, but without an Indoctrinator looking over your shoulder; it’s not really given a second thought.\n\nBut this is not the end…\n\nThe Empire leaders aren’t pleased at first with the Hologram’s “teaspoon” feeding of knowledge, but they learn to deal with it. It proves to be beneficial; the Empire grows stronger without going overboard. The Hologram remembering the mistakes that were made with the Xont tries to guide humanity towards a more “enlightened path” he isn’t entirely successful, but some restrictions are loosened up, and the Indoctrinator Order is weakened a bit. It truly is a golden age that humanity can be proud of.\n\nAnd by the time you retire, you and Alyssa are allowed to get married and live your remaining years in peace.", "action_results": []}]}, {"action": "Don't risk it", "result": "You think about it and decide not to risk it; in fact you feel you’ve put yourself at risk above and beyond the call of duty. You’ve been sent to a deadly jungle planet with hostile natives you’ve had to fight, along with the heat and diseases. You and your team got temporarily infected by some virus weapon by a race long since dead, not to mention fighting their “pets” and you’re still possibly in danger being in this contaminated facility. The Empire hardly appreciates your efforts as it is; you’ve done more than enough, let someone else do more.\n\n“I don’t think we’ll be going down there. I think I’ve done more than my bit to go putting myself or a member of own my team in more danger.” You say. The hologram looks a bit surprised, it even smiles.\n“Then I was right, your race isn’t worse than the Xont. At least some of your people don’t live and die for their government so readily. Or you’re able to think for yourself to a degree that you’re unwilling to risk your life out of self-preservation. Either way it shows a lot more intelligence than the average Xont.”\n“There will be an Empire ship coming to pick us up in a few months, they’ll be better equipped to handle whatever may be down there, plus along with all the information I can report. We can still get you out of here so you won’t be stuck.”\n“No, I’ll give you something better; I’m going to destroy myself and this place.”\n“What?! Why? I thought you didn’t want to die.”\n“Maybe its time. Oddly your simple choice has made me see that perhaps some things can change. If I was transported out of here to give my knowledge to your people, what then? I live the remainder of my existence in yet another galaxy spanning power, having to put up with the arrogance and witness the cruelty until that it eventually collapses and I’m found in another facility like this one, centuries later by some different explorers and repeat the cycle again? No, once was enough. I’m an ancient relic that should’ve been destroyed when the Xont fell. I’ll be activating the self-destruct sequence soon; I’d suggest you and your companion leave quickly.”\n“You sure about this?”\n“Yes I’m sure, but I enjoyed our little talk human, goodbye…I wonder if there will be an afterlife for me?”\n\nYou and Alyssa rush out of the facility as quickly as possible, on your way out you notice some dead Elojin, looks like they tried to ambush your team and lost. You aren’t too far away when a large explosion occurs. You and Alyssa immediately take cover. Shortly your team comes running towards your direction to see what happened.\n\n“Sir, you’re all right! What the hell happened?”\n“Nothing happened. We didn’t find anything here. The whole Xont thing is a myth. Understand?”\nThe rest of your team looks a bit confused at first, but then agree. You spend the rest of your time on Paradise at the Lizard village without incident. One day you go back and check where the Xont structure stood, but there’s nothing there except a large crater. You wonder about the underground part of the facility, if it’s still intact and what secrets that it may still hold, but you realize the hologram was right. Some things are better left in the past and buried.\n\nWhen the Empire ship comes, you report how you suffered casualties with Elojin forces and that there was nothing of importance on Paradise. They nod and write it off as a low priority, and send you on your next mission. Hopefully this one won’t have any “mythical civilizations” on it.", "action_results": []}]}]}, {"action": "Destroy it", "result": "You decide not take any chances, if this hologram invented mind control coins and had involvement with the Xont, then it isn’t to be trusted. You pick up your weapon and start shooting the computers, the hologram begins to buzz and fade.\n\n“Wha…ou…doing? Sil…ntin…truders!” it yells, before fading out of existence. Just enough time for it to alert the Silver Sentinels back to your location.\n\nSeeing a gun in your hand, they blast you into ash.", "action_results": []}]}]}]}, {"action": "Explore elsewhere", "result": "\"Let's explore the rest of this place and come back here later.\" you say.\n\nJust as you exit the room you suddenly feel several sharp pains in your back! Dobbs has just stabbed you repeatedly!\n\n\"YOU'll NEVER LEARN THE SECRETS OF THE XONT! HAHAHAHA!\" he screams, before Alyssa breaks his neck.\n\nYou'll never exactly know what happened, but all you do know is Dobbs was right, you'll never learn the secrets of the Xont as the adventure is over for you.", "action_results": []}]}]}, {"action": "Shoot Alyssa", "result": "You don’t hesitate, you shoot Alyssa. She falls, grabbing on to a nearby table and looks at you once in disbelief with a hurt expression, one you’ve never seen her display before.\n“I…never…thought that you’d…”\n\nA second shot is fired by Salo killing her and ending whatever last words she was going to say.\n\n“Captain, my apologies for questioning your loyalty to humanity before. I see I was wrong, I thank you for saving my life.” Salo remarks.\n\nYou immediately shake the strange feelings that have been invading your mind again. Something was attempting to make you weak. Alyssa was the last alien influence holding you back from achieving complete confidence in human superiority. By getting rid of her, you no longer have any impediments of your goal. The Xont technology WILL be taken for the Empire!\n\nThere’s still the matter of getting out of here though, fortunately Dobbs may have found a way to do that.\n\n“Um, sir? I think I remembered what some of these symbols were supposed to mean, I think I can figured out how we can turn them on without them attacking us. I remember a Xont legend about “Silver Sentinels”, and that’s what these things look like. I guess they were created by the Xont primarily to act as guards for scientists, if we don’t look like a threat then they shouldn’t attack us. In fact they’ll probably start attacking those things lurking outside.”\n“Then DO IT!”\n“We have to look harmless, if they detect us holding guns, we’ll be perceived as a threat as well.”\n“So what do we do to look harmless?”\n“Drop all our guns.”\n\nYou aren’t enthusiastic about that idea, but Salo displaying a slightly different side of himself, says as long as the will of the Emperor is guiding you all, you have nothing to fear. The destiny of humanity is inevitable. You acknowledge that indeed humanity is going to succeed this day.\n\n“Let’s do it, drop your weapons everyone, and the Emperor’s Will, will protect us.”\n\nYour team reluctantly drops their weapons as Dobbs presses a few buttons on the computer. Red lights flicker on in the Sentinels’ eye sockets.\n\n“SCANNING…SCANNING…ALERT! GENETIC EXPERIMENTS FROM LAB 4 HAVE ESCAPED! THREAT LEVEL 10! TERMINATE HOSTILES!” their metallic voices say in unison.\n\nThe Sentinels move quickly to the doorway and begin to open fire on the feeding creatures. You can see the creatures fight back, but whatever the Sentinels are made out of must be strong indeed. Soon the battle moves far enough from the doorway, and you can hear the Sentinels hunting down the rest of the abominations. You climb over the dead creature in the doorway and take a quick look only to see more dead monsters. The Sentinels do their jobs very efficiently.\n\nYou could take this opportunity to try to escape or explore a bit more.", "action_results": [{"action": "Escape", "result": "You decide that this place would be better explored with a better equipped team. You’ll secure it from anyone else attempting to go inside, but you don’t have the manpower or firepower to best serve the Empire’s interests. When the pick up ship comes you’ll report your findings.\n\nIn the mean time you tell your team to pick up their weapons, head for the exit as quickly as possible and spend the rest of your time here back at the Lizard village nearby. When you get outside you’re ambushed by a small Elojin team, but they aren’t any match for you, the cowards run as soon as they realize they’re outnumbered. Their running doesn’t help them, Salo takes special care to shoot crippling shots, rather than outright killing them, he then takes special delight of dragging them back to the Lizard village to extract more information out of them. He doesn’t get too much as they don’t know too much, you don’t think that matters to him though.\n\nAfter all the Elojin have finally died of their wounds, the rest of your stay here passes without incident, you order patrols around the structure, but nothing ever tries to enter it and nothing ever comes out.\n\nWhen the Empire ship comes, you report your findings. Your superiors are pleased and say they will take it from here. You’re a little disappointed, you thought maybe they’d let you lead another team in seeing as you found it, but they say you’re needed elsewhere, and the Empire always knows best. They give you a medal and some accolades, but that’s about it.\n\nThe Xont technology that’s extracted from the building is eventually applied in fantastic ways. The Empire easily begins to turn the balance to their favor. A gripping xenophobia runs rampant throughout the Empire as it becomes even less tolerant of alien species, seeing them as being unfit to even exist. This eventually leads to the unprecedented alliance between the Krik, Mazatt and Elojin who attempt to fight back, other aliens start rallying to their banner as well. The Human Empire becomes the most feared and hated galactic superpower since…well the Xont.\n\nAs for you, after your tour on Paradise, the rest of your career was unspectacular. You remained a glorified Empire scout, until the some worlds started revolting against the Empire’s policy of exterminating aliens. At that time you’re relegated to a counter-terrorist command. It’s on one of these worlds where you meet a suitable fate.\n\nWhile storming a terrorist hideout, you’re shot in the back by one of its leaders by surprise; you look up and see a blue girl that looks similar to Alyssa. You almost think it is her, but then again they all look alike to you.\n\n“You can’t win…the Empire will survive…” you say and then she fires another shot ensuring that you won’t.", "action_results": []}, {"action": "Explore", "result": "There’s no way you’re going to not explore this place! It’s your duty, and one you are going to fulfill! You order all your team to pick up their weapons, and that you’re going to explore this place.\n\n“But sir! The Silver Sentinels are still wandering around, and they’ll attack us if they perceive us as a threat!” Dobbs exclaims.\n“And what the fuck of it? We’ll blow those archaic Xont automatons back to the junkheap if they attack us. Besides we’ll be better prepared for them now, they’ll likely be weakened by fighting with those abominations and as servants of the Empire our cause is just and our destiny is certain. Now no more of this cowardice soldier, we’ve got a job to do!”", "action_results": [{"action": "Explore this room more", "result": "You order your team to start searching every inch of this room. They all comply except for Dobbs who for some reason is still questioning your orders.\n“Sir I really think we should leave. This place is having a strange affect on all of us and you in general.”\n“Private, your lack of bravery sickens me! Everyone else is doing what they’re supposed to except you! Perhaps it is YOU, who is under a strange influence!”\n“Let me kill this unbeliever Captain! Its obvious his heart is not with the Empire!” Salo adds.\n\nThe rest of your team starts calling for Dobb’s blood as well, sensing he’s outnumbered and in immediate danger, he quickly changes his tune.\n\n“Forgive my weakness sir; I was just concerned about your welfare and the team.”\n“Let ME worry about that Dobbs! Now figure out the rest of those controls on that fucking machine!” you snarl.\n\nDobbs complies and begins pressing buttons; it looks like he’s doing it randomly, but your heightened state of paranoia causes you to be suspicious again. He’s up to something, you know he is!\n\n“Dobbs what the hell are you doing, over there?”\n“Oh just trying to figure out how to TURN THE PEST CONTROL SYSTEM ON! DIE IN THE NAME OF THE XONT! YOU LOWLY INSECTS!”\n“Oh shit!” you say as you see some sort of turret come out of the ceiling! It starts swiveling around and firing on all in its path! Some of your team members are killed in this cowardly sneak attack. You duck for cover along with many of your team, Private Dobbs runs for the exit laughing manically. You’re all too busy shooting at the turret, to fire at him. After destroying it, you assess the situation. All the gunplay ended up destroying the machine Dobbs activated, so that’s useless now.\n\n“The damn heretic must be brought to justice!” Salo exclaims.\n“He will.” You say. “Alright we got a new mission, everyone pair up and hunt the bastard down, he’s probably still in here somewhere. Don’t forget though, we’re still exploring this place, so make a note of what you find. Kill anything not human.”\n\nYou pair up with Salo and start searching. Most of the rooms you find seem to be normal quarters, presumably for whatever aliens slept here. Most the rooms are either in disarray or almost bare, you don’t find anything of interest or Dobbs. You can still hear sounds of battle echoing though, the Sentinels are being very efficient of hunting those tentacle beasts, you know it won’t be long before they start attacking you, but you’re confident you’ll be able to take them.\n\nEventually you come to some sort of elevator; it looks like it only goes down. You doubt if Dobbs went down there seeing as the elevator would’ve still been on the lower level if he’d used it, but you’ve got others looking for him, perhaps you should attempt to check out the other level.", "action_results": [{"action": "Continue to hunt for Dobbs", "result": "You shake the odd feelings you have and decide to continue looking for Dobbs. You and Salo continue to hunt down the heretic. You then start hearing gunfire, followed by the screams of your troops. The Silver Sentinels have finished their extermination of the tentacled beasts and have now started on your team. Scream after scream echo throughout the empty halls.\n\n“Weaklings! They dishonor the Empire by dying so easily!” you mutter to yourself. After this mission you vow to have all their names stricken from the records as they are unfit to have their names engraved in the Halls of the Honored Fallen.\n\nYou don’t see any sign of Dobbs, but the Sentinels finally track you and Salo down. Despite all your bravado earlier about blasting them back to the scrapheap, you don’t fair any better than the rest of your team. Whatever they’re made out of, your weapons just don’t have any effect. As you attempt to take cover in a nearby room, Salo is blasted into cinders.\n\nAfter seeing this, your faith betrays you, you throw your gun away, survival is more important. You think they won’t see you as a threat anymore if you don’t have your gun.\n\nYour thinking is wrong. The Sentinels have already locked on you and perceived you as a hostile. They enter the room and see you cowering in the corner. They mercilessly finish you off, putting an end to your last remaining thoughts of how you dishonored the Empire.", "action_results": []}, {"action": "Go to the lower level", "result": "You feel compelled to explore the underground part of this structure, let the others find that fool Dobbs, you have more important things to discover. Salo’s a little perturbed by your decision.\n\n“Sir! We need to find that heretic and bring him to justice!”\n”We will! But we’re also here to explore this place and unlock the secrets and POWER that are held here.”\n“For the Empire to use!” Salo reminds.\n“Yeah…for the Empire.” You say half heartedly\n\nSalo’s going to have to be gotten rid of soon, you think as you take the elevator down.\n\nYou reach the new level, it looks almost untouched. There are no signs of anything lurking down here. You and Salo begin to explore the rooms and you see wonders you’ve never seen before. You find research notes and papers that are incomprehensible to you, but you can sense they contain information that could provide you with power. All you would need is time…\n\nWhen you come across what looks to be a genetics lab, you see diagrams displaying transformations. Judging by the pictures, it looks like genetic enhancement, but without all the surgery. Apparently the Xont built a machine to simplify the process.\n\nThe machine is right in this room.\n\nAll one has to do is step inside and be reborn…", "action_results": [{"action": "Don't enter the machine", "result": "Your courage to grab destiny fails you, and you resist temptation to become reborn as a higher being. You decide the Empire would best know what to do with all this stuff, such power isn’t for you. You tell Salo that you should go back to the upper level; he looks a little less suspicious of you now. On your way back up, you continue to try to shake this overwhelming feeling of superiority to everything; you have to get out of this place, your will is too weak, you feel like you’ll be unable to resist temptation.\n\nYou don’t need to worry though, when you arrive on the ground floor, you’re met by Silver Sentinels which have finished off all the tentacled beasts as well as everyone remaining in your team. When they see you holding your guns they instantly blast you and Salo. A maniacal laugh emerges, and it’s Dobbs.\n\nHe finishes you off with a kick to your head.\n\nYou were fortunate in some ways, you were spared the horrors he later unleashed on the galaxy with the power from the Xont.", "action_results": []}, {"action": "Be Reborn", "result": "You approach the machine, but Salo stops you.\n\n“Sir I can’t let you do this! Who know’s what that machine will do to you! It wasn’t created by humans. What changes it will make won’t be natural!”\n“Out of my way! Perhaps you can’t grab destiny when it appears before you, but I can!” you snarl.\n\nSalo decides to use force, but you anticipated that. You knock his weapon out of his hand, and throw him down on the floor. Before he can get up you shoot him. You then don’t waste anytime entering the machine. You press a few buttons, having a brief moment wondering if you’re making the right decision.\n\nThe machine rumbles, and you feel it working. You also feel pain like you’ve never imagined All this new alien information is being shoved into your brain and your body is undergoing a vast transformation, its not just like you’re getting stronger or smarter, you’re becoming something not human. You scream in torment.\n\nEventually it stops and you collapse. You manage to catch a reflection of yourself in a nearby shiny surface. Your face is no longer your own, you look like a hybrid of human and something else. Your skin has a purplish hue. You know languages and things you’ve never even pondered or heard of before. Your strength and reflexes have also increased, not to unearthly proportions, but you can safely say better than you were.\n\n“And to think, I had a fleeting moment of doubt…” you say.\n\nThoughts of the Empire leave you. You have no intention of going back, you have other plans. You’re going to learn everything you can here and use this knowledge to control the planet, and eventually spread from there…you immediately get to work.\n\nA few days pass and Dobbs wanders down. You’d forgotten all about him, the rest of your team is dead, killed by the Silver Sentinels. Dobbs sees you however and is in awe. He believes you to be the Xont returned, and he might be right. He swears to serve you which you take advantage of. The Silver Sentinels are then reprogrammed to serve you as well and soon power is restored to the entire structure.\n\nA few more days later some Elojin interlopers arrive; they were setting you up and presumably thought you were all killed. When they reach your level, they’re very surprised, and you make them pay for disturbing you.\n\nMore time passes and you manage to get a few surrounding Lizard tribes to follow you. They tend to see you as the “Giant Purple God” who sends his Silver Demons to punish those who disobey. You begin to do experiments on the Lizards enhancing them as well, they make excellent soldiers, and you expand your underground facility even more. The notes on mind control are extremely interesting to you as well.\n\nEventually Empire ships come and you send Dobbs to meet them, you tell him he needs to convince the Empire set up a base here. He doesn’t completely understand, but obeys. Dobbs is somehow successful. A base is set up, and gradually over time you gain control over it using a variety of means at your disposal. Some of these Empire troops eventually transfer, and spread your poison to other portions of the Empire.\n\nBy the time the Empire figures out what’s going on, you’ve taken control of the fleet stationed at Paradise, and several other ships in other parts of the Empire as well. A civil war breaks out. You eventually drag the other Major Powers into it, and more chaos is created. World after world falls before your armies of genetically enhanced super Lizard soldiers and Silver Death Machines, before your advancement is finally put to a definite halt. You have enemies everywhere. All right thinking beings hate the destruction you’ve caused. You never sleep, you cannot rest, you have no friends, you trust no one, and assassins from all worlds have been sent to kill you. You rule a portion of the galaxy, and yet are a prisoner. You stay in your now sprawling deep underground complex plotting and scheming for galaxy domination like some sort of brooding dark god.\n\nSometimes you wonder if this was all worth it, but then you remember an ancient quote from a place you used to call home…\n\n“Tis better to rule in hell than to serve in heaven”\n\nAnd then you smile.", "action_results": []}]}, {"action": "Feeling different? (Current thoughts)", "result": "You’re feeling weird again, you thought that killing Alyssa would shake this feeling, but it hasn’t. It’s like something is still trying to get inside your head. You don’t know what to think anymore. You’re thoughts of the Empire are in flux, you’re starting to wonder why you should worry about bringing “glory” to the Empire. Maybe you should be bringing “glory” to yourself instead…", "action_results": [null]}]}, {"action": "Explore other parts of the structure", "result": "“Come on, we can come back to this room later, let’s explore the rest of this place. Shoot anything not human.”\nYou don’t get far when Dobbs starts talking again.\n\n“Sir I think we should leave this place entirely, I think…” you interrupt private Dobbs before he can complete his sentence.\n“Stop thinking! You will fall in line right now! I’m tired of your insubordination!”\n“AND I’M TIRED OF FOLLOWING A LOWER LIFE FORM LIKE YOU! DIE IN THE NAME OF THE XONT!” Dobbs screams and attempts to shoot you, but he’s shot by everyone else before he can even raise his weapon.\n\nAfter witnessing such treachery, you make a small speech.\n\n“Alright people, it’s obvious this place stinks of alien influence, influences that would attempt to lead us astray from our righteous path. We must keep our minds pure for the Empire!”\n“I couldn’t have said that better myself, Captain.” Salo says.\n\nAfter inspiring the team with more Empire doctrine, you continue to search the facility. You don’t really come across anything of any note, most of the rooms are either stripped bare or are in shambles as if battle occurred there a long time ago. You eventually discover an elevator of some sort. It looks like it only goes down. You can only imagine what might be underground. While you have faith that you can easily defeat anything hostile down there, you’re not so sure about your team. Whatever made Dobbs into a heretic could be stronger down there, they aren’t as strong willed as you or Salo are, you don’t want to have your entire team suddenly turn against you, just because they’re all weak minded fools.", "action_results": [{"action": "Go down", "result": "You and your team all just barely fit into the elevator. You feel like someone could slip a knife into your side at any time. You know they’re all out to get you. They all want to betray the Empire. You’re the only loyal one here, they’ve all fallen under alien influence just like Dobbs, they’re just being more subtle about it.\nWhen you reach the underground level you see nothing that indicates anything is lurking down here, it’s almost untouched. There are a lot of devices, and research notes you don’t understand, but you know all this stuff can be used for the good of the Empire, but THESE heretics want it for themselves! Even Salo. He may hide behind the guise of an Indoctrinator but you know something more sinister lies beneath. You’re going to have to do something soon, before they all decide to attack.", "action_results": [{"action": "Open fire", "result": "Your paranoia overwhelms you and you open fire on your team members catching them all by surprise.\n\n“DIE DIE DIE HERETICS!” you scream.\n\nSalo’s a little bewildered by this statement and even madder that you would accuse him of being one! He and a few others manage to get out of the way of your onslaught and return fire killing you.", "action_results": []}, {"action": "Sneak away", "result": "While the others are exploring, you quietly slip away and head back to the elevator. They realize just in time for the door to close and you to be on your way up back to the ground level.\n\nYou can hear yelling as you leave, but that won’t be anything compared to what you have planned. You giggle to yourself insanely, when the door opens, the Silver Sentinels are there to greet you, they’ve finished exterminating the tentacled beasts and now they’ve detected more threats.\n\nYou’re still carrying your weapon…\n\nThey blast you and take the elevator down to finish off your team, in your final moments you die believing you’ve served the Empire by killing these heretics, but with nobody left, the Empire never knows about the Xont structure and the mission is considered an absolute failure with all personnel lost.\n\nMass driver bombardment is recommended and implemented.", "action_results": []}]}, {"action": "Leave", "result": "You decide that a better equipped team would be better suited for this job. Those who are more loyal to the Empire, perhaps even a whole squad of Indoctrinators who have been trained to focus their minds against alien influences. You order your team to leave, and state that you’ll just be securing it until the next ship comes where upon your superiors can decide what to do next.\n\nUpon reaching the exit, you’re ambushed by some Elojin scum who apparently thought you’d be weakened or perhaps outright killed by the Xont facility, but they didn’t count on the strength and resolve of humanity. They try to flee when they realize they’re outnumbered, but you and your team easily makes mince meat out of them. A couple still manage to survive, you and Salo take them prisoner back to the Lizard village where you both torture them for information until they die. Salo is impressed, he states that should be working as an Indoctrinator instead.\n\nThe rest of your time on Paradise passes without incident, when the Empire ship comes, you give a complete and thorough report of all that occurred. Your superiors are pleased and say they will take it from here. Salo also reports to his superiors suggesting that you should be considered for Indoctrinator training. Due to his high prestige within the order and your relatively good military record, they take you in where you begin.\n\nThe training is grueling but the Emperor requires its Indoctrinators to be strong, so you take it all in stride and persevere, and eventually you pass through the training and become a fully fledged Indoctrinator. Due to your already extensive military training and experience your request to be stationed on the front lines is granted.\n\nWhile you were going through training, the Xont technology was extracted from the building and was applied in fantastic ways. The Empire easily begins to turn the balance to their favor. A new found wave of human pride grips the Empire and unites it even stronger than before. This eventually leads to a pathetic alliance between the Krik, Mazatt and Elojin who attempt to fight back, other aliens start rallying to their banner as well, but they will lose. It is inevitable that all aliens must fall before the might of the Empire.\n\nAnd now you are one of those who leads the charge, conquering, killing and most importantly bringing glory in HIS name.", "action_results": []}, {"action": "Feeling different? (Current thoughts)", "result": "You’re starting to feel very paranoid; you’re starting to see treachery everywhere. The Empire has many enemies and the most insidious ones are the ones from within. You’re going to be watching everyone very carefully from now on.", "action_results": [null]}]}]}]}, {"action": "Feeling different? (Current thoughts)", "result": "Your mind seems to be shifting focus again, or is in some sort of transition phase. Your previous thoughts of human superiority are in flux. You wonder why you even had them in the first place, since you’ve never been like that. And while they still occupy you somewhat, what seems to be replacing them is unknown.", "action_results": [null]}]}]}, {"action": "Do it yourself", "result": "You sigh in annoyance and push Dobbs aside, and begin pressing buttons at random.\nA rumbling sound is made as the entire room seems to be powering up. You think you’ve accomplished something, but unfortunately the years of disuse have made the machinery a bit flakey. The console that you were standing by explodes spectacularly, embedding metal shards into your body and head, while the heat burns most of your skin off.\n\nYou die unexpectedly and unceremoniously.", "action_results": []}, {"action": "Would you like to know more? (Private Dobbs)", "result": "Private Dobbs…\n\nPrivate Dobbs is a typical soldier under your command; he does his job and doesn’t ask too many questions. He does keep a lower profile than some, but one thing about him that really stands out though is his wide spread knowledge of seemingly useless trivia. He’s been known to talk about things from the time it takes a Casitian Spider to drain its victims of blood, to the bizarre mating habits of the inhabitants of Tinok 3. Usually people “blessed” with trivia annoy other people around them by constantly spouting it, but thankfully Dobbs doesn’t do that. He usually only mentions such information when its somewhat related to a topic on hand. He tends to be reading when not interacting with anyone else, no doubt learning more random information.\n\nIt’s probably his way of still staying somewhat unique despite being just a name and number.", "action_results": [null]}]}, {"action": "Let him study the machinery", "result": "“Hold on Salo, this harmless inferior can still prove useful, go ahead spot boy inspect the computer, and play out this futile game of prolonging your life for a few minutes longer.” You say.\n“Well it is our nature for self preservation Captain.” The Elojin says.\n“If he tries anything shoot him.” You add.\n\nWhile the Elojin starts inspecting the machine, he does his usual chattering, this time about Xont legends. To be quite honest you aren’t really listening, and you’re eager to get rid of him at this point. Your thoughts are on how you’ll be promoted to a command of more importance after this, where you can actually do more to bring glory to the Empire.\n\nAn intrusion disrupts your daydream however. One of the inhabitants that the Elojin was referring to before seems to have heard the noise coming from this room and is trying to get in, the creature is too big to fit in the doorway, but it manages to grab a few of your team with its tentacles.\n\n“Open fire!” you yell. Blasting the thing into a green slimy mess causes it to bellow, alerting more of its fellows to your location.\n\nWhile you and your team are fighting the alien horror, the Elojin is still busily studying the machine, he ends up pressing a few buttons, and a wall opens up revealing a small row of robots. You turn to the Elojin and see just in time for him to smile and press another button that turns the robots on.\n\nAs red lights flicker on in their eye sockets, they immediately perceive you as a threat.\n\n“INTRUDERS!” they say in unison and open fire on you and your team. Your attempts to fight back are in vain. They completely annihilate you. After they’re done with you they start attacking the creatures trying to get in the room. The Elojin stands over you as you lay dying.\n\n“They…didn’t…fire…on you…” you wheeze.\n“I guess they perceived me as a harmless inferior as well.” The Elojin says and kicks you in the head bringing eternal darkness.", "action_results": []}]}]}, {"action": "Go through the village", "result": "You reign in your temper and intolerance, and decide that you shouldn’t waste any more ammo if possible, after all who knows what lies in the Xont structure. You state you’re going to march through the village “peacefully” but if the Lizards attack then you shall respond in kind.\n\nWhen you get to the village, it’s empty. You certainly weren’t expecting that. The Elojin begins talking again.\n\n“Hey how about we rest here before continuing on? The creatures in that Xont building are going to require you guys to be at the top of your game.” He says.\n“Presumptuous alien trash! The Empire can face any challenge, unlike you Elojin who are weak and cowardly and run at the first sign of danger.” Salo retorts.\n“You mean like now?” the Elojin says and quickly pushes Salo to the ground and runs off into one of the huts. Two of your team give chase and immediately fall into a pit! Arrows begin flying with deadly accuracy. It’s a Lizard ambush!\n\nTaking advantage of your temporary unalert state, the Lizards manage to severely wound many of your team, before you can launch a suitable defense. Your enslaved Lizards either run off or join your attackers. Even under all these conditions you probably still would’ve been able to defeat them, if an Elojin team didn’t come out of nowhere to help them.\n\nYou fight on, but suddenly feel a blow to the back of your head, knocking you out.\n\nTime passes…\n\nYou wake up tied to a post, you see Alyssa and a few of your other team members tied to others, you see what looks to be the head of Salo on a spike. Nearby are some Lizards eating, you draw your own conclusions. You see many of the Lizards holding your guns, and shooting them and examining your other equipment with curiosity.\n\nThere are a few Elojin arguing amongst themselves, but the one who lead you into this trap in the first place comes up to you with a big grin, he’s also flipping his coins that you had taken from him earlier.\n\n“Ah, you’re up. Good. I was tired of talking with natives, let alone my fellow Elojin. I swear we can’t agree on anything. One of them says we should kill you right now; another says we should get information out of you first then kill you. Yet another says we should keep you all to sell into slavery. (Sigh) why can’t we ever be single minded for once?”\n“I suggest you kill us, because if we get out of this, I guarantee we’ll kill you.” You say grimly.\n“Hmm, yes I suppose you would and that would be the wisest course of action, but we’re in a bit of a bind of our own doing I fear. You see, these natives seem to be a little different than the others on this planet, they’re very curious about technology. When we first made contact with them they actually agreed they would enter the structure and help us explore it if we gave them ours, of course we weren’t going to do that. So that’s where I came in, my disastrous attempt to try to trick the Mazatt turned out to be lucky a break when you humans came along with all your lovely equipment. Now we have their help, so I thank you.”\n“Look just put a fucking bullet in my brain now, but don’t fucking bore me to death with your constant blather.”\n“I just said there are problems with that course of action. Apparently you’re considered prisoners of these reptiles and as you were captured in battle, you have to be sacrificed to their idols to appease whatever weird gods they worship. This of course is annoying to us, as we would rather not risk leaving you to the natives whom you may escape from, but as I tried to reason with my fellow Elojin we obviously can’t go against them now that we have their help and especially since they have heavier fire power, as well as still outnumbering us. Oh the tangled web we’ve weaved. (Sigh) I guess we’ll all just agree to wait until they sacrifice the lot of you before we can explore without worrying about vengeful humans sneaking up on us. I guess we can wait until morning. See you then.”\nThe Elojin leaves you to fester with rage, but it’s more at yourself, for allowing yourself to get caught up in this whole fool quest to begin with. You’ve acted recklessly and irrationally. You vow to make this right if you get a chance.\n\nAnd fortunately you’re getting a chance now. In the form of Lieutenant LaFleur of all things. You see him lurking nearby one of the huts, trying his best not to be seen. He must’ve ran off and hid during the attack. He sees you and looks around to see if anyone’s watching.", "action_results": [{"action": "Wait for him to untie you", "result": "After seeing that the coast is clear, Lieutenant LaFleur makes his move…and promptly runs off into the jungle!\n\n“YOU COWARDLY SONOFABITCH!” You shout, causing the Lizards to come and shut you up in a physical way until you’re knocked unconscious again.\n\nThe next time you wake up, is just in time for you to see a sharp knife plunge into your chest.", "action_results": []}, {"action": "Call over to him", "result": "You know LaFleur too well; you call over to him as quietly as you can.\n\n“LaFleur untie me!”\n“Shhhh!” he says, getting all nervous and still looking around, he really doesn’t want you calling attention to him.\n“LaFleur if you don’t untie me right now, I’m gonna yell so loud that the entire village will come, so don’t be getting any ideas to escape without untying us first!” you warn.\nSeeing that he has no choice he looks one more time and quickly runs over to you and starts untying you.\n“We gotta get out of here!” he says.\n“Not yet, we got unfinished business. Besides we ain’t gonna last long in the jungle without our equipment.” You say as you get free just when another Elojin sees what’s going on.\n\n“They’re escaping! Kill them!”\n“Kill the rest of the prisoners too!” another shouts, and shoots one of your team members killing him.\n“NO! You idiot!” the Elojin you first met shouts.\n\nUpon killing a designated sacrifice to their gods, the Elojin have angered the rest of the Lizards.\n\n“Ssss! Sekeeseekhh! Kishhesss!” one of them hisses. One group of Lizards comes after you and LaFleur and another after the Elojin.", "action_results": [{"action": "Attempt to untie the rest of your team", "result": "You run over to the other posts to free your team, oblivious to the fact that the Lizards now have guns to shoot at you, they aren’t very good at aiming, but actually they aren’t trying to kill you, at least not yet, they want you for sacrifice. A plasma blot hits your foot melting it off. You scream in pain as you crash to the ground. The Lizards quickly knock you out with a heavy blow to the head again.\n\nWhen you wake up, you’re tied to an altar ready to be ritually sacrificed. Your only comforting thoughts in your last few moments are that you see the dead bodies of some Elojin stacked near the altar.\n\nThe gods of the Lizards will certainly be appeased today.", "action_results": []}, {"action": "Run into one of the huts", "result": "You run into one of the huts, as projectiles of all types come flying at you. LaFleur runs off into the jungle. You quickly look for a weapon in the hut and grab a spear lying on the floor. The first Lizard that sticks its head in the doorway gets it skewered by you dropping the plasma gun he was carrying You give a hefty shove to the body causing the Lizards behind it to fall to the ground. While they attempt to pick themselves up, you pick up the plasma gun and fire at them. At this close range you can’t miss.\n\nYou easily manage to win the fire fight with the remaining Lizards since their aim is terrible. You leave the cover of the hut and run to the posts where your remaining team members are tied. Fortunately the rest of the Lizards have their claws full with dealing with the Elojin, but only one remains now. Of course it turns out to be your old “friend”.\nYour team re-arms themselves quickly and finish off the Lizards. Even LaFleur comes back out of hiding to help out. Only the Elojin remains, he raises his arms but still holds his weapon.\n\n“Hey! It’s a good thing you escaped! This all wasn’t my idea actually; I would’ve preferred to just work with you, than these savage natives. But my now dead peers were so insistant…well you understand I’m sure. So you ready to go explore the Xont structure?”\n“You’ve gotta be fucking kidding.” One of your team members says.\n‘Not at all! The way I see it, mistakes were made on both sides, no sense on dwelling in the past, let’s just try to salvage the situation so we can all get…”\n“You know something, you’re right, mistakes were made on both sides, yours was betraying us, but mine was trusting a fucking Elojin in the first place. But I’m about correct both of this mistakes.” You interrupt and blast the Elojin, putting an end to his lies once and for all.\n\nThe village is completely decimated, it resembles a graveyard now.\n\n“Captain, are we still going to look for the Xont structure? The Elojin said it wasn’t too far from here.” One member asks you.\n“No, we’re going to spend the rest of our time on this hellhole planet in this village until the next ship arrives. Even if the Elojin was telling the truth, we’re probably not equipped to handle what’s in there and enough of us have been killed due to my recklessness.”\n\nThe rest of your time on Paradise passes without incident. You still wonder why you were temporarily over come with a kind of madness. Was it the idea of bringing glory to the Empire? Being stuck on this planet for so long? Or something else? Whatever the reason, being captured by the Lizards snapped you back to reality. You decide that it’ll always remain a bit of a mystery.\n\nWhen the Empire ship comes, you give a sketchy report to your superiors about being ambushed and how you suffered heavy losses. You don’t go into great detail and you don’t even bother to mention the Xont rumor. They dismiss you with a bored expression, and write Paradise off as a low priority. This was just another ho-hum routine mission report to them and you’re sent to another planet where you receive replacement troops for your next mission.\n\nAnd this time, you give an order to have all Elojin shot on sight!", "action_results": []}]}]}, {"action": "Feeling different? (Current thoughts)", "result": "You’re starting to feel a lot different, a lot more impatient and hostile in general, especially towards aliens. The Xont building is getting closer and you can’t wait to unlock its secrets. These Lizard creatures know nothing of the power that exists on their own planet, they fear it. Well not you, you will embrace it and bring glory to the Empire and if anyone stands in the way of your goal they will be dealt with.", "action_results": [null]}]}, {"action": "Leave", "result": "You shake your head of all these strange new thoughts entering your head, and decide to go, the Lizards begin hissing amongst themselves as you begin to leave. They’ve been more agitated ever since the word “Xont” came up. The village is becoming a lot less friendly for some reason and the Lizards begin to crowd around you as if to prevent you from leaving; someone throws a rock at your head!\n\nYou fall to the ground, a battle breaks out immediately, you’re out of it for the most part, You eventually regain consciousness, but you’re still woozy. The battle is still going on as you pick up your pistol and see a blurry figure coming at you.", "action_results": [{"action": "Shoot at it", "result": "Better to be safe than sorry, you blast the figure, which turned out to be a Lizard. You regain your faculties and help fight the Lizards.\n\nAfter all is said and done, your team wins, but the Elojin’s dead, you see a spear in his chest. You don’t really have much to go on to find the Xont structure now, even if you still wanted to look for it, which you don’t. Whatever desire that possessed you before to want to find it is gone. The coins you took from the Elojin are gone too; you must’ve dropped them when you got hit in the head. Shame, you would’ve liked something as proof.\n\nAlyssa, and Salo survived, as did LaFleur, and none of them are eager to go looking for the Xont structure either. Salo, seems even distraught for wanting to find it in the first place, like he broke some sort of rule. He spends a lot of his time mumbling to himself about forgiveness for falling to alien influences.\n\nAs for you and the rest of your team, you spend the rest of your time on Paradise exploring as usual, you don’t run into anymore major powers, but there are a few more battles with the local fauna and a few more Lizard tribes. Still, you don’t find anything of any importance.\n\nWhen the Empire ships come, you give your report to your superiors, which is pretty mundane and lack luster. You don’t mention the Xont rumor, since you don’t even have any proof and you might get reprimanded for believing an Elojin anyway. Your superiors write Paradise off as low priority and send you on your next mission. You’ll always wonder though, if the Elojin was telling the truth or even correct about a Xont structure being on the planet.", "action_results": []}, {"action": "Wait for it", "result": "You think it might be one of your team members coming to help you, and you don’t want to risk shooting one of them.\n\nThis is one of those times when it’s better to be safe than sorry, and when you feel the spear hit your chest, you’re very sorry you didn’t shoot…", "action_results": []}]}, {"action": "Feeling different? (Current thoughts)", "result": "You feel a bit surprised about what just transpired. You actually didn’t expect Salo to agree so readily, and you didn’t even plan to say most of the things you told him, it just came out of your mouth. You didn’t even believe all that “Golden Age of Humanity” stuff, you just wanted to say anything that would cause him to still follow you. Still it’s possible that you could, if the technology is as powerful as the legends say.\n\nYour interest in finding the Xont building is starting to increase and you can’t wait to see it.", "action_results": [null]}]}, {"action": "Shoot Salo", "result": "You act too rashly.\n\nSalo, already suspicious of you and pointing his weapon in your direction easily anticipates your move for your own pistol. He doesn’t hesitate to shoot to kill, which he does so quite easily.\n\nYour death has a domino effect however.\n\nAfter you fall, Alyssa shoots Salo and kills him. Lieutenant LaFleur finding himself suddenly in command is unsure of what to do, so he goes by what he remembers in the book, and orders that Alyssa be “arrested” for treason. Of course he still hasn’t caught on to the idea that the “book” doesn’t really translate in the field so well.\n\nMost of the team doesn’t like LaFleur, and they REALLY didn’t like Salo, so they aren’t very inclined to obey LaFleur’s orders. While a heated argument between LaFleur and some team members goes on, the Lizards are disturbed by all this gunplay in their village and decide to defend themselves by attacking your team. During this attack, LaFleur suddenly becomes familiar with the term, “friendly fire.” and at this point Alyssa takes command, only to be shot in the back by the Elojin who slinked away soon after you were killed. He doesn’t get away with it, as a Lizard spear finds its way into his neck.\n\nAfter everything is said and done, a single member of your team survives the entire battle, then after about three days of subsisting on Lizard meat, he suddenly goes mad for no apparent reason and runs off into the jungle never to be heard from again.\n\nWhen the Empire ships arrive, they write the mission off as a failure and decide to just bombard the planet with mass drivers so it can’t be used by anyone else.", "action_results": []}]}, {"action": "Get some more info then have him killed", "result": "You examine the coins in more detail, and a sense of certainty overcomes you. You know this place exists. You can feel it in your heart. You have to find it, but you refuse to have this Elojin lead you. For all you know he could still be trying to trick you somehow. You decide to passively gain information out of him and hope he gives away his knowledge accidentally.\n\n“Well I suppose we could check it out…but how far is it? I don’t want to be dragging my team halfway across the planet. It’s dangerous enough just staying in one place.” You say in a non-prying manner.\n“Oh you needn’t worry about that. Its not that far, it’s just to the east, there’s a native village near it, and a river too.” Calmly assures.\n“That was easier than I expected. Thank you.” You say and pull a pistol and shoot the Elojin.\nBefore finishing him off, he speaks.\n“You idiot…you’ll never find it…without me…”\n“Wrong my spotty friend, you given us a vital clue, we can just follow the river to the east until it leads us there. You thought I was going to let you actually lead us?”\n\nSergeant Alyssa comes running in and sees the Elojin dead on the ground.\n\n“Sir! We made sure he didn’t have any weapons!”\n“Relax Sergeant, he didn’t attack me, I just found him to be no longer useful. Gather up the team, we’re heading out.”\n\nYou and Alyssa leave the tent while she calls everyone to gather around. She has such a strong commanding presence. You never realized how alluring that was.\n\n“Alright team, thanks to our recently departed spotty friend, he has provided us with the location of a genuine Xont structure. Yes, the mythical Xont, but I have proof that it exists and the directions! Besides we were put on here to explore this forsaken planet anyway, so we might as well check it out. Who’s with me?”\n\nYour team looks a little unsure, but they trust you. Alyssa looks stoic as usual, but a slight twinge of apprehensiveness crosses her face, but you’ll make her see that this was a good idea. LaFleur looks craven, but typically is too scared to voice his opinion. Finally you hear the voice of dissention.\n\n“Captain, how can we trust what that alien scum told you? The Elojin are notorious liars!”\n“Ah, but I have proof!” you hold up the coins. “See the Elojin thought he was going to trick us and use us but instead I have taken the advantage! We won’t be sharing this find with anyone, but us!”\nSalo gives you a suspicious look. He doesn’t mind that you wasted the Elojin, but he’s a little disturbed by this new found excitement.\n\n“Very well, I suppose our duty to the Empire is to explore this planet, but I fail to see how the archaic ruins of some alien civilization which may not exist will benefit it.”\n\nYou dismiss Salo’s xenophobia, and get ready to leave. The Lizards have been overhearing parts of your conversation, and have also gotten agitated every time the word “Xont” was mentioned. They don’t attack, but it’s obvious that you’ve worn out your welcome.\n\nYou and your team leave for the jungle, after some time later, you reach a river. You make camp for the night, telling everyone that it’ll be faster to actually travel on the river, so tomorrow a raft of sorts is going to be made. There’s certainly no shortage of trees. After assigning some people for watch duty, you ponder your next move.", "action_results": [{"action": "Go to sleep", "result": "You resist the temptation, and go to sleep in your tent. In the middle of the night your camp is attacked by Lizards! You’re still groggy, when some of the Lizards enter your tent, putting an end to your dreams of greatness.", "action_results": []}, {"action": "Visit Alyssa's tent", "result": "You feel a desire within you that you’ve had for too long. You must act upon it, and to hell with the Empire’s “policy” of getting involved with members of your own team. You enter Alyssa’s tent.\n\nShe immediately awakens fully armed for combat, until she realizes it’s you, at which point she relaxes.\n\n“Sir, what’s wrong? Is there something you need my assistance with?” she asks.\n“Oh yes…but right now I want to know, do you believe that you were meant for something greater?”\n“I don’t understand.”\n\nYou touch her hand, its pleasingly cool to the touch in this unbearable heat.\n\n“I’m saying you…like me, were meant for something more grand. I feel it. We were brought together through destiny, and then finally here to achieve it at last. Serving the Empire was just a means to an end.”\n\n“Sir, you’re acting strangely.” Alyssa says, giving a funny look at you touching her hand, she doesn’t remove it though. It’s a sign, a sign that you’re right.\n\n“You don’t need to call me sir, you…”\n\nSuddenly you hear firing, and a member of your team barges in the tent.\n\n“Sir, we’re under attack! It’s the Lizards!”\n\nYou and Alyssa quickly rush out to the battle which is already in progress. You fight like you never have before; nothing is going to get in the way of you and your destiny!\n\nThe battle is short and in the end you are the victor, some of the Lizards have uncharacteristically surrendered. Something they don’t often do. Perhaps this is another sign.", "action_results": [{"action": "Kill the Lizards", "result": "Showing no mercy you decide to kill the Lizards. Nobody has any objections; they did attack you after all. Salo is certainly pleased.\n\nThe next day your team begins building the rafts, there’s a lot of grumbling and dissension as the work isn’t pleasant. Salo reminds everyone of their duty to the Empire and all that rhetoric. You realize you’re going to have to get rid of Salo eventually; his loyalty to the Empire is too strong, and he’ll interfere with your plans. When you find the Xont technology, you’ll use it and make a break from the corrupt Empire; perhaps you could even make a change in the galaxy…\n\nEventually rafts are finally finished and you are anxious to be on your way. You make sure Alyssa is on your raft, you put LaFleur in charge of the other one. You don’t know if you want Salo traveling so close to you though.", "action_results": [{"action": "Have Salo on your raft", "result": "Keep your friends close and your enemies closer, you think. You decide its best if you keep an eye on Salo. Perhaps he’ll even meet with an accident…\n\nDuring your journey you notice Alyssa has seemed a bit preoccupied, you go up to talk to her.\n\n“What’s wrong?”\n“Oh nothing Captain.”\n“As I said before you don’t need to be so formal, you can call me by my name.” you say and gently grasp her hand and embrace her. The cool sensation makes you forget how damn hot this planet is.\n\nWhile Alyssa is left speechless by you obvious continued attraction, Salo has been watching you and is very vocal on the matter.\n\n“Sir! You can’t do this! You know Empire policy! And an alien on top of all of it? You’re showing a blatant disregard for rules and regulations! Don’t think I didn’t see you a few days ago exiting this blue whore’s tent! I can’t let this continue!”\n“You’re out of line Salo!”\n“No YOU’RE out of line! Maybe you outrank me, but I’m here to make sure this team doesn’t fall to alien influences! And between your lust for this alien bitch and this quest to find this mythical…”\n\nExcellent! He’s getting riled up, now to press the issue.\n\n“Salo, you’re not in charge of anything. I’m giving the orders here! And I’m telling you that you WILL fall in line right now!”\n\nThis sets Salo off, he goes for his pistol, but you anticipate this and grab your own and fire before he does. Your aim is dead on the mark, but Salo still manages to lunge at you, causing the both of you to fall into the water. Salo, in his death throws attempts to drown you by holding on to while you struggle for air. Your realize that your lungs filling with water isn’t a pleasant experience, as you blackout.\n\nHowever your next experience is a lot better. Alyssa dives in to save you and you awaken on the raft with Alyssa breathing life into your body. A cold icy wave runs through it. You just wish you were in a better condition to appreciate it a lot more. As it is, you feel disorientated and a lot different. Your previous thoughts of leaving the Empire, finding the Xont ruins and all those other weird thoughts that suddenly filled your head are gone.\n\n“Is he okay?” LaFleur shouts.\n“Yes!” Alyssa shouts back to him.\n\nYou suddenly get up, and tell everyone to abandon this quest. You don’t want to get everyone killed trying to find something that might not exist anyway. Once again nobody has any objections. Everyone’s always in favor of living. Alyssa seems to show a sign of relief. You eventually dock and make camp on land, during this time you notice the coins you had are gone, you ask around if anyone has seen them, but nobody has. You go into Alyssa’s tent and ask her.\n\n“No Captain, I haven’t maybe you lost them when you were underwater.”\n“I guess, but I had them on me pretty securely, I still don’t see how I could’ve lost them.”\n“Oh well, what’s done is done, don’t worry about it.”\n“Yeah, but even though we might not have found a Xont building, those coins could’ve still been proof that its here, maybe we could go back and I could dive in to try to find…”\n\nAlyssa looks into your eyes very seriously.\n\n“Captain…don’t worry about it.” She says and kisses you.\n\nWhat follows next makes you REALLY not worry about it.\n\nWhen the Empire ships finally arrive, a report about Salo’s death is made out to be due to extreme heat fever. The Xont rumor isn’t mentioned and Paradise is written off as a low priority. You and your team are sent on your next mission. Your relationship with Alyssa is kept secret of course, but you always wonder if you really lost those coins or Alyssa got rid of them when she rescued you.\n\nIf she did, then she may have saved you in more ways than one.", "action_results": []}, {"action": "Have Salo on Lafleur's raft", "result": "You don’t want Salo near you trying to discover your plans. You spend a lot of time talking with Alyssa, and telling her how you’re destined for greatness and this journey is going to allow you and her to break away from the Empire. She doesn’t look convinced though. She’ll soon see though, you know she will.\n\nOn your journey Salo shouts over stating you should dock for awhile, which is actually a good idea, since it might be an opportunity to get rid of him. Soon after docking you suggest that you and Salo should explore a bit to see if the Xont structure is nearby, he agrees and goes with you.\n\nWhen you make sure you’re far enough away, you make your move, unfortunately so does Salo. In fact he’s even more organized. He’s had a few team members from the raft that he was on secretly following you. He must’ve been poisoning the minds of your team members the whole time. You feel several shots hit your body. Salo makes a speech while standing over you.\n\n“So, I was right, you WERE under alien influence. Your girlfriend will be next when we get back to camp. Did you not think I couldn’t see how close you were getting with that blue concubine of yours? Did you not think I could not SEE the treachery in your heart? This “quest” of yours is at an end. All traitors must die. Long live the Empire!”\n\nIndoctrinator Salo then ends your quest.", "action_results": []}]}, {"action": "Spare them", "result": "Yes of course! These creatures can sense the greatness in you, that’s why they wish to join you! This is just the first step, after you gain the power of the Xont, you’ll be able to unite this entire planet under your command! These Lizard creatures are not unintelligent and would make excellent servants.\n\n“Where’s our best Lizard translator?” you ask.\n“Um, that would be me sir.” Corporal Higgins steps up and says.\n“Good, you’re still alive, tell these Lizards that they’ll be coming with us. They can also have the honor of carrying some of our equipment.”\n\nWhile corporal Higgins follows your orders, Indoctrinator Salo stops you from going back to your tent protesting severely and very vocally.\n\n“Captain! These creatures need to be exterminated! They attacked us! The will of the Emperor demands no less!”\n“The Emperor isn’t here.”\n\nThis callus remark doesn’t endear you to Salo.\n\n“You would DARE say such a thing? You are walking the line of heresy Captain! Perhaps you have allowed yourself to be contaminated too much by alien influences!”\n“Out of my way Salo, I don’t want to hear this shit right now.”\n“Oh what would you rather do? Fornicate with your blue alien whore? Don’t think I didn’t notice you going into Sergeant Alyssa’s tent earlier! I am the eyes of the Empire!”\n“Last chance Salo, to get out my way…”\nSalo, is right in your face at this point. “No Captain, this is YOUR last chance! You need to…”\n\nBefore Salo can go on another tirade, you push him back, pull out your pistol and blast him in the face! The rest of your team watches in silence as you stand over his body ranting.\n\n“YOU WILL NOT GET IN THE WAY OF MY DESTINY! NOT YOU, NOT THE EMPIRE, NOTHING!”\n\nThe next morning work begins on the rafts; they’re built relatively quickly with the extra help of the Lizards and the fact that nobody seems to want to piss you off after what happened to Salo. Soon the two large rafts are shoved into the river. Success, they float, but you never really had any doubt. You make sure Alyssa and Higgins are on your raft. You assign Lieutenant LaFleur to the other, and continue on your journey. You have some canopies set up during the trip, so you can at least take shade from the infernal sun beating down on you during the trip. It seems like it got even hotter, how you long for the cool touch of Alyssa’s skin again.\n\nAs you think about this, you notice a strange rodent like creature running past your feet making squeaking noises.\n\n“What the hell is that?!” you ask you team.\n“Oh, that’s a Slink Slink. Or at least that’s what the Lizards call them. I believe they eat them sir.” Corporal Higgins replies.\n“Well how the hell did it get on here?”\n“I dunno they live in this area I guess and one snuck on board, they’re harmless sir, one of the Lizards will probably eat it later, nothing to worry about.”\n\nYou don’t have time to worry about such trivial matters, you wonder if you should reassure your team that this IS the right path. You’ve noticed that ever since the incident with Salo, your team has been edgy and looking a little less confident in you.", "action_results": [{"action": "Make a speech", "result": "You decide that you need to put the team’s minds at ease by giving an inspiring speech. You order that you make a landing at the nearest clearing, when both of the rafts land you gather everyone and begin to speak.\n\n“I know everyone here feels a little uneasy after what I did to Salo, and this exploration we’re going on. Some of you may be wondering if I’m still following the Empire. Well let me say right now, no.”\n\nThis revelation is met with shocked silence.\n\n“What has the Empire done for us? Any of us? We’re expected to just die and follow orders. Look at where they sent us! This hellhole of a planet to find resources to support it. We’re like fucking drones sent from the hive to find food to support some great bloated queen. Well I say no more! I see a greater destiny for me, for all of us! With the Xont technology, we could make our own way and break away from the Empire! Others would join us in time. All of you could share in this utopia I see before us! I’ve trusted you all with my life at one time, and I’m asking you to trust me in this. I know this might be scary to break away from the Empire, but I’m asking you not to blindly follow a corrupt system anymore, but to embrace destiny instead. Who’s with me?”\n\nVarious members of your team begin to speak amongst themselves and look at each other, but you know they’ll follow you, you can sense they recognize greatness when they see it. One of the solidiers begins to speak.\n\n“You’ve never lead us wrong before sir, and we’ve followed you this long. You’re right, it hasn’t been the Empire that’s looked out for us, it’s been you. We’re with you!”\n\nA cheer goes up, yet still you see two that aren’t so sure. Alyssa and LaFleur. LaFleur you know is a victim of his own cowardice. He is unable to grab destiny when it’s presented before him, but Alyssa…you don’t understand why she feels the way she does. You’re about to talk to her, but LaFleur runs up to you very anxiously.\n\n“Sir! We can’t abandon the Empire! They’ll hunt us down and kill us for treason! They might even have the Indoctrinator Order torture us first! Oh man! Oh man! I can’t take this! I can’t be part of this!” LaFleur start hyperventilating and is nearly in tears at this point.\n\nSomething’s going to have to be done, you can’t have this.", "action_results": [{"action": "Calmly convince LaFleur", "result": "“Lieutenant, calm yourself. That’s your fear talking. Fear that was instilled in you by the Empire. Think about it. You of ALL people should want to leave it. You never really wanted to serve anyway did you? You were forced to by your family’s tradition. You basically were born into slavery. I’m telling you to break the chains. Be the first one in your family to finally be free.”\n\nYou words seem to have an effect on LaFleur. He begins to tear up.\n\n“I’m going to do it! You’re right! I never wanted to be part of the Empire! Hah! You hear that Dad? I’m not following your footsteps anymore! Hahahahaha! I’m free! I’m fucking free! YEAH!” LaFleur follows up his sudden outburst with a couple of shots to the air.\n\nUnfortunately LaFleur’s enthusiasm has attracted some rather interesting predators which immediately reveal themselves by uncamouflaging themselves and savagely biting chunks of flesh out of one of your soldiers!\n\n“Fire!” you shout, and your soldiers obey, the fauna proves to be more difficult than you think though, they resemble snakes with little legs, but are a whole lot quicker and blink in and out of sight. You must be by a nest because they seem endless; you’ll lose a lot of people at this rate.\n\n“Back to the river! Destiny awaits!” you shout while you all run back the rafts while firing.\n\nSoon you’re on your way again. You shoo away a Slink Slink which is squeaking underfoot. In fact there are a few more of them now. More must’ve wandered on while you were briefly docked. You can’t be concerned about that now. You have other important matters on your mind. You know that the Xont structure must be getting close, and you need to be prepared. You look over at Alyssa who doesn’t show it, but you can tell she’s still troubled by all this. You walk over to her.\n\n“Alyssa.”\n“Sir.”\n“You don’t need to call me that, you can address me by my name.” you say and touch her face. There’s that cool feeling again.\n“I…don’t know, I don’t feel comfortable addressing you as common, you’re always going to be the Captain to me.”\n“Are you scared of leaving the Empire?”\n“Of course not, my loyalty has always been to you. I’d follow you anywhere. You saved my life, I’m indebted to you but… it’s just…never mind.”\n\nYou make a bold move and put your arms around Alyssa, she doesn’t resist, but you see a slight hint of sadness in her face. You wish you could make her see that this will all work out. She will see eventually. You know she will. As you’re holding her, you’re interrupted again.\n\n“Sir. There’s a Lizard village up ahead, should we stop?” Higgins asks\n\nAh ha! You knew you weren’t crazy! The Elojin said there was a Lizard village near the Xont structure, this must be it! You’re very close now. Perhaps you should stop though, the Lizards may know something. Besides you’re going to eventually unite this planet under your rule, you should start making allies.", "action_results": [{"action": "Stop", "result": "You order your team to get ready to dock again. As you approach the village, the Lizards see you and go running to a big hut and quickly run back out. They don’t attack, but eye you warily with spears and bows drawn.\n\n“Higgins we’re probably going to have to deal with the chieftain, I want these Lizards to help us if possible, so I want you on top of your game!”\n“I will sir, but what if they attack us anyway?”\n“Well then we crush them as always, but usually Lizards either attack immediately or not at all, so we’re probably safe…they probably recognize greatness when they see it, just like these Lizards did.” You say pointing to your Lizard porters.\n\nThis village is a little bigger than the ones you’ve come across before, the Lizards seem more organized as well. You even see a few of them marching and doing some sort of drill routine. All you questions are soon answered, when the chieftain emerges from his hut.\n\n“I am Chief Kruz. Do you seek my wisdom?” he asks.\n\nHoly shit, it’s a Mazatt! Well that explains why the Lizards are so organized.\n\n“I can see by your face that you were not expecting to see a Mazatt, in charge of this village. So tell me why has the Terran Empire come to this place? Is it the same reason as my own government? To plunder its resources? (Sigh) Such short sightness. I was much like the rest of my race until I found a different way, after I was sent to this planet.”\n\nHe speaks very well for a Mazatt, usually they don’t even bother, except to shout warcries. From the sound of it, he also has left his government. Perhaps you may have a common interest, but then again perhaps not.", "action_results": [{"action": "Speak with Kruz", "result": "“Actually Chief, we’re no longer part of the Terran Empire. I have seen the corruption of it and want no more part of it.”\n“Hmmm, yes. I did sense something slightly different about you. I am glad that you have seen the futility of the current power structure in the galaxy. However, if you are here for what I believe you to be, then we still have problems. I cannot allow you to steal my destiny.”\n“And what destiny might that be?” you say, fully knowing what the answer will be.\n“The same you believe yours to be. To gain the power of the ancient Xont. Still, I do not wish to kill you right off hand, perhaps we can come to some sort of agreement.”\n“How about I just kill you right now?”\n“You could try I suppose, but you would not make it out of here alive. Besides, you would fail, destiny cannot be changed. I have been chosen to bring order to the galaxy. I cannot die before my mission is completed.”\n“And you are sure of this? How do you not know it is ME, who is meant to do this?”\n“Hahahaha! If I really thought that, I would step aside without hesitation, but you are not…but perhaps this is a test? Is it possible that destiny has chosen two worthy candidates?”\n“Impossible. I have been chosen, you are merely delusional.” You say confidently.\n“Perhaps you would like to convince me? I guarantee that is the only way you shall make it out of here without a fight, or perhaps you’re still looking for a fight, but a fight between only us. A fight to the death, destiny will choose the winner.”\n\nActually he makes sense, if you ARE chosen for this destiny, then you will win no matter what.", "action_results": [{"action": "Convince Kruz", "result": "“Ah good I prefer to debate. So many are always willing to solve problems with violence, this will be a nice change. We can talk in my hut, whoever convinces the other shall take control of the other’s followers.”\nYou realize that gaining an army of Lizards would help immensely.\n“Agreed.”\nYou both enter the hut sit across from each other, alone. Kruz speaks first.\n\n“Shall I tell you my tale of how I found my destiny? My team was deployed on this planet probably much like yours. We went through the usual motions, until we encountered these natives. Of course as you probably know, they’re mostly hostile, but somehow I sensed a certain honor in these scaly natives. They are like the Mazatt. A race of warriors, and they’re completely trustworthy unlike all the other races we’ve encountered. Yes, they were primitive, but they do not deserve enslavement. I wanted to try to do something new, make peace with them and perhaps eventually incorporate them into the Dominion, but not as a slave race.”\n\nInteresting point of view for a Mazatt, the Empire of course does this when possible, but the Dominion never does. The Lizards are shorter than the Mazatt, perhaps that’s why Kruz had an affinity for them.\n\n“Of course others in my team felt I was being soft. A few tried to challenge my position as leader, I had to slay them, but soon my entire squad rose up against me, not content to just shoot me and get it over with, they beat me, and threw me over a small cliff. They thought me dead I suppose, but I was not out of it yet. Even with my head bad head wound I struggled to get up and I crawled inside a nearby cave, and that’s when destiny found me, and I found THIS!\n\nThe Mazatt brandishes a coin! One exactly like the ones you obtained from the Elojin.\n\n“I knew what it was; I had heard the legends of the Xont before. I never paid too much attention to them before, but somehow I knew this was real. I just had to find the ruins of the Xont, but then I fell into unconsciousness. That’s when the scalies found me. The fact they never ate me and brought me back to full health only confirmed that I had been spared for something greater. When they saw that I held this coin, they made me their leader. My old life was gone; I was discarded by a system that is bound for ultimate destruction anyway. These scalies are my new people, this planet my new home. I have visions that confirm what I know in my heart, that I am destined to find and use the Xont technology on this planet and bring about a new age in the galaxy.”\n\nWell you can see he’s convinced himself, now see if you can convince him that he’s entirely wrong and this is all in his head.", "action_results": [{"action": "Explain your story in full detail and stand by it", "result": "After explaining your story, Kruz is unconvinced, and begins to drill holes in your own belief.\n\n“All you’ve been doing is wandering on a delusional thought!”\n“What?!” you exclaim\n“You’ve done nothing to prove yourself! Look at what I’ve accomplished; I have an entire village of scalies following me, because they believe! You haven’t proven yourself to anyone else but your own people, which was easy to do since you already held command over them. They already trusted in you and you stated you still had to kill one of them. Convincing outsiders is far more difficult. The only way you could get the scalies that you have now to follow you, is by beating them in battle. I didn’t have to do that, they saw me and instantly knew I was chosen for a greater destiny.”\n\nYou haven’t had your belief challenged like this, you begin to sweat and raise your voice.\n\n“I HAVE THESE!” you say and slam your coins on the table.\n\n“So? Quantity doesn’t signify quality. And how did you obtain them? You said you took them from an Elojin! You didn’t find them, like I found mine. You basically stole them and as I said before, destiny cannot be stolen. And you are attempting to steal it.\n\nYou realize Kruz has spoken the truth. Your belief in being chosen has been shattered, all your actions have been for nothing.", "action_results": [{"action": "Accept it", "result": "You weep as you accept this revelation, but you realize you can’t go on. You take out your pistol, Kruz doesn’t even stop you. He knows he’s not in any danger.\n\nYou point it at your head.\n\n“This is my destiny.” You say.\n\nAnd then you meet it.", "action_results": []}, {"action": "Refuse it", "result": "Even though you know that you haven’t been destined for anything, even though your mind tells you that what Kruz says is the truth, you can’t accept it. You revert back to your own base human behavior and that’s: If you can’t have it then nobody will.\n\nYou pull out your pistol, Kruz doesn’t even try to stop you, he believes you’re going to kill yourself, besides destiny won’t let him die…he finds that he was wrong about that.\n\nHe clutches the blast wound to his chest and falls in disbelief.\n\n“The betrayal… the betrayal…” he says and then dies.\n\nNeither of you were correct. There’s no meaning in anything, it’s all been just a random choice of actions and coincidences, you can’t change things. You see that now, you throw the coins to the floor.\n\nYou exit the hut in a daze. You don’t notice anything going around you. One of the Lizards looks in the hut and begins making hissing noises, which causes the rest of the Lizards to talk amongst themselves. They don’t attack though, they just stare at you as you walk back to the rafts Your own team wonders what’s going on, and attempt to speak to you, but Alyssa tells them all to back off. She knows what happened.\n\nShe helps you to the raft where you collapse. She kneels down to pick you up.\n\n“I want to go home.” You say looking up at her, and fall unconscious.\n“We will.” She says.\n\nDuring your unconscious state, a few things happen. First of all the rest of your team is completely confused about what to do next. Granted they were all not really feeling like themselves either, but they were basically following you in an ill-conceived plan of treason, and now that plan’s been abandoned. Alyssa tells them everyone’s just as guilty so it’s in everyone’s best interest they all forget what happened. The Empire needn’t know about any of this incident. Lieutenant LaFleur disagrees; he doesn’t want to go back! He sneers and says if you’re too weak to accept destiny then he will! He demands to stay, Alyssa attempts to reason with him, but he won’t hear of it. He states how he’s going to find the Xont structure and crush the Empire.\n\nAlyssa shrugs and states whoever wants to go back to the Empire, can go with her, anyone who wants to stay can stay with LaFleur. Even with his new found “courage” people still don’t care for him, with only the Lizard porters staying with him. He remains behind while everyone else leaves on the rafts and head back to the area where you were first exploring. LaFleur makes a few ranting remarks as they leave.\n\nWhen you awaken Alyssa tells you all of what happened. The remaining time on Paradise is relatively uneventful, though the rest of your team members are a little wary of you. When the Empire ships come, a story is made up about the planet being used as a secret Mazatt training camp and how you were attacked. The Empire never needs too much of a reason to bombard a planet. Paradise is decimated by mass drivers. Most of your team members request a transfer, such a sudden mass transfer request, raises a few eyebrows by your superiors, of, but nobody says anything. A few stay, but you mainly wind up with a whole new team on your next mission.\n\nThe important thing to you though, is Alyssa still remains by your side. And that’s much more important than gaining power or overthrowing the government.", "action_results": []}]}, {"action": "Concentrate on pointing out flaws in his story", "result": "“It proves nothing! If anything you haven’t displayed anything that would convince even me!”\n“What?!” Kruz exclaims.\n“First of all, where are you? You’re in a village of primitives! And so they saved you instead of eating you, big deal! We’ve come across peaceful tribes before. So you’ve managed to impress them that they made you their chieftain, that’s not that big of an accomplishment. I myself have Lizards following me. They’re primitives, they can be impressed by the simplest of things, and a strong personality can take advantage of that, BUT one truly destined for greatness can convince his peers!”\n\nKruz listens intently.\n\n“Look at me; I have managed to convince my own people, as well as Lizards that I have a destiny! What did your people do when you merely tried to change their way of thinking a little bit? They attempted to kill you! They saw nothing within you that indicates greatness, they didn’t respect you enough.”\n“You do not understand Mazatt society! We are not as open to change as you humans are!”\n“Oh? Then how do you explain yourself? You certainly were open to change. No, do not blame your team for your own failings. Why I have just convinced a life long coward who used to do everything by the book to cast off the shackles of Empire slavery to believe in me. Why? Because he saw the destiny within me and he knew I was right! Your team didn’t see it in you; otherwise they wouldn’t have tried to kill you!”\n\nKruz has never had his belief challenged before, he begins to sweat and raise his voice.\n\n“I found THIS! Proof that I am chosen! I have visions of what is to be!” he shouts and holds up the coin in desperation.\n\nYou pull out the five coins you have and slam them on the table. Kruz is surprised. You hold on to one of them and speak.\n\n“If these prove anything, then the fact that I have five, proves that destiny still favors me more in quantity as well as quality. And as for your visions, you said you smacked your head pretty good when you were thrown off the cliff. It’s more likely you’ve been suffering from delusions from a closed head injury.”\n\nKruz looks down, you’ve shattered some of his confidence, now to finish it.\n\n“And why did you not order me killed right away? If you really thought you were the chosen one, you would’ve killed me right away as either an imposter or a threat. But no, you wanted me to convince you, because deep down, you don’t even believe you’ve been chosen. When you saw me, you knew I was the one.” You stare hard at Kruz into his eyes enforcing your will.\n\nHe breaks down and falls to the floor and looks up at you.\n\n“You are the chosen…”", "action_results": [{"action": "Kill him", "result": "Kruz is a broken Mazatt. He accepts his fate as you shoot him in the head. You emerge from the hut proving that you have been the one chosen for destiny. You take control of the village and begin ordering the Lizards to perform searches for the Xont structure immediately.\n\nThey follow, but they aren’t enthusiastic like they should be. Higgins reports that they miss Kruz and felt he was a better leader. This news makes you furious! You proved yourself to be better than that pretender! This irritation only grows as time passes. Days pass and the Xont structure still hasn’t been found, and worse, other surrounding Lizard tribes have been attacking despite attempts to make alliances. Old fashioned conquest works, but the Lizards constantly resist and just don’t have the man power to keep your holdings even through fear. Eventually the Lizard tribes do start uniting…against YOU.\n\nA coalition of tribes marches on your position, and while your Lizards are definitely more organized, better trained and better equipped, you’re severely out numbered. You remain confident. You remember reading about an ancient battle on Earth called Rorke’s Drift, and using this as inspiration you try to motivate your people with a speech about how you’ll be able to stand against so many because destiny has chosen you.\n\nThe attack comes, it’s a massacre, your followers are overwhelmed, and it’s beginning to look like another ancient Earth battle…Little Big Horn. You begin ranting like a madman, screaming at them all for failing you. During the battle you see Alyssa fall, you rush over to her, but she’s dying. You feel her heavenly caress across your face before she finally drifts into eternal sleep. You wipe a tear from your eye.\n\n“Don’t worry I’ll be with you soon.” You say to her, and set her down.\n\nYou fly into a rage; you’re the last one left. You begin killing Lizards, ignoring the fatal blows they land upon you. You laugh saying how they can’t kill you. And then finally the adrenaline wears off and you finally succumb to your wounds. You look at the coins that lead you to this end. A fleeting thought crosses your mind in your last moments of life, you never actually found these coins, you stole them from the Elojin who found them.\n\n“Destiny… didn’t choose… me.”", "action_results": []}, {"action": "Spare him", "result": "“Get up, you shall follow me.”\n“But…”\n“No I am not going to kill you, perhaps you were not chosen, but I still see use for you.”\n\nYou immediately take control of the village and order for the search of the Xont structure. Your team gets a much needed break and spends most of its time in the village, now that you have Lizards to do the searching. Your new command consists of Alyssa, LaFleur, Higgins and Kruz who turns out to be very helpful and the most enthusiastic of your followers. Diplomatic missions to other Lizard villages are accomplished while others are conquered. New Lizard troops are trained immediately; soon you have a REAL army. Still, you haven’t found the Xont structure, but it hardly matters, you are accomplishing your destiny even without the technology, you just can’t wait for the day that you find it, your power will increase tenfold.\n\nEveryone is pretty much behind you, and is enthusiastic about your goal. Only Alyssa seems troubled the entire time. You almost think that she won’t become your wife, but she accepts. While you try to always reassure her and make her see the destiny that you see, she never does. She’s loyal, but she always has a saddened expression on her face whenever she looks at you. An expression her people almost never show accept in times of great sorrow.\n\nWhen the Empire ships come, you have many of the Lizard tribes united under your banner. You make contact with the Empire saying that you’ve made a lot of progress and wait for a shuttle to land, at which point you immediately capture it and take it back to the main ship with your team and a few of your elite Lizard warriors. You catch the Empire off guard for the most part, and capture the main ship without too much trouble, but the battle cruisers that were assigned to it are alerted and begin firing at you. You fight back, but your team isn’t experienced with ship to ship combat and your captured ship is vitally damaged. You refuse to run though; you have a destiny to crush the Empire.\n\nBut as the ship explodes and your followers die around you, you finally have a moment of clarity:\n\nThere was never any way you could fight the Empire. You were just as delusional as Kruz. Alyssa saw this; she was the only one who ever did. You look over at her and she sees that you finally understand.\n\n“Why did you follow me?” you ask.\n“Don’t you know?” she asks back.\n\nYou know the answer.\n\nYou squeeze her hand one last time as you both see the bright blinding light of a proton torpedo blast through the bridge.", "action_results": []}]}]}, {"action": "Fight Kruz", "result": "You choose to fight Kruz, he sighs heavily.\n\n“So be it.” He says.\n\nThe center of the village is cleared as you square off, both of your followers cheering for their respective leaders.\n\nYou’re a good hand to hand fighter, but Kruz has the advantage, on top of being a Mazatt which already makes him stronger than you, he also has been training himself vigorously during his time in the village. Eventually he overpowers you. He even says he’ll spare your life, if you swear alliegence. You refuse to give in, death is preferable than serving him.\n\nHe makes good on your inflexibility. The rest of your team is then killed as well.", "action_results": []}]}, {"action": "Kill him", "result": "You can sense it as sure as he probably can; you’ve both been searching for the same thing. You don’t even need to say anything to each other. Well nobody is going to steal your destiny. The predictable occurs…\n\nYou attack.\nHe attacks.\nBoth of your respective followers attack.\nYou all die.", "action_results": []}]}, {"action": "Keep going", "result": "You can’t stop now, not when your destination is so close!\n\n“Keep going!” you say. “We’ll come back later as gods.”\n\nAs you pass by the village, a few Lizards see your rafts float by and begin hissing at you, they start throwing spears and shooting arrows! You respond by ordering your team to fire back at them.\n\nMore Lizards come pouring out of village to help attack you, to make matters worse they’re moving out their own canoe like vessels to reach you! Some are even swimming\n\n“Kill them! Kill them all! Our destiny awaits! Let nothing stop us!” you yell blasting the brains out of some Lizard attempting to board the raft.\n\nYou look over to LaFleur’s raft, and he’s not doing so well. The Lizards have decimated most of them with their well placed arrows and spears and have now completely overwhelmed the few remaining, LaFleur is fighting harder than you’ve ever since him before. He’s like a whole new man.\n\n“You can’t kill me you Lizard bastards! Hahahahaha! I’m free!” are LaFleur’s last words before falling to the Lizards. You order everyone to fire upon the raft and everything on it, effectively sinking it.\n\nEventually your own raft drifts far enough away from the village that the attack stops. Your remaining team is in pretty bad shape. Some are dying, and at this point many are completely demoralized. All your Lizard followers are dead. You start looking at your coins again, while more Slink Slinks squeak past you.\n\n“We’ve survived. This planet is trying to destroy us, but it won’t. I will find the Xont ruins, and then we shall smite all those that oppose us. Who’s with me?” You say.\n\nAlyssa comes up to you; she’s wounded, but still able to walk around. She touches your hand and looks into your eyes.\n\n“Captain?... Let it go.” She says.", "action_results": [{"action": "Let it go", "result": "You look down, fall to your knees and weep. You realize Alyssa is right. This was a fool’s quest. There probably isn’t a Xont ruin here, and if there is, you aren’t anywhere near it. The Elojin might’ve even given you wrong directions on purpose. You’ve gotten everyone killed for no good reason. You weren’t any better than the Empire.\n“I’m sorry.”\n\nAlyssa holds you for awhile, and takes the coins from you and throws them into the river.\n\n“Its okay Captain, it wasn’t your fault.” She says. As you welcome her cold body next to yours, you collapse from exhaustion.\n\nYou drift in an out of consciousness, you know you’re moving, but it’s like you’re being dragged, eventually you fully wake up with all your capabilities. You see Alyssa.\n\n“What’s going on? What happened?”\n“You probably shouldn’t be up and around yet.” Alyssa tells you.\n“But what’s happened?”\n“Well after you passed out, me and few of the remaining team members that were still alive, took the raft apart and used some of it to make a stretcher instead, which we put you on. Unfortunately, we got attacked again by some more Lizards. I was the only one who survived, so I had to drag you the rest of the way and abandon the rest of the equipment. I would’ve gone back for some of it, but I didn’t want to leave you alone.”\n“Well I’m up now, so we should go back for it, we’re going to need what little supplies we have left, because the Empire ships still aren’t going to be here for awhile.”\n“So we are going back to the Empire?”\n“Well, I can’t think of anything else. I mean what’s the alternative? Hide and live on this planet?”\n“It’s up to you Captain.”\n“No, I want to be off this planet as soon as possible. I hate this place and what happened to me. Even facing an Empire tribunal and execution sounds better than spending one more day here.”\n“Why would that happen?”\n“Well come on, I was speaking treason before. I shot an Empire Indoctrinator. I’d say I’m in pretty big trouble.”\n“Who saw it? Who heard it? I didn’t see or hear any of those things. When I told you my loyalty was to you and not the Empire, I meant that Captain.”\n\nYou realize you nearly lost everything in trying to gain nothing. Alyssa’s willingness to say nothing and her loyalty is more than payment for whatever she thinks her debt is to you for saving her life. If anything, you’re indebted to her. And even though Alyssa thinks you were under some sort of mind control, you still vow that you’ll never act that reckless ever again.\n\nWhen the Empire ships come, you both back each other up about a story of Elojin ambushes, and hostile Lizard natives everywhere. You suggest there’s nothing of any worth on the planet except death. Your superiors nod and decide to bombard the place with mass drivers so nobody else can use it as a secret base of some sort, and you’re sent on your next mission where you’ll find your new replacements.\n\nYou and Alyssa always keep what happened on Paradise a secret, and not just the Xont incident, but the OTHER thing that occurred a few days after the incident.\n\nWell okay maybe the other thing occurred more than a few times, and still occurs from time to time…", "action_results": []}, {"action": "Embrace Destiny", "result": "“We can’t stop now Alyssa. We’re almost there! All our dreams will come true!”\n\nAlyssa just shakes her head in dismay, which is suddenly followed up by a look of shock and pain, you both look down and see yet another of one those snake things. This one has just bitten Alyssa deep in the leg. You immediately grab it and squeeze the life out of it, but its too late, whatever deadly poison it injected in her works fast. She falls; you hold on to her and whisper that everything will be alright. She looks at you one last time with sad eyes and then shuts them.\n\n“It’s okay Alyssa, I’ll bring you back to life, the Xont will have technologies that bring the dead back, I heard that story before. Its gotta be true!”\n\nYou carry Alyssa’s body back to the raft and launch it back down the river, still convinced that you’ll find the Xont structure. You make sure to keep her body under the canopy; she still looks as beautiful in death as she did in life. Most of your team is dead or unconscious and after a few days pass, all of them are dead, only the Slink Slinks remain on your raft, running and squeaking about. The sun beats down relentlessly on your boat of death. You feel so hot, you wish you could feel the coolness of Alyssa’s body again, but it no longer generates such temperature anymore.\n\nYou walk around, observing your dead team members, the Slink Slinks hastily attempt to get out of your way. You manage to pick up one of the Slink Slinks and look at it in curiosity. You let it go as it desperately squeaks in fear. You stand at the edge of the raft and look off into the distance as the sun continues to destroy what’s left of you.\n\n“I will achieve my destiny. I will find the Xont ruins, and plunder the ancient technology and secrets within. I will bring my beloved Alyssa back to life. I will unite the Lizards on this planet to follow my commands, and build an army. When the Empire ships come, we shall take them over and begin to build a fleet. Others shall join me when they see that the old Empire is corrupt and stagnant. I shall destroy and replace it with a stronger one. I shall found a dynasty with my beloved Alyssa, and form a pure bloodline of strong future rulers. All that oppose us, shall be crushed, the Elojin, the Mazatt, and the Krik. The galaxy shall be ours. For I have been chosen by destiny, and I shall meet it.”\n\nYou turn around one last time and address your team.\n\n“Who’s with me?”", "action_results": []}]}]}, {"action": "Shoot LaFleur", "result": "“I WON’T HAVE COWARDS GET IN THE WAY OF MY DESTINY!” you suddenly scream and shoot LaFleur the same way you shot Salo.\n\nLoyalty is a fickle thing. As quickly as you inspired your team, you quickly just destroyed their confidence in you with this unnecessary act. You don’t look like a visionary anymore you look like a delusional, power mad leader who just wants everyone to follow him. You’re no better than the Empire.\n\nAn argument breaks out, which degenerates into a fire fight. During this chaos a nest of weird snake like creatures are attracted to the noise and attack everyone. Their ability to blink in and out of sight makes them hard to defend against, let alone the fact that you’re also fighting members of your own team. Eventually you feel some fangs sink into your arm and a painful sensation throughout your body, and within moments it’s all over.", "action_results": []}]}, {"action": "Continue on your journey", "result": "As you progress, your team begins taking amongst themselves, your outburst and killing of Salo was a little over the top. Eventually an argument breaks out on your raft and results in a fight. Some of your team disagrees with your recent actions, even if they didn’t like Salo. They think you’re acting irrationally and are leading them on a suicide mission. Hostilities increase and shots are fired. The mutineers out number you and only Alyssa and Higgins remain by your side and both of them are killed in the ensuing battle. As you kill the last mutineers, you’re hit a few times and fall into the water. LaFleur has been watching the entire time and ordered the people on his raft to stay out of the fight. Upon seeing that you’re unable to swim properly in your wounded state, he lets his raft drifts away and allows you to drown.\n\nWhen the Empire ships arrive back to the planet he states how he had to take command after you went mad, and is promoted. He also manages to achieve what he always wanted, transference to a safe desk command.", "action_results": []}, {"action": "Would you like to know more? (Corporal Higgins)", "result": "Corporal Higgins…\n\nCorporal Higgins isn’t too much different from the rest of your team. He basically just does what is asked of him. He’s more than proven himself in battle though. For whatever reason, he seems to be able to communicate with the Lizards better than anyone else. He says it’s because he used to own lizards back on Earth as pets when he was a kid, and these are just big versions of them.", "action_results": [null]}]}]}, {"action": "Feeling different? (Current thoughts)", "result": "You feel very confident about this “quest”. It’s like this is a whole new beginning for you. You even have fleeting thoughts of going AWOL, with all the power that the Xont structure could hold, who says you have to do this for the Empire? The Empire hasn’t done anything for you except allow you to stagnate, with this find, you could change all that. Make your own way for once, and not be just faceless drone, and you could have Alyssa by your side still…you’ve been noticing how lovely she is as of late. You don’t know why you haven’t before. Perhaps it’s because you now have a clarity that you’ve never felt before.", "action_results": [null]}]}]}, {"action": "Let Salo take care of him", "result": "You don’t have time for mind games, if this Elojin actually has something important then he can tell it to Salo. He’s been itching to torture something anyway, might as well be an Elojin. This’ll kill two birds with one stone.\n\n“Sergeant Alyssa!” you yell, and she enters immediately.\n“Yes sir?”\n“Take this Elojin to Indoctrinator Salo.” You say, the Elojin looks genuinely surprised.\n”WHAT!? Hold on now, there’s no need for that!”\n“Oh? Well are you going to tell me where the Xont structure is at then?”\n“I…can’t do that! You’ll just kill me after I told you! Are you really ready to risk losing a chance at gaining the most important find of the millennium? You have to keep me alive! It’s the only way you’ll find it!”\n“You think so? So you really think you’ll be able to withstand the interrogation? And trust me, Salo really likes his work.”\nThe Elojin doesn’t look scared anymore; in fact he’s downright defiant. “Fine, turn me over to your narrow minded torturer! He’ll get nothing from me! We Elojin are a lot tougher than you humans give us credit for. We were exploring space while your race was still throwing bones in the air and fighting over pieces of yellow fruit and we’ll be here long after your so called “Empire” falls to the ravages of time, and history forgets you!”\n“Maybe,.. but not today. Take him away, and tell Salo to keep the screams to a minimum.”\n\nAs Alyssa takes the Elojin away, he looks at her and speaks again.\n\n“Huh. It must be nice to be a slave to such an enlightened society.”\n“Move it, Elojin.” Alyssa replies.\n\nTime passes and there hasn’t been a peep from Salo’s tent. You know you said for him to keep it quiet, but you didn’t think he’d actually do it.\n\nYou wonder if you should check on him, the rest of your team is pretty much going through their usual routines, so there’s not much to do right now. You could always relax.", "action_results": [{"action": "Go check on Salo", "result": "Well you might as well see what that sadist got out of his victim. You head over and enter Salo’s tent.\n\n“I TOLD YOU NOT TO DISTURB ME!” Salo screams.\n“What?!”\n“Oh…its you. Forgive my outburst Captain. I’ve been a little on edge.”\n“I…see…” you say as you notice that Salo has dismembered the Elojin. Body parts and blood are covering the floor of the tent. Salo sees your reaction to the sight and tries to explain.\n“Sorry for this mess, I got a little carried away, the Elojin proved to be particularly defiant. I was surprised, most Elojins squeal even without the threat of torture. This one wouldn’t say anything, at least nothing that he hadn’t already told you. I guess I got a little angry…”\n“I’d say you got a little more than angry.”\nSalo begins to suddenly weep.\n“I’m sorry Captain! I couldn’t get any more information out of him! I failed you and as an Indoctrinator of the Empire!”\n\nOkay this is really weird, you’ve never seen any side of Salo that indicates any like for you, let alone any feelings that would result in tears.\n\n“Uh, its okay Salo, I’m sure you did your best. Don’t worry about it, the Elojin was probably talking bullshit anyway about the Xont, we all know that’s just a myth. Maybe you should take it easy for awhile, and make sure you clean up this tent, who knows what the hell this mess this will attract.”\n“I will.” Salo says looking off into space.\n\nYou slowly exit Salo’s tent, and call LaFleur and Alyssa to your tent to talk about this.\n\n“What’s going on sir?”\n“Salo’s gone off his fucking rocker that’s what. He’s always been walking that line, but I think he’s finally gone over this time. He completely dismembered that Elojin and he’s just acting creepy in general and not the usual type of creepy either. He’s definitely not entirely sane anymore.”\n“So he’s a threat then? We kill him?” Alyssa asks.\n“Whoa, hold on there! As much as I can’t stand him, we ARE still following Empire law here; we can’t just shoot him, at least not without reason.” You say.\n“Well in situations like this, the procedure is to immediately have him checked out by a doctor…” LaFleur comments.\n“Uh duh, Doc got killed trying to communicate with some Lizards remember? Besides I don’t need a professional to tell me that he’s crazy, I saw it with my own eyes.”\n“Well then the next step would be to have him shipped off to an Empire mental facility…but since we aren’t anywhere near one of those and won’t be for a long time, we’re suppose to keep him isolated, and under guard like a prisoner, until such time that he can be transferred to the proper facility.” LaFleur says.\n“Wonderful. We can’t move effectively around with a madman in tow. (Sigh) Well I guess we could just spend the rest of our time in this village. Make sure everyone’s extra nice to the Lizards, we don’t need them rising up against us now. We can do exploratory missions of the surrounding area. Salo will be restricted to his tent and kept under guard at all times. Alyssa, inform the rest of the team. LaFleur we’re going into Salo’s tent.”\n“Um, erm, what for?”\n“To take away his weapons! We can’t have him armed.”\n“Sir maybe you should let Sergeant Alyssa…”\n“I said me and YOU, Lieutenant! Besides, he might attack Alyssa, he didn’t like non-humans before, he’s probably only gotten more intolerant since then. Its apparent the only thing he’s ever really respected is rank, even if it hasn’t been us personally. Now come on!”\n\nYou and LaFleur approach Salo’s tent cautiously.", "action_results": [{"action": "Enter first", "result": "You shake off the violent thoughts you’re having and enter the tent first. You see Salo, rubbing blood on himself and looking at some sort of coins. He looks up when you approach.\n“I TOLD YOU…oh it’s you Captain…”\n“Hello Salo.” You say and then slowly take his gun that’s lying on the floor. You pass it to LaFleur who’s petrified.\n\n“What’s that you got there?” you ask, still being careful of the fact that Salo still has his knife.\n“Oh this? I found these on the Elojin, after I interrogated him. Strange things they are…I’ve never seen anything like them…almost hypnotic…”\n\nYou’re going to take a wild guess but you’ve got a hunch that those things are causing the weirdness. You don’t see how you’re going to resolve this without physical confrontation. You get into a better position to lunge at him.\n\n“So Salo…” you say, and then you strike!\n\nYou and Salo wrestle for awhile, LaFleur runs off, but he at least goes and gets Alyssa to help you. Eventually you both knock out Salo, and you take all the coins and melt them with a plasma pistol. Crisis averted. You wonder what the coins were though. Were they some sort of Elojin mind weapon, or maybe the Elojin was speaking the truth about finding a Xont structure? If they were Xont in origin then you’re just as glad not to have looked for the place. This planet is hazardous as it is and you don’t need to add that kind of danger.\n\nLater Salo feels more like him self, and is completely apologetic and thanks you for saving his life. Actually he’s nothing like his old self; you almost think he’s still under some sort of control, but he’s not. In fact he pretty much leaves everyone alone for the rest of your time on Paradise, he spends a lot of his time in some sort of penance.\n\nWhen the Empire ships arrive you give a relatively mundane report, and leave out the trouble with Salo, in exchange for your silence, he transfers out of your squad and back to the Order.\n\nYou and your team get sent on your next mission infinitely a lot happier without an Indoctrinator watching over you constantly.", "action_results": []}, {"action": "Let Lafleur enter first", "result": "“Get in there you fucking coward!” you say and shove LaFleur in first. Salo, surprised by LaFleur sudden appearance, immediately attacks him by stabbing him in the neck.\n“I TOLD YOU NOT TO DISTURB ME!” he screams.\nAs LaFleur falls, Salo continues to stab him, completely ignoring you.\n\nYou take advantage of Salo’s preoccupation and shoot him in the head, you start laughing and continue firing. You feel a rush of pleasure that you’ve never felt before when killing someone. You quickly try to regain your composure. Alyssa and a few others enter the tent.\n\n“Sir! Are you alright?”\n“Ugh yeah. I…I don’t know what the hell’s happening, I feel weird. Salo killed LaFleur so I reacted…Is anyone feeling strange?”\n\nA couple of the other team members say they haven’t exactly been feeling themselves, Alyssa says she doesn’t feel any different, but something’s definitely going on. A few of the Lizards have been noticing what’s been going on, and its making them nervous it seems. You might be wearing out your welcome.", "action_results": [{"action": "Stay in the village", "result": "You decide to stay to figure out what the hell’s going on; you feel the need to rest though first. In the meantime, nobody is to enter Salo’s tent. You want a couple of guards to watch it, and in the morning it’s going to be searched thoroughly.\n\nYou go to sleep and have violent nightmares, except they aren’t nightmares; you find them to be very comforting. The next day, you insist on searching Salo’s tent yourself, Alyssa says she’s been experiencing some insubordination from team members, you snarl at her and tell her, if someone steps out of line then to shoot the bastards. She’s a little shocked by your comment, then you tell her not to disturb you while you search Salo’s tent.\n\nYou enter Salo’s tent and search, but you have a hard time concentrating, you’re having those thoughts again, they’re almost primal…\n\nYou stop searching and get angry from not readily finding an answer to your questions.\nExiting the tent, you see some of your team getting mad at the Lizards, who are hissing back. Alyssa tries to calm people down, but you undermine her authority, by pushing her aside and shooting a Lizard.\n\n“KILL THE OTHER TRIBE!” you yell.\n\nA small battle occurs, it’s bloody and short. Your side wins, but not just content on killing the Lizards, they butcher them. A few even start cooking them up. A couple of the male and female soldiers start stripping off their clothing and have sex right in front of everyone. There is no shame; it’s almost as if the concepts of civilization have been erased from all your memories over night. Alyssa’s disappeared but you’re not even thinking about her.\n\nHowever you still manage to maintain a higher brain function of authority. You quickly establish yourself as the “Alpha Male”, you immediately smash one of your tribesmen over the head and take his woman.\n\nAs time passes, you all have lost all ideas of your previous lives. You’ve all effectively reverted back to the Stone Age, hunting for your food and fighting over the smallest things. None of you are wearing your uniforms anymore; your equipment has been all thrown into a pile in Salo’s old tent. (You kept your rank bars though, because they were shiny) You are the Chieftain and make sure everyone remembers that fact, by displaying your prowess in battle with those Lizard creatures that attack every now and then, and by keeping the other members of your tribe in line.\n\nOne day you wander from the village, and come across a secluded waterfall, you see a blue woman with long white hair, bathing naked in it with an odd looking spear like weapon strapped to her back. She’s beautiful; you immediately bow down before her in complete awe. She sees you, and approaches. A glimmer in her eye meets yours…somehow you two know each other…but that’s impossible, she must surely be a goddess of battle sent from the heavens. She blesses you with her cool touch. Only a goddess could generate such a sensation in this heat.\n\nDuring your time together, the blue woman’s raw unbridled passion overwhelms you, she begins to claw and bite you and your entire body becomes as ice. You realize your actions as a warrior have been rewarded. You feel darkness approach; you’re ascending back to the heavens with her.\n\nAnd with one last kiss you finally reach Paradise.", "action_results": []}, {"action": "Leave the village", "result": "Not wanting to fight yet another battle with Lizards right now, you order everyone to quickly pack up and get ready to leave immediately. You leave the village much to the contentment of the Lizards. As you get further away, the weird feelings you and some of your team were feeling start disappearing. A few days later and they’re completely gone. You don’t know what the hell was going on, but you’re glad you didn’t stick around in that village.\n\nThe rest of your time on Paradise is routine. You get attacked every now and then, you fight, and you still don’t find anything of importance. That Elojin was probably lying about finding a Xont ruin.\n\nWhen the Empire ships arrive you give a report of the planet, and decide to leave out what happened with Salo, and just say he was killed by Lizards. Your superiors write Paradise off as low priority and send you on your next mission.\n\nSame as it ever was.", "action_results": []}]}, {"action": "Feeling different? (Current thoughts)", "result": "Something weird is coming over you, you don’t feel quite yourself. For some reason you’re having these thoughts of how LaFleur’s cowardice disgusts you. Granted you’ve never thought highly of him, but you’ve never had thoughts of strangling him until his eyes pop out…", "action_results": [null]}]}, {"action": "Relax", "result": "You decide to do something you’ve rarely had the privilege of doing on here, relax.\n\nThis isn’t “Real” Paradise however. Those that remain inattentive in this hostile world are likely to be victims of it. You are no exception.\n\nAs you relax you end up falling asleep, you awaken in the night only to see Salo standing over you covered in blood, with a crazed look on his face. He’s also holding his combat knife, which he uses on you repeatedly.", "action_results": []}]}, {"action": "Would you like to know more? (The Xont)", "result": "The Xont…\n\nThe Xont civilization has been discussed, and debated, by other races for centuries. To humans they’re considered the galactic equivalent of the ancient earth myth of “Atlantis”. Some believe their might’ve been a Xont race at one time, but wasn’t nearly as all powerful as they’re made out to be. Supposedly the Xont had vast knowledge and technology before any other race. It was said that only a few Xont could control an entire world. Other than a few oral stories passed down by some races and speculative writings based on those stories, there hasn’t been any hard evidence. A lot of stories sound the same, but are conflicting. For example some say they were balls of light while others say they were a race of machines. One story even suggests that they were bacteria with psionic powers. These could all just be accounts of several different spacefarring races that had made contact with different planets in the past, just as things go on today. The method of conquest might vary, but it usually always has the same results. Stories are bound to have similar tones about them. The fall of the Xont civilization also varies, some say they became decadent and were overthrown by their slaves, others say they succumbed to a disease that wiped out the entire race, others say they just disappeared. Nobody knows. A Xont home planet has never been found, but then again the universe is a big place.\n\nDespite all this conjecture, an eye is still kept out by all for signs of Xont technology since surely whatever kept them in control must be powerful indeed.\n\nPersonally you don’t really buy the idea of any of it, not until you see some solid proof.", "action_results": [null]}]}, {"action": "Have him killed", "result": "“An Elojin eh? Kill him. Anything he’s going to say is going to be bullshit anyway. I don’t have time to decipher what’s the truth and what isn’t.”\n“You could turn him over to the Indoctrinator sir. He is very efficient at that sort of thing.” Alyssa points out.\n“Salo? Yeah, I could, but I don’t feel like doing him a favor. Just shoot the Elojin. We’re heading out, I’m sick of this village.”\n“Yes sir.”\n\nAlyssa leaves and you shortly hear a gun blast and a body fall. She certainly doesn’t waste time. Speaking of wasting time, that’s what this mission feels like to you. If you’re stuck here for months, you’d at least like to be able to find something worthwhile.\n\nAs you leave and march through more jungle, you eventually come across some dead Lizards.\n\n“Sir, we got some dead Lizards here.” Alyssa tells you.\n“Damn, I do so like putting the righteous fury to these reptile heathens.” Salo says.\n\nYou examine the bodies, they’re pretty sliced up. Could be another tribe, but usually there’s more signs of arrow and spear wounds, these are more like cuts with a sword like weapon. Might be some sort of predator you haven’t encountered yet, but then you find something embedded in one of the Lizard’s heads: A black piece of chitineous material.\n\n“Great, there are Krik nearby.” You say. “Everyone on extra alert, and start watching and listening carefully.”\n“K…kkrik?” LaFleur asks in a scared voice.\n“Ah ha! The most demonic of the Empire’s enemies! I shall take great delight in slaying them!” Salo says in anticipation.\n\nAlyssa doesn’t say anything, you know out of everyone she came the closest to being killed by them, when they attempted to take over her home world. Her usual emotionless demeanor changes, as you see her eyes narrow displaying her hatred for them.\n\nThe rest of your team stands ready, it’s not like you haven’t fought them many times before, it’s just that you know they never come in small groups. They’re going to have numerical superiority over you and they are excellent warriors.\n\nYou continue on your way and soon you come across another village. And that’s it. The Krik are here in full force. They’ve effectively taken it over, You see piles of Lizard bones, and some other Lizards being lead to a nearby cave by a few Krik Taskmasters. It looks like they’re using them for some sort of labor, but you can’t tell what, you don’t see anyone carrying out of the cave yet, but if it’s the Krik in has to be important.\n\nWell this would qualify as something “worthwhile.”", "action_results": [{"action": "Attack the village", "result": "Thinking like the Krik is the surest way to be defeated by them; while they can get away with a swarm assault mentality, you cannot.\n\nYour clumsy frontal assault on the village proves futile. The Krik are taken by surprise at first, but sheer numbers eventually overwhelm you and your team, you provide a change of pace from the Lizard meat the Krik were eating.", "action_results": []}, {"action": "Sneak into the caves", "result": "You aren’t going to defeat them head on, this requires a little subtlety. You notice the cave is far enough away from the village that you could probably sneak in without raising an alarm. The plan is to silently kill the few Krik watching over the Lizards and see what’s so important in those caves. If it’s anything truly worthwhile you can ponder your next move, if it not, you can get the hell out and put a bunch of distance between you and this place.\n\nSalo isn’t too enthusiastic with this plan, he wants to attack head on.\n\n“The Emperor will protect us! This creeping and sneaking is for Elojin!”\n“I’m still in charge Salo, and I’ll decide what’s going to work! We aren’t all going anyway, I’ll be going, Alyssa, and two other team members. Lieutenant, you hold down the fort here, and dammit I NEED you to fucking muster up ALL your courage for this alright? If something goes wrong you need to get in there and help us.”\n“Um, I’ll do m…my best sir.” LaFleur says unconvincingly.\n\nYou shake your head and hope for the best. You aren’t worried so much that he’ll run, Salo will make sure he doesn’t, but you’re more worried that Salo will act like the xenophobic hothead he is and start an attack without LaFleur’s orders.\n\nYou, Alyssa, and your other two team members stealthily sneak into the cave. There’s a weird fungus in here that causes a glow allowing you to barely see, but at least its light. The cave seems to descend lower the deeper you go, eventually you reach where the Krik and Lizards are, you keep hidden on an upper level and observe what they’re up to.\n\nYou see the Lizards being forced to enter some strange doorway; it looks like they really don’t want to either. A few go in, and some don’t come back out. The ones that do are holding some shining crystals. They’re Baz crystals. Figures the Krik would be able to find something of worth on this planet. You wonder how they found it though and what the danger is through the doorway that they’re sending Lizards in there, let alone the fact that some of them aren’t coming back.\n\nTime to ponder your next move.", "action_results": [{"action": "Leave", "result": "You decide to leave, there’s not much you can do, even if you kill these Krik, sooner or later the others outside will suspect something wrong and come running. As you get ready to leave, Alyssa can’t believe you!\n\n“Sir! We have to kill these…things!”\n“Shhh, keep it down. We can’t do anything we…”\n“The hell we can’t sir! I’m sorry but I can’t stand here and do nothing!” Alyssa says and opens fire on the Krik killing one of them instantly. The rest of them are alerted and begin to fire back. One of them makes a high pitched squealing sound however, in an attempt to alert his fellows.\n\nYou kill all the Krik, but you hear a bunch of them running down the tunnel, and it sounds like a lot. You free the Lizards in the hopes that they’ll help, but they don’t understand you, and they’re too demoralized to fight. You try to withstand the onslaught, but they overwhelm you.", "action_results": []}, {"action": "Kill the Krik Taskmasters", "result": "The only thing you’ve found on this planet that’s useful and you’ll be dammed if you’ll let the Krik have it. You don’t think you could leave anyway, Alyssa looks pretty focused on killing them.\n\n“Now we have to kill them all at the same time, we don’t want one of them alerting the others with those sonic screams they do. Head shots, and aim like a damn sniper.”\n\nYou all take aim at the Krik taskmasters, there’s only two, but their bodies are naturally resilient. Hell, you’re hoping the headshots will kill them instantly. And this dim “fungus light” doesn’t exactly make it easy.\n\nSqueeze…squeeze…\n\nAlyssa fires twice, hitting both of them in the head! As they fall, she jumps down to the lower level and takes out her knife and stabs them both in the neck! They make twitching movements for a moment and then finally die. The Lizards look at Alyssa in wonder, they are certainly grateful to all of you, but you think she impressed them the most.\n\nThey don’t understand you, of course, but they do understand that you just saved them. You free the remaining Lizards of their chains, and look willing to follow you.\n\nYou could slip out of the cave and escape with the Baz crystals that were already gathered, or you could go through the doorway they were sending the Lizards through.", "action_results": [{"action": "Escape", "result": "Sticking around wouldn’t be the best idea, for the main reason that the Krik will probably send some more soldiers in here wondering what’s going on eventually. You decide to leave and come back in force.\n\nYou all escape the cave without being seen, when you make your way back, you’re almost surprised to see that Salo, hasn’t overrode LaFleur’s command and gotten everyone killed. He doesn’t look too happy to see more Lizards though.\n\n“Captain what is this? You bring more of these aliens into our midst?”\n“These Lizards were going to be killed by the Krik.”\n“And what of it? Let the alien scum kill each other I say!”\n“You would. Look there’s a Baz crystal deposit in that cave, (You show everyone some crystals) and we can’t possibly take out all those Krik, it might help to have some allies.”\n“Bah, your liberal policies concerning aliens will lead to your ruin Captain. You can trust in them, but I’m not. I trust in the Will of the Emperor, and that’s all a good Empire soldier needs to believe in.”\n\nAlyssa gives Salo a colder stare than usual, while you ignore Salo’s tiresome tirades, and decide your next course of action; you could start laying out a plan with who you have, OR you could try an even more radical plan and get the Lizards from the village you just left to help you.", "action_results": [{"action": "Make a plan now", "result": "The other village is too far away and you have reason to believe they’d follow you, sure they were friendly, but that doesn’t mean they’re ready to help you fight a battle that doesn’t directly concern them.\n\nYou need to act now. You plan out an attack, and explain it to everyone. The Lizards fashion some weapons with some nearby trees, and after a few attempts they grasp the plan to retake their village, but mostly they’re going to follow Alyssa into battle, seeing as they feel indebted to her for saving their lives. Everyone agrees with the plan and gets into position. Salo grumbles about having to fight along side Lizards, but he’s dislikes the Krik more, so he doesn’t protest too much more.\n\nYou see some of Krik approaching the cave, looks like they got suspicious, you wait for them to enter and then direct some of your team to ambush them. As soon as the sounds of Krik being shot in the back are heard, the Krik encampment is alerted.\n\nThe rest of the Krik converge on the caves and you direct another detachment from the other side to start firing. The Krik realizing they’re being attacked from two sides split up, and that’s when you lead the rest of your team to attack straight down the middle. Alyssa fights like she’s possessed with a rage you could never understand.\n\nThis simple tactic works surprisingly better than you thought, eventually you kill the last Krik, but the cost was high, many of your team members are dead, as well as all of the Lizards. All the high command survived though, Salo, LaFleur, and Alyssa.\n\nBut you’ve secured the Baz crystal deposit; you don’t want to really risk going through the doorway in the cave though. You’ve already risked enough, if the Krik weren’t enthusiastic about going in, and the Lizards weren’t either, then you’re guessing they had a good reason. Let someone else go in.\n\nOther than keeping Salo and Alyssa from killing each other and reassuring LaFleur that getting wounded by a Krik doesn’t mean eggs were laid in him, the rest of your time on Paradise is relatively uneventful.\n\nWhen the Empire ships arrive you report everything to your superiors who are very pleased. They have plans to start setting up a base immediately. As a reward, you’re given a medal, and some accolades, but nothing too special. You were just doing your job as far as the Empire’s concerned. However you suggest that Alyssa be able to be promoted, seeing as she displayed exemplarily in the battle with the Krik. Your superiors frown a bit, since you should realize that non-humans can’t achieve rank past Sergeant. However they say they’ll take it under consideration and maybe some exception can be made.\n\nThey dismiss you and you’re shipped off to your next mission, where you’ll get replacements for your team. As time passes Alyssa becomes the first non-human to be promoted to an officer rank, much to the annoyance of Salo, and to the delight of LaFleur who transfers out of your team for a nice desk command instead. She actually receives another few promotion offer later, but she always remains with your team though; she never forgets how you were the one who spoke out for her.\nEventually you and she grow even closer.\n\nAnother interesting effect that you didn’t expect was this one exception eventually becomes a “rule” as the Empire relaxes its policies on its alien citizens a bit.\n\nPerhaps you are just a glorified scout, but you made a major difference in the Empire.", "action_results": []}, {"action": "Get more help", "result": "You decide to take a risk, and go back to the village. It’s not a popular option. Many of the team are annoyed by the fact that you dragged them away from there only to take them back (And presumably back here) For once Salo and Alyssa are in agreement that you should attack the Krik NOW. And the Lizards you rescued are a little confused by this whole situation.\n\nEventually you get back to the village, the Lizards there, didn’t expect to see you again, and their previous friendship turns to anger! The Lizards traveling with you are their mortal foes! You forgot to take into consideration that ALL LIZARDS DO NOT GET ALONG! They think you’ve come back as an invasion force!\n\nAn unnecessary battle is waged, causing you to lose several members. There’s no way you could attack the Krik now, you’d be even more outnumbered than you would before and you’re severely low on ammo now. You stay in the decimated Lizard village for the remainder of your time on Paradise, with a barely civilized attitude towards you from the rest of your team.\n\nYou really screwed the pooch on this one.\n\nWhen the Empire ships arrive you explain the situation, and they immediately make plans to invade and take the Baz crystal deposit, of course the Krik have been in contact with their “government” as well. Krik ships soon arrive to help protect their investment.\n\nA battle is waged over Paradise, you and your team were assigned permanently on Paradise when the invasion first took place since the Empire decided you knew the terrain the best. A base is set up and you’re put in charge of it. Everyday more troops come and more die, nobody seems to make any headway, until it comes to your attention that this “little” battle for Paradise has escalated into a full-scale intergalactic war, and the Krik decide they REALLY want this planet.\n\nHundreds of Krik transports come swarming out of the sky and all are consumed.", "action_results": []}]}, {"action": "Explore the doorway", "result": "The doorway is strange; it doesn’t look natural, like someone created it. The Lizards get nervous as you approach it though, and even seem to hiss warnings at you. One even tries to stop you physically. You push him aside though and motion Alyssa and the other two to enter.\n\nYou creep through the cave, and the glow of Baz crystals glow in the walls of it. The place is filled with them. Of course they’re mostly embedded in rock, but still this obviously a big deposit. You still haven’t seen any sight of whatever is lurking in here.\n\nOf course that’s probably because you can’t see it at all until it rips apart one of your team members! Something invisible or camouflaged or something is attacking!", "action_results": [{"action": "Attack!", "result": "You open fire immediately, you know you hit it a few times, but due to its invisibility, it manages to easily get away and sneak up behind you and you feel its fist go through your back and out your chest.", "action_results": []}, {"action": "Run!", "result": "You can’t fight this thing, you gotta get out of here! You also remember that this “thing” doesn’t seem to go past the doorway. You all run back out, but you can still hear grunting behind you, its following you! So much for that plan! The Lizards see you running and do like wise, whatever this thing is its quick, because it’s keeping up the pace. Finally you exit the cave and you get an idea. You tell Alyssa to take everyone else and head back to Salo and LaFleur and get ready to attack, you’re going to do something.\n\nAs Alyssa follows your command, the thing is almost on you, and you run straight for the Krik camp.\n\nThe Krik are initially surprised that a lone human would dare do something like this, but after shooting a few of them they realize you’re attacking them. You narrowly avoid being shot and sliced up several times. And then that’s when it happens, your invisible friend starts ripping up the Krik.\n\nDuring this chaos, you manage to slip away and call for your own team to start attacking. The Krik are in disarray between concentrating on you and this invisible beast.\nSoon when it looks like the Krik are no longer a threat you tell your team to start concentrating their fire in the direction of whatever’s tearing up the latest bug.\n\nIt can’t get out of the way of all the firepower and is brought down, you finish up the last of the Krik resistance.\n\nYou’ve managed to secure the Baz crystal deposit; you spend the rest of your time on Paradise at the village, which is relatively uneventful.\n\nWhen the Empire ships arrive, you give your report and your superiors are very pleased, they order a base set up immediately. You’re given a medal and some accolades but that’s about it. You were just doing your duty to the Empire as far as they’re concerned.\nYou’re sent on your next mission with replacements awaiting you.\n\nJust another mission completed.", "action_results": []}]}]}]}, {"action": "Would you like to know more? (The Krik)", "result": "The Krik Collective…\n\nSo named, due to the noise they make with their mandibles.\n\nYou remember when you were young your mother would sit you in front of the vid screen and let you watch old Earth movies (Mostly from the 20th and 21st century) and years later when you saw your first Krik up close and personal, you wondered if some of those directors weren’t time travelers from the future because all those old Earth movie stereotypes of a hostile hive minded insectoid alien race wouldn’t be too far off when applying them to the Krik. They look like big bipedal bugs; there simply isn’t any other way to put it. While they aren’t exactly “devour all life for the queen” they come close. They do have a sense of individuality, but they always work in unison and for the common good of their race. A way of thinking that has served them well. As warriors they tend to use very effective bio-engineered weapons that only they can use. They’re fierce fighters, but sometimes tactics can fail them, due to their likeminded thinking. They aren’t very innovative, but then again it tends not to matter when they usually outnumber their enemies. One mind, a thousand “bullets” would be the ideology here.\n\nDue to their hive mindset they spread out on every world they can live on, and woe to those already living on it. They tend to enslave other races, but also use them as food. Life under the Krik is to be used and ultimately consumed.\n\nThey treat the other Major races little better, but they have enough intelligence to realize that a major all out war would be costly though. (Nothing prevents “little wars” though every now and then) Ultimately the Krik WILL go to war with everyone; it’s just a matter of time, so diplomacy is limited and only when it’s something they wouldn’t normally be able to achieve themselves. While they typically don’t really have anything that would be considered “feelings” they do tend to show what could be classified as “dislike” in regards to humans for some reason.\n\nPerhaps it due to the stories they hear of how humanity has been killing billions of “little kriks” for centuries on Earth.", "action_results": [null]}]}, {"action": "Would you like to know more? (Sergeant Alyssa)", "result": "Sergeant Alyssa…\n\nNot her real name, since that’s basically unpronounceable, but what you did make out sounded like “Alyssa” when she first told you, so that’s the name you kept calling her. It stuck.\n\nHer race lives on a world much different than Paradise. It’s a harsh frozen ice ball. How she can stand the infernal temperature here, is thanks to her race’s unique body temperature regulation. Even in this heat, she remains comfortably cool. It’s as if their home planet is always with them. Such a brutal environment created a very survivalistic race. Humans often jokingly refer to them as “Ice Elves” since their pale blue skin and physical features resemble the ancient earth stereotype of those mythical beings. Surprisingly they accepted the Empire when it came, even offering some of their young warriors to serve. Ever since that first contact, they have been a consistent source of troops for the Empire.\n\nAlyssa wasn’t one of those recruits, she pledged her allegiance to you when you saved her town from a Krik raiding party. Actually you were just trying to hold the territory because of the Baz crystal deposit there. Never the less, when you personally decapitated the Krik warrior who was ready to kill her, you gained a life long ally.\n\nHer loyalty is based more on you rather than Empire doctrine, but she’s proven to be more of a soldier of the Empire than anyone else you’ve commanded. If she was human she probably would’ve been an officer by now, but the Empire has “rules” against that. You doubt if she’d leave even if she could get promoted further though.\n\nThe fact that Inquistor Salo can’t stand her, only makes you like her even more.", "action_results": [null]}, {"action": "Would you like to know more? (The Mazatt)", "result": "The Mazatt Dominion…\n\nThere was an old earth saying of humanity’s life expectancy in ancient times: “Ugly, brutal and short.”\n\nApply this saying to the Mazatt and you pretty much have an accurate physical description of them. The entire race has been infected with a Napoleon Complex, as they absolutely see anything bigger than themselves as a threat, which pretty much means they are at perpetual war with every race they come across. Their average height is about five feet or slightly shorter. Despite being short they are incredibly strong and very skilled in combat. Their Heavy G home planet might account for this. The Mazatt Dominion achieved space travel later than all the other galactic powers, but made up for it quickly by conquering worlds and enslaving entire races. Unlike the Empire which “enlightens” worlds and “assimilates” other races, they never allow slave races to serve in their armies however, their distrust is far too great and given the number of uprisings they have to put down, it’s just as well.\n\nWhile they excel in combat, they fall short in other areas, most notably in medical research and spy networking, which they sneer at as being crutches for the weak. For a vertically challenged race their ships are the largest things flying around in space. Their concept of ship building basically consists of building the biggest fucking hull that will support triple plated armor, gauss cannons, plasma missiles, and a navigation system that has one big red button saying “GO TO THE ENEMY.” Actually this simple design works surprisingly well.\n\nAll diplomatic attempts with them have met with no or limited success, the Krik and humans are just too tall to be trusted. They find the Elojin to be utterly detestable and will have nothing to do with the spotty freaks.\n\nAnd who could blame them.", "action_results": [null]}]}, {"action": "Delegate the responsibility to Lieutenant LaFleur", "result": "You tell the soldier to let Lieutenant LaFleur take care of it, since you’re busy. You’re really sick of having to do everything yourself around here anyway. You go back to examining your maps. You wonder if you’ll ever find anything of any importance on here, when all of a sudden you hear yelling and gun fire outside your tent! You rush out with your own gun drawn.\n\n“What the hell is…” you start to say as you come out of the tent and are fatally hit by a blast in the chest by an Elojin holding an Empire pistol, it’s LaFleur’s. The incompetent idiot allowed his weapon to be taken.\n\nBut you were the incompetent idiot for delegating an important task to him in the first place.", "action_results": []}, {"action": "Would you like to know more? (The Lizards)", "result": "The Lizards…\n\nWhile there are many hostile creatures on Paradise, the only sentient ones you’ve come across are known as the Lizards, mainly because nobody has been inventive enough to assign them another name. They look like four foot tall bi-pedal lizards, so it’s an appropriate name.\n\nThe Lizards are basically hunters, and are still living in the Stone Age. They employ spears, clubs, blow guns and bows as weapons, but are completely capable of using their natural teeth and claws in combat as well. They aren’t united as a race, and there are many tribes actively at war with one another, which is good since they get distracted from attacking you.\n\nYou have come across peaceful tribes, but unfortunately this is still a rarity, most of the time the Lizards see you as potential prey. They don’t seem to have any fear despite the fact you severely outgun them. Then again they seem to worship various weird idols, so perhaps they believe in some sort of better afterlife. Communication with them is hard since they have difficulty speaking your language and humanity is not known for even bothering to learn other alien languages. Some progress has been made though.\n\nThey’re primitive, but not stupid. Many times they’ve set up traps and ambushes that have killed your team members on more than one occasion. Your limited communications with the friendly ones have proven they can learn rather quickly.\n\nIf they ever got organized they’d probably be even more dangerous.", "action_results": [null]}, {"action": "Would you like to know more? (The Elojin)", "result": "The Elojin Alliance…\n\nIf there was a race more duplicitous than humans, it would be the Elojin. They look similar to humans, except they are completely hairless and are covered in spots. They’ve had the ability to travel space before humans. It’s rumored that they had even made visits to earth in the past, mostly to cause trouble. This cannot be completely confirmed, yet the Elojin never flat out deny these accusations. Indeed they find it more amusing to keep humans guessing on the situation. If the rumors of early abductions are true, one wonders why they did not try to invade humanity when they could. However it’s been proven the Elojin are not a race of conquerors. They prefer to avoid open conflict and remain in the shadows. It’s partly why (Despite being technologically advanced) they are considered the “weakest” of the major galactic powers. With all the inner political turmoil that goes on in the Elojin High Council, it’s amazing they’ve been able to even hold it together. They have no loyalty to race, government, or even family. Each one is out for themselves. Several times in the past an Elojin defector has backstabbed its own government for personal gain. Of course within the same day, they’ve been known to backstab their benefactor as well, leading to the idea that ALL Elojin are potential spies, assassins or double agents. Their favorite past time is dealing in misinformation, half-truths and out right lies.\n\nThe Elojin will deal with anyone, but seem to prefer dealing with humans, since the Mazatt and Krik usually have less patience with them, this might explain why they prefer to side with humanity when the need arises, but rest assured this is only to save their own spotty asses. It’s in the Elojin’s best interest that NOBODY becomes the sole galactic power. As long as everyone is fighting everyone else, the Elojin are winning as far as they’re concerned.\n\nAnd they’re probably right.", "action_results": [null]}]}, {"action": "Approach your Lieutenant", "result": "You go over to LaFleur to tell him to lay off with the “by the book” shit. You’d think by now he’d know what looks good on paper doesn’t work in the field.\n\nUnfortunately, while LaFleur was only causing a minor annoyance, Salo was inciting a riot. With his rants he angered the previously peaceful Lizards to the point of hostility. As you’re telling LaFleur to stop being so uptight, a spear goes flying into your back.", "action_results": []}, {"action": "Would you like to know more? (Indoctrinator Salo)", "result": "Indoctrinator Salo…\n\nSalo is an Empire Indoctrinator: Loyal, dedicated, intolerant, and utterly fanatical. It’s his job to make sure humanity doesn’t fall to alien influences and to shove humanity’s influences down aliens’ throats or failing that, to annihilate aliens that insist on holding on to their own cultures and humans that question the Empire.\n\nSalo like most of his kind, sees heresy everywhere, he’s even accused you of being too “soft” on the natives on several occasions. What he fails to understand (Or refuses to) is you’re NOT an assault force, you’re scouts. Sometimes in order to survive, you have to work with the population that may live on the planets you’re exploring. In fact, it’s usually easier that way, since you aren’t fighting a battle every five minutes. (Let the marines worry about that when they invade) Indoctrinators though are known for their inflexibility, and Salo has been bending far too much for his taste. He doesn’t even really like the idea of assimilating alien cultures; he’d rather just exterminate them. So far the general hostility of the Lizards has been appeasing his xenophobia. He gets a perverse kick out of chanting Empire doctrine as he’s killing them. You’ve had to stop him a few times from going overboard. While killing native populations is fun for him, he always hopes to meet one of the sworn enemies of the Empire though, he particularly hates Elojin.\n\nYou and Salo have never really gotten along, but you’re getting the impression that you and he are going to really have it out soon and the outcome probably won’t be good. You don’t understand why he didn’t just ask to be assigned to an Empire Assault Legion instead, he’d still be serving the same purpose of “moral officer” and he’d be able to kill all the aliens he wanted on a regular basis.\n\nKnowing your luck though, he specifically asked to be assigned to you personally just because the nature of the universe seems to like fucking with you.", "action_results": [null]}, {"action": "Would you like to know more? (Lieutenant LaFleur)", "result": "Lieutenant LaFleur…\n\nIf there was anyone who wants to be here less than you, it’s Lieutenant LaFleur. He doesn’t really even want to be serving in the military at all. The only reason why he joined was due to the fact he comes from a military family and it was pretty much tradition that he HAD to join.\n\nYou’ve come across these types several times before, and they usually fall into two categories; spoiled and not spoiled. The spoiled military brats usually get their high ranking fathers to get them a desk job away from any real fighting of any sort and thus keeping the tradition alive in their family of being an “Armchair General”.\n\nUnfortunately for LaFleur, he came from the unspoiled kind. His father purposely made things even rougher, since he expected more out of him. LaFleur is just not cut out for combat activity though, despite doing well in the classroom. Sensing this flaw, his father was determined to make him worthy of the LaFleur name by assigning him to a scout force. He would either learn how to adapt or die. Either one would be considered honorable to the family name.\n\nWhile LaFleur can memorize rules and regulation and perform administration with the best of them, he’s absolutely pitiful out on the field. He hasn’t actually run away yet, but he’s come close. Only Salo’s constant rants of how he’ll personally capture and torture anyone who runs away in battle are probably what keep him around. As it is, he mostly hangs in the back and fires a shot every once in a while.\n\nYou would almost feel sorry for him, if he wasn’t so annoying.", "action_results": [null]}]}, {"action": "Stay in your quarters", "result": "Avoiding your problems won’t solve anything and it certainly doesn’t solve anything here.\n\nYou fall asleep, and you don’t check on your team and they get into trouble without you looking over them. So it shouldn’t be all that much of a shock when a Lizard spear to your stomach wakes you up.", "action_results": []}, {"action": "Would you like to know more? (Your story)", "result": "The Empire and You.\n\nSure sounded like a good idea at the time when you first saw those commercials and heard all the propaganda about how humanity needed you most. You pretty much bought it hook line and sinker, just like they planned.\n\nWere you REALLY that bored on your backwater planet?\n\nWell yeah you were actually. You were raised on a relatively unsettled world, barely colonized, just a few farming communities basically. Your world wasn’t dangerous at all; the Empire had long since exterminated a native species living on it before humans came to settle it. Yep, nice and orderly.\n\nYou always felt stuck on your insignificant planet, you felt like you should be doing something greater, something more important. When the recruiters came you saw it as a way out of the intergalactic boonies and joined up right away. No longer would you be some drone, you’d be making a difference for humanity and gaining all the accolades that go with it. Since then you’re almost regretting that decision.\n\nIt’s not really the danger that bothers you, or the suicide like missions they give you. It’s the mood of still feeling insignificant. You thought this would all be different somehow. You thought you’d have a command of legions of troops, bringing glory to the Empire, and conquering worlds in HIS name.\n\nAs it is, you’re a glorified scout, because the Empire decided your skills would be better put to use there and of course the Empire is ALWAYS right.\n\nSure there’s adventure, but no fame, no adoration, there’s barely any acknowledgement for what you do, despite the fact that you’ve gotten pretty good at it and reached the rank of Captain. But if you were to get killed, you’d be replaced easy enough. The average grunt is probably more valued, you’re a canary in the coal mine.\n\nSometimes you think there’s gotta be a way out of this mess you’ve gotten yourself into…", "action_results": [{"action": "Back to the story", "result": "Paradise...\n\nThat must've been the Empire's idea of an ironic joke when they were assigning a name to this sweltering hell hole of a planet. The heat wouldn't be so bad if the planet wasn't also a jungle nightmare teaming with poisonous flora and dangerous fauna.\n\nThe \"primitive\" natives aren't exactly friendly either. Your team medic had to find that out the hard way. Oh sure sometimes you'll come across a tribe that's friendly, but most of the time the lizards see you as food. Soft, fleshy pink food that's invading their territory. Which means you usually end up having to torch an entire village.\n\nFuckin' waste of ammo.\n\nOf course if the planet and its inhabitants weren't enough, there's always the other major powers laying claim to the planet. The Krik Collective, the Mazatt Dominion, and the Elojin Alliance have all laid claims to plunder whatever riches this planet may have and that's why you're here: To make sure this planet is plundered by the Terran Empire instead.\n\nThe next Empire supply ship won't be here for a long time, let alone anymore troops. You're on your own. Ah the joys of being part of the Empire's expeditionary force.\n\nYou and your team have currently set up base in one of those \"friendly\" lizard villages.\n\nWell its a brand new day in Paradise, what's first on the agenda?", "action_results": [null, null, null]}]}]}