{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=43744", "context": "", "first_story_block": "You are Linda Niles, at just 19 you have become one of the most famous singers on the planet, your career started at 15 and you have enjoyed rave reviews, record breaking sales and all the fans a person could want. In addition, you have managed  to avoid scandals and developing an ego, which have destroyed countless other singer careers, you live a life most dream of.\n\n\nAnother typical day of your life, you are to make an appearance at the Destiny Hill Mall located in Destiny Hill, New Jersey. Recently you have become the spokeswoman, for Zidane's clothing and you are there to promote the opening of their newest store. They are a hoity toity clothing store that is hoping your endorsement will have people buy from them despite their outrageous prices. \n\n\nYou arrive at the mall around noon in a inconspicuous car so the dozens of people waiting around outside don't notice you. The car stops in in the employee parking lot, you get out and sneak in through the employee entrance which is surround by half dozen police officers. Once inside you head up a flight of stairs, hearing the screaming of your fans, there must be hundreds of them. This doesn't bother you as you've had countless concerts that had as much 20,000 fans so it's actually more quiet then normal. At the top of the steps is the back exit to Zidane's, you knock and a giant mall security guard opens and lets you in.\n\n\nHeading towards the front of the store past the expensive clothes is a chair and a table with markers and a stack of photos of yourself. The screaming fans are kept outside and become even louder when they see you. A few more security guards are standing beside you as you take your seat. Along with them is Steve your lifelong photographer who has his camera on a tripod ready to take your picture with the fans. Police officers stand outside the store as the door's open letting the noise enter the store, which is unpleasant to the guards but not you.\n\n\nThe first few fans come in and it is a pretty routine affair. You ask their name, you sign an autograph, they tell how great you are while trying contain their excitement, you take a picture with them and they leave. No matter how many times you've done this, you avoid going on auto pilot. You remain sincere and genuine for every fan, no doubt a factor to your success.\n\n\nThe next fan that comes appears to be a bit uneasy, He's looks just one or two years older then you, he has fair skin and short black hair that he keeps nervously scratching and light brown eyes that seem to be intentionally looking away from you. You've dealt with people who were nervous in your presence before and have dealt with people a bit socially awkward, this guy however was different, you don't know why but your gut is telling you something is off. He approaches the table, you could have security kick him out or you could sign the autograph and just get this over with", "action_results": [{"action": "Kick him out", "result": "You've trusted your instincts your whole life and they have never let you down. You signal to the security guard to escort him out. The guard grabs the man by the arm and takes him out of the store. The rest of the meet and greet goes well and after several hours you head out the back of the store, back down the stairs and into the inconspicuous car.  On the way home you get a cell phone call, it's your agent Lenny Hamliton.\n\n\n\"Hey Lenny\" you kindly say as you answer the phone.\n\n\n\"What did you do?\" Lenny angrily asks at the other end.  \n\n\nYou find this a bit odd since Lenny is usually calm.\n\n\n\"What are you talking about?\" You ask somewhat confused.\n\n\n\"The media is saying you booted out a fan for no reason, I've been getting calls from news station, all day\"\n\n\n\"I found something odd about him, I don't know, something just didn't sit well\"\n\n\n\"I can't tell that to the press, they will be talking about this for weeks\"\n\n\n\"It'll blow over\"\n\n\n\"Maybe with someone else, but because you've been known for your spotless reputation, it'll hurt a lot more\"\n\n\nLenny hangs up on you, over the coming weeks it turns out you were both right in a way. The incident is talked about on all the tabloid papers and gossip sites. The identity of the man is never found out. Flame wars start on the internet over what you did was right or not. Your career continues to shine but you notice something is different, you are now just a singer, not the singer. This change takes a bit getting used too but you manage.", "action_results": []}, {"action": "Sign autograph", "result": "You decide to just sign the autograph and move on. Everyone has to deal with a werido at some point in their life, no sense in stressing over it. The man approaches the table.\n\n\n\"Name?\" You ask with a hint of fear in your voice.\n\n\n\"Uh, Jacob\" the man replied as if he had trouble remembering his own name.\n\n\n\"To Jacob, keep on rocking your's truly Linda Niles\" you say aloud as you write it out the photo.\n\n\nYou hand the photo Jacob and notice his hand is a bit shaky as he takes it from you, he also seems to be sweating a bit. You wonder which one of you is more on edge, no matter this will be over with a bit. You just need to take a photo and he'll be on his way.  You and Jacob walk in front of the backdrop that has been set up on the wall, in front you is Steve with his camera.\n\n\n\"Nice big smile now\" Steve says in a robotic tone.\n\n\nWhile looking at the camera, you fail to notice Jacob as he puts hand into his pocket and pulls out a handkerchief, you also don't notice until the last minute that he puts it over your mouth as he puts his other arm around your waist and hoists you over his shoulder. The smell of the handkerchief is sweet and soon your vision begins to get blurry and your hearing decreases. You can barely make out security guards chasing after you as Jacob runs out of the store and down the stairs while holding you in a fireman's carry. Things get blurrier and blurrier until you blackout. \n\n\n ", "action_results": [{"action": "Some time later", "result": "You awaken in a small room with a throbbing headache, it takes a moment for things to come into focus. When they do you see a beige sofa and a flat screen tv on the wall. Dust bunnies are on the carpeted floor and there are two doors leading out the room. You try the first door and it is locked, while the second door leads to even smaller bathroom complete with a toilet, shower and sink. You're not quite sure what to do next.", "action_results": [{"action": "Watch TV", "result": "You sit down on the sofa and notice the remote on one of the cushions. You use it to turn it on the TV which is currently on a news stations and not your surprise, your kidnapping is the top story.\n\n\nSeveral hours ago, renowned singer Linda Niles was kidnapped in broad daylight as she attended a meet and greet at the grand opening of a Zidane's clothing store in Destiny Hill Mall, here in Destiny Hill, New Jersey. Fans are furious that despite Police protection, the kidnapper was able to abduct Linda without a weapon and eluded police capture. Chief of Police Terry Shepard has already announced his resignation.\n\n\nThe FBI have taken over investigating the kidnapping. The man entered Zidane's shortly after the Meet and Greet, grabbed Linda Niles and escaped through the back exit, he then entered  a car and drove off. A car believed to be used by the kidnapper was found in an abandoned gas station. The car had been reported stolen a week and the owner is not believed to be part of the abduction. It is strongly believed that the kidnapper is a local resident and that Linda is still in Destiny Hill. The FBI said they are doing everything they can to make sure Linda Niles is found alive and bring the culprits to justice. Linda Niles came to fame at 15 when her single....\"\n\n\n You turn off the TV after they begin talking about your career, no need to hear about it, you know it far better then anyone else.", "action_results": [{"action": "Wait", "result": "You lay down on the sofa, wondering what lays in store for you. No one would go through all this trouble for no reason and you dread learning what that reason is. Does the kidnapper simply want a ransom or do they have something more sinister in mind? You notice there are no windows in this room and the bleak white walls are not helping you stay positive. You can't let fear overcome you, only by thinking rational will you get out of this.\n\n\nSuddenly the door that was locked opens up and the man who kidnapped you appears, he is holding a tray with a paper bag on it, he appears nervous and is looking down at the tray and not you.", "action_results": [{"action": "Demand to be let go", "result": "\"Let me go right now or you're going to face serious consequences\" You demand.\n\n\nThe kidnapper is taken aback by your yelling and drops the tray. You soon realize that he is coward and the door behind him is wide open. You push him aside and bolt through the door, the next room is a larger version of the one you were just in, carpeted floors with dust bunnies, bleak white walls and no windows. In the middle of the room is is a staircase which you quickly run up. At the top of the stairs you find yourself in a foyer and figure out that you are in a residential house. After quickly looking around you eye the front door and dash towards it. The door isn't locked as you swing it open and run outside.\n\n\nYou run, run some more and keep running, never stopping to look back to see if the man is following you. After maybe an hour your legs simply don't have the energy and you collapse on someone's yard. Luckily the owner is home and when they see you on the ground they quickly the police. When cops get there you explain who you are and they rush you to a local hospital, with full police and FBI protection of course.\n\n\nAt the hospital, you are checked to see if you have physical wounds or emotional trauma. Physically you are fine, mentally not so much, after a few days you are sent back to your home Los Angeles. The police never find the kidnapper, you were in such a rush when you ran out that you can't retrace your steps from where you were found. You never looked back at the house when you escaped that you have no idea what it looks like, let alone the street you were on.\n\n\nThe worse news is that the events have changed you, as you become withdrawn, don't have any more meet and greets, in fact you never do anything that directly involves interacting with the fans again. Even worse is that you become difficult to work with. At all future concerts you have a beefed up security presence. At first people sympathize with you, considering what you've been through, but as the years go on and your behavior only gets worse, all that sympathy goes away. Rumors begin to speared that the entire incident was a publicity stunt and not many people defend you. This damages your career but doesn't destroy it, however things have forever changed and not for the better.", "action_results": []}, {"action": "Beg to be freed", "result": "\"Please let me go, I won't tell anyone about this I promise, I'll give you money if that's what you want\" you beg as tears begin to roll down your face.\n\n\nThe man appears to get sad as if he regrets what he is doing and his eyes seem to get a bit watery. It isn't long before he regains his composure and begins to speak\n\n\n\"I'm sorry about this, I promise everything will be explained in time, just relax I have no intention of hurting you and by the end of the week, you'll be home\". The kidnapper explains.\n\n\n\"What's that?\" you ask pointing the bag on tray with one hand and wiping the tears off your face with the other.\n\n\n\"Oh, this is dinner, I got it from this deli called Luca's, the internet said you liked pepperoni calzone and diet soda so I got you that\" The kidnapper says while putting down the tray.\n\n\n\"Now that sofa opens up into a bed and in the morning, you'll meet my girlfriend, it won't be so bad\"\n\n\nThe man quickly leaves closing the door behind him and locking it. You wonder if he is afraid of being caught by the FBI or if he is always like that. You pick up the bag on the tray and take out the contents, sure enough it's a pepperoni calzone and a diet soda. Your stomach growls at the sight of the meal, you are too hungry to care if it's poisonous or not and begin wolfing the food down. After you've finished you put the tray in a corner and pull the bed out of the sofa . As you lay down, the events of the day race through your mind and you wonder if you'll truly leave this place alive. However you are exhausted and soon you fall asleep.", "action_results": [{"action": "The next day", "result": "You wake up the next morning, hoping the kidnapping was just a bad dream, sadly when you look around you see that you're still in the small windowless room. Not long after you wake up, the kidnapper enters the room with another tray, this one has a stack of pancakes and orange juice.\n\n\n\"I read you like buttermilk pancakes and pulp free orange juice\" He says as he puts down the tray.\n\n\n\"In hour my girlfriend, Jeanette is going to visit, you can meet her, she's quite a fan yours\"\n\n\nBefore the man leaves he picks up the tray from yesterday and exits the room, locking the door behind him. As you look at the tray you noticed he didn't leave any utensils, he has either planned this out or is just forgetful. You figure now is not the time to worry about proper eating habits as you grab a pancake and take a bite out of it. While you have breakfast you turn on the TV.\n\n\n\"20 hours after Linda Niles kidnapping, the FBI appears to be no closer to finding her. So far no group has claimed responsibility and no ransom has been demanded. Surveillance footage from the Destiny Hill Mall showing the kidnapper has been released to the public in effort to identify the man. Witnesses say that before the abduction, he gave his name as 'Jacob' when requesting an autograph. FBI officials say the name is most likely a fake.Officials also say they are considering a house to a house search, with the town's population at 40,000 doubts if such a search is possible or even if legal have been raised. Residents of the once quiet town are upset of the over the high police presence and checkpoints set up around the town's exits, meanwhile sales of Linda Niles albums have skyrocketed and rumors of the kidnapping being a hoax are beginning to circulate...\" \n\n\nYou finish breakfast and turn off the TV. You begin to wonder who this \"Jeanette\" person your going to meet soon is like, maybe she is just is timid as the guy is, you'll have just to wait to find out.", "action_results": [{"action": "An hour later", "result": " After waiting for an hour the door opens and the man appears.\n\n\n\"Come on\" he shyly says while sticking out his arm.\n\n\nYou walk towards him and he grabs hold of your wrist. He heads out while tugging you along, he is obviously trying to make sure you don't run for it, he also seems to be trying to avoid hurting you. You walk into the next room which is basically just a larger version of the room you were just in, carpeted floor with dust bunnies, bleak white walls and no windows. In the middle of the room is a staircase which you and the man walk up. Upstairs you discover you are in a foyer in what appears to be a residential house.\n\n\nYou eye the front door at the end of the foyer but the kidnapper tugs you in the other direction. You enter a room on the right which has two loveseat sofas, a large flat screen TV on stand with a DVD player and several DVDs. On the floor is a carpet that doesn't have dust bunnies, walls that aren't so bleak as the ones in the basement, and more importantly for you windows. You never thought you'd be so happy to see sunlight, but after almost a full day without you'll never take it for granted again. \n\n\nWhile you're staring outside you almost overlook that there is a women sitting on one of the love seats. She looks around your age, has almost waist long blonde hair, jean short shorts and a red tank top, she looks far more confident then the kidnapper ever did. She notices you are looking at her and begins to talk.\n\n\n\"I can't believe you pulled this off Martin\" the women begins.\n\n\n\"Yeah, I made a promise and I don't break my promises\" the man replied as he sat down next to her.\n\n\nYou notice the man is far more relaxed when in the company of this women.\n\n\n\"So you're the world famous Linda Niles, I'm Jeanette\" the women introduces herself.\n\n\n\"Nice to meet you\" you respond. You suppose being polite will improve your odds of getting out of this situation.\n\n\n\"I hope Martin has been treating you alright, he isn't a bad person, but I don't blame you if the kidnapping gave you a different impression\"\n\n\nYou can't tell if she is being serious or making a wise crack.\n\n\n\"So the reason I am here is I'm going to babysit you today, Martin has a few errands to run and we obviously can't just leave you here alone\" Jeanette explained.\n\n\n\"But the FBI is out looking for you\" You say surprisingly with a bit of concern in your voice.\n\n\n\"I have...things to do\" Martin stated purposely vague.\n\n\nYou could insist that Martin stays and Jeanette goes out to do whatever these errands are. You're not quite sure what to make of Jeanette, she could be dangerous, while you know Martin is timid and (probably) won't hurt you. You might even be able to make an escape attempt. On the other hand Martin isn't much for conversation, having Jeanette stay around would give you somebody to talk to, which would really help you keep your saintly while trapped. However Martin going out runs the risk if him being caught, which can your situation much better or way worse.", "action_results": [{"action": "Ask Martin to stay", "result": "You're smart enough to know the devil you know is better then the devil you don't.\n\n\n\"Maybe Martin should stay\" you suggest.\n\n\nBoth Martin and Jeanette are bit surprise by your comment.\n\n\n\"Sorry hun, but I have a ton of work to do and so does Martin\" Jeanette stated.\n\n\n\"If you really plan on letting me getting go by the end of the week, then it benefits me not having Martin go out and risk getting caught\"\n\n\nYour case doesn't seem to persuade Jeanette in the slightest, Martin on the other hand seems to take heed to what you say.\n\n\n\"You can do my errands Jeanette and I can do your bank statements, you'll still get the credit for doing them\" Martin advised.\n\n\n\"Fine, I guess we should be careful\"\n\n\nJeanette and Martin kiss each goodbye as she gets off the sofa, leaves the room and heads out the front door. As soon as she is gone Martin becomes his more on edge self.\n\n\n\"We have some work to do\" Martin explained.\n\n\nAs before Martin grabs you by the wrist but not very tightly  leading you into the foyer and then a room on the left. It is a kitchen complete with a refrigerator, oven and stove. The appliances seemed fairly modern, although the oven and stove appeared to be a bit dirty. Next to them was a counter and sink, with dishes that needed to be washed.A sliding door on the right lead to the backyard was on the right. In the middle of the room is a kitchen table, on it is a box with a bunch of papers. You both sit down at the table as Martin takes the box and dumps the papers on the table.\n\n\n\"Jeanette needs these bank statements alphabetize\" Martin blunted instructed.\n\n\nIt is a very dull affair as Martin at times seems to forget you are even there, paying for more attention to the papers then to you. You try to make small talk, Martin doesn't say much, but you manage to learn that his parents died in a car crash a few years ago and he doesn't like hot weather. Martin works at very fast pace, finishing his half of the statements and then proceeds to complete your half. By noon you are done, Martin orders a pizza, mushrooms and olives your favorite. After lunch Martin returns to the room with the love seats, lays down on one and promptly dozes off. You are now left unsupervised in the house.", "action_results": [{"action": "Explore the house", "result": "Escaping is way too risky, but it would be a waste to go back downstairs just yet, so you decide to have a look around. You walk into a room  that is at the opposite end of the front door. In it is a staircase leading to a second floor. When you reach the upper level you notice it is rather small, as it is just a hallway with two doors, the first one you try is locked but the second one isn't, inside you see a bed, a small nightstand, a dresser and a desk with numerous papers on it. There is little doubt this is Martin's bedroom. You head towards the desk and inspect the papers. One is the blueprints for the Destiny Hill Mall, with an a red arrow drawn from it. The arrow starts out in Zidane's clothing store, goes out the back exit, down a set of stairs and out of the employee entrance. It stops at a parking space outside the mall.\n\n\nSo this was Martin's escape route, you remember there were a bunch of cops guarding that entrance, how'd he get past them? You being unconscious at time, can't recall. The next item is a photo of a fancy blue sports car, on the back of the photo it says:\n\n\nLeaves keys in garage, code is 0515, asleep by 11 PM.\n\n\nYou are bit surprised how someone who acts like his own shadow would scare him, could plan this all, maybe Jeanette had a hand you wonder. Next to the photo of the sports car is a flyer with your face on it:\n\n\nCOME MEET 8 TIME GRAMMY WINNER LINDA NILES!!!\n\n\nYOU CAN HAVE YOUR PICTURE TAKEN AND GET AN AUTOGRAPH  OF THE WORLD FAMOUS SINGER.\n\n\nON THURSDAY AUGUST 16TH FROM 12PM-4PM AT THE OPENING OF THE NEWEST ZIDANE'S CLOTHING STORE LOCATED AT DESTINY HALL MALL  AT 219 OKONEDO STREET, IN DESTINY HILL, N.J\n\n\n*limit, one photo and one autograph person, first 800 people only.\n\n\nDid they really have to make this flyer so obnoxious you wonder. Moving on you see a small piece of paper with handwritten notes.\n\n\nSgt. Marcus Walker $10,000 WAY TOO MUCH!!!\n\n\nSgt. Lewis Mott $4,000. DOESN'T HAVE GOOD REPUTATION\n\n\nCpt. Harold Morowitz $3500, NEEDS MONEY, HAS A LOT TO LOSE IF CAUGHT\n\n\nBen Hinds (Head of mall security) $2000, SERVED WITH J's FATHER, TRUSTWORTHY\n\n\nSo cops were on the take, now things started making more sense, the final thing on the desk was another photo, it appeared it a bit more worn then the one with the sports car, on it was Martin only he appeared slightly younger, next to him was a teenage girl, it wasn't Jeanette as the girl had short brown hair and a more narrow chin, the back of the photo read:\n\n\n M+K, state fair\n\n\nThis photo had to be important as the creases on it showed it had been held many times. You hear footsteps shuffling around downstairs, Martin must be awake, you quickly leave the room and rush down the stairs, you manage to get back to the kitchen before Martin comes in.\n\n\n\"Time to go back downstairs\" He says in a somewhat groggy state.\n\n\nOnce again he grabs you by the wrist and once again not too tightly. He leads you to  basement and back into what has become your room. Once you are inside Martin heads out. Jeanette returns a few hours later and comes into you room, holding a box of leftover pizza.\n\n\n \"Thanks for doing the bank statements\" Jeanette said while putting down the box of pizza.\n\n\n \"Martin did most of the work\" You admit.\n\n\n\"Maybe you didn't want Martin to go because you were worried about him, maybe you found working with him romantic\"\n\n\nYou are taken aback by this statement.\n\n\n\"I'm joking\" Jeanette says as soon she notices you're getting uncomfortable.\n\n\nJeanette is obnoxious and Martin is on another world, quite a pair those two are you think to yourself.\n\n\nYou and Jeanette spend time eating the leftover pizza and talking for a bit. You learn Jeanette's father was in the army. After you are done, Jeanette leaves taking the now empty pizza box. You watch some primetime TV and then fall asleep.", "action_results": [{"action": "Next morning", "result": "You wake up the next morning and the smell of pancakes is in the air. You sit up to see that another tray of buttermilk pancakes and orange juice on the floor, there is also a small hand written note on the tray as well. You get up, walk towards the tray and read the note:\n\n\nI just realized  you haven't had a change of clothes since you got here, there's a fresh pair in the bathroom, I borrowed them from Jeanette, I hope they fit alright, once you have eaten and changed, meet me in the backyard. -Martin\n\n\nYou find it a little creepy that Martin was walking around in here while you were asleep, no point in stressing over it now through. Suddenly it dawns on you that wearing the same clothes for two days, including to bed, can't be good hygiene. You enter the bathroom and find the clothes the note mentions, which consists of a pair of loose fit jeans and a navy blue tank top. In addition a pair of fresh socks are sitting next to them. After a relaxing shower, you change clothes, and head upstairs. You remember the sliding door in the kitchen, you go through the foyer into the kitchen and out the door.\n\n\n    When you head outside, you take a moment to bask int the sunlight, you've been couped inside for two days and you now you have the chance to savior the sunlight beaming down your skin, a gentle breeze touches your face and feels so comforting.  You take off your socks and shoes to feel the grass on your feet, enjoying the feeling of each blade. if someone was watching you, they'd think you'd suffer some sort of brain injury, but right now you simply don't care.\n\n\n   As you walk further into the back you see tall wooden fences on both sides of yard, preventing the neighbors from looking in. At the opposite end of the lawn you see that there are tall trees, there are so many that it appears dark despite being early in the day. In the middle of the area  you can see a lawn chair, with Martin laying in it, dozing.  You'll have to wake him up, although you could run into woods and make your escape or you could turn around go back in the house and out the front door.", "action_results": [{"action": "Wake up Martin", "result": "You've stuck around this along you might as well find out you were kidnapped in the first place. You walk up to Martin and gentle nudge his shoulder, he wakes up startled but calms down quickly. He notices you standing beside him and gets up from the lawn chair.\n\n\n\"How Jeanette's clothes?\" He asks\n\n\n\"They're fine\" you reassure.\n\n\n\"I suppose now would be a good time to tell you why I went through  the trouble of brining you here\"\n\n\n\"You did say you'd tell me today\"\n\n\n\"I have a sister named Kate, she's fifteen and the only family I have, a year go she got diagnosed with liver cancer and it quickly became terminal\"\n\n\nMartin begins to choke up, but regains his composure and continues\n\n\n\"Tomorrow she is being released simply so she can enjoy the final days of her life. I own a place called the Whishaw theater, you are going to give her a concert\"\n\n\nYou're not sure what to make of all of this, the story of Marin's sister is sad, but this man has kidnapped you and held you against your will for two days, does he deserve this act of kindness?", "action_results": [{"action": "Agree to do the concert", "result": "Kidnapped or not, it just wouldn't be the right thing to do to turn Martin down, if not for him then at least for his sister who is dying of cancer and wasn't part of your kidnapping int he first place.\n\n\n\"I'm in\" You tell Martin.\n\n\nMartin faces quickly turns from sad, to surprised to overjoyed in a span of five seconds. He puts his arms around and hugs you.\n\n\n\"Thank you, Linda\" He responds, still holding on, the nervousness you've seen in him appears to have melted away.\n\n\nHe eventually realizes what he is doing and let's go, his face has a flash of embarrassment.\n\n\n\"So, Kate is coming home later today, you can meet her, talk to her and in the evening you can go down to the Whishaw and give the concert\"\n\n\n\"Sounds good\"\n\n\n Martin walks back to the house, seemly forgetting the fact you are left outside without anyone watching. You sit down in the lawn chair he was sitting in earlier and enjoy the fresh air. After an hour or two of lounging you hear footsteps approaching, you turn to see Jeanette standing nearby.\n\n\n\"It's time meet Kate, Martin and I are heading out\" Jeanette says as the two of you walk back to the house.\n\n\nOnce back inside, Jeanette heads out the front door while you see someone sitting in the room with the love seats. This is no doubt this Kate, she is about five feet tall, has short brown hair and a somewhat narrow chin. Upon seeing you, a huge grin appears on her face as she runs towards you.\n\n\n\"Oh my god, it's you, it's really you, sorry I'm acting like a total weirdo. I mean part of me was thinking Martin had simply lost his mind when he said you were here\" Kate says excitedly.\n\n\nHer outgoingness makes you surprise she is related Martin.\n\n\n\"It's alright, I'm human like everyone\" You reassure.\n\n\nAlmost as she soon she gets up, she goes back to sit down on the love seat, no doubt all she going through is leaving her with limited energy. You go and join her on the love seat.\n\n\n\"I know Martin kidnapped you\" Kate's tone becoming more serious.\n\n\n\"I imagine it's all anyone is talking about for past few days\" You responded.\n\n\n\"My brother is a good person, sure he's an oddball but I love him, I just don't want you to think he's a monster, please forgive him and try to understand why he did what he did\"", "action_results": [{"action": "Forgive Martin", "result": "You've been fortunate to have never had to deal with the pain of loss, let alone the loss of someone so young, you can't begin to imagine the pain Martin is in. Once Kate dies, Martin's pain will only get worse, but at least he can take comfort in the fact that he made his dying sister happy. Maybe that isn't enough of a reason to justify what he did, but you understand why he did it and holding a grudge against him just felt wrong.\n\n\n\"I forgive him\" You tell Kate.\n\n\nKate's face lights upon hearing this. You spend the next few hours talking about a variety of subjects like music, movies, TV shows and more specific topics such as why sliced cheese is better then cubed cheese, the right amount of ketchup to put on a hamburger, and why sticks will always be superior to stones. You're not quite sure what to think of that last topic, so you just go along with her opinion. \n\n\n\"I want to show you something\" Kate says with excitement.\n\n\n She gets up and walks over to the flat screen TV.  She then turns on the DVD player, while rummaging through a pile of DVD's. She opens one with a clear case  and puts it the DVD player. A huge grin is once again on Kate's face as she hurries back to the love seat and sits down next to you.\n\n\n\"Wait until you see this\" Kate says with enthusiasm as she use's the remote to turn on the TV.\n\n\nThe TV shows a slightly grainy image of a street that you can immediately tell is New York City. On video you see a girl you're sure is a slightly version of Kate walk up to a fancy hotel, with the cameraman following her.\n\n\n\"This is the place\" Kate tells the cameraman.\n\n\n\"Are you sure she'll be here?\" the cameraman asks, you recognize the voice as Martin's.\n\n\nSuddenly two people walk out of the hotel, one is a very large, muscular man the other is you.\n\n\n\"Linda you're awesome\" Kate shouts at you.\n\n\nYou give a quick wave, while the man glares at Kate. You then get into a waiting limo and drive off.\n\n\n\"She waved at us, did you see that?\" Kate says with an abundant amount of energy.\n\n\nThe movie then cuts to static and Kate turns off the TV.\n\n\n\"You don't remember that do you?\" Kate asks with a bit of sadness.\n\n\n\"I'm sorry kid, I won't be forgetting this that's for sure\" You say with a mix of truth and dry wit.\n\n\nAround noon, Kate orders a pizza, unlike the one from yesterday, it's not your favorite of  mush and olives, in fact it's your least favorite anchovies. You assume this must Kate's favorite as her eyes get wide eyed at the sight of it. Despite that she only manages to eat one or two slices. Despite her limited energy and lack of an apatite that is no doubt caused by her cancer she remains in good sprites. You manage to eat a few slices, although it is not a very fun experience.Shortly after lunch. Martin and Jeanette walk in through the front door. When they walk into the kitchen, Martin grins upon seeing the pizza.\n\n\n\"Anchovies\" He says with delight as he grabs a slice.\n\n\n\"We just got back from Luca's\" Jeanette scolded her boyfriend.\n\n\n\"Always room for anchovies\"\n\n\nJeanette rolls her eyes, while Kate finds the situation quite amusing, letting out a small giggle. Once Martin is done with the slice he turns toward you.\n\n\n\"So now we're off to Whisaw\" Martin says as he takes a piece of paper out of his pocket and hands it to you.\n\n\n\"These are the songs you're going to sing\"                                          \n\n\nYou look at the note and sure enough it has the names of the songs you're going to sing. There is about ten of them and  you know them all by heart, there is no need to rehearse. The four of you head outside and into Martin's car. It looks a bit old and is the color of walls in the basement. You all manage to squish in, with Martin driving, Jeanette in the front, and you and Kate in the back.", "action_results": [{"action": "To the concert (Happy Mood)", "result": "Martin drives the car into the parking lot of  the Whishaw theater. The building is about two stories and made out of bricks. Giant gray metal letters spelling out the word \"WHISHAW\" are above the front door. The parking lot itself needs a few repairs as grass is beginning to grow in the cracks of the pavement. As you get out of the car you look at the people across the street, walking to and from the various shops. You get a bit a worried that someone will see you, but they seem busy with their lives that if anyone did see you they wouldn't notice you were the famous Linda Niles who got kidnapped. You, Martin, Jeanette and Kate walk towards the entrance of the theater.\n\n\n\"So how does this work, is there a band or something?\" You ask, knowing you've should ask this when you first agreed to the concert.\n\n\n\"It's like karaoke, the music of your songs will play and you do the lyrics\" Martin explains.\n\n\nThe four walk into the building. Inside you see posters for plays, singers and bands you've never heard of. On the opposite wall, two sets of double doors leading into the auditorium. There is a concussion stand advertising food that may or may not have expired long ago.  A ticket booth on the right looks like it is in need of a good dusting. The carpet looks a bit dated and while the wall color is not nearly as bleak as the ones in the basement, it is beginning to peel.\n\n\n\"She's really something isn't she\" Martin says marveling his theater.\n\n\n\"It's something alright\" You respond.\n\n\nMartin doesn't seem to pick up on your sarcasm, but Jeanette does as she lets out a snicker.\n\n\nThe four of you head into the auditorium, the stage has a microphone with a spotlight shining on it\n\n\n\"I've got to get the music on, good luck\" Martin bluntly states as heads off and goes through a door to the right of the stage.\n\n\nYou walk up a set of steps and onto the stage. Gently you tap the microphone to see if it's working. The tapping sound echoes throughout the theater, confirm the mic works. Jeanette and Kate take their seat as the music for the first begins to play. Shortly after you begin singing Martin comes in and takes a seat next to Kate.\n\n\nThe concert goes to perfection, you can confidently say it is the best performance you ever gave. It's ironic that it's also the smallest audience you ever had. After the show, Kate stands and applauds excessively. Martin and Jeanette also join in the applause. You walk off to the stage and approach the trio.\n\n\n\"That was awesome, beyond awesome, awesome just isn't a strong enough word\" Kate rapidly.\n\n\n\"What happens now?\" you ask, slightly afraid of the answer.\n\n\n\"Now we say goodbye, if you leave here and walk down three blocks, you'll find the police station\" Martin explains.\n\n\n\"It really means a lot to us that you did this\" Jeanette thanked.\n\n\n\"Thank you for everything\" Kate says while hugging you and squeezes tightly.\n\n\nWhen Kate finally lets go, you head to the front door, you turn around and wave to them as they wave back. Once outside it occurs to you that none of them are concerned about you reporting to the police. Perhaps it didn't matter to them, you gave the concert for Kate and that's all they wanted. It also crosses your mind that you are free, the whole situation is over, although you doubt you will forget this anytime soon. The sun has nearly set as you head for the police station.\n\n\n \n\n ", "action_results": [{"action": "A few weeks later", "result": "Finally you are back home in Los Angeles, the press had been hounded you non-stop. Granted as an A-list star, they hound you all the time anyway, but after the whole kidnapping event, they have been doubling their efforts. Thankfully your house has the best security money can buy and you don't have to worry about them for the moment.  You never turned in Martin and Jeanette, you even begin to see them as good people. Soon your kidnapping isn't the top story and it gets less and less media attention. After a month the news stops talking about it altogether, some other celebrity is caught in a scandal and the world turns their attention to that. Another month later you learn through sources that Kate has died from her cancer, you wonder if should attend her funeral or not \n\n\n \n\n ", "action_results": [{"action": "Attend funeral", "result": "It may be risky but something is compelling you go back to Destiny Hill. You've avoided the press before and you can do it again. You arrive back in Destiny Hill in a inconspicuous car, similar to the one you were in when you had the meet and greet.  At the church you recognize Martin's car. Rain begins to drizzle as you park the car and head in. There are a  few people inside and most pay no attention to you. In front pew you see Martin and Jeanette sitting with their heads bowed down. They don't notice you as you head to the front and sit near them. You tap Martin on the shoulder and he jumps slightly upon seeing who are. Jeanette eyes widen when she sees you.\n\n\n\"What are you doing here?\" Martin says in a mix of sadness and confusion.\n\n\n\"I came to pay my respects, I only Kate for a day, but I know she was a good kid\". You answer.\n\n\n\"You don't have to do this, you're risking your career by being here\" Jeanette says with concern.\n\n\n\"I want to do this\"\n\n\nMartin hugs you in way his sister did back the concert. \n\n\n\"It'll be alright\" You comfort Martin.\n\n\nAfter the funeral, the three of you head back to the house, Martin goes over his favorite memories of his sister. You learn that Jeanette's father had also died of liver cancer and she and Martin meet at a support rally. By the end of the day you head off but remain in close contact with the two of them.\n\n\nYou make it an annual tradition to head out to Destiny Hill and visit Martin and Jeanette, also putting fresh flowers at Kate's grave every time you are there. A few years later Martin and Jeanette get married, while you don't attend as you don't want the attention on you instead of them on their big day, you foot the bill so they can have a very large and extravagant wedding. \n\n\nThe events that happen give inspiration and  another year later your next album is called \"Stockholm Syndrome\" which gets universal acclaim. You dedicate the album to Kate, people begin talking about who this Kate could be. The rest of your career  continues in this fashion. Decades pass and soon you are in inducted into the rock and roll hall of fame. You are considered one of the greatest singers of all times. Long after you're gone, people continue to talk about your legacy and the influence you had on music.", "action_results": []}, {"action": "Do not attend funeral", "result": "Going back to Destiny Hill would just be too risky, if you caught being there, the rumors will start again that you staged everything and this time people would start to believe them. Not to mention you'd be putting Martin and Jeanette at risk. You send them flowers and a sympathy card signed \"L.N.\", you also have the funeral coasts taken care of. Your career goes back to way it was before. A year later your next album is called \"Stockholm Syndrome\" and gets positive reviews. You dedicate the album to Kate, people begin talking about who this Kate could be.", "action_results": []}]}]}]}, {"action": "Don't Forgive Martin", "result": "After all the terror Martin has put you through, you still manage to have a heart and put on the concert, but forgiving him is just simply asking for too much. You want to say you will because that is what Kate wants to hear, but a comforting lie is still a lie and you're the not kind of person who would lie to a person with cancer.\n\n\n\"I'm sorry I can't\" You truthful tell her.\n\n\nKate stares at you the way a kid does when their parent tells them there's no Santa Clause.\n\n\n\"You'll still get your concert\"\n\n\n The next few hours are the longest and some of the most painful hours of your life. You try to talk to Kate about a variety of subjects, but she always just responded with one word answers. You get a little annoyed how you're the one who gets kidnapped but you're the bad guy.  The torture comes to end when Kate goes and orders a pizza, you remain in the room with the love seats with Kate eats the pizza by herself in the kitchen. You don't have any lunch and you wonder how you will do the show on an empty stomach.\n\n\nFinally Martin and Jeanette come home, Kate walks to over to them, putting on a facade.\n\n\n\"How are you two getting along?\" Martin asks completelyobvious.\n\n\n\"Doing great\" Kate says with a very convincing fake happiness.\n\n\nYou join the three in the foyer ad Martin turns his attention to you.\n\n\n\"So now we're off to Whisaw\" Martin says as he takes a piece of paper out of his pocket and hands it to you.\n\n\n\"These are the songs you're going to sing\"                                          \n\n\nYou look at the note and sure enough it has the names of the songs you're going to sing. There is about ten of them and  you know them all by heart, there is no need to rehearse. The four of you head outside and into Martin's car. It looks a bit old and is the color of walls in the basement. You all manage to squish in, with Martin driving, Jeanette in the front, and you and Kate in the back. The car ride is filled with awkward silence.", "action_results": [{"action": "To the concert", "result": "Martin drives the car into the parking lot of the Whishaw theater. The building is about two stories and made out of bricks. Giant gray metal letters spelling out the word \"WHISHAW\" are above the front door. The parking lot itself needs a few repairs as grass is beginning to grow in the cracks of the pavement. As you get out of the car you look at the people across the street, walking to and from the various shops. You hope that someone will see you, then you could get out of this mess without feeling even more guilty but they seem busy with their lives that if anyone did see you they wouldn't notice you were the famous Linda Niles who got kidnapped. You, Martin, Jeanette and Kate walk towards the entrance of the theater.\n\n\n\"So how does this work,?\" You ask, your mind focused solely on getting this over with\n\n\n\"It's like karaoke, the music of your songs will play and you do the lyrics\" Martin explains.\n\n\nThe four walk into the building. Inside you see posters for plays, singers and bands you've never heard of. On the opposite wall, two sets of double doors leading into the auditorium. There is a concussion stand advertising food that may or may not have expired long ago.  A ticket booth on the right looks like it is in need of a good dusting. The carpet looks a bit dated and while the wall color is not nearly as bleak as the ones in the basement, it is beginning to peel.\n\n\n\"She's really something isn't she\" Martin says marveling his theater.\n\n\n\"Yeah\" You respond, not really paying attention what he just said.\n\n\nThe four of you head into the auditorium, the stage has a microphone with a spotlight shining on it\n\n\n\"I've got to get the music on, good luck\" Martin bluntly states as heads off and goes through a door to the right of the stage.\n\n\nYou walk up a set of steps and onto the stage. Gently you tap the microphone to see if it's working. The tapping sound echoes throughout the theater, confirm the mic works. Jeanette and Kate take their seat as the music for the first begins to play. You can't help but notice Kate is giving a rather nasty glare. Shortly after you begin singing Martin comes in and takes a seat next to Kate.\n\n\nThe pain in your stomach from not eating greatly effects your ability to think straight. You give without a doubt the worst performance of your career, thankfully it is also the almost audience of your career and you doubt they will ever tell anybody. After the performance is over the three just stare at you.\n\n\n\"Well, thank you for doing that\" Martin says unsure of how to handle the situation.\n\n\nJeanette is at a loss of words and Kate flat out ignores you.\n\n\n\"So what happens now?\" You ask, eager to get out of here.\n\n\n\"Now we say goodbye, if you leave here and walk down three blocks, you'll find the police station\" Martin explains.\n\n\nYou walk out of theater without looking back, you inhale deeply after you're outside. You don't plan on turning them in, you just want to put as much distance between you and this town as you can. The experience you have at Destiny Hill is so dreadful you want nothing to do with singing ever again. Over the next few months you become reclusive and live your life in solitude. People begin to talk about the successful but short career of Linda Niles.\n\n\n ", "action_results": []}]}]}, {"action": "Refuse to do the concert", "result": "Two wrongs don't make a right, it is tragic what is happening to Martin's sister, but that's no excuse for holding someone against their will.\n\n\n\"You have my sympathy, but I'm not going to do this for you\" You firmly tell him.\n\n\nMartin's face appears to be on the brink of tears.\n\n\n\"I had a feeling you'd say that, I suppose there is no point in holding you here, you can leave\"\n\n\nYou are bit shocked how easily Martin gives up.\n\n\n\"You're not worried I'll turn you in the police?\" you say, instantly realizing that wasn't the smartest question to ask.\n\n\n\"Soon my sister will be dead,being free or in jail won't change the grief I will feel\"\n\n\nMartin sits down on the lawn, coming to terms with reality. His goal was to make his dying sister happy and he had failed. He doesn't pay any attention to you as you make your way to the road. Eventually you come across a police car and flag them down. You are rushed to a local hospital, with full police and FBI protection of course. At the hospital, you are checked to see if you have physical wounds or emotional trauma. Physical you are fine, mentally you are worn out and have anxiety, which you can't say surprises you. The root of your anxiety isn't actually the kidnapping but the decision to turn Martin in or not, before you would have turn him in a second, but now that you know the situation he is facing you don't know.", "action_results": [{"action": "Turn Martin in", "result": "Martin broke the law and dealing with a personal tragedy doesn't change that, you tell the FBI about Martin and Jeanette. Although they only have first names to go on, finding Kate is rather easy she is the only teenage patient at the local hospital with liver cancer. From there they learn where Martin lives and are able to arrest him along with Jeanette, after a few days you are back home in Los Angeles.\n\n\nOver the next few months you learn while awaiting trial, Martin was unable to attend Kate's funeral after she dies. Eventually he is convicted and sentenced to twenty years in jail, a bit of a harsh sentence, but the fact that he kidnapped someone so popular really worked against him. Jeanette is also convicted and sentenced to five years. The public learns during the trial why Martin kidnapped you and many begin to see him in a sympathetic light. You get some heat for turning him and refusing to do the concert.\n\n\n  You become overrun with guilt which affects the quality of your songs and preferences. After a few years the world turns its attention to another singer, while you start taking pills to deal with everything you're going through. Pills lead to stronger pills and after a few months you have a fatal overdose. Ten years later the movie: \"The Rise and fall of Linda Niles\" premiers in theaters, it gets positive reviews.", "action_results": []}, {"action": "Don't turn Martin in", "result": "You are overcome with enough guilt over refusing to do the concert, you don't need more by having Martin arrested. Besides you figure Martin is already suffering enough You lie to the police saying you don't know the name of the kidnapper and don't remember the house. After a few days you are back home in Los Angeles. A few months later you learn through sources that Martin's sister, Kate has passed away, you anonymously send flowers. \n\n\nAs for your career, the guilt continues to haunt you effecting the quality of your songs and future performances. In a few years the world turns its attention to a new singer and you are labeled a \"has been\". Luckily you've always been good with your money and enjoy a good if obscure life.", "action_results": []}]}]}, {"action": "Escape into the woods", "result": "Who knows what Martin and Jeanette have in store for you or even if they are actually going to let you go. You decide to go into the woods to make your escape. Quietly you walk to the woods edge to avoid waking up Martin, once there you make a run for it. After several minutes of running you slow down to so you don't trip over any roots or hidden tree stumps. You think to yourself once you're on the other side of the woods, it'll be easy to find help.\n\n\nSeveral hours later you come to conclusion that you are most likely lost, you wish you knew how to get back, as Martin and Jeanette don't seem so bad compared to your current situation of being, tired and hungry. At this point it's best to keep walking and eventually you'll be out of here, at this point you're probably one or two towns away from Destiny Hill. Hours turn into days as you are exhausted, starving and your mind is beginning to crack. You are convinced you are in the largest forest in the world or you're walking in circles, it's hard to figure out which theory is right. Days turn into weeks as you collapse in front of a large tree, dying is far less painful then you thought it would be.\n\n\nYour disappearance becomes one of the biggest mysteries of all time. Destiny Hill become a tourist attraction as people come all across the globe trying to solve the disappearance of Linda Niles. Martin and Jeanette move away several years later to small town in Pennsylvania. No one ever suspects them. Twenty years later, lumberjacks find your remains while clearing out the area to make room for office buildings. The mystery deepens.", "action_results": []}, {"action": "Go out the front door", "result": "You decide now is a good opportunity to leave and that the woods are too dangerous so you sneak back inside, into the foyer, and out the front door. Once out you decided to run off as fast as you can after exiting the house.  You run, run some more and keep running, you never stop to look back to see if Martin  is following you. After maybe an hour your legs simply don't have the energy and you collapse on someone's yard. Luckily the owner is home and when they see you on the ground they quickly call the police. When cops get there you explain who you are and they rush you to a local hospital, with full police and FBI protection of course.\n\n\n At the hospital, you are checked to see if you have physical wounds or emotional trauma. Physically you are fine, mentally you're a little out of it, not surprising after what you've through, after a few days you are sent back to your home Los Angeles. The police try find Martin or Jeanette, but  you were in such a rush when you ran out that you can't retrace your steps from where you were found. You never looked back at the house when you escaped that you have no idea what it looks like, let alone the street you were on.\n\n\nThe only info the FBI have to go on is their first names, it takes a while to comb through the hundreds of Martins in Destiny Hill but eventually they figure out which one kidnapped you. It turns out his last name is LaRosa, he owned a theater and has a little sister with terminal cancer. This process takes about a week and by the time the FBI arrive at the house it is long abandoned. They also find out who Jeanette is, turns out her last name is Richards and lives in an apartment, which has also been abandoned. Soon they are put on FBI's most wanted but they are never found.\n\n\nAs for your career, you become a bit withdrawn and it is a very long time before you have meet and greet or anything that involves directly interacting with the fans. At future concerts you have a few more guards around. People notice all of this and you face some criticism, however just as many people defend you considering what you went through, rumors of your kidnapping being a publicity stunt die down, although the occasional internet troll mentions it. In several years things return to the way they were before, and incident just becomes a chapter of your long career.  ", "action_results": []}]}]}, {"action": "Escape", "result": "You realize that you will never get an opportunity like this again, you head to the front door, unlock it and quietly sneak out. Knowing that Jeanette could be home any minute, you decided to run off as fast as you can after exiting the house. You run, run some more and keep running, you never stop to look back to see if Martin (or Jeanette) is following you. After maybe an hour your legs simply don't have the energy and you collapse on someone's yard. Luckily the owner is home and when they see you on the ground they quickly call the police. When cops get there you explain who you are and they rush you to a local hospital, with full police and FBI protection of course.\n\n\nAt the hospital, you are checked to see if you have physical wounds or emotional trauma. Physically you are fine, mentally you're a little out of it, not surprising after what you've through, after a few days you are sent back to your home Los Angeles. The police try find Martin or Jeanette, but  you were in such a rush when you ran out that you can't retrace your steps from where you were found. You never looked back at the house when you escaped that you have no idea what it looks like, let alone the street you were on.\n\n\nThe only info the FBI have to go on is their first names, it takes a while to comb through the hundreds of Martins in Destiny Hill but eventually they figure out which one kidnapped you. It turns out his last name is LaRosa, he owned a theater and has a little sister with terminal cancer. This process takes about a week and by the time the FBI arrive at the house it is long abandoned. They also find out who Jeanette is, turns out her last name is Richards and lives in an apartment, which has also been abandoned. Soon they are put on FBI's most wanted but they are never found.\n\n\nAs for your career, you become a bit more withdrawn and never have a meet and greet again. In fact you rarely do anything that involves interacting directly with the fans. Your future concerts all have a beefed up security presence. At first people sympathize with you, considering what you've been through but over the years the sympathy slowly turns to criticism, this hurts your career, but you're able to handle it.", "action_results": []}, {"action": "Go back to the basement", "result": "If something seems to good to be true then it probably it is. You head back to the basement and back into what has become your room. Jeanette returns a few hours later and comes into you room, holding a box of leftover pizza.\n\n\n\"Thanks for doing the bank statements\" Jeanette said while putting down the box of pizza.\n\n\n\"Martin did most of the work\" You admit.\n\n\n\"Maybe you didn't want Martin to go because you were worried about him, maybe you found working with him romantic\"\n\n\nYou are taken aback by this statement.\n\n\n\"I'm joking\" Jeanette says as soon she notices you're getting uncomfortable.\n\n\nJeanette is obnoxious and Martin is on another world, quite a pair those two are you think to yourself.\n\n\nYou and Jeanette spend time eating the leftover pizza and talking for a bit. You learn Jeanette's father was in the army. After you are done, Jeanette leaves taking the now empty pizza box. You watch some primetime TV and then fall asleep", "action_results": [null]}]}, {"action": "Have Jeanette stay", "result": "You decided to go with their plan, it's not likely the would change it if you wanted them too anyway.\n\n\n\"I'm heading off now\" Martin said as he got off the loveseat and headed towards the front door.\n\n\n\"Aren't you worried he'll get caught?\" You ask Jeanette.\n\n\n\"He'll be fine\" she responded not the least bit concerned.\n\n\n\"So why did Martin kidnap me?\"\n\n\n\"I'm sorry Martin asked me not to tell you, just don't worry, we won't harm you and in a few days you'll be let go and can go home\"\n\n\nYou figure it was no use to keep trying to get info out of her, something about her makes you think she can rather stubborn.\n\n\n\"So to help pass the time, you're going to help alphabetize some bank statements\" Jeanette said in way she already assumed you would agree.\n\n\n\"What do you mean\" you responded quite puzzled.\n\n\n\"Well the old manger of the bank I work at decided it would be fun to have bank statements in random order, so they fired him and if I fix this mess I got a good shot of getting his job, with you I can get it done even faster\"\n\n\nYou decide not to argue partly you're a bit afraid of what would happen if you said no and partly because sitting around doing nothing couldn't be good for your mental health. Jeanette heads off into the foyer and you follow her into a room on the left. It is a kitchen complete with a refrigerator, oven and stove. The appliances seemed fairly modern, although the oven and stove appeared to be a bit dirty. Next to them was a counter and sink, with dishes that needed to be washed. A sliding door on the right lead to the backyard. In the middle of the room was a kitchen table,on it is a box with a bunch of papers.You both sit down at the table as Jeanette takes the box and dumps the papers on the table.\n\n\n\"You know the alphabet?\" Jeanette sarcastically asks you.\n\n\n\"Well if I didn't, now would be a good time to learn\" You reply in equal wit.\n\n\nJeanette smiles briefly at the remark, staying on her good side would be the best course of action.\n\n\nFor next several hours you and her organize the files, it isn't so bad as you and her talk during the process. You learn that her father severed in the army and she lost her mother at a young age. You also learn she and Martin have been going out for two years. Around noon Jeanette orders a pizza, mushrooms and olives your favorite. By late afternoon you and her all done.\n\n\n\"Alright, if you ever get tired as a singer, I'll hire you as my assistant. Jeanette compliments.\n\n\n A short while later Martin returns home and Jeanette greets him with a kiss.\n\n\n\"Everything is all set for tomorrow\" Martin confirms.\n\n\n\"Great, Linda was a valuable help to me\" Jeanette responds in a rather cheerful tone.\n\n\n Martin turns his attention to you.\n\n\n \"Tomorrow I will explain everything to you, for now I'm afraid you have to go back to the basement\"\n\n\nYou comply and head back downstairs, for dinner you have left over pizza and after watching some prime time tv you fall asleep.", "action_results": [null]}]}]}]}, {"action": "Say nothing", "result": "You say nothing, you are way to nervous that saying the wrong thing will angry him and make your situation worse. He also says nothing and the two of you stare at each like 5th graders at their first dance. Finally the man gets the courage to speak up.\n\n\n\"I'm sorry about this, I promise everything will be explained in time, just relax I have no intention of hurting you and by the end of the week, you'll be home\". The kidnapper explains\n\n\nYou stare at the bag on the tray.\n\n\n\"Oh, this is dinner, I got it from this deli called Luca's, the internet said you liked pepperoni calzone and diet soda so I got you that\" The kidnapper says while putting down the tray.\n\n\n\"Now that sofa opens up into a bed and in the morning, you'll meet my girlfriend, it won't be so bad\"\n\n\nThe man quickly left, closing the door behind him and locking it. You wonder if he is afraid of being caught by the FBI or if he is always like that. You pick up the bag on the tray and take out the contents, sure enough it's a pepperoni calzone and a diet soda. Your stomach growls at the sight of the meal, you are too hungry to care if it's poisonous or not and begin wolfing the down the food. After you've finished you put the tray in a corner and pull the bed out of the sofa . As you lay down, the events of the day race through your mind and  you wonder if you'll truly leave this place alive. However you are exhausted and soon you fall asleep.", "action_results": [null]}]}]}, {"action": "Shout for help", "result": "\"SOMEONE HELP\" you shout at the top of your lungs.\n\n\nYou scream several more times until you are too tired to shout. After a few minuets nothing happens and you are convinced either no one heard you or if anyone did hear, they have no intention on helping you. You'd figure that was a long shot but was worth a try. So now what?\n\n\n ", "action_results": [null, null]}, null]}]}]}