{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=29597", "context": "", "first_story_block": "The Kingdom of Vinia is a beautiful, prosperous country that lies on the southwestern coast of the continent Belacia. While many of the surrounding countries frequently go to war with each other, Vinia has been neutral in all conflicts for centuries. Because of this, many refugees and other citizens flee to Vinia to find peace, creating a rich, diverse, and multicultural population. Vinia's captial city of Dialla is also home to the largest, most prestigious college in all of Belacia. \n\n\nBecause of Vinia's prosperity, some other kingdoms have grown envious and show distaste towards Vinia and its people. The most notable of these enemies is the Kingdom of Niravia, Vinia's less affluent neighbor. However, while the relationship between these two countries has always been tense, it has always been been peaceful.\n\n\nYou are Prince Alexander of Vinia, the only child of King Arien and Queen Lianne. \n\n\nYou have grown up in the royal palace in Dialla, Vinia's seaside capital. Your parents believed it important for you to be humble, so they allowed you to go into the city and play with the common children. As a young boy, you often found yourself on the beach with the other children, calling out to the fishermen in the distance and trying to find seashells. As you got older, you and your friends often spent time in the marketplace helping merchants and listening to members of the Royal Guard tell extravagant stories. Occasionally, you would help the students at the college collect materials for their studies. You had a happy childhood.\n\n\nWhen you were of age, your parents asked you what you wanted to be as an adult. You chose to be a soldier. As a soldier, you will join the Royal Guard, where you will be trained in the art of physical combat. You will become strong of body and mind, and those traits coupled with your unmatched sword skills will make you a difficult foe to defeat.", "action_results": [{"action": "The Story Begins", "result": "You are in your bedchamber, fast asleep. You are exhausted from your training, but when a large thump is heard outside your door, you awake.\n\n\nWhat do you do?", "action_results": [{"action": "Call out", "result": "You sit up, annoyed at having been woken up, and call out, \"Who's there?\"\n\n\nThe only response is an eerie silence that fills the air around you. You're beginning to wonder if you had imagined the sound when the door handle begins to turn ever so slowly. \n\n\nDo you...", "action_results": [{"action": "Grab your sword", "result": "You have a bad feeling about what's going on, so you grab your sword from its place next to your bed. You quietly get out of bed and get into a fighting stance, mentally preparing for what may come at you.\n\n\nThe door handle turns completely, accentuated with a small click. Then, the door is pushed open. It gives way to nothing but a pitch black hallway.\n\n\nYou begin to step cautiously toward the door, sword at the ready, when a small dart flies from the darkness and lands in your arm. Another follows, hitting you in the neck. You cry out as your body begins to become numb and your vision blurs. The last thing you remember is falling to the floor. ", "action_results": [{"action": "Wake up", "result": "When you come to, you find yourself in the back of what appears to be a wooden cart with a large piece of cloth placed over top of you. You can hear the sound of the wooden wheels moving through the grass and dirt, the clop of a horse's hooves, and the melodious sounds of a forest. You try to move but find that your hands and feet are tied tightly with rope. There's a piece of cloth shoved in your mouth and another tied around your head (so as to prevent you from spitting out the piece in your mouth).\n\n\nAt first you can't recall why exactly you're in the back of a wooden cart, bound and gagged, but then it all comes rushing back to you; waking up in the middle of the night, being attacked by an unknown intruder. \n\n\nYour mind is reeling, and you can't think of a reason why you would have been attacked in the first place. You don't think you've ever made any enemies, and your kingdom has never been hostile towards another kingdom. You think that maybe someone wanted ransom money, and thought kidnapping you would be the way to get it. That wouldn't be too far fetched. Vinia is arguably the most affluent country in Belacia, after all.\n\n\nJust when you think you're beginning to make sense of what's happened to you, you hear the unmistakable sound of an arrow being shot and a shout from where you presume the driver of the cart would be. There is the thud of a large object falling on the ground, and then the cart suddenly lifts on one side as the wheels of the cart run over the object--presumably the body of your kidnapper.\n\n\n\"Clean work, boys, now let's get that cart!\" you hear a gruff, booming voice yell somewhere not far from you. Was your cart being hijacked?\n\n\nYou hear multiple voices saying calming things to the horse pulling the cart and it slowly comes to a halt. The same voice as before, closer now, says, \"Alright, let's see what this poor sod had with him.\"\n\n\nYour cart had definitely just been hijacked.\n\n\nThe cloth that is covering you is abruptly pulled off of your body, and you wince at your eyes' sudden reintroduction to sunlight. When your eyes adjust, you see a group of five or so men standing over you. They all look thuggish and dirty. They look down at you in confusion.\n\n\n\"What's this?\" the same voice as before, most likely the leader of the group, says. The man is the largest and dirtiest of all present. \"Who are you?\" he asks you. \n\n\nYou...", "action_results": [{"action": "Try to talk", "result": "You attempt to say something, but the cloth in your mouth prevents you from making any intelligible sounds. \n\n\n\"Oh, right,\" the leader says, as if he's just noticing the fact that you're gagged and can't answer his question. He grabs the cloth covering your mouth, allowing you to spit out the cloth in your mouth. Your mouth is dry, your throat sore from thirst. \"Now then, who are you?\" he asks.\n\n\n \n\n ", "action_results": [{"action": "Lie", "result": "\"My name is Alexander, I'm a knight in training from Vinia,\" you tell them. You don't think it would be smart to tell them who you really are. Just in case.\n\n\n\"Well, Alexander,\" the leader says, \"how'd you find yourself in the back of some guy's cart? Got a debt you forgot to pay?\"\n\n\n\"No, I have no idea what's going on. He just attacked me!\" You tell them. Some of the men nod in understanding. \n\n\nThe leader seems to feel sorry for you. \"Well, why don't you come with us back to ou camp? We can get you fed and watered.\"\n\n\nYou...", "action_results": [{"action": "Go with them", "result": "\"I think I'll take you up on that offer,\" you tell the leader. \"By the way, what's your name?\"\n\n\n\"The name's Jarven,\" he tells you, puffing up his chest in an attempt to look more grand. \n\n\n\"No title?\" you ask.\n\n\n\"Nope, just Jarven,\" he confirms. \"My boys and I roam this forest and take what we need to survive.\"\n\n\nWhen Jarven and \"his boys\" begin to walk back into the forest, you follow. You figure it isn't such a bad idea to get some food and water, and then you can try to figure out where you are and why you're there.\n\n\nThe camp doesn't end up being that far of a walk, which you're thankful for. It's situated in a decently sized clearing, with about ten tents surrounding the perimeter--one of which looks larger and nicer than all the others--and has a large bonfire in the middle. There are about ten other men scattered around the camp when you arrive, a few of them playing a card game and the others polishing some swords. It's not the standards that you're used to, but it'll do. \n\n\n\"Everybody,\" Jarven announces,\"this\"--he motions to you--\"is Alexander. He'll be joining us for a little bit. Play nice.\" The men acknowledge their leader's words with a few noncommittal grunt and nods, but for the most part they ignore your presence. Jarven claps you on the shoulder and says, \"Now, let's get you some food and drink, boy.\"\n\n\nJarven leads you to the largest tent, which, although nicer than the others, is still pretty shabby. The inside has a large carpet covering the ground, a cot on the far left side, a small table next to the bed, and a circular dining table to the right. There's a large chest at the end of the bed. \"Go on, have a seat,\" Jarven tells you, waving in the direction of the table. You do as he says. \"I'll be right back.\"\n\n\nYou are then left alone in Jarven's tent. \n\n\nYou...", "action_results": [{"action": "Look around", "result": "With Jarven gone, you figure it'd be a good time to snoop around a little and get up from the table. \n\n\nYou walk towards the chest at the end of the cot and try to open it, but it's locked. Upon further examination, you see a few things on the bedside table. There's a rolled up piece of paper, a few gold coins, a candle, and an empty cup. \n\n\nYou're about to inspect these things further when you hear someone approaching the tent, so you quickly return to your seat at the table.\n\n\nWhen Jarven returns, he does so with a loud, \"Food's ready!\" and places a bowl of stew and a cup of something that might be water in front of you. It smells good, so you dig in right away. \n\n\n\"So, Alexander,\" Jarven says, taking a seat across from you, \"you really from Vinia?\"\n\n\nYou finish chewing your food before answering. \"Yes,\" you tell him, \"I live in Dialla.\"\n\n\n\"Hm. Then why are you here?\" He asks.\n\n\n\"I told you before, the person driving the cart just kidnapped me one night. I don't even know where I am.\"\n\n\nJarven laughs a big, bellowing belly laugh. \"Well you're not in Vinia, I can tell you that much.\"\n\n\nYou sigh, getting somewhat annoyed at the fact you're not getting a straight answer. \"So then where am I?\"\n\n\n\"You're in Niravia.\"\n\n\nYou're taken aback. \"Niravia?\" you ask. You feel slightly sick; Niravia is known for it depravity and poverty, and many of the knights back in Dialla have told you of the things they've experience in the country.\n\n\n\"The one and only.\" Jarven chuckles when he sees the expression on your face. \"Aw, come on, boy, it's not that bad. I'm sure it's not as nice as Vinia, but--\"\n\n\n\"How far are we from the border?\" you cut him off. \n\n\nHe has to think for a moment, but he finally tells you, \"Twenty kilometers, about.\"\n\n\nYou sigh in relief. That's not far enough too far. And Vinia is relatively small country, stretching maybe one hundred kilometers across. It's not an impossible distance to travel on foot, should you choose to do so. \n\n\n\"I wouldn't get my hopes up if I were you, boy,\" Jarven says. \"The journey to the border isn't an easy one. You'd probably die.\"", "action_results": [{"action": "Stay with the bandits", "result": "\"I think you may be right,\" you tell Jarven. He looks pleased at your answer. \"I think I'll stay here for a little while, build up my strength some more before I try to travel home.\"\n\n\nThose were your plans, but you never make it back to Dialla. After about a month of living with the bandits, the group is attacked by some military scouts. In the chaos, you manage to escape death by the sword, but you run into a pack of feral wolves not far from the fighting. This is where you meet your end. ", "action_results": []}, {"action": "Travel to the border", "result": "\"That's a risk I'm going to have to take,\" you tell Jarven. He sighs. \n\n\n\"I guess I should have expected that, there's no reason for you to stay here with us. Have to say I was hoping you would, though, you look like you're a good fighter. Probably could've used you.\"\n\n\n\"Thank you for everything you've done for me,\" you say as you finish up your stew. \"I have no clue what would have happened if you and your men hadn't killed the person driving that cart I was in.\"\n\n\n\"You'd probably be dead!\" He laughs. You don't really know why he finds the prospect of your death so funny. Jarven then gets up and walks over to the chest at the end of his cot. \"You haven't caused any trouble, so I'll give you some things to take with you. Hopefully they'll help.\" He then pulls a key out of his pocket and unlocks the chest. You get up and walk over, standing next to him. \n\n\n\"Let's see...\" he says to himself. \"You'll need...a sword...and a canteen...and a map...and some money...and a knapsack...that should be enough.\" As he says each word, he pulls the corresponding item out of the chest. You're shocked by the man's generosity, but you don't question it. He stands up, holding the canteen, and turns to walk out of the tent. \"I'll go grab you some food and fill this up with some water.\"\n\n\nYou pick up the things Jarven had laid out for you and begin packing your knapsack. He returns with what he promised and gives the food and canteen to you. \n\n\n\"All set?\" he asks as you secure the sword to your belt. It's not as nice as the ones you have in Dialla, but it'll work if you need to defend yourself. You nod at him and he leads you out of the tent. He pulls a crumpled up piece of paper from his pocket and unfolds it, showing that it's a map. \n\n\n\"The map you have is an exact replica of this one,\" he tells you. \"This,\" he says as he points at a small triangular marking about a third of the way from the left edge of the page, \"is this camp. You need to go west to reach Vinia's border. Depending on how you go, you might hit Sirra\"--he points at a house marking in between the camp and the edge of the page--\"where you can stay at the inn. It's kinda run down, but it's better than spending the night in the woods.\"\n\n\n\"And how exactly do I reach Sirra?\" you ask. \n\n\n\"There's a path that goes straight to the border--I'll bring you there, don't worry--but it forks a little while down. If you go on the more northern route then you'll reach Sirra. The other one's a little faster, but there's no guarantee you'll find someplace to sleep. There're some houses along that way, though. Maybe someone will be feelin' hospitable.\"\n\n\nIt's a lot to take in, and you hope you'll remember all the information.\n\n\n\"Now then, let's get you to the road,\" Jarven says jovially, clapping you on the shoulder. He then takes you out of the camp, leading you back the way you had walked earlier. You emerge on a road, the cobblestones worn down by years of use. It was mostly just grass, really, but it was still a clear path that you could easily follow, and for that you were thankful. Jarven grabs your shoulders and turns you so you're facing one way on the path. \n\n\n\"West,\" he says, and gives you a small push. You take the hint and begin walking. As you leave him behind, you hear Jarven shout, \"Don't die out there, kid!\" You don't intend on doing so, but at least it makes you laugh. You wave at him without turning around, your mind set on one thing: getting back to Vinia. \n\n\n \n\nYou've only been walking for a couple of hours when the sun starts to set. You're starting to get hungry again and there's a dull ache in your feet; the rough terrain was doing you no favors.\n\n\nBut you push forward for another fifteen minutes or so, at which point you can see the fork in the road Jarven had told you about. As you approach, you see what looks to be a sign indicating what lies in each direction, but as you get closer you see that the paint is too faded to make out. \n\n\nYou take a swig of water from your canteen and think. The sun is setting quickly, as it always does this time of year, and the forest is quickly coming alive with foreign noises. You need to find someplace to stay for the night--the sooner the better.\n\n\nDo you go to the left or right? ", "action_results": [{"action": "Left", "result": "You go with your gut and take the left path.\n\n\nWithin half an hour, the forest is completely dark. The only light is that coming from the full moon overhead. As you walk, you look up at the sky and see it's littered with hundreds of stars, twinkling like small diamonds. You can't see as many stars in Dialla, what with all of the lights in the city. As beautiful as the sight is, you know you'll enjoy it more when you're safe.\n\n\nHowever, this does not happen. Having taken the left path, you have unintentionally avoided the town of Sirra, and are now stranded in the forest overnight. You grow uneasy as you push forward, the strange sounds of the forest growing louder and louder with every step you take.\n\n\nYou think you're saved when you spot a small house along the road, and you eagerly knock on the door. An older woman opens it, and looks quite concerned by your situation, so she invites you in. She gives you a hot meal and drink, which you happily accept, but it will be your last meal. Unbeknownst to you, the woman was only interested in the supplied you carried and so put poison in your drink. The last thing you see before your vision fades is the fresh, hot meal before you. \n\n\nThis is where you meet your end.", "action_results": []}, {"action": "Right", "result": "You decide to take the path to the right. \n\n\nWithin half an hour, the forest is completely dark. The only light is that coming from the full moon overhead. As you walk, you look up at the sky and see it's littered with hundreds of stars, twinkling like small diamonds. You can't see as many stars in Dialla, what with all of the lights in the city. As beautiful as the sight is, you know you'll enjoy it more when you're safe.\n\n\nYour perseverance pays off, because a few minutes later you can see the lights of a town in the distance. You begin running down the path, eager to reach a place where you can relax a little. \n\n\nThe town--Sirra, you presume--isn't large, but it's big enough to have a few shops and an inn. There are a decent amount of people still walking the streets, and you think that Sirra must get a lot of people passing through it since it's so close to the border. \n\n\nYou find the inn easily enough--it's by far the largest building in the town, and most of the people on the streets are going to or coming from it. \n\n\nYou walk in and are met with an environment far different than that found in the inns in Dialla. The room is dark and smoky with a bard at the end playing a low tune. The room is filled with people, but the conversation isn't loud and boisterous, it's almost like a quiet hum. There's a bar to the right that spans the entire side of the building, and stairs directly to your left, most likely leading to the rooms upstairs. \n\n\nYou walk over to the bar and sit down at one of the stools. After a moment one of the workers--a stout, middle aged man with a large beard--comes over to you. \n\n\n\"What'd you like?\" he asks. He's cleaning some glasses and doesn't seem particularly interested in you. You think he might be the barkeep. \n\n\n\"A meal and a room, please,\" you tell him. He laughs.\n\n\n\"Not from around here?\" \n\n\n\"Excuse me?\" You don't think you did anything that would shout to the world that you're not from the area, but this stranger obviously thinks otherwise.\n\n\n\"You're too polite to be from Sirra,\" he chuckles. \"But never mind that--tonight there's either rabbit stew or meat pie. What do you want?\"\n\n\nYou had stew earlier, so you go with the meat pie. The barkeep goes through a door at the far end of the bar--the kitchen, most likely--and comes back a moment later with your food. \n\n\nYou...", "action_results": [{"action": "Eat in silence", "result": "You dig into your food eagerly. The barkeep seems to catch on that you're not in the mood for talking and leaves, going to tend to another customer.\n\n\nThe food is good, and it fills you up quickly. When you're finished you wave the barkeep back over and hand him a few coins. \n\n\n\"How much for the room?\" you ask.\n\n\n\"Fifteen,\" he tells you. You hand over the money. He counts it, looking satisfied. \"You get room twenty-four. Second floor on the left.\" With that he leaves and goes into the kitchen. You put your remaining money back in your pocket and make for the stairs. Before you can reach them, however, a large, brutish man steps in front of you and looks down at you menacingly. You're not exactly a small person, and yet this man towers over you. \n\n\n\"Can I help you?\" you ask. You really just want to get to your room and go to sleep, not be bothered by some giant.\n\n\n\"I don't like your face,\" he grunts. You're taken aback a little, because no one's ever insulted you like that before. \n\n\nYou...", "action_results": [{"action": "Fight him", "result": "You don't take kindly to insults, so you throw the first punch, landing a solid blow to the brute's neck.\n\n\nHe's stunned momentarily, but his fist soon slams into your jaw. You're knocked back by the force of his blow, and you crash into one of the tables behind you, your head colliding with a now-shattered plate. You feel the shards cut into your face, but pay it no mind. You get up and try to ready yourself for the fight, but the barkeep is suddenly in front of you and there are a few men holding back your attacker. \n\n\n\"Get him out of here!\" the barkeep yells. The men comply, dragging the struggling brute out of the inn. The barkeep turns to you and asks, \"Are you alright?\"\n\n\n\"Yeah, I'm fine,\" you tell him, but the entire side of your face is throbbing. You know you'll be fine, though; you've had worse injuries than a bruised jaw before. \n\n\n\"Head on up to your room, I'll have one of the staff bring up some water and a washcloth so you can clean those cuts.\"\n\n\nYou nod and head up the stairs, the old wood creaking with every step you take. You go up to the second floor and take the second door on the left, just like the barkeep had told you. The room is small, with a bed and a side table, a small dresser in the corner, and a mirror hung on the wall above that dresser. A dim light comes from the candle on the bedside table. You place your bag on the bed and then look at yourself in the mirror. The side of your face is already starting to swell, and there are cuts on your temple and cheek from the plate you fell on. Your nose is bleeding, but you don't think it's broken. \n\n\nA knock on the door pulls you away from the mirror. You open it and a man is standing there, a large bowl of steaming water in his hands and a washcloth hung over his arm. He's probably around your age, with close-cut dark hair and equally dark eyes. He's smiling, but it doesn't quite look genuine. \n\n\n\"For you,\" he says, extending the bowl out to you. \n\n\n\"Thank you,\" you respond, taking the bowl from him. You walk it over to the dresser and put it down. When you turn around, you see he's standing right behind you, although you never heard him enter. He holds out the cloth to you. He's got the same empty smile as before, and up close you notice how hollow his eyes look as well. You begin to feel uneasy and want him to leave. Luckily, when you take the cloth from him he turns and leaves your room, closing the door behind him. \n\n\nWeird. \n\n\nYou take your time washing your wounds, wanting to make sure they don't get infected, before collapsing on your bed. All at once, your fatigue and the stress of your situation hit you. You've been kidnapped, rescued by bandits, and walked god knows how long--all in one day. You're grateful for the adrenaline that must have kept you going, but now that it's worn off your limbs feel achy and tired, your eyelids heavy. Whether you wanted to or not, you slowly drift off to sleep...", "action_results": [{"action": "Wake up", "result": "You're awakened by a knock on your door. You're disoriented, having woken up suddenly, and you struggle to clear your mind of sleepiness. The room is dark, the candle on the bedside table had extinguished on its own. There's another knock, a little more urgent this time, so you stand, stretch, and walk towards the door.\n\n\nWhen you open the door, you find the same man who had delivered your water the night before. You immediately feel uncomfortable in his presence. \n\n\n\"Sorry to wake you, but I have an urgent question,\" he says. \n\n\n\"Do you have any idea what time it is?\" you demand. You were still exhausted, your body weary, and you wanted to go back to sleep.\n\n\nThe man smiled. The expression looked out of place on his face. \"Don't worry, it'll take but a moment.\"\n\n\nYou're about to ask what he has to ask you when he suddenly pushes you back into your room with far more force than you thought a man as scrawny as he would be able to muster. You stumble back away from the man while he closes and locks the door to your room. \n\n\n\"What are you doing?\" you shout. The man doesn't answer you, he simply pulls out a knife. You groan; is he an assassin too?\n\n\nYou...", "action_results": [{"action": "Try to talk to him", "result": "\"Hold on--\" you're cut off by the dagger that now finds itself in your throat. You fall to your knees, bleeding out quickly as your vision begins to fade.\n\n\nThis is where you meet your end.", "action_results": []}, {"action": "Fight back", "result": "Recognizing the danger in front of you--and remembering what happened during your last encounter with an assassin--you get into a fighting stance. You see your sword in your periphery and wonder if it would be smart to try to grab it, or if you should just try to use your hands.\n\n\nYou...", "action_results": [{"action": "Grab your sword", "result": "You figure you'll have a better chance of surviving if you have your sword, so you dash across the room towards where it lies with the rest of your supplies. However, the assassin sees what you're trying to do and jumps at you. You move to the side barely in time and make it to the dresser, where you pick up your sword. \n\n\nYou turn to face your attacker, who is recovering from his fall. \n\n\nYou...", "action_results": [{"action": "Charge", "result": "You want to kill this man and get it over with, so you charge at him, sword raised. \n\n\nYou swing down powerfully where the assassin is, but at the last second he moves out of the way and you hit the floor. You pull your sword up and prepare for another attack, but it's too late. You've left your side and back completely open and the assassin takes advantage, stabbing you once in the side and again in the back.\n\n\nYou fall to the ground as you cry out in pain. The last thing you see before you die is the assassin's empty smile.", "action_results": []}, {"action": "Take a defensive stance", "result": "Knowing assassins are the masters of dishonest fighting, you get into a defensive stance and wait for the man to attack you. You had been trained how to properly defend yourself back in Dialla, so you're feeling quite good about your chances, even if you don't know how the enemy fights.\n\n\nThe assassin regains his footing and prepares to attack, but you're ready for whatever he can throw at you. When he stabs at you you move out of the way and try to counter his attack, but he's fast and is able to move out of the way as well. The two of you do this dance until you are both exhausted, each getting a few good hits in on the other. \n\n\nYou're thinking you've reached a stalemate when the assassin suddenly jumps at you again, knife in the air. You muster up all of your energy and jump out of the way, and then you use your momentum to swing the hilt of your sword down on the assassin's head, knocking him out momentarily and making him fall to the floor. You kick the man's dagger away from his body and stand over him. \n\n\nYou...", "action_results": [{"action": "Interrogate him", "result": "\"Who are you? Why are you trying to kill me?\" You shout at the assassin. You've bested him, so now it's\ntime to get some answers. He looks up at you, his face vaguely angry, and remains silent. \"Answer me!\" you demand.\n\n\n\"Silence in life, silence in death,\" the assassin spits at you. \n\n\n\"Who do you work for?\"\n\n\n\"Silence in life, silence in death.\"\n\n\nYou sigh; the guy's not going to give you anything. \n\n\nYou...", "action_results": [{"action": "Incapacitate him", "result": "Despite your frustration, you see no need to kill the assassin. He looks up at you, and furiously says, \"Silence in life, silence in death.\" When you hear this, you find it funny. \n\n\n\"You're not dying today,\" you say. You kick him in the head, hard enough to make him pass out, but not hard enough to kill him. \n\n\nIt's then that you hear a furious knocking on the door. You walk over and unlock it before opening it, revealing the barkeep and a few other workers standing in the hallway, all with worried looks on their faces. \n\n\n\"What the devil is going on in there?!\" the barkeep shouts. When he looks behind you and sees the man lying on the floor, the color drains out of his face.\n\n\n\"He tried to kill me,\" you tell him, and he drags his eyes away from the body to inspect your face. He looks as though he is unsure whether to trust you or not. \"All of you, go back to your rooms,\" he tells the people behind you. As they wonder off, you wonder how long they've all been standing out there. The barkeep comes into your room and closes the door. \n\n\n\"What happened?\" he asks. \n\n\n\"I think he's an assassin, he came to my door and ambushed me,\" you reply.\n\n\nThe barkeep rubs his face, obviously overwhelmed by what's happening. \"He was a strange one, I wouldn't be that surprised if he was a shady character.\"\n\n\n\"Unfortunately I couldn't get any information out of him. All he said was 'silence in life, silence in death.'\" At these words, the barkeep froze. \n\n\n\"He said that?\" he asked, looking panicked. \n\n\n\"Yes?\" \n\n\nThe barkeep sat on the edge of the bed, looking like he very much wanted all of this not to be happening. \"That's the motto of the Niravian Crows.\"\n\n\n\"What does that mean? What are the Niravian Crows?\" You asked. \n\n\n\"The assassins that cater to the crown.\"\n\n\n\"Oh.\" You couldn't make sense of this. Why would the king of Niravia target you? There had been no recent disagreement between Vinia and Niravia, nothing that would prompt an attempt to take your life. \"Why would they want to kill me?\" you say allowed to no one in particular. \n\n\n\"Well who are you? You someone important?\" the barkeep asks. You're contemplating how to answer when he continues, \"It doesn't matter. You need to get out of here, though.\"\n\n\nYou look out the sole window in the room and see that the sky is getting brighter. \"Is there any way I can travel to the border? Fast?\" you ask.\n\n\nThe barkeep thinks for a moment before responding, \"There might be a merchant or someone with a cart, or a horse. That'd get you there quick.\"\n\n\n\"I'll look for someone then. Thank you.\" \n\n\n\"Don't mention it.\" The barkeep waves you off and stands up. \"If you want, have some breakfast before you go. But I'd get out of here as soon as possible if I were you. Just make sure to tell me when you go so I can get someone to clean up the body.\" With that, he leaves.\n\n\nYou...", "action_results": [{"action": "Have breakfast", "result": "You figure you should have some food before heading out--you don't really know when your next chance to have good food is--so you gather up your things and head downstairs. There are a few people passed out around the room, but for the most part the place is empty. You think it looks different during the day, the open windows bringing in the early morning light, making the room look larger and more open. Some of the staff are cleaning off tables and preparing for the day, and the barkeep is behind the bar, cleaning dishes.\n\n\nYou go up to the bar and take a seat. \"What's for breakfast?\" you ask.\n\n\n\"Eggs and bread,\" he replies. \n\n\n\"I'll have that, then.\" The barkeep walks back to the kitchen and emerges a few minutes later with your food. Upon smelling the delicious food you realize how much the fight with the assassin took out of you, so you dig in. \n\n\n\"Listen,\" the barkeep whispers, leaning in, \"there's a farmer waiting for you by the edge of the town. He's got a large cart that you can ride in. He's not going all the way to the border, but he'll get you there faster than if you were just walking.\"\n\n\nYou nod. \"Okay. Thank you.\"\n\n\n\"Don't mention it,\" he says. \"He wants to leave soon, though, so hurry up and eat.\" \n\n\n\"Wait,\" you say, \"Could you tell me more about the Niravian Crows?\"\n\n\nThe barkeep sighs. \"There's not much more to say about them. They're assassins, hired by the crown. They do whatever they're told, even if it means they'll die.\" He looks at you for a moment, thinking. \"You don't have assassins in Vinia?\"\n\n\n\"We don't really have a need for them,\" you say. \n\n\nThe barkeep chuckles. \"I doubt that, but if you say so.\" You're about to ask what he means when he says, \"You should head out now, don't want that farmer to leave without you.\"\n\n\n\"Oh, alright. Thank you for everything, really.\" You finish up the last of your food and stand, picking up your bag and slinging it over your shoulder. You don't know how you've gotten so lucky, really, first with Jarven and his bandits and now with the barkeep. You thought Niravia was some depraved place, but the people you've encountered have been kind, generally.\n\n\nYou wave a final goodbye to the barkeep before leaving the inn.", "action_results": [{"action": "Head out", "result": " You leave the inn and are thrown back into the world that is Niravia. Sirra looks much different in the daylight. There are mothers and children running around the streets, some merchants set up along the sidewalk trying to sell their wares. People walk to their work, chatting with each other jovially. The sun, although just having risen, illuminates the streets. Despite the fact the town looks nothing like Dialla, it reminds you of your beloved city. The energy of the town lifts your spirits and encourages you to move toward the edge of the town.\n\n\nAs the buildings get more and more spaced out and the people become more sparse you see a man leaning against a cart with two bulls hitched to it. When you get closer, the man calls out, \"Are you the kid I'm supposed to be drivin'?\"\n\n\n\"Yessir,\" you tell him. The man is older, with a weathered look about him.\n\n\n\"Alright, hop in front,\" he tells you, climbing onto the seat on the front of the cart. He grabs the reigns in his hands and waits until you're settled next to him to leave. The bulls aren't fast creatures, but you know they're faster than you. Plus, you won't get tired from walking. \n\n\n\"I'm only following the main road for so long,\" the farmer tells you. While the path leading to Sirra had been shrouded in trees, the path was now winding through farmlands, flat and spreading for as far as the eye could see. You occasionally spot workers in some of the fields. \"I'm going north, to Terrid--it's a small town on the way to the capital--so you're gonna have to walk the little bit back to the border. It's not too far, though. You can make it before sunset.\"\n\n\n\"Okay.\"\n\n\nThe farmer looks at you. \"So tell me about yourself, boy. Got any reason for going to Vinia? Or maybe just visitin'?\"\n\n\n\"I live in Dialla,\" you tell him. \"I'm training to be a soldier. Some...unfortunate circumstances lead me to Niravia.\"\n\n\nThe farmer laughed. \"I can tell ya don't wanna talk about it, it's alright, boy. But a soldier? That's excitin'!\"\n\n\n\"It is,\" you give a small laugh yourself, \"we're trained in defending ourselves and the people, and we get to patrol the city. I've met many colorful characters.\"\n\n\n\"I've always wanted to go to Dialla,\" the farmer confesses. \"My wife went when she was little, once--said it was amazing. I've never even seen the sea.\"\n\n\n\"Doesn't Niravia touch the sea? In the south?\"\n\n\n\"Yeah, but everyone says the beach there is rocky and ugly, nothin' compared to Dialla, I'm sure.\"\n\n\n\"Not many places can compare to Dialla, I'm afraid,\" you say. \"You should visit sometime, we love having guests in the city.\"\n\n\nThe farmer smiled. \"Maybe in the winter, when I don't have to care for the farm. I'd have to find someone to watch the animals, though. I won't ask my neighbor, that's for sure. He's a prick.\"\n\n\nYou laugh. \"I'm sure you'll be able to find someone.\"\n\n\nThe rest of your ride with the farmer continues in the same fashion, simply talking about whatever crossed your minds. When you reach the small fork in the path, the farmer brings the cart to a stop. \n\n\n\"Well, this is where we part ways,\" he says. \"Go ahead and take a few vegetables for your travels. Wouldn't want ya to starve, would we?\" he chuckles. \n\n\n\"I couldn't--\"\n\n\n\"Go ahead, boy. You can repay me when I come to Dialla. What's your name? I'll ask for ya at the guards' barracks.\"\n\n\n\"Just ask for Alexander,\" you tell him, going around to the back of the cart where the farmer's wares are. All of the fruits and vegetables look delicious, but you don't want to take too much, so you just grab a nice green apple and a ripe tomato. \n\n\n\"Alright, Alexander, you'll be seein' me in the future!\" the farmer yells as he takes off down the north road. You wave before continuing on the main road. The sun is high in the sky, so you figure it must be around noon.\n\n\nYou walk down the seemingly endless path, the sun beating down on you with every step you take. Not long into the journey you become hungry and stop for some food, sitting on the side of the path as you munch contently on the food you received from the farmer. When you've finished, you stand up and continue on your way. \n\n\nYou feel like you've been walking for years--your feet ache and your mind is weary with doubt--before you see your goal: the border. The border of Vinia is marked very clearly by a ten meter high stone wall. All the fatigue you had suddenly left your body and you began running for the gate at the end of the road, giddy as a child running to play. \n\n\nWhen you reach the large gates, the three guards stationed there look concerned at your happiness.\n\n\n\"Can we help you?\" one of them asks. He's the shortest of the three. \n\n\n\"Yes,\" you say, catching your breath, \"I would like to pass through to Vinia, please.\" Upon hearing you speak, the guards seem to lighten up a little. \n\n\n\"You're from Dialla, aren't you?\" one of them--the youngest--asks. You smile and nod, knowing they must have picked up on the slight accent all native Diallans have. You're shocked by how happy you are to be around your own countrymen again. \n\n\n\"Open the gate!\" the last guard--a woman--shouts, and a moment later the large gate leading into Vinia is lifted, granting you access back to your beloved land. \n\n\n\"Lucky for you, there's a group of guards heading back to Dialla tonight. I'm sure they'd be happy to take you along,\" the short one tells you, pointing you towards the barracks located along the stone wall. There's a large carriage next to it, the horses not yet hitched. You sigh in relief. \n\n\n\"Thank you,\" you tell the guards. \n\n\nThe guards lead you to the barracks, where you are given a fresh meal and new clothes before being loaded on the carriage back to Dialla. You chat with the other soldiers on the ride before letting yourself drift off to sleep, dreaming of the beautiful land you have been returned to. Before you know it, you are back in Dialla. ", "action_results": [{"action": "Fast forward", "result": "You have been back in Dialla for about a week, and your parents have not let you out of their sight since your return. With your help, they plan to take action in some form against Niravia. \n\n\nWhat do you do?", "action_results": [{"action": "Send spies to investigate", "result": "You decide to be cautious and utilize the spies you have at your disposal.\n\n\nYou dispatch multiple agents to Niravia--some working in the royal palace, some living in the capital city--and wait for their feedback. It only takes a few weeks for a report to be sent to you. It claims that spies have found documents sent by the King of Niravia ordering the kidnapping and subsequent public execution of you. \n\n\nYou and your parents barely have time to process this information when it is discovered that one of your spies has been discovered and Niravia's army marches towards the border. Now knowing that the Niravian crown planned on assassinating you to deplete your country's morale, your soldiers and citizens are filled with a passionate desire to crush this threat. All who can help in any way they are able to, so your army is well supplied and strong when it meets Niravia's. \n\n\nVinia easily prospers over Niravia. The battles are violent, but the Vinian army spares as many lives as possible--it's simply their nature. When the royal family is captured, however, the king is executed and the rest of the family banished. You personally take control of Niravia and all of its assets, and with the guidance of your parents you help make the country prosperous and peaceful, although it still has its rustic charm.\n\n\nThe end.", "action_results": []}, {"action": "Send a letter to the Niravian royalty", "result": "You decide to take the diplomatic route and send a polite inquiry to the Niravian crown. \n\n\nWithin a few weeks, you receive your reply--in the form of an army marching towards Vinia. While they didn't actually tell you they planned on killing you, you think this is a pretty clear implication of their intentions, so you rally your own troops. Now knowing that the Niravian crown planned on assassinating you to deplete your country's morale, your soldiers and citizens are filled with a passionate desire to crush this threat. All who can help in any way they are able to, so your army is well supplied and strong when it meets Niravia's. \n\n\nVinia easily prospers over Niravia. The battles are violent, but the Vinian army spares as many lives as possible--it's simply their nature. When the royal family is captured, however, the king is executed and the rest of the family banished. You personally take control of Niravia and all of its assets, and with the guidance of your parents you help make the country prosperous and peaceful, although it still has its rustic charm. \n\n\nThe end.", "action_results": []}, {"action": "Send an army to seize control of Niravia", "result": "You throw caution to the wind and order troops to seize control of Niravia. \n\n\nVinia easily prospers over Niravia, having taken them by surprise. Vinia hasn't taken part in any battle in centuries, after all. Most of the Niravians don't even put up a fight, and so many innocent lives are spared. When the royal family is captured, the king is executed and the rest of the family is banished. You personally take control of Niravia and all of its assets, and with the guidance of your parents you help make the country prosperous and peaceful, although it still has its rustic charm.\n\n\nThe end.", "action_results": []}, {"action": "Lead your troops into battle", "result": "You throw caution to the wind and lead troops to into Niravia. \n\n\nBoth countries are largely unprepared for battle, causing this new war to last for months. Many lives are lost on both sides. Unfortunately, this includes yours. You're leading your troops into the capital of Niravia when an arrow land square in your chest, knocking you off your horse and causing you to be trampled by your troops. In the end, Vinia does prosper and seizes control of Niravia. Your parents get rid of Niravia completely, opting to simply make it part of Vinia, and proceed to reform the lawless lands. Soon after your death they adopt a baby boy and name it Alexander in your honor. \n\n\nThe end.", "action_results": []}, {"action": "Forgive and forget", "result": "Much to the dismay of your parents, you decide not to hold a grudge about this whole thing. You made it back safely, after all. \n\n\nA few weeks later, however, you discover that Niravia's army marches towards the border. Your troops are completely unprepared for the invasion, and so Niravia easily overpowers Vinia with its brutality. You and your parents are devastated by the loss of many innocent lives, so you decide together to sacrifice yourself so that this war might end. You are beheaded by the King of Niravia's own sword. Vinia is then plunged into a state of despair, and falls into ruin when the Niravian royalty does not know how to properly run the country.\n\n\nThe end.", "action_results": []}, {"action": "Assassinate the King of Niravia", "result": "You decide to get even with the King of Niravia. \n\n\nDespite the fact you have no royal assassins like the Niravian Crows, you know you can be deceptive if you want to be. You send a letter to Niravia inviting the royals and nobles to a large peace-making ball in Dialla under the guise that you and your parents want to improve relationships with Niravia and forget all that's happened in the past. \n\n\nLuckily the bait is taken, and you have a spy poison the King of Niravia's wine at the end of the night, and he is found dead the next morning. You then banish the rest of the royal family and you personally take control of Niravia and all of its assets. With the guidance of your parents, you help make the country prosperous and peaceful, although it still has its rustic charm.\n\n\nThe end.", "action_results": []}]}]}]}, null]}, {"action": "Kill him", "result": "You have no patience or mercy for the man on the floor in front of you, and you know that if you do not kill him now he will most certainly come after you. With little hesitation, you bury your sword in the assassin's chest, and after you do so, he lets out a weak \"Silence in life, silence in death,\" before the life leaves his body. \n\n\nIt's then that you hear a furious knocking on the door. You walk over and unlock it before opening it, revealing the barkeep and a few other workers standing in the hallway, all with worried looks on their faces. \n\n\n\"What the devil is going on in there?!\" the barkeep shouts. When he looks behind you and sees the man lying dead on the floor, the color drains out of his face.\n\n\n\"He tried to kill me,\" you tell him, and he drags his eyes away from the body to inspect your face. He looks as though he is unsure whether to trust you or not. \"All of you, go back to your rooms,\" he tells the people behind you. As they wonder off, you wonder how long they've all been standing out there. The barkeep comes into your room and closes the door. \n\n\n\"What happened?\" he asks. \n\n\n\"I think he's an assassin, he came to my door and ambushed me,\" you reply.\n\n\nThe barkeep rubs his face, obviously overwhelmed by what's happening. \"He was a strange one, I wouldn't be that surprised if he was a shady character.\"\n\n\n\"Unfortunately I couldn't get any information out of him. All he said was 'silence in life, silence in death.'\" At these words, the barkeep froze. \n\n\n\"He said that?\" he asked, looking panicked. \n\n\n\"Yes?\" \n\n\nThe barkeep sat on the edge of the bed, looking like he very much wanted all of this not to be happening. \"That's the motto of the Niravian Crows.\"\n\n\n\"What does that mean? What are the Niravian Crows?\" You asked. \n\n\n\"The assassins that cater to the crown.\"\n\n\n\"Oh.\" You couldn't make sense of this. Why would the king of Niravia target you? There had been no recent disagreement between Vinia and Niravia, nothing that would prompt an attempt to take your life. \"Why would they want to kill me?\" you say allowed to no one in particular. \n\n\n\"Well who are you? You someone important?\" the barkeep asks. You're contemplating how to answer when he continues, \"It doesn't matter. You need to get out of here, though.\"\n\n\nYou look out the sole window in the room and see that the sky is getting brighter. \"Is there any way I can travel to the border? Fast?\" you ask.\n\n\nThe barkeep thinks for a moment before responding, \"There might be a merchant or someone with a cart, or a horse. That'd get you there quick.\"\n\n\n\"I'll look for someone then. Thank you.\" \n\n\n\"Don't mention it.\" The barkeep waves you off and stands up. \"If you want, have some breakfast before you go. But I'd get out of here as soon as possible if I were you. Just make sure to tell me when you go so I can get someone to clean up the body.\" With that, he leaves.\n\n\nYou...", "action_results": [null, null]}]}, null]}]}, {"action": "Fight with your fists", "result": "You don't have time to grab a weapon, so you ready yourself for the assassin's attack, your fists raised. However, fists don't do much against a dagger. \n\n\nThe assassin charges, having a significant upper hand because of his weapon. You're able to get a few good hits in, but the assassin manages to stab you in the chest with his dagger. Stunned, you stumble back and fall to the ground as you slowly lose consciousness. \n\n\nThis is where you meet your end. ", "action_results": []}]}]}]}, {"action": "Ignore him", "result": "You don't want to cause any trouble, so you shrug off the boor's comment and try to walk around him.\n\n\n\"Are you ignoring me?\" he shouted, enraged. You sigh.\n\n\n\"Listen, I really don--\"\n\n\nYou're cut off when his fist slams into your jaw. You're knocked back by the force of his blow, and you crash into one of the tables behind you, your head colliding with a now-shattered plate. You feel the shards cut into your face, but pay it no mind. You get up and try to ready yourself for the fight, but the barkeep is suddenly in front of you and there are a few men holding back your attacker. \n\n\n\"Get him out of here!\" the barkeep yells. The men comply, dragging the struggling brute out of the inn. The barkeep turns to you and asks, \"Are you alright?\"\n\n\n\"Yeah, I'm fine,\" you tell him, but the entire side of your face is throbbing. You know you'll be fine, though; you've had worse injuries than a bruised jaw before. \n\n\n\"Head on up to your room, I'll have one of the staff bring up some water and a washcloth so you can clean those cuts.\"\n\n\nYou nod and head up the stairs, the old wood creaking with every step you take. You go up to the second floor and take the second door on the left, just like the barkeep had told you. The room is small, with a bed and a side table, a small dresser in the corner, and a mirror hung on the wall above that dresser. A dim light comes from the candle on the bedside table. You place your bag on the bed and then look at yourself in the mirror. The side of your face is already starting to swell, and there are cuts on your temple and cheek from the plate you fell on. Your nose is bleeding, but you don't think it's broken. \n\n\nA knock on the door pulls you away from the mirror. You open it and a man is standing there, a large bowl of steaming water in his hands and a washcloth hung over his arm. He's probably around your age, with close-cut dark hair and equally dark eyes. He's smiling, but it doesn't quite look genuine. \n\n\n\"For you,\" he says, extending the bowl out to you. \n\n\n\"Thank you,\" you respond, taking the bowl from him. You walk it over to the dresser and put it down. When you turn around, you see he's standing right behind you, although you never heard him enter. He holds out the cloth to you. He's got the same empty smile as before, and up close you notice how hollow his eyes look as well. You begin to feel uneasy and want him to leave. Luckily, when you take the cloth from him he turns and leaves your room, closing the door behind him. \n\n\nWeird. \n\n\nYou take your time washing your wounds, wanting to make sure they don't get infected, before collapsing on your bed. All at once, your fatigue and the stress of your situation hit you. You've been kidnapped, rescued by bandits, and walked god knows how long--all in one day. You're grateful for the adrenaline that must have kept you going, but now that it's worn off your limbs feel achy and tired, your eyelids heavy. Whether you wanted to or not, you slowly drift off to sleep...", "action_results": [null]}]}, {"action": "Strike up a conversation", "result": "\"So what's there to do in Sirra?\" you ask the barkeep. \n\n\n\"Not much, really. Some people go hunting in the forest, and there are a few farms to the north. It's mostly travelers that pass through, so the people who actually live here live pretty ordinary lives. Not much different than anywhere else.\"\n\n\n\"It's pretty different than where I'm from.\"\n\n\n\"Oh? And where's that?\" he asks.\n\n\n\"Dialla.\"\n\n\nHe laughs. \"I knew you were too polite to be from here. So you're a city boy?\"\n\n\n\"Yeah, part of the Royal Guard,\" you tell him proudly. When you say this you realize just how homesick you are. You miss your friends and your parents. But you know you're not far, so you don't let yourself get too upset.\n\n\n\"Then how'd you find yourself here?\" the barkeep says, and he actually seems somewhat interested in what you have to say.\n\n\n\"It's a big mess,\" you tell him. You don't think you should just go telling people who you truly are. \"I'm just trying to get back now.\"\n\n\n\"Well lucky for you, Sirra's not too far from the border. If you head out early I'm sure you could make it there by noon.\"\n\n\n\"I think I will, thank you.\" By now you've finished your meal, so you hand the barkeep a few coins. \n\n\n\"How much for the room?\" you ask.\n\n\n\"Fifteen,\" he tells you. You hand over the money. He counts it, looking satisfied. \"You get room twenty-four. Second floor on the left.\" With that he leaves and goes into the kitchen. You put your remaining money back in your pocket and make for the stairs. Before you can reach them, however, a large, brutish man steps in front of you and looks down at you menacingly. You're not exactly a small person, and yet this man towers over you. \n\n\n\"Can I help you?\" you ask. You really just want to get to your room and go to sleep, not be bothered by some giant.\n\n\n\"I don't like your smug face,\" he grunts. You're taken aback a little, because no one's ever insulted you like that before. \n\n\nYou...", "action_results": [null, null]}]}]}]}, {"action": "Sit and wait for him to return", "result": "While part of you would like to take a look around, you know it would be rude. You simply sit at the table, twiddling your thumbs, for a few minutes. When Jarven returns, he does so with a loud, \"Food's ready!\" and places a bowl of stew and a cup of something that might be water in front of you. It smells good, so you dig in right away. \n\n\n\"So, Alexander,\" Jarven says, taking a seat across from you, \"you really from Vinia?\"\n\n\nYou finish chewing your food before answering. \"Yes,\" you tell him, \"I live in Dialla.\"\n\n\n\"Hm. Then why are you here?\" He asks.\n\n\n\"I told you before, the person driving the cart just kidnapped me one night. I don't even know where I am.\"\n\n\nJarven laughs a big, bellowing belly laugh. \"Well you're not in Vinia, I can tell you that much.\"\n\n\nYou sigh, getting somewhat annoyed at the fact you're not getting a straight answer. \"So then where am I?\"\n\n\n\"You're in Niravia.\"\n\n\nYou're taken aback. \"Niravia?\" you ask. You feel slightly sick; Niravia is known for it depravity and poverty, and many of the knights back in Dialla have told you of the things they've experience in the country.\n\n\n\"The one and only.\" Jarven chuckles when he sees the expression on your face. \"Aw, come on, boy, it's not that bad. I'm sure it's not as nice as Vinia, but--\"\n\n\n\"How far are we from the border?\" you cut him off. \n\n\nHe has to think for a moment, but he finally tells you, \"Twenty kilometers, about.\"\n\n\nYou sigh in relief. That's not far enough too far. And Vinia is relatively small country, stretching maybe one hundred kilometers across.  It's not an impossible distance to travel, should you choose to do so.\n\n\n\"I wouldn't get my hopes up if I were you, boy,\" Jarven says. \"The journey to the border isn't an easy one. You'd probably die.\"\n\n\nDo you...", "action_results": [null, null]}]}, {"action": "Run away", "result": "\"I...think I'll take you up on that offer,\" you lie, thinking it might be better for you to get away from these people as soon as possible. You have no idea what they might actually be planning on doing with you. \"By the way, what's your name?\"\n\n\n\"The name's Jarven,\" the leader tells you, puffing up his chest in an attempt to look more grand. \n\n\n\"No title?\" you ask.\n\n\n\"Nope, just Jarven,\" he confirms. \"My boys and I roam this forest and take what we need to survive.\"\n\n\nWhen Jarven and \"his boys\" begin to walk back into the forest, you get up and follow for a few steps before suddenly turning and sprinting as fast as you can in the opposite direction.\n\n\nYou hear them calling after you, but you don't look back. You sprint through this unfamiliar forest, tripping on roots and rocks, for what feels like ages, and you eventually you have to stop to take a rest. You're lungs and throat burn and your legs are numb from running. You lean against a tree and look at your surroundings, but all you see is the emerald see of trees extending for as far as you can see. \n\n\nBecause of your gasping for air, you fail to hear the pack of feral wolves that creep up on you from all sides. When you see the first one you know there's something wrong with it; in its eyes is a bloodlust you've never seen in any animal before. When you try to back away from it slowly, you hear the warning growls of the other wolves behind you. \n\n\nThis is where you meet your end. ", "action_results": []}]}, {"action": "Tell the truth", "result": "\"I am Prince Alexander of Vinia,\" you say. You see all of the men's eyes widen before they all burst out laughing. \"What's so funny? Do you think I'm lying?\" You demand.\n\n\n\"You're no more the Prince of Vinia than I am the the Queen!\" The leader howls with laughter. When the laughter finally dies down, he says, \"I like you, Alexander. Would you like to come with us back to our camp? We can get you fed and watered.\"\n\n\nYou...", "action_results": [null, null]}]}, {"action": "Glare", "result": "You glare at the man. Does he not notice the gag in your mouth? \n\n\nThe leader chuckles. \"Now now, no need for the nasty look. Lemme get that cloth for you.\" He grabs the cloth covering your mouth, allowing you to spit out the cloth in your mouth. Your mouth is dry, your throat sore from thirst. \"Now then, who are you?\" he asks.", "action_results": [null, null]}]}]}, {"action": "Hide", "result": "You have a bad feeling about what's going on, so you quietly get out of your bed and make your way to the large wardrobe in the corner of your room. You open its door and get inside of it. It's a bit of a tight squeeze, but you manage to close the door.\n\n\nYou hear the small click of the door handle being turned completely followed by the slow creak of the door being opened. Now knowing that something isn't right, you cover your mouth with your hand in an attempt to quiet your breathing and stay as still as possible. \n\n\nEverything is silent for a few moment when the wardrobe door is suddenly flung open. An unknown intruder grabs you by the hair and slams your head into the thick wooden frame of the wardrobe. You barely register the pain before you pass out.", "action_results": [null]}, {"action": "Stay in bed", "result": "You have a bad feeling about what's going on, but you decide to remain in your bed. It could be nothing, right?\n\n\nThe door handle is turned completely, accentuated with a small click. The creaking sound the door makes as it is gently pushed open sends shivers down your spine. You begin to think that you should have hidden or grabbed your weapon, just in case.\n\n\nThat's when a dart flies from the darkness, landing directly in your neck. You pull it out, but it's too late; your vision begins to fade and you lose control of your body, slumping forward onto your blankets. The last thing you see before passing out is a figure emerging from the dark hallway, walking towards your bed.", "action_results": [null]}]}, {"action": "Stay in bed", "result": "You feel a little wary of what's going on, but you're too exhausted to really care. You roll over so your back is to your door and are content to go back to sleep. \n\n\nAs you drift off to sleep, you hear the distant click of the door handle being turned. Subconsciously you know you should care, but your sleep addled mind pushes it to the side. \n\n\nSuddenly you are hit over the head with a large, blunt object. You have no chance to react or fight back before everything goes black.", "action_results": [null]}, {"action": "Open the door", "result": "You get out of bed and walk toward the door. It's best to confront whatever's happening head on, right?\n\n\nHowever, just as you begin to reach for the door handle, it turns and the door is swung forward, straight into your face. You're shocked but still conscious as you fall back, now alert to the danger you may be in. You stand up and get into a fighting stance. \n\n\nA figure, clothed in all black, emerges from the darkness beyond your door. They have the look of an assassin about them. \n\n\nYou charge forward, trying to catch the intruder off guard, but despite the fact you are superior to them in physical strength, they are faster than you and easily dodge your attack. As they do so, they stab you in the side with a small dart. You push them away and pull the dart from your side, but you can already begin to feel its affect--your side is beginning to numb and your head is getting foggy. \n\n\nYou are a soldier, though, stubborn and a fighter by nature, so you charge your assailant once again. However, they take advantage of your disoriented state and easily stab you with two more darts. It doesn't take long for you to collapse.", "action_results": [null]}, null]}]}