{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=60232", "context": "", "first_story_block": "“My face is fucking freezing,” says Lars.\n\n\nNo shit you think to yourself. It’s the middle of winter and you both are assigned to guard duty. Normally, the cold isn’t an issue. However, due to increasing demon sightings, a few unlucky bastards have to spend the night outside the city walls keeping watch.\n\n\nSnow begins to fall, and your cheap leather armor offers little resistance.\n\n\n“I can’t take it anymore, I quit.”\n\n\nLars tosses down his sword and walks towards the city entrance.\n\n\n“What about the demons?” you ask.\n\n\nHe turns to you and a slight grin appears on his face.\n\n\n“Demons? I welcome them with open arms. The city could use some heating up.”\n\n\nWith that, he leaves. It’s just you and the dead silence of the night. You try to stand still and focus on the dirt road leading away from the city. This road is where nearby demon sightings have occurred. A few minutes past and you swear you saw a red flash. Your hands shake and your heart beat slows down. Is your mind just playing tricks on you? Surely you’re just reacting to the cold, right?\n\n\nMere moments after this thought you hear a laugh. Unlike what you were expecting, this isn’t the laugh of some badass demon. No, it’s the laugh of a female. You try to tighten your grip on your sword but can’t move your fingers. Shit, maybe Lars had the right idea. Spending the night out here is a death sentence, regardless if demons attack.\n\n\nYou can’t bear to stand any longer and lower yourself to the ground. You drop your sword and curl into a ball. You don’t have the energy to move a muscle and your body becomes stiff. Your eyes shut close and you’re out cold seconds later.\n\n\n“What’s a strong soldier like you doing out here all alone?” a soothing voice inquires.\n\n\nYou open your eyes to find yourself staring at barely clothed succubus. She radiates an intense heat, although it’s not enough to burn.\n\n\n“Who are you?” you ask.\n\n\n“My name’s Catia and you never answered my question. Why are you all alone?”\n\n\n“My other guard, Lars, left. Look there’s his sword right there,” you say, feeling compelled to give more information than necessary.\n\n\nCatia walks towards his sword and picks it up.\n\n\n“Is this supposed to kill me? Ha! Don’t make me laugh. Why is your equipment so poor?”\n\n\nYou see no logical reason to tell a demon this but find yourself doing so instinctively.\n\n\n“Ever since demons came near our city, trade has been impossible. We have no experience with a threat this large and thus don’t have the weapons or equipment to deal with it.”\n\n\nShe grins and salivates to your every word. You take a moment to stare at her figure. She looks more human than succubi are told to be. Still, there are a few stark differences. These being her bright red eyes, dark red curled horns, and pink tail. Oh, and she utterly beautiful. More so than any human you’ve seen. Despite being face to face demon for the first in your life, you feel entirely calm. Dare you say, the calmest you’ve ever felt.\n\n\nThis calmness is ripped away when she begins to leave.\n\n\n“Where are you going?”\n\n\n“Hm? You want me stay huh?”\n\n\n“Yes… I do.”\n\n\nShe grins again and starts chewing on her tail in a seductive manner.\n\n\n“Sorry, no can do. But if you want, I would love to see you again. Trust me, it will be the most pleasurable experience of your life. All you have to do for me is one small favor.”\n\n\nYou feel an intense compulsion to comply with her every demand, but you stop yourself. Making deals with demons is serious business. You have enough willpower to at least ask what the favor is.\n\n\nShe explains how if you want to meet again you need to be a more suggestive state, like you are right now due to the cold. She recommends going to a bar and drinking for a few hours. Then, all you have to do is whisper her name and she will come visit, provided that you’re alone.\n\n\nShe walks away leaving you all alone. As if in a trance, you make your way to The Drunk Tortoise Tavern.", "action_results": [{"action": "A few hours later...", "result": "“This is the last time I’m saying this Greg, immortality is not worth cutting off your cock. What’s the point of being immortal if you’re deprived of the best feeling in the world?”\n\n\n“Ey’ maybe he’s lacking in that area. No wonder he wants immortality if all he has to do his cut off an inch or two worth of pecker.”\n\n\nGreg suddenly stands up, drawing your eyes to the bickering trio. They’ve been arguing random hypotheticals since you’ve gotten here. All you wanted was to get a quiet drink before meeting with Catia. As long as these buffoons are here, that’s impossible.\n\n\nEven as Greg stands up he’s shorter than the other two sitting. It’s no wonder they pick on him, he looks pathetic.\n\n\n“Can you both just shut the fuck up? I mean, god damn. All I’m saying is living forever outweighs the downsides of not having a dick,” he says in a whiny voice.\n\n\nThe other two laugh uncontrollably at his pitiful attempt of defiance. One manages to calm down and spits out,\n\n\n“Maybe when it’s smaller than a gnome’s toothbrush, but for the rest us it’s not so easy.”\n\n\nQueue more uncontrollable laughter as Greg’s face becomes redder than demon blood.\n\n\n“I’ll shove a gnome’s toothbrush up your ass if you say that one more time! C’mon, let’s move on to another question.”\n\n\nThe trio quiets down and you zone them out. You take a swig of whisky and start to remember the reason while you’re here. Oh yeah, the succubus. She wanted you to drink a bit before meeting her. You didn’t necessarily jump at the idea of getting drunk before meeting with a demon, but she promised you she would make it worthwhile. You’re pretty sure that means…\n\n\nYour thoughts are interrupted by the thickheaded trio once again.\n\n\n“You’re telling me you’d prefer your child be retarded and kind than ingenious and mean?”\n\n\n“Yes Connor, I would.”\n\n\n“God damn it, Greg! You want to spend an eternity with no dick while taking care of a retarded child? Pathetic. I would kill myself after a week.”\n\n\n“Har har har! I would kill myself in a week if I had to live Greg’s life as it is. No, scratch that, a day!”\n\n\n“Fuck you Tom. I can’t be the only one who thinks this…”\n\n\nGreg glances around nervously looking for a savior. Eventually he turns his gaze towards you and his eyes light up.\n\n\n“Hey you over there! What would you rather have, a dumb, but kind child; or a smart, but cruel child?” he says while pointing at you.\n\n\nYou stare blankly ahead and breathe a deep sigh. This is beyond stupid. You briefly consider just ignoring him and getting the hell out of this place.\n\n\n“Why do you think that man would agree with you? He’s a soldier. Surely, he recognizes the benefits a genius could provide for society. Especially when you consider the need for mages regarding the growing demon problem.”\n\n\nSoldier? Shit you forgot to change out of your uniform. So much for staying inconspicuous. You can thank your lucky stars none of the other guards are here to see you in this shithole.\n\n\n“Now now, let the man speak. Just because he’s a soldier doesn’t mean he agrees with you,” says Tom.\n\n\n“Fine, what do you think...and hurry up! We don’t have all day.”", "action_results": [{"action": "“I prefer a retarded but kind child.\"", "result": "“Thank you,” Greg whispers.\n\n\n“You what!”\n\n\n“Pfft! And to think, I used to respect soldiers.”\n\n\nTom and Connor start shouting about how much of a dumbass you are. You don’t bother to engage with such idiotic banter. Instead, you walk out of the tavern without a second glance. As you make your way outside you are hit with a rush of cool air.\n\n\n“I can’t wait to meet Catia,” you mutter to yourself.\n\n\n“Who’s Catia?”\n\n\nYou turn around and only see the entrance to the tavern.\n\n\n“Hello?”\n\n\n“Ermm down here sir!”\n\n\nYou glance down and instantly recoil. It’s Greg, what’s he doing here?\n\n\n“What the hell do you want?”\n\n\nHe begins to squirm uncomfortably and hyperventilate.\n\n\n“I…uh…I…erm…”\n\n\n“Spit it out!”\n\n\n“I wanted to thank you for agreeing with me,” he says between irregular gasps for air.\n\n\nOh, that’s why he’s here. You normally wouldn’t mind but you have plans tonight and have no time for conversation.  \n\n\n“People don’t agree with you often kid? That’s too bad,” you say while walking away.\n\n\n“I’m not a kid, I’m 20. But yeah, everyone I meet either ignores or makes fun of me. I almost prefer the latter as at least they keep me company,”  he says while following behind you.\n\n\n“Damn that really sucks,” you stop walking and stare him in the eyes, “Look I’d love to keep you company, but I have somewhere very important to be.”\n\n\nGreg looks at you with a face of disappointment. But he lights up to ask,\n\n\n“Where do you have to be? Maybe I could come with you.”\n\n\nGah! As bad as you feel for Greg, under no circumstances could he come with you. She agreed to see you, not Greg and you.\n\n\n“Sorry I don’t have time.”\n\n\n“God damn it. Can you at least tell me why? I don’t want to be near Connor and Tom right now. They make me feel inhuman.”\n\n\nDoes this guy ever shut up? You been trying to exit this conversation gracefully since it started. You should just tell him to fuck off and be done it. Of course, you could humor him and tell him what you’re doing. It’s been hard keeping this succubus thing a secret and having someone to confide in wouldn’t be the worst thing in the world. On the other hand, you really want to go have demon sex.", "action_results": [{"action": "Talk to Greg", "result": "“Fine I’ll tell you why. But be warned, it’s a long story.”\n\n\n“That’s alright, the longer I’m away from the other two the better.”\n\n\nYou take a deep breath and begin to describe your recent encounter with a succubus.\n\n\n“Well it all started when I fell asleep during guard duty.”\n\n\nLater\n\n\n“And that’s why I came to this tavern.”\n\n\nGreg looks off in the distance, taking in everything you’ve told him. He starts speaking aloud slowly asking,\n\n\n“Do you think she was immortal?”\n\n\nImmortal? Aren’t all demons immortal, unless killed? You’re no expert, but you have never heard of a demon dying of old age.\n\n\n“I don’t have a clue to be honest. I was under the impression that her actual age is much more than her physical appearance would suggest though.”\n\n\nGreg gives a nod satisfied with your answer. You feel like you’ve told Greg more than enough and decide it’s time to go. You wish him goodbye and feel a hint of longing in his response.\n\n\n“Goodbye friend.”\n\n\nYou tuck your hands in your pockets and begin the walk to your home. You’re going to have to get home fast as the cold is unbearable. You decide to take the alleys, as not only is it faster, but it also provides protection from the wind.\n\n\nCommon sense says going through alleys at night isn’t safest, but Ashton is different than most cities. Crime is low, and poverty is uncommon as anyone can get a job as a guard as demand is higher than ever. The night’s sky combined with the tight spaced alley nearly blinds you. When you finally get out you’re relieved to have arrived at your parents’ house.\n\n\nMost guards sleep in the barracks, however, since your parents never returned from their trip their house is all yours. If they ever return, you hope they don’t mind you bringing a demon inside the house. Although, they were always bugging you about finding a girlfriend, this might not be what they had in mind. \n\nYou walk to your parent’s porch and open the door. The wooden door squeaks loudly as you open it. \n\n\n“Some things never change,” you whisper to yourself.\n\n\nYou immediately start making yourself more presentable. You change out of your soldiers’ uniform and put on a loose-fitting black tunic. You probably should take a bath but your too excited to see Catia that you forget to. Do demons mind odor? \n\n\nYou feel like this is your purpose. It’s time to see Catia.\n\n\n“Catia”.\n\n\nA dark cloud appears in your room, dispelling a toxic fume. You start violently coughing as you vision blurs indiscriminately. Your eyes shut close and you feel you grip on reality slipping away from you. \n\n\n“Ah shit,” you whisper before passing out. \n\n\nYour eyes jitter open and you’re greeted by Catia stroking your face. Her palm flushes the coolness off your face. Beads of sweat drip furiously down your neck as she continues caressing you. \n\n\n“Couldn’t wait a single day before seeing me again? How cute.” \n\n\nShe crawls onto your bed and moves closer to you. Her aura is all consuming and you feel your free will being drained away. Yet, the whole process is extremely pleasing to you. She moves her mouth to your ear and whispers,\n\n\n“Do you want to see everything I have to offer?”\n\n\nYou bite your tongue to avoid instinctively shouting yes. This may be your last chance to not go through with this. At the very least, it would give you chance to ask her a few more questions.  \n\n\n ", "action_results": [{"action": "Yes, I’m ready.", "result": "She takes no time to hesitate and begins kissing you. As she does so, she unties your tunic and throws it off. Her warm body pushes against your bare skin as you are filled with euphoria.\n\n\nSoon both of you are completely naked. Catia pleases you in ways no other woman has or will ever be able to. Afterwards you both lay in bed panting as one thought races through your mind.\n\n\nHow do you get more of this?\n\n\n1 Month Later\n\n\nIt’s been a month since you’ve started having sex with Catia on a regular basis. The first few times you felt great afterwards. However, lately she has been demanding more out of you.\n\n\nFirst, you no longer have to say her name to see her. She visits you most nights whether you like her to or not. Last night she told you she wants to introduce you to a group: The Order of the Inferno. She told you they are a group of demons who could give you unimaginable powers in exchange for your help.  You protested as you feared what could happen. Demon attacks are becoming more common and more lethal. Their reputation proceeds them and stomps out any curiosity you have of meeting one.  Tales of rape, human consumption, and slavery are a few of many horrendous acts they have committed.\n\n\nYet, as always, she managed to convince you. As much as your mind tries to resist, her presence is intoxicating. You embrace it as fighting gets you nowhere. She tells you to meet you in a nearby forest tonight. This is the first time you're seeing her outside your bedroom since the day you met. You sneak out the city walls when no one is watching and blend into the shadows.\n\n\nAlthough it is still winter, the temperature has unexpectedly risen. Some say its because of demonic power, others view it as being coincidence. Whatever it is, the cold will not be a hindrance. You reach the edge of the forest and feel your heart leaping out of your chest. While the city has many focused-on demons, other creatures lurk during the night. Just because Catia is on your side doesn’t mean you are safe. You keep this in mind as you take cover in bushes and flora periodically.\n\n\nAn intense red light comes into view causing you to close your eyes. You begin to stumble and fall to the ground. When you’re able to open your eyes, you find yourself staring up at a hooded figure.\n\n\n“Who dares disturb me?” she hisses.\n\n\nBehind a dark brown hood lies a demonic face. Compared to Catia, she is clearly not human. Although none of that matters now, you begin to explain,\n\n\n“Catia told me to come here. Are you part of The Inferno Order?”\n\n\n“She sent a human to the center of The Order of the Inferno! I guess she wants to make up for earlier. I could never turn down a good meal.”\n\n\nShe begins advancing towards you as a snake-like tongue hangs out of her mouth.\n\n\n‘Wait! She told me you wanted my help and would give me powers in exchange.”\n\n\nShe begins to laugh as she towers over you. You’re helpless as she grabs your neck and leans in… to kiss you?\n\n\n“My kiss is to die for!”\n\n\nYou surprise yourself when you send a punch flying at her mouth. She seems equally surprised as she falls backwards.\n\n\n“I guess I can still resist,” you say.\n\n\nYou get up and start running away but it's no use. She’s much faster than you, especially considering she can fly. You don’t have many options left but need to decide quick. Do you run deeper in the forest and hope to lose her or run back to the city and put everyone at risk?", "action_results": [{"action": "Go deeper into the forest", "result": "You start running to the heart of the forest praying that you lose her. It’s to no avail, she easy catches up to you and it seems you reached your end. Right as she is in arm’s length she stops. Before you know it, she has flown away leaving you all alone. What’s the deal?\n\n\nYou quickly get your answer as you hear a monstrous screech. You suddenly feel extremely cold as a ghost like entity hovers above you. There’s no doubt about it, this is a wraith. They're well known for their madness and spreading it to all they encounter.\n\n\nYour mind is assaulted with a barrage of incomprehensible whispering. Within seconds you wish that demon would have killed you as the pain you experience is like no other. Your life energy is sapped away from you when the wraith eats your soul. You haven’t died technically but exist as one of hundreds of souls trapped within the wraith’s body. You’re never heard from again.", "action_results": []}, {"action": "Go back to the city", "result": "You pump your muscles and start running back to the city walls. She follows you like a hawk, soaring above you with her wings. Once she’s directly above she swoops in. Too late though as you bolt through the city entrance. You keep running straight and dive into a nearby bush. You stop breathing and don’t dare move. You can sense that she is nearby, but she doesn’t seem to be trying to kill you anymore. Instead, you hear screaming in a nearby house followed by laughing.\n\n\nCuriosity gets the better of you and you peak out from the bushes. You spot her in a house cornering a family. You know demons are monsters, but what benefit is there to killing innocent children and their parents? It’s senseless, what’s the point of destruction for destruction sake? You continue starring at her as she slashes the throat of presumably a father. But for some reason, she does not kill him.\n\n\nWhat she does is much worse. She leaves him alive to watch as she sends a ball of red energy at the children. It renders them into ash, not giving them a chance to scream. You curse at yourself for indirectly causing this. Why did you listen to a demon anyways? You keep watching in nervous anticipation of her killing the father. Instead, she just leaves. What cruelty propels such an atrocious action? This man has lost all that’s dear to him, and she left him alive.\n\n\nYou stay in the bushes as she goes from house to house committing similar acts of violence. There must be a stop to the madness. You gather the courage to leave your bush haven. You dash away back to your home and fling the door open. Your immediately reaction is to get your sword and leather armor to slay the demon. Yet, the logical side of your mind tells you that’s suicide. There's another way, although you don’t want to admit it. What if you got drunk and contacted Catia to save your city? She saved your life before, maybe she can do it again?", "action_results": [{"action": "Slay the demon", "result": "You must slay the demon yourself. Catia didn’t bother showing up to the forest, why would she help you? You throw on your armor and pick up your sword. You grin at the thought of stabbing this demon to death. You haven’t ever felt pleasure from violence before, yet something tells you you’ll enjoy killing her. With your weapon and protection, you leave your home.\n\n\nTerror has spread like wildfire. Bodies lay on the street charred and bruised.  Your veins pulsate with anger. Why, tell me why? These are your neighbors and friends. You run with each step being more purposeful than the last. After a few hundred steps, you hear laughter. There she is, cornering a group of children. You yell to create a distraction, but she ignores you. The children are reduced to fragments of ember.\n\n\nDestruction lies all around you with more bodies than you could count. You scream a battle cry of hatred and charge. She looks up and makes eye contact but doesn’t move. You resist the urge to strike her down as you know you are outmatched physically. Still, another urge gnaws at your conscious forcing you to spit out,\n\n\n“Why would you do this?”\n\n\nYou’re surprised when she stops to think for a moment.\n\n\n“I had everything I held dear to me ripped away. When Catia came to me with the idea of working along side a human, I couldn’t contain my anger.”\n\n\n“What’s wrong with working with a human?”\n\n\nShe stares at you with pity.\n\n\n“You truly don’t know? Why the hell are you helping Catia then? I don’t understand.”\n\n\nYou are equally confused and explain your relationship with Catia.\n\n\n“Oh, so you’re her fuck toy then? Jesus Christ, she’ll never get back with such degrading tactics.”\n\n\nYou ignore her insult (although she said it more like an objective statement) and ask her,\n\n\n“What do you mean get back? Demons invaded earth, why wouldn’t they want to finish the job?”\n\n\n“You think we’re here willingly? Holy shit you’re brain dead, I still can’t get over Catia fucking a human as dumb as you. It would be like if you had sex with a jellyfish, completely different wavelengths.”\n\n\nThis hellish creature is relentless with her insults. Though it seems there is a fundamental misunderstanding between you two.\n\n\n“If you’re not here by choice, why are you here?”\n\n\nShe explains that there is a demonic code in the infernal realm. Any demons who break it, are sent to lesser realms for a chance at redemption.\n\n\n“And I was sent to one of the worst; Earth.”\n\n\n“How do you get back?”\n\n\n“I need to conquer not through destruction, but manipulation. It goes against my nature, but it is the way of life in the infernal realm where all strength is equal. To prove my worth, I need to work with humans and other lesser creatures.”\n\n\n“Then why are you destroying my city?”\n\n\nShe sighs and furrows her eyebrows.\n\n\n“Because I’m pissed off, ok?”\n\n\nYou continue talking to the demon, who tells you her name is Aria, until you come to a complete understanding of each other’s motivations. Still, after everything you’ve learned about each other she says,\n\n\n“I’m still going to destroy your city. Although there may be one thing you could do to stop me…”\n\n\nShe explains how a nearby wizard has imprisoned her friend, Azor, and offers to spare your city in exchange for his freedom.\n\n\n“You have 24 hours, or your city goes up in flames.”\n\n\nYour blood boils over the fact she still desires to destroy the city. Your morality prevents you from standing aside and letting your city burn. You have your sword in hand and amour equipped. Why not pretend to agree then attack when she least expects it?", "action_results": [{"action": "Help save her friend", "result": "“I’ll help you to stop the destruction.”\n\n\n“Great!”\n\n\nAria conjures a portal made of dark matter.\n\n\n“Quick get in before it closes.”\n\n\nYou jump in, not knowing your destination. After a short transit, you find yourself outside of a tree house. You wanted to live in a tree house as a child, but now that your in front of one, they don’t seem very practical.\n\n\n“How do I get inside?\" you wonder aloud.\n\n\n“The ladder.”\n\n\n“Why didn’t I think of that! Thank you voice inside my head.”\n\n\n“You're welcome, now free me from this ethereal prison.”\n\n\nThis must be who Aria was talking about, but you want to make sure.\n\n\n“Say, what’s your name?”\n\n\n“Amlodipine Olmesartan Medoxomil, but you may call me Azor for short.”\n\n\nYou climb the ladder and enter a room with wooden floors and walls.\n\n\n“Why are you so fixated on the floors and walls? What did you expect a tree house to be made of?”\n\n\nYou don’t answer and continue examining your surroundings. A table lies in the center of the room aligned with various trinkets. One that catches your eye is a glowing red crystal ball. Your first instinct is to break it but you resist the temptation.\n\n\n“What are you waiting for, mortal? Free me from this ethereal trap at once!”", "action_results": [{"action": "Free him", "result": "You grab the red crystal ball and drop it as it burns your finger tips. It shatters into a million pieces as a red fog pours out of it.\n\n\n“Now open up!” \n\n\nThe red fog flows into your ears, mouth, and nose. Your eyes roll into the back of your head as your mind splits into two. Thoughts that aren’t your own begin to flood in.\n\n\n“What are you waiting for? Let’s get the hell out of here.”\n\n\nYou climb down the ladder and exit the tree house. You don’t even know where you are right now but somehow know the way back is to the north.\n\n\n“Take a rest, I’m taking over.”\n\n\nYour face grows warm and you start feeling lightheaded. Your body still walks forward as you black out. You awaken in mid conversation sitting by a campfire.\n\n\n“So when are you gonna get a better body Azor? Look at yourself, how will you kill anyone appearing like that.”\n\n\n“Don’t be so dismissive Kancor, at least with this body he won’t have to worry about losing control.”\n\n\nYou look around and note the men you're talking with are much more muscular than yourself. There’s something off about them, their body language is inexpressive and follows little pattern. Sometimes their hands dangle from their arms and other times they jerk up and down. It all feels unnatural and inhuman.\n\n\n“Looks like you might of spoke too soon Borax.”\n\n\n“Nonsense, Azor is fucking with us and you're taking the bait. Now tell me, how did you convince this poor fuck to release you?”\n\n\nYou stare at these two men and know you can’t fight them. Plus, you feel a nauseating light-headed feeling. You could experience a loss of movement at any time if Azor gains control.\n\n\n“I convinced him to break my crystal ball, releasing me from my ethereal prison,” you say remembering his own words.\n\n\n“Yeah but how did you do it? Borax and me had to torture bandits to near death, how did you get someone to give you control willingly?”\n\n\n“He had no idea I would gain control,” you say with a hint of spite.\n\n\n“Damn small-muscled and a moron? Looks like you hit the jackpot with this one.”\n\n\n“I sure did…”\n\n\nYou talk for a little longer before Borax puts out the fire. Despite having little clothing for spending a night outside in the winter, you don’t feel cold. Is Azor’s presence maintaining your normal body temperatures?\n\n\n“What’s the point of putting out the fire? We’re going to have to use twice as much energy to stay warm.”\n\n\n“We’re demons, not monsters. Wouldn’t want an entire forest burning down for no reason.”\n\n\n“Wasn’t the poor bastard you’re possessing now screaming ‘Monster! Monster!’ when you tortured him?”\n\n\n“Kancor, you know I had no choice. He was being uncooperative and I needed to put him in his place.”\n\n\n“Well you can think about how you had no choice but to mutilate his ball sack into a dough-like mess over sleep.”\n\n\nAll three of you lie down on lovely dirt mattresses. You stare eyes open fearing you might lose control at any moment. After what feels like an hour, you’re sure both of them are asleep. You could get up and make your escape, although you have no idea where you are. Something tells you north is the way to go, but you have no idea how long of a journey it will be and when you will lose control again. You could fall asleep and wait until you're closer to safety. But what good will that even do? Azor will still coexist with you like an infernal parasite.\n\n\n ", "action_results": [{"action": "Escape", "result": "You get up and sneak away, careful not to step on any sticks. Once you’re a good distance away, you break into a sprint. You need to get out of here before they realize you're gone. If Ashton, or any city for that matter, is nearby, then maybe someone could help you. You heard about demon purges before but it never seemed to be the most pleasant process. What choice do you have if you want to hold onto your own free will?\n\n\nWhile running you start to feel incredibly dizzy. Your head sways up and down, spit drips out of your mouth, and you begin to fall. You wait for Azor to take over, but he never does. A coldness perpetuates all around you as you go numb. There will be no one to save you as you pass out from the freezing temperatures. You die a relatively painless death.\n\n\n ", "action_results": []}, {"action": "Fall Asleep", "result": "You drift off to sleep, wondering if you’ll wake up in the same place.\n\n\nAn unknown amount of time later\n\n\nYou wake up starring at a bloody pile of human corpses. You’re carrying an iron sword that’s stained red. The stained sword seems like the proximate cause of human bodies. You hold back from throwing up as you notice all the stab wounds that you made. You feel lightheaded and can’t tell if its because of the bodies or Azor. Regardless, you have to get out of here before someone sees you. You run from the murder scene and notice you’re in a small village. The sun is beginning to rise and people are going to wake up any minute. Needing to get the hell out of here, you take off running to the north. You hear screams in the distance the moment you take off. They must have discovered the bodies…\n\n\nOnce out of the village, you bend over gasping for air. Your heart flutters as you feel like you’re gonna pass out from adrenaline. You stumble haphazardly knowing the villagers are on the lookout for a killer. You need to reach Ashton, you need to know it’s ok. The thought that Aria manipulated you and destroyed your city spikes your anxiety. This isn’t the only thought that is causing you panic though.\n\n\nYou have a fucking demon inside of you. It’s like a tape worm but instead of wanting food it craves evil. What happens if you return to Ashton and lose control? What if you’re the one who destroys the city under Azor’s guidance? Your thoughts are too much causing you to stop dead in your tracks. Why should you try to reach Ashton just to lose control? Instead, you could turn around and go back to the village. If you explained you situation, they may be able to help you. \n\n\n ", "action_results": [{"action": "Go back to the village", "result": "You’ve seemed to lack so much control over your choices ever since you met Aria. Now that Azor is involved, this lack of control has intensified. This may be your last chance to make your own choice. It’s time to put an end to this. You turn around and sprint back to the village. When you arrive, the villagers don’t seem very happy.\n\n\n“That’s the murderer! I saw him run away covered in blood.”\n\n\n“Yeah and he has a sword! Let’s get him!”\n\n\nIt probably would have been a good idea to change clothes and ditch the sword. Or, you know, go to any other place but the village you just killed someone at. No matter, this was your choice and you have to live with the consequences.\n\n\n“Please let me explain.”\n\n\nThey give you no chance as they charge at you with pitch forks and makeshift swords. You are beaten to a bloody pulp until you die from loss of blood.", "action_results": []}, {"action": "Continue to Ashton", "result": "You keep running north, praying it’s the way to Ashton. It’s a long journey, and you find yourself having to piss multiple times. During one of these pisses you lose muscle control and fall into a puddle of your own urine. When you come to, you find yourself in Ashton. Or at least, what used to be Ashton. The city has been completely destroyed, houses burned to the ground and there’s not another soul in sight. You do sense someone being nearby and search for any survivors.\n\n\nWhat you find instead sends you into a rage. It’s Aria and she is looking at you smugly. \n\n\n“Good job destroying the city, you did a much better job than I ever could.”\n\n\nYou hold back from attacking her considering you no longer have your sword. You make an emotional plea and say,\n\n\n“You promised you wouldn’t destroy the city if I freed Azor.”\n\n\nShe laughs and starts to fly circles around you.\n\n\n“Au contraire my little killer. YOU destroyed the city and I kept my promise. Thanks to you I’ve been granted a passage home.”\n\n\n“What are you even talking about? How could I destroy the city if I don’t have a weapon?”\n\n\nShe laughs again and stops flying to land beside you.\n\n\n“When you black out, you take on a different form. Azor is capable of much more than you ever will be.”\n\n\nThis can’t be real, you’ve gone through so much just to be a pawn in her little game. You wish you just died on that freezing night instead of having Catia save you. Maybe Ashton would still exist if it weren’t for you. \n\n\n“Don’t be so sad, you’re coming with me!” \n\n\nYou stare daggers at her. \n\n\n“What do you mean I’m coming with you?”\n\n\n“You’re coming home with me of course. Azor’s a demon too and you couldn’t have destroyed the city without him. And thanks to you, Tornaxaan, a powerful demon lord, commended us for tricking you into destroying your own city. As a reward, we get to return to the infernal realm.”\n\n\n“Can’t you just let me go? Surely Azor could possess a different body...”\n\n\n“Nonsense, now grab my hand. We’re going to have so much fun!”\n\n\n ", "action_results": [{"action": "Epilogue #3: Returning to a Home Unknown", "result": "“So your name’s Coyote?”\n\n\n“Yes, and I presume you’re Azor?”\n\n\nAt this point you don’t even bother correcting people. Your moments of control are becoming more scarce and there’s no point in wasting it telling people you aren’t Azor.\n\n\n“That’s correct, now tell me, how can I get sent to Earth?”\n\n\n“You could try learning dark magic, that’s how my friend Jirzan got there.”\n\n\nDark magic is notorious for being hard to control. Still, it might be your best option.\n\n\n“Dark magic sounds interesting. Is there some sort of teleportation spell that can get me back to earth? Oh, maybe I could learn to conjure a portal!”\n\n\nCoyote, who is half man half coyote, shows what would be a pleasant smile if he didn’t have two monstrous fangs.\n\n\n“No nothing like that, you don’t even have to learn a single spell. Just being in possession of a dark magic book, or kit, will be enough to get you sent back.”\n\n\n“And where could I get such resources?”\n\n\n“I wish I knew, but dark magic is heavily guarded by the most elite demons. I would take a look in Tornaxxan’s castle, just don’t get caught.”\n\n\n“Yeah I wasn’t planning to. Thanks for your help Coyote, I’ll try to sneak in before it's too late.”\n\n\n“Too late? Buddy, you got an eternity to figure this out.”\n\n\n“Sure I do,” you say while sulking away.\n\n\nCoyote calls after you,\n\n\n“Before you go, could you do me a favor?”\n\n\nYou stop and pause to ask,\n\n\n“What?”\n\n\n“If you ever meet a demon named Jirzan, tell him I’ve been released from captivity. He’ll be happy to hear that.”\n\n\n“I’ll be sure to tell him if I get the chance.”\n\n\nCoyote wags his tail as you wave goodbye. Who knows if you’ll ever return home? And if you do, when can you get rid of Azor? Life used to be so much simpler.", "action_results": []}]}]}]}, {"action": "Keep looking around", "result": "You continue searching the tree house until you find a book. It's titled in a language you don't understand. You pick it up to get and a closer look and it seems to be some sort of spell book.\n\n\n\"Don't read that!\" screams Azor.\n\n\nBut it's too late, you've already opened the book. You poof into nothingness and die in unpredictable fashion.", "action_results": []}]}, {"action": "Pretend to help, then backstab her", "result": "“I’ll help you seeing as I don’t have much choice.”\n\n\n“Great!”\n\n\nAria conjures a portal made of dark matter.\n\n\n“What are you waiting for, jump in!”\n\n\nYou instead jump at her with your sword. This does not go as planned as you are reflected by a pulse of telekinetic energy.\n\n\n“I had a feeling you might betray me. After all, I did just massacre half of your city. Humans emotions are soooo predictable.”\n\n\nBefore you can even scream, she burns you head to toe. You are reduced to a bubbling puddle of human flesh.\n\n\n“Great, what body will Azor possess now?", "action_results": []}]}, {"action": "Contact Catia", "result": "How could you possibly save your city and survive? As much as you don’t want to admit it, you can’t win without some help. You sprint to the drunk tortoise tavern (which luckily is on the opposite side of the city that is being terrorized) and bust through the door. It’s completely empty aside from a single person.\n\n\n“Long time no see bud.”\n\n\nIt’s Greg, he has bright red cheeks and is swaying slightly.\n\n\n“Why are you still here? There’s a demon on a murder rampage outside!”\n\n\nHe chuckles then says,\n\n\n“Sometimes you don’t want to be saved. I’m staying here and if I die, so be it.”\n\n\n“Well let me join you,” you say with no intention of sitting around to die.\n\n\nYou and Greg sit together and talk about all sorts of things while drinking. This isn’t like the before, when the conversation revolved around meaningless hypotheticals. You delve into some deep shit in a relatively short amount of time. You talk about politics, the meaning of life, and what happens after you die. While this is all going on, the demon continues massacring your entire city. Oops, looks like getting drunk has made you forget your priorities. When the realization dawns on you after a few drinks, you waste no time in shouting,\n\n\n“Catia!”\n\n\nGreg squints at you, clearly remembering the name from the last time you talked. This look of curiosity turns into horror as a swirling red cloud appears in front of you. Catia stands before you but looks much different than before. Unlike her human-like form, she has dark red skin and humongous bat wings.\n\n\n“You call me once again, how pathetic are you?”\n\n\nThis question strikes you with surprise as it’s the first time she has shown open hostility towards you. Greg on the other hand begins laughing, then says,\n\n\n“Is this the demon that’s been destroying the city? Man, I thought it would be at least a little bigger than that. I know it's rich coming from me, but damn how can something as small as that destroy the city?”\n\n\n“Shut up already Greg! This isn’t the demon that’s been attacking the city.”\n\n\nGreg looks at you in confusion as Catia speaks up,\n\n\n“He's right you know, I haven’t killed a single person in weeks. That is, until now.”\n\n\nCatia takes to the air and flies towards Greg. His drunken state makes him slow to react as Catia rips his throat out. Blood sprays everywhere like a broken faucet.\n\n\n“Who’s the small one now, bitch?”\n\n\n“Jeez I know he was asking for it, but you didn’t have to kill him.”\n\n\nCatia turns her head towards you and shows no remorse. Her pupils have shrunk, giving her eyes a milk white appearance.\n\n\n“This is all your fault, why couldn’t you have just listened to Aria?”\n\n\nShe advances towards you, snarling like a wild beast.\n\n\n“Wait just a second I didn’t have a chance—“\n\n\nAnd you didn’t have a chance to finish that sentence either as Catia pulls your throat off your body like a soldier grabs a sword off a rack. You die in a puddle of mixed, throat extracted, blood.", "action_results": []}]}]}, {"action": "No, let’s just talk.", "result": "As the words leave your lips you feel Catia’s mood shift. She seems more hostile saying,\n\n\n“Do you not find me attractive or something? I don’t have time to talk and have many more people to see after you. Let’s focus on the now shall we? Take of your clothes.”", "action_results": [{"action": "Take of your clothes", "result": "You follow her command as she details step by step what you should do.\n\n\n“Ok now remove your tunic. Good, throw it on the floor and put your pants on top. Great job!”\n\n\nShe tells you things along the same lines until you're completely devoid of any clothing.\n\n\n“Now here comes the fun part, get on your hands and knees.”\n\n\nYou’ve already come this far, might as well comply. You get down and have to arch your back to stare up at her. The uncomfortable position does not bother you as all you can focus on is her figure. Damn she sure is beautiful. Especially when she says incantations. Hey, that’s what she’s saying right now!”\n\n\n“Sarahkahnar Hor zeef narze taf!”\n\n\nWhen she finishes you have a out of body experience. It’s like you're having an orgasm all over your body. Yet, it’s so much more than just that. Your whole room is having an organism and you feel it all. The walls, the table, the bed, and even clumps of dust experience this sensation along side you. It’s magical and you don’t care if she’s a so called demon, she is a blessing to this world. You can’t keep this feeling inside and whisper,\n\n\n“I love…”\n\n\nYou pass out before finishing from pure ecstasy. When you regain consciousness you feel utterly cold. You’re naked as Catia towers over you.\n\n\n\"Saying the word 'love' after our first night together tells me all I need to know about you.\"\n\n\n\"What's that?\"\n\n\nShe grows quiet and says in a pitiful tone,\n\n\n\"You're too weak-willed to be of any real use to me. Best I throw away the trash before it makes my presence known.\"\n\n\nYou try to question her but find yourself unable to move. A white spirit begins to flow out of your body.\n\n\n\"Don't think I'm taking your soul or anything. I'm merely releasing you from your human form.\"\n\n\nSoon everything turns black as you find yourself floating in infinite space. Other floating spirits whiz around, but you're unable to communicate with any of them. You never escape this purgatory and soon forget how you got here. The weak-willed guard from Ashton is remembered as nothing more than a victim of the demon invasion.", "action_results": []}, {"action": "Refuse", "result": "“I will be doing no such thing,” you say in protest.\n\n\nCatia raises her eyebrow before breaking out in laughter.\n\n\n“Well this is a first,” she says.\n\n\nYou stare at her as she seems to be deciding whether she’ll force you to remove your clothes. You feel the sweat drip down your back when she finally says,\n\n\n“Maybe I really deserved to be sent here. I can’t even manipulate a human into having sex with me.”\n\n\nA black cloud appears as she disappears from your room. You start violently coughing but don’t pass out this time. It’s not like it matters, you need to sleep anyway. You put out your candles and fall into bed. You focus on your breathing as you drift off to sleep. Best to reflect on what happens when you have a clearer mind.\n\n\nYou wake up with a throbbing pain in your head. The light coming from your window floods your mind with intense pain. Guess you drunk more last night than you thought. You decide its best to make yourself some food and drink to clear your head. You grab water and a slice of peach pie you made a few days ago. You scarf the food down and shallow the water in huge gulps. Your head should start feeling better within the next few hours.\n\n\nExcept it doesn’t, you lie in bed with constant tension on your head. It’s like someone is squeezing your brain with both hands, but not hard enough to cause physical harm. Something unnatural is going on and you know it. Hangovers should get better after rest, not worse. It’s hard to focus on anything but the pain. You try remembering what Catia did before she left. She dispelled a black cloud which didn’t knock you out. Is it possible this was a curse?\n\n\nThe more you think about it, the more it makes sense. While she tried not to show it, she was upset you resisted her temptation. She wanted you to pay for hurting her ego. That bitch! As you think about her more, tension is released from your skull. In fact, you're able to think about her in vivid detail and feel headache free. Although, the second you stop thinking about her the pain comes rushing back. This certainly isn’t good.\n\n\nYou’re going to have to do something about this. There is one obvious solution which is trying to contact Catia and having her remove the curse. Though who knows if she’ll even remove it, assuming she still wants to visit you. The other option is going to a local witch doctor and having them remove the curse. Although, you’ve heard they’ve been busy since demons first started being sighted. Maybe the curse is temporary, why not wait it out?", "action_results": [{"action": "Call for Catia", "result": "You can barely move, so you know you’re in a susceptible state. The question is, does she still want to see you?\n\n\n“Catia,” you whisper.\n\n\nYou wait a few tense seconds and feel the pain in your head begin to relieve itself. But then, nothing. She never comes and the pain comes rushing back. You find tears streaming down your face as you realize your chances with Catia are probably over. You’re also in no state to continue working as a guard and will probably be fired soon. The only thing you can do is lay in bed and suffer.\n\n\nDays past and your state of mind only gets worse. You begin seeing shadowy figures at the corner of your eyes. One day you manage to touch one and ask,\n\n\n“Who are you?”\n\n\nHe laughs and laughs before disappearing. This isn’t the most psychologically scaring part of this ordeal. Your recurring nightmares are much worse. You dream of your family returning home in vivid detail, only for it to all come crashing down as you realize they're not real. You stop eating and drink only when necessary. It gets to a point where you know if you don’t try to seek help you will die.\n\n\nYou have no idea where to go for help, especially since the local witch doctor has been arrested for using humans as potion ingredients. You wander aimlessly taking morning walks in a vain attempt to find your savior. Shadowy figures whisper about you as you walk past.\n\n\n“There’s nothing out here, return home”\n\n\n“You’re never going to get better, why not end it?”\n\n\nYou’ve been seeing these shadowy figures more frequently recently. You chalk this up to your lack of sleep. Sleeping is when your most vulnerable, so you try to do as little of it as you can.\n\n\nDuring a morning walk you run into a familiar face. It’s your childhood friend Julia. You haven’t seen her since schooling and boy does she look different.\n\n\n“Is that…” she says\n\n\n“Yeah it’s me,” you reply\n\n\n“Boy do you look different.”\n\n\nYou haven’t been grooming yourself since the madness occurred. You have lots of dark circles under your eyes and probably don’t smell too good either.\n\n\n“You also look different.”\n\n\nShe raises an eyebrow not knowing if your complementing or insulting her.\n\n\n“In a good way in a good way!” you clarify.\n\n\nShe laughs as her dress flows in the wind.\n\n\n“Sorry I can’t say the same to you. Down on your luck?”\n\n\n“That’s putting it lightly,” you say jokingly, even though it’s the truth.\n\n\n“Hahah I bet. I was just about to get some coffee, wanna come with?”\n\n\n“Would I ever! Is it ok if the shadow people follow along?”\n\n\n“The what?”\n\n\n“Never mind.”\n\n\nLater\n\n\nJulia and you decided to go to the Cinnamon Pearl Cafe. As fancy as it may seem, its nothing more than a place to eat pastries and drink coffee. She begins telling you what’s she’s been doing lately.\n\n\n“You know Andy right?”\n\n\n“Of course, me and him have been on guard duty together a couple times.”\n\n\nJulia bites her lips and chooses her words carefully,\n\n\n“Well we broke up recently due to the fact that he...he...raped me...”\n\n\nYou’re shocked at this revelation, Andy has always seemed like a standup guy.\n\n\n“How could he do such a thing?”\n\n\n“He’s a piece of shit that’s how!”\n\n\nYour lower your head as she composes herself.\n\n\n“Sorry, I’m just not in the best mental space right now.”\n\n\n“No need to apologize, you have every right to be angry.”\n\n\n“Thank you.”\n\n\n“So tell me, what happened?”\n\n\nShe explains how one night, after a long tiring day working as a cleaner, Andy wanted sex. They had been dating for a few months and had yet to have sex. The conversation went a little like this,\n\n\n“All of my other friends constantly brag about sex. If I keep telling them I haven’t fucked you yet they might start thinking I’m gay,\" says Andy.\n\n\n“Stop pressuring me! I told you, I am not in the mood and am not ready to pursue that kind of relationship with you.”\n\n\n“You’re such a bitch, you know that right? Fuck you make me angry,” Andy says while walking towards Julia menacingly.\n\n\n“Back off, get away from me!”\n\n\nJulia stops talking and begins to choke up. She covers her face with her hands and says shakily,\n\n\n“He grabbed me and wouldn’t let go. I tried to scream but he covered my mouth and clenched my throat. He violated me and nobody cares to do anything about it. Everyone’s to focused on the damn demons to give a shit about poor ol’ me.”\n\n\n“That’s horrible, who else have you told?”\n\n\n“Just you and the captain of the fucking guards. He wouldn’t even fire him, saying the demand for guards is ‘very high’ right now. No guard is better than a guards that’s a mother fucking rapist.”\n\n\n“I wish I could help, but the captain probably won’t listen to me anymore. I haven’t shown up for work in days and didn’t give any notice.”\n\n\n“It’s ok, I don’t want the captain’s help anyways. I need to move on and be strong.”\n\n\nYou make small talk about various things before saying your goodbyes. With Julia in such a vulnerable state, you wonder if it’s best to give her time to heal. At the same time, you long for human relationship. The shadow figures just aren’t the same as real human contact.", "action_results": [{"action": "Give her time to heal", "result": "You decide it’s best to give it time before pursuing a relationship. Not just for her, but you as well. You figure you’ll stop seeing shadow people sooner than later and be in a better headspace. A few days go by and the shadowy figures start to appear in the corner of your eyes. You’re starting to regret your decision of not pursing Julia but they reassure you.\n\n\n“You’re better of without her.”\n\n\n“Why have friends when you have us?”\n\n\nAnd a particularly rude one says,\n\n\n“She’s much better off without you in her life.”\n\n\nYou stop your morning walks and live a hermit lifestyle. You start eating bugs off the ground as you’ve long since ran out of food. This is no way to live your life and you know it. In a moment of clarity you sprint out of the house and run to “The Devil’s Cliff”. You jump off laughing as you’ve hit rock bottom in life and now in death.", "action_results": []}, {"action": "Pursue a relationship", "result": "You’re both facing adversity in life. In a sense, you’ve both been raped. Julia in a literal sense and yourself in a mental sense. Catia cursed you and has left you a shell of your former self.The past few days have been hell. Why not reconnect with a old friend and see if it leads anywhere? Everyday you walk to the Cinnamon Pearl Cafe hoping to see Julia. A few days go by and you never see her, however it’s not all bad. You’re now eating and staying hydrated, which is never a bad thing. You haven’t seen any shadow people in days and have stopped having nightmares. Things are looking up for you.\n\n\nOne day after ordering your usual (a cup of coffee and cinnamon toast) Julia walks in. She’s all alone and you make eye contact with her. She winks at you and holds up a finger indicating that you should give her a second. You watch as she orders a coffee and raisin bread. After paying, she walks over to join you.\n\n\n“I’m surprised to see you here,” she says.\n\n\n“I’m here all the time now. I mean, their coffee’s really great.”\n\n\nShe laughs and asks,\n\n\n“How have you been doing?”\n\n\n“I’m great, but I’ve been worrying about you, how have you been holding up?”\n\n\nShe gets a little teary eyed while saying,\n\n\n“That’s so sweet of you, but you don’t have to worry about me. I’m planning on leaving Ashton tomorrow morning.”\n\n\nYou sit mouth agape shocked at the news. She could have easy left without telling you. You might have gone mad waiting for her, but now you have a chance to leave with her.\n\n\n“Why are you leaving? I get why you might not want to live in a place with bad memories of your past, but why leave so soon?”\n\n\n“It’s no longer safe here and you should know better than anyone being a guard and all.”\n\n\n“Former guard, and what do you mean it’s not safe? I haven’t heard of any demon sightings...”\n\n\n“Well there was one just a few nights ago and people living in Ashton died. I have family up in Kingsburg and know I’ll be safe there.”\n\n\n“Are you going all alone or bringing anyone with you?”\n\n\n“As of now, all alone. I don’t know how difficult travel will be, back if I survive, I’ll finally have a place to call home.”\n\n\nYou really don’t think it’s a good idea for her to travel alone. One for the selfish reason of wanting to be close to her, but also because it’s the middle of winter and travel hasn’t been safe since the demonic invasion. This is all happening so fast, you barely know Julia the adult considering you just reconnect with you. Will she even let you come with her if you ask?\n\n\n ", "action_results": [{"action": "Ask if you can come with her", "result": "“Hey do you think I could go with you?”\n\n\n“Umm...why would you want to do that?”\n\n\nYou explain how you don’t have any reason to stay in Ashton anymore. Your parents are likely dead and you’re unemployed. A new start in Kingsbury is just what the doctor ordered. \n\n\n“You can come...just meet me outside the Cinnamon Pearl at dawn.”\n\n\n“Yes! Thank you so much, I can’t wait!” \n\n\nYou leave the cafe and feel an incredible sense of euphoria. You can’t believe she said yes, although she was a bit apprehensive. You can’t wait to show her that she made the right choice in letting you come along. You spend the rest of the day gathering all your most prized belongings. You also take all of your parent’s savings figuring they’re never coming back. You fall asleep and begin to dream...\n\n\nYou're back in school and are sitting next to Julia. You don't hesitate and begin talking to her fully lucid of your actions.\n\n\n\"Hey Julia! Want a cookie?\"\n\n\nYou pull a cookie out of thin air and hold it out to her. She reacts in disgust,\n\n\n\"Did you really think you could win my love so easily? Andy's my boyfriend and we're going to be together forever!\"\n\n\nYou stammer out,\n\n\n\"One day you'll realize Andy isn't as nice as he may seem. Appearances can be deceiving...\"\n\n\nShe bursts out in hysterical laughing and you have no idea why. Your look of confusion becomes apparent as she says,\n\n\n\"Appearances sure are deceiving!\"\n\n\n\"Yeah...\"\n\n\n\"For instance, I'm not even Julia.\"\n\n\nYour pulse increases as you feel yourself losing control. Julia's face contorts feature by feature. First, her eyes turn red, then horns grow out of her head. By the end of it you are staring face to face with the demon of your nightmares.\n\n\n\"Catia?\"\n\n\n\"You may think you've escaped me, but Julia will never be your true love.\"\n\n\n\"Shut up! Julia's just a friend...\"\n\n\n\"No, YOU shut up! I know your deepest secrets and desires. Why keep up the charade? I know you think Julia can fill the void in your life, but that's just a fantasy.\"\n\n\n\"None of this is real and that includes you. This is nightmare, that's all.\"\n\n\n\"Go ahead, believe that. Just don't act like I didn't try to warn you.\"\n\n\nYou wake up as your head pounds like never before. You're suddenly very scared and seeing Julia and aren't sure why. It's clearly irrational, but a part of you wants to contact Catia again. Who's to say the curse will go away just because you're with Julia? Should you even bother?", "action_results": [{"action": "Go to the Cinnamon Pearl", "result": "It's best to ignore the nightmare and pretend it never happened. You head to meet Julia at the Cinnamon Pearl. You arrive shortly after and see her waiting for you.\n\n\n“Ready to go?”\n\n\n“Ready for anything,” you stay while brandishing your sword.\n\n\nThe road to Kingsbury is no easy journey. You feel Julia is glad you came along as you can scare away any thieves and bandits you come across. Who knows if you’ll make it in one piece but at least you have a purpose. You leave through the city walls and take the old dirt road to Kingsbury.\n\n\n“You know the forest would be faster?” you say.\n\n\n“I know, I have a feeling we’re much safer this way.”\n\n\nYou look at her and smile. Her blue eyes sparkle as you realize one thing: true beauty is in the eye of the beholder. You’ve been staring it in the face since childhood and are only realizing that now.", "action_results": [{"action": "Epilogue #4: The Kingsbury Kiss", "result": "The journey to Kingsbury wasn’t easy. You and Julia saved each other’s behind on multiple occasions. Through adversity, you grew closer together. Once you arrived at Kingsbury you had no plan. Julia saw this and invited you to stay with her. Before you knew it, you two started dating. She was everything you’ve ever wanted and more. You never cared that she wanted to take things slow, in fact, you embraced it.\n\n\n“You only live once, might as well enjoy the whole ride,” you said to her one night.\n\n\n“Oh shut up, you and your cheesy sayings need to stop,” she says while touching your shoulder. \n\n\n“You want me to shut up? I’ll do it, just for you my Cinnamon Pearl.”\n\n\n“If you say something cheesy one more time I’ll...”\n\n\n“You’ll what?”\n\n\nShe pauses and stare at you with her beautiful, shinning blue eyes. You don’t have time to react before she leans in and says,\n\n\n“I’ll... kiss you.”\n\n\nYour lips connect and you feel a fullness in your heart for the first time in years. You’re reminded of the night you met Catia where everything about her gave you joy. Except this time it’s different, this isn’t some spell or magical aura. This is all real, and you can’t believe it.\n\n\n“I love you,” you say to remind yourself this is really happening.\n\n\n“I love you too.”", "action_results": []}]}, {"action": "Summon Catia one more time", "result": "You don't care if it's irrational, something deep inside says you need to see Catia. You head out to The Drunk Tortoise Tavern to get in a \"more suggestive state\". It's warmed up quite a bit since the last time you've been there and you're glad. New weather, new you, and perhaps a new Catia? You can only hope...\n\n\nAs you daydream, you lose track of where you're going. You don't even realize it when you take a wrong turn and end up in a dark alley. Logic tells you it's too dark to see anybody, but that isn't the case. The shadow people are back and they have you surrounded! You press yourself up against a wall and begin to scream.\n\n\n\"Hey, quiet down. We're not here to torment you,\" a shadow person says.\n\n\n\"In fact, we're here to prevent you from making a huge mistake,\" another says.\n\n\nThey explain how they weren't always shadow people. They used to be everyday people; soldiers, farmers, merchants, and every other occupation imaginable. However, one day they met a succubus and fell in love.\n\n\n\"I didn't want to go through with it, but once the madness hit I kept crawling back,\" one says.\n\n\n\"We all kept crawling back. There is a point where you lose so much individuality and can't even make decisions for yourself.\"\n\n\n\"That's how we all became shadow people. We lost our faces, our bodies, and our past to the abyss.\"\n\n\nYou can't believe you're having a full on conversation with the shadowy figures after all this time. You've completely lost it, why not see where this goes?\n\n\n\"Ok, so you lost all your individuality. How are you able to talk to me and tell me all of this?\"\n\n\n\"What?\"\n\n\n\"You said it yourself, you couldn't make 'decisions for yourself.' If so, how are you here right now?\n\n\n\"Shit he's on to us!\"\n\n\n\"What should we do, can we still trick him?\"\n\n\nYou shift uncomfortably.\n\n\n\"You idiot, why would you say that? Now we have to kill him.\"\n\n\nYou get up and try to run. You figure they aren't real and can't hurt you. Well, it turns out they can. They punch, kick, and slap you into a bloody mess.\n\n\n\"Finally, I will have a face again!\"\n\n\nThey begin to peel away your skin and plaster it on their body. All the shadow people converged into a single mass resembling a ball. They tear off your arms and legs and add it to the mass. You're fully converged to the ball-like mass as a portal is conjured before you.\n\n\n\"Into the forest!\"\n\n\nYou're don't die and live as part of this abomination. Your life is an eternal nightmare.\n\n\n ", "action_results": []}]}, {"action": "Wish her good luck and say goodbye", "result": "“Well best of luck, but I have to go.”\n\n\n“Ok...goodbye.”\n\n\nYou leave and give her a smile, but on the inside you feel horrible. Why didn’t you ask if you could come along? The worse that could happen is her saying no, but at least you could say you tried. You arrive home and spend all day inside. During sleep, you have your first nightmare in days. Seeing no reason to go to the Cinnamon Pearl Cafe now that’s Julia is gone, you stay inside all day. The shadow people start showing up in the corner of your vision and they taunt you relentlessly. Since you’re not eating or drinking, you don’t have the energy to leave bed anymore. You spend the next few days like this regretting the choice you made.\n\n\nOn a day like any other, you die from dehydration during your sleep. Rest easy knowing you’ll never have a nightmare again.", "action_results": []}]}]}, {"action": "Visit the Witch Doctor", "result": "Your brain aches with pain and going to what you assume is the source of the pain will probably make it worst. While you’ve never been too trusting of witches, you know a local one with good reputation. As you make your way outside the light pierces through your skull. Your eye sockets feel like their burning and your brain feels like it’s melting. You press on and begin to enter the slums of the city. The practice of brewing potions containing humans, a required ingredient for witch doctors, is not exactly legal. Still, you are in no place to have such prejudice considering if your head keeps pounding like it is now, you might just kill someone.\n\n\nYou reach the witch doctor’s office and make your way inside. It’s pretty busy at the moment, which is no surprise as people want protection from demons. You wait in a line of about twenty people. The pounding has intensified, and you aren’t even aware how much time has passed when somebody says,\n\n\n“Excuse me, do you need to see the witch doctor”\n\n\n“SHUT UP!” you snap.\n\n\nThe clerk cowers as you finish screaming at him. You manage to calm down and whisper,\n\n\n“Please help me.”\n\n\nThe clerk nods and orders you to follow him. You go down a hall way affixed with a assortment of trinkets and baubles pinned to the walls.\n\n\n“To keep away evil spirts,” the clerk explains.\n\n\nThere is a huge variety of objects that you would normally want to know more about. You are in no mood now though and continue down the hall until you reach the doctor.\n\n\nYou enter a room lit only by bright red stones. In the center lays a boiling pot emitting the scent of rotten egg. The bright lights distract you from even noticing the witch doctor standing right in front of you.\n\n\n“I sense a demonic curse within you. Don’t worry, I know the perfect potion for you.”\n\n\nThe witch doctor, who prefers you call her “a potion brewer”, starts throwing a concoction of ingredients into a cauldron.\n\n\n“One imp carcass to ward off spirts, 2 cups of orc blood for personal strength, and a dash of lemon juice.”\n\n\n“Why lemon?’ you ask.\n\n\nShe smiles and says,\n\n\n“For flavor silly! Do you think you could stomach a potion solely comprised of raw meat and blood?”\n\n\nShe mixes everything together and pours out the cauldron into multiple bottles. She hands you one and the smell alone relieves your head. You down the vial and struggle to hold back from vomiting. It’s a lot thicker than you thought and the blood clumps up in your throat. The potion brewer notices your discomfort and gives you a small vial composed of a black liquid.\n\n\n“Drink this it will help.”\n\n\nYou do as told and gulp the vial down. It seems to do the trick as the clumped blood slides down your throat. You still want to vomit out your insides.\n\n\n“So how will you be paying today, soul or servitude?”\n\n\n“I thought you accepted coin.”\n\n\n“Oh, we do, but the black vial I gave you was extremely valuable. The ingredients needed to make it cannot be paid by mere coin.”\n\n\n“What! How expensive can it be to make a potion that clears your throat?”\n\n\nShe laughs and shakes her head before saying,\n\n\n“That’s not what the potion did, silly! It’s what I give to people if I sense they are close to death. It will prevent any proximate death, but can only be used once.”\n\n\n“Why not just give me something else then?”\n\n\n“I wasn’t sure if the curse was attacking you or if you were having an allergic reaction to the potion. While I can sense a lot, I’m not psychic. Rather than make a guess I did the only thing I could to guarantee your life.”\n\n\n“I suppose that makes sense.”\n\n\n“Great! Now how about that payment, soul or servitude?”", "action_results": [{"action": "Soul", "result": "“I’ll pay with my soul.”\n\n\nShe smiles and says,\n\n\n“I was hoping you’d say that.”\n\n\nShe latches onto you and pushes you to the ground.\n\n\n“Clerk Anthony, tie him up!”\n\n\nThe clerk pounces and takes out a long thread of rope while the potion brewer holds you down. The rope is wrapped around your hands and legs and you’re tied up like an animal.\n\n\n“Now time to harvest your flesh!”\n\n\nThe witch, which is more apt of a title, pours a white liquid mixed with thousands of black dots down your throat. It’s not until you shallow when you realize what those black dots were, ticks! They burrow into your mouth and bite your gums. You feel bumps forming on your tongue, gums, and uvula. Then the biting spreads to your throat. More bumps form and you’re unable to breath. Your face starts to turn blue and your senses dim.\n\n\n“He’ll be dead soon.”\n\n\n“But what about his soul, master?”\n\n\nShe laughs and says,\n\n\n“I never wanted his soul silly! My herbal tea requires human flesh.”\n\n\nThis is the last thing you hear before blacking out. Hopefully the tea was good.", "action_results": []}, {"action": "Servitude", "result": "“I’ll pay in servitude.”\n\n\nShe frowns and murmurs,\n\n\n“I wish you chose the other option That would have been a lot more fun.”\n\n\nShe explains how in exchange for saving your life you will be her assistant until she considers you debt repaid.\n\n\n“My name’s Helena by the way, but you can call me master.”\n\n\n“Can as in I have a choice?”\n\n\n“You really are silly! No, can as in you can chose to call me master if you want to live, Understood?\n\n\n“Yes…”\n\n\n“Yes what!”\n\n\n“Yes master…”\n\n\nYou begin work immediately and are sent out to gather various herbs for her potions. One day while gathering a rare mushroom, you encounter a demon who screams,\n\n\n“I CRAVE DESTRUCTION!”\n\n\nYou try to run but he sends a bolt of fire into your chest. You burn into blackened ash.", "action_results": []}]}, {"action": "Wait", "result": "You continue lying around and try to fall asleep. The pain won’t let this happen and you lie in bed starring at the ceiling. You start thinking about Catia again as it seems to be the only thing you can focus on. You think about how much of an idiot you are for passing up sex with a demon.\n\n\nYour front door makes a loud squeaking sounds followed by footsteps. Is Catia back to finish the job? You try to get to grab your sword but your head pounds forcing you to stay in bed. Expecting Catia to kill you at any second, you are very surprised to hear,\n\n\n“Son, I’m home.”\n\n\n“Mmmm—-mmmmm—-mmother?\n\n\n“Yes, it’s me and I come baring bad news. Your Father, he was killed on our way home. I feel so empty I don’t know how I’ll go on.”\n\n\nShe begins crying into her hands. The pounding in your head stops, allowing you to get up to comfort her.\n\n\n“Everything will ok you just have to stay strong,” you say while patting her back.\n\n\nYour mother looks up at you and smiles. Her blue eyes shine through the tears and you know everything will be ok. She goes in to hug you and you return the favor. As you embrace, she massages your back making you feel like a kid again. She whispers into your ear,\n\n\n“Will you sleep with me tonight? I don’t want to be alone after all that’s happened.”\n\n\nNow you’re really starting to feel like a kid again. This is your mother and as sad as it sounds, you could also use some company after all that’s happened.\n\n\n“Sure, I don’t want to be alone either.”\n\n\nYou both fall into bed and feel instant relief. She moves closer to you and grabs your hand. She moves your arm over her body and huddles your body close to your chest. As much as you want to say something about how uncomfortable this makes you feel, you know she needs company after all she’s been through. You no longer feel like a kid, but feel like your father? This is pretty weird, but its just one night. One weird night is nothing to be alarmed about.\n\n\nYou drift off to sleep and have the best night of rest you’ve had in years. When you wake up you're surprised to find your mother still pressed up against your chest. Not wanting to disturb her, you just lay there eyes open. Your headache is gone, and you think you know why. Only the love between a son and a mother could dispel the curse Catia put on you. Your mother soon wakes up and says,\n\n\n“I don’t want to be too forward, but can we do this again tonight? The horrors I saw, the bloodshed, is too much for me to be left alone with my thoughts. I need someone to be my rock, so I don’t fall into the pit of despair.”\n\n\nYou’ve never seen your mother so sad before, thought its understandable. The question is, are you ok with doing this again? Sure, one night of sleeping in the same bed of your mom after such trauma isn’t that crazy. But doing again, that may be a bit crazy.", "action_results": [{"action": "Agree to be her rock", "result": "You agree to comfort her again tonight. It’s as weird as the last time, but it seems to make your mom happy and that’s all a son could want.\n\n\n“Thank you, I need this right now,” she says as you massage her back.\n\n\nYou sleep in the same bed as your mom everyday for the next few weeks. Demon sighting have been occurring more frequently and your mother is becoming increasingly worried.\n\n\n“I think we need to get out of Ashton before its too late,” she says.\n\n\n“Where will we go and how could we survive alone?”\n\n\n“I know a place, but you have to trust me.”\n\n\nYou have no reason not to trust her and follow her once nightfall arrives. You leave the city walls and venture into a nearby forest.\n\n\n“Where exactly are we going?”\n\n\n“You’ll see.”\n\n\nShe speeds up showing a surprising amount of fitness for a middle-aged woman. You eventually reach a clearing where a river flows against rocks.\n\n\n“It’s beautiful,” you say stunned..\n\n\n“Not as beautiful as you,” your mother says with a playful wink.\n\n\nIt gets kind of awkward for a bit until you break the silence.\n\n\n“I still don’t understand what we’re doing here. How is a forest any safe than Ashton?”\n\n\n“Oh, it’s not safer at all. I just wanted to go somewhere nobody could hear you scream,”\n\n\nYour mother dashes at you with inhuman speed. She pins you down and starts ripping off your clothes\n\n\n“Ever since father died, I’ve had to suppress my sexual desires. Not anymore, never again.”\n\n\nYou try to struggle but it's no use. You find yourself buck naked in the middle of forest.\n\n\n“I want you to enjoy this as much as I do, so please don’t fight back.”\n\n\nYou always assumed you were stronger than mother but aren’t so sure now. Perhaps you should give in to a deep seeded desire you’ve repressed for all these years.", "action_results": [{"action": "Give In", "result": "You decide to just enjoy yourself and throw away all logic. This plan backfires once you begin to have sex. This is all wrong, and its not because its your mom, it's because…\n\n\n“WHY DID YOU HAVE A PENIS!” you scream.\n\n\nYour mother’s voice grows deep and she begins to laugh. You are at her mercy as tears begin to fill your eyes. When it's all done you are left humiliated and at a loss of all self-ego.\n\n\n“I don’t understand.”\n\n\n“What’s there not to understand? I pretended to have your mom to have sex with you. I assumed you were a momma’s boy by the way you repelled my sexual aura. My assumption was correct!”\n\n\nYour mother face contorts feature by feature. First, her eyes turn red, then horns grow out of her head. By the end of it you are staring face to face with the demon of your nightmares.\n\n\n“Catia?”\n\n\nYou are given no explanation as she sends a powerful blast of dark energy at you.\n\n\n“You may have been able to repel my aura, but you can’t repel dark magic.”\n\n\nIt strikes you and tears a hole through your heart. You die both literally and metaphorically heartbroken.", "action_results": []}, {"action": "Struggle", "result": "This is way too far, and you do not want it in any way.\n\n\n“Mom, I love you, but please don’t do this.”\n\n\nYou expect her to understand, but her reaction is completely different.\n\n\n“Are you impotent or some shit?”\n\n\nFor the first time in a long time your head starts pounding again. She continues,\n\n\n“I mean I know you are right now, but I are you impotent in terms of sex?”\n\n\n“I don’t want to have sex with my own mother! If that makes me impotent then I guess I am.”\n\n\nShe grows angry and grabs your crotch.\n\n\n“It’s not just that! You didn’t even want to have sex with a hot succubus. I thought you must have had some mommy issues, but that doesn’t seem to be it either.”\n\n\n“Whaaaaa,” is all you have time to say before she tears your crotch off.\n\n\n“That’s for wasting my time!”\n\n\nShe finishes the job by setting you on fire and spitting on your charred corpse.\n\n\n“And that’s for being a bitch.”", "action_results": []}]}, {"action": "Put a stop to this now", "result": "This is just too weird, and it needs to stop before spirals into something else.\n\n\n“Mom, I love you, but I just don’t think this is the best path of recovery.”\n\n\nYou expect her to be sad, maybe cry a little, but her reaction is completely different.\n\n\n“GOD FUCKING DAMN IT YOU ARE TOO PURE!” she screams.\n\n\nA cloud of dark smoke blinds you as your mother morphs into a demon like form.\n\n\n“Mother, what happened on your trip?” you say while blinded by smoke.\n\n\n“You insolent fool, I’m not your mom I am a succubus.”\n\n\nThe smoke clears and you find Catia standing before you.\n\n\n“Whaaaaa,” is all you have time to say before she tears your head of.\n\n\n“That’s for wasting my time!”\n\n\n ", "action_results": []}]}]}]}]}, {"action": "Tell him to fuck off", "result": "“Fuck off worm.”\n\n\nGreg surprises you when he snaps back,\n\n\n“Connor and Tom picking on me is one thing, but you? I don’t know why, but I thought you were different.”\n\n\nFor a second, you feel hurt. But then you realize it's Greg and feel a bit better.\n\n\n“Your fault, not mine. Now do as you're told and stop following me,” you say while walking away.\n\n\nThis guys persistent and runs to catch up when you start walking fast. Are you going to have to kick the shit out of him so he leaves you alone? You hope not, but that may be the only option as he’s acting like a child.\n\n\n“I don’t want to go back to the tavern. Wherever you’re going, it's better than there.”\n\n\nHe’s probably not wrong, but it's beyond pathetic that he still follows you. Guess when you take so much abuse you can shrug it off pretty easily.\n\n\n“Go ahead, follow me. Just know if you try to enter my house you won’t be able to leave.”\n\n\nHe gulps but continues to follow you. He’s wasted a lot of your time so you decide to take a shortcut to your parents’ house. You find yourself exiting out of the slums and into the residential part of the city. Most guards sleep in the barracks, however, since your parents never returned from their trip their house is all yours. If they ever return, you hope they don’t mind you bringing a demon inside the house. Although, they were always bugging you about finding a girlfriend, this might not be what they had in mind.\n\n\nYou arrive at your parent’s old home and open the door. The wooden door squeaks loudly as you open it.\n\n\n“Some things never change,” you whisper to yourself.\n\n\nYou immediately start making yourself more presentable. You change out of your soldiers’ uniform and put on a loose-fitting black tunic. You probably should take a bath but you're too excited to see Catia that you forget to. Do demons mind odor?\n\n\nYou’re about to sit down in your bed when a chill runs down your spin. Your door makes a squeaking noise and a cold breeze rushes towards you.\n\n\n“I swear to god Greg! you shout.\n\n\nNo reply, although you don’t know what you were expecting. It’s possible the breeze pushed the door open, it's pretty flimsy and it wouldn’t be the craziest thing that’s happened in the last 24 hours. On the other hand, you can’t shake the feeling you're being watched. Should you investigate?", "action_results": [{"action": "Investigate", "result": "Maybe it’s paranoia, but what kind of brain-dead retard wouldn’t rather be safe than sorry? Assuming its just Greg, you don’t even bother grabbing your sword, and leave the bed room, checking every corner as you do so. This pays of as you notice a shadowy figure standing outside your bedroom. Is that…Lars?\n\n\nHe wastes no time in attacking you, but why? You’ll never know as he slams your head into his knee until you die.", "action_results": []}, {"action": "Ignore it", "result": "It probably was just the wind, no need to be paranoid. You hop in bed and close your eyes.\n\n\n“Cat---”\n\n\nYou head is struck making you collapse. You black out from what you assume to be Greg’s doing. Who knew he was so strong? You suffer intensive internal bleeding and die a slow, painful death.", "action_results": []}]}]}, {"action": "“I prefer a genius but cruel child.”", "result": "“My man!” shouts Connor.\n\n\n“Har har Greg probably wants a retarded child to have someone finally agree with him,” Tom jokes.\n\n\nTom and Connor start shouting about how much of a dumbass Greg is. You agree, but don’t join in on the berating. Instead, you walk out of the tavern without a second glance. As you make your way outside you are hit with a rush of cool air.\n\n\n“I can’t wait to meet Catia,” you mutter to yourself.\n\n\nYou tuck your hands in your pockets and begin the walk to your home. On the way, you bump into a familiar face. It’s Lars.\n\n\n“How did last night go?” he asks.\n\n\nSomething about Lars is rubbing you the wrong way. It might be his emotionless eyes or his downtrodden tone, but you feel like telling him about Catia is a bad idea\n\n\n“I nearly froze to death,” you say, wanting to be vague.\n\n\n“Yeah how exactly did you avoid doing that? When I left it looked like you were about to pass out.”\n\n\n“Just lucky I guess.”\n\n\n“Lucky huh? Well it’s your ‘luck’ that got me fired. Thanks a lot, now my family can starve to death before getting killed by demons.”\n\n\nYou remain silent.\n\n\n“The captain chewed my ass out for quitting guard duty. I thought he would berate me and give me a warning, but he fucking fired me. I told him how much bullshit that was because I would have frozen to death otherwise. He told me I was lazy and incompetent because ‘the other guard didn’t complain’ as if your dumbass was smart to stay.”\n\n\nYou try to apologize but Lars is having none of it. He gets angry and says,\n\n\n“I pray to god the demons invade and gut you and the captain like fish. Scrape out your insides with their claws and your other insides with their dick.”\n\n\n“Jesus man I said I was sorry.”\n\n\n“Sorry doesn’t feed my family. Get out of my way, I’m gonna’ drink until I die.”\n\n\nYou move aside as Lars storms past you. Well, that was an interesting encounter. You don’t even know what to think, were you wrong to lie to him? How would he have reacted if you told him the truth? You push these thoughts out of your head and focus on getting home. It’s super cold and you don’t want to freeze to death and not have a succubus save you.\n\n\nYou find yourself exiting out of the slums and into the residential part of the city. Most guards sleep in the barracks, however, since your parents never returned from their trip their house is all yours. If they ever return, you hope they don’t mind you bringing a demon inside the house. Although, they were always bugging you about finding a girlfriend, this might not be what they had in mind.\n\n\nYou arrive at your parent’s old home and open the door. The wooden door squeaks loudly as you open it.\n\n\n“Some things never change,” you whisper to yourself.\n\n\nYou immediately start making yourself more presentable. You change out of your soldiers’ uniform and put on a loose-fitting black tunic. You probably should take a bath but you're too excited to see Catia that you forget to. Do demons mind odor?\n\n\nYou’re about to sit down in your bed when a chill runs down your spin. Your door makes a squeaking noise and a cold breeze rushes towards you.\n\n\n“Is somebody there?” you ask.\n\n\nNo reply, although you don’t know what you were expecting. It’s possible the breeze pushed the door open, it's pretty flimsy and it wouldn’t be the craziest thing that’s happened in the last 24 hours. On the other hand, you can’t shake the feeling your being watched. Should you grab your sword and investigate?", "action_results": [{"action": "Close the door and get in bed", "result": "It probably was just the wind, no need to be paranoid. You hop in bed and close your eyes.\n\n\n“Cat---”\n\n\nYour head is struck making you collapse.\n\n\n“They may have taken my job, but they didn’t take my sword.”\n\n\n“Lars?” You ask through blurred vision.\n\n\n“Why yes, it’s me, demon! You really think I believed you survived on pure luck?\"\n\n\nHe looks completely unhinged. You try to say something but just start coughing blood. It comes out in chunks resembling mashed berries.\n\n\n“You really thought you could get away with it, didn’t you? HAHAHAHA! I know you’ve been possessed by a demon; how else could you survive the frigid cold?”\n\n\nClumps of blood continue flying out of your mouth as you fail to speak. Lars crotches down next to you and strokes your face.\n\n\n“It’s ok, calm down. Like I told you before, or at least the non-possessed you, the city could use some heating up.”\n\n\nWhere is this going?\n\n\n“I want to make a deal with you! Kill the Captain and I’ll let you live. Hell, I’ll even give you something in exchange. Perhaps a part of my soul? If there’s anything left in there.”", "action_results": [{"action": "Nod your head", "result": "That’s the last thing you do before passing. Between your shuttered eyes you can make out one last thing.\n\n\nAn even bigger smile on Lars’ face.\n\n\nThe next time you wake up your chained in darkness. You can still reach around a fair bit and waste no time exploring your surroundings by touch. When you get to your face you find it hastily wrapped in gauze and bandages. You shallow and taste dried up blood sticking to your mouth like honey. You really need a drink. With nobody around you start banging your chains against the ground. It makes a loud rattling sound that will surely attract anyone close by.\n\n\nNothing. Wherever you are nobody is here. Although, you assume Lars will be back soon. That is, unless he was killed as raving mad men often are. As you sit here hungry, tired, and thirsty you rack your mind trying to remember anything that can help you. Your head pounds with each thought, it feels like a hangover but a 100 time worse. Getting whack in the head may have some long-lasting effect on your mental capabilities.\n\n\nAfter a few minutes of fruitless concentration, it hits you. The thing that got you into this mess is what will get you out; Catia. While the alcohol has mostly worn off, your injuries have left you in a susceptible state. Assuming she wasn’t lying when she said she would meet you again, she should be able to get you out of this mess. You can’t believe you need a demon to rescue you, but you have no choice.\n\n\n“Catia,” you whisper.\n\n\nA few seconds pass and despair creeps in. Just before you lose all hope a dark cloud appears in the room. It dispels a nauseous fume that ferociously attacks your lungs. You start violently coughing more blood, mostly dry, as you vision blurs. Your eyes shut close and you feel your grip on reality slipping away.\n\n\nYou awaken to find yourself in a metallic cage. This room is much brighter than the one before.\n\n\n“When I saw you chained I figured a cage would make you feel right at home.”\n\n\nIt’s Catia and you’re getting a very different vibe from her than last time. Your gut tells you to do what she says as you are powerless.\n\n\n“Now tell me, how come I wasn’t the first one to put you in chains?” she says while licking her lips.\n\n\n“It’s not like it was consensual. I was blindsided and nearly died.”\n\n\nShe gives you a playful smile and whispers in to your ear\n\n\n“Tell me everything and don’t spare any details.\n\n\nSeeing as you don’t have much of a choice you describe everything that’s occurred since you last saw her. You don’t withhold even the most irrelevant details.\n\n\n“It’s nice to know you believe I exist. I know it’s hard to believe someone this beautiful isn’t a figment of your imagination.”\n\n\nHer red eyes pierce into your mind, daring you to think otherwise.\n\n\n“So, what do you think we should do about Lars?” you ask.\n\n\nShe starts laughing to herself.\n\n\n“What?”\n\n\nShe walks towards your cage and reaches inside. She puts her hand on your chin and points your head upwards. She locks eyes with you and grins widely\n\n\n“You’re going to kill the captain!”\n\n\nLater\n\n\nIt took a lot less convincing that you thought it would. Something about Catia just makes you want to obey her, though this time around you didn’t have much choice. She didn’t give you a reason other than saying\n\n\n“Chaos sows the seeds of discontent.”\n\n\nWhich if you agree with this line of thinking, you are only helping the infernal realm by following Catia. Her influence is so strong you didn’t consider any other option. Or maybe you just really want to fuck her. Either way, time to kill the captain.\n\n\nAfter releasing you from your cage, she offers to heal you with dark magic. You agree, as you can barely move let alone assassinate someone. What you didn’t know is that another demon would be performing the ritual.\n\n\n“Why is a human stinking up the place?”\n\n\n“Mind your manners, Jirzan. Someone finally wants you for your magic and you treat them like this?”\n\n\n“Heh I guess you got a point. They don’t call me Jirzan the Lunatic for nothing. Alright tell me what you need me to do.”\n\n\nShe whispers into his ear and is too quiet to understand. Though you make out words such as “transform” and painful.\n\n\nWhat exactly do they plan on doing to you? Perhaps you should try backing out of this whole ritual.", "action_results": [{"action": "Go on with it", "result": "Catia asks you to join hands with Jirzan and her. Once you do, they begin chanting nonsensical words. Their eyes roll into the back of their heads and their bodies go limp. After a few seconds they get up and it’s now you that’s limp. You feel excruciating pain course through your veins. Your skin burns, and it feels like fire ants are crawling in your eyes.\n\n\nYou can’t help but scream as every part of your body feels like hell, literally. Your skin starts to red and your head feels like it’s being ripped apart. They can’t be doing what you think they’re doing.\n\n\n“The transformation is working!” Jirzan shouts.\n\n\nYou begin spazzing out on the floor. This isn’t what you thought she meant by healing you.\n\n\n“Enjoy your new life under my servitude,” Catia laughs.\n\n\nYour body starts contorting as blood spills out of your eyes. You jolt in and out of consciousness while Catia laughs louder. Her voice sounds dreamlike as the room around you morphs into hell. You black out.\n\n\nWhen you wake up you find Catia and Jirzan shorter than before. In fact, the whole room feels smaller.\n\n\n“There he is!” shouts Jirzan.\n\n\n“How does it feel?” asks Catia.\n\n\nYou stare at them in shock.\n\n\n“What did you do to me?’\n\n\nCatia approaches you differently than before. She no longer seems to be trying to seduce you. Rather, she carries a wave of supremacy not present before.\n\n\n“You will obey my commands as long as I live. Now, get on your knees,” she says.\n\n\nYou try to protest, but find your whole body paralyzed. You assume this must be some sort of magic forcing you to obey. This however is not the case as she makes clear.\n\n\n“WHY AREN’T YOU MOVING?”\n\n\n“It seems like my ritual may have had some unintended effects.”\n\n\nYour body goes into an epileptic seizure as they start arguing over the ritual. None of that matter to you as your heart can’t support your new body. The world becomes a blur as you hear one last thing,\n\n\n“Great, I’ll never return home now that he’s dead.”\n\n\nWhile you aren’t dead yet, you will be soon. Your tale ends here.", "action_results": []}, {"action": "Back out", "result": "“Hey uh guys, I don’t know about this. I think it would be best if I just heal the natural way.”\n\n\nJirzan turns towards you and hisses.\n\n\n“You insolent fool! You dare turn the opportunity to become a demon, what else do you have going for you in life?”\n\n\nYou instinctively start backing away as he gets angrier.\n\n\n“Is it my epithet ‘Lunatic’ that scares you? You humans disgust me. If that scares you I couldn’t imagine what you’d think about the meaning of my first name.”\n\n\nWell his epithet played a role, but dark magic frightens you more. Now you’re curious about his first name and don’t hesitate in asking him,\n\n\n“What does Jirzan mean?”\n\n\nHe does a little dance and is excited to share,\n\n\n“Enslaver. My full name means translates to Enslaver the Lunatic. As a shorthand, ‘Deranged Enslaver’ works as well.”\n\n\nHe’s known as an Enslaver? Kind of ironic seeing as he is doing Catia’s bidding. How did he plan to enslave you with dark magic? Does dark magic break demonic rule or did he have no intent on subjugating you?\n\n\n“Were you planning to enslave me? How can you just do that, doesn’t a deal have to be made?”\n\n\n“A deal? Why do you think I was banished to earth? I don’t do deals and see no reason why I should. All I need is your consent to use dark magic and I can do whatever I want.”\n\n\nLooks like you dodge a bullet. Although, you’re still confused about this whole banishment to earth. You thought demons were mounting a full-scale invasion. You bring up your confusion and that only causes him to laugh at you.\n\n\n“You think I would be near humans willingly? The only reason I’m here is because dark magic is outlawed in hell. Demons tend to stray away from things they don’t understand”\n\n\n“Same reason I’m here,” adds Catia.\n\n\nIf not here by free-will, what explains the siege of the capital? How would a bunch of misfits pose a threat to the elite empiric army? As you to reason through it, your brain aches with pain. Damn that hit from Lars got you good.\n\n\n“Well if he doesn’t want to go through with the ritual then my work here is done,” says Jirzan.\n\n\n“Not so fast!” says Catia.\n\n\n“Eh? Do you want me to kill him or something? I thought you could use the practice.”\n\n\nCatia sighs and places her hand on hip whist saying,\n\n\n“What about instead of turning him into a demon we make him a Doom Knight? All you’d have to do is teach him a little dark magic and we should be all set.”\n\n\nYou don’t even know what a Doom Knight is and still don’t trust Jirzan to teach you.\n\n\n“You think this imbecile could handle learning the dark arts? You have truly gone mad! And to think, they call me the lunatic.”\n\n\n“C’mon Zan, you owe me this. Backing out will only lead to more consequences down the road.”\n\n\nThis seems to shut him up real quick. He starts cursing as it becomes clear to you Catia has something he dearly wants.\n\n“Fine I’ll do it, under two conditions. The first, I will need his full consent to do the initiation spell. Without it, there is no way he could become a Doom Knight. The second, you return Coyote back to me once I finish.”\n\n\nCatia nods and agrees to his terms. She now turns to you and asks,\n\n\n“Any questions?”", "action_results": [{"action": "What’s a Doom Knight?", "result": "You rack your brain and try to formulate some questions. Everything they’ve been saying kind of has blurred together. Though you do want to know what exactly a Doom Knight is.\n\n\n“Doom Knights are slayers of all things good and holy. Think of them as some sort of reverse paladin.”\n\n\nYou always thought paladins were self-righteous assholes. They claim to protect others from evil yet persecute the smallest of sins. Who knows, Doom Knights might be more to your liking.\n\n\nOther questions?", "action_results": [{"action": "Why me?", "result": "“I told you he would ask this!” says Jirzan.\n\n\n“We might as well tell him the truth, or he might not join,” says Catia.\n\n\n“Go ahead, though you are putting a lot of trust in a meathead.”\n\n\nCatia explains how if they wanted to, demons could conquer earth in minutes.\n\n\n“Why don’t you then?” you ask.\n\n\nCatia pauses and starts speaking in a sad tone,\n\n\n“If we did, I could never return to my homeland. In the underworld, different dimensions are at constant war. When darkness fights darkness, brute strength does nothing. You must outsmart your opponent through trickery and manipulation. That’s where you come in.”\n\n\nShe goes on to explain how banished demons are sent to lesser domains, such as earth, to earn redemption. Some demons are content with wreaking havoc, but others long for home. Take Jirzan for example, he couldn’t care less about the underworld. He thrives of chaos and enslaves all weaker than him.\n\n\n“The only reason he’s helping is because he has no choice,” adds Catia.\n\n\nIn Catia’s case, she needs to others to do her own bidding to prove she does not have to relay on brute strength. Lucky for her, succubi are experts at having others do what they want. By having you kill the captain, she can prove just how capable she is.\n\n\n“Making Lars believe you are a demon, and constructing a fake deal with him, proves how I can bend reality to my whim,” boasts Catia.\n\n\nRegardless of what you think of her motivations, it seems the only choice you have is to follow her.\n\n\nWhat else do you want to know?", "action_results": [null, {"action": "What if I refuse?", "result": "“You should ask Lars that question. Refuse to help and I’ll take back mine. Your fate would be out of my hands,” she says.\n\n\nThis is a really sticky situation. You hate when you have choices stripped away from you.\n\n\nWhat else do you want to know?", "action_results": [null, null, {"action": "Who’s Coyote?", "result": "“THAT IS OF NO CONCERN TO YOU!” screams Jirzan.\n\n\nCatia bites her lips, as if she wants to say something. A few more seconds past and it is clear none of them want to share this information with you.\n\n\nMoving on…", "action_results": [null, null, null, {"action": "I am done questioning.", "result": "Catia smiles and flicks her tail at you in excitement. Jirzan on the other hand is starting to lose patience.\n\n\n“If you have no more questions, we should begin immediately. Do you consent to me using dark magic to perform the Doom Knight ritual?”\n\n\nYou hesitate, what is stopping him from going against his word? Catia senses your hesitation and points out,\n\n\n“There is no need to be scared. Whatever Jirzan could gain from enslaving you is not worth what he would lose from me. Plus, you have no choice anyway. It’s either agree to the ritual or be sent back to Lars.”\n\n\nYou gulp and shake nervously thinking of the possibility.\n\n\n“Fine, I consent.”\n\n\nWith that out of the way Jirzan explains the plan. He will perform the doom ritual and you will do nothing. Any attempts at resistance could interfere with the ritual and have untold consequences. Stay still and focus on deep, calm breaths.\n\n\nYou do as you're told and focus on controlled breathing. Jirzan begins to chant nonsensical phrases at a deafening tone. The ground starts shaking and your heart starts beating rapidly.\n\n\n“Alash Tad Al-Ash Tal Ashtu.”\n\n\nThe moment Jirzan finishes speaking everything goes black. You hear nothing, see nothing, and feel nothing.\n\n\n“D—on-----‘t resis--t---” you hear a distorted voice say.\n\n\nSuddenly, a blinding light of darkness flashes before you. You didn’t think such a thing existed, but a voice explains,\n\n\n“Behold, pure darkness! Conjured using the 5th edition of Dark Magic for Dummies and performed by yours truly.”\n\n\nAs the flash from darkness fades away you are greeted by a creature from your nightmares. It stands at twice your height, with unorthodox body proportions. Its arms drag on the floor as it walks. It’s grayish in color and appears faceless. It starts speaking again despite not having a mouth,\n\n\n“Why have you come here mortal? What is it that you seek?”\n\n\nYou explain your situation and how you were sent to become a Doom Knight. It responds with uncertainty,\n\n\n“You wish to become a Doom Knight? This is the first time a human has come for that purpose. For good reason too, the moral confines of humans make the process a death sentence.”\n\n\nYou react with contention,\n\n\n“I can’t care about moral confines, I have no choice. The demon who sent me here will surely kill me if I fail. Is there nothing you can do?”\n\n\n“There is always something I can do. The only question is, can you live with the consequences?”\n\n\nYou remain silent.\n\n\n“That isn’t rhetorical by the way, do you believe you are capable of surviving? Despite feeling as if you have no choice, your morality still limits you. Hell, have you even killed someone before?”\n\n\nYou continue your silence as you can’t argue.\n\n\n“Look, I could always use more prophets of doom and it seems like you are set on going through with this. I could simply perform the incantation and hope for the best. However, if you don’t want to take the risk, I’ll transform you into a demon. Not a traditional demon, but one like a less powerful version of me. You’ll lose your humanity, but you will be guaranteed to become a Doom Knight.”\n\n\nYour skin crawls at the idea of looking like him. What choice do you have though, lest you want to risk everything?", "action_results": [{"action": "Lose your humanity", "result": "“Turn me into a demon. If that’s my only path to become a Doom Knight, then so be it.”\n\n\nThe creature seems happy about your response and begins the ritual. A purple hue begins to form around it. The hue expands until it reaches you. Your body goes limp and you start to float in the air. It feels like something is being taken from you.\n\n\nYour fingertips start to tingle. This feeling spreads through the rest of your body. You have no control over your body and remember what Jirzan told you,\n\n\n“Don’t resist.”\n\n\nYou focus on your breathing and ignore everything else. An itching sensation spreads across your face breaking your concentration. The intensity increases as the ritual draws to a close.\n\n\n“Haha, it’s working!”\n\n\nYou gain some control over your body and stare at the creature. Then you stare at yourself, your arms have paled and begin to stretch out. Your back contorts as bones impale your flesh. Layers of skin form over your newly grown bones. As this is all happening your mind begins to slip…\n\n\nYou forgot why you’re here and what you’re doing. You crave destruction and serve a purpose greater than yourself. The transformation is complete.\n\n\n“Holy shit I did it! I mean, you survived! Welcome to being a Doom Knight, I’ve infused your soul with dark magic, so it should come naturally.”\n\n\nYou stare back at this creature with a newfound kinship. This is your brother in destruction and chaos, you serve the same master and the same purpose.\n\n\n“I will embrace this new title and destroy all who get in my way,” you say.\n\n\nThe creature happily agrees and begins the process of sending you back to where you’ve came. He says a few words and you are enveloped by a dark mist. Instantaneous you find yourself in a room with two demons.\n\n\n“WHAT THE FUCK IS THAT?” shouts Jirzan.\n\n\n“I don’t know but it’s abhorrent, and that’s coming from a mistress of hell,” Says Catia.\n\n\n“I am a Doom Knight, I bring despair and misery wherever I go.”\n\n\nThey look at you in shock as if a sudden realization has overcome them. You don’t feel any sense of kinship towards either of them.\n\n\n“Well, it’s safe to assume the ritual worked, I just didn’t expect this,” says Jirzan.\n\n\n“This was not the desired result and you know that. However, you can consider your debt repaid if you help me send him to Ashton,” says Catia.\n\n\nWhy does that word sound so familiar? You ignore any thoughts and familiarity and focus on your one goal: destruction.\n\n\n“I’ll help you but then I’m done. Let’s go, I’ll begin the teleportation process.”\n\n\nJirzan snaps his fingers and you find yourself transported to a dirt road. You look around and see that this road leads to a city. You crave destruction and find yourself instinctively walking towards it. Your long, slender arms drag through dirt and scattered snow.\n\n\n“Not so fast! All you're supposed to do is kill the captain,” says Catia.\n\n\n“Yes, I will kill him,”\n\n\nYou continue marching to the city, Catia takes to the air to catch up with you.\n\n\n“We can’t have people seeing you or they might alert the guards! Anyways, I want you to meet up with Lars first. We need him to think you’ve been a demon this whole time.”\n\n\nYou continue marching drowning out the sounds of Catia as you focus on razing this city to ash. She starts tugging on your arm trying to stop you. You ignore her as she realizes her efforts are futile.\n\n\n“Great, just great. How will I ever return home if I can’t get a fucking human to follow my command.”\n\n\nJirzan comforts Catia and says,\n\n\n“This thing is no longer human. Its beyond our control and we need to move on.”\n\n\nCatia and Jirzan start walking away but stay close enough to watch what you do. You reach the city walls and send a beam of pure darkness into it. It obliterates a ginormous portion of the wall, allowing you to easily walk through. Stepping into the city you feel a rush of déjà vu. Everything looks familiar but your craving for death and despair is too great to linger on it. People scream as you break into the nearest house.\n\n\nA family is cowered in the corner completely at your mercy. Another man stands with a sword and tells you,\n\n\n“Leave my family alone, monster! You won’t kill them without killing me first.”\n\n\nYou're more than happy to oblige at least half this man’s request. You raise your arms and slam them into him. The cracking of bone fills you with vigor.\n\n\n“Never tell a demon your thoughts and desires. Watch as I take everything dear to you.”\n\n\nThe man pleads through raspy breaths as you approach his family. It's a mother and her two daughters, you waste no time sending a beam of dark energy into the three of them. They die before having a chance to scream. You leave the man alive to suffer a slow, painful death. Your body courses with adrenaline as you find yourself surrounded.\n\n\nIt’s a group of about 15 armed guards armed with swords and shields. Their attempts at appearing composed are laughable. Every one of them fears you and you couldn’t be happier. You decide to play around with them a bit,\n\n\n“Do not fear me humans. I will leave this city and never return.”\n\n\nA few look all too happy to take you up on that, however one-man shouts,\n\n\n“We will smite all that is unholy! If we make an example out of you other demons will think twice before attacking Ashton!”\n\n\nWhat a brave attempt at defiance, too bad it is also insanely stupid. You conjure a cloud of acid and begin raining it down on them. The sound of burning fills your ears with joy. Some run away and the stupider ones attack. Swords pierce your flesh and you start to leak a yellowish fluid.\n\n\n“ONLY I KILL TODAY!” you scream.\n\n\nYou flail your arms around breaking the bones of all you hit. Anyone who hasn’t ran away are lying at your feet. You set their bodies ablaze and grin as they are turned to ash. The city’s first line of protection didn’t pose a threat. Nobody here can stop you as you set the entire city on fire. Many die and those who don’t will forever be scarred by your presence. Word of your act soon begins to spread…", "action_results": [{"action": "Epilogue #1: Heart of Darkness", "result": "You live to destroy all life you meet. At first, this meant humans and other feeble creatures. You soon moved onto bigger prey when you discovered a demon hideout. The demons were more annoyed than anything. That changed when you began ripping off the heads of their young. They sprung to attack you and managed to inflict some pretty serious damage. When you realized this was a fight you couldn’t win, you escaped to live another day and continue the path of destruction.\n\n\nUnfortunately, demons aren’t the type to forgive and forget. They stormed the cave you made residence in and sought to kill you. You however, saw this coming and learned a mind control spell in preparation. These demons were banished from hell for being weak-willed. Most of them were lesser demons to begin with, barely fit to deal with a human let alone a Doom Knight. Once the spell was cast they all succumbed to your command.\n\n\nYou and your band of misfits traveled the lands with an insatiable appetite for destruction. As you grew more powerful in the dark arts, you passed this blessing onto your followers. Soon they could massacre a city without you being present. The level of death and despair you caused grew exponentially.\n\n\nPresent Day\n\n\nYou awaken and find you have a visitor. It’s a demon much bigger than yourself who seems familiar with your work.\n\n\n“You have far surpassed all expectations I had when I first noticed you. Tell me, why were banished to earth?”\n\n\nYou don’t remember banishment of any sort. Being a Doom Knight is all you’ve ever known. You explain,\n\n\n“My past life is a blur and it's best kept that way. All I know is I used to be a feeble-minded fool incapable of warding of the influences of a mere succubus.”\n\n\nThe demon, who tells you his name is Tornaxaan, is surprised. He tells you that whatever the reason for your banishment, you’ve earned the right to return home. You feel no desire to until he mentions,\n\n\n“This will provide you an excellent chance of honing your skills and learning from the most powerful demons. In only a couple of centuries you would be capable of destroying entire worlds.”\n\n\nYou’re sold and thank Tornaxaan for the opportunity. All he says is,\n\n\n“You and I are going to have a hell of a time!”\n\n\nIt’s time to enter the heart of darkness.", "action_results": []}]}, {"action": "Keep your humanity", "result": "“I don’t want to become a demon. Make me a Doom Knight but don’t take away the one thing keeping me sane.”\n\n\nThis creature seems disappointed at your response, but carries on nevertheless. A purple hue begins to form around it. The hue expands until it reaches you. Your body goes limp and you start to float in the air. It feels like something is being taken from you.\n\n\nAn intense burning occurs on your fingertips. This burning begins to spread. You have no control and can’t even scream when the intensity becomes unbearable. You pass out.\n\n\nThe creature deems you not worthy of becoming a Doom Knight. This is the end of your tale.", "action_results": []}]}]}, null]}, null, null]}, null, null, null]}, null, null, null]}]}, {"action": "Shake your head", "result": "That’s the last thing you do before passing out.\n\n\nAnd the last thing you’ll ever do as Lars makes no attempt at reliving you.\n\n\nEnd...", "action_results": []}]}, {"action": "Grab your sword and investigate", "result": "Maybe it’s paranoia, but what kind of brain-dead retard wouldn’t rather be safe than sorry? You take out your sword and leave the bed room, checking every corner as you do so. This pays of as you notice a shadowy figure standing outside your bedroom. Is that…Lars?\n\n\n“Your senses are very good, demon. I knew you were possessed, how else could you have heard me?”\n\n\n“The annoying door squeak, for one. Also, it's fucking freezing so I knew someone let in the cold.”\n\n\n“More lies! First you tell me you survived the cold from pure luck, now you tell me your heighten senses are nothing special?\n\n\n“Lars, you have no idea what you’re talking about.”\n\n\n“Stop pretending, I know your secret. You’ve been possessed by a demon; how else could you survive the frigid cold?”\n\n\nNot wanting to fight a former friend, you decide to tell him the truth.\n\n\n“I haven’t been possessed by a demon, but one did save me. It all started once you left…”\n\n\nLater\n\n\n“So that’s why you were at the drunk tortoise? I admit, you’ve never been one to drink.”\n\n\n“Exactly! I’m glad you understand.”\n\n\n“What now? You’re going to come clean to the captain and convince him to give me back my job, right?\n\n\nWhile the captain may give Lars his job back, you would probably be fired. Coming into direct contact with a demon and living to tell the tale is a no go. He’ll probably think you made some sort of deal to avoid being killed. Regardless of what you plan to do, you say,\n\n\n“I will definitely do that tomorrow.”\n\n\nLars nods but still looks a little unhinged. His hand twitches and he gives you a half grin.\n\n\n“Ok I’m holding you to it, because if you don’t, you’re gonna wish you froze to death last night.”\n\n\nYou gulp as you have no doubt Lars could kill you if he wanted. He leaves and you hear the door squeak once again. The cold breeze has expanded throughout your house and you could use some heating up. After securing to house to make sure Lars isn’t still lurking, you fall into bed.\n\n\nYou’re super tired and debate whether you still want to see Catia. It’s been a long day and if you have any intention of talking to your captain tomorrow, you should go to sleep.", "action_results": [{"action": "Summon Catia", "result": "“Catia.”\n\n\nA dark cloud appears in your room, dispelling a toxic fume. You start violently coughing as you vision blurs indiscriminately. Your eyes shut close and you feel you grip on reality slipping away from you. \n\n\n“Ah shit,” you whisper before passing out. \n\n\nYour eyes jitter open and you’re greeted by Catia stroking your face. Her palm flushes the coolness off your face. Beads of sweat drip furiously down your neck as she continues caressing you. \n\n\n“Couldn’t wait a single day before seeing me again? Especially after you promised your friend you would visit ‘the captain’? How cute.” \n\n\nYou don’t have time to question how she knows that before she crawls on top of your bed and snuggles against you. Her aura is all consuming and you feel your free will being drained away. Yet, the whole process is extremely pleasing to you. She moves her mouth to your ear and whispers,\n\n\n“Do you want to see everything I have to offer?”\n\n\nYou bite your tongue to avoid instinctively shouting yes. This may be your last chance to not go through with this. At the very least, it would give you chance to ask her a few more questions.  \n\n\n ", "action_results": [null, null]}, {"action": "Go to sleep and visit the captain first thing in the morning", "result": "You close your eyes and drift off to sleep. You dream of a bright forest with playing children. Everything is nice and everyone is happy. Then one day that changes when a portal to another dimension appears in the middle of the forest. Out of the portal comes abominations to mankind. A collection of arms and legs attached on to a giant ball of flesh. This ball rolls around destroying the forest, killing everyone and growing stronger as it does so. The ball then comes rolling at you. You don’t have time to scream before…\n\n\nYou jolt awake and find yourself covered in sweat. As much as you hate nightmares, they do a great job at waking you up. You look outside your window and notice the sun rising. This rising ball of fire reminds you of the ball from your dream. You throw on a clean pair of clothes, grab your sword just in case, and make your way to the captain’s quarters.\n\n\nIt’s an uneventful journey and you arrive within a few minutes. Not wanting to wake the captain, you pull out pen and paper. It goes as follows,\n\n\nDear Captain Dario,\n\n\nI am writing to you regarding the firing of guard Lars. I was on the same shift as him before he left. The windchill was approaching deadly levels and he decided to head inside as a last resort. I stayed out only because I feared the repercussions. As I sat out there, my muscles began to freeze until I could no longer move. I passed out minutes later.\n\n\nI would have surely died had a traveling merchant not stopped by. They started a fire and warmed me up. I would have died otherwise and thank the heavens a demon didn’t wander by. Due to my own experiences, I recommend you rehire Lars and if anything, fire me for putting my life on the line when it wasn’t needed.\n\n\nYou are in such a rush that you slide the letter under the door before signing it. You decided against telling the truth as Captain Dario is a hard ass for rules. Not only would you have been fired, but also forced to undergo a purging to ward off any demonic influences.\n\n\nWith that out of the way, you decide to head to a local armory. Your city issued sword is no match for a demon, as Catia pointed out. Not knowing if your parents will ever return, you see no problem with using their savings for your protection. You take a stroll to the armory and find it to be quite crowded for this early in the morning.\n\n\n“I need something that can scare away demons,” a farmer says\n\n\n“Scare away? Why not something that can kill?”\n\n\n“Look son, I’ve never been one to resort to violence. I just need something to protect you and the Misses.”\n\n\nYou zone out their conversation and take a look around. They have swords, maces, axes, and even a trident. However, what catches your eyes is a bow painted red and black. It’s the only one in the store and seems rare.\n\n\n“Excuse me sir, what’s the price on this bow?”\n\n\n“That would be 500 gold sir,” replies a dwarf with steel encrusted teeth.\n\n\n“What’s so special about it?”\n\n\n“We brought it from a dark elf mercenary. They have great craftsmanship, especially when it comes to bows.”\n\n\n“How is it different than all the other bows for sale?”\n\n\nHe pauses and turns red,\n\n\n“I hate to admit it, but I’ve always struggled making bows. That red and black one has much finer strings and sturdier wood, giving it a greater firing range.”\n\n\nYou thank the dwarf for the information and continue looking around. Nothing else catches your eye, so you decide to buy the bow.\n\n\n“Pleasure doing business with ya.”\n\n\nYou leave with your new bow and 500 gold poorer. You hope you still have your guard job as your parent’s money won’t last much longer. You go to the guard barracks and decide to get a meal there. Even if you’ve been fired, you doubt any of the servers will know. You arrive to a mess hall and find it more empty than usual. Two men eat soup together and another man sits alone.\n\n\nYou grab a cup of soup and take another look around. You recognize the two men sitting together as Herbert and Andy. Herbert is an older man with a gray beard who has always been kind to you. Andy is around your age, mid twenties, and is already going bald. Both are good chaps and would be happy if you sat with them.\n\n\nThe man sitting alone is someone you don’t recognize. He is a very thin fellow with patchy hair and missing teeth. You could try to find out who he is, or sit with Herbert and Andy.", "action_results": [{"action": "Sit with the skinny man", "result": "You walk over to the skinny man and and ask,\n\n\n“Mind if I sit next to you?”\n\n\nHe is startled by your presence and jumps up a bit. He mutters something incomprehensible before saying,\n\n\n“I don’t mind.”\n\n\nThe hot soup burns your tongue as you eat a spoonful.\n\n\n“So what’s this town’s name again?”\n\n\n“Ashton, why do you ask?”\n\n\n“You might not believe me, but I came face to face with a demon. When I finally got away, I ran to the city walls.”\n\n\n“Trust me, I believe you. I encountered a demon while on guard duty.”\n\n\nYou tell him about how you passed out and met a succubus.\n\n\n“That’s wild.”\n\n\n“Sure is, now tell me about the demon you met.”\n\n\nHe grits what few teeth he has and begins,\n\n\n“He wasn’t pleasant at all like the one you met. I was going for a walk in the forest. I know, it’s not the smartest thing to do in times like these, but it's one of my few sanctities.”\n\n\nHis voice gets lower as he describes,\n\n\n“I knew something was off the moment I entered. An unholy energy made me feel weak and tired. I started hearing voices and couldn’t tell what was real. It was like I was in a trance.”\n\n\n“Did you actually see a demon?”\n\n\n“No, but he made his presence known. He tired to coerce me into letting him take over my mind. I almost did it too, but something broke me out of my trance.”\n\n\nHe pauses for dramatic effect,\n\n\n“A bird fucking shat on my head!”\n\n\nYou stare at his head and notice white flakes clumped in his hair.\n\n\n“Once I realized what I was about to do I ran like hell. I wasn’t thinking straight and went the opposite direction which I came in. I’m lucky I ended up here.”\n\n\nHis experience is vastly different to your own. You suppose he encountered a demonic sprit, rather than a full fledge demon.\n\n\n“Perhaps this all was for the best. My city was running low on food, hence my frail appearance.”\n\n\n“Are you planning on staying in Ashton?”\n\n\n“I don’t know. I would need to get a job and a place to sleep at night. Would you be able to help me out in any way?”\n\n\nWhen your about to answer you hear someone call your name. It’s Captain Dario and he wants to speak with you immediately. You get up and tell the thin man,\n\n\n“It was nice talking to you.”\n\n\n“I hope you can come back when you're done. My name’s Eric by the way.”\n\n\nYou wave goodbye and follow the captain into his private quarters.\n\n\nA rush of anxiety hits you as your still not sure if the captain bought your story. What if Lars told him the truth?\n\n\n“Please, take a seat.”\n\n\nYou sit and find yourself starring at the gray haired captain. He stares back, unblinking as you both wait to see who makes the first move.\n\n\n“First things first, you’re not fired.”\n\n\n“That’s a relief.”\n\n\n“I’m sure it is, but what I say next may not be. I have no intention of re-hiring Lars.”\n\n\n“Wait what? Like I said in my letter, he did the smart thing and could have died had he stayed.”\n\n\nThe captain sighs and says,\n\n\n“While that may be true, I’ve been wanting to fire him for awhile. He’s lazy and incompetent. The only reason he still had a job was because guards are in high demand right now. The problem now is finding a replacement.”\n\n\n“What happens if you don’t?”\n\n\nDario frowns and bitterly says,\n\n\n“Then I might have to rehire Lars.”\n\n\nYou could mention your new acquaintance, Eric, and vouch for him to replace Lars. On the other hand, who knows how Lars will react if he finds out you played a role in replacing him. There may be no reasoning with him.", "action_results": [{"action": "Mention Eric", "result": "“I may know of a potential replacement.”\n\n\n“No need not to not speak in absolutes. Spit it out sonny.”\n\n\nYou stumbled a bit, not because your scared to tell him, but because his syntax confuses you.\n\n\n“Erm… I—I… his name is Eric.”\n\n\n“Who is this so-called Eric?”\n\n\n“He was the man I was sitting with. He’s looking for work and seems like a good fellow.”\n\n\n“That’s all I need, tell him he’s hired. Oh, and he starts immediately. 11pm tonight tell him to go to the city walls.”\n\n\n“Tonight? Isn’t this all happening a bit too fast?”\n\n\n“Nonsense, plus he won’t be doing it alone. He’ll have you to teach him.”\n\n\nYou tense up as Dario continues,\n\n\n“Lighten up, kid! I took the initiative and brought fur coats for each of you.”\n\n\nHell of an initiative considering you almost died two nights ago.\n\n\n“Thanks for taking the initiative…”\n\n\n“You’re most certainly welcomed! Now that that’s settled, get the hell out of here!”\n\n\nYou stand up and leave his office. Eric does a one tooth smile as you walk over to him.\n\n\n“What was that all about?”\n\n\nYou have a sly smile on your face when you say,\n\n\n“It was about you, congrats you’re now a guard!”\n\n\nHe gives you a look of confusion and asks,\n\n\n“What the hell are you talking about?”\n\n\nYou explain how guards are in high demand and that you mentioned him to the captain. \n\n\n“And I almost forgot, you start tonight.”\n\n\n“Wait what?”\n\n\n“Don’t worry, I’m on guard duty tonight as well. Plus, I’ve only ever seen demons one time...”\n\n\n“That one time was last night!”\n\n\n“Actually two nights ago, but never mind that. Anyways the captain brought fur coats for the both of us so no freezing to death tonight. C’mon, let’s get rolling.”\n\n\n“Alright but don’t act like this is permanent, if I don’t like it, I’m quitting after tonight.”\n\n\n“Trust me, it’ll be much easier now that we won’t be freezing. I have a feeling you’ll stick around.”\n\n\n ", "action_results": [{"action": "1 month later", "result": "“You really don’t have to do this,” \n\n\n“Blasphemy, I’ve seen what you can do with my bow, you deserve one of your own.”\n\n\n“Yeah but you don’t have to help me pay for it. Anyways, I’m not that good with a bow,” Eric says humbly. \n\n\n“Well you’ll have plenty have chance to practice, let’s get going.”\n\n\nThe past month in Ashton has been quiet, but demon sighting have increased in the nearby forest. Eric and you need to be as prepared as possible for when they strike. In addition, you have grown to like Eric a lot and are happy to help pay for his bow. You’re hoping they have one that’s as good quality as the one you brought last month. You arrive at the armory and note it being a lot less busy than it was last time. In fact, you’re the only two here aside from the dwarf who runs the place.\n\n\n“Where is everyone?” you ask. \n\n\n“I about ran out of equipment. With how trade has been recently, its impossible to get the material needed to craft weapons.”\n\n\nYou offer your condolences and tell him why you’ve came here,\n\n\n“You wouldn’t happen to any bows for sale?”\n\n\nHe half smiles, then says,\n\n\n“I might have a few, but none of my own creation. Those sold out the fastest due to their cheap price.”\n\n\nEric gives you a concerned look knowing the cheapest bows are all sold out.\n\n\n“Well let’s see them,” you say.\n\n\nHe lays out a few bows on a table and describes each of them.\n\n\n“This one right here was specifically crafted to kill orcs, but it should be fine for just about anything.”\n\n\n“What about demons?”\n\n\n“I see no reason why not!” \n\n\nHe shows you a few other bows, mostly made be other local blacksmiths, but one other thing catches your eye.\n\n\n“Hey what’s that?” you say pointing to a crossbow on display.\n\n\n“She’s a beauty, isn’t she? Crafted by the capital’s smartest black smiths, though its a few years outdated. It doesn't have the most range, but it sure packs a punch. I reckon one shot from it could bring any creature to near death. That is, if you’re a good enough shot to hit your target dead on.”\n\n\n“How much?” asks Eric.\n\n\n“800 gold.”\n\n\n“Are you crazy? That’s more than I made last month working as a guard.”\n\n\n“Higher prices, higher quality.”\n\n\n“What about the orc killer bow?”\n\n\n“Those are pretty common, 300 gold would be a fair price.”\n\n\n“We should probably just get that one, don’t want my friend going bankrupt.”\n\n\n ", "action_results": [{"action": "Insist you buy the better bow", "result": "You help Eric buy the better bow and he is apprehensive.\n\n\n“Thanks man, but now we’re both broke.”\n\n\n“Better broke than dead.”\n\n\nYou leave with the bow and get ready for guard duty. \n\n\n5 hours later\n\n\nIt’s been a quiet night so far and warmer than usual. Eric stands up and draws his crossbow towards the forest.\n\n\n“Do you see something?”\n\n\n“Yeah I do. It’s like a bat but much larger.”\n\n\nYou look where he’s pointing and something comes into view. It’s a succubus, but unlike the one you met before, it no longer resembles a human. It has blood stained skin and humongous bat wings. \n\n\n“Holy shit.”\n\n\nDon’t just stand there, fire!” you say.\n\n\nYou and Eric unleash a flurry of arrows at the creature. It manages to dodge almost everything, but Eric hits it dead on. \n\n\n“Got it!”\n\n\nIt falls from the sky and lands awkwardly. You waste no time laying it to waste with arrow after arrow. You don’t stop until you’re sure its dead, and it soon looks like a half-bat, half-porcupine monstrosity. You did it, you killed a demon. \n\n\n“That was an amazing shot, I’m not sure we would have brought it done had we brought the cheaper bow.”\n\n\n“Yeah, thanks again,” Eric says with tears streaming down his face.\n\n\n“What’s wrong?”\n\n\n“I just can’t believe we survived. You hear tales about demons destroying entire cities and yet we were able to bring down one with only two of us.”\n\n\n“We make a good team.”\n\n\n“We sure do, we sure do.”\n\n\n ", "action_results": [{"action": "Epilogue #2: Succubus Slayers", "result": "You two are lauded as heroes and given a big pay raise. \n\n\n“And to think, I almost kept that loser Lars!”\n\n\nSpeaking of Lars, want to know what happened to him? He and his whole family starved to death. Better him than the whole city am I right? On the bright side, you and Eric continue killing demons as sightings become more common. After word of your legacy spreads, a local lord hires you as demon hunters. You decide to take up the name Succubus Slayers as a reference to your first kill. This is a rather ironic turn of events considering you went from being saved by a succubus, to killing them for a living.\n\n\nWho knows, maybe you’ll have to kill Catia one day?", "action_results": []}]}, {"action": "Settle for the cheaper bow", "result": "You help Eric buy the cheaper bow and he is glad.\n\n\n“Thanks man, no need to go broke.”\n\n\n“Better dead than broke,” you say sarcastically\n\n\nYou leave with the bow and get ready for guard duty. \n\n\n5 hours later\n\n\nIt’s been a quiet night so far and warmer than usual. Eric stands up and draws his bow towards the forest.\n\n\n“Do you see something?”\n\n\n“Yeah I do. It’s like a bat but much larger.”\n\n\nYou look where he’s pointing and something comes into view. It’s a succubus, but unlike the one you met before, it no longer resembles a human. It has blood stained skin and humongous bat wings. \n\n\n“Holy shit.”\n\n\nDon’t just stand there, fire!” you say.\n\n\nYou and Eric unleash a flurry of arrows at the creature. It manages to dodge almost everything, but Eric hits it dead on. \n\n\n“Got it!”\n\n\nExcept it does nothing but annoy it. The creature screams and flies at blazing speed towards both of you. You manage to hit it a few times, but it does nothing. You are torn to pieces as Eric watches. He awaits the same fate. \n\n\n ", "action_results": []}]}]}, {"action": "Defend Lars", "result": "“Lars might not be the best guard, but he’s the best option available. On the bright side, we at least seem to get along.”\n\n\nDario’s face turns dark red as he spits out,\n\n\n“If he’s the best option, then this city might burn in flames tonight. None of us are safe with him on duty.”\n\n\n“So I take it that you won’t be rehiring him?”\n\n\nThe captains sighs deeply out of frustration.\n\n\n“Look, tell him he can guard tonight. However, if he messes up one more time, he’s out for good.”\n\n\nYou do a small fist bump out of celebration.\n\n\n“Not so fast sonny, you’re going with him.”\n\n\n“Really? Even after what happened the last time we were on guard duty together?”\n\n\n“You said it yourself, you two get along. Now, get out and get to work.”\n\n\nYou leave in a pissed off mood, however the captain adds one thing before you slam his door shut.\n\n\n“I brought fur coats for the both of you. They’re in your lockers and it’s best if you wear them tonight.”\n\n\nYou leave in a slightly less pissed off mood and slam the door. Eric does a one tooth smile as you walk over to him.\n\n\n“What was that all about?”\n\n\n“Nothing too important. I have to go now, it was nice meeting you.”\n\n\nNice meeting you too...”\n\n\nYou leave and head over to Lars house. It’s best to tell him the good news as soon as you can. You get there shortly and he answers the door right away.\n\n\n“So did you do it? Did you tell the captain what really happened.”\n\n\n“I convinced the captain to give you your job back, that’s all that matters.”\n\n\nLars looks like he wants to argue, but holds back.\n\n\n“I’m just happy my family won’t starve to death. Oh, and that I won’t have to kill you,” he says with a wink.\n\n\n“Yeah it’s great news, now follow me. The captain brought fur coats for both of us.”\n\n\n ", "action_results": [{"action": "A month later", "result": "Lars is an incompetent fucktard who can’t even hold a bow. You’re very lucky the last month has been quiet for you, however demon sighting are getting more common. Sooner than later you’re going to encounter one. You put on your fur coat and walk to the city walls.\n\n\n5 hours later\n\n\nIt’s been a quiet night so far and warmer than usual. Lars stands up and points his sword towards the forest.\n\n\n“Do you see something?”\n\n\n“Maybe, unless the booze is fucking with my vision. It looks like a bat but much larger, and...sexier.”\n\n\nYou look where he’s pointing and something comes into view. It’s a succubus, but unlike the one you met before, it no longer resembles a human. It has blood stained skin and humongous bat wings. \n\n\n“Holy shit.”\n\n\nDon’t just stand there, defend yourself.”\n\n\n“Nah fuck that,” Lars says while running away.\n\n\nYou unleash a flurry of arrows at the creature as Lars makes his escape. It manages to dodge almost everything, but one arrow grazes its foot.\n\n\n“HOW DARE YOU!”\n\n\nThe succubus releases a bolt of dark energy at you. It hits you in the chest and you collapse. As you sit there about to pass out, a thought comes to you. One month ago a succubus saved your life, now another ends it.\n\n\n“Tell Catia I said hi...”", "action_results": []}]}]}, {"action": "Sit with Herbert and Andy", "result": "You head over to sit with Herbert and Andy and listen in on their conversation.\n\n\n“I can’t believe she would do such a thing,” says Herbert.\n\n\n“I don’t know how she could just lie after all I did for her. She’s been pissed at me ever since we last had sex. I can’t even talk to her anymore.”\n\n\n“I know how you feel, women sure are a pain in the ass. Hey new guy, did you hear what Andy’s girlfriends been doing?”\n\n\nYou stop blowing on your soup and glance at Herbert.\n\n\n“I haven’t, what happened?”\n\n\n“So this fucking bitch named, what was her name again Andy?”\n\n\n“Julia.”\n\n\n“Yeah so this bitch named Julia has been spreading lies about him ever since they broke up. She told the captain that he raped her!”\n\n\n“I guess she wants to get me fired. Rather get revenge against me for something I didn’t do then have the city be safe.”\n\n\n“Julia...what’s her last name?”\n\n\n“Why does it matter? She’s a fucking liar and that’s that,” says Andy.\n\n\n“Sorry I thought I might know her...I had a childhood friend named Julia.”\n\n\n“Well I hope you don’t still consider her a friend after what she did to Andy. That skank deserves to live a life alone.”\n\n\nYou sit in silence as you take this all in. If this is the Julia you think it is, there’s got to be a reason she said what she said. You never knew her as the type of person to lie, even as a child. When you’re about to prod further, you hear someone call your name. It’s Captain Dario and he wants to speak with you immediately. You wave goodbye and follow the captain into his private quarters.\n\n\nA rush of anxiety hits you as your still not sure if the captain bought your story. What if Lars told him the truth?\n\n\n“Please, take a seat.”\n\n\nYou sit and find yourself starring at the gray haired captain. He stares back, unblinking as you both wait to see who makes the first move.\n\n\n“First things first, you’re not fired.”\n\n\n“That’s a relief.”\n\n\n“I’m sure it is, but what I say next may not be. I have no intention of re-hiring Lars.”\n\n\n“Wait what? Like I said in my letter, he did the smart thing and could have died had he stayed.”\n\n\nThe captain sighs and says,\n\n\n“While that may be true, I’ve been wanting to fire him for awhile. He’s lazy and incompetent. The only reason he still had a job was because guards are in high demand right now. The problem now is finding a replacement.”\n\n\n“What happens if you don’t?”\n\n\nDario frowns and bitterly says,\n\n\n“Then I might have to rehire Lars.”\n\n\nYou could talk about Herbert and Andy, they might be able to take over Lars’ previous guard duties. On the other hand, who knows how Lars will react if he finds out you played a role in replacing him. There may be no reasoning with him.\n\n\n \n\n \n\n ", "action_results": [null, {"action": "Suggest Herbert or Andy as a replacement", "result": "“Could Herbert or Andy replace Lars?’\n\n\nCaptain Dario pounds his fist on the table and says,\n\n\n“Herbert has been prone to fall asleep and has poor eyesight. Andy...I don’t even know what to say. I’m 95% sure he’s a rapist piece of shit, but he’s a damn good guard.”\n\n\nYou’re taken aback as Dario confirms your suspicions.\n\n\n“Fuck it, a rapist is still better than Lars. Tell Andy to meet you out at the city walls at 11pm.”\n\n\n“Me? I’m back on guard duty already?”\n\n\n“You suggested Andy so who better to go with him? Also, I have a gift for you.”\n\n\nYou wait in anticipation as Dario says proudly, \n\n\nI took the initiative and brought fur coats for each of you.”\n\n\nHell of an initiative considering you almost died two nights ago.\n\n\n“Thanks for taking the initiative…”\n\n\n“You’re most certainly welcomed! Now that that’s settled, get the hell out of here!”\n\n\nYou leave and walk up to Andy to let him know the ‘good news’.\n\n\n“At least I’m finally back on guard duty. I was starting to think Dario might have believe that bitch Julia.”\n\n\nYou and Andy head off to guard duty, grabbing your new coats on the way out.", "action_results": [{"action": "One month later", "result": "The more you get to know Andy, the more confident you are that he raped Julia. Still, he’s at least a good guard compared to the likes of Lars. You put on your fur coat and head to meet him at the city walls.\n\n\n5 hours later\n\n\nIt’s been a quiet night so far and warmer than usual. Andy stands up and points his sword towards the forest.\n\n\n“Do you see something?”\n\n\nHe doesn't answer, instead he runs towards the forest with his sword out. You look where he’s running and something comes into view. It’s a succubus, but unlike the one you met before, it no longer resembles a human. It has blood stained skin and humongous bat wings. \n\n\n“Die beast!” shouts Andy.\n\n\nYou unleash a flurry of arrows at the creature as Andy is tossed to the ground. It manages to dodge almost everything, but one arrow grazes its foot.\n\n\n“HOW DARE YOU!”\n\n\nThe succubus releases a bolt of dark energy at you. It hits you in the chest and you collapse. As you sit there about to pass out, a thought comes to you. One month ago a succubus saved your life, now another ends it.\n\n\n“Tell Catia I said hello...”", "action_results": []}]}]}]}]}]}, {"action": "“I have no preference.”", "result": "“No preference? What the hell is that supposed to mean?” says Connor.\n\n\n“He must think he’s not having any children. I guess he’s into dudes.” Replies Tom.\n\n\n“Yeah I think you’re right. I swear I saw him eyeing Greg.”\n\n\nYou feel the bile rising in the back of your throat. They think you’re attracted to that disgusting little worm? People usually don’t get under you skin so much but this time it’s different. You’re about to fuck a hot demon bitch and the idea of being attracted to Greg is NOT what you need right now.\n\n\n“Do you really want to know why I don’t give a fuck about your pointless hypothetical?”\n\n\n“Well, yeah.”\n\n\nYou take a deep breath and begin to describe your recent encounter with a succubus.\n\n\n“Well it all started when I fell asleep during guard duty”.\n\n\nOne convoluted story later.\n\n\n “And that’s why I came to this tavern,” you say with a cheeky grin.\n\n\nYour story gets mixed reactions.\n\n\n“You’re not actually going through with this are you?” asks Tom.\n\n\n“Ok so you’re attracted to some demon bitch. I still saw you eyeing Greg for at least the past hour.”\n\n\nAnd strangest of all,\n\n\n“Wait aren’t succubi immortal? And they don’t have dicks! Well, at least I assume they don’t”.\n\n\nYou don’t engage with any of them and feel compelled to go home. Although, Tom’s words are giving you second thoughts. Should you wait a few days before even thinking about seeing the succubus?", "action_results": [{"action": "Stay and think it over", "result": "The trio starts arguing but you quickly interrupt them.\n\n\n“Hey wait! Why shouldn’t I go through with this?”\n\n\nEveryone turns towards you as if confused to why you’re still here. Tom let’s out a long sigh and asks the question that has been on everyone’s mind.\n\n\n“Are you sure any of that was even real?”\n\n\nYou scrunch your eyebrows and consider the possibility. No, it can’t be fake. The rush of it all was too great for it to be a hallucination. It was either real or nothing is real.\n\n\n“Yeah your dumbass was probably just hallucinating from the cold,” Connor jeers.\n\n\nThat can’t be it. You know it was real, although they couldn’t possibly understand. They weren’t there.\n\n\n“If I had to guess, I’d say a good Samaritan helped you when they saw you passed out. You might have mistaken their torch for that of a demon,” Says Tom.\n\n\n“Yeah and they probably told you to go to the tavern to warmup. That’s what these two did when they first found me,” says Greg.\n\n\nFor the love of god! Now even Greg is gaslighting you. Enough of this nonsense. You can either leave right now or waste your night away here.", "action_results": [{"action": "Leave RIGHT NOW", "result": "The trio begins arguing again. Something about how demon immortality is different than regular immortality. You don’t time to dwell on it and make your way home. You find yourself grinning the whole walk back. This isn’t just a happy drunk feeling. You feel like this is your purpose. It’s time to see Catia.\n\n\nYou find yourself exiting out of the slums and into the residential part of the city. Most guards sleep in the barracks, however, since your parents never returned from their trip their house is all yours. If they ever return, you hope they don’t mind you bringing a demon inside the house. Although, they were always bugging you about finding a girlfriend, this might not be what they had in mind. \n\n\nYou arrive at your parent’s old home and twist the doorknob. The wooden door squeaks loudly as you open it. \n\n\n“Some things never change,” you whisper to yourself.\n\n\nYou immediately start making yourself more presentable. You change out of your soldiers’ uniform and put on a loose-fitting black tunic. You probably should take a bath but you're too excited to see Catia that you forget to. Do demons mind odor? \n\n\n“Catia.”\n\n\nA dark cloud appears in your room, dispelling a toxic fume. You start violently coughing as you vision blurs indiscriminately. Your eyes shut close and you feel you grip on reality slipping away from you.\n\n\n“Ah shit,” you whisper before passing out.\n\n\nYour eyes jitter open and you’re greeted by Catia stroking your face. Her palm flushes the coolness off your face. Beads of sweat drip furiously down your neck as she continues caressing you.\n\n\n“Couldn’t wait a single day before seeing me again? How cute.”\n\n\nShe crawls onto your bed and moves closer to you. Her aura is all consuming and you feel your free will being drained away. Yet, the whole process is extremely pleasing to you. She moves her mouth to your ear and whispers,\n\n\n“Do you want to see everything I have to offer?”\n\n\nYou bite your tongue to avoid instinctively shouting yes. This may be your last chance to not go through with this. At the very least, it would give you chance to ask her a few more questions. ", "action_results": [null, null]}, {"action": "Waste the night away", "result": "“Fuck all of you, let’s talk about something else. Bartender! Get me another drink,” you say.\n\n\nA couple hours later.\n\n\n“All I’m saying is it’s a bit hypocritical to complain about demons capturing human when we capture orc children on the regular.”\n\n\n“What do you mean we? Last time I checked you’re the only one in the army,” says Tom.\n\n\n“Yeah plus it’s different. Orcs are uncivilized barbarians who kill all those they meet. When’s the last time a human killed a demon unprovoked?” asks Connor.\n\n\n“Did you forget how this whole demon war started? We tried to wipe them off the face of the earth and they retaliated. Jeez Connor, you say orcs are barbarians, but I’ve met orcs smarter than you,” Greg says.\n\n\nConnor slams his fist on the table making everyone jump a little bit. Although all he says is,\n\n\n“Yeah, I’m sure you have.”\n\n\nConnor has been a lot less hostile to Greg since you came here. It’s probably because Greg finally has someone who agrees with him on some issues. Oh, and the fact you could kick Connor’s ass without breaking a sweat.\n\n\nThe three of you continue discussing the demon war and the implications it as on the empire. Recent news of the capital being overrun has set the whole empire into a panic. You begin discussing the possibility of fleeing the city before its too late.\n\n\n“I don’t have much confidence in Ashton keeping us safe, but it’s more protection than outside the city walls,” you state.\n\n\n“I don’t want to wait here to die,” Connor says while slurring his words.\n\n\n“You must know better than anyone being a soldier and all. Do you think the city guards could even kill a single demon? I know it’s just rumors, but word says our army is ill-equip to fight in the winter, let alone against demons.”\n\n\nHow the hell does a guy like Tom know that? You stare at him trying to gain insight into his mind, but all he does in shrug. Damn, might as well give him your honest opinion.\n\n\n“I’ve never seen a demon. Well, other than that succubus and she wasn’t fighting me.”\n\n\n“So, is that a yes or no you bitch?” slurs Connor.\n\n\n“I don’t know.”\n\n\nThere is an awkward silence as you all realize how up in the air the future of this city is. The capital was supposed to send reinforcements to any city that sighted demons. Though with it being under siege that possibility lessens by the minute.\n\n\n“Has anyone even seen a demon? I mean—” Connor says before downing another drink.\n\n\n“Has your dumbass forgot already? This man right here saw a succubus!” Greg says.\n\n\nFinally, someone believes you. Perhaps he agreed with you from the beginning and was too scared to admit it?\n\n\n“Like I said before, it was probably just a hallucination. Plus, why would succubi be needed to conquer the city?” Tom says.\n\n\nJust as you're about to answer that the question a man walks in the tavern. You turn to see who it is and wish you hadn’t.\n\n\nIt’s Lars.\n\n\nIt’s inevitable he notices you and when he does, he wastes no time telling you why he’s here. He got caught abandoning his guard duty last night and has been let go. When he tried to argue how unfair that was because he lacked equipment to handle the conditions all he was told was.\n\n\n“That’s your own damn fault! The other guard did it without complaint.”\n\n\nHe came here to drink until he passed out. Without the money from his guard job he has no way to support his family. He appears a bit more unhinged than usual because of that.\n\n\n“I fucking hope the demons break down the city walls and storm the captain’s quarters. I don’t care what happens next. All I want is for him suffer a slow and painful death. That’s what he sent me to last night and blamed me for saving myself.”\n\n\nYou sit in silence not knowing what to say. He continues,\n\n\n“Speaking of which how the hell did you survive last night? When I left it looked like you were about to pass out.”\n\n\nWell he’s got that right. You briefly consider telling him about your encounter with Catia but the rabid look in his eyes tells you that’s not a good idea.\n\n\n“Just lucky I guess.”\n\n\nHe doesn’t second guess you and continues his rambling. You pay little attention to his words and when you do it’s clear he’s gone off the rails.\n\n\n“Then they’ll rape his family and have him watch. It’s what he fucking deserves, and he deserves what he’s going to get.”\n\n\nAs Lars drones on and on you realize how late it’s getting. You better go home and get the hell away from this guy. You tell him you must go, and he just continues on talking to himself. It’s like he doesn’t know you’re here.\n\n\nThat’s probably for the best. As you leave you give him one last look, and he looks back at you with a huge smile and twitchy eyes. That’s creepy. You make your way out of the tavern and are hit by the freezing winter breeze. You’re going to have to get home fast lest you pass out again. Best to take the alleys as not only is it faster, but it also provides protection from the wind.\n\n\nYou don’t even get a few steps before you tumble to the ground, but not because of the cold. You are whacked in the back of the head with a glass. You fall face first, mouth agape, breaking teeth instantly. Blood seeps out of your head as you press your hand on the back of your skull. It’s more caved in than usual.\n\n\nYou start hearing laughter. This isn’t your first time hearing it either.\n\n\n“As if I believed you survived by pure luck. You’re lucky I don’t just kill you now. Now tell me the truth, demon!”\n\n\nIt’s Lars and he looks completely unhinged. You try to say something but just start coughing blood. It comes out in chunks resembling mushy cherries.\n\n\n“You really thought you could get away with it, didn’t you? HAHAHAHA! I know you’ve been possessed by a demon; how else could you survive the frigid cold?”\n\n\nClumps of blood continue flying out of your mouth as you fail to speak. Lars crotches down next to you and strokes your face.\n\n\n“It’s ok, calm down. Like I told you before, or at least the non-possessed you, the city could use some heating up.”\n\n\nWhere is this going?\n\n\n“I want to make a deal with you! Kill the Captain and I’ll let you live. Hell, I’ll even give you something in exchange. Perhaps a part of my soul? If there’s anything left in there.”\n\n\nYour vision blurs as Lars grins widely at you. Saliva drips down his face like a feral beast.\n\n\n“Decide now! Don’t make me kill you to reveal your true self.”", "action_results": [null, null]}]}, {"action": "Leave now!", "result": "The trio begins arguing again. Something about how demon immortality is different than regular immortality. You don’t have time to dwell on it and make your way home. You find yourself grinning the whole walk back. This isn’t just a happy drunk feeling. You feel like this is your purpose. It’s time to see Catia.\n\n\nYou find yourself exiting out of the slums and into the residential part of the city. Most guards sleep in the barracks, however, since your parents never returned from their trip their house is all yours. If they ever return, you hope they don’t mind you bringing a demon inside the house. Although, they were always bugging you about finding a girlfriend, this might not be what they had in mind. \n\n\nYou arrive at your parent’s old home and turn the door knob. The wooden door squeaks loudly as you open it. \n\n\n“Some things never change,” you whisper to yourself.\n\n\nYou immediately start making yourself more presentable. You change out of your soldiers’ uniform and put on a loose-fitting black tunic. You probably should take a bath but you're too excited to see Catia that you forget to. Do demons mind odor? \n\n\n“Catia.”\n\n\nA dark cloud appears in your room, dispelling a toxic fume. You start violently coughing as your vision blurs indiscriminately. Your eyes shut close and you feel you grip on reality slipping away from you.\n\n\n“Ah shit,” you whisper before passing out.\n\n\nYour eyes jitter open and you’re greeted by Catia stroking your face. Her palm flushes the coolness off your face. Beads of sweat drip furiously down your neck as she continues caressing you.\n\n\n“Couldn’t wait a single day before seeing me again? How cute.”\n\n\nShe crawls onto your bed and moves closer to you. Her aura is all consuming and you feel your free will being drained away. Yet, the whole process is extremely pleasing to you. She moves her mouth to your ear and whispers,\n\n\n“Do you want to see everything I have to offer?”\n\n\nYou bite your tongue to avoid instinctively shouting yes. This may be your last chance to not go through with this. At the very least, it would give you chance to ask her a few more questions. ", "action_results": [null, null]}]}]}]}