{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=45225", "context": "", "first_story_block": "You walk through the undergrowth, a rifle leaning against your shoulder that you struggle to keep from dropping. You rush  to keep up with father, who is seemingly oblivious to how fast you’re having to walk.\n\n\n“Come on, boy!” father said, his fingers scratching at his thick black mustache.\n\n\nAs you walked out of the confines of the tight pines, you saw home. The stone and thatch cottage that was to be your home for the next few years, until you became of age to find your own place, stood there in the fields. Overgrown fields lay to the West and South, a trickling stream East and the vast forest you’d been walking to took up the North. Judging from the cart sitting alongside it, Mother and Meredith were already here.\n\n\nThe family was tiny by all accounts. Mother was prone to bouts of sickness, making her womb a barren place for a child to be born. Although they had tried all their life, and continued trying despite even you recognizing the futility of the action, two children was all they’d ever have. It was you and Meredith, the “miracle twins” as the doctor who delivered you liked to say, that would be the only ones that had survived. The number of miscarriages had clearly taken its toll on Mother, who was fond of siting my the fire, staring into it as she said her rosaries. From Father’s stories she was a wild and untamed girl as a child, a rebellious soul that Father had been ensnared by. Whoever Father speaks so fondly off, its no longer Mother.\n\n\nFather still retained some joy, a love of the land and and a love of nature, although the glimmer of excitement in his eyes was becoming rarer and rarer as time passed.\n\n\nThat left Meredith. While father’s love of nature and positive nature had been instilled in you when you were younger when Father still held the hope of a large family that Mother had long abandoned, Mother’s cold, distant nature took hold of Meredith. She wasn’t as bad as mother, but she was a pain to play with and even worse to talk to.\n\nAll in all, this turned you into the child you are. Without many friends, you’ve become quite lonely, but there is a certain peacefulness in nature you just adore. With the birds nesting in the trees singing to you, the hares bounding carefree underfoot among the undergrowth and eyes of a thousand beasts and creatures staring at you, you could never truly be lonely in the woods. You’d do your chores and feel the burden of labor required to survive in such a harsh time, but then, you were free to walk under the protection of the greak oaks and pines and gaze at the glory of nature.\n\n\nYou run down along the fields, hefting the weight of the rifle in your hands as father jogs ahead. Soon, you run up to the porch to find mother and Meredith unpacking. You put your gun in the rack, looking at them.\n\n\n“What can I do now, father?” you ask.    \n\n\n“Nothing, boy. It’s up to mother and Meredith to do the unpacking and prepare the catch, Papa says, pulling off his hunting sack and pulling out two hares, their necks broken. “I’ll tell you what. Get the bearings of the forest for me, lad. Scout out for any hare paths or wild fruit growing or deer grazing areas.”\n\n\n“Got it, father,” you nod, grabbing your rifle once more and swinging around to walk back outside again. ", "action_results": [{"action": "Head to the woods", "result": "You begin wandering up towards the trees, holding your gun tightly in your hands. Whilst nature is no doubt a sanctuary to your young mind to find tranquility, there’s many dangers hidden. You point your rifle, making a loud bang sound as you picture yourself shooting a large grizzly bear like that your grandfather had stuffed in his cabin.\n\nYou reach the trees, leaning against a large, thick Oak tree and taking a deep breath, taking in all the scents the forest offers you. Your eyes scan the forest, quickly spotting several points of interest. Among the underbrush you spot a slightly trampled hare path, no doubt leading to wherever’s a good spot to graze. There’s also the stream, which you could wander along for a fair distance in search of anything worth seeing without getting lost. Finally, there’s a large oak tree with lots of strong branches. Perfect for climbing.", "action_results": [{"action": "Head along the hare path", "result": "You begin following the hare path, trudging along with your rifle in hand. You’re far from a good shot, but still the thought of bagging another hare fills your mind. Your eyes flicker along the path for the black eyes of a hare staring back. You hear magpies singing overhead as a few peek from their treetop nests. It’s a lovely forest, that’s for sure.\n\n\nSuddenly, you hear something. You quickly turn, dropping to your knee to raise your rifle into a firing position to bag your prey as father always does. You don’t, clumsily tripping and hitting yourself in the face with the gun. Still, you’re getting better. You push the gun off yourself as your rub your nose, before hopping up to a kneeling position. You stare at where the noise came from. Through the blurred visage of your watery eyes, you see in th distance a pale figure,, sprinting past the trees with unnatural speed. You heft your gun to your shoulder and aim, not knowing whether to fire or not. You don’t want to miss a chance to take out a… whatever creature that is, but you’re unsure whether that’s even a good idea.", "action_results": [{"action": "Fire", "result": "You pull the trigger as the gun bucks in your hands, sending you falling onto your back. You push the gun off you, as you rub your eyes, peeking through the trees. You didn’t hit it, you don’t think. A quick jog over confirms this. You sigh, strolling back to your gun and hefting it up. You spend another hour searching for any trace of the creature, but find neither sight nor sound of it. With that, you tredge back home.", "action_results": [{"action": "Head home", "result": "Labor and Duty\n\n\nYou never do see the figure again. You venture out looking for it a few more times, but you never do. You must've frightened it. No bother. As you grow taller, stronger and smarter, father assures you that soon, it'll be time for you to finally leave and get your own home, your own wife, and your own family. \n\n\nYou suppose he's write. It's your duty to God and nation to build a strong family like that which raised you. That's what expected of you, and that's what you'll do.", "action_results": []}]}, {"action": "Hold fire", "result": "You hold fire, as the creature continues sprinting through the forest. You stare curiously at it, before it disappears from view. Fascinating. You lower yourself from the branch to see if you can spot it from a lower angle, but sadly its completely disappeared. No bother, you'll make an attempt to find out what kind of creature it was another day. Time to head home and report your findings. ", "action_results": [{"action": "Head home", "result": "You don't see any other sight of the creature, or figure, or whatever it was. You grab your gun, hefting it up to your shoulder once more, as you begin strolling home. \n\n\nIt's only a short walk back home. When you arrive, mother and Meredith are putting away the last of your family's possessions, while father sits by the fireplace, cleaning his rifle.\n\n\n\"Jacob, what did you find?\" he asks.\n\n\n\"There was some creature in the woods that was really pale and I saw it but I didn't shoot it bec...\"\n\n\n\"No creature's pale in the woods that I can think of,\" father interrupts. \"Wouldn't be good for them. Their skin's meant to hide them in the foliage, not help them stand out.\"\n\n\n\"We need to get a fire going before night. It's getting colder,\" father says. \"Let's get your chores started. Get to work gathering firewood.\"\n\n\n\"Got it, father,\" you say.", "action_results": [{"action": "Two Hours Later...", "result": "You stare at the bowl of rabbit stew in front of you, lapping your lips as mother continues setting the dinner down on the table. \n\n\n\"Alright, let's pray,\" father says, as you all make the sign of the cross.\n\n\nYou bow your head as you all grab each others hands and hold them tightly to pray to the Lord.\n\n\n\"Bless us, O Lord, and these, Thy gifts, which we are about to receive from Thy bounty,\" you all say in unison. \"Through Christ, our Lord. Amen.\"\n\n\nYou release your hold on Meredith and mother's hands, making the sign of the cross. Then, you eagerly dig into your food. You devour it, licking the last trace that the bowl in front of you ever even held food within two minutes. You slap the bowl down on the plate with a sigh of the joy that can only come from alleviating hunger. You wait for your family to finish eating, tapping the edge of the table out of boredom. After a few minutes, the rest of them finish eating, and you make the sign of the cross once more, before you join hands once more.\n\n\n\"We give Thee thanks, Almighty God, for all Thy benefits, and for the poor souls of the faithful departed, through the mercy of God, may they rest in peace. Amen,\" you all say, before making the sign of the cross a final time. \n\n\n\"Jacob, go check on the goats,\" mother says. \"Meredith, help me cleaning the bowls.\"\n\n\nYou nod, standing and pushing in your chair, hurrying to the doorway and grabbing your coat as you pull it on. You walk outside, quickly heading towards the goat shed, where Nick and Puck lie on their bed of hay. They're well fed and watered, and seem contented.  You turn to walk back inside, before seeing movement up in the trees. \n\n\nThen, you hear the noise. A horrible, long, incredibly loud, screeching howl that penetrates your very core. You feel an urge to run and flee from the noise.", "action_results": [{"action": "Hide behind the goat shed", "result": "You quickly cower behind the goat shed, terrified of the thought of whoever made that howl coming for you. Suddenly, father bursts from the house, his rifle in his hands.\n\n\n\"What was that?\" he barks out, his knuckles white from how tightly he's clutching the rifle.\n\n\nYou point up towards the trees, bathed in the pale moonlight. \n\n\n\"It came from there!\" you say.\n\n\nFather pauses, staring up nervously. He leans into the doorway, grabbing the crucifix that hangs there to watch over you as you eat. He hands you the crucifix, as you take it.\n\n\n\"I want that on you whenever you enter the woods, understood?\" he asks, as you nod. \"I'll have the crucifix for the house replaced in the morning. Just try and get some sleep, OK?\" \n\n\nYou nod, as you begin to trudge off to bed. Despite being exhausted, you know you won't sleep much.", "action_results": [{"action": "The Next Day...", "result": "\"I'm not sending him out there alone! We'll be fine, we'll go quickly!\" father says.\n\n\n\"I need help with fixing the shed, Ezekiel!\" mother replies.\n\n\n\"Jacob can do it, I'll set up the traps!\" father says.\n\n\n\"Jacob's not strong enough to life the blocks, Ezekiel!\"\n\n\nFather sighs, looking at you. It's not your place to get involved in the arguing and even though as the wife mother shouldn't be arguing with father, she's right. You're losing daylight fast as the day progresses. One of you needs to set up the traps and one should fix the shed, and you simply can't do the latter.\n\n\n\"I can go, father,\" you say.\n\n\nFather's still nervous about the creature he heard last night, despite admitting he's not sure what it is. Still, with your rifle and God's protection, you know it won't be able to harm you. \n\n\nFather sighs, his big brow furrowing and his mustache drooping.\n\n\n\"Alright,\" he says. \"Don't stray too far, understood?\"\n\n\n\"I understand,\" you answer.\n\n\n\"Take your crucifix, your rifle and my trapping pack, and be back in two hours, or I'm coming lookingn for you, understood?\"\n\n\n\"I understand,\" you repeat.\n\n\nFather stares up at the forest, slowly blowing out air between his teeth, before nodding.\n\n\n\"Go.\"\n\n\nYou quickly race to grab your father's hunting pack, grabbing the leather pack and swinging it over your shoulder. With your left hand you grab your rifle, struggling to keep it propped up against your shoulder. With your right hand, you hold your crucifix tightly, and head off into the woods.", "action_results": [{"action": "Continue", "result": "You walk along the hare path, your rifle and crucifix held tightly in your hands. You find another good spot for a simple snare trap, beginning to tie up your loop as you peer among the branches for one that could be used for the snare. Suddenly, you hear a branch breaking. You drop the loop, twirling around to point your gun. Thankfully, you don't hit yourself in the face with your rifle. You peer through the trees, seeing the flash of pale flesh from yesterday.", "action_results": [{"action": "Investigate", "result": "You creep forward, lowering your gun as you approach the creature. You step past teh tree, finding a young girl, around your age.\n\n\nThe girl has long, dirty blond hair and very pale skin. You blush and consider averting your eyes as you notice she's completely naked, before settling on focusing on her stares. She crouches over a dead hare, her hands tearing flesh from the creature as she greedily lifts it up and devours it. You stare at her in shock, before she looks up, staring at you. Her face is covered in the hare's blood, her long hair tussled with twigs and dirt in it. Her hands are covered in blood, and she wears a carved wooden ring. The thing that grabs your attention is her eyes. They're bright, shockingly blue that seem to entrap you, and you find yourself unable to say a word.\n\n\n\"Hello,\" she says, staring at you. \n\n\n\"I-I...,\" you stutter, stumbling over your words.\n\n\nYou both stare at each other, before the girl finally holds up the hare.\n\n\n\"Want some?\" she asks. \n\n\n\"N-no thanks,\" you say. \"I'm Jacob.\"\n\n\n\"I'm Rose,\" she replies.\n\n\n\"Do you live here?\" you ask, not knowing what else to say.\n\n\n\"I live all over the woods,\" she replies. \"Have you moved into the cottage?\"\n\n\nYou nod, as she resumes the eating of the dead hare.\n\n\n\"That's not cooked,\" you say. \n\n\n\"No,\" she replies.\n\n\nYou know you have some bread in your pack, and you can see apples hanging nearby. Perhaps you should offer her something less... disgusting.", "action_results": [{"action": "Offer her bread", "result": "You open your pack, pulling out a piece of bread and offering it to her. \n\n\n\"Here, have some of this,\" you say.\n\n\n\"Thank you,\" she says, tearing off a piece of the bread and chewing it. She winces, opening her mouth and spitting out the bread. \n\n\n\"It tastes rotten,\" she says.\n\n\nYou take a bite out of the bread, chewing it and swallowing in. It tastes perfectly fine. Still, Rose resumes eating her hare flesh. \n\n\n\"I like your ring,\" you say, not knowing what else to say.\n\n\n\"Thanks,\" the girl replies. \"I made it myself.\"\n\n\n\"Do you mind if I ask a question?\" you ask, as the girl smiles.\n\n\n\"That's a question,\" she says.\n\n\n\"I mean, like another question,\" you say.\n\n\n\"Sure.\"\n\n\n\"Why aren't you wearing clothes?\"\n\n\nThe girl looks down at her naked body, seemingly only noticing it for the first time.\n\n\n\"Oh,\" she says, blushing. \"Um... I don't know. I don't have any clothes.\"", "action_results": [{"action": "Offer to get her one of Meredith's dresses", "result": "\"I have a sister. She's as big as you. I can get you one of her dresses.\"\n\n\n\"Oh, I don't want to cause any trouble,\" she says.\n\n\n\"No, it's OK, I can get it,\" you say. \"I'll have to do it after I lay down my traps, but I can do it.\"\n\n\nRose nods, before looking at your pack.\n\n\n\"Why do you lay down traps?\" she asks.\n\n\n\"To catch prey to eat,\" you reply. \"What do you use?\"\n\n\n\"My hands,\" Rose says.\n\n\nRose pauses, nodding behind you. You slowly turn, spotting a hare sitting in the grass, seemingly oblivious to the two of you. Rose raises a finger to her lips, slowly stepping forward. Then, with unnatural speed she pounces. Rose bursts forward. You only see a blur before she stops, holding the hare with a broken neck in front of you.\n\n\n\"How many do you need?\" she asks.\n\n\n\"I don't know,\" you say. \n\n\n\"If you get me the dress, I can catch you a few hares,\" Rose offers.", "action_results": [{"action": "Accept her offer", "result": "\"OK,\" you say. \"I won't be able to get the dress until tonight.\"\n\n\n\"I'll have the hares ready for then,\" Rose says. \"So, do...\"\n\n\n\"I need to be home soon, then,\" you say. \n\n\n\"Yeah, my mother will be looking for me soon. I need to go,\" Rose says.\n\n\n\"I'll see you tonight, OK?\" you say.\n\n\n\"Got it,\" Rose nods eagerly.\n\n\n\"OK. Goodbye, Rose,\"\n\n\n\"Goodbye, Jacob,\" Rose says, before sprinting off into the woods.\n\n\nYou watch her leave, before turning to head home. ", "action_results": [{"action": "Half an Hour Later...", "result": "You walk in the door of the cottage, putting your rifle in the gun rack. Father is there, waiting for you.\n\n\n\"Ah, Jacob, you're back. I was getting worried,\" he says. \"Did you set up the traps?\"\n\n\nYou stare at him. For some reason, you feel you shouldn't tell him about the strange girl. He's always been a very puritanical person, hence the religion. When old Mister Kenneth taught a bird to sing in your last town, father wanted him burnt at the stake for witchcraft.", "action_results": [{"action": "Tell the truth", "result": "\"No, I...\" you say, before realizing you need to explain the whole story.\n\n\nFor the next while, you explain the story to father. As you talk, his brow seems to furrow and his mustache droops. He stares at you for a while, before gritting his teeth.\n\n\n\"There's a witch, a demon, maybe the devil himself in those woods!\" father yells, grabbing the newly made crucifix from its place in the doorway. \"You've consorted with pure evil, child. We need to head to town, find a church and pray for forgiveness for our sins!\"\n\n\n\"What? No, father, she was just a girl! You're talking craz...!\"\n\n\nFather slaps you hard, before grabbing your head and holding you close to his chest.\n\n\n\"Do you think the devil can't take any form which pleases him? Renounce the evil in your heart!\" ", "action_results": [{"action": "Pray to God for forgiveness", "result": "You drop to your knees as you've been taught to do, and clasp your hands together in prayer.\n\n\n\"Oh Most humane and adorable Jesus, Your endless grace and mercy flows forth,\" you say. \"Before granting the gift of absolution To earnest repenters of sinful ways, You demanded a sacrificial compensation. For a wrongful act cannot be rectified Until punishment has been accepted! Yes, for the salvation of my soul, Jesus, You accepted the price of the Cross! Grant me the grace to remain free of debts, My heart remaining flawless before You, Making Your absolution truly worthwhile!\"\n\n\nFather hugs you tightly, kissing you on the forehead. \n\n\n\"Come on, we need to get Meredith and mother and head to town. We need a priest, understood?\" \n\n\nYou nod, and quickly follow him to the coach as he calls for mother and Meredith, as you're lead away.\n\n\n\"", "action_results": [{"action": "Continue", "result": "Son of God\n\n\nYou're brought to town with your family and taken to the church, where you're blessed and you pray. After a few hours, father rounds up a posse and heads into the woods, where he searches for the so-called spawn of Satan. Nothing is found, but this push causes father to become even more religious.\n\n\nThe religious shift affects you. Whether real or not, you recognize your talk with the girl as sinful and you pray for redemption constantly. Eventually, you become a priest, and find yourself sanctuary in some desolate part of the wilderness.\n\n\nFull of self-loathing yet knowing suicide is a sin, you spend out the rest of your days in a miserable existence.", "action_results": []}]}, {"action": "Refuse", "result": "\"No, father! She was just a normal girl! She...\"\n\n\nYour father quickly unhooks his belt, smacking it into your head as you stumble backwards. \n\n\n\"By the lord's name, you will repent!\" he screams, as he hits you.\n\n\n\"No!\" you scream in defiance. \n\n\nIn a mixture of anger and panic, father stands over you, beating you desperately, not knowing any other choice. He yells at you, calling you a heathen, a spawn of Satan and more. The beating goes over the top as you continue to refuse to repent. Eventually, a frustrated, enraged blow at the wrong angle ends up snapping your neck, quickly killing you.", "action_results": []}]}, {"action": "Lie", "result": "\"Yes, father, I set up the traps,\" you lie.\n\n\n\"Good,\" father nods. \"Now, we have more chores to do.\"\n\n\nYou nod, and prepare yourself for a long day of work.", "action_results": [{"action": "Later that night...", "result": "You hear the soft snoring of Meredith in the bed next to you. Father and mother are in the next room, but they're definitely asleep. You slowly slide out of bed, and creep over to the closet. You slowly open the closet, pulling out a black cotton dress and slinging it over your shoulder. You creep out of the house, walking towards the woods.\n\n\nRose waits there. She leans against a tree, giving a little wave as she sees you approaching. When you reach her, you hold out the dress and she takes it from you, pulling it  over her head and putting it on.\n\n\n\"How do I look?\" she smiles.\n\n\n\"Pretty,\" you admit, before mentally chastising yourself for being so lustful. \n\n\nRose smiles, and gently kisses you on the cheek. You blush, stepping back.\n\n\n\"Rose!\" you say, embarrassed.\n\n\n\"What? It was on the cheek, we're just friends! Not even my mother could think that was bad!\" she asks, confused. \n\n\n\"You're being lustful! We're not married, we shouldn't be...\"\n\n\nRose puts a finger to your lips, nodding towards the house as you remember your sleeping parents and nod.\n\n\n\"You're weird,\" she says, before walking into the woods. \"Come on, I'll show you where I have the hares.\"\n\n\nYou follow Rose into the darkness of the forest, and you walk alongside her. Soon, you find a dozen hares strung up from a tree by their neck. She cuts the rope keeping them up, and catches the string of hares as it falls, holding it out for you.\n\n\n\"Here,\" she says.\n\n\n\"That's a lot of hares,\" you say. \"Fair trade.\"\n\n\nRose shakes her head.\n\n\n\"No. If you had just laid down your snares, you would've got a few hares. I still owe you something.\"\n\n\n\"Like what?\" you ask. \n\n\n\"You're new to this place. I'll show you around.\"\n\n\n\"Uh, OK, \" you say.\n\n\nYou follow Rose around as she leads you through the forest.\n\n\n\"So, do you... have a house around here?\" you ask.\n\n\n\"Um... no. I sleep a lot of places. I used to sleep in my mother's cottage, but we don't get on. Now, I like to sleep in the trees. Find a nice big branch, hold on tightly. It's nice.\"\n\n\nOver the next hour, Rose shows you the things of importance in the area. The good grazing areas, the most populated hare trails, the wild vegetable and fruit patches. Eventually, you reach within sight of an old, burnt out cottage. Rose stops you before you can get close.\n\n\n\"That's my mother's house,\" she says. \n\n\n\"Oh. Did... did she die?\" you ask.\n\n\nRose shakes her head.\n\n\n\"No, no she's alive. It's just she... well, it's a long story.\"\n\n\n\"That place is all burnt out. No one should live there.\"\n\n\n\"She should,\" Rose says, spitting on the ground. \n\n\nRose quiets up as she leads you away from the cottage. After another few minutes, you come across a mountainous area, with a visible cave further up it.\n\n\n\"And that's where my father lives,\" Rose says. \"Well, sort of.\"\n\n\n\"Does he move around a lot?\" you ask.\n\n\n\"He lives in a lot of places. But he's there,\" Rose says.\n\n\n\"Is he a trapper, or something?\" \n\n\n\"No, he's a...\" Rose says, before pausing. \"Yeah, trapper's a good definition. He traps things.\"\n\n\nYou dismiss her comment, and continue walking. Suddenly, Rose perks up.\n\n\n\"What games do you know how to play?\" she asks. \n\n\n\"Games?\" \n\n\n\"Do you like tag?\" she asks.\n\n\n\"I don't know.\"\n\n\n\"I tap you and you become it, and then you have to tap me.\"\n\n\n\"Oh, OK,\" you say.\n\n\n\"So, tag,\" she says, tapping your shoulder. \"You're it.\"\n\n\nRose bursts off, quickly running through the trees. ", "action_results": [{"action": "Run after her", "result": "You sprint after Rose, laughing as she playfully lets you catch up before evading your lunges at her. She dances at the edge of your reach, and you continue running through the forest.\n\n\nYou spend at least an hour playing but eventually, Rose leads you home. You talk for a bit more, but you arrive back at your cottage.\n\n\n\"Well, goodnight,\" she says.\n\n\n\"Goodnight, Rose,\" you reply.\n\n\n\"Can we do this again sometime? It's nice to have someone to be around.\"\n\n\nShe's right. It is nice. Your short time with Rose has been fun and really helped with your loneliness. \n\n\n\"Yeah. I'd like that,\" you say.\n\n\n\"Great,\" Rose smiles. \"See you soon.\"\n\n\n\"See you soon,\" you say, as you walk back to the cottage to get to bed.", "action_results": [{"action": "One Month Later...", "result": "Your secret friendship with Rose develops quite a fair bit. You have quite a bit of time to play with her. Due to your success at “hunting”, father seems more than happy to leave you in charge of the hunting. Everyday, you head out to do the snares, Rose awaits with a string of hares for you. Then, you have a while to play and have fun, before you need to head home to avoid arising suspicion. You gift Rose with a few luxuries that she can’t scavenge from the woods such as preserves, a blanket and a few other man-made goods. Father notices your rise in behavior, but he simply dismisses it as you enjoying the woods and all the time you’re spending in it. Like you, Rose assures you that it’s best you never meet with her parents. When asking if her parents even know of the friendship or whether they’re in the dark like yours, she vaguely implies that her mother does know, and watches you two playing occasionally. You never see her, mother, but you don’t mind. For now, all is good.\n\n\nYou run through the undergrowth desperately with all your speed, but like always, Rose is much faster than you. She taps you in the shoulder before speeidng away in the blink of an eye, stopping by a tree to lean against it for you to catch up.\n\n\n“You’re too fast!” you complain.\n\n\n“You’re too slow,” Rose says, sticking out her tongue. \n\n\n“Let’s play another game,” you say.\n\n\n“Hide and seek?” she asks.\n\n\nDespite Rose’s unnatural ability to find you during hide and seek, by what she claims to be “sniffing” despite her being far away, you have much more of a chance of success in hide and seek rather than trying to outpace her. She’s faster than a deer, you’ll never beat her in that field.\n\n\n“Yeah, let’s do hide and seek,” she says. “I’ll be on first, if you want.”\n\n\nYou nod eagerly, as  she spins around on the balls of her bare feet, clasping her hands over her eyes.\n\n\n“One, two, three…” she begins to count, as you turn and sprint off into the woods.\n\n\nYou have a few places in mind that would make a good hiding spot. There’s a little den underneath one of the trees that you could hide in. It should be easy enough to crawl into, although you’ve had similar hiding spots before. Still, it’s one of the best spots you have, and the closest one.\n\n\nThere’s also a more risky choice. The burnt out cottage that here mother supposedly lives in is close by. Rose says she only uses it for sleeping in, so you could hide out in there.\n\n\nThere’s also her father’s cave. It’s slightly father away, but Rose seems to have an aversion to it. You could get to it if you run past enough, and hide away in there. There’s been no reports of trappers in the area and Rose hasn’t mentioned seeing him in a while, so you should be able to hide out there.", "action_results": [{"action": "Hide in the den", "result": "You quickly make your way to the den, finding it in the exact spot you remembered, just squirreled away under the twisted roots of an ancient Oak. You drop to your knees, lifting yourself down into it and scrunching up. You wait patiently, closing your eyes.", "action_results": [{"action": "Wait", "result": "It’s not long before you hear a gleeful “Found you!”. You open your eyes and look up at Rose, who stands by the den opening with a smile.\n\n\n“Ah, rats!” you say, as Rose grabs your hand and helps pulls you out of the den.\n\n\n“That was fun,” she smiles.\n\n\n“Yeah, I’m only just realizing that hide and seek is mainly one person waiting in a hiding spot,” you say, before looking up at the sun as it falls through the sky. “It’s late. I need to get home soon.”\n\n\n“Oh come on! I didn’t even get to hide yet!” Rose complains, pouting in an exaggerated fashion.\n\n\n“Sorry. You can hide first time,” you say.\n\n\n“Fine,” Rose says. “Come on, let’s get you home.” ", "action_results": [{"action": "Another month later...", "result": "You stand in the goat shed, feeding Nick and Puck. You put the rest of their feed down, walking out to talk to father. Father chops wood by the wide of the house, while mother cooks and Meredith washes clothes by the stream. You walk to father, who seems quite content. Thanks to Rose, you've been eating well, and she even brought you a full deer the other day. You had to shoot it to make it seem like you had hunted it yourself, but other than that it was a cause for celebration.\n\n\n\"Ah, boy! Have you checked the traps today?\" \n\n\n\"Not yet, father,\" you say.\n\n\nFather smiles, motioning towards the soup mother's making.\n\n\n\"Go, get some venison soup and head out. I need to head to town tomorrow. Get some salt to help the meat last through winter, and sell some of the excess meat. We're truly blessed with your hunting and trapping skills, Jacob. Thank the Lord for it. So tell me, will you come to town with me tomorrow?\"", "action_results": [{"action": "Agree to head to town with father tomorrow", "result": "\"Sure, father. I'd love to.\"\n\n\n\"Great. I'll be seeing if there's any fathers with girls your age in the town, you know. You're getting old, and I'm sure with your strong features, ability to provide for a family and your humility to God, you'll have no trouble finding a wife. Ah, I'm talking too much. Now go, boy, have some soup and check the traps.\"\n\n\nYou begin walking away and head to mother, who stirs the soup slowly. \n\n\n\"Do you want some, Jacob?\" she asks, not looking up. \n\n\n\"Yes, please,\" you say, as she dumps some of the soup into a wooden bowl and hands it to you.\n\n\nYou say your thanks to her before praying to say the same to the Lord, and then quickly devour the soup. It's fairly delicious and both easily warms and fills you up easily. Now, you're ready to head out.", "action_results": [{"action": "Head out to the woods", "result": "You turn, walking off into the woods. It's only a few minutes of strolling before Rose appears behind you, smiling and happily fiddling with her wooden ring.\n\n\n\"Hiya,\" she says.\n\n\n\"Hello, Rose,\" you say.\n\n\n\"So, Jacob, what do you wanna do?\"\n\n\n\"I don't know,\" you say. \"Did you get me any prey to bring home?\"\n\n\nRose nods.\n\n\n\"Yeah, I got you five hares. Is that enough?\"\n\n\n\"Perfect,\" you nod.\n\n\n\"Come on, then,\" Rose smiles, bounding away. \"Let's go find something to do.\"\n\n\nYou look at her, thinking. Father said you were to find a girl relatively soon. A wife to raise a family with. From what you've seen of the outside world, the girls are all the same as Meredith and mother. They do what they're told, they pray, they're humble. But you don't want a wife like mother or Meredith.\n\n\nYou wonder if Rose would be a suitable partner. She doesn't know how to sew, or clean, or cook, or wash clothes, or really do any wife stuff. But you'd prefer a second out here with her rather than with Meredith or mother. She's the one who hunts. Maybe you could learn to do the wife things for her if you got married. You...\n\n\nAn acorn hits you in the head and you step back, startled. Rose throws another acorn at you, which you duck under.\n\n\n\"Hello! Anybody there?\" Rose says, gently tapping her knuckles against your head.\n\n\n\"I'm fine, I'm fine,\" you reply, as you begin walking alongside her.\n\n\nYou walk down towards the stream, where Rose's catch awaits. Five hares hang from the branches alongside three squirrels. Rose hops across the river, water splashing the edge of her dress. You follow her, jumping from rock to rock to cross the stream. Rose sits down on a rock basking in the sun that  sits at the edge of the stream, water rushing past. You sit down next to her, staring at her. With long blond hair, shockingly blue eyes and a pretty, if a bit animal-like face, she's definitely pretty. Her eyes lock into yours, as you both stare into each other.", "action_results": [{"action": "Kiss her", "result": "You lean in, kissing Rose on the lips, closing your eyes. Her lips are warm, and you feel yourself meld into the kiss. \n\n\nYou feel her pull away and open your eyes just as she slaps you hard across the face. You stumble backwards, as she stares at you, nervous and panicked. \n\n\n\"No, no, no!\" Rose says, looking scared. \"We're not allowed to kiss!\"\n\n\n\"What? What's wrong?\" you ask.\n\n\nRose looks off into the woods, panicked and scared, as she stares fiddling with her ring again.\n\n\n\"I promised, Jacob! I promised her I wouldn't kiss you or fall in love or anything! I promised!\"\n\n\n\"Rose, calm down, OK! It's fine, we're fine!\" you say, trying to calm her down.\n\n\n\"No, no, no! I told you my mother watches us playing sometimes. I told you! Now she saw you do that, and she's going to be so angry at us, and... and...\" Rose says, looking absolutely terrified.\n\n\n\"I'm sorry, OK! I can explain this to her!\" you say.\n\n\n\"No! I need to... I...\" Rose goes even paler than her natural pallor. \"You need to go.\"\n\n\n\"Rose, I'm not going! I...!\"\n\n\n\"Take your stupid prey and go! Just go!\" Rose shouts at you. \"I need to deal with this.\"\n\n\n\"Rose, pl...!\"\n\n\n\"Go home, Jacob! I'll deal with it!\" she screams, bounding up from the rock and sprinting off into the trees.\n\n\nYou stand to sprint after her, but she's long gone into the woods. You sigh, walking over to your prey and grabbing the string of squirrels and rabbits. With that, you turn, walking home.", "action_results": [{"action": "Hours Later...", "result": "You sit at the table with your family. Mother puts the meal down on the table, strips of cooked venison and corn. You grab one of the strips and shovel it into your mouth, feeling bitter.\n\n\n\"Jacob!\" your father shouts, aghast. \"Where are your manners? How dare you take the bounty of the Lord without thanks!?\"\n\n\n\"Sorry, father,\" you say, bowing your head. \"I didn't think.\"\n\n\n\"No, you didn't!\"\n\n\n\"I'll include this in my prayers for redemption tonight,\" you say.\n\n\nYou hold out your hands, grabbing your Meredith's and your mother's.\n\n\n\"Bless us, O Lord, and these, Thy gifts, which we are about to receive from Thy bounty,\" you all say in unison. \"Through Christ, our Lord. Amen.\"\n\n\nYou release your hold on Meredith and mother's hands, making the sign of the cross. Then, you start to eat, devouring your venison and chewing down on the corn.  Eventually you finish, and hold out your hands to pray, though your heart isn't in it, let alone your soul.  \n\n\n\"We give Thee thanks, Almighty God, for all Thy benefits, and for the poor souls of the faithful departed, through the mercy of God, may they rest in peace. Amen,\" you all say, before making the sign of the cross a final time.\n\n\nYou stand for the table, pushing in your chair. Your father looks at you with a worried look in his eyes.\n\n\n\"Look, it's dark. Say your nightly prayers and head to bed.\"\n\n\n\"I...\" you start to say, before pausing. \"Yes, father.\"\n\n\nYou sigh, before walking to bed.", "action_results": [{"action": "Sleep...", "result": "You're awoken by the noise. A horrible, long, incredibly loud, screeching howl that penetrates your very core. The noise floods into your mind, as horrifying and scary as when you first heard it. Only now, you can hear it outside your house. You hurry to clamber out of bed, clambering out of bed as you hear the door smash open. The creature lets out a chattering, screeching howl. You freeze, feeling cold, as shivers run down your spine. You need to act, fast. ", "action_results": [{"action": "Get your parents", "result": "You charge into the next room, and finally glance the creature. It looks vaguely human, a fact even more terrifying. It stands at seven or eight feet, it's skin as white as bone. It has long black hair, matted with blood and gore. It's hands have transformed into horrible, mangled claws, with long, bloodstained claws. It's face is mangled and misshapen, but its eyes are filled with malice and hate.\n\n\nIt stares at you. Then, with supernatural speed, it bursts forward. It hits mother first, its claws rending through her in seconds, tearing her apart. Father's barely out of bed before it turns to him. The superstitious man has reached for his crucifix rather than his rifle, but gets neither as the monster slashes his throat open, staining his mustache red as he collapses to his knees.\n\n\nMeredith appears in the doorway, terrified and confused. The monster bursts towards her, impaling her fragile body on one of its claws. It raises her up, growling in her face, before tossing her aside. Finally, it turns to you, it's horrible, mangled mouth seeming to turn into a grin.\n\n\nIt steps forward slowly. You know there's no use running. You stare at the monster as it brings its claws just next to your face, still grinning with satisfaction. It motions as if to slash open your throat, but stops suddenly. It motions to do so again, but pauses once more, this time hissing in pain. It stops, before howling up towards the sky. Then, it brings its face up to yours.\n\n\n\"Leave this place,\" it snarls. \n\n\nIts breath reaches your nostrils, warm and toxic. You feel your head going black, before collapsing onto the ground. ", "action_results": [{"action": "The Next Morning...", "result": "You awaken in the house, surrounded by the bodies of your loved ones and covered in blood. You stand, staring around your destroyed house. It seemed the creature took time to destroy the place. It's dead silent despite the sun having risen, so the roosters must be dead. You sit there, surrounded by bloodshed and death. You cry for a bit, sobbing into your hand, but eventually you stop. You know you need to be strong. You have to think about yourself. You have to think about Rose. You have to think about the future.\n\n\nYou stand, staring out at the woods. You wonder what you should. You could flee. The nearest town isn't too far. You could most likely walk to it in a few hours. \n\n\nOr, you could venture out into the woods. Find Rose, attempt to find what's going on. It's a more dangerous approach, but at least it'll get you answers.", "action_results": [{"action": "Find Rose", "result": "You walk out of your ruined house, not looking back, and begin heading towards the woods. It takes an hour of searching, but you find her. She sits by the same rock as yesterday, staring into the water.\n\n\n\"Rose!\" you say. \n\n\nRose looks at you. She looks... strange. She's the palest you've ever seen. She's missing her wooden ring, as well. Her eyes are different, however. They're dark, the blue of her eyes now almost being black. Tears stream down her face as she stares at you. \n\n\n\"Jacob!\" she says, crying. \"I'm so so sorry, Jacob. I tried to stop her. I tried my best. But my father's greedy, and he'd only...\"\n\n\nRose bursts into tears as you quickly cross the river. You wrap your arms around her, hugging her tightly.\n\n\n\"It's OK. It'll be alright. We're fine, OK? We're fine. We need to get out of here.\"\n\n\n\"It's my fault,\" Rose cries. \"I know what my mother's like. I should've never talked to you.\"\n\n\n\"It's OK. It's OK,\" you say. \"We just need to go, OK?\"\n\n\n\"No, Jacob, I can't. I can't,\" she says.\n\n\n\"It's OK. Just take a deep breath, and tell me what's going on,\" you say.\n\n\n\"My... my mother... she saw us kiss. It took a lot for me to convince her to let us be friends, and I promised her we'd never kiss or marry or anything. I knew she was going to try kill you, so I had to make a deal.\"\n\n\n\"That... the monster is your mother?\" you ask, stepping back.\n\n\nFay nods slowly.\n\n\n\"She wasn't always like that. When she met my father, he made her like that. She wanted to be like that, to have power. She gave him so much... she gave him everything... eventually, her gave her something in return. A child.\"\n\n\n\"Who... who is your father, Rose?\" you ask.\n\n\n\"It's...\" Rose says, before bursting into tears. \"I'm so sorry, I wanted to tell you, but I thought you wouldn't want to be my friend if I told you.\"\n\n\n\"Rose...\"\n\n\n\"It's... my father is Lucifer, Jacob. I knew mother was going to try kill you, so I had to do something. I couldn't stop her, but my father could. I tried to convince him, but he wanted something in return. I had to...\"\n\n\n\"Rose...\" you repeat again.\n\n\n\"I had to sell him my soul, Jacob.\"\n\n\nYou stare at her in shock as she nods slowly.\n\n\n\"I'm sorry,\" she says softly. \n\n\n\"We... we can fix this,\" you say.\n\n\n\"Jacob, you need to go. You can't stay here with me. Please, just go.\"\n\n\n\"No, no! We can fix this! I can fix this! If you turn to Jesus Christ, he can save your soul! No matter what kind of deal you've made, if you've accepted Jesus Christ into your heart, you'll be saved!\"\n\n\n\"I'm too corrupt for that,\" she says softly.\n\n\n\"Then we can purify you! We can purify you! Or I can go talk to your mother! If I can convince her to let us be, she can... talk to your father, or something. I mean, that's got to work!\"\n\n\nRose stares at you blankly, her eyes still dark and lifeless.\n\n\n\"She'd kill you on sight if my father's protection has warn off. If it hasn't, she won't care.\"\n\n\n\"Then I can go talk to your father! I'm sure I can convince him, or trade something with him, to give you your soul back.\"\n\n\nRose slaps you hard across the face.\n\n\n\"You don't go up there, do you understand?! You stay away from him! I'll tell you what the plan is. You leave. You get out of here. Go to town. Find a pretty girl, get married, settle down. Be happy, understand?\"\n\n\n\"I can't do that to you,\" you say, exasperated.\n\n\nYou could try to purify her. Then, with Jesus Christ, you could get her soul saved. You could also try to talk to one one of her parents. Or... you could just leave. You could abandon everything, and try to find a happy life.", "action_results": [{"action": "Try to purify and save Rose", "result": "\"Come on!\" you say, grabbing her hand. \n\n\n\"No, Jacob, leave me alone,\" she says.\n\n\n\"Please, Rose, trust me! If this doesn't work, I'll leave, and I'll never bother you again! We can purify you! The lord will accept you! I promise!\" \n\n\nRose stands up, nodding slowly.\n\n\n\"Fine. You promise you'll leave if this doesn't work?\"\n\n\n\"I promise,\" you say.\n\n\nYou lead Rose back towards the house. It takes you some time to gather up what you need, but you do. Your father's crucifix as well as your own, the family Bible and a small flask of holy water that your father brought from the last town's chapel. Rose looks at it nervously.\n\n\n\"I'm not sure about this, Jacob.\"\n\n\n\"Trust me,\" you say.", "action_results": [{"action": "Begin the ritual", "result": "\"Kneel,\" you say, as Rose kneels.\n\n\nYou stand over Rose, opening your bible and beginning to read.\n\n\n\"In the Name of Jesus Christ, our God and Lord, strengthened by the intercession of the Immaculate Virgin Mary, Mother of God, of Blessed Michael the Archangel, of the Blessed Apostles Peter and Paul and all the Saints,\" you begin to read, as Rose begins to wince in pain. \"And powerful in the holy authority of our lives, we confidently undertake to repulse the attacks and deceits of the devil. God arises; His enemies are scattered and those who hate Him flee before Him.\"\n\n\nYou begin pouring the holy water over Rose, who begins to scream. You grit your teeth, and continue the ritual.\n\n\n\"As smoke is driven away, so are they driven; as wax melts before the fire, \n\nso the wicked perish at the presence of God,\" you say.\n\n\nSuddenly, Rose screams as she sets alight. She howls desperately in pain as the fire quickly burns through her dress, the very dress you stole for her. She screams horribly as she writhes in pain, and before you can act, her flesh and bone have burnt to ash. You drop to your knees over the ash, staring at it in shock. \n\n\nGod has failed. He has failed to save your love. He took her from you. You stare at the ash, your hands shifting through it. Rose is gone. Your tears fall into the ash as you cry.\n\n\nAfter an hour of crying, you final stand. Your bible and crucifix lie next to you. You stare at them, wondering if God is truly with you.", "action_results": [{"action": "Accept him", "result": "No. God is with you. He always is. You turn away from the scene, picking up your bible and crucifix. With a prayer on your lips and tears in your eyes, you walk away from the horrors of the woods and all around it.", "action_results": [{"action": "Continue", "result": "God's Child\n\n\nAfter a few hours of walking, you find a town. You find yourself the nearest church, and pray in it. Soon, God provides. You find a job with the pastor, and are eventually ordained a full minister. You eventually end up as the town pastor, and accept your former life as sinful. Rose burnt because she rejected God in her heart. Your love for her fades, and you soon find a new wife who you marry.\n\n\nYou wonder if this is what joy is. You don't feel happy like you did with Rose, but that was the pleasures of Sin. You have a strong connection with God, a nice house and a loving wife who is with child. That's certainly more than enough, isn't it?", "action_results": []}]}, {"action": "Reject him", "result": "You grab steel and flint, and set the bible alight. You hold the crucifix into the flames, as that sets alight too. The flames burnt brightly in your hands, licking your hands and arm. It hurts, but you grit your teeth. If God is up there, you best get used to the burning sensation. Once the bible and crucifix are ash, you stand. You're done here.", "action_results": [{"action": "Continue", "result": "Burning Passion\n\n\nYou walk through the woods, looking up at the starless night. Your burns still hurt, but you no longer care. You stare up at the sky, and know that God's either not there, or not worth your love. Who is he to claim you're a sinner with all the genocide and torture he's done? No. You're all sinners. No longer bond by silly superstitions and rules, life is yours.", "action_results": []}]}]}]}, {"action": "Head to talk with her father", "result": "\"I need to go,\" you say.\n\n\n\"Yeah,\" Rose nods. \"Thanks.\"\n\n\n\"I'll be back,\" you reply.\n\n\n\"No, Jacob! Go to the town! Please!\"\n\n\nYou walk away from Rose, heading towards the cave. She doesn't seem to have the strength to follow, or doesn't realize where you're going. None the less, you walk away.\n\n\nAfter a few minutes of walking, you reach the mountain. You climb up the rocks and reach the mouth of the cave, turning only briefly to stare at the forest around you. You feel a certain cold chill run through you as you stare at into the darkness inside, but you know you need to enter. You walk further into the cave, as the shadows and darkness consume you. After a minute of stumbling forward, you reach the end of the cave, pausing. In the middle of the cave, dozens of scratches cover the inside of the wall, alongside dried in blood. You pause, staring at it. In the middle, a deer skull sits in place You half expect to start hearing horrible screaming or demons to clamber out from the walls, but nothing happens. The crucifix is heavy in your pocket, and you realize that's what's preventing him from coming. You take it out and walk back to the mouth of the cave, and stare out at the woods, knowing you don't really have a choice here.", "action_results": [{"action": "Throw it", "result": "Your throw the crucifix, watching it disappear off out of view into the trees. Then you turn, walking back further into the cave. You walk back to the skull, and kneel in front of it, closing your eyes. You wait in silence for several minutes, before you finally hear a voice.\n\n\n\"Ah... you must be the boy. Hello, Jacob.\"\n\n\n\"H-h-hello,\" you stutter, trying to keep calm.\n\n\n\"Keep your eyes closed, would you, boy?\" the voice asks.\n\n\n\"OK,\" you reply. \n\n\n\"I assume you know who I am?\" the voice asks.\n\n\n\"You're Lucifer.\"\n\n\n\"So you know how high the stakes are here. What did you come here to do?\"\n\n\n\"I want you to give Rose her soul back.\"\n\n\n\"I didn't ask what you wanted. I asked what you came here to do?\"\n\n\n\"To... to get her soul back,\" you say.\n\n\n\"Oh, my dear boy, how is it you expect to do that?\"\n\n\n\"I'm... I'm willing to trade.\"\n\n\n\"A soul is of infinite value. You have only one thing that even comes close to it in value. But you know that, don't you?\"\n\n\nYou nod slowly, as you feel hands on your shoulders.\n\n\n\"So tell me... are you willing to give your soul for hers? The trade's simple. Your soul for hers. Do we have an agreement?\"", "action_results": [{"action": "Accept the deal", "result": "\"Fine,\" you say.\n\n\n\"Say it,\" Lucifer asks.\n\n\n\"I accept the deal,\" you say, before shuddering in pain as you feel his soul tear into your very being.\n\n\n\"Then it's a deal!\" \n\n\nYou scream as you feel your body begin to burn up in terrible pain. You feel your soul being torn out, before you collapse, your life taken from you.", "action_results": [{"action": "Continue", "result": "Although you never learn of it, Rose sat by the river for several hours. Slowly, she begins to feel better. It's only after a few hours she realizes what's happening. She headed up to the cave, and found your body lying there. No matter what she offered, her father refused to revive the departed boy. Eventually, he fell silent, and she left. She left the cave and she left the cave. She walked for miles out of the woods, not knowing what direction the nearest town was. Eventually, a carriage found the girl in the dress, bringing her to the nearest town. Sitting in that carriage, free of her father, free of her mother, free of the woods, that girl in the dress knew that she was free, and it was all thanks to you.", "action_results": []}]}, {"action": "Reject the deal", "result": "\"No,\" you say.\n\n\n\"Oh, pathetic,\" Lucifer asks. \"You've wasted my time here.\"\n\n\nSilence consumes you, and you wait patiently. After a few minutes, you open your eyes. The deer skull sits there, the same as ever. You stand, turning and walking out of the cave. You clamber down the hill, and start walking towards Rose. After a few minutes, you find her.\n\n\n\"Jacob! I told you to leave!\" she says.\n\n\n\"I tried to talk to your father, but...\"\n\n\n\"Jacob! No! Please, please don't take any of his awful deals! Just go! Leave, Jacob!\"", "action_results": [null, {"action": "Head to talk to her mother", "result": "\"I need to go,\" you say.\n\n\n\"Yeah,\" Rose nods. \"Thanks.\"\n\n\n\"I'll be back,\" you reply.\n\n\n\"No, Jacob! Go to the town! Please!\"\n\n\nYou walk away from Rose, heading towards the burnt out cottage. She doesn't seem to have the strength to follow, or doesn't realize where you're going. None the less, you walk away.\n\n\nIt's only a few minutes before you reach the burnt out cottage. You stand in the ash, waiting. You know it won't be long before the creature finds you. It's not. After only a few minutes, you see the creature emerging from the wounds. It snarls, walking forward. It walks up to you, close enough that you can smell it's disgusting breath. It holds it's claw inches away from, letting out a low growl. \n\n\n\"Why are you still here?\" it, or more accurately you realize, she growls. \n\n\n\"I love your daughter. I love everything about her.\"\n\n\nThe creature roars, flecks of mucus and spit hitting you as she does so.\n\n\n\"She... she sold her soul to protect me. I need to get it back for her. Please, I need your help...\"\n\n\n\"Do you think I want to help you?\" the creature cackles.\n\n\n\"Do you think I want to be here?\" you shout. \"You killed my father, you killed my mother and you killed my mother! I want to stab you to death and set you alight! But I'm here for Rose!\" \n\n\n\"Do you know what I am? Do you know what she truly is?\"\n\n\n\"She told me,\" you say.\n\n\n\"She's the spawn of Satan. Do you truly think she loves you? I can tell you this: A child like her is incapable of love. She doesn't love you. Its the nature of her type to find a man at that age. We ensnare a man when we're young, then when the men, you for example, put down all your protections, we kill you, we give your soul to Lucifer and our transformation takes place. That's what I did. That's what she'll do to you.\"\n\n\n\"I don't believe you,\" you say.\n\n\n\"Proof it. I'll make you a deal, little one. If you want, I can remove your protections. Your crucifix, your blessing, your innocence. I can make it so as soon as she sees you, she'll be able to tear out your through like I did my first lover. If you truly love her, if you truly trust her, you'll let me. But if not, then you don't, and you best leave this place and horror it shows. I wasn't ready for my daughter to usurp my as the transformed predator of this place, but if you're truly so brainwashed and infatuated by her that you're still willing, she's earned it. So, shall I remove your protections?\"", "action_results": [{"action": "Agree", "result": "\"I agree,\" you say softly, as the creature snarls.\n\n\n\"So be it,\" she says. \"Remove any religious artifacts you have.\"\n\n\nYou take out your crucifix, casting it aside. The creature laughs, slowly circling you. \n\n\n\"Remove your sheath,\" she demands.\n\n\nYou pull your top off, before pulling off your paths and boots, standing in front of her. She drags her claws along your skin, before pausing in front of you.\n\n\n\"Say \"I consent\", understood?\" she asks.\n\n\n\"I consent,\" you reply. \n\n\nInstantly, she slashes your chest with her claw. You step back as she slashes you again and again with her claw. After a few more slashes, you collapse onto the ground. \n\n\n\"Voila,\" she says.\n\n\nYou stare down at your chest, and see that she's carved a pentagram into your chest. \n\n\n\"Your protection is broken,\" she says. \"Follow me.\"\n\n\nYou stand slowly, your chest on fire with pain. You begin to follow her, before she lets out a hissing sound that you realize is a sigh.\n\n\n\"Your clothes. Fetch them,\" she says.\n\n\nYou nod, getting dressed as you stare at her. Despite the fact that you should hate her, you only pity such a horrible creature. Still, you follow her along towards the cave. After a few minutes of walking, you reach the cave. The creature turns on her mangled legs to stare at you.\n\n\n\"Stay here,\" she says.\n\n\nWith that, she climbs up the mountain and disappears down into the cave. You stand there waiting for what seems like hours. Eventually though, she appears again, walking down from the mountain. She holds out her clawed hand, and at the center of black, gnarled hand is Rose's wooden ring.\n\n\n\"Take it and return this to her. Make sure she wears it,\" she says. \n\n\n“Is this…?”\n\n\n“That ring contains her soul,” she says.\n\n\n“How… what did you have to give to get this?” you ask.\n\n\n“Never mind. That’s a deal between me and him. It doesn’t involve you, and it doesn’t involve Rose. Now go. And… don’t say I didn’t warn you.”\n\n\nShe stares at you with her eyes of pure hatred, before she sprints off into the trees, leaving you alone.", "action_results": [{"action": "Find Rose", "result": "You quickly find Rose sitting by the river. She looks incredibly sickly and broken. She looks up at you, anger flooding through her.\n\n\n“Jacob! You need to go! You can’t help me!” Rose says.\n\n\n“I can!” you reply, offering her the ring. “Put it on.”\n\n\nRose stares at the ring, sliding it on slowly, before staring at you in shock.\n\n\n\"How... how did you get this?\" she asks.\n\n\n\"I talked to your mother,\" you admit.\n\n\n\"You idiot! Did she hurt you? Are you OK?\" Rose says, worried.\n\n\n\"Yes, I'm fine,\" you say.\n\n\n\"You're bleeding,\" she says, peeling your shirt up.\n\n\n\"I'm fine,\" you say, as Rose stares at your chest.\n\n\n\"Did... did she do this to you?\" Rose asks.\n\n\n\"Yes,\" you say.\n\n\n\"And you consented to it?\" she asks.\n\n\n\"Yes,\" you say again.\n\n\n\"Did she tell you... anything I might do?\" Rose asks nervously.\n\n\n\"She told me you could... do something to become like her if I did this.\"\n\n\nRose hugs you tightly, kissing you on the lips. The warmth of her lips flood through your face, and you feel whole again. \n\n\n\"I'd never do that, Jacob. I'll never be like her.\"\n\n\n\"I know,\" you say.\n\n\nShe kisses you again, and this time she kisses back. You melt it one another, before she pulls back.\n\n\n\"Come on, we can do this later,\" she says. \"You're hurt. We need to get you some bandages.\"\n\n\n\"Yeah, let's get the hell out of this godforsaken woods.\"\n\n\nYou stand with Rose, who puts her arm around you. Then, the two of you walk to the edge of the forest and out of the trees, walking away and never looking back.\n\n\n ", "action_results": [{"action": "Continue", "result": "You sit in the carriage alongside Rose, staring at the road ahead. With father's savings taken from the ruins, you managed to have the old coach refitted with horses and stocked with everything worth taking. Now, you sit in the carriage, heading off to parts unknown. \n\n\n\"This is nice,\" Rose says, staring off into the horizon.\n\n\n\"Yeah, it is,\" you say, leaning in and kissing her on the cheek. \n\n\nRose slides off her wooden ring, tossing it to you. You fumble through the air to catch it, as Rose laughs.\n\n\n\"Rose! Keep this safe, would you?\" you say nervously.\n\n\n\"I trust you with it. You hold the keys to my heart, why not the ring to my soul?\" she asks.\n\n\n\"Poetic,\" you remark, as she hugs you. \n\n\nRose holds out her finger, and you gently put the ring on.\n\n\n\"Do you have anything to ask me?\" Rose asks.\n\n\nYou pause for a second, for deciding.\n\n\n\"Rose, will you marry me?\"\n\n\n\"I'd be glad to, Jacob.\"\n\n\nWith those words, you ride off towards the horizon. ", "action_results": []}]}]}, {"action": "Refuse", "result": "\"So then, you don't love her,\" the creature says.\n\n\nYou pause, before slowly nodding.\n\n\n\"Then go,\" she says. \"Get out of these woods and never return. Because as soon as this spell wears off, I'll carve you apart.\"", "action_results": [{"action": "Leave", "result": "You sigh, knowing she's right. You turn, walking away from her. You walk away from her, walk away from the woods, and walk away from the entire ordeal. You look back many a time, but you keep on walking.", "action_results": [{"action": "Continue", "result": "Lost Soul\n\n\nYou never find peace with yourself for what happened with that. With Rose, with the monster, with the woods. The memories haunt you. Eventually, you turn to the only thing you have left: religion. You pray every single day for redemption, for God's peace.\n\n\nEventually, you become a priest, and find yourself sanctuary in some desolate part of the wilderness.\n\n\nFull of self-loathing yet knowing suicide is a sin, you spend out the rest of your days in a miserable existence.", "action_results": []}]}]}]}, {"action": "Leave", "result": "\"Fine. I'll leave,\" you say.\n\n\n\"Thank you,\" Rose says, smiling faintly at you.\n\n\nShe steps up, kissing you softly on the lips. Her lips are cold.\n\n\n\"Go, now. Goodbye, Jacob,\" she says.\n\n\n\"Goodbye, Rose,\" you say, trudging away from her.\n\n\nIt will be a long walk to the nearest town.", "action_results": [null]}]}]}]}, null, null]}, {"action": "Get out of this wretched place", "result": "You look out at the woods one last time, and quickly begin packing everything you have here, all the salted meat, all father's savings, everything you can find, and you begin walking away. It's a long walk to town, but you can make it.", "action_results": [{"action": "Continue", "result": "Lost Soul\n\n\nYou never find answers. You never find peace with yourself for what happened with that. With Rose, with the monster, with the woods. The memories haunt you. Eventually, you turn to the only thing you have left: religion. You pray every single day for redemption, for God's peace.\n\n\nEventually, you become a priest, and find yourself sanctuary in some desolate part of the wilderness.\n\n\nFull of self-loathing yet knowing suicide is a sin, you spend out the rest of your days in a miserable existence.", "action_results": []}]}]}]}, {"action": "Hide under the bed", "result": "You dive under your bed, to a point where you can see the rest of the room, but no one else can see you. You hear your parents' screams of terror as they're torn apart.\n\n\nSuddenly, the door to your room smashes open, and you find the creature staring at you. It looks vaguely human, a fact even more terrifying. It stands at seven or eight feet, it's skin as white as bone. It has long black hair, matted with blood and gore. It's hands have transformed into horrible, mangled claws, with long, bloodstained claws. It's face is mangled and misshapen, but its eyes are filled with malice and hate as they peer around the room.\n\n\n The monster bursts towards Meredith who still lies in her bed, impaling her fragile body on one of its claws. It raises her up from her bed, growling in her face, before tossing her aside.\n\n\nIt stops, staring around the room, sniffing slowly.", "action_results": [{"action": "Run", "result": "You try to crawl out from under the bed, but as soon as you do you realize there's no escape. You stare at the monster as it brings its claws just next to your face, still grinning with satisfaction. It motions as if to slash open your throat, but stops suddenly. It motions to do so again, but pauses once more, this time hissing in pain. It stops, before howling up towards the sky. Then, it brings its face up to yours.\n\n\n\"Leave this place,\" it snarls. \n\n\nIts breath reaches your nostrils, warm and toxic. You feel your head going black, before collapsing onto the ground. ", "action_results": [null]}, {"action": "Hide", "result": "You wait patiently, trying not to make a sound. Slowly as it sniffs the air it begins turning its head to look at where you're hiding. It slowly approaches, before dropping to its knees to stare at you with those dead eyes, it's horrible, mangled mouth seeming to turn into a grin.\n\n\nYou try to crawl out from under the bed, but as soon as you do you realize there's no escape. You stare at the monster as it brings its claws just next to your face, still grinning with satisfaction. It motions as if to slash open your throat, but stops suddenly. It motions to do so again, but pauses once more, this time hissing in pain. It stops, before howling up towards the sky. Then, it brings its face up to yours.\n\n\n\"Leave this place,\" it snarls. \n\n\nIts breath reaches your nostrils, warm and toxic. You feel your head going black, before collapsing onto the ground. ", "action_results": [null]}]}, {"action": "Grab Meredith", "result": "You charge over to your sister, grabbing her.\n\n\n\"Meredith! Meredith!\" you say in a hurried manner.\n\n\n\"Wh... what?\" Meredith asks as she stirs from her shoulder.\n\n\nSuddenly, the door to your room smashes open, and you find the creature staring at you. It looks vaguely human, a fact even more terrifying. It stands at seven or eight feet, it's skin as white as bone. It has long black hair, matted with blood and gore. It's hands have transformed into horrible, mangled claws, with long, bloodstained claws. It's face is mangled and misshapen, but its eyes are filled with malice and hate.\n\n\nIt stares at you. Then, with supernatural speed, it bursts away. You try to rouse Meredith again and she stumbles out of bed as you hear mother and father scream as they're torn apart. Then, the creature appears in the doorway again, as you run for the window with your sister. The monster bursts towards Meredith, impaling her fragile body on one of its claws. It raises her up, growling in her face, before tossing her aside. Finally, it turns to you, it's horrible, mangled mouth seeming to turn into a grin.\n\n\nIt steps forward slowly. You know there's no use running. You stare at the monster as it brings its claws just next to your face, still grinning with satisfaction. It motions as if to slash open your throat, but stops suddenly. It motions to do so again, but pauses once more, this time hissing in pain. It stops, before howling up towards the sky. Then, it brings its face up to yours.\n\n\n\"Leave this place,\" it snarls. \n\n\nIts breath reaches your nostrils, warm and toxic. You feel your head going black, before collapsing onto the ground. ", "action_results": [null]}, {"action": "Get out the window and flee", "result": "You run for the window, opening it, but instantly the door smashes open as the creature enters the room. It looks vaguely human, a fact even more terrifying. It stands at seven or eight feet, it's skin as white as bone. It has long black hair, matted with blood and gore. It's hands have transformed into horrible, mangled claws, with long, bloodstained claws. It's face is mangled and misshapen, but its eyes are filled with malice and hate.\n\n\nIt stares at you. Then, with supernatural speed, it bursts away as you hear your parents scream as they're no doubt torn apart. You fumble for the window latch, but the creature bursts back in once more. It bursts forward, grabbing the latch and closing it slowly, as you stumble back.\n\n\n The monster bursts towards Meredith who still lies in her bed, impaling her fragile body on one of its claws. It raises her up from her bed, growling in her face, before tossing her aside. Finally, it turns to you, it's horrible, mangled mouth seeming to turn into a grin.\n\n\nIt steps forward slowly. You know there's no use running. You stare at the monster as it brings its claws just next to your face, still grinning with satisfaction. It motions as if to slash open your throat, but stops suddenly. It motions to do so again, but pauses once more, this time hissing in pain. It stops, before howling up towards the sky. Then, it brings its face up to yours.\n\n\n\"Leave this place,\" it snarls. \n\n\nIts breath reaches your nostrils, warm and toxic. You feel your head going black, before collapsing onto the ground. ", "action_results": [null]}]}]}]}, {"action": "Approach her about the idea of marriage", "result": "\"Do you ever plan to marry, Rose?\"\n\n\n\"Marry?\" she asks, curiously. \"What's that?\"\n\n\n\"You know, when a boy and a girl become one. Like my parents, or like your parents.\"\n\n\nRose stares at her hands for a second, her face darkening.\n\n\n\"No. I don't want to be like my parents. Definitely not,\" she says.\n\n\n\"No, not like... a marriage is like when a man and a woman become a pair under God and have kids and stay together.\"\n\n\n\"What does having kids have to do with staying together?\" she asks. \"And I definitely don't want to do anything under... well, you know.\"\n\n\n\"If you have kids you stay together,\" you say. \"That's what happens.\"\n\n\n\"My parents never stayed together, and they had me,\" she says.\n\n\nPerhaps she might not make the best wife. The concept of marriage seems lost on her. The concept of romance might not be, however.", "action_results": [null, {"action": "Decide it's your place to marry a more proper girl", "result": "\"I'm going to need to leave soon,\" you say. \"My father wants me to find a wife and get my own home soon. Somewhere that's not near here.\"\n\n\n\"What?\" Rose says, frowning. \"Why? Why can't we just do things like we always do. I like it that way.\"\n\n\nYou look down, shrugging.\n\n\n\"That's the way things are, Rose.\"\n\n\n\"Oh,\" she simply replies. \n\n\nYou both stare sadly at the water in silence, each knowing you're on two divergent paths.", "action_results": [{"action": "Continue", "result": "Union under God\n\n\nYou spend a few more weeks with Rose in the woods, but eventually father finds you a wife. A young girl around your age by the name of Mercy-Joy, who ends up lacking in either aspect of her namesake. There's no playing or courting with her. You're married off and with your father's savings you're given enough to buy a small cottage.\n\n\nYou hunt. You chop wood. You eat. You shit. You fuck. You live the same passionless existence as you have with your mother. Eventually, you'll have children. Perhaps that'll stir up some passion in you. Perhaps not. You'll see eventually, in the future. But for now, you go through the same motions a thousand generations have.", "action_results": []}]}]}, null]}]}, {"action": "Decline to spend time with Rose", "result": "\"Ah, what a shame. You're spending too much time in those woods, son. Does it not get lonely out there?\"\n\n\nYou shake your head, and father sighs.\n\n\n\"If that's what you want. I'll be seeing if there's any fathers with girls your age in the town, you know. You're getting old, and I'm sure with your strong features, ability to provide for a family and your humility to God, you'll have no trouble finding a wife. Ah, I'm talking too much. Go, grab some soup and head out.\"\n\n\nYou begin walking away and head to mother, who stirs the soup slowly. \n\n\n\"Do you want some, Jacob?\" she asks, not looking up. \n\n\n\"Yes, please,\" you say, as she dumps some of the soup into a wooden bowl and hands it to you.\n\n\nYou say your thanks to her before praying to say the same to the Lord, and then quickly devour the soup. It's fairly delicious and both easily warms and fills you up easily. Now, you're ready to head out.", "action_results": [null]}]}]}]}, {"action": "Hide in the burnt out cottage", "result": "You quickly make your way to the burnt out cottage. As you reach the clearing and see the blackened thatch and ash and the burnt stone, you feel nervous. Still, with your crucifix clutched tightly in your hands, you move forward into the burnt out cottage. You step through the doorway, crouching down into the ash. You pause, as you notice several black, burnt bones sit in the ash. You frown and wince, realizing that Rose’s mother does, as a matter of fact, still live in this house… or at least, she stays here. You don’t want Rose to have to come here and relive whatever awful memories he has. You wonder whether this is a good spot to hide.", "action_results": [{"action": "Stay here", "result": "You wait there in the burnt out cottage for at least an hour, far longer than it ever took Rose to find you before. Eventually, you see her cautiously approaching towards the house, sniffing the air.\n\n\n\"Jacob? You're not in the house, are you? If you are, come out, please, she says nervously.\n\n\nYou step up, peering out at her from behind the stone wall. She frowns, looking annoyed.\n\n\n\"Jacob! I told you to stay away from here!\" she says, sprinting towards you and grabbing you by the wrist. \n\n\nShe begins dragging you along the path home.\n\n\n\"What? I needed somewhere to hide,\" you say. \n\n\n\"Not there!\" Rose complains, fiddling with her wooden ring. \"It's going to take forever to get your scent out of the ash so she doesn't know you were there!\"\n\n\n\"She's...\" you begin to say, before deciding to hold your tongue.\n\n\n\"What?\" Rose asks, raising an eyebrow.\n\n\n\"Nothing,\" you say. \"I'm sorry. I won't go near there again.\"\n\n\n\"It's OK,\" Rose says. \"Come on, it's been a while. You need to get home.\"\n\n\nYou nod, and walk home alongside her.", "action_results": [null]}, {"action": "Leave and head to the den", "result": "You stand up from the ash, and quickly make your way to the den, finding it in the exact spot you remembered, just squirreled away under the twisted roots of an ancient Oak. You drop to your knees, lifting yourself down into it and scrunching up. You wait patiently, closing your eyes.", "action_results": [null]}, {"action": "Leave and head to the cave", "result": "You stand up from the ash, and quickly head up to the cave, running as fast as you can. You run as fast as your legs can carry you, eventually reaching the incline leading up to it. Which you quickly clamber up. You climb up the rocks and reach the mouth of the cave, turning only briefly to stare at the forest around you. You feel a certain cold chill run through you as you stare at into the darkness inside, wondering if you should enter.", "action_results": [{"action": "Leave and head to the den", "result": "You quickly head down the mountain, skidding down the mud and rocks, but by the time you actually reach the bottom and walk any reasonable distance, Rose races up to you with a gleeful “Found you!”.\n\n\n“Ah, rats!” you say.\n\n\n“You didn't even hide!\" she smiles.\n\n\n\"I didn't have time to!\" you say, before looking up at the sun as it falls through the sky. “It’s late. I need to get home soon.”\n\n\n“Oh come on! I didn’t even get to hide yet!” Rose complains, pouting in an exaggerated fashion.\n\n\n“Neither did I,\" you smile. \"Don't worry. You can hide first time,” you say.\n\n\n“Fine,” Rose says. “Come on, let’s get you home.” ", "action_results": [null]}, null, {"action": "Venture into the cave", "result": "You walk further into the cave, as the shadows and darkness consume you. You step forward nervously. After a minute of stumbling forward, you reach the end of the cave, pausing. In the middle of the cave, dozens of scratches cover the inside of the wall, alongside dried in blood. You pause, staring at it. In the middle, a deer skull sits in place You stare at it, feeling unnerved. You half expect to start hearing horrible screaming or demons to clamber out from the walls, but nothing happens. Still, the area fills you with dread, and you wonder if you should leave.", "action_results": [{"action": "Stay", "result": "You stay in the cave, holding your crucifix tightly. You feel chills run through your body and feel an awful presence watching over you, but you just hold the cross tighter and wait. Nothing happens, though. You wait patiently, but it seems Rose just doesn't seem to arrive. It's after at least two hours where you realize she's never going to find you in here, and you stand, walking out of the cave and reaching the mouth. You head down the mountain, skidding down the mud and rocks, you scoot down to the bottom. You begin walking, but it's only a few minutes before Rose races up to you.\n\n\n\"Damn! You had a good hiding spot. I couldn't find you at all. Where were you?\" she asks.", "action_results": [{"action": "Tell her the truth", "result": "\"I was in your father's cave,\" you say.\n\n\nRose stops, turning pale. She looks you dead in the eye, her unnaturally blue eyes staring into your eyes and chilling you to the bone. She looks up and down you, a mixture of nervousness, terror and anger on her eyes that manifest into a confusing look, as she begins nervously fiddling with her ring.\n\n\n“I told you not to go there! I told you!\" she says angrily.\n\n\n\"I'm sorry,\" you say.\n\n\nRose puts her index and middle finger against your temple, looking worried, as her wooden ring rubes against your temple.\n\n\n\"It's OK,\" she says. \"I forgive you. Just, promise me you won't go near there again.\"\n\n\n\"I promise.\"\n\n\n\"Thanks. Do you feel OK?\" she asks.\n\n\n\"Yeah, I feel fine.\"\n\n\n\"Are you sure? No flu or coldness or anything?\"\n\n\n\"No, I feel fine now,\" you say.\n\n\n\"OK,\" Rose nods, before wrapping her arms around you and hugging you. \"I'm glad you're safe. Come on, let’s get you home.”\n\n\nYou nod, and begin walking alongside Rose home.", "action_results": [null]}, {"action": "Lie", "result": "\"I was hidden under a tree, in a fox den.\"\n\n\n\"Damn! I thought I would've sniffed your scent,\" she says, sniffing the air. \"You smell the same as always. I don't know. Maybe I have a cold.\"\n\n\nYou feel a bit of guilt for lying, and decide to pray for redemption tonight, but Rose doesn't seem to catch on.\n\n\n\"Well, it's late. Come on, let's get you home!\" Rose smiles.", "action_results": [null]}]}, {"action": "Leave and head to the den", "result": "You quickly turn, and leave the cave. You don't want to deal with whatever horrors remain here. You reach the mouth of the cave and head down the mountain, skidding down the mud and rocks, but by the time you actually reach the bottom and walk any reasonable distance, Rose races up to you with a gleeful “Found you!”.\n\n\n“Ah, rats!” you say.\n\n\n“You didn't even hide!\" she smiles.\n\n\n\"I didn't have time to!\" you say, before looking up at the sun as it falls through the sky. “It’s late. I need to get home soon.”\n\n\n“Oh come on! I didn’t even get to hide yet!” Rose complains, pouting in an exaggerated fashion.\n\n\n“Neither did I,\" you smile. \"Don't worry. You can hide first time,” you say.\n\n\n“Fine,” Rose says. “Come on, let’s get you home.” ", "action_results": [null]}, null]}]}]}, {"action": "Hide in the cave", "result": "You quickly head up to the cave, running as fast as you can. You run as fast as your legs can carry you, eventually reaching the incline leading up to it. Which you quickly clamber up. You climb up the rocks and reach the mouth of the cave, turning only briefly to stare at the forest around you. You feel a certain cold chill run through you as you stare at into the darkness inside, wondering if you should enter.", "action_results": [null, null, null]}]}]}, {"action": "Ask for clarifications on the rules, then tag her when she comes over", "result": "\"Wait, if I tag you, then there's two tags. Then we can't play anymore.\"\n\n\nRose pauses, sighing, as she begins walking back to you. \n\n\n\"Look, if the person tagged is...\" she begins to say, before you quickly tap her back and run off into the woods.\n\n\n\"Oh, you cheater!\" she laughs, turning and running after you. \"I'll get you.\"\n\n\nYou spend at least an hour playing but eventually, Rose leads you home. You talk for a bit more, but you arrive back at your cottage.\n\n\n\"Well, goodnight,\" she says.\n\n\n\"Goodnight, Rose,\" you reply.\n\n\n\"Can we do this again sometime? It's nice to have someone to be around.\"\n\n\nShe's right. It is nice. Your short time with Rose has been fun and really helped with your loneliness. \n\n\n\"Yeah. I'd like that,\" you say.\n\n\n\"Great,\" Rose smiles. \"See you soon.\"\n\n\n\"See you soon,\" you say, as you walk back to the cottage to get to bed.", "action_results": [null]}, {"action": "Stop playing tag", "result": "\"This game is stupid. I'm not playing!\" you shout, as Rose stops, sighing.\n\n\n\"I thought other kids liked games,\" she complains. \"Come on then, I'll show you the way home.\"\n\n\nWith that, Rose leads you home. You talk for a bit more, but you arrive back at your cottage.\n\n\n\"Well, goodnight,\" she says.\n\n\n\"Goodnight, Rose,\" you reply.\n\n\n\"Can we do this again sometime? It's nice to have someone to be around.\"\n\n\nShe's right. It is nice. Your short time with Rose has been fun and really helped with your loneliness. \n\n\n\"Yeah. I'd like that,\" you say.\n\n\n\"Great,\" Rose smiles. \"See you soon.\"\n\n\n\"See you soon,\" you say, as you walk back to the cottage to get to bed.", "action_results": [null]}]}]}]}]}, {"action": "Refuse her offer", "result": "\"No,\" you say. \"I really should be finishing the traps.\"\n\n\n\"Oh, OK,\" Rose says.\n\n\n\"I'll see you around, though,\" you say.\n\n\n\"Yeah, I guess so,\" Rose says. \"I really should go. My mother will be looking for me.\"\n\n\n\"OK. Goodbye, Rose,\"\n\n\n\"Goodbye, Jacob,\" Rose says, before sprinting off into the woods.\n\n\nYou watch her leave, before turning to set up the rest of the traps. ", "action_results": [{"action": "Continue", "result": "Labor and Duty\n\n\nYou never do see Rose again. You venture out looking for her a few more times, but you never do. She must've not liked you very much. A pity. You could've used a friend.\n\n\nAs you grow taller, stronger and smarter, father assures you that soon, it'll be time for you to finally leave and get your own home, your own wife, and your own family. \n\n\nYou suppose he's write. It's your duty to God and nation to build a strong family like that which raised you. That's what expected of you, and that's what you'll do.", "action_results": []}]}]}, null]}, {"action": "Offer her an apple", "result": "You reach up, plucking a juicy red apple from one of the trees, holding it out to her.\n\n\n\"Here, have this,\" you say.\n\n\n\"No thanks,\" she says. \"They taste rotten.\"\n\n\nYou bite into the apple, and find it tastes delicious. None the less, you decide to ignore it.\n\n\n\"I like your ring,\" you say, not knowing what else to say.\n\n\n\"Thanks,\" the girl replies. \"I made it myself.\"\n\n\n\"Do you mind if I ask a question?\" you ask, as Rose smiles.\n\n\n\"That's a question,\" she laughs.\n\n\n\"I mean, like another question,\" you say.\n\n\n\"Sure.\"\n\n\n\"Why aren't you wearing clothes?\"\n\n\nThe girl looks down at her naked body, seemingly only noticing it for the first time.\n\n\n\"Oh,\" she says, blushing. \"Um... I don't know. I don't have any clothes.\"", "action_results": [null, null]}, {"action": "Let her eat her raw meat", "result": "You watch as Rose continues eating her hare flesh. \n\n\n\"I like your ring,\" you say, not knowing what else to say.\n\n\n\"Thanks,\" the girl replies. \"I made it myself.\"\n\n\n\"Do you mind if I ask a question?\" you ask, as the girl smiles.\n\n\n\"That's a question,\" she says.\n\n\n\"I mean, like another question,\" you say.\n\n\n\"Sure.\"\n\n\n\"Why aren't you wearing clothes?\"\n\n\nThe girl looks down at her naked body, seemingly only noticing it for the first time.\n\n\n\"Oh,\" she says, blushing. \"Um... I don't know. I don't have any clothes.\"", "action_results": [null]}]}, {"action": "Shoot at it", "result": "You fire at the figure, missing due to its weight making you unable to aim accurately. Without a noise you see the pale figure sprint away in an instant. You try to follow, but soon give up on that as you realize just how much faster than it you are.\n\n\nWith no more traps to set up, you return home.", "action_results": [null]}, {"action": "Quickly leave and return home", "result": "This must be the creature that made the horrible noise. You know if you get any closer, crucifix or not, it'll slaughter you. You turn, and quickly return home.", "action_results": [{"action": "Continue", "result": "Labor and Duty\n\n\nYou never do see the figure again. You venture out looking for it a few more times, with father alongside you, of course, but you never do. Maybe it just found a new hunting ground, or whatever this place was to it. No bother. As you grow taller, stronger and smarter, father assures you that soon, it'll be time for you to finally leave and get your own home, your own wife, and your own family. \n\n\nYou suppose he's write. It's your duty to God and nation to build a strong family like that which raised you. That's what expected of you, and that's what you'll do.", "action_results": []}]}]}]}]}, {"action": "Run to get your gun", "result": "You sprint to the house to grab your rifle. Father though, is faster, as he appears with his rifle in his hands.\n\n\n\"What was that?\" he barks out, his knuckles white from how tightly he's clutching the rifle.\n\n\nYou point up towards the trees, bathed in the pale moonlight. \n\n\n\"It came from there!\" you say.\n\n\nFather pauses, staring up nervously. He leans into the doorway, grabbing the crucifix that hangs there to watch over you as you eat. He hands you the crucifix, as you take it.\n\n\n\"I want that on you whenever you enter the woods, understood?\" he asks, as you nod. \"I'll have the crucifix for the house replaced in the morning. Just try and get some sleep, OK?\" \n\n\nYou nod, as you begin to trudge off to bed. Despite being exhausted, you know you won't sleep much.", "action_results": [null]}]}]}]}]}, {"action": "Head along the stream", "result": "You begin walking alongside the stream, staring down at the cool stream of water, your boots trudging into the soft mud as you stare along. You think you can make out fat fish in the stream, although it's hard to tell due to the rushing water. Perhaps father will teach you how to fish sometime.\n\n\nSuddenly, you hear something. You quickly turn, dropping to your knee to raise your rifle into a firing position to bag your prey as father always does. You don’t, clumsily tripping and hitting yourself in the face with the gun and falling into the cool mud of the stream. Still, you’re getting better at that maneuver. You push the gun off yourself as your rub your nose, before hopping up to a kneeling position. You stare at where the noise came from. Through the blurred visage of your watery eyes, you see in th distance a pale figure,, sprinting past the trees with unnatural speed. You heft your gun to your shoulder and aim, not knowing whether to fire or not. You don’t want to miss a chance to take out a… whatever creature that is, but you’re unsure whether that’s even a good idea.", "action_results": [null, null]}, {"action": "Climb a tree", "result": "You leave your rifle leaning against the tree and grab one of the lowest tree branches, lifting yourself off the ground up onto it. You grab another branch, hopping up as you quickly begin climbing up the the tree. Soon, you reach a point where you can see far and wide in the glade without having your view obscured by the leafy tree tops. You peer out at the various things, seeing a few deer bound past, the rushing stream and a few apple trees worth reporting to father. Other than that, there's...\n\n\nYou stop, as far in the distance you see a pale figure bounding through the trees with unnatural speed. You pause, wondering what an earth it is. You stare curiously at it, before it disappears from view. Fascinating. You lower yourself from the branch to see if you can spot it from a lower angle, but sadly its completely disappeared. No bother, you'll make an attempt to find out what kind of creature it was another day. Time to head home and report your findings.", "action_results": [null]}]}]}