{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=42380", "context": "", "first_story_block": "Your name is Daniel Dalton, you were born in 1870 and by 1890 you were a Lawman in the Old West. You arrested law breakers and helped keep the peace. You were a good man. You always knew you would be a good man because your five brothers were good men: Frank was a lawman in Arkansas, Grat was a lawman in Oklahoma and Bob was a lawman in Kansas. Another brother Bill was a lawyer in California, fighting for justice in the courts. You and your younger brother Emmett were Special Policemen in the Indian Territory. You were all good people.\n\n\nBut somehow everything went wrong.\n\n\nIt began when you were seventeen and your oldest brother Frank was killed in a gunfight with a gang of outlaws. It inspired you and your brothers to become Lawmen and you all served bravely, at one time Grat was shot in the arm by outlaws while during his service Bob killed two wanted men at different times. Despite this word began to spread that the Dalton Boys were no good, crooked lawmen horse stealing and making money on the side. Perhaps the fact that your cousins were the Youngers didn't help.\n\n\nBrothers Cole, Jim, John and Bob Younger had once rode with Jesse James and his legendary gang of outlaws. John had been killed and the others captured and put in prison after a gunfight. You and your brothers tried to have as little to do with them as possible but when you were nineteen Bob Younger died in prison of tuberculosis.You and your brothers traveled to Minnesota State Penitentiary to attend the funeral and on a cold autumn evening you and your cousins gathered in the prison cemetery.\n\n\nJim did not say a word to any of you but Cole, a tough veteran of fifteen bullet wounds, walked over after the service to say a few words to you and your brothers.When he learns that you are lawmen he reacts with horror. \"Our family have never been no Yankee lawmen,\" he tells you tersely. \"Law in the South is nothing more than what the rich Republicans in Washington say is the law. Don't be their bloodhounds and lapdogs boys, it is far better to be the fox!\"\n\n\nA few months after this meeting Bob and Emmett are fired from their jobs for illegally selling alcohol to Native Americans. Depressed they go traveling down to New Mexico where they get into a crooked card game with a gang of tinhorn gamblers: realizing they are being cheated they pull out their pistols and take their money back at gunpoint. For this they are posted up as wanted men: outlaws. Days later you and Grat are fired and arrested on charges of horse stealing, though the charges soon fall through for lack of evidence.\n\n\nFeeling victimized you and your brothers all head out to California to see your brother Bill. Bill is having problems of his own: he has been dismissed from the California State Legislature for opposing the large railway companies, who have been using armies of hired gunmen to bully farmers and ranches into selling their land to them cheaply so they can build their railroads. As you gather at Bill's house to celebrate New Year's Day 1891 the mood is dark.\n\n\n\"It's time for a change boys,\" Bob declares. \"We've been treated unfairly in honest work because some of our family were outlaws. We've been cheated and abused and when we've stood up for ourselves we've been labeled outlaws too. Cole is right: it's all the fault of the big businesses: the banks and the railroads who do everything they can to take the money of honest men and leave them with nothing but empty promises. The only way not to be part of this system is to live outside the law... all the way.\"\n\n\nGrat looks uncertain, with Frank dead he is now the oldest brother but he is more of a follower than a leader. \"That's a hell of a decision to make Bob,\" he says quietly. \"Grat look at us!\" Bob exclaims. \"You have shed blood and we've all lost a brother for the law and that same law says we our outlaws! Well I say it's time we started living up to our reputation.\"\n\n\nBill frowns thoughtfully, ambitious and determined he and Bob are natural rivals. \"If we do this there's no going back Bob. Think on that.\"\n\n\nBob nods, a young man and a crack shot with a rifle or a pistol he is the most outspoken of you all. \"Then we'll just have to be the best outlaws there ever was,\" he declares with a grin.\n\n\n\"I'm with you Bob,\" Emmett declares. He is the youngest and he has always idolized Bob and always tries to follow in his footsteps.\n\n\n\"Ok,\" you say quietly. At your hips you wear two matching Colt Pistols which once belonged to your brother Frank. Silent but resolute you have the gift of earning respect from others by your actions. \"We will be the Dalton Gang then and begin our new life from today.\"\n\n\nYour Outlaw story is about to begin.", "action_results": [{"action": "How to Play", "result": "IF YOU HAVE ALREADY PLAYED AMERICAN OUTLAWS: THE JAMES GANG YOU CAN SKIP THIS PAGE AND MOVE STRAIGHT ON TO THE DALTON GANG PAGE.\n\n\nIn this story your fate will be determined entirely by your choices. The number of Gunfights you take part in, the people you Injure and Kill, the number of Robberies you commit and your Score (your share of the amount of money you steal) will all be recorded. Your main aim is to survive, avoiding both prison and death in order to continue your Outlaw Career with a long-term goal of retiring. Be careful: one wrong decision, particularly in a gunfight where any moment could be your last, will signal a sudden and fatal end to your career.\n\n\nIf you Survive the Game without going to prison you receive a 100,000 Score Bonus.\n\n\nIf you Survive the Game but serve a lengthy prison term you receive a 50,000 Score Bonus.\n\n\nIf you are killed during the Game you receive no Score Bonus.\n\n\nYour main aim in the Game is to get the highest Score possible by taking part in successful robberies. You always receive a share of the loot based on how much you steal and the number of outlaws who committed the Robbery, for example if you are part of a ten-man team that rob a bank of $10,000 dollars for example your share will come to $1,000 and this will be added to your Score.\n\n\nGunfights, Injured, Killed and Robberies numbers are non-essential for the game but when your story ends, either through a sudden and violent death or through peaceful retirement you will be taken to The Performance Table page where you can compare your Gunfights, Injured, Killed, Robberies and Score to your fellow Outlaws as an indication of how you have performed. Leaving a comment after you complete this story will enable others to see your Score.\n\n\nGood Luck Reader, your Outlaw Story is about to begin!", "action_results": [{"action": "The Dalton Gang", "result": "On a cold winter's night you and your brothers ride out to the small community of Alila.\n\n\nIt is a cold winter in night in the Californian hills and you are all wearing dusters, long grey coats that go down to the ankles. Your loaded pistols hang at your belt. At the train station in Alila you sit on the platform in nervous silence, the only light being an orange glow from Bill's cigar. Finally in the distance a second light appears: a single beam of yellow light. Finally with a roar of steam the night train pulls up alongside you all.\n\n\n\"Good luck boys,\" Bob mutters as you all climb aboard.\n\n\nClimbing onto the train you wait until it begins to move then all of you make your way to the driver's compartment at the front of the train. Inside is a little grey-haired man in a blue engineers uniform who looks round in surprise as you enter the locomotive.\n\n\n\"I'm sorry gentlemen, you are not supposed to be up here,\" he says cordially.\n\n\n\"Well tonight we're breaking all the rules,\" Bob replies coldly and draws his pistol. \"Stop the train.\"\n\n\nThe engineer obediently pulls the lever to stop the train and just moments after leaving Alila the train is gliding to a halt. As the train slows the engineer suddenly throws open the door of the compartment and jumps off the train. \"Kill him,\" Bob barks. \"He'll raise the alarm!\" He immediately rushes towards the open door.", "action_results": [{"action": "Follow Bob and shoot at the fleeing man", "result": "There is a full moon tonight and the silver light grants you a clear view of the old man stumbling for his life across the sloping grass of the railway embankment. Raising your pistol you take careful aim and squeeze the trigger. A spray of red explodes from the man's head and he topples to the ground. He lies there motionless as the train continues a short way before finally gliding to a halt. You return to your stunned brothers inside the compartment.\n\n\nBob is the first to recover, mutters \"come on\" and leads you all down the train. Hiding your guns in your pockets you pass through the passenger cars, people looking at you curiously but perhaps sensing who you are no one interferes with you until you come to the corridor that leads to the express carriage. Bob has just started to open the door when a shot is fired, the bullet striking the thick wooden door. You all jump back immediately and Bob pulls the door shut again. There is a moment's silence then more shots are fired, the bullets striking the door in front of you.\n\n\n\"We'd better clear out of here,\" Bill mutters to the rest of you. \"That express guard is armed.\" Bob thinks for a moment and swears. \"We should have brought some dynamite,\" he mutters. \"It doesn't matter,\" Grat says quickly. \"The alarm is raised now boys, let's clear out.\"\n\n\nYou open a door and one by one you all jump off the train and run down the embankment. You have left five horses tethered in a copse of trees nearby and reach them after a swift five minutes run. Mounting up you ride off south. The robbery has been a complete failure: an engineer has been killed and you have been forced to flee without a single dollar. It is not an impressive debut.\n\n\nNews travels fast and by the time you make it back to San Francisco where Bill lives the news is in all the morning newspapers that an engineer was murdered on a South Pacific Train last night by a desperate gang of train robbers. You keep to Bill's house all day, each of you lost in your own thoughts about what to do now. The tension drags on until evening when after dinner Bob finally addresses the problem.\n\n\n\"I've been thinking and I reckon it'd be a lot safer if we all headed back to the Indian Territory,\" he says. \"We know it well and I don't reckon the law will find us there.\"\n\n\n\"I've got a law career here in California Bob,\" Bill says angrily. \"You forget, only you and Emmett are currently wanted for anything: Grat, Daniel and I aren't known to the law yet.\"\n\n\n\"How long do you think that will last with posses tracking us for the Alila Robbery?\" Bob demands.\n\n\nAn argument rages for the next few hours until it ends with Grat siding with Bill and both choosing to lie low in California while Bob and Emmett head back to the Indian Territory to hide out there until the heat dies down. What you'll do after a few months isn't discussed and you need to choose which pair of brothers to join.", "action_results": [{"action": "Go with Bob and Emmett to the Indian Territory", "result": "You, Bob and Emmett bid farewell to your other brothers and set off by train across Nevada, Utah and Colorado back to the Indian Territory. You are just in time: days later you read in the papers that Bill and Grat have both been arrested back in California and charged with train robbery. You are all concerned by the news but Bob points out there is nothing you can do about it until you have some money so he arranges a meeting with two of his old friends in the Indian Territory.\n\n\nAt the little community of Wharton you find two men waiting at the train station for you. The first is a middle-aged man with a distinctive black gunpowder burn on his left cheek while his companion is shorter, handsome man with an impressive moustache. \"Boys, let me introduce you to Black Face Charley Bryant and Bitter Creek George Newcomb,\" Bob declares. Greetings are exchanged all round as you leave the station.\n\n\n\"Black Face and Bitter Creek were with me and Emmett in that little caper down in New Mexico that got us all written up as Outlaws,\" Bob explains to you. \"I've been thinking boys that it was time to show this country what real outlaws are like. We've already held up one train in California and I plan to hit more here in the Territory where they haven't got any real law; just miles and miles of wilderness to hide in and train lines running through it like arteries for us to cut. What do you boys reckon?\"\n\n\n\"After we read in the papers you boys were behind that hold up in California we were kind of hoping you would turn up with that exact offer,\" Bitter Creek declares with a grin. Black Face just grunts.\n\n\nOn the first day of May the five of you board a train at Wharton. While Black Face and Bitter Creek go to capture the driver and stop the train you, Bob and Emmett head straight to the Express Carriage. Catching the Guard by surprise you disarm him at gunpoint and empty the safe. As the train slows to a halt you jump off and race to a nearby copse of trees where you have left horses waiting, joined by your companions. Once you have ridden a safe distance you count the money and find you have stolen some $1700, making your share $300. It's not much but it's a start.\n\n\n\"Well boys it's not millions but the Territory isn't a wealthy place,\" Bob says thoughtfully. \"I reckon it's best if we split up. Bitter Creek, did you say you had some friends over in Hutchinson, Kansas? I reckon that sounds like a safe spot for us.\" Black Face coughs. \"I reckon I'm sick boys,\" he tells the rest of you. \"Got this damn cough that won't go away so I reckon I'd best get into Hutchinson here in the Territory and see a doctor I trust. Drop me a line when you want me and I'll join you boys again.\" Bob nods and you ponder who to join.", "action_results": [{"action": "Go with Bob, Emmett and Bitter Creek to Kansas", "result": "You and your companions ride out to Hutchinson to stay with Bitter Creek's friend, a near-silent little man called Charley Pierce who looks like the kind of man who'd easily blend into a crowd. As it turns out you are not Charley's only visitors and three other men are staying with him: a cowboy called Bill Power, a morose young man called Dick Broadwell and a gregarious and cheerful tall man with an elegant moustache called Bill Doolin.\n\n\nYou hide out with your four new friends for four months after the Wharton Robbery until the bad news begins to arrive. First witnesses identify all of you who helped rob the Wharton train, this leads to Black Face being recognized in the Indian Territory and being killed after he killed a lawman while trying to resist arrest. This all probably contributes to Grat being found guilty of train robbery and being sentenced to twenty years imprisonment in California.\n\n\nYou are all disheartened by Black Face's death but Bob has four new recruits: Charley Pierce, Bill Power, Dick Broadwell and Bill Doolin all agree to join you, Bob, Emmett and Bitter Creek in the Gang giving you eight.Feeling numerous enough to deal with anything you all travel back into the Indian Territory and wearing long grey dusters you wait at the little community of Laelietta to board the train. When it arrives Bill Power and Dick go up to the front of the train to capture the driver, Bill Doolin, Charley and Bitter Creek guard the passengers and you and your brothers go to rob the Express Carriage.\n\n\nThe robbery goes like clockwork and everyone keeps calm; you and your brothers capture the Express Guard and use dynamite to blast open the safe. Taking all the money inside you and your fellow Outlaws flee the train on foot and escape with your money, counting it in safety you find you have stolen $2,500, making your share $300. This train robbery seems to signal a change of luck: first Grat escapes from custody by jumping from a moving train on his way to prison and then Bill is acquitted in court of robbery. You send telegrams to both your newly freed brothers to meet you and the rest of the Dalton Gang in the Indian Territory that winter.", "action_results": [{"action": "Reunion", "result": "Much has changed in a year.\n\n\nIn the snow-covered woods outside the small town of Ingalls you and the other nine members of what the newspapers are calling The Dalton Gang have made your camp. Around one campfire your brother Bob is congratulating Bill and Grat on their respective acquittal and escape while your fourth brother Emmett looks on. The five men who have been helping you and your brothers rob trains are sitting around another camp fire chatting.\n\n\nThe most experienced recruit is Bitter Creek, a handsome little man with a big moustache. He is sitting next to his silent best friend Charley Pierce and chatting to Bill Doolin, a tall gregarious cowboy with a ready laugh. Next to them are the last two members of the Gang, Bill Power and Dick Broadwell. All of you are well-armed and with the exception of your brother Bill you are all Wanted Outlaws with prices on your heads. You have gathered to celebrate Christmas and the New Year together and on New Years Day Bob gives a little speech.\n\n\n\"Boys, we've got great opportunities before us,\" he declares. \"In one year we have robbed three trains and put together this great Gang that is famous throughout America. This year we'll move onto bigger and better things: we'll rob more trains and then we'll move onto banks! We're going to be the biggest Outlaws to hit this country since Jesse James and his Gang! We'll make as much money as we like and out-ride and out-shoot the law!\"\n\n\n\"You'll have to do it without me Bob,\" your brother Bill announces. \"I'm going back to California to start over. I'm the only one in this Gang with a clean record and I aim to keep it that way. If you're smart Grat, Daniel and Emmett you'll come back with me too and hide out at my place. You take too many chances you'll end up shot up like that Black Face fellow I've read about in the papers or in prison for the rest of your lives.\"\n\n\nBill's announcement promptly leads to a massive argument between him and Bob while you and the rest of the Gang look on awkwardly. It ends with Bill deciding to go back to California to try to resurrect his law practice while Grat and Emmett choose to stay in the Indian Territory with Bob and the others and rob trains. When Bill sees his brothers are unwilling to join him he asks you if you'd prefer to go back to California with him or continue your outlaw life here.\n\n\n ", "action_results": [{"action": "Go to California with Bill", "result": "Saying goodbye to your brothers and the rest of the Gang you decide to go back to San Francisco with Bill. In California Bill struggles to rebuild his law firm but it is difficult for a man whose four brothers are wanted outlaws and who many believe is an outlaw himself. Bill struggles while you hide out in his home for ten months. In the papers you read about your brothers and their Gang robbing two more trains in the Indian Territory, the latter after a daring gunfight.\n\n\nThen comes the news of Coffeyville.\n\n\nBob, Grat and Emmett, together with Bill Power and Dick Broadwell, try to rob two banks at the same time in the city of Coffeyville. The alarm is raised and a massive gunfight breaks out that leaves eight men dead including Bob, Grat, Bill and Dick while Emmett survives despite 23 individual bullet wounds and is imprisoned for life. Your brothers Bob and Grat are dead, their gang destroyed and initially you and Bill are so full of pain you don't know what to do.\n\n\nYour minds are decided when a telegram arrives from the three surviving gang members who did not go on the Coffeyville Raid: Bitter Creek, Bill Doolin and Charley Pierce. They invite you and Bill to join them and a new Gang they are putting together in the Indian Territory. You and Bill are both in agreement.\n\n\n\"They've killed our brothers and now we're going to make America pay,\" Bill declares. \"Damn the law and damn the banks, I'm going to join these boys and bring hell to Kansas and the Territory. Are you with me Daniel?\"\n\n\n\"I am,\" you tell your brother quietly and the pair of you return to the Indian Territory.", "action_results": [{"action": "A New Gang", "result": "It's a somber group of six men that meet in the little town of Ingalls in the Indian Territory. You and your brother Bill are silent and serious when you meet Bill Doolin, bearded now, and his companions: the veteran outlaw Bitter Creek, his mute friend Charley Pierce and a new recruit called Ol Yantis. Despite the news from Coffeyville all of you are resolved to continue your outlaw careers with your brother Bill now declaring he wants to be an even more infamous outlaw than your late brother Bob.\n\n\n\"The newspapers say the Dalton Gang is destroyed and called us 'a wild bunch of fugitives,\" Bill Doolin says grimly. \"I suggest we show them what The Wild Bunch is capable of.\" A plan is quickly hatched to rob a bank in Kansas to show that despite Coffeyville robbing banks in the state still does not intimidate you. One winter's day your newly formed Wild Bunch ride into Kansas to show America the spirit of the Dalton Gang is still alive and well.\n\n\nRiding into the little town of Spearville you all dismount outside the bank and you, Bill and Bill walk inside while the others guard your horse. Taking the teller hostage you rapidly empty the vault of it's money, lock the teller inside, walk out of the bank, mount up and ride away. Making it back across the border into the Indian Territory you are delighted by the ease of the robbery which has netted you all $1500, making your share $200.\n\n\nThe papers are soon full of news of what they call \"The Doolin-Dalton Gang\" and the two Bill's are pleased. Ol is less so, he has been identified as an outlaw and wants to visit his sister's farm to say goodbye to his family while the rest of the Gang is planning on hiding out in Ingalls. You need to choose who to go with.", "action_results": [{"action": "Go with Ol to his sister's farm", "result": "You decide to go with Ol to his sister's farm near the little community of Orlando in the Territory. You both spend nearly a month relaxing there until one afternoon you see two men approaching the small farm from the front. \"Ol! Dan Dalton!\" one of the men shouts. \"We know you're in there. We're lawmen, we've got the building surrounded and if you come out with your arms raised no one will get hurt.\" You and Ol glance at each other nervously, the small farm only has one door facing the two lawmen with windows either side, though there are a few back windows.\n\n\n\"What are you going to do?\" you ask Ol who thinks for a moment. \"I'm going to go out and tell them I'm going to surrender and when they're not ready I'm going to draw my pistol and let them have it. If you come with me I reckon there's a good chance we can get both of them.\" You consider his request: it's risky but it could work. An alternative option is to open a back window, climb out and take a chance escaping on foot.", "action_results": [{"action": "Follow Ol out the front door", "result": "You and Ol walk outside towards the two waiting lawmen who tense. \"What is this about?\" you ask. \"What is happening? Don't shoot we are surrendering.\" Suddenly Ol goes for his gun and you follow shoot. Ol gets off a shot before the lawmen realize what is happening and return fire: both of you are hit in the chest and after firing a shot harmlessly into the ground you fall face first to the ground, Ol toppling across your legs a moment later. You die within minutes while Ol expires of his wounds the next day, two more dead outlaws for dusty graves.", "action_results": []}, {"action": "Try slipping out a back window", "result": "You and Ol agree to try your different plans and while Ol walks out the front door you open a back window and climb out. Cautiously you jog towards some nearby trees, expecting a bullet to be fired at you at any moment. You nearly jump out of your skin when a gunshot rings out but when it is almost instantly followed by several more you realize the shots are coming from the front of the house. Escaping the area you rejoin your companions in Ingalls where you learn your worst fears are correct: Ol Yantis was shot dead by the lawmen he tried to fight. You hide out in Ingalls until the following summer when The Wild Bunch rides again.\n\n\nIn the last six months you and your fellow outlaws have recruited four new gang members, bringing your gang strength up to nine. There is Dynamite Dick, an explosives expert with an impressive nickname, Red Buck, a grim and dour man, Tulsa Jack, a good friend of Bill Doolin's and Arkansas Tom, a sharp-shooting well-dressed young man. Together the nine of you plan your first robbery in Kansas and in the summer of 1893 you strike.\n\n\nOne summer morning the nine of you board a train at Cimarron in Kansas and while the new recruits get the driver to stop the train and Bitter Creek and Charley Pierce guard the passengers you and the two Bill's make your way to the Express Carriage. You calmly empty the safe before you all dismount, run to your horses, mount up and ride away. On the ride you count the money you have stolen and find you have gotten away with $1,000, making your share $100.\n\n\nUnfortunately you do not get clean away, that afternoon as you are resting a posse of lawmen suddenly gallop over a nearby ridge. All of your mount up and firing pistols and rifles at each other you and your pursuers engage in a running battle for over a mile. There are no casualties on either side except Bill Doolin who is unlucky enough to be shot in the foot by a rifle shell, a painful but non-serious wound. Easily escaping the nine of you ride back to Ingalls unaware that an even deadlier enemy is in pursuit...", "action_results": [{"action": "The Battle of Ingalls", "result": "One autumn morning you and The Wild Bunch ride into Ingalls. Bill Doolin leads the way, hobbling ad wincing from his injured foot, while you and your brother Bill follow behind talking. Following you is Bitter Creek and his mute companion Charley Pierce while the newer recruits bunch together, Tulsa Jack is exchanging jokes with Dynamite Dick while Red Buck rides on in silence and Arkansas Tom cradles his rifle. You are as dangerous an outlaw gang as any that roamed the West.\n\nIn town you agree to split up: Arkansas Tom is tired and is going over to the little community's hotel to sleep. Bitter Creek offers to saddle all the horses in the stable while the rest of the gang head into a saloon operated by your friend Murray. You need to choose who to follow.", "action_results": [{"action": "Follow Arkansas Tom to the hotel to rest", "result": "You and Arkansas Tom split off from the others and walk into the hotel, check in and walk up the stairs chatting. You have just reached your room when you hear the unmistakable sound of pistol shots from the street, racing to the window you see Bitter Creek galloping his horse down the street away from a man who is shooting at him, blood streaming from your friend's leg. You race to Arkansas Tom's room to find him standing by the window firing his rifle into the street at lawmen who are firing from cover at the saloon where your friends are.\n\n\"Come on, we need to get out of here,\" you shout to Tom.\n\n\"This is a great position,\" Tom yells back. \"I'm going to stay here and cover the others.\"", "action_results": [{"action": "Join Arkansas Tom at the window shooting at the lawmen", "result": "You join Arkansas Tom at the window, grab one of his rifle's and peer down for a target. You spot one: a young lawman sheltering behind a tree with his side exposed to you. You take careful aim and fire, your bullet hitting the man in the left side, passing through his body and blasting out his right. The man falls down and doesn't get up again.\n\nSuddenly your brother Bill, Bill Doolin, Charley, Red Buck, Tulsa Jack and Dynamite Dick all burst from the town's stables mounted on horses. The lawmen, who are still firing at the saloon, scramble around to fire at them, hitting your brother Bill's horse in the head. Bill jumps from the saddle, turns, shoots a lawman dead and scrambles onto the back of Bill Doolin's horse. You watch as your friends escape.\n\nThe lawmen now turn their attention to you and begin firing up at the window, forcing you and Arkansas Tom away from it. You hear running feet on the stairs outside the hotel door and then bullets begin to hit the door, forcing you to take shelter under the bed. You are both trapped and have no way of escaping.\n\n\"We surrender,\" Arkansas Tom shouts loudly.\n\nThe shooting stops, there is a pause, and then suddenly the hotel door spectacularly explodes inwards in a blinding flash of light that brings down the roof, burying you both helplessly beneath the rubble, your guns lost in the chaos. Several armed lawmen race through the ruins their dynamite created and quickly capture you both.\n\nIt is some consolation to you that your companions all succeeded in escaping, though both Bitter Creek and Dynamite Dick were wounded in all the gunfire. You and Arkansas Tom are not so lucky, you are both quickly tried and convicted for the deaths of three lawman and one civilian who were killed in the gunfight and both of you are sentenced to terms of life imprisonment.\n\nIt seems that your outlaw careers are over but then, after a few years, fate reunites you with your companions.", "action_results": [{"action": "Prison", "result": "By the summer of 1896 the Wild Bunch is virtually destroyed: the only gang member who remains at large is Little Dick West; everyone else is dead or imprisoned. Your brothers Bob, Grat and Bill are dead, your friends Bitter Creek and Charley Pierce are dead. You yourself are facing a long jail term with no hope in sight.\n\nThen the Federal authorities make the decision to move you and the surviving members of the Wild Bunch to new a prison in Oklahoma City and you find yourself reunited with the last members of the Wild Bunch. Your brother Emmett is there, weak after surviving 23 gunshot wounds, Lawman killer Arkansas Tom Jones, minor gang member Jim Knight, Little Bill Raidler, who was shot 3 times and severely wounded in his capture, the clever Dynamite Dick and, most of all, your unofficial leader Bill Doolin are all reunited.\n\nInevitably plans for an escape are quickly made, though Emmett and Little Bill have no interest due to the severity of their wounds while Arkansas Tom and Jim Knight want to turn their backs on the outlaw life, certain it will get them killed. Bill and Dynamite Dick concoct a plan to have a friend smuggle pistols into them, take the guard hostage, make him unlock the cell and then imprison him in it and then make their escape from the prison. It is a bold but risky plan and the two outlaws ask you to join them. Your brother Emmett is against it, warning you that even if it is successful the chances are you will be hunted down and killed on the outside.", "action_results": [{"action": "Join the prison break", "result": "You agree to join the jailbreak and Bill makes all the arrangements. He has a pistol smuggled into him and at the right moment he trains it on a guard, forces him to surrender his keys and gun, which he gives to you, unlocks the cell and locks the guard inside. After taking a series of guards hostage you and your companions succeed in escaping from the prison on stolen horses.\n\nYou and your companions are elated but you quickly agree it is best if you all split up: Bill plans to hide out with his wife in Lawson while Dynamite Dick intends to lie low in Checotah. You need to join one of them.", "action_results": [{"action": "Go with Bill to Lawson", "result": "You and Bill hide out with Bill's wife in various hideouts around the settlement of Lawson but the law is never far behind you. One night the two of you are riding your horses from one hideout to another when suddenly a posse of a dozen lawmen spring up from the ground before you and shout for you both to surrender.", "action_results": [{"action": "Turn your horse around and ride for dear life", "result": "You jerk your horse away and have barely started to ride when the posse open fire. Bullets hit both your horse's rear legs making it collapse to the ground and spilling you from the saddle. By good luck you land next to a deep drainage ditch and scrambling into it you race down it while the posse pumps bullet after bullet into your friend Bill.\n\nSomehow you escape. The ditch runs out near a line of trees and springing out of it you race into the trees and through them, bullets from the posse hitting the trees and whistling by all around you. You keep running and running and evade capture. For the next year you roam the wilds, living like an animal in the most basic of habitats before finally your remaining outlaw friends get a letter to you inviting you to a meeting in Woodward.", "action_results": [{"action": "The last outlaws", "result": "On the first day of August you, Dynamite Dick Clifton and Little Dick West assemble in Woodward. You are all that remains of the once-great Wild Bunch and your years on the run and suffering have aged you all prematurely. Little Dick brings with him four of his friends: two pairs of brothers called John and Al Jennings and Pat and Morris O'Malley. John is a serious guy who says little, his younger brother Al is chatty while the O'Malley brothers strike you as a pair of idiots.\n\n\"I'm tired of us hiding out and hunted for having stolen nothing more than a few dollars,\" Little Dick announces. \"Me and my new friends here are going to form a new gang, the Jennings Gang, and go back to robbing trains. If we are going to go down like our companions we might as well go down fighting... and get rich in the meantime.\"\n\nDynamite Dick shakes his head wearily. \"I figure I'm going to keep lying low,\" he announces. \"I don't want to die young.\"\n\nIt seems you have two choices: to resume an active outlaw career or continue your life in hiding.", "action_results": [{"action": "Join the Jennings Gang", "result": "You team up with Little Dick, Al and John Jennings and Pat and Morris O'Malley and begin robbing trains but it is a disaster. Your first attempt to stop a train at Edmond fails when the train ploughs straight through the barrier of logs you have put on the track to stop it, you are forced to flee without a dollar when the alarm is raised.\n\nOpting to board the train for your next robbery at Berwyn you and Little Dick enter the Express Carriage after the others have seized control of the train but none of the Express Managers have the key for the safe and your dynamite fails to blow it open. Determined not to repeat this mistake at your third train robbery at Pocasset you use so much dynamite that you destroy not only the safe but the entire Express Carriage.\n\nThese failures are humiliating and when news arrives that Dynamite Dick has been tracked down and killed at Checotah Little Dick decides that enough is enough. He announces he will split off from the others and go into hiding at Guthrie while the rest of the gang elects to hide out at Cushing and try to plan a successful train robbery.", "action_results": [{"action": "Go with Little Dick to Guthrie", "result": "You elect to stick with Little Dick and accompany him to Guthrie where you find a cabin to live in. You are not surprised to read that Al, John, Pat and Morris were all captured by lawmen, once more you and Little Dick are on your own. You remain hidden over the winter but as the spring dawns you go outside one morning to find two lawmen waiting for you.\n\n\"It's the end of the line boys,\" one announces. \"Surrender and no one will get hurt.\"\n\nYou and Little Dick glance at each other.", "action_results": [{"action": "Surrender", "result": "You raise your hands while Little Dick goes for his guns. The two lawmen have no intention of taking either of you in alive and open fire with their pistols. Both of you are shot in the chest and fall dying to the ground. As you stare up at the blue sky, which slowly darkens, you give a deep sigh and smile. It is all over. The last of the Wild Bunch is gone.\n\nYour Outlaw Career is over.", "action_results": [{"action": "Click here to see how well you did compared to your companions", "result": "This is the Performance Table where you can compare your Gunfights, Injured, Killed, Robberies, Score and Fate with those of your fellow members of The Wild Bunch to see who is the greatest Outlaw!\n\n\n1: Bill Doolin: Gunfights: 6, Injured: 1, Killed: 2, Robberies: 7, Score: 6500 - Killed.\n\n\n2: Bill Dalton: Gunfights: 6, Injured: 0, Killed: 1, Robberies: 6, Score: 4400 - Killed.\n\n\n3: Bitter Creek: Gunfights: 6, Injured: 1, Killed: 0, Robberies: 7, Score: 3500 - Killed.\n\n\n4: Charley Piece: Gunfights: 7, Injured: 0, Killed: 0, Robberies: 7, Score: 3400 - Killed.\n\n\n5: Bob Dalton: Gunfights: 3, Injured: 2, Killed: 4, Robberies: 6, Score: 3000 - Killed.*\n\n\n6: Emmett Dalton: Gunfights: 3, Injured: 0, Killed: 0, Robberies: 6, Score: 3000 - Imprisoned.\n\n\n7: Dick Broadwell: Gunfights: 2, Injured: 0, Killed: 0, Robberies: 3, Score: 2500 - Killed.\n\n\n8: Bill Power: Gunfights: 2, Injured: 0, Killed: 0, Robberies: 3, Score: 2500 - Killed.\n\n\n9: Grat Dalton: Gunfights: 3, Injured: 0, Killed: 1, Robberies: 4, Score: 2100 - Killed.*\n\n\n10: George Bennett: Gunfights: 1, Injured: 3, Killed: 1, Robberies: 1, Score: 1000 - Killed.\n\n\n11: Asa Knight: Gunfights: 2, Injured: 0, Killed: 0, Robberies: 1, Score: 1000 - Killed.\n\n\n12: Jim Knight: Gunfights: 2, Injured: 0, Killed: 0, Robberies: 1, Score: 1000 - Imprisoned.\n\n\n13: Jim Wallace: Gunfights: 2, Injured: 0, Killed: 0, Robberies: 1, Score: 1000 - Killed.\n\n14: Dynamite Dick: Gunfights: 5, Injured: 0, Killed: 0, Robberies: 3, Score: 700 - Killed.\n\n\n15: Red Buck: Gunfights: 5, Injured: 0, Killed: 0, Robberies: 3, Score: 700 - Killed.\n\n\n16: Tulsa Jack: Gunfights: 4, Injured: 0, Killed: 0, Robberies: 3, Score: 700 - Killed.\n\n\n17: Little Dick: Gunfights: 3, Injured: 3, Killed: 1, Robberies: 5, Score: 600 - Killed.\n\n\n18: Little Bill: Gunfights: 3, Injured: 0, Killed: 0, Robberies: 2, Score: 600 - Imprisoned.\n\n\n19: Black Face: Gunfights: 1, Injured: 0, Killed: 1, Robberies: 2, Score: 500 - Killed.\n\n\n20: Ol Yantis: Gunfights: 1, Injured: 0, Killed: 0, Robberies: 1, Score: 300 - Killed.\n\n\n21: Arkansas Tom: Gunfights: 3, Injured: 0, Killed: 1, Robberies: 1, Score: 100 - Killed.\n\n\n22: John Jennings: Gunfights: 2, Injured: 0, Killed: 0, Robberies: 3, Score: 0 - Imprisoned.\n\n\n23: Al Jennings: Gunfights: 1, Injured: 0, Killed: 0, Robberies: 3, Score: 0 - Imprisoned.\n\n\n24: Pat O'Malley: Gunfights: 1, Injured: 0, Killed: 0, Robberies: 3, Score: 0 - Imprisoned.\n\n\n25: Morris O'Malley: Gunfights: 1, Injured: 0, Killed: 0, Robberies: 3, Score: 0 - Imprisoned.\n\n\n* Bob Dalton also killed two men in two gunfights and Grat Dalton was in two gunfights, during one of which he was shot in the arm, but as these gunfights occurred when they were serving as lawmen in 1889 and 1890 they are not counted here.\n\n\nMost Prolific Gunfighter: 1: Charley Pierce (7 Gunfights), 2: Bill Doolin / Bill Dalton / Bitter Creek (6 Gunfights).\n\n\nMost Lethal Hurter: 1: George Bennett (3 Injured), 2: Bob Dalton (2 Injured), 3: Bitter Creek (1 Injured)\n\n\nMost Deadly Killer: 1: Bob Dalton (4 Killed), 2: Bill Doolin (2 Killed), 3: Bill Dalton / Grat Dalton / George Bennett / Black Face / Arkansas Tom (1 Killed).\n\n\nMost Enthusiastic Robber: 1: Bill Doolin / Bitter Creek / Charley Pierce (7 Robberies).\n\n\nMost Successful Bandit: 1: Bill Doolin ($6,500), 2: Bill Dalton ($4,400), 3: Bitter Creek ($3,500).\n\n\nOverall Best Outlaw: 1: Bill Doolin, 2: Bill Dalton 3: Bitter Creek, 4: Charley Pierce, 5: Bob Dalton.\n\n\n--------------------------------------------------------------------------------------------------------------------------------------------------------\n\n\nAs always thank you for taking the time to read my story, please rate it and if you would like others to see your Score please leave a comment. Have a good day!", "action_results": []}]}, {"action": "Run", "result": "You turn to your left and sprint for your life. The lawmen shoot Little Dick dead and then turn, take aim and fire at your back. An almost incredible things happens: both the lawmen's guns jam on a faulty cartridge - it's rare for it to happen to one gun but to both means someone is finally on your side. By the time the cursing lawmen have cleared their blocked guns you have vanished into the wilderness: the last of the Wild Bunch.", "action_results": [{"action": "Last Man Standing", "result": "After Little Dick West's death lawmen search Indian Territory from one end to the other looking for you but you keep relentlessly on the move, never sleeping in the same place two nights in a row and practically living in the saddle. For nearly two years you evade capture, thinking constantly that it is incredible that the small amount that you stole can be worth such pursuit.\n\nFinally the Territory Legislature have had enough and make a remarkable offer: if you will surrender yourself then all charges against you will be dropped. As long as you promise to live a peaceful life then you will not be harmed. It is the best offer you are going to get and on the last day of 1899 you meet the Governor in Oklahoma City and surrender.\n\nIt is over and you have beaten them.\n\nFOR ELUDING THE FORCES OF JUSTICE SUCCESSFULLY YOU HAVE EARNED A BONUS SCORE OF 10,000.", "action_results": [{"action": "A peaceful life...?", "result": "You live peacefully and over time the world changes: the Indian Territory has been transformed into a state called Oklahoma. Your brother Emmett is released in 1906 and moves to California and become an estate agent, Al Jennings, released in 1902, becomes a politician and only Arkansas Tom Jones, released in 1910, has trouble settling down. He invites you to meet him in Neosho. Arkansas Tom, a lean and pale outlaw the same age as you, has a proposition.\n\n\"I miss the outlaw life and begin rich,\" he tells you. \"I got sent to prison for seventeen years for a train robbery that netted me $100 and for killing a Deputy Marshal. I want to earn something for the years I've served. I want to rob the town bank. Will you help me do this? For old time's sake? Bill Doolin and all the boys would be proud of us.\"\n\nYou consider his suggestion, it would mean a return to your life of crime after some twenty years but is it worth it?", "action_results": [{"action": "Join Arkansas Tom in the robbery", "result": "Feeling the familiar thrill of excitement you and Arkansas Tom drive up to the bank in Asbury, walk in and draw your pistols.\n\n\"This is a hold-up!\" you declare.\n\nThere is the click of guns cocking and turning you see two bank guards, who you had not even noticed, covering you from the corners of the bank. You can do nothing but surrender your weapons. Considering the circumstances you and Arkansas Tom are lucky to get off with sentences of four year imprisonment. After your release Tom arranges another meeting.\n\n\"We were unlucky the last time but we'll do better this time,\" he tells you. \"We'll hit the bank here in Asbury, Missouri and do it carefully and do it right. What do you say?\"", "action_results": [{"action": "Join the robbery", "result": "You and Arkansas Tom enter the bank in Asbury and after carefully checking for guards you take the lone teller hostage and leaving Arkansas Tom to guard him you walk into the vault, only to discover it is empty as all the money has just been transferred to another facility. Angry but helpless to do anything you two have no choice but to leave, get in your car and drive away.\n\nThe next three years are spent on the run, travelling through a variety of Missouri towns. Finally the law catches up with you when three detectives ring the doorbell of the house you and Arkansas Tom are renting in the town of Joplin. When Arkansas Tom answers the door he is immediately shot dead by the lawmen who burst into the room.\n\nJumping to your feet you draw your old scratched six-shooter from your pocket and the detectives open fire with automatic pistols. Shot through several times you fall backwards to the ground. Your long and eventful career has finally come to this desperate end, slain in a cheap lodging house in a small town city. It is finally over.\n\nYour Outlaw Career is finished.", "action_results": [null]}, {"action": "Refuse", "result": "You refuse to join Arkansas Tom in his robbery and he goes ahead with it anyway. After pulling it off he spends the next few years on the run until you read in newspapers how he has been tracked down and killed in Missouri in 1924. The following year you make the decision to hang up your gun for good and retire, nothing will ever persuade you to return to your former Outlaw ways. A long and peaceful retirement lies ahead for you.\n\nFOR SURVIVING YOUR OUTLAW CAREER YOU GET A BONUS OF 10,000 TO YOUR SCORE.", "action_results": [{"action": "The End", "result": "The years pass by slowly as the once endless plains of America are criss-crossed with roads and small towns spring up all over the once wild prairie. As you grow old you watch America go through World War 1, the Depression and World War 2. You read about all the great Depression-Era Public Enemies: John Dillinger, Baby Face Nelson, Pretty Boy Floyd, Bonnie and Clyde, Ma Barker and Alvin Karpis, it's all old news with new faces to you.\n\nYour brother Emmett prospers in California, helping turn your legend as the Dalton boys into books and movies before his death in 1937. Al Jennings does well, transforming himself into the successful outlaw on-screen that he never was in real life before his death in 1961 at the age 98 leaving you the last of the great old-west outlaws.\n\nBy this point you yourself are very old. The world is a different place to how it was: America is locked in a Cold War with Communism, across the Atlantic in the UK people are singing along to a new band called the Beatles and the outlaws you knew and liked have become the subjects of awful Dime Novels and B Movies.\n\nThat was not how it used to be. When you and your brothers the Dalton rode the air was alive with the crack of gunshots, the smell of gunpowder smoke and the screams of the dead and dying. It was a world of cheap whiskey, wild women, bank and train safes stuffed with money and life or death came down to who had the split second reflexes to be faster.\n\nThat's all gone now... gone but not forgotten. As America celebrates her Independence Day Celebrations you finally go to re-join your comrades and your name too slips into legend... the legend of The Wild Bunch.", "action_results": [{"action": "To read about the Historical Wild Bunch click here", "result": "The real-life Wild Bunch were not master outlaws or the great gunfighters of legend but a collection of extremely interesting characters destined for a tragic fate: apart from Emmett Dalton all five members of the Dalton Gang and all eleven main members of The Wild Bunch met violent ends, probably the highest number of fatalities suffered by any bank or train robbing gang.\n\nThe tragic thing is the Wild Bunch weren't even particularly good robbers: Jesse James made far more money in his career Jesse James's gang made five times more than the paltry $40,000 the various members of the Wild Bunch managed to steal in their sixteen robberies over seven years, Butch Cassidy's Hole in the Wall Gang made over ten times that amount. Their gunfights were frequent and many however and Coffeeville and Ingalls in particular stand out as iconic gunfights in Old Western History, the first being a great success for the side of the good and the latter for the side of the outlaws.\n\nBut the members of the Wild Bunch were an interesting bunch, with a few notable exceptions (Bob Dalton, George Bennett and Richard West spring to mind) they weren't cold-blooded killers but rather regular guys looking to have a good time, albeit by spending other's money. Their amateurism is reflected in their nicknames, having two guys in your gang called Dynamite Dick and Little Dick is usually not a sign of professional criminals looking to inspire terror in their victims!\n\nI've taken a few liberties with history, the gunfights and robberies didn't usually happen in quite the way I've described but writing this by stops and starts over the last six months has made me prefer creative licence to historical accuracy. Ultimately this is the story of interesting guys who did interesting things and whose activities were interesting enough for their names to become a part of the pantheon of outlaw history, that is itself part of the cultural heritage of America.\n\nHopefully their story made interesting reading :)", "action_results": [null]}, null]}]}]}, {"action": "Turn him down", "result": "You refuse to join Arkansas Tom in the robbery, he goes ahead with it anyway and is promptly captured and imprisoned during the robbery. After four years he is released and arranges another meeting with you in the little town of Asbury. Tom looks more gaunt but even more determined than last time and is determined to enlist your help.\n\n\"I'm going to hit the bank here,\" he tells you. \"I want you to help me. This time I'll do it right, no foul-ups I promise. What do you say, one more time for the old days?\"", "action_results": [null, null]}]}]}]}]}, {"action": "Stay with Al, John, Pat and Morris at Cushing", "result": "You elect to stay with the gang and continue to hide out at Cushing. One Winter's evening you are all just returning from a reconnaissance raid to inspect the local trains when, completely without warning, a posse of lawmen open fire from a nearby woods. With the familiar whiz of bullets flying around you all turn and flee, though both Al and John Jennings are grazed by the flying bullets.\n\nYou remain on the run for a week, eventually winding up at Carr Creek. Just as you are crossing the fast-moving deep waters a dozen lawmen appear on the far bank and train their rifles on the group of you. Trapped in the slow moving waters you are torn between surrender or diving into the icy fast-flowing waters and trying to swim to safety.", "action_results": [{"action": "Surrender", "result": "With a deep sigh you slowly raise your hands into the air. After all these years of running and hiding it is all over, you and your companions promptly surrender; soon afterwards Little Dick West is tracked down and killed by lawmen. Inevitably you and your companions are found guilty of train robbery and receive substantial sentences, the most serious is reserved for you: twenty years.\n\nThe years pass slowly. Al, John, Pat and Morris are all released in 1902, Little Bill Raidler is released in 1903 (and dies the following year of his gunshot wounds), your brother Emmett is paroled in 1906 and Arkansas Tom is released in 1910. Your turn for release doesn't come until 1917, by which time you are in your late forties.\n\nBy now the world is changing: the Indian Territory has been transformed into a state called Oklahoma. Your brother Emmett has moved to California and become an estate agent, Al Jennings (an outlaw connected to Little Dick West) has become a politician and only Arkansas Tom Jones has trouble settling down. He invites you to meet him in Neosho. Arkansas Tom, a lean and pale outlaw the same age as you, has a proposition.\n\n\"I miss the outlaw life and begin rich,\" he tells you. \"I got sent to prison for seventeen years for a train robbery that netted me $100 and for killing a Deputy Marshal. I want to earn something for the years I've served. I want to rob the town bank. Will you help me do this? For old time's sake? Bill Doolin and all the boys would be proud of us.\"\n\nYou consider his suggestion, it would mean a return to your life of crime after some twenty years but is it worth it?", "action_results": [null, null]}, {"action": "Dive into the icy waters", "result": "Taking a deep breath you plunge into the ice-cold water of the river and swimming in powerful strokes you cut through the freezing water. Bullets whoosh by as the lawmen fire at you but somehow they don't hit and by the time you surface you are far down river. Dragging yourself to the bank, utterly exhausted and more dead than alive you take deep gulping breaths before dragging yourself further into the wood.\n\nYou spend the next two years on the run, in that time both Dynamite Dick and Little Dick are tracked down and killed. You are now the last of the Wild Bunch.", "action_results": [null]}]}]}, {"action": "Hide out with Dynamite Dick", "result": "You go with Dynamite Dick to hide out in his small one-roomed cabin near Checotah while Little Dick and his gang go on to pull off a series of unsuccessful train robberies in the Territory. You and Dynamite Dick remain at the cabin until one winter's morning a glance out the window reveals a posse of lawmen are advancing on your hideout.\n\n\"I've had enough of running,\" Dynamite Dick tells you. \"I'm going to fire at them from the windows and give them hell.\"\n\nYou nod at his words, meanwhile your eyes flicker towards the chimney which looks narrow enough that you might be able to climb up out of it.", "action_results": [{"action": "Open fire on the posse", "result": "You and Dynamite Dick each choose a window and with a nod to each other you open fire on the lawmen. The posse immediately scatters and dozens of rifles open fire on the cabin, the bullets punching through the thin wooden walls. Both you and Dynamite Dick are hit multiple times but keep firing until eventually blood loss overwhelms you and you die in this last gun battle.\n\nYour Outlaw Career is over.", "action_results": [null]}, {"action": "Try climbing up the chimney", "result": "While Dynamite Dick prepares for his last stand you cross to the chimney, squeeze yourself up the narrow space and begin shimmying up the grimy stone space. Finally you make it up to the roof where, unseen by the posse you lie flat on the roof. Inevitably the gun battle ends in Dynamite Dick's death and the guns fall silent.\n\nYou lie on the freezing cold roof all afternoon while the posse take Dynamite Dick's body away, apparently concluding you must have been elsewhere. By nightfall the posse has gone and you slide off the roof to the ground. You flee the area on foot and vanish into the wilderness: over the next few months you read in newspapers about the capture of the Jennings Gang and the death of Little Dick at the hands of lawmen.\n\nYou are the last of the Wild Bunch.", "action_results": [null]}]}]}]}, {"action": "Surrender", "result": "You raise your hands but Bill yells \"I will never surrender\" and goes for his guns. Instantly the posse opens fire, in their confusion several lawmen shoot at you as well. You and Bill are both hit multiple times and killed instantly, falling from your saddle onto the soft grass beneath you breathe your last breath as the posse continue to fire into your motionless bodies.\n\nYour Outlaw Career is at an end.", "action_results": [null]}]}, {"action": "Go with Dynamite Dick to Checotah", "result": "You accompany Dynamite Dick to an isolated cabin near the village of Checotah, a month after your arrival you read how Bill Doolin has been tracked down and killed by a posse. The death of your friend grieves you but you need to worry about your own safety as well - for a year you and your friend hide out at the cabin, rarely venturing far from it. Finally Little Dick West gets word to you that he wants to meet in Woodward.", "action_results": [null]}]}, {"action": "Turn down the offer and do your time", "result": "Bill and Dynamite Dick go ahead with their prison break plan which is successful but both are tracked down and killed by lawmen and by 1898 the last of the Wild Bunch is killed. The rest of you remain in prison for a time, Jim Knight dies in prison but Little Bill is released in 1903 (only to die the following year from his gunshot wounds), Emmett is paroled in 1906 and Arkansas Tom is released in 1910. As the most famous of the surviving Wild Bunch you are held the longest and you are not paroled until 1917, by which time you are in your late forties.\n\nBy now the world is changing: the Indian Territory has been transformed into a state called Oklahoma. Your brother Emmett has moved to California and become an estate agent, Al Jennings (an outlaw connected to Little Dick West) has become a politician and only Arkansas Tom Jones has trouble settling down. He invites you to meet him in Neosho. Arkansas Tom, a lean and pale outlaw the same age as you, has a proposition.\n\n\"I miss the outlaw life and begin rich,\" he tells you. \"I got sent to prison for seventeen years for a train robbery that netted me $100 and for killing a Deputy Marshal. I want to earn something for the years I've served. I want to rob the town bank. Will you help me do this? For old time's sake? Bill Doolin and all the boys would be proud of us.\"\n\nYou consider his suggestion, it would mean a return to your life of crime after some twenty years but is it worth it?", "action_results": [null, null]}]}]}, {"action": "Run for it", "result": "You have no intention of lingering and racing down the stairs you slip unnoticed out the back door of the hotel and flee on foot out of town. The sound of gunshots continue to ring out for several minutes until you are aware of the thudding of horse hooves - glancing back your heart gives a thrill of delight as you see your companions Bill Doolin and Bill Dalton (riding the same horse), Charley Pierce, Red Buck, Dynamite Dick and Tulsa Jack all galloping towards you. Charley slows so you can jump onto his horse and you ride on. Looking back you can see lawmen have surrounded the hotel where Arkansas Tom is still firing from the windows and it seems that your companion is lost.", "action_results": [{"action": "23 January 1894: Pawnee, Indian Territory", "result": "Your narrow escape has shaken all of you and for the next few days you put as much distance as you can between yourselves and Ingalls; you also read in newspapers about the ambush. It seems that fourteen lawmen planned to arrest you all in Ingalls but the gunfight was triggered prematurely when Bitter Creek encountered one. Three lawman and a civilian (who was accidentally shot by the lawmen) were killed and Bitter Creek, Dynamite Dick and two more civilians were all wounded by the lawmen, Bitter Creek in the leg and Dynamite Dick in the hand, losing two of his fingers.\n\nWorse of all Arkansas Tom was trapped in the hotel and captured, found guilty of murder in the next few months he receives a life imprisonment. The loss of your companion and your own narrow escape prompts you all to lie low in the winter, you hide out with Bitter Creek and Dynamite Dick, helping them recover from their wounds.\n\nAt the start of 1894 you reunite and Bill Doolin turns up with two new gang members he has recruited: Richard West and William Raidler who are promptly named Little Dick and Little Bill due to their physical resemblances to Dynamite Dick and Bill Doolin. Little Bill doesn't impress you much but Little Dick, a rather wild looking man, is a good pistol shot.\n\nBy now you are the most famous outlaw gang in America, notoriously well-known as The Wild Bunch and are now ten members strong. Bill Doolin and your brother Bill Dalton have emerged as the co-leaders of the gang and have come up with a plan.\n\n\"There are so many of us we should split into two groups and rob banks in different states,\" Bill Doolin announces. \"We'll hit a bank here in Pawnee first and then split into two groups and rob banks in Missouri and Texas. The Indian Territory is getting more and more lawmen in it all the time and if we want to stay ahead of them we need to start branching out into other states.\" All of the gang is enthusiastic about robbing the bank in Pawnee.\n\nOne winter's morning you ride into the little town with the rest of the gang and leaving Little Bill and Little Dick to guard the horses you all walk straight into the bank. You find just one old man inside who is rather bemused when you all produce your guns and demand he empty the vault. He returns with a small bundle of bills, $100 in all. Apparently the bank is facing fore-closure and all of it's funds have been moved elsewhere. Angry and humiliated there is nothing you can do but take the money, walk out, mount up and ride off.", "action_results": [{"action": "A new target", "result": "The poor results of the Pawnee Bank robbery have left the gang dispirited and you split up for a few months before reuniting in the little community of Woodward. One evening your brother Bill invites you to a meeting in his room, going there you find Bill, Bill Doolin, Bitter Creek and Charley present. Once you are inside Bill closes and locks the door.\n\n\"We have a plan,\" he tells you all. \"It is possible that this gang has become too big so now, even if we pull off a successful robbery, there are too many in the gang for our shares to be worth much. I think we should rob the bank here in Woodward, just the five of us. We're the most experienced and could pull it off.\"\n\nNot all the group is in agreement, Bitter Creek and Charley don't like the idea of sneakily pulling off the robbery and not inviting the rest of the gang to take part; they refuse to take part in the robbery. One the other hand both Bill's are very enthusiastic about the proposal and urge you to help them rob the bank.", "action_results": [{"action": "Join the two Bill's in the robbery", "result": "That afternoon, after ordering the rest of the gang to leave town, you and your two companions ride up to the bank, while Bill Doolin stays outside with the horses you and your brother go in. There is just one cashier behind the counter who freezes in terror as you both draw your pistols and take him prisoner. While you guard him Bill goes to empty the contents of the vault into a sack and emerges from the vault with a wide grin.\n\n\"We're rich little brother,\" he announces.\n\nAfter locking the cashier in the vault the pair of you leave the bank, mount up and ride out of town. The robbery went as smoothly as clockwork and you have escaped with $6,000, an unusually large amount which split three ways makes your share $2,000. You ride off to join the rest of the gang where you begin making plans to rob banks in Missouri and Texas.\n\nTrouble strikes that night when members of the gang hear news of the robbery in Woodward and quickly realise you and the two Bill's were responsible. Your companions are furious they were not invited to take part and amidst the arguments the two Bill's start to blame each other. The result is the biggest argument to rock the gang since the one just before Coffeeville.\n\nAll the old grudges come out: Bill Doolin accuses your brother of wanting to lead the gang and be more famous than your dead brother Bob. Your brother accuses Bill Doolin of abandoning your brothers which may have contributed to their deaths at Coffeeville. The result of the argument is a split: the newer gang members side with Bill Doolin while Bitter Creek and Charley Pierce side with your brother Bill.\n\nThe next morning the divided gang prepares to part ways. Bill Doolin, Tulsa Jack, Dynamite Dick, Red Buck, Little Dick and Little Bill are going to Missouri to rob a bank in Southwest City. Bill Dalton, Bitter Creek and Charley Pierce plan to rob a bank here in the Territory before recruiting more members and heading down to Texas to rob a bank there. Both Bill's ask you to accompany them.\n\nYou are torn between loyalty to your brother Bill and loyalty to your friend Bill but you have to make a choice.", "action_results": [{"action": "Go with Bill, Jack, Dick, Buck, Little Dick and Little Bill to rob the bank in Missouri", "result": "You and your six companions relocate to Missouri where you hide out for a time. Your brother does not fare well with his gang, in an unsuccessful robbery attempt where Bitter Creek was shot and wounded he and Charley went into hiding: your brother has recruited three cowboy friends and gone south to Texas to rob a bank. Bill Doolin, still angry at your brother, has no intention of helping him, and you begin to make plans for your own bank robbery.\n\nOne spring morning you all ride into town and dismount outside the bank. Bill's plan is to take the gang inside and leave Little Bill and Little Dick outside to guard the horses. He gives you the choice of choosing whether to go inside with the main group or remain outside with the two new recruits.", "action_results": [{"action": "Go inside the bank", "result": "You and Bill lead your friends into the bank where you quickly draw your guns and take several tellers and customers hostage. While the others guard them you and Bill walk into the vault and quickly begin loading all the money inside into a sack. As you do Little Bill runs into the bank and shouts \"Hurry boys, they've raised the alarm!\"\n\nAlmost immediately you hear several gunshots ring out from outside followed by screaming and shouting. \"Let's go Bill,\" you tell and together you lead your men at a run out of the bank. It is pandemonium outside: apparently Little Dick has opened fire on townsfolk and shot four, killing one. The rest of you hurry to mount your horses.\n\nSome of the town's citizens have grabbed guns and fire at you from the window, one bullet hits the bank's wall just in front of you and another grazes Bill's head making him yell. Firing your pistols into the air you all spur your horses down the street and escape from town, leaving the chaos behind you.\n\nRiding cross-country you find you have escaped with $4,000, which divided between you all makes your share $500. Bill's wound isn't serious and it is soon treated and dressed before you all split up and hide out for the winter. The next month you read that following the bank robbery in Texas your brother was tracked down back to the Indian Territory where he was shot and killed by a posse of lawmen. Two of his companions were killed and the third arrested.\n\nYou are now the last surviving Dalton brother at large and the law is closing in. Your grief is almost too much to bear.", "action_results": [{"action": "Reunited", "result": "The death of Bill Dalton casts a shadow over the reunion of the Wild Bunch. Bill Doolin looks more haggard and older than you remember him, he, Bitter Creek and Dynamite Dick are all in pain from previous bullet wounds. Charley, always silent seems even more solemn than usual, Red Buck sits and scowls, Little Bill looks nervous, Little Dick is silent and even the usually cheerful Tulsa Jack seems quiet and withdrawn.\n\nThe death of your brother has led everyone to put their past differences behind them and this spring day Bill leads the gang to rob a train: boarding it at Dover Little Bill and Little Dick take the driver hostage and make him stop the train while you, Bill, Bitter Creek and Charley empty the express carriage. The robbery goes smoothly and mounting up you ride away to find you have escaped with just $1,000, making your share $100.\n\nYou ride all day until you reach a rocky valley where you decide to rest. Bill asks for someone to keep watch while the rest of the gang sleeps and Tulsa Jack volunteers to do it. You are not sure if one sentry is enough.", "action_results": [{"action": "Volunteer to keep watch with Tulsa Jack", "result": "You join Tulsa Jack in keeping watch from the mouth of the valley. Unfortunately the area before the valley is heavily wooded and provides ideal cover for a posse of lawmen advancing on your position. The first thing you know of the ambush is when a dozen rifles fire. You and Tulsa Jack are both shot through and fall to the ground dead or dying. It might be some consolation to know that your sacrifices alerted your companions and enabled them to escape.\n\nYour Outlaw Career is at an end.", "action_results": [null]}, {"action": "Get some sleep with the others", "result": "You join the others in resting and soon drift off to sleep. You are woken suddenly by a volley of rifle shots and springing to your feet you are startled to see Tulsa Jack lying dead on some rocks above you. You and your companions spring to your feet, climb quickly onto your horses and gallop away from the valley, escaping the posse of lawmen closing in on you.\n\nBill is very shook by the death of his friend and is certain that the rest of you should all split up and hide out in different locations for at least a year to elude the lawmen who are hunting you. Bill decides to go to Eureka Springs, Arkansas, Bitter Creek and Charley choose to hide out at the ranch of some friends in Payne, Indian Territory, Dynamite Dick is going to Dallas, Texas, Red Buck is going to hide with a friend in Arapho, Indian Territory, Little Dick is going to stay with some friends in Woodward, Indian Territory and Little Bill is going to hide out in a cabin in Pawhuskie, Indian Territory. You need to choose who you will go with.\n\nAs you glance around at your companions you are startled to see, for the first time, fear and uncertainty in their eyes. It is an undeniable fact that of the twenty-one men who have ridden with you in the Wild Bunch thus far eleven are dead and three are in prison leaving just your seven companions. Of your five brothers you are the one not dead or in prison. As your fame increases and lawmen become increasingly determined to bring you in dead or alive (the former preferable) it seems that the writing is on the wall...\n\nYou should choose your companion or companions carefully.", "action_results": [{"action": "Go with Bill to Arkansas", "result": "You and Bill Doolin hide out in Eureka Springs, Arkansas where your gregarious companion keeps you company. In Eureka Springs you read about how your friends Bitter Creek and Charley Pierce were betrayed and killed by alleged friends of theirs for the reward money while Little Bill is shot and captured after being tracked down by lawmen. The forces of justice are closing in.\n\nLittle Bill still occasionally suffers from pain in his foot that got shot three years ago and intends to go to the bathhouse in Eureka Springs to see if the waters there can help soothe the pain. You are worried it might be too dangerous for both of you to go into the heart of the busy town but Bill points out that you are in Arkansas where the Wild Bunch has never been active and you should be perfectly safe.", "action_results": [{"action": "Go with Bill to the bathhouse", "result": "You and Bill ride into town and make your way to the bathhouse where you both change into swimming costumes and visit the relaxing springs. The waters of the springs are wonderfully peaceful and you both enjoying your relaxing soak in them until you hear the double click of a shotgun cocking behind you and a voice calls out \"put your hands up very slow.\"\n\nTurning you both find yourself facing a lone lawman armed with a shotgun, helpless there is nothing you can do as you surrender and are taken into custody. The lawman allows you to change into your clothes before you are both marched to jail where you are securely imprisoned. You are both sentenced to life imprisonment for bank robbery and it seems that your outlaw careers are over. Fate reunites you with your companions...", "action_results": [null]}, {"action": "Stay in hiding outside the town", "result": "Your decision not to accompany Bill into town turns out to be a wise one: when he doesn't return you become concerned and hastily leave town. The next day you read in the newspapers that your friend was captured by a posse of lawmen at the bathhouse and is in prison facing charges of bank robbery. With the members of the Wild Bunch being tracked down one by one you are running out of friends to hide with... but you have to keep moving.", "action_results": [{"action": "Join Red Buck in the Indian Territory", "result": "You join Red Buck in a little cabin outside the settlement of Arapho where you read in newspapers about the destruction of the Wild Bunch: first Bitter Creek and Charley Pierce are betrayed and killed by bounty hunters, then Little Bill is shot and captured by lawmen and finally, but worse of all, Bill Doolin is captured in a bathhouse in Eureka Springs.\n\nThe law catches up with you and Red Buck one afternoon: you are returning to your cabin after a successful duck hunt when a lawman steps out of your cabin door and casually announces he has you both completely covered and that you should surrender. You and Red Buck glance at each other and you can tell instantly that your companion means to fight.", "action_results": [{"action": "Run for the trees", "result": "Without hesitating you dart to your right and sprint towards the trees as weapons explode into life behind you: fortunately most of your adversaries are shooting at Red Buck who is hit several times and collapses to the ground dead. You make it to the trees unhurt and continue running, not stopping until you are far from the area.\n\nYour heart is thudding in your chest as you think desperately of where you can hide: only two other members of the Wild Bunch remain at large: Dynamite Dick down in Texas and Little Dick in the nearby community of Woodward. Wherever you go to hide out it seems that lawmen will not stop pursuing you until you are as dead as most of your friends.", "action_results": [{"action": "Join Dynamite Dick in Texas", "result": "You join Dynamite Dick in Texas where you read in newspapers of the steady destruction of the Wild Bunch in the year after the Dover Train Robbery. First Bitter Creek and Charley Pierce are betrayed and killed by turncoat friends, then Little Bill is shot and arrested in the Territory and Bill Doolin is arrested in Arkansas; finally Red Buck is shot and killed by lawmen. By the summer of 1896 only you, Dynamite Dick and Little Dick remain at large.\n\nYour friend is an intelligent and cautious man but one summer day you both let your guard down and risk a shopping trip in Dallas. You are walking down the street when you are confronted by a lone lawman with a pair of pistols trained on the pair of you. He orders you to slowly raise your hands and surrender. Dynamite Dick hesitates and then complies.", "action_results": [{"action": "Make a run for it", "result": "Taking a deep breath you run straight at the lawman and shoulder-barge him. Before he can recover from his shock you race on, vanishing amidst the crowd of people teeming Dallas's busy streets. You run as fast as you can, slipping through the town to it's outskirts where you steal a horse and ride as fast as you can to join your last remaining outlaw companion: Little Dick West.\n\nWhile you are riding from Texas to the Indian Territory Dynamite Dick is imprisoned with Bill Doolin. They don't remain imprisoned for long: after a month they escape but soon after your friend Bill is tracked down by a posse of lawmen and shot dead. Dynamite Dick escapes and after a year of hiding out you manage to arrange a meeting with him and Little Dick in the town of Woodward in the Territory, the three of you are the last of the Wild Bunch.", "action_results": [null]}, {"action": "Surrender", "result": "You calmly raise your hands and surrender. You and Dynamite Dick are taken into custody and transported to the Indian Territory for your trial. With your capture Little Dick West remains the only member of the Wild Bunch still at large and it seems that your outlaw career is finally at an end... but then fate reunites you with your friends.", "action_results": [null]}]}, {"action": "Join Little Dick in the Indian Territory", "result": "You flee to Woodward following the arrest of Bill Doolin and the shooting death of Red Buck at the hands of a posse of lawmen in Indian Territory. You find Little Dick and hide out with him at the home of two brothers called Al and John Jenning where you read of the capture of Dynamite Dick in Texas. Dynamite Dick and Bill Doolin escape from prison together in the summer of 1896, though Bill is tracked down by a posse of lawmen and killed soon after his escape. After a year on the run you and Little Dick finally arrange a meeting with Dynamite Dick in Woodward - by now the three of you are the last members of the Wild Bunch still at large.", "action_results": [null]}]}, {"action": "Go for your gun", "result": "You pull your pistol from it's holster but you never get the chance to use it: several bullets hit you and Red Buck in the chest and you both fall backwards to the ground, very dead. Your death marks the passing of the last of the Dalton Boys and within a short time the Wild Bunch is destroyed, it's last members hunted down and killed.\n\nYour Outlaw Career is over.", "action_results": [null]}]}, null, null]}]}, {"action": "Stay with Bitter Creek and Charley in the Territory", "result": "You spend the next month riding with Bitter Creek and Charley Pierce to the ranch of their friends, the Dunn brothers. Bitter Creek is friendly and chatty, only wincing occasionally from his wounds. Charley is as silent as ever. As you approach the Dunn ranch the five Dunn brothers come out to meet you. You greet them cheerfully.\n\nThe Dunn boys respond by drawing pistols from their pockets and firing at you and your friends. You have a split second to make a decision on what to do.", "action_results": [{"action": "Spur your horse straight at them to break through", "result": "Spurring your horse at your attackers is the last thing they expected and they hastily throw themselves aside as you gallop through. Some of your assailants fire shots at you but by leaning far over the side of the saddle you are able to avoid the shots whistling overhead - your companions aren't so lucky and a glance back shows them both lying dead on the ground.\n\nYou do not stop riding until you are reach the nearby town of Payne and hastily buy a train ticket out of the area. Over the next few days the newspapers confirm what you already knew: the Dunn brothers betrayed your friends for money and killed them. With your two friends dead you and Bill Doolin are the last survivors of the Dalton Gang. You must pick someone else to hide with.", "action_results": [null, null, {"action": "Join Little Bill in the Indian Territory", "result": "You and Little Bill hide out in a cabin near Pawhuska in the Territory for a few months where you are saddened to read of the deaths of Bitter Creek and Charley Pierce, betrayed and shot by men they considered friends. You and Little Bill stay in the cabin mainly, you are standing outside the cabin talking one afternoon when you are startled to see three men walking towards you out of the nearby trees.\n\n\"We know who you are men,\" one of the men shout to you and Bill. \"Throw up your hands.\"", "action_results": [{"action": "Make a run for it", "result": "Instantly you dart to your left as gunshots ring out behind you - bullets whizz past you to strike the wooden wall of the cabin but within moments you are around the corner of the cabin and sprinting down the side, round the rear and racing into the woods beyond; one of the lawmen tries pursuing you but you are too fleet of foot.\n\nYou tear through the thicket and bracken for several miles until you reach Pawhuska where you steal a horse and ride on. You later read in newspapers that Little Bill was shot three times, captured and sentenced to ten years imprisonment for bank robbery. You were lucky to escape and with the law resolutely on your trail you must find another place to hide.", "action_results": [null, null, null, {"action": "Join Little Bill in the Indian Territory", "result": "You join Little Dick in Woodward, an untidy and humourless figure you don't much enjoy your time with him. You are saddened to read in papers of the murders of Bitter Creek and Charley Pierce following a betrayal by alleged friends of theirs and of the arrest of Little Bill after he is tracked down and shot by lawmen. There are only you and four other members of the Wild Bunch at large now.\n\nLittle Dick introduces you to three friends of his: brothers called John, Frank and Al Jennings. John is a lawyer but Al wants to be an outlaw, he is enthralled by your tales of your hold-ups. Woodward is a sleepy little town but it has it's difficulties: the Jennings brothers are embroiled in a feud with a rival lawyer called Temple Houston.\n\nOne night you are sitting in the town's saloon chatting with John and Frank when Houston walks in and an argument between your companions and the dapper young lawyer ensures. Almost without warning everyone goes for their guns and before you can act Houston has drawn and shot both John and Frank. As your two companions fall to the floor the lawyer, his pistol still smoking, glances at you.\n\n\"This disagreement has nothing to do with you friend,\" he tells you.", "action_results": [{"action": "Go for your gun", "result": "You reach for your pistol and a split-second later Houston fires, his bullet hitting you in the chest. Unfortunately for you your opponent is a crack-shot and his bullet pierces your heart, you fall dead to the floor alongside your companions, killed in a gunfight that actually had absolutely nothing to do with you.\n\nYour Outlaw Career is over.", "action_results": [null]}, {"action": "Walk away", "result": "You do not intend to get shot over someone else's dispute and you walk away, Frank Jennings dies of his injury but John Jennings recovers with time. Despite the incident you spend the next year hiding out in Woodward with Little Dick, all the while reading about the fates of your companions: Red Buck is shot and killed in the Indian Territory while both Bill Doolin and Dynamite Dick are captured. They later escape prison but Bill Doolin is killed by a posse of lawmen a short time later. You and the other two remaining members of the Wild Bunch plan a meeting in Woodward.", "action_results": [null]}]}]}, {"action": "Go for your gun", "result": "You clap your hand to your side, grab your gun and draw it but you get no further than that: the lawmen open fire and a bullet hits you in the chest, dropping your pistol you fall to your knees. At your side Little Bill is hit in the wrist, dropping his gun. Turning to run he is hit twice more and falls to the ground next to you.\n\nBoth of you are taken into custody and for a time it looks as though your wounds will be fatal. After making slow recoveries both of you are sentenced to ten years imprisonment each after witnesses identify both of you as participants in the Dover Train Robbery. Over the next few months more gang members are killed and Bill Doolin and Dynamite Dick are both captured. Finally fate reunites you...", "action_results": [null]}]}, null, null]}, {"action": "Draw your weapons and return fire", "result": "You pull your pistols from your pocket but barely have time to raise them when a rifle shot hits you in the throat. You fall backwards from your horse, dying alongside your companions in the dust. You have been betrayed by your friends for financial reward and the deaths of you and your companions in just the beginning of the end for the Wild Bunch.\n\nYour Outlaw Career is over.", "action_results": [null]}]}, null, null, null, null]}]}]}, {"action": "Stay outside and guard the horses", "result": "You remain outside with the two newest gang members while the others go into the bank. Almost immediately you notice that the three of you are attracting attention from the townsfolk with all your horses outside the bank and feel uneasy. Suddenly you are recognised and the familiar cry is shouted out: \"Boys! They are robbing the bank!\"\n\n\"We'd better warn the others,\" Little Bill mutters to you nervously.", "action_results": [{"action": "Run inside the bank and warn the others", "result": "You run into the bank and shout \"quick boys, they've raised the alarm!\" Almost immediately several gun shots are fired outside and looking out the window you see Little Dick has opened fire on the townsfolk, hitting four of them and killing one. Quickly you and your companions race outside and mount the horses as townsfolk begin to fire at you all from windows and doorways up and down the street. One bullet grazes Bill's head making him yell in pain. Firing your pistols into the air you and your companions ride out of town.\n\nRiding cross-country you find you have escaped with $4,000, which divided between you all makes your share $500. Bill's wound isn't serious and it is soon treated and dressed before you all split up and hide out for the winter. The next month you read that following the bank robbery in Texas your brother was tracked down back to the Indian Territory where he was shot and killed by a posse of lawmen. Two of his companions were killed and the third arrested.\n\nYou are now the last surviving Dalton brother at large and the law is closing in. Your grief is almost too much to bear.", "action_results": [null]}, {"action": "Stay outside and protect the horses", "result": "You remain outside with Little Dick while Little Bill runs into the bank to warn the others. As the cries of alarm increase Little Dick suddenly starts shooting into the town citizens milling around the street, hitting three of them. The townsfolk scatter except for one man who pulls a pistol from his pocket. Before he can take aim you raise your rifle and shoot him through the throat, dropping him dead in the street.\n\nAs the townsfolk continue to scatter your companions burst from the bank behind you and you all hastily mount your horses. A few citizens have found their weapons and fire at you and your companions from the cover of windows and doorways. One bullet grazes Bill's head making him yell. Firing your pistols into the air you and your companions ride out of town, leaving the scene of chaos behind you.\n\nRiding cross-country you find you have escaped with $4,000, which divided between you all makes your share $500. Bill's wound isn't serious and it is soon treated and dressed before you all split up and hide out for the winter. The next month you read that following the bank robbery in Texas your brother was tracked down back to the Indian Territory where he was shot and killed by a posse of lawmen. Two of his companions were killed and the third arrested.\n\nYou are now the last surviving Dalton brother at large and the law is closing in. Your grief is almost too much to bear.", "action_results": [null]}]}]}, {"action": "Go with Bill, Bitter Creek and Charley to rob a bank in the Indian Territory", "result": "You choose to stick with your brother and together with Bitter Creek and Charley Pierce you quickly plan a robbery of the small bank in the little town of Sacred Heart. One spring morning the four of you ride into town, Bill's plan is for Charley to stay outside with the horses while he and Bitter Creek go into the bank. He gives you the chance of who you go with.", "action_results": [{"action": "Go inside the bank with Bill and Bitter Creek", "result": "You and your friends walk into the bank and draw your pistols.\n\n\"This is a robbery,\" you announce to the lone man behind the counter. \"Raise your hands.\"\n\nThe cashier promptly raises his hands, holding a pistol in one of them. Without hesitation he fires a shot, hitting Bitter Creek in the shoulder. Bitter Creek swears and you immediately fire, hitting the teller in the stomach, knocking him to the floor. \"Quickly,\" Bill yells, throwing his arm over the injured Bitter Creek and helping him outside. The four of you mount up and flee without a dollar.\n\nBitter Creek's injury is serious and having been shot for the second time in seven months he is angry, insisting he wouldn't have been shot if he had just stayed with Bill. He and Charley plan to go into hiding with a friend, refusing to join Bill in his plan to rob a bank in Texas. In response Bill recruits four cowboy friends of his: a mean character called George Bennett, brothers Asa and Jim Knight and a youth called Jim Wallace. Bill urges you to join him and his raw recruits in robbing the bank in Texas while Bitter Creek and Charley are equally insistent that you should join them in hiding.", "action_results": [{"action": "Join Bill and his new companions in robbing the bank in Texas", "result": "You, Bill and your four new friends travel south from the Indian Territory to the little town of Longview. You are not impressed by your companions, they seem prone to enthusiastic drinking and bragging about all the men they've beaten in fights or how good they are with pistols. You share your doubts with Bill but he just shrugs and insists they're good gunmen.\n\nOne spring afternoon you all ride up to the bank and dismount outside. Bill's plan is to go inside with the Knight brothers, Asa and Jim, and leave Jim Wallace and George Bennett outside to guard the horses. He lets you choose who you go with.", "action_results": [{"action": "Enter the bank with Bill, Asa and Jim", "result": "You walk into the bank with your friends and draw your pistols. The two tellers are quickly taken hostage and you and Bill leave your new recruits to guard them while you walk into the vault and quickly begin emptying it's contents into a sack. While you are busy doing this you suddenly hear a gunshot outside followed by a series of them.\n\n\"Well, that's not good,\" Bill comments to you. \"Quickly boys, we're leaving.\"\nYou all hurry outside to find Jim sheltering behind the horses while George Bennett is lying dead in the middle of the street, four other people are also lying dead or wounded around the street. A man behind a tree with a rifle, presumably the man who shot George, fires at you all missing.\n\n\"George went crazy and just opened fire on people!\" Jim shouts to you. Mounting up quickly the five of you spur your horses out of town, rifle shots zinging past you but fortunately not hitting you. A safe distance from the town you count the money in the sack and find you have escaped with $4,000, making your share $800.\n\n\"We need to split up,\" Bill announces. \"The Texas Rangers will be after us. I'm going back to Indian Territory to hide out at a little cabin I have outside Elk. The rest of you I want to stay here, go down to El Paso or someplace safe and wait for me to send for you.\"\n\nThe others agree and you need to choose who you will go with.", "action_results": [{"action": "Go with Bill back to the Indian Territory", "result": "You and Bill travel back to the Indian Territory to a small one-roomed cabin Bill rents where you plan to lie low for a time. On your journey you read how Bill Doolin's half of the gang successfully robbed a bank in Missouri, like you escaping after a gun battle. In the cabin you both lie low for a few weeks until one fateful day you are both sitting inside one night when you hear a voice shout out \"We have the cabin surrounded! Come out with your hands up and no one will get hurt.\" \"It's the law!\" Bill hisses as you both jump to your feet.\n\nThere are only two ways out of the cabin: the front door and a small back window. Bill snatches up both of his pistols, cocks them and approaches the door. \"I'm going to give them something to remember me by,\" he mutters to you.", "action_results": [{"action": "Race out the front door with Bill", "result": "You and Bill take a deep breath and then Bill throws open the door and you both race out, pistols in both your hands and firing. A volley of rifle shots rings out and both you and Bill are hit multiple times and blasted to the ground dying. The last of the Dalton brothers breathe their last breaths as you and your brother die in one last hail of gunfire.\n\nYour Outlaw Career is over.", "action_results": [null]}, {"action": "Try and squeeze out of the back window", "result": "Taking off your gun belt you climb onto a table, throw the window open and painfully squeeze yourself out of the narrow opening. You hear Bill throw open the door, race out firing his pistols, there is a volley of rifle shots and then silence. Gritting your teeth you painfully slide through the window, tearing all the buttons off your shirt in the process and drop awkwardly onto the ground behind.\n\nYou are in luck: no lawmen are guarding the rear of the building and you run as fast as you can into the trees. After many long and difficult days you succeed in reaching safety and read in newspapers what you feared is true: your brother Bill is dead. At the same time lawmen track down your companions in Texas, killing Asa Knight and Jim Wallace and capturing Jim Knight, who is sentenced to life imprisonment. You hide out alone in the Indian Territory for the rest of the year before re-joining the rest of the gang next spring.", "action_results": [null]}]}, {"action": "Stay with Asa, Jim and Jim in Texas", "result": "You decide to go with the cowboys to El Paso and travel there in the week after the robbery. The day after you have arrived you are walking down the main street chatting to Jim Wallace when turn a corner and suddenly find yourself staring down the barrels of a dozen rifles held by some very serious looking Texas Rangers.\n\n\"Men you are under arrest,\" the Ranger Captain barks. \"Throw up your hands.\"\n\nJim Knight immediately complies while the other Jim and Asa drift their hands towards their gun belts. You are on the right of your little group and an alley opening on your right might offer you a chance of escape but it would be extremely risky.", "action_results": [{"action": "Raise your hands", "result": "You raise your hands into the air. Asa and Jim go for their guns and immediately several rifles explode into life: hit by several bullets the two men fall to the ground dead. Jim Knight gives a howl of pain as his brother dies and the pair of you are taken into custody. One week later lawmen in the Indian Territory track down and shoot your brother dead.\n\nThe trials for you and Jim Knight are straight-forward affairs: you are both found guilty of the Longview Bank Robbery and are both sentenced to fifty years imprisonment. Your only consolation as you begin your jail term is that Bill Doolin and his Wild Bunch are still alive and free... for another year or two until most of the gang are killed or captured. Finally fate reunites you.", "action_results": [null]}, {"action": "Go for your gun", "result": "You clap your hand to your pistol at your hip while Asa Knight and Jim Wallace do the same thing. Several rifles explode into life and you are shot through three times and together with Asa and Jim you are knocked to the ground, fatally wounded Gasping and choking you die of your wounds minutes later, a week after your death your brother Bill will be killed as well.\n\nYour Outlaw Career is over.", "action_results": [null]}, {"action": "Run for the alley", "result": "You dart to your right at the exact same moment that Asa Knight and Jim Wallace go for their guns. Rifles explode into life, hitting and killing the two men while more Texas Rangers fire at you but you are already down the alleyway and out of sight, darting left and right through a tangle of alleys you finally emerge onto a street where an unattended horse is tied to a railing. Quickly untying it you jump onto it's back and race down the street, quickly and escape from town.\n\nIt takes you a week to make it back to the Indian Territory by horse and train and by the time you arrive it is too late: lawmen have tracked down and killed your brother Bill. You are now the last of the Dalton Brothers free and alive and your grief is overwhelming. You spend the rest of the year in hiding before emerging and reuniting with Bill Doolin and your remaining outlaw companions the following spring.", "action_results": [null]}]}]}, {"action": "Stay outside with Jim and George", "result": "You stay outside with the two cowboys while the others go into the bank. George seems ill at ease and strides up and down in front of the horses. His behaviour is so odd it draws the attention of some passing townsfolk who stop and stare. \"What are you looking at?\" George snaps at them. Without warning he raises his pistol and shoots one of the men in the arm.\n\nPanic ensues as people scream and run for cover while George begins laughing manically and firing pistol shots wildly at fleeing townsfolk, hitting two more. Jim swears and takes cover behind the horses while you draw your pistol and consider your position.", "action_results": [{"action": "Join George in shooting at people", "result": "Striding out into the street you catch sight of a lawman jogging down the street towards you. Raising your rifle you take careful aim and shoot him in the chest, killing him. Suddenly you hear the boom of a buffalo gun and George is knocked off his feet by a shot that tears through his head. You turn just in time to see a man crouching behind a tree holding a rifle. He fires again, hitting you in the heart and killing you instantly.\n\nYour Outlaw Career has come to an end on this blood-soaked Texan street.", "action_results": [null]}, {"action": "Take cover with Jim behind the horses", "result": "You join Jim in sheltering behind the horses and watch as George fires again and again, hitting more people. Suddenly a gunman with a rifle fires from behind a tree, hitting George in the head and dropping him dead in the street. Behind you the bank doors open and your companions rush out, your brother clutching a sack of money.\n\n\"George went crazy and just opened fire on people!\" you shout to him. Mounting up quickly the five of you spur your horses out of town, rifle shots zinging past you but fortunately not hitting you. A safe distance from the town you count the money in the sack and find you have escaped with $4,000, making your share $800.\n\n\"We need to split up,\" Bill announces. \"The Texas Rangers will be after us. I'm going back to Indian Territory to hide out at a little cabin I have outside Elk. The rest of you I want to stay here, go down to El Paso or someplace safe and wait for me to send for you.\"\n\nThe others agree and you need to choose who you will go with.", "action_results": [null, null]}]}]}, {"action": "Go into hiding with Bitter Creek and Charley", "result": "Saying goodbye to your brother you go with Bitter Creek and Charley to hide out at the ranch of the Dunn Brothers, who are friends of theirs. In the newspapers you read how both Bill Doolin and Bill Dalton pull off bank robberies in Missouri and Texas respectively, both escaping after violent gunfights.\n\nThe shocking news comes in June when you read that your brother Bill has been tracked down and killed by a posse of lawmen and all his companions either killed or captured. You are the last surviving Dalton brother not behind bars and you are absolutely devastated by your brother's death. It seems that the law will not rest until you and your companions are all dead.", "action_results": [null]}]}, {"action": "Stay outside with Charley", "result": "You remain outside the bank with Charley while the other two go in the bank. Almost immediately there is a gunshot followed by a second gunshot and then Bill and Bitter Creek burst out of the bank doors, the latter bleeding from a bullet wound in his shoulder. \"Go, go, go!\" Bill shouts and the four of you mount up and flee without a dollar.\n\nIt seems that the cashier inside the bank had a pistol in the bank and as soon as your companions drew their weapons he opened fire, hitting Bitter Creek in the shoulder. Bitter Creek fired back, hitting the man in the stomach and then your two companions fled. The robbery attempt has been a complete failure.\n\nBitter Creek's injury is serious and having been shot for the second time in seven months he is angry, insisting he wouldn't have been shot if he had just stayed with Bill. He and Charley plan to go into hiding with a friend, refusing to join Bill in his plan to rob a bank in Texas. In response Bill recruits four cowboy friends of his: a mean character called George Bennett, brothers Asa and Jim Knight and a youth called Jim Wallace. Bill urges you to join him and his raw recruits in robbing the bank in Texas while Bitter Creek and Charley are equally insistent that you should join them in hiding.", "action_results": [null, null]}]}]}, {"action": "Decline and sit the robbery out", "result": "That afternoon the two Bill's order the rest of the gang out of town and you accompany your companions to a nearby village. That evening both Bill's turn up looking pleased with themselves, taking you to one side your brother Bill confides in you the robbery went without a hitch and the two men have just made themselves richer.\n\nTrouble strikes that night when members of the gang hear news of the robbery in Woodward and quickly realise you and the two Bill's were responsible. Your companions are furious they were not invited to take part and amidst the arguments the two Bill's start to blame each other. The result is the biggest argument to rock the gang since the one just before Coffeeville.\n\nAll the old grudges come out: Bill Doolin accuses your brother of wanting to lead the gang and be more famous than your dead brother Bob. Your brother accuses Bill Doolin of abandoning your brothers which may have contributed to their deaths at Coffeeville. The result of the argument is a split: the newer gang members side with Bill Doolin while Bitter Creek and Charley Pierce side with your brother Bill.\n\nThe next morning the divided gang prepares to part ways. Bill Doolin, Tulsa Jack, Dynamite Dick, Red Buck, Little Dick and Little Bill are going to Missouri to rob a bank in Southwest City. Bill Dalton, Bitter Creek and Charley Pierce plan to rob a bank here in the Territory before recruiting more members and heading down to Texas to rob a bank there. Both Bill's ask you to accompany them.\n\nYou are torn between loyalty to your brother Bill and loyalty to your friend Bill but you have to make a choice.", "action_results": [null, null]}]}]}]}]}, {"action": "Follow Bitter Creek to the stable with the horses", "result": "You and Bitter Creek take the Gang's horses when the others dismount and head towards the stables. As you are moving down the street you catch sight of a man walking down the street towards you. He has a silver Deputy's badge on his chest. The man halts as he catches sight of you and in a flash all three of you go for your guns.\nThe Lawman fires first, hitting your companion in the leg. Bitter Creek yells as you fire, narrowly missing the man who dives for cover. Suddenly you notice several men with guns in their hands running towards you both from all directions.\n\"Ride!\" you shout to Bitter Creek and with pistols exploding into life behind you the pair of you spur your horses down the main street, bullets zipping by. You do not stop riding until you are well out of town when you finally turn back to see what is happening.\nThe whole town seems alive with gunfire, bodies are lying in the street as lawmen shelter behind cover and fire pistols and rifles. As you watch Bill Dalton, Bill Doolin, Charlie, Tulsa Jack, Dynamite Dick and Red Buck, all mounted, burst out of the stable and spur stolen horses down the street, firing their pistols. Even as you watch Bill Dalton's horse is shot in the head and collapses spectacularly, your brother jumps from the saddle, lands on his feet, turns and shoots the lawman who killed his horse. Bill Doolin reins in and your brother runs towards him, throws himself onto the back of his horse and they gallop on. When your companions reach your position you all apply spurs to your horses and gallop on, away from Ingalls.", "action_results": [null]}, {"action": "Follow the rest of the Gang into the saloon to drink", "result": "You and your companions head down the street to the town saloon where the owner Murray is an old friend of Bill Doolin. You all order drinks and have barely sat down before you hear the unmistakable sound of gunshots from the street. Springing to your feet you all glance out the window and see several lawmen armed with pistols and rifles running towards the saloon.\n\n\"Quick, the back door!\" Murray yells. \"I'll cover you!\"\n\nWithout hesitation and with your brother Bill leading the way you all run out of the back door, cut down an alley to the stable and race inside. There are dozens of horses inside and each of you chooses one while gunfire rages outside as the lawmen trade shots with Murray. Once you are all mounted and ready Bill Doolin throws open the stable doors and you all charge out.\n\nThe lawmen are taken completely by surprise as you and your companions burst out of the stable onto main street: they were all still firing at the saloon or at the hotel where Arkansas Tom is sniping at them with a rifle. Two lawmen are close to the stable and fire at you all, one bullet hits your brother Bill's horse in the head and it falls to the ground, your brother jumping clear just in time. Turning around with his pistol in his hand he fires a shot that hits the lawman in the chest. You and Bill Doolin both pull the reins of your horses and turn around as your brother runs towards you.\n\n\"I'll get him,\" Bill shouts to you. \"Cover me.\"", "action_results": [{"action": "Fire at the remaining lawman", "result": "\"Ok\" you shout and as Bill rides back towards your brother you steady your horse and fire at the lawman. Your first shot misses but the second hits him in the head and he falls to the ground. As Bill pulls alongside your brother scrambles onto the back of his horse and turning about he joins you in galloping down the street away from the lawmen who are firing at you.\n\nDynamite Dick has turned his horse around and is firing his pistol at the lawmen behind you to cover you. As you ride towards him a bullet whistles past you and hits Dick in the hand, knocking his pistol flying and severing two fingers. Dick screams in pain and turns away, joining you and your companions in riding away, safely escaping from town and the ambush.", "action_results": [null]}, {"action": "Ignore Bill and ride back to rescue your brother", "result": "You ignore Bill and spur your horse back towards your brother. Firing from behind you Bill shoots the remaining lawman in the head and as you pull up alongside your brother you turn your horse around while Bill scrambles onto the back of it. Once he is safely on you spur your horse down the street and together with Bill Doolin ride away from the lawmen who are firing at you.\n\nDynamite Dick has turned his horse around and is firing his pistol at the lawmen behind you to cover you. As you ride towards him a bullet whistles past you and hits Dick in the hand, knocking his pistol flying and severing two fingers. Dick screams in pain and turns away, joining you and your companions in riding away, safely escaping from town and the ambush.", "action_results": [null]}]}]}]}]}, {"action": "Go with the rest of the Gang to Ingalls", "result": "You join your brother Bill and fellow gang members Bill Doolin, Bitter Creek and Charley Pierce in heading down to Ingalls, a lawless community where you all feel safe and hidden. You spend the next six months hiding out and partying, an interlude only briefly ruined by the news that Ol Yantis was tracked down to his sister's home by two lawmen and shot dead while resisting arrest. By the summer of 1893 you are ready for action again and with a new gang.\n\n\nIn the last six months you and your fellow outlaws have recruited four new gang members, bringing your gang strength up to nine. There is Dynamite Dick, an explosives expert with an impressive nickname, Red Buck, a grim and dour man, Tulsa Jack, a good friend of Bill Doolin's and Arkansas Tom, a sharp-shooting well-dressed young man. Together the nine of you plan your first robbery in Kansas and in the summer of 1893 you strike.\n\n\nOne summer morning the nine of you board a train at Cimarron in Kansas and while the new recruits get the driver to stop the train and Bitter Creek and Charley Pierce guard the passengers you and the two Bill's make your way to the Express Carriage. You calmly empty the safe before you all dismount, run to your horses, mount up and ride away. On the ride you count the money you have stolen and find you have gotten away with $1,000, making your share $100.\n\n\nUnfortunately you do not get clean away, that afternoon as you are resting a posse of lawmen suddenly gallop over a nearby ridge. All of your mount up and firing pistols and rifles at each other you and your pursuers engage in a running battle for over a mile. There are no casualties on either side except Bill Doolin who is unlucky enough to be shot in the foot by a rifle shell, a painful but non-serious wound. Easily escaping the nine of you ride back to Ingalls unaware that an even deadlier enemy is in pursuit...", "action_results": [null]}]}]}, {"action": "Stay in the Territory with the rest of the Gang", "result": "Bill departs and the rest of you lie low for six months before making your move: one summer evening the nine of you ride into the little community of Red Rock and wait on the platform. Soon enough a train arrives but this one has all it's lights off and passes right by the platform without stopping, a very unusual thing. The next train does stop and you all climb aboard; while the others take care of the driver and passengers you and your brothers go to the Express Carriage.\n\n\nYou take the Express Guard hostage and go to rob the safe, only to discover there isn't one. Angrily you ask the Guard where all the money is.\n\n\n\"There isn't any,\" the terrified man replies nervously. \"The Southern Pacific have changed their policy because so many of their trains were robbed last year... now only Express Trains carry money and they're all heavily guarded. The only cash we keep on the Passenger Trains now is petty cash.\"\n\n\nGrat swears angrily but there is nothing you can do but grab the petty cash, about $50 altogether, and leave when the train stops. After riding a safe distance to avoid pursuit a lively debate ensues in the Gang over what to do now: Bill Doolin thinks you all should rob trains outside the Territory while others think you should try robbing banks instead. The discussion ends with Bob declaring you will all try robbing one of these Express Trains in the Territory next month, despite the armed guards the messenger spoke of...", "action_results": [{"action": "The Pryor Creek Train Robbery", "result": "On the chosen day you all gather at the tiny train station at Pryor Creek to await the arrival of the train. You all have very specific jobs: Bill Power and Dick Broadwell are to board the driver's compartment immediately and stop him moving the train from the platform. Bitter Creek, Bill Doolin and Charley Pierce are to board the Passenger Carriage and keep everything under control there. Your brothers Bob, Grat and Emmett will board the Express Carriage and try to capture the armed guards before robbing the safe. You need to choose which group you will join.", "action_results": [{"action": "Join Bill and Dick in securing the Driver's Carriage", "result": "As the train stops you join Bill and Dick in climbing into the driver's compartment where you draw your pistols. The driver turns to complain but freezes when he sees your guns, you order him to put his hands up and leaving the other two to guard him you return to the doorway and watch what is happening on the platform. Two male passengers have got off the train while further down the platform seven armed guards have stepped off the train and are walking up and down smoking and stretching their legs.\n\n\nEverything seems to be going like clockwork until the guards turn to get back on the train. A shot is fired, hitting one of them and then pandemonium erupts as gunfire explodes from the train, Both the passengers on the platform and a second guard are hit and fall down as the remaining guards run for cover. From the door of the driving compartment you fire your pistol at the fleeing guards, who take shelter and start to return fire.\n\n\nWhen the guards start firing back you step back inside the driver's compartment and push the door shut. \"Time to go I think,\" you tell your companions and opening the door on the other side you jump down off the train. Further up you can see your fellow gang members doing likewise and together you race across the tracks, scramble up onto the platform on the other side and flee the station to where you have left your waiting horses, all the while keeping the train safely between you and the armed guards.\n\n\nThe robbery has been a complete success and you have all escaped with $17,000, a great amount which makes your share $2,000. You are all elated until the next day when you read news of the robbery in the papers. Apparently four people were shot during the brief gunfight: two guards and the two male passengers who are both doctors, one of which has died from his wounds. The papers name you and your brothers as the killers and have posted Bounties of $5,000 on each of your heads. Bob is furious.\n\n\n\"What absolute imbeciles shot these two doctors?\" he demands. \"If there is one thing that will make the law come after us now it is this! Who can't tell the difference between armed guards and a couple of civilians?\"\n\n\nIt transpires that Bitter Creek, Bill Doolin and Charley Pierce were the ones who shot the doctors. Apparently they were in the Passenger Carriage when they heard the gunfire and shot the first people they saw on the platform. Bob angrily attacks them while the three outlaws defend themselves equally furiously.\n\n\n\"I think it's better we don't see much of each other for now,\" Bob decides. \"I don't want you boys in on my next job, go and hide out at Ingalls and I'll tell you when I want you. Go on, go. I have plans to beat anything Jesse James ever did: we're going to rob two banks at once in broad daylight in the town of Coffeyville, Kansas. I don't want you boys to have anything to do with the money we get from this thing, we'll join you after.\"\n\n\n\"Well that's just fine Bob,\" Bill Doolin says cooly. \"It sounds too risky anyway.\"\n\n\nFrowning you consider whether to join your brothers in the Coffeyville Raid or lie low with Doolin and the others.", "action_results": [{"action": "Join Bob, Grat, Emmett, Bill and Dick in the Coffeyville Raid", "result": "On the chosen day, three months after the Pryor Creek Robbery, you and your five companions ride into the peaceful little town of Coffeyville. You already have a plan: to hitch your horses outside the town's two banks. While Bob and Emmett enter the first bank Grat, Bill and Dick are to enter the second bank and rob both, lock any staff and customers in the vaults, emerge at roughly the same time, mount up and ride out of town before the alarm is raised.\n\n\nAs you ride into town you are annoyed to see that the hitching posts outside the banks have been taken down for some street work, forcing you to leave your horses in an alleyway close to the banks. As you dismount and walk towards the bank your are uncomfortably aware that a lot of people seem to be glancing at you, heavily armed as you all are with rifles and you with your two pistols. \"Ok boys, move smart and fast,\" Bob mutters. \"Who you joining Dan?\"", "action_results": [{"action": "Go with Bob and Emmett into the first bank", "result": "You and your brothers walk confidently into one of the town's banks to discover three cashiers sitting inside chatting and laughing. The laughter dies from their faces as you, Bob and Emmett draw your pistols and point them at the cashiers. \"This is a hold up,\" you declare. \"Keep silent and no one will be hurt.\" While Emmett guards the cashiers you and Bob swiftly empty the contents of the open vault into a sack. Everything is going according to plan.\n\n\nThen you hear the gunshots.\n\n\nThe windows of the bank you are in crack as bullets pound into them. \"You men in front of us,\" Bob barks, passing the sack of money to Emmett and grabbing a teller. \"We're going out the front.\" Each of you hold a teller in front of you and move towards the front door but several bullets break the glass, driving you back. \"Out the back,\" Bob yells. \"Quickly!\" Abandoning the tellers the three of you race out a back door and onto the street. The alleyway where you left the horses is some distance away. \"Go quickly boys,\" Bob orders as gunshots continue to ring out all around. \"I'll cover you.\"", "action_results": [{"action": "Help Bob hold the street", "result": "While Emmett hurries down the street you and Bob back towards the alley cautiously, guns in your hands. A citizen of the town steps out fo a doorway with a pistol in his hand, instinctively raising both your pistols you shoot him twice in the chest. As he falls a second man springs from cover and runs to the dying man's side. \"Stop,\" you shout but he ignores you. As he stoops and picks up the pistol you fire again, shooting him in the head. As you do a third man steps from cover and fires a rifle at you. The bullet hits you in the chest making you double up. Forcing yourself upright you fire several shots back with both pistols, hitting him multiple times and killing him.\n\n\n\"Come on Dan,\" Bob yells grabbing you, firing more shots. Turning you find you are near the alley entrance, Bill Power and another man lie dead near the entrance while Grat has taken shelter behind an oil drum, his clothes stained red from several wounds. \"Come on Dan,\" Bob yells again but the world is darkening and as Bob tries to help you he stumbles as he is shot. You reach the mouth of the alley before your strength gives way, collapsing to the ground you lie dead in the dust. Your brothers Bob and Grat die within feet of you from their injuries, the legendary Dalton Gang destroyed in this alley of death.", "action_results": []}, {"action": "Make for the alleyway with Emmett", "result": "You and Emmett take off running, your brother still holding the sack of money, while Bob fires his pistols at your pursuers down the street. Approaching the alleyway you see Bill Power and another man lying dead near the entrance, Grat has taken cover behind an oil barrel near the entrance and is firing down the street while behind him Dick Broadwell is clambering onto his horse, both men have been shot several times. Dick begins to ride away as you reach the alleyway. \"Keep going boys,\" Grat yells as you pass him.\n\n\nYou and Emmett make it to your horses, both miraculously without a scratch despite all the bullets whizzing around you. Glancing back you are startled to see Grat topple over dead. Bob is staggering towards the alleyway entrance clutching a wound in his side, behind him you can see three townsmen lying dead on the street. Just as he reaches the alley Bob falls to the ground. \"Bob,\" Emmett shouts and abandoning you he hurries to his brother's side.", "action_results": [{"action": "Follow Emmett to your brother's aid", "result": "You and Emmett run towards Bob but before you can get there someone fires a shotgun blast into Emmett's chest, knocking him flying to the ground. As you stop and turn towards Emmett the gunman fires a second blast into you, sending you flying back a full six feet before crashing into the dust of the alley. After a few more gunshots the town goes silent. You and your three brothers are all lying motionless in this alley of death.\n\n\nSomehow though you do not die. Though Emmett has suffered 23 separate injuries from the shotgun blast and you have even more wounds both of you somehow survive. Your brothers are not so lucky: both Bob and Grat die of their wounds moments after your injury, Bill Power and Dick Broadwell also do not survive the day. Four of the townsfolk lie dead. The sack of money lies between you and Emmett: it is picked up and carried back to the bank.\n\n\nAfter treatment for your injuries both you and Emmett receive life sentences in prison for your parts in the Raid. During your lengthy incarceration your other brother Bill teams up with Bill Doolin, Bitter Creek and Charley Pierce to continue robbing banks and trains. First Bill and then Bitter Creek and Charley Pierce are killed by lawmen... finally chance leads to you all being reunited.", "action_results": [null]}, {"action": "Mount your horse and follow Dick out of town", "result": "Abandoning your brothers you throw yourself onto your horse and spur it into a gallop. As you ride down the alley you glance back just in time to see Emmett shot down with a shotgun blast near a motionless Bob and Grat, all three of your brothers look dead. Swearing, with tears in your eyes, you spur your horse out of town and after Dick Broadwell. He is still riding his horse but gets slower and slower as you get closer. Just before you reach him he topples off his horse and lies motionless on the ground. Sure enough when you check him he is dead.\n\n\nThe Dalton Gang has been destroyed in Coffeyville and you are the only survivor.\n\n\nOver the next few weeks you go into hiding in the Indian Territory, trying to rejoin Bill Doolin, Bitter Creek and Charley Pierce. In newspapers you read how eight men died in the Coffeyville Raid including your brothers Bob and Grat. Emmett miraculously survives 23 bullet wounds to serve a life sentence imprisonment for bank robbery. Finally you manage to reconnect with Bill Doolin and arrange a meeting with him and the remaining members of the gang, as well as your brother Bill who has travelled over from California when he read the news of Coffeyville. You all reunite in the small town of Ingalls.", "action_results": [null]}]}]}, {"action": "Go with Grat, Bill and Dick into the second bank", "result": "You and Grat lead Bill and Dick into one of the town's banks to find three cashiers inside. \"Throw up your hands and don't move,\" you bark. \"We're robbing the bank.\" While Bill and Dick hold the tellers hostage you and Grat go over to the vault to discover the door is closed and locked. \"Open it,\" Grat orders the tellers. \"We can't,\" one of the men says nervously. \"It's a time lock. You'll have to wait ten minutes.\" You and Grat glance at each other and sigh.\n\n\nSuddenly gunshots explode through the bank's windows, one of them hitting Dick in the right arm. \"I can't use my arm,\" Dick exclaims, holding his arm in his other hand. \"It's no use, I can't shoot anymore.\" \"Come on boys, we need to get out of here,\" Grat yells. \"Not without the money,\" Bill declares and begins riffling the counter, throwing what notes he can find into a small sack. While he is rifling Grat and Dick start running out the bank's front door.", "action_results": [{"action": "Join Bill in grabbing the money", "result": "You and Bill grab handfuls of money off the counter and throw it into the back before following your companions out the front door. As you emerge from the bank several waiting townsfolk open fire on you. Bill is hit in the head and falls dead to the ground, a moment later you are shot through the heart and fall just in front of him. You and Bill are the first of eight men to die on this bloody day, moments later your brothers Bob and Grat are killed as well in this last battle of the Dalton Gang.", "action_results": []}, {"action": "Follow Grat and Dick out the door", "result": "You run after Grat and Dick, both stumbling as they are shot repeatedly, blood and dust flying from their clothes. Somehow you are unhit and the three of you make it to an alleyway where Grat sinks down behind an oil drum and starts firing his pistol down the street while Dick runs on towards the horses. Glancing back you can see Bill Power lying dead in the street, a bullet in his brain, while Emmett is running towards the alleyway from the right followed by Bob who is walking backwards, firing his pistol as he does. \"Go on Dan,\" Grat says hoarsely to you. \"I'll cover them.\"", "action_results": [{"action": "Follow Dick to the horses", "result": "You follow Dick to the horses and both of you mount up, though your companion is bleeding heavily from his wounds. A glance back shows that Emmett has reached the alleyway and as you look Grat shoots down an approaching lawman of the town. As everything seems to be in order you spur your horse into life and gallop out of town with Dick. Unfortunately everything is not in order: Bob and Grat never make it out of the alleyway alive and Emmett is shot down too.\n\n\nYou cannot know this as you ride away as you are more concerned with Dick's condition: he reels alarmingly in the saddle and a short way from town he topples from his horse to the ground. Dismounting quickly you find he is dead of blood loss from his wounds. A quick glance up shows you that none of your brothers have made it out of town. Your heart sinking you mount up and ride on rapidly, the only one to escape this ill-fated raid.\n\n\nLater, over the coming weeks spent in hiding in the Indian Territory, you read how eight men died in the gunfight in Coffeyville including your brothers Bob and Grat. Emmett survived 23 separate gunshot wounds only to be sentenced to life imprisonment for his part in the raid. After weeks of searching with vain you are able to reunite with Bill Doolin, Bitter Creek and Charley Pierce: they have already arranged a meeting with your brother Bill in the hideout town of Ingalls.", "action_results": [null]}, {"action": "Help Grat cover Bob and Emmett", "result": "You run back and join Grat in firing from cover down the street As three men approach the alley down the street you fire your pistols at them, hitting and killing a lawman leading the trio. The other two men fire back, one bullet hitting Grat and the other hitting you. Both of you fall to the ground as Emmett runs by and Bob staggers up, bleeding from his own wound he topples to the ground near you. A moment later you hear a shotgun blast and then Emmett is down as well. You and your brothers Bob and Grat die of your wounds in that alleyway of death.", "action_results": []}]}]}]}, {"action": "Hide out with Bill, Bitter Creek and Charley in Ingalls", "result": "You and your friends go to hide out in the little community of Ingalls and pass the next three months drinking and relaxing, using the money from the Pryor Creek robbery to pay your way. Much of the time you spend with a friend of Bitter Creek's called Ol Yantis, a softly spoken cotton farmer. The five of you spend your time relaxing and hiding out and for a time there are no worries on your horizons.\n\n\nThen comes the news of Coffeyville.\n\n\nYou read in the newspapers how Bob, Grat and Emmett, together with Bill Power and Dick Broadwell, try to rob two banks at the same time in the city of Coffeyville. The alarm is raised and a massive gunfight breaks out that leaves eight men dead including Bob, Grat, Bill and Dick while Emmett survives despite 23 individual bullet wounds and is imprisoned for life. Your brothers Bob and Grat are dead, Emmett is imprisoned and for a time you are all absolutely stunned, completely unsure what to do.\n\n\nThe deaths of your brothers only commits you further to your life as an outlaw. After sending a telegram to your brother Bill to join you in the Territroy you remain brooding for days. It is finally Bill Doolin who breaks you out of it. \"We'll show America we're not done yet,\" he tells you firmly. \"We'll hit a bank in Carney, we'll make Bob proud. We'll keep on and make the Gang he built the best and most famous there ever was.\" Grimly you agree.\n\n\nOne week after your brothers were killed at Coffeyville you and your companions ride into the town of Carney. While Ol guards your horses outside the door the rest of you go inside; Bitter Creek and Charley guard the lone cashier while you and Bill empty the vault before locking the cashier inside and riding off. It is all too easy, a simple robbery that netted the gang $1,500, making your share $300. After receiving a telegram from your brother Bill you ride back to Ingalls to meet him.", "action_results": [null]}]}, {"action": "Join Bitter Creek, Bill and Charley in securing the Passenger Carriage", "result": "As the train stops you join Bitter Creek, Bill and Charley in climbing into the Passenger's Compartment, passing two men on the way who are stepping out onto the platform. As soon as you are in the Compartment you all draw your pistols and you tell everyone to keep calm and remain in their seats. Peering through the windows you can only see the two men on the platform who have halted just outside the train and seem to be talking.\n\n\nSuddenly a gunshot rings out from further down the train and you all jump. Moments later a volley of gunshots rings out, raising their pistols Bitter Creek, Bill and Charley all start shooting out the train windows at the platform as well. The two men on the platform start running and someone yells for you to shoot them before they get to cover.", "action_results": [{"action": "Fire at the fleeing men", "result": "You fire your pistol rapidly at the two fleeing men, hitting them both in the back and knocking them both to the ground. More windows shatter as shots are fired back from somewhere on the platform, the bullets mostly hitting the roof or passing through the windows on the other side of the Compartment, though they are enough to make you all duck. \"Let's go,\" Bill Doolin shouts and hurrying at a crouch you throw open the compartment door that doesn't face the platform and one by one you all jump down to the ground. Up and down the train you can see your fellow gang members doing likewise and together you race across the tracks, scramble up onto the platform on the other side and flee the station to where you have left your waiting horses, all the while keeping the train safely between you and the armed guards.\n\n\nThe robbery has been a complete success and you have all escaped with $17,000, a great amount which makes your share $2,000. You are all elated until the next day when you read news of the robbery in the papers. Apparently four people were shot during the brief gunfight: two guards and the two male passengers who are both doctors, one of which has died from his wounds. The papers name you and your brothers as the killers and have posted Bounties of $5,000 on each of your heads. Bob is furious.\n\n\n\"What absolute imbeciles shot these two doctors?\" he demands. \"If there is one thing that will make the law come after us now it is this! Who can't tell the difference between armed guards and a couple of civilians?\"\n\n\nIt transpires that you, Bitter Creek, Bill Doolin and Charley Pierce were the ones who shot the doctors. Bob angrily attacks the four of you while you all defend yourselves equally furiously.\n\n\n\"Bill, Bitter Creek, Charley, I think it's better we don't see much of each other for now,\" Bob decides. \"I don't want you boys in on my next job, go and hide out at Ingalls and I'll tell you when I want you. Go on, go. I have plans to beat anything Jesse James ever did: we're going to rob two banks at once in broad daylight in the town of Coffeyville, Kansas. I don't want you boys to have anything to do with the money we get from this thing, we'll join you after.\"\n\n\n\"Well that's just fine Bob,\" Bill Doolin says cooly. \"It sounds too risky anyway.\"\n\n\nFrowning you consider whether to join your brothers in the Coffeyville Raid or lie low with Doolin and the others.", "action_results": [null, null]}, {"action": "Hold your fire", "result": "You hold your fire while your companions fire their pistols through the windows, hitting both men who fall face-first onto the platform. More windows shatter as shots are fired back from somewhere on the platform, the bullets mostly hitting the roof or passing through the windows on the other side of the Compartment, though they are enough to make you all duck. \"Let's go,\" Bill Doolin shouts and hurrying at a crouch you throw open the compartment door that doesn't face the platform and one by one you all jump down to the ground. Up and down the train you can see your fellow gang members doing likewise and together you race across the tracks, scramble up onto the platform on the other side and flee the station to where you have left your waiting horses, all the while keeping the train safely between you and the armed guards.\n\n\nThe robbery has been a complete success and you have all escaped with $17,000, a great amount which makes your share $2,000. You are all elated until the next day when you read news of the robbery in the papers. Apparently four people were shot during the brief gunfight: two guards and the two male passengers who are both doctors, one of which has died from his wounds. The papers name you and your brothers as the killers and have posted Bounties of $5,000 on each of your heads. Bob is furious.\n\n\n\"What absolute imbeciles shot these two doctors?\" he demands. \"If there is one thing that will make the law come after us now it is this! Who can't tell the difference between armed guards and a couple of civilians?\"\n\n\nIt transpires that you, Bitter Creek, Bill Doolin and Charley Pierce were the ones who shot the doctors. Bob angrily attacks the four of you while you all defend yourselves equally furiously.\n\n\n\"Bill, Bitter Creek, Charley, I think it's better we don't see much of each other for now,\" Bob decides. \"I don't want you boys in on my next job, go and hide out at Ingalls and I'll tell you when I want you. Go on, go. I have plans to beat anything Jesse James ever did: we're going to rob two banks at once in broad daylight in the town of Coffeyville, Kansas. I don't want you boys to have anything to do with the money we get from this thing, we'll join you after.\"\n\n\n\"Well that's just fine Bob,\" Bill Doolin says cooly. \"It sounds too risky anyway.\"\n\n\nFrowning you consider whether to join your brothers in the Coffeyville Raid or lie low with Doolin and the others.", "action_results": [null, null]}]}, {"action": "Join Bob, Grat and Emmett in securing the Express Carriage", "result": "As the trains stops you join Bob, Grat and Emmett in walking towards the Express Carriage. As you approach several armed guards step off of the train, chatting, smoking and laughing. You and your brothers instinctively tense but the guards pay no attention to you at all and instead walk about on the platform stretching their legs. Stepping into the Express Carriage you and your brothers find just one guard left inside, leaning back on a chair reading a book. He looks up to find your pistol pointing directly at his face.\n\n\n\"Don't move friend,\" you tell the guard quietly and he freezes. Disarming him you leave Emmett to guard him while you and Grat open the unlocked safe door and begin grabbing out handfuls of money and throwing them into a sack. Meanwhile Bob is standing by the open door looking out onto the platform when he suddenly swears and jumps back. \"They're coming back,\" he hisses. Drawing his pistol he takes a deep breath and then steps forward to the door, gun blazing. \"Give me a hand brothers,\" he shouts out. ", "action_results": [{"action": "Join Bob in shooting at the guards on the platform", "result": "You join Bob in the doorway and empty your pistol at the fleeing guards, hitting two of them who fall down onto the platform and lie still. The rest of them reach shelter at various points of the platform and begin firing back, prompting you and Bob to move away from the open door of the Express Carriage: bullets traveling through it hit the wall on the far side of the Carriage. Further down the train you can hear more gunfire as the rest of the Gang fire at the Guards. \"I've got the money, let's go,\" Grat shouts. Throwing open the compartment door that doesn't face the platform and one by one you all jump down to the ground. Further up the train you can see your fellow gang members doing likewise and together you race across the tracks, scramble up onto the platform on the other side and flee the station to where you have left your waiting horses, all the while keeping the train safely between you and the armed guards.\n\n\nThe robbery has been a complete success and you have all escaped with $17,000, a great amount which makes your share $2,000. You are all elated until the next day when you read news of the robbery in the papers. Apparently four people were shot during the brief gunfight: two guards and the two male passengers who are both doctors, one of which has died from his wounds. The papers name you and your brothers as the killers and have posted Bounties of $5,000 on each of your heads. Bob is furious.\n\n\n\"What absolute imbeciles shot these two doctors?\" he demands. \"If there is one thing that will make the law come after us now it is this! Who can't tell the difference between armed guards and a couple of civilians?\"\n\n\nIt transpires that Bitter Creek, Bill Doolin and Charley Pierce were the ones who shot the doctors. Bob angrily attacks thethree of them, who defend themselves equally furiously.\n\n\n\"Bill, Bitter Creek, Charley, I think it's better we don't see much of each other for now,\" Bob decides. \"I don't want you boys in on my next job, go and hide out at Ingalls and I'll tell you when I want you. Go on, go. I have plans to beat anything Jesse James ever did: we're going to rob two banks at once in broad daylight in the town of Coffeyville, Kansas. I don't want you boys to have anything to do with the money we get from this thing, we'll join you after.\"\n\n\n\"Well that's just fine Bob,\" Bill Doolin says cooly. \"It sounds too risky anyway.\"\n\n\nFrowning you consider whether to join your brothers in the Coffeyville Raid or lie low with Doolin and the others.", "action_results": [null, null]}, {"action": "Concentrate on helping Grat get all the money", "result": "You and Grat continue grabbing handfuls of money while Bob empties his pistol at the guards before jumping back as the guards begin firing through the open door,bullets hitting the wall on the far side of the Carriage. Further down the train you can hear more gunfire as the rest of the Gang fire at the Guards. \"I've got the money, let's go,\" Grat shouts. Throwing open the compartment door that doesn't face the platform and one by one you all jump down to the ground. Further up the train you can see your fellow gang members doing likewise and together you race across the tracks, scramble up onto the platform on the other side and flee the station to where you have left your waiting horses, all the while keeping the train safely between you and the armed guards.\n\n\nThe robbery has been a complete success and you have all escaped with $17,000, a great amount which makes your share $2,000. You are all elated until the next day when you read news of the robbery in the papers. Apparently four people were shot during the brief gunfight: two guards and the two male passengers who are both doctors, one of which has died from his wounds. The papers name you and your brothers as the killers and have posted Bounties of $5,000 on each of your heads. Bob is furious.\n\n\n\"What absolute imbeciles shot these two doctors?\" he demands. \"If there is one thing that will make the law come after us now it is this! Who can't tell the difference between armed guards and a couple of civilians?\"\n\n\nIt transpires that Bitter Creek, Bill Doolin and Charley Pierce were the ones who shot the doctors. Bob angrily attacks thethree of them, who defend themselves equally furiously.\n\n\n\"Bill, Bitter Creek, Charley, I think it's better we don't see much of each other for now,\" Bob decides. \"I don't want you boys in on my next job, go and hide out at Ingalls and I'll tell you when I want you. Go on, go. I have plans to beat anything Jesse James ever did: we're going to rob two banks at once in broad daylight in the town of Coffeyville, Kansas. I don't want you boys to have anything to do with the money we get from this thing, we'll join you after.\"\n\n\n\"Well that's just fine Bob,\" Bill Doolin says cooly. \"It sounds too risky anyway.\"\n\n\nFrowning you consider whether to join your brothers in the Coffeyville Raid or lie low with Doolin and the others.", "action_results": [null, null]}]}]}]}]}]}, {"action": "Stay in the Indian Territory with Black Face", "result": "You go with Black Face to the small community of Hennessey so Black Face can see a doctor. You both book into the town's small hotel but you have the misfortune of being seen in the street by someone who was on the Wharton train and recognizes you both as the robbers. They tell a lawman and a Deputy with a pistol in each hand is waiting for you when you both emerge from the doctor's surgery backed by an armed posse of a dozen men.You are both disarmed and immediately taken into custody.\n\n\nAs Hennessey doesn't have a jail the lawman puts you both on a train for Wichita, Kansas. When the train stops at the station the lawman gets off to make sure it is safe, giving a pistol to a second man to guard you. This man is one of the train staff and he puts the pistol on a table while he does some paperwork. Moving like lightning you spring to your feet, cross the room in great bounds and snatch the loaded weapon out of the man's grasp.\n\n\nYou and Black Face now have a gun but you haven't escaped yet: the only way out of the Baggage Car where you are being held prisoner is through the door that leads to the platform. A quick glance through the door shows you that the Lawman who captured you is standing alert on the platform keeping guard, a rifle in his hands. You quickly tell Black Face about the situation and Black Face thinks for a moment.\n\n\n\"One of us will have to jump out onto the platform and shoot that lawman dead,\" he says seriously. \"Who do you think is the better shot, you or me?\"", "action_results": [{"action": "Give the pistol to Black Face to kill the lawman", "result": "Black Face takes the pistol, takes a deep breath and then springs out of the carriage, gun firing. Moments later he is hit, you see him jerk as a bullet hits his chest but he keeps firing as he is hit twice more, the last shot knocking him onto his back. You peer cautiously out of the carriage but the lawman is down too, lying face down on the platform in a spreading pool of blood, his rifle lying at his side. Without hesitation you jump out onto the platform, scoop up Black Face's pistol and start running.\n\n\nEveryone gets out of your way as you race across the platform and through the train station, hiding your gun as you do so. Outside you quickly mount a horse tied in an alleyway and gallop out of town. Riding hard you escape back to the Territory, eluding any possible pursuit. You make for Hutchinson but by the time you get there Bob, Emmett and Bitter Creek are gone already. You hide out at the empty house and risk a visit into town to read the papers.\n\n\nAs you suspected both Black Face and the Lawman Ed Short die of their wounds. Your fellow gang members resurface when they and four new recruit rob a train in the Indian Territory. You reunite with them when they return to Hutchinson, flush with success from the robbery and pleased you escaped Wichita, even if Black Face did not. More good news is on the way: in California your brother Bill has been acquitted at his trial and Grat, who was found guilty, has escaped custody. Together with the four new gang members you all arrange a winter reunion in the Indian Territory.", "action_results": [null]}, {"action": "Jump off the train and fire at the lawman yourself", "result": "You take a deep breath and jump from the carriage, your pistol firing. You hit the startled lawman in the stomach with your first shot but he recovers quickly and shoots you through the chest. The force of the bullet is like a punch and knocks you a step backwards but you quickly recover and fire three more times, hitting the lawman again. He shoots you again through the chest and you fall onto your back on the hard wooden train platform. Black Face springs out to help you but the lawman shoots him too, hitting him in the head and Black Face falls across your legs, killed instantly.\n\n\nYou drop the warm pistol from your hand and raise your head slightly. The lawman is sinking to the ground and suddenly falls forward on his face. There, on that little wooden platform beneath the summer sun the three of you die: your enemy, your friend and you. Your attempt to escape custody has failed and you go the way of so many outlaws: cut down in your last gunfight. You are only the first of the Wild Bunch to fall: within years almost all of your companions will join you in death.", "action_results": []}]}]}, {"action": "Stay in California with Bill and Grat", "result": "The next morning Bob and Emmett say their farewells and set off by train for the Indian Territory. You, Grat and Bill settle down and mostly stay in the house, only Bill leaves to see to his law work. One night you are all talking in the kitchen when there is a knock on the front door. Bill goes to answer it and suddenly you hear yells and the sound of a scuffle. You and Grat spring to your feet as several armed policemen burst into the kitchen.\n\n\nYou have two choices. There is an open window in the kitchen overlooking an alleyway which you could run to and jump through, though it is perilously narrow or there is a second open door behind you that leads through to the dining room through which a back door leads into a yard that opens out onto a street, though it may be guarded. Grat, who is closer to the policemen, is already grappling with two of them, affording you a possible opportunity to escape.", "action_results": [{"action": "Jump out of the kitchen window", "result": "Racing to the window you spring up onto the kitchen counter, kick out the window and hurl yourself through it. You hit the ground beneath the window amidst a rain of broken glass but are on your feet in an instant, tearing down the alleyway and across a street. Running on foot you manage to reach the city's train station ten minutes later and catch the first train heading out of town. Sending off telegrams ahead you arrange to meet Bob and Emmett on the way.\n\n\nDays later, after taking trains across Nevada, Utah and Colorado you rejoin Bob and Emmett. By this time you have read in the papers that Bill and Grat have both been arrested back in California and charged with train robbery. You are all concerned by the news but Bob points out there is nothing you can do about it until you have some money so he arranges a meeting with two of his old friends in the Indian Territory.\n\n\nAt the little community of Wharton you find two men waiting at the train station for you. The first is a middle-aged man with a distinctive black gunpowder burn on his left cheek while his companion is shorter, handsome man with an impressive moustache. \"Boys, let me introduce you to Black Face Charley Bryant and Bitter Creek George Newcomb,\" Bob declares. Greetings are exchanged all round as you leave the station.\n\n\n\"Black Face and Bitter Creek were with me and Emmett in that little caper down in New Mexico that got us all written up as Outlaws,\" Bob explains to you. \"I've been thinking boys that it was time to show this country what real outlaws are like. We've already held up one train in California and I plan to hit more here in the Territory where they haven't got any real law; just miles and miles of wilderness to hide in and train lines running through it like arteries for us to cut. What do you boys reckon?\"\n\n\n\"After we read in the papers you boys were behind that hold up in California we were kind of hoping you would turn up with that exact offer,\" Bitter Creek declares with a grin. Black Face just grunts.\n\n\nOn the first day of May the five of you board a train at Wharton. While Black Face and Bitter Creek go to capture the driver and stop the train you, Bob and Emmett head straight to the Express Carriage. Catching the Guard by surprise you disarm him at gunpoint and empty the safe. As the train slows to a halt you jump off and race to a nearby copse of trees where you have left horses waiting, joined by your companions. Once you have ridden a safe distance you count the money and find you have stolen some $1700, making your share $300. It's not much but it's a start.\n\n\n\"Well boys it's not millions but the Territory isn't a wealthy place,\" Bob says thoughtfully. \"I reckon it's best if we split up. Bitter Creek, did you say you had some friends over in Hutchinson, Kansas? I reckon that sounds like a safe spot for us.\" Black Face coughs. \"I reckon I'm sick boys,\" he tells the rest of you. \"Got this damn cough that won't go away so I reckon I'd best get into Hutchinson here in the Territory and see a doctor I trust. Drop me a line when you want me and I'll join you boys again.\" Bob nods and you ponder who to join.", "action_results": [null, null]}, {"action": "Run through the dining room and out the back door", "result": "Racing through the dining room you reach the back door, throw it open and dash out... straight into the arms of three waiting policemen. After a brief struggle you are taken into custody and together with your brothers you are escorted off to the city's jail. It seems that posses used bloodhounds to track you to Bill's house and witnesses from the train soon identify you, Bill and Grat as three of the men who robbed the Alila Train. You are swiftly charged with armed robbery and murder. Bob and Emmett are soon identified as the other participants in the train robbery and don't help your case by putting a gang of outlaws together and robbing trains in the Indian Territory.\n\n\nThings are looking grim as six months pass and the date of your trial approaches. Bill remains optimistic, confident that his own skills as a lawyer, contradictions in the testimony of witnesses on the train and your own previous good reputations will exonerate you. Grat is less sanguine and urges that you join him in trying to escape from prison and heading out across America to go and join Bob, Emmett and their gang in the Indian Territory. You need to choose which course to follow.", "action_results": [{"action": "Join Grat in planning an escape attempt", "result": "You and Grat plan your escape attempts and make no effort to defend yourselves at trial, which results in you both being found guilty of train robbery and being sentenced to twenty years imprisonment. Put on a train bound for San Quentin and guarded by two armed deputies you see your chance to escape when one of your guards falls asleep and the other becomes engrossed in a conversation with a pretty lady sitting next to him.\n\n\nMoving with infinite care you lean forward, deftly remove the handcuff key from the sleeping guard's trouser pocket, undo your handcuffs and pass it to Grat to free himself. As the train passes over a bridge you both suddenly spring up, punch out the train window next to you and first you, then Grat throw yourselves through it to the astonishment of your guards. Falling through the air you both hit the water as the train rushes by above you.\n\n\nSwimming quickly to the shore, elated at your daring escape you set off cross-country. Stealing horses and robbing country folk along the way you manage to make it to the Indian Territory after a month long series of adventures. On the way you learn that Bill has been acquitted of all the charges against him thanks to his fantastic skills as a lawyer. As the year 1891 you, your brothers and Bob and Emmett's gang gather for a meeting in the Indian Territory.", "action_results": [null]}, {"action": "Join Bill in planning for your courtroom defence", "result": "You and Bill spend your time researching court cases and preparing for your trial, not helped by the fact that Grat makes a spectacular escape from custody by jumping through the window of a moving train and Bob and Emmett's gang in the Indian Territory rob another train. Notwithstanding these facts at the trial you and Bill absolutely shine, casting doubt on every single witness testimony from the train and illustrating countless cases when bloodhound tracking proved unreliable and misleading. It surprises no one when both of you are acquitted by the Jury after a short deliberation.\n\n\nYou and Bill celebrate in San Francisco and Bill makes plans to rebuild his shattered career as a lawyer when a telegram arrives from Bob congratulating you both on your good luck and telling you that Grat has succeeded in joining him and Emmett in the Indian Territory. He invites you and Bill to join him and his gang to for Christmas and New Year and with much reluctance you both make your way out to Indian Territory to meet your outlaw brothers.", "action_results": [null]}]}]}]}, {"action": "Stay where you are", "result": "Bob crosses to the open train door, raises his pistol, holds his breath while he takes careful aim and squeezes off a single shot. As the gun smoke rises he leans forward, peers into the darkness and draws back into the carriage. \"I've killed him,\" he says to the rest of you who stand there in stunned silence. After a few seconds Bob mutters \"come on\" and leads you all down the train.\n\n\nHiding your guns in your pockets you pass through the passenger cars, people looking at you curiously but perhaps sensing who you are no one interferes with you until you come to the corridor that leads to the express carriage. Bob has just started to open the door when a shot is fired, the bullet striking the thick wooden door. You all jump back immediately and Bob pulls the door shut again. There is a moment's silence then more shots are fired, the bullets striking the door in front of you.\n\n\n\"We'd better clear out of here,\" Bill mutters to the rest of you. \"That express guard is armed.\" Bob thinks for a moment and swears. \"We should have brought some dynamite,\" he mutters. \"It doesn't matter,\" Grat says quickly. \"The alarm is raised now boys, let's clear out.\"\n\n\nYou open a door and one by one you all jump off the train and run down the embankment. You have left five horses tethered in a copse of trees nearby and reach them after a swift five minutes run. Mounting up you ride off south. The robbery has been a complete failure: an engineer has been killed and you have been forced to flee without a single dollar. It is not an impressive debut.\n\n\nNews travels fast and by the time you make it back to San Francisco where Bill lives the news is in all the morning newspapers that an engineer was murdered on a South Pacific Train last night by a desperate gang of train robbers. You keep to Bill's house all day, each of you lost in your own thoughts about what to do now. The tension drags on until evening when after dinner Bob finally addresses the problem.\n\n\n\"I've been thinking and I reckon it'd be a lot safer if we all headed back to the Indian Territory,\" he says. \"We know it well and I don't reckon the law will find us there.\"\n\n\n\"I've got a law career here in California Bob,\" Bill says angrily. \"You forget, only you and Emmett are currently wanted for anything: Grat, Daniel and I aren't known to the law yet.\"\n\n\n\"How long do you think that will last with posses tracking us for the Alila Robbery?\" Bob demands.\n\n\nAn argument rages for the next few hours until it ends with Grat siding with Bill and both choosing to lie low in California while Bob and Emmett head back to the Indian Territory to hide out there until the heat dies down. What you'll do after a few months isn't discussed and you need to choose which pair of brothers to join.", "action_results": [null, null]}]}]}]}