{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=48393", "context": "", "first_story_block": "You can't remember when the world first started shaking, this little fragile patch of reality with so many cracks and such little support to keep it from breaking apart, but something was always going to give. It was just a matter of time. Nobody knew what really triggered the fall. Was it the breaking of the chains which kept your little quiet island floating in the sky all this time, imbued with the energy which kept it going for so long? Was it the final earthquake that split the lands of the humans, far below your precious little civilisation? Or was it something else?\n\nIt's easy to blame the humans who live beneath you, blame them for every little thing that goes wrong in the world. You're high enough to avoid the worst of the toxic gases that they leak into the atmosphere; you're smart enough to know not to drain the planet of what few resources remain to be cultivated; you're fast enough to hide yourself when they create a multitude of new dangers, unleashing terrors into the wild.\n\nThere is no war here, no government, no violence, no weapons or need to do anything but survive on your own and help each other out. The air is thinner here. Humans find it hard to breathe at this altitude without special equipment of their own. You pity them, but at the same time you admire them for being resourceful enough to create tools enabling them to come all the way up here. Then you remember what had to be sacrificed for such tools to be made, and you no longer admire them so much.\n\nThe island you've lived on for your entire life, along with your family and friends...is beginning to fall.", "action_results": [{"action": "Proceed", "result": "The wind howls in your ear as the island plummets towards the ground far, far below. No chains to keep you secure. No energy or power to keep you airborne, not anymore. Everything has been used up. This is where your home is, your village, your life; clusters of little grassy huts assembled in neat little circles, built to resist the strong winds of this height. Your people have long grown used to the lack of oxygen up here.\n\nIt isn't your home anymore.\n\nYou clutch onto the beautiful green grass covering the ground, grass which comes off in clumps in your hands. The air pressure is affecting the land and you watch in mounting horror as pieces of your home are savagely torn away from one another. You're not the only one, either; dozens of people are desperately trying to keep their houses secure before they too are ripped asunder. A doomed effort, because the gravitational pull is tremendous.\n\nYou do not see your parents anywhere. You fear they may have been dragged over the edge to their deaths, like so many others. This settlement is not equipped with appropriate equipment to land upon the human-inhabited grounds, thousands of metres below. Nobody would think to do anything like that.\n\nThe roar of the wind grows louder and louder in your ears, and the pressure on your body forces you into a narrow crawl. You cannot even raise your head, at the speed you are falling. Cracks appear in the ground around you, and you realise that this is no longer a case of keeping the island secure. The settlement is already done for. It will not survive.", "action_results": [{"action": "Crawl towards the ruins of your house nearby", "result": "You claw your way towards what used to be your personal residence. The roof has been torn off, the front door is hanging on by mere threads, and the interior has been devastated beyond recovery. Only pieces of shattered wood remain here now. The wind picks up, and for a second you almost lose your grip, but you somehow manage to make it inside. What remains of the wall here serves as a temporary shelter.\n\nEven so, the feeling in your gut tells you that the entire island is picking up more speed than before. The chains will not be repaired: it is not going to stop. Your chances of survival are slim at best.", "action_results": [{"action": "Keep your head down and seek shelter within the wall", "result": "You crouch against the inside of the wall, covering your head as the deafening noise continues all around you. Earlier on, you could hear the cries of the other people as they sought shelter within their fragile little huts, but now there is nothing to be heard but the endless howling of the wind. A chill seeps into your bones, but that is the least of your worries right now. This wall will not hold for long. You may as well be stranded in the middle of the ocean, clinging to a broken piece of driftwood as the storm rages on.\n\nAs if eager to give you confirmation of this, small cracks begin to spread out across the wall where you are hiding. The entire island is shaking, causing the cracks to widen.  ", "action_results": [{"action": "Stay against the wall", "result": "You stay braced against the wall, unwilling to move from this spot. This is your home. You will not abandon it, no matter what. More cracks appear all over the wall and start to crumble away; the wind whistles through the holes, and you can feel its chill upon the nape of your neck.\n\nIt’s too late to try and escape your fate now. Everything is already destroyed. Your possessions, your livelihood, the people you grew up and formed relationships with. What else is left? What else can the world take away from you now? Home is where the heart is. You close your eyes and start repeating that small phrase like a constant mantra: home is where the heart is, home is where the heart is, home is where the heart is –\n\nThe wall collapses at your back, nothing but rubble now. You feel a moment of terror before the wind picks up speed and you are thrown off your feet, clumps of wood falling uselessly from your bleeding fingers. You scream as you are flung from the surface of the island, spiralling towards certain death far below…", "action_results": [{"action": "Proceed", "result": "The pressure mounts in your ears with a fearsome intensity, and your entire world turns into a mass of endless sound and impending pain. You fall for what seems like forever, desperately clutching at any means of support, anything at all. There is nothing for you to catch on to. You fight to draw breath, but your stomach feels as if it is being squeezed to breaking point. It's a struggle to keep your eyes open; your vision blurs and pinpricks of light flash before you, multiplying in number as your speed of descent increases further...\n\nAs you fall, you catch sight of a heavy chain extending from the base of the island. You’ve never had the opportunity to see it up close before, and it’s sad that you can only do so now, in circumstances like these. The chain extends a short distance below the island before ending at a shattered black ring. Energy no longer flows through it to keep the island aloft. It has been split apart from some exterior force.\n\nConfused at what this could mean, you gasp for breath as you fall with the island. The last of your strength fades. Unconsciousness falls upon you, and what you know of your world is consigned to complete blackness.", "action_results": [{"action": "Proceed", "result": "You hear voices in your ear, indistinct faces in the gloom around you. There is no pain, but the wind is still quite fierce and there is only a tiny semblance of touch or feeling. You try to move, but your body will not obey you. Everything seems too bright and loud for you to make out anything but what is immediately nearby. Too much light. Too much volume. It is difficult for you to tell if you are dead or alive. Only the presence of pain suggests the latter.\n\n“Why, Mother?” a woman's voice whispers at your side. You are just barely aware that she is not addressing you, but someone else whom you cannot see. “Why do you choose to help her? Our burden is upon you, to cleanse us of our impurities and prolong our life force, but you lack judgement in this situation. You lack common sense. Do you seek to betray the rules and regulations of the Gahl'vuhr Sehn at its core? The Unworthy ones do not come to you. They do not know half of what you do for us. Yet now they fall from their sky islands, falling into nothing, now that the world finally stops turning. Leave her be. Leave her to die.”\n\nYou feel warm hands pull you free, and a sense of strange nostalgia washes over you. It’s difficult to describe, after all that’s happened, but some of the tension eases away. It feels like…it feels like home.\n\n“Do not save her, Mother,” repeats the voice unfalteringly. “The Unworthy ones do not wish for absolution. Do you understand? They do not want your blessing, Mother. Waste not, want not.” And then, in a fainter voice, so quiet that you could have sworn you imagined it, “This is not our way, Mother. This is not how we behave in the Gahl'vuhr Sehn. You will regret your folly.”\n\nThe howling has stopped. ", "action_results": [{"action": "Proceed", "result": "You awaken in more peaceful circumstances. No longer are you falling to your death at hundreds of miles an hour, deprived of everything you once held dear. For a split second, you are hopeful that everything which transpired was nothing but a cruel nightmare, designed to bleed you dry of all positive emotions. It certainly felt like a dream. As your surroundings become visible to you, however, you become painfully aware that this is reality.\n\nInstead, you find yourself lying on a comfy bed inside a small, square room, with no memory of how you got here. Evidently, somebody has gone to a lot of trouble to make you feel at home here. A glass of water is placed on the bedside table for you, and a few pillows have been propped up just underneath your head.\n\nDizzily, you start to sit up and are surprised to find that you can do so. You also discover that you appear to have sustained no physical injuries at all. How could you possibly be unhurt? Your first thoughts are that one of the foreign sky races must have treated you upon impact, but they are surely too far away to have reached you in time. Your island was quite isolated from other land masses and never received many foreign visitors or travellers. Could it be that you never hit the ground at all?\n\nPerhaps this is the afterlife, and you are to be judged for your transgressions in the events leading up to your death. In any case, you will not find out by simply lying in this bed all day. You feel well enough to get up and walk about now, so perhaps it is time to explore your surroundings in some more detail. You still do not know where you are.\n\nAs you start to get up, there is a vicious snarl from the corner of the bedroom.\n\nWith a start, you realise that you are not alone. A green-skinned muscular creature is glaring at you from a short distance away, sporting sharp claws, four arms, and a barbed tail. It is much bigger than you are and seems to be sizing you up. A mutant? You can’t think of what else to call it. There are tales of sky races long ago which were said to engage in such experiments, creating their own warped definition of new life…\n\nFortunately for you, the mutant is confined within a large iron cage. It shouldn’t be able to get out. You eye it warily and quickly move past it.", "action_results": [{"action": "Inspect the mutant further", "result": "The mutant snarls at you intelligibly as you approach it. With a body composition like that, you doubt that this creature evolved naturally; no, it was likely the result of a hideous experiment with organic matter and some unknown toxic material. That’s your best guess, really, but you’re still at a loss to explain why your apparent rescuers put you in the same room as this vicious beast. The mutant seems to have been in this cage for a very long time.\n\nYou peer at it curiously through the bars, and the mutant suddenly slams all four of its claws into the cage. That makes you jump a little, but the door of the cage is quite sturdy and refuses to budge, no matter how much the creature bashes at it. It’s not going to escape any time soon. A padlock on the cage door also prevents you from letting it out, just in case such a thought passed through your mind.", "action_results": [{"action": "Search the room for valuables", "result": "You make a quick search of the bedroom, being careful not to stray too close to the mutant’s cage, but there doesn’t seem to be much of value here. A wardrobe has been placed against the wall, but contains only foul-smelling rags which are filled with holes. You consider tearing off a fragment of your bedsheets instead, but decide against it once you consider that your situation might be the outcome of limited hospitality.\n\nAfter a few more minutes, you do find a strange scroll under your bed. It is written in a language that you do not understand, if it is a language at all; strange symbols and archaic runes cover the wrinkled paper. For now, you decide to take it along with you.\n\nAs you pick up the scroll, the mutant watches you with a baleful glare. It lets out a long hiss and the skin on its body changes colour to an angry red.", "action_results": [{"action": "Inspect the mutant further", "result": "The mutant snarls at you intelligibly as you approach it. With a body composition like that, you doubt that this creature evolved naturally; no, it was likely the result of a hideous experiment with organic matter and some unknown toxic material. That’s your best guess, really, but you’re still at a loss to explain why your apparent rescuers put you in the same room as this vicious beast. The mutant seems to have been in this cage for a very long time.\n\nYou peer at it curiously through the bars, and the mutant suddenly slams all four of its claws into the cage. That makes you jump a little, but the door of the cage is quite sturdy and refuses to budge, no matter how much the creature bashes at it. It’s not going to escape any time soon. A padlock on the cage door also prevents you from letting it out, just in case such a thought passed through your mind.\n\nThe mutant's skin has now changed to an angry red colour. Even though the cage is holding it back, you're wary about spending any more time in this room.", "action_results": [{"action": "Ignore the mutant and leave the bedroom to find out where you are", "result": "You push open the door and step outside to find yourself in a narrow corridor which extends both left and right. To the left, you feel a gust of wind blowing, rustling through your hair softly. The sensation is not unpleasant. Perhaps there is a window open in that direction. To the right, you can hear the voices of people talking and laughing, though you are not close enough to hear exactly what they are saying. It is possible that they are your rescuers, but you cannot tell for sure. ", "action_results": [{"action": "Go left where the wind is coming from", "result": "The wind grows stronger as you follow the corridor around the corner, towards a set of stairs which lead to the upper level. You’re not quite sure where you are, exactly. You can only assume that you have been taken to somebody’s home, perhaps another faraway settlement, but you must surely be a long way from home. At least, where your home used to be. It doesn’t explain the presence of the mutant in your room, however, so you can only hope that your hosts are not unpleasant company.\n\nYou climb up the stairs to find yourself...staring out across open skies. Clouds can be seen on the horizon, clustered in a never-ending sea of blue which surrounds you for miles and miles as far as the eye can see…\n\nThis is no ordinary residence. This is no house. You’re not even on ground level. You are standing on the upper deck of a fully functioning airship! No wonder the wind was so strong up here: you must be hundreds of metres above sea level...\n\nYou’ve never been on an airship before, but you have seen plenty of them at the island where you lived all your life. Some sky races use these aerial vessels to transport goods and cargo between islands, others simply for transporting passengers. However, they can be slow and unwieldy to operate, and they are not especially durable; a fierce lightning storm can easily put an airship out of commission. For this reason, airships are usually designed for short voyages with a minimum of passengers.\n\nIt’s like something out of a dream. A real airship. You don’t know where this one is headed, but it has to be somewhere better than where you came from. Where do you want to go, after all? No, the bigger question is – what happened on the surface of the land far below? What prompted your island to fall in the first place?\n\nAs you gaze out thoughtfully across the open skies, there are footsteps behind you. You turn to see a young woman with long red hair cascading across her shoulders. There is a hint of recognition in her green eyes as she looks at you.\n\n“Vnwprthy,” she says in a clear voice. “Ypv brf thf Vnwprthy.” She beckons to you with one finger. “Cpmf. Cpmf wjth mf. Thf Cbptbjn wbnts tp spfbk tp ypv.”\n\nWithout another word, she turns on her heel and walks across the deck into another section of the airship. You do not understand her words, but it seems that she wants you to follow her.", "action_results": [{"action": "Follow the woman", "result": "Curious about what awaits you, you follow the red-haired woman across the upper deck and over to the other side. She leads you through another set of twists and turns in the corridors, down into another part of the airship. As you walk, you pass by several uniformed men who watch you with interest. They are not human, but then again...neither are you. Each of them appears to be armed to the teeth. Only now do you realise that they must be part of the ship's crew.\n\nAfter a few minutes, your guide leads you to a brass door which lies at the top of a final flight of stairs. There is a sign on top of the door, but you lack the knowledge to read the symbols and runes displayed there.\n\n“Gp jn,” she says, gesturing for you to enter. “Thf cbptbjn js wbjtjng fpr ypv.”\n\nAt her request, you push open the door and enter the room beyond.", "action_results": [{"action": "Proceed", "result": "You enter a large, lavishly-furnished room with all manner of alien devices mounted upon the walls, none of which you have seen the like before. One device consists of two gyros oscillating in synchronisation with each other, surrounded by a shimmering coil of energy; another instrument is similar to a telescope upon first glance, but appears to contain three lens of varying sizes at set intervals within its interior; a third device resembles a sundial, but is set into the ceiling and is covered by an array of round discs. Evidently, these instruments must be related to the operation of the airship. You’re not sure whether they are lifelike models of the real thing or not, but they do fascinate you.\n\nFrom the look of the place, you must be in the captain’s room. Sunlight pours in through two bay windows at the front, and a plain-looking bed is situated in the corner next to a pair of filing cabinets. This cabin seems to function as both a workspace and as living quarters. A large number of medals and trophies stand upon one of the cabinets.\n\nThe captain herself stands at the other end of the cabin behind a large desk, dressed in a red and purple uniform covered by various badges to indicate her high status. Much like the other crew members you saw earlier, she is not human and is vaguely reptilian in nature. Thick white hair flows down her back in an elegant ponytail.\n\n“Vnwprthy,” the captain says to you curtly as you enter. “Wflcpmf.”\n\nYou look blankly at her, wondering if you are about to subjected to yet another series of verbal questions in a language you do not understand.\n\n“My crfw tfll mf thbt ypv hbvf bffn bslffp fpr spmf tjmf, Vnwprthy,” she says, a disregarding tone in her voice, one used to command. “Nbtvrblly, ypvr prfsfncf hfrf hbs cbvsfd qvjtf b stjr bmpng vs. Whp brf ypv, bnd whfrf hbvf ypv cpmf frpm?”\n\nShe looks expectantly at you, frowning when she sees that you do not comprehend her words. With a sigh of disgust, the captain calls out in a sharp voice. The door of the cabin opens behind you, and a red-haired woman with a kindly face steps inside. She appears to be human. It’s strange, because you didn’t think humans could survive at these kinds of altitudes.\n\n“Hfllp,” the red-haired woman says to you gently. When you look at her in confusion, she tries again. “Cpmmpn Tpngvf…Vncpmmpn…He…Hell-oh? Hello? Is…is this better?”\n\n“Yes,” you say gratefully. “That’s better. I can understand you.”\n\nThe captain looks quite annoyed with the exchange as the red-haired woman speaks urgently to her. She turns towards you haughtily and clears her throat.\n\n“How about…this?” she says irritably. “You do not speak Common Tongue, or even Uncommon Tongue. A mix of Skylandish and Common Comorrah? Is this really how you talk to your brethren? You Unworthy ones are nothing but a constant pain.”\n\nSeeing that you understand her, she sags back against her chair with some relief. “I see that we have some communication in place at last. I am the captain of this ship. I will make a few things clear right now, Unworthy – I do not tolerate stowaways who drop out of the damn sky, taking up additional resources than I can spare for my crew. I don’t care if your island fell into the ocean. That’s no excuse to litter my ship with your worthless carcass. Damn nuisance, you people are!”\n\nShe throws up her hands – or rather, claws – in a gesture which suggests she likes to complain. “Are you aware that Mother Ghared chose to save your life?” The captain nods her head towards the young red-haired woman standing next to her. “As official members of the Gahl’vuhr Sehn, it is against our policy to save the life of an Unworthy. That’s you, by the way. Anybody outside our organisation is an Unworthy. I wasn’t happy about this at all. Mother Ghared is far too soft in these matters.”\n\n“Captain,” Mother Ghared says in a passive tone of voice, “I believe you did not bring the Unworthy up here to give her a tirade on her existence. She must be quite tired after her ordeal. Her island is not the first to plummet towards the ground, nor will it be the last. An exchange of information is required.”\n\nThe captain glares at you, but reluctantly acknowledges her words. “Very well,” she says. “Unworthy, you are free to ask me questions about your situation. But after you have finished, I have some important questions of my own.”  ", "action_results": [{"action": "Ask her about this airship", "result": "“You stand aboard an Auvahr-Tenur Airship, Year 2XX5, Model CXXP,” the captain says with a certain note of pride in her voice. “We Auvahrs are known well for our skill in ship construction, but see little sense in naming them. These vessels are not built for long journeys, as you may know. Although the Tenurs work on the advanced mechanisms, it is not mandatory to employ them as members of the crew and we carry no Tenurs aboard at this time.”\n\nShe appears to be referring to the races which populate the various sky islands. You have heard of the Tenur race before, but have never encountered Auvahrs before. For your entire life, you have been content to remain on your little island without once venturing out into the unknown. At times like this, you wonder if such a decision was altogether wise.\n\n“Where are you headed?” you ask.\n\n“Island 45H, according to the sky charts,” she answers. “You Unworthy ones do not name your islands, do you? How quaint. We can respect that, but it makes it harder for us to make a decent reference point. Among us Auvhars, the island is known as Majeruk.” The captain glances at one of the instruments in front of her. “We will reach Majeruk within the hour, at which point you can disembark and get off my damn vessel at last. Unworthy, we carry a decent amount of cargo on board and I will not have your presence contaminate the merchandise further. I will be glad to be rid of you.”\n\nThis news brings you some hope. It sounds as if you might have a chance to reach an island not unlike the one you left behind. That seems a sensible way to proceed right now: move on, rebuild, and re-settle upon a new island. It seems that not every island has met the same fate as yours, but how long will that last? When will the world stop shaking?", "action_results": [{"action": "Proceed", "result": "The captain of the airship waits patiently at her desk, awaiting your next question.", "action_results": [{"action": "Ask her about the people on board", "result": "“This airship carries only Auvahrs and one human,” she says dismissively. The captain appears to be referring to the races which populate the sky islands, though you have never encountered an Auvahr in the flesh before. “A standard crew, including mercenaries to guard the merchandise should we run into any trouble. We also carry a few valuable prisoners from the last island.” There’s a pause, and you wonder if she might be referring to the caged mutant you saw in your bedroom.\n\n“What about…” You voice the question which has been plaguing you, glancing over to the red-haired woman. “Mother Ghared? She’s a human.”\n\n“Quite right,” the captain replies. “Gahl’vuhr Sehn policy requires that every airship within their organisation carries a representative proficient in restorative abilities, to ensure survival of the crew in the worst-case scenario. It was Mother Ghared who saved your life, against my express wishes. She may be human, but she is a formidable representative of the Gahl’vuhr Sehn and can withstand the high altitudes, thanks to her rather abstract nature. If you wish to speak to her whilst you are here, you will do so only with the greatest of respect.”\n\nYou look towards Mother Ghared, but her expression betrays nothing of her inner thoughts.", "action_results": [null]}, {"action": "Ask her about the Gahl'vuhr Sehn", "result": "“I should have anticipated such a question from you, Unworthy,” the captain says, scowling. “The Gahl’vuhr Sehn is a governing body which oversees all operations and protocol undertaken by us Auvahrs, as well as Tenurs and some subspecies of Comors. They strictly enforce the rules and policies put in place to maintain some sense of order among the sky islands, although Unworthy ones such as yourself are unfortunately exempt from such regulations.\n\n“However, it has probably not escaped your notice that Gahl’vuhr Sehn has their work cut out for them at the moment. Just a bit of chaos going around, that’s all, thanks to what’s going on at the surface. I should also mention that just because myself and my crew are members of the Gahl’vuhr Sehn, we are not especially high-ranking in the organisation.” She cocks her head to one side. “Perks of the job, you might say. It’s probably the only reason why I let Mother Ghared save your skin.”\n\nYou have never heard of this Gahl’vuhr Sehn, not in all your years living at your island. Rules and regulations? You and your family have never needed such things. That’s the whole point of life in the sky islands. You are free. The thought of other people trying to limit such unrestrained freedom makes you feel rather worried about what might be really going on.", "action_results": [null]}, {"action": "Ask her about what happened to you", "result": "“Several hours ago, you fell out of the sky,” she says. “You weren’t the only one, either. There were entire islands collapsing to the left and right, and I had to get the ship out of the way to avoid being crushed by the next giant land mass. Mother Ghared…”\n\nMother Ghared steps forward at this point. “I was on duty at the front deck when you emerged,” she says calmly. “Unlike the others who fell, you had a slim chance of survival. I chose to use my abilities to slow your fall and take you on board. The captain did not approve of my decision, but I was able to persuade her to let you live until we reached the next island.”\n\nThe captain shakes her head in disgust. “Fat lot of good that will do us, Mother Ghared. If we’re unlucky enough to run into a Gahl’vuhr Sehn patrol when we reach Majeruk, they’ll want to know why we have an Unworthy on board.” She glares at you. “I’ll just tell them that you were a stowaway and that Mother Ghared refused to let me throw you over the side. Doesn’t matter if the world’s splitting down the middle or if islands are falling out of the damn sky – as far as the Gahl’vuhr Sehn is concerned, rules are rules. They must be followed. I’m so glad that the highest-ranking representative on board has decided to break them on my behalf.”\n\n“You may defer any responsibility to me, captain,” Mother Ghared says. “They will understand. Even the life of an Unworthy can give rise to many new members of the Gahl’vuhr Sehn. The future is always uncertain.”\n\n“That’s easy for you to say, Mother Ghared, but I like my future to stay as stable as possible.” The captain turns her attention back to you. “What else was there? Oh, yes. We brought you inside and had no choice but to put you in the cabin in which one of our prisoners was housed. Not the safest choice, but we are already stretched to full capacity here.”\n\nYou recall the mutant you saw in your room. “Prisoner?” you repeat.\n\n“Cargo is not the only thing we transport on this airship,” she states. “Occasionally we are given the task of transporting valuable and dangerous criminals to far-off locations – some islands are used for prisoners alone. “Prison islands”, we call them. Leave them there to rot away, stranded, where they can’t hurt anyone. Better than any of those primitive human jails, in my opinion.” She sits back in her chair. “I’m sure the prisoner didn’t bother you at all. It would be a pretty big problem if that one managed to escape. A single mutant has the means to contact many others of its kind, and those creatures carry grudges against their captors for years. Downright murderous, they are. That's why it's essential that we keep every single one of them locked up.”", "action_results": [null]}, {"action": "Ask her about the falling of the islands", "result": "The captain stares at you in amazement for a few moments. “You want to know why the islands are falling?” she asks. “Are you serious? Do you mean to tell me that you really don’t know what’s happening on the surface below?” She pauses, then shrugs as if it doesn't really matter. “That’s probably no surprise. None of you Unworthy ones take the time to explore your surroundings. You’re so satisfied with little things instead.”\n\nStanding up from her desk, she strides over to the door of the room and beckons to you with a single talon. “Mother Ghared. Unworthy. Both of you, follow me. We’re going up to the balcony so that I can educate this girl a little on the world around her.”\n\nCurious about what she has in mind, you start to follow the captain out of the cabin. Mother Ghared is just a step behind you. “Why are we going up to the balcony?” you ask. “What's this got to do with the - ”\n\n“You wanted to know why the islands are all falling, didn’t you?” she interrupts. “Well, I’m not going to tell you. it would take too much time to explain and I can’t remember all the fancy words that you Unworthy ones use. No, I’m going to show you instead.”", "action_results": [{"action": "Follow her up to the balcony", "result": "You follow the captain back onto the upper deck, onto a raised platform protected by a thick metal railing. Up here, you can see that a mystical crystalline device has been installed into the top of the airship. It seems to be made out of hundreds of tiny pieces of metal, interwoven together in a blend of silver and black. You cannot guess at its purpose, but the whole thing is humming with energy. Surely it must power the ship in some way.\n\n“The lens here will magnify any singular point on the surface, within a set range,” the captain explains. Behind you, Mother Ghared scrambles up next to her. “Right now, it’s focused on one of the human-inhabited regions far below us. Think of it as a giant magnifying glass, except that this one takes about two hours to realign the location. Not very practical, in theory. Usually, we just use it to pinpoint any turbulent weather conditions coming our way, but we don’t have a lot of contact with the people on the surface anyway.” She stands back, allowing you to take your place in front of the device. “Step up to the lens, Unworthy. Take a look for yourself at what’s happening on the surface!”\n\nWarily, you move forward as she requests and peer into the giant lens.\n\nThe first thing you notice is just how much detail the instrument is showing you. You can see houses down below. People. Trees. In fact, if you look in the right location, then you can see exactly what people are doing. To be honest, it makes you feel a little uncomfortable to be using a device that could technically be used to spy on people. You adjust the lens using the controls on the side, coming out of focus in order to try and look at something else in the same region.\n\nA black spot shows up on the lens.\n\nAs you focus in on the spot, you realise with alarm that you are looking at the ruins of a whole cluster of buildings. No, not just buildings. That’s…that's an entire town. Big enough to be a city, even. It’s just a burned-out hole in the ground. More black spots appear on the lens now, hundreds and hundreds of them, like termites crawling through the earth...\n\nThat isn’t all. Some of the black spots are surrounded by a sea of red. You move into sharper focus now, going a bit further up, and see that a red river is flowing from a…a mountain? No. it can’t be. That’s a volcano. That means…\n\nYour heart skips a beat as you swiftly scan the rest of the surrounding region, looking for any signs of life down there. There are still people there. They’re alive, but they’re not living. The earth has cracked all the way down the middle, right across the centre of the entire continent. It’s a crack which extends far and wide, beyond what the lens can see at this position.\n\nThe patch of red is accompanied by orange…and then blue. Are those flood waters? Just what is going on here? There’s so much going on at the surface that you can’t make head or tails about what you're really looking at, let alone grasp the bigger picture. Is it just a constant stream of natural disasters? All at once?\n\n“If you are looking for a specific, detailed explanation on what has happened,” the captain says, “then you are all out of luck. Nobody can tell you what happened at the source. If you were close enough to know for sure, then you would already be dead. What you can see before you is what's going on right now.” She gestures to the crack running down the middle. “That’s not the result of a normal earthquake. Nor do we believe that a number of volcanoes erupted all at once, purely by accident. Mother Ghared has offered her views on this.”\n\n“It is possible that there was a split in the energy flow between the human nations,” Mother Ghared ventures. “Everything feeds off energy. Input and output; produce, waste and conservation. Energy is what keeps your islands suspended in the sky. It’s what breathes new life into you. When there’s too much of it in one place, and too little in another…” She shakes her head sadly. “The Gahl’vuhr Sehn call it a “temporal discharge”, although that kind of phrase is largely inaccurate. It’s a measure of great force which saps an enormous amount of resources from the planet itself. The planet, of course, reacts accordingly.” She shrugs. “That’s my theory, but there are others. War could be the trigger. Mass deprivation of world resources. It was always going to happen one day. All we know is that there are no outside forces at work. Everything’s that happened…is something that we did nothing to avoid.\n\n“Needless to say, the effects upon the sky islands have been disastrous. The tremendous energy drain has disrupted the gravitational pull to an extreme, causing many of the islands to fall out of the sky. Countless airships have been leeched of their power, stranding them in open sky.”\n\n“Not on my watch,” the captain growls. “I make my own preparations. When our energy cells were depleted, I immediately had the helmsmen switch to our back-up source and keep us airborne. We should survive until we reach the next island. I don't care what those humans did on the surface, but they're not going to bring an Auvahr ship down.”\n\nMother Ghared's words swim through your head, but you are still staring at the scenes before you in a state of utter shock. Is this what’s happened to the world? Why? What could be worth this? But at the same time, you remember the experiences you had just days before the island started falling. Changes in the wind. Abstract extremes of temperature and air pressure. Unexplainable disturbances in the atmosphere which were thought to return to normal within the year.\n\nYou don’t know what to make of this. You don’t know what to make of any of this. How can you survive in a world like this, so chaotic and constantly at war with itself? Will you really be safe up here in the sky? The only plan you can think of is to find a new island to settle on, somewhere that you can start again. That would be nice. Wouldn’t it? Wouldn’t it be nice?\n\nWhere do you go from here?", "action_results": [{"action": "Proceed", "result": "Abruptly, the captain switches off the lens completely. The vision before your eyes turns to a sea of black, disorientating you momentarily.\n\n“Now that I’ve answered your questions, Unworthy,” she says testily, “I expect you to answer mine. Who are you, and where do you come from?”\n\nYou don’t see any reason to lie. “We do not name each other,” you say truthfully.\n\n“Excuse me?” The captain frowns distastefully. “You don’t have a name?”\n\n“Nobody is born with a name,” you answer. “Among humans, the parents name a child at birth regardless of whether they ask for it or not. It is not customary to use names among my people. Giving yourself a name only makes it easier for someone to gain power over you. Bearing in mind the kind of lives we lead with each other, it’s unnecessary.”\n\nShe swears under her breath, clearly put out by your words. “What am I supposed to call you, then? Pigeon Girl? You Unworthy ones are a strange lot. I’ll be damned if I let one on board my ship ever again if I have to put up with this nonsense! Now, tell me which island you came from!”\n\n“We don’t name our islands either,” you say, confused at the question. “For the same reason.”\n\nThe captain gives you a long-suffering look which suggests she is coming to the end of her patience.\n\n“I’m sure it doesn’t matter which island she came from, captain,” Mother Ghared reassures her. “You saw what happened. Her island must be at the bottom of the sea by now. Very few survived the fall.”\n\n“All right, all right. Maybe you’d just like to say that when I tell my superiors that I took in an Unworthy on board my ship. Gender? Female. Name? Non-applicable. Place of birth? Some island that fell out of the sky.” She stares at you angrily. “Listen, girl, you’re not making it easy for me to fill out the required paperwork. I’m not even going to ask how old you are, because you’d probably tell me that you only count backwards using the constellations at a certain time of the year. Can I at least get an iota of cooperation from you, Unworthy?!”\n\nAs she talks, your gaze is drawn to a strange sight upon the horizon. You hadn’t seen it before, but it looks as if it’s coming this way. Slowly, you step forward to peer at the foreign object approaching the airship.", "action_results": [{"action": "Take a closer look at the sight on the horizon", "result": "You see what appears to be a mass of black clouds on the horizon, lit up by a blaze of yellow and white flashes. The atmosphere around the airship is becoming increasingly turbulent, and you feel the vessel shake beneath your feet, making it difficult to keep your balance.\n\nThe captain turns to see what you’re looking at and swears out loud. “Just our luck,” she mutters. “Damn lightning storm could put us all out of commission.” Without hesitation, she starts to shout orders down to the crew below, reverting back to Common Tongue as she does so. “Bll hflmsmfn pn thf blfrt! Thfrf’s b ljghtnjng stprm bpprpbchjng thf shjp. Bfgjn fvbsjvf mbnpfvvrfs jmmfdjbtfly, pr wf wpn’t lbst fjvf mjnvtfs!”\n\nYou see the crew members scramble to their positions quickly, working amongst themselves to turn the ship around before it makes contact with the imminent storm. The captain turns to you. “We’re going to try and steer around the storm, Unworthy. It’s a big one, and with such short notice we might not be able to make it. But I’m confident I can get my ship through this. It's rare for a lightning storm of this size to appear without any warning, but...”\n\n“Is this to do with what's happening on the surface?” you ask worriedly. There was no sign of any such storm until now. The change in pressure was simply so drastic for this to happen naturally.\n\nThe look in the captain's eyes tells you the answer to that. “Unworthy, you’d better get yourself below deck where it’s safer,” she says grimly. “Just stay out of trouble. That way I won’t have to worry about protecting your neck.”\n\nWith that she rushes down the steps, still shouting orders as the storm draws closer. You hold onto the railing tightly as the ship starts to change course, but at this distance you have a feeling that it might be too late. A crackle of white-blue lightning flashes not too far from the vessel, and the wind is getting stronger.", "action_results": [{"action": "Stay on the upper deck, ready to help", "result": "You decide to remain on deck and see what help you can lend to the crew members. Mother Ghared disappears down below, and from here you watch as the helmsmen frantically try to turn the airship around as quickly as possible. Before long, the ship is so close to the storm that pieces of wood are being shredded away from the outside of the hull. You grip the railing tightly, fearing the worst…\n\n“Brbcf ypvrsflf!” the captain yells.\n\nThere is a horrendous tearing of wood and metal as the storm makes impact. Fearfully, you throw yourself clear from the balcony – and just in time, too. A bolt of lightning flashes down onto the crystal lens where you were standing, shattering it into a million pieces. The crewmen cry out as a violent gust of wind slams into the ship, powerful enough to tear the railings apart. Rain and sleet pours down to accompany it.\n\nDesperately, you search for somewhere to take cover from the storm. This was a bad idea. You shouldn’t have stayed up on deck in this kind of climate. There’s nothing you can do here –\n\nAnother bolt of lightning flashes down and rips straight through the mast.\n\nYou turn to see the entire weight of the mast fall towards the deck. To your horror, you see that the captain is right in its path, just seconds away from being crushed. None of the mercenaries are close enough to help her. No one is close enough to help…but you.\n\nEven if you did help her, it’s unlikely that you would be able to get out of the way in time.", "action_results": [{"action": "Push the captain out of the way", "result": "With your heart in your mouth, you race forward and shove the captain out of the way in the nick of time. You see her eyes go wide at her near escape. Then you look upwards and see wit horror that the mast is continuing to fall – right on top of you.\n\nFrantically, you start to move to avoid it, but you are already out of time. You have sacrificed what precious seconds you had to save the captain. Your legs are moving too slowly, far too slowly to avoid the heavy lump of wood which will crush you asunder. Everything seems to move in slow motion as the mast careens towards your helpless body –\n\n“Fprcf!”\n\nA shrill cry erupts from the other end of the airship. The mast shudders as an invisible force slams to it, snapping it further at an awkward angle. You can barely breathe as the fractured beam crashes through the deck barely a metre away from you. You’re alive. You can’t believe it.\n\nYou raise your head to see Mother Ghared frozen in position, her hands outstretched towards the fallen mast. Your knowledge of her abilities is still limited, but you understand that this is the second time she has saved your life. The captain is already on her feet, struggling to defend herself from another group of mutants.\n\nBefore you can move, you see Mother Ghared slump to the ground. She seems exhausted by the effort of stopping the heavy mast, and the energy drain is too much for her. You start to force yourself to your feet, knowing that if you spend too long dawdling then you won’t have long to celebrate. She needs help, and fast.\n\nThat’s when you hear the violent splintering sound below you.\n\nFearing the worst, you see that the heavy mast has in fact torn straight through the centre of the airship. It is in no condition to fly. The vessel has already been damaged by the attacks of the mutants, and you can only watch in horror as more and more cracks appear, joining together as one…\n\nThe airship breaks apart down the middle.\n\nYou see the mutants react with surprise as they start to plummet along with their half of the ship. Surprisingly enough, they can no longer fly. You’re not quite sure why, but you have a feeling that their wings from before were only temporary. In addition...part of the airship somehow remains airborne. You’re not in a position to question the laws of aerodynamics right now, but you need to act fast.\n\nYour half of the airship is currently airborne and in no danger of falling – or so you hope. The captain is next to you, slumped in a heap. The other half of the ship is about to plummet downwards, and you realise that Mother Ghared is still on that side. She’s unconscious and has no idea of what has happened.\n\nYou have a split second to decide whether to cross over the gap to Mother Ghared, or stay here with the captain. You have no idea what condition either person is in.", "action_results": [{"action": "Stay on this part of the ship with the captain", "result": "You can do nothing but watch as Mother Ghared is lost with the remaining half of the ship, falling away out of sight. With the last of the mutants gone with her, the bloody battle has ended. The upper deck is covered with the bodies of the dead, both mercenaries and mutants alike, and you find no survivors at all. It’s sad, really. The chaos on the surface has worked its way up here, even though you like to think of yourself as disconnected from the surface as possible…\n\nRight now, there is nothing powering the airship anymore. You are at the mercy of the wind, which blows the vessel this way and that, stranding you here in the middle of the open skies. You have no knowledge of how airships work, and feel you shouldn’t try to mess with the controls at all. You count yourself lucky that you stand upon a ship which is still airborne at all.\n\nFor now, all you can do is wait for the airship to drift; here, alone, among the mass of dead bodies on board. There are some supplies to keep you going, but they won’t last you very long. All of the food was stored in the lower deck, and that was the part of the ship which went down.\n\nThe captain is lying slumped in the middle of the deck, bleeding profusely from several wounds. She’s alive, but only just. A quick examination of her reveals that she hasn’t got long to live. Only her resilience has allowed her to last this long.", "action_results": [{"action": "Proceed", "result": "For the rest of the day, the damaged airship drifts upon the wind with no clear or definite destination. You face a lonely vigil here, one of the only survivors among numerous corpses. Whilst you’re here, you try to salvage whatever supplies you can, realising that you may be here for a long time if you are not fortunate enough to reach another island. There a few food packages in the captain’s room, and you are careful to consume only a small amount. These might be your only supplies for a long time…\n\nThe captain has not regained consciousness, at least not fully. She mumbles incoherently when you try to rouse her, but you know she is need of nutrition and medical attention. Unfortunately, there are no medical supplies in this part of the ship. Those were lost with Mother Ghared. Unable to wake her, you force some water through the captain’s cracked lips. She coughs and splutters but manages to get it down.\n\nAs you continue to drift, you see numerous other airships passing by. However…they give you no cause to celebrate. They, too, are drifting. The crew members on board are all dead, as you discover upon your first encounter; some have been attacked by mutants or aggressive races as happened with you, but in fact you find that the majority of them have been the victim of violent storms or run out of food and supplies completely. In more than a few cases, you find that there is a literal skeleton crew on board, as evidence by the remaining bones that greet you.\n\nThe world is falling apart around you, and you can do nothing to stop it. You are the only one out here who remains alive. The chaos on the surface must be affecting the skies, too, since many of the doomed ships here have been drifting for some time. How long has it been since your island fell? How long has the world been like this?\n\nHours pass, and you begin to feel that you will not survive. Your supplies will not last forever.\n\nIt is almost nightfall when you are confronted by a single ray of hope. At first, you think that your eyes are playing tricks on you. An island can be seen passing close to the airship.\n\nAn island. It seems like a miracle. There could be people there, people who could help you and give the captain the medical attention she so desperately needs. However, the airship isn’t headed directly for it – you will have to literally jump down onto the island, making use of the few tools still available to you.\n\nAs you draw closer, you realise that you do not recognise this island at all. You don’t know if the inhabitants there will be friendly or hostile to you: there might not even be any people living there at all. It could be filled with wild animals. If you choose to disembark, you will not be able to return to the ship, which will drift away and leave you stranded upon this isle.\n\nFurthermore, the angle at which you are approaching the island makes it impossible for you take anyone with you. You can jump down onto the surface yourself with some difficulty. This will mean that you will have to leave the wounded captain behind, ultimately sealing her fate.", "action_results": [{"action": "Disembark onto this new island, leaving the captain behind", "result": "You take one last look at the captain, who is lying on the bed in her cabin where you brought her up to rest. In the circumstances, she almost looks like she is sleeping peacefully. You shake your head and walk away from her, stepping over the corpses littering the deck. You can’t let this affect you. Sometimes you have to make sacrifices in order to survive.\n\nThe island below is coming up fast. If you don't jump now, then you're going ot miss your chance. Crossing your fingers, you grab hold of one of the mooring lines running down the length of the airship, and brace yourself. The wind rushes past you as you swing from the rope and jump from the vessel, feeling as if you’re putting your whole life at stake here. A single misstep could send you hurtling into the void…\n\nSoft vegetation cushions your fall as you land upon the island, winded but unhurt. You’re dangerously close to the edge but you’re safe, and that’s what matters. The entirety of the island stretches around you. It is as yet unexplored territory.\n\nBreathing a sigh of relief, you look up to see the airship drift away and out of sight. There’s no going back now.  ", "action_results": [{"action": "Proceed", "result": "You begin to explore the island you’re on, and soon find that it is rich in vegetation, full of nutritious fruits which grow upon the numerous trees populating the land, and carries a generous stockpile of resources. It’s a perfect haven for the weary traveller lacking in supplies. At once, you set to work gathering as much food as you can. The majority of the island is open grassland, though you find a small jungle in the southeast, so it's easy enough to traverse the space here. The wildlife here is not hostile to your presence, but from what you can see, you can easily live off the land here for many long decades of your life.\n\nFurther exploration reveals that there are no people inhabiting this island. None at all. That seems a little strange to you, that absolutely nobody has happened upon this place before. Any settler or explorer would immediately seize upon this haven of food and resources. It makes you wonder what secrets must lie here.\n\nThe amount of land here is vast, enough to build several towns a fair distance apart! For the next few weeks, you set out intending to explore the entire island. No passing airships or vessels are sighted anywhere near, and you realise with a heavy heart that you are probably stranded here. After all, you are in the middle of nowhere. The lack of people just makes it feel a bit…isolated.\n\nAt the end of the second week, you discover footprints. The footprints of people. Someone has been here before, although the marks are extremely faint and some part of you feels that you might have made them yourself. It’s hard to be sure.\n\nIt’s really very lonely here. How long are you willing to stay here, after all? How long will it take before you succumb to the ever-present loneliness? It’s been weeks. Maybe you could get used to it, but you can't say for sure…\n\nYou decide to follow the footprints you saw. Despite yourself, you’re intrigued about where they came from. You follow them all the way north, around the corner of the island, where they lead into the waters of a vast, beautiful lake. The sunlight paints its reflection upon the shimmering surface, and you shield your eyes from the glare. It’s really a mystery as to what happened to these people. Perhaps you don’t really want to find out.\n\nAside from the lake and the footprints, you’ve seen pretty much everything there is to see on this island. You also have no way of leaving. It’s not bad, really. There’s plenty of food to feed you for the rest of your days, and enough wood from the trees to construct your own shelter from the raging elements. The wildlife isn’t particularly hostile, so you would be quite safe from danger.\n\nYou could settle here – you really could. It’s just that…you’re the only one here, and it’s likely to remain that way. You’ve explored the island for nearly a month now, and there isn’t another living soul to be seen. Well, apart from the animals, but they don’t bother you. You could do anything here. You could run naked through the jungle and nobody would care, because there’s nobody here but you. You could dig a hole underground and lose yourself inside there, bury yourself alive, and scream as loud as you can. Nobody would care, because there’s nobody here but you. You could try to climb a tree, and then fall from a great height. You could break your legs from the fall and nobody would help you, because there’s nobody here but you...\n\nYou don’t cope well with loneliness.\n\nOne thing you can say about this island is that you’ve never seen anything like it before. It’s not going to fall, not like the other islands fell. You don't know why you think that, because there's no chain or energy flow keeping it aloft...but it's just your gut feeling. It's not going to perish like the others. You would be safe. If you settle here, then nobody will ever bother you again.", "action_results": [{"action": "Approach the lake", "result": "You walk up to the edge of the lake, searching for any sign of the people who came before you. Strangely enough, the footprints disappear into the water itself. After a moment’s hesitation, you wade into the lake a short distance, curious to find out what really happened here. The water is cool and fresh against your skin, as if keen to make you feel at ease.\n\nTo your surprise, you can hear the faint sound of beautiful singing coming from up ahead. You’ve never heard anything quite like it before. The words are difficult to make out, but you are captivated nevertheless by the atmosphere that it creates around you. Intrigued, you push further into the lake towards the source of the singing.  \n\nYou can make out the words a little clearer now. The water comes up to your waist.\n\n\n \n\n“Welcome, welcome, O traveller of the skies,\n\nDrink from the water, and burn out your life;\n\nOur singing shall ease all your worries and fears,\n\nCome closer, young traveller, for all you hold dear…\n\n\n \n\nThe voices fade away, and you are immediately struck by the impact of the silence all around you. Desiring to break the silence, you wade deeper into the lake’s waters. You haven’t heard the voice of another soul on this isle for nearly a month. As much as you hate to admit it, the loneliness is starting to get to you. It would be cruel to deprive you of such company.\n\nYou push further into the lake, not caring that your clothes are now drenched. From afar, you can hear the singing voices again. The water level comes up to your chest.\n\n\n \n\n“Rejoice, rejoice, O traveller of the skies,\n\nNo need for emotions, to laugh or to cry;\n\nSing with us here in the depths of the lake,\n\nNaught but your soul and your spirit shall we take…\n\n\n \n\nA strange feeling passes over you, and the singing cuts out. The water level comes up to your neck, turning into a murky green.\n\nDespite yourself, you do not feel that you are in any real danger. A low hum echoes from all around you, almost seeming to resonate from the waters of the lake itself. You can no longer see the edge of the lake anymore. You swim forward impatiently, still searching for the source of the voices…\n\n“What are you doing here?”\n\nThe face of a young woman emerges from the water in front of you. She appears to be vaguely human-like in appearance, but when she speaks, it sounds as if you are hearing her voice from underwater. Green hair flows down her back, and you see scales dotting her cheeks. An aquatic lifeform of some kind, perhaps. You didn’t know there were such people living in these waters.\n\n“You’re not one of us,” she says, a surprised look on her face. “Why are you alive? How can you possibly survive here?”\n\nHer questions baffle you. Before you can answer her, a second woman appears from the water, rising up to surface besides her companion.\n\n“Look, sister,” she whispers, pointing towards you. “It’s not a male this time. The men usually drown themselves trying to hear the song, but she…” She smiles faintly at you, pulling back a lock of matted grey hair to one side. You see the hint of fangs protruding from inside her mouth. “We haven’t had a female come here before. Maybe she could join us. Our song has more effect with greater numbers…”\n\n“Another sister?” the green-haired woman sounds dubious. “But we’ve never done that before. Is she…safe?”\n\n“Maybe not, but we can easily change her.” The other woman looks at you curiously. “Traveller of the skies, we are the inhabitants of this isle. Everything you see before you is our property and ours alone. Those who visit our land are drawn into the dark waters and consumed by our sisters and children, giving us new life. We share the energy among us and channel it into the land itself, replenishing it. We do not die. We do not perish. Settlers sometimes come here and seek to drain the resources from the island, but no man cannot resist our song. We take from them what they seek to take from us.”\n\nShe holds out a slim hand towards you. “Would you like to join us, traveller? Another female would be a welcome addition to our circle. If you become one of our sisters, you too will enjoy the privileges afforded to us all. However, I will not force you. Should you refuse, we will do you no harm, but please think very carefully before you answer.”", "action_results": [{"action": "Agree to join them", "result": "“Wonderful,” she says with a smile. “Then let me welcome you in the tradition of our people. A kiss is necessary to seal the agreement of mutual acceptance.”\n\nBefore you can do anything, the grey-haired woman moves swiftly through the water towards you and embraces you tightly. Her lips move onto yours in a surprisingly intimate fashion, and you can't quite keep the shock out of your eyes. You can feel your body changing as an effect of the kiss, as if your internal organs are slowly undergoing alterations of their own…\n\nScales appear upon your face, and the tone of your skin deepens to a pale blue. Your vision begins to go fuzzy, and a small measure of panic starts to take root in your mind. What's going on? What exactly have you agreed to do here? Before you, the woman mouths a single word before disappearing into the waters of the lake. You feel her grip your ankles tightly from under the surface...and pull you underwater with her.\n\nYou struggle to break her grip, but in moments you are forced under the surface. With a start, you realise that you can actually breathe underwater. What has happened to you? You feel as if you have gills in place, rather than lungs, and that your body has altered to that of an aquatic being. Fins and scales grow down your body, and any prior hunger or fatigue has lessened as a result. You don't know what significance this has, but…\n\nThe two women from before are swimming underwater with you and watching you closely. You see now that their bodies are just like yours, and that instead of legs they have a fish-like tail. Nothing of the sort has happened to you, however, so you are able to keep your legs for now.\n\n“Come, sister,” the green-haired woman says to you, much warmer to you now. She isn't a woman at all, you realise. A fish? A mermaid? “Come and meet the others. Let us share this land together, all of us.”\n\nYou swim after her, deeper and deeper through the pleasant waters of the lake. More and more of these mermaids appear from around you, watching you with interest and chatting amongst themselves. You didn't know that so many of these creatures were living down here. You thought the entire island was empty of any intelligent life...\n\nRight at the bottom of the lake, you discover a curious sight. A stone altar of some kind has been built into the lake bed, upon which a human body is tied. He seems to have been dead for some time. You watch as the mermaids surround him in a tight circle, singing in unison. It's almost as if they're singing to his corpse.\n\n“Come,” your companion whispers to you, beckoning you forward. “You should join in too.”\n\nCurious about this strange ritual, you stumble into the circle with her. The beautiful singing echoes all around you, and there is an addictiveness about the harmony of voices which is almost ethereal. You find yourself singing along, too, singing to the human corpse strapped upon the altar. It's mesmerising, hypnotic, and you soon lose yourself in the sound...\n\nYou don't know how long you've been singing for, but before long you start to feel a form of energy take place in your stomach. The feeling is not unpleasant. Euphoria washes over you as the energy grows and grows, giving rise to a greater volume of voices than before. Somehow, you and the other mermaids are leeching away the human's composition, converting it into something which will benefit everyone. The other mermaids are feeling it, too. You can see it in their faces. One of them smiles at you, understanding that you are with them, and you can't help but smile back.\n\nThe ceremony soon ends, and a new day starts anew. You spend all of your time with the community of mermaids around you, exploring the lake and occasionally going up to the surface when any new settlers think to land upon this island. Each time they do, you join in the singing with your sister mermaids, and watch as the men have no choice but to come deeper and deeper into the waters of the lake. They cannot resist the lure of your singing, and drown in the process.\n\nEvery week or so, you participate in another ceremony among one of the drowned men, devouring their body in order to give life back to the island. You feel that you are doing wonderful work here. The bodies of these humans can keep you living forever, really. This is a life that you can look back upon without feeling any regret.\n\nYou ultimately remain here with the other mermaids, here upon this seemingly deserted island, feeding upon any explorers foolish enough to try and settle here. The words of your sisters ring true. This is your land. You will not let anyone take it from you. This island belongs to you.\n\nYou live here in contentment, oblivious to the chaos going on in the surface. This island will not fall, not whilst you continue to sustain it with the bodies of fools.\n\nAfter falling from a great height, you have found a new place in life.", "action_results": []}, {"action": "Refuse", "result": "“You refuse?” The woman looks greatly disappointed, and a sigh escapes her lips. “That's a shame. The greatest wonders await you beneath the surface of this lake. I will withdraw my offer.”\n\nWith that, she turns away from you and disappears into the water with a small splash. Her companion stares at you for a moment and also vanishes underwater with her. You wait there for a few minutes longer, but neither of the women re-emerge. It seems that they have gone for good.\n\nCurious about her words, you try swimming underwater yourself to see if you can find them again. Unfortunately, you find that the waters here are too murky to see much at all, aside from a few schools of fish swimming near the surface of the lake. The singing has stopped, and only dead silence greets you. You swim around for a while longer, but nothing else happens.\n\nFeeling as if you might have missed out on something, you decide that there is nothing else here for you and leave the waters of the lake behind you. You've now explored the entire island and have seen everything there is to offer. It may now be time for you to settle here and find your place in life.", "action_results": [{"action": "Proceed", "result": "Over the coming months, you begin to settle into daily life on this isolated island. There’s more than enough food and resources here to keep you set for life, and there’s more than enough to be getting on with. Having resigned yourself to the fact that you are going to be living alone, you start setting up some personal projects for yourself. You work on cutting down trees to build a basic shelter, although the natural climate here means that sleeping rough isn’t really a problem. Over time, you improve your skills and modify the shelter into a small cabin for all of your needs.\n\nYou never see anyone else land on this island, not even the Gahl’vuhr Sehn. For the most part, people leave you alone. It’s maybe a year before you see even one airship on the horizon, but it doesn’t come anywhere the island and soon disappears out of sight. It’s all right, really. You’ve started to get used to the constant loneliness, day in, day out. It doesn’t really bother you anymore. Besides, you still have a firm grip on reality – you’re not going to start going mad and go around talking to trees.\n\nSometimes you lie awake at night, wondering about all the chaos going on at the surface. It doesn’t matter anymore, because you’re so far removed from that now. You wonder about the fate of the captain aboard the airship, left drifting for eternity through open skies. You hope that she managed to find help, but it’s likely that she didn’t make it.\n\nWith no social contact, you seek the company of animals and begin taking in a few of them as pets. Not that you’re going to become a crazy cat lady or something, but it’s better than talking to yourself all the time. You start growing fruit and vegetables, using the resources of the island to your advantage. Over time, you see the potential of harvesting crops and raising animal as livestock, though you still have a long way to go.\n\nThe island never changes. Nobody is living here but you, so realistically the trees should be growing like crazy and the vegetation going out of control…and yet, this isn’t what you see happening. Everything seems to be stabilised in a very balanced order, leading you to suspect that some ulterior force may be at work. You’re not complaining, though. It saves you having to curb the area yourself.\n\nIn the end, you live here alone for the rest of your days, free from the chaos and violence which plagues the surface. You have your pets and animals for company, and there’s enough resources to keep you busy. You have to be careful, though, because it isn’t easy living alone. There are times when you feel ill and still have to do everything yourself. The animals grow used to your presence, until you almost feel as if you’re a part of their little family. They help out in their own little ways, bringing you food and sustenance when you become sick.\n\nYou’re alone, but you’re still happy and feel fortunate that this is how things have turned out. You take each day as it comes and ensure that you live in the moment.\n\nAfter falling from a great height, this is the life you’ve chosen for yourself.", "action_results": []}]}]}, null]}]}, {"action": "Stay with the drifting ship", "result": "You decide not to risk it. The captain’s life is already compromised, and you still have some supplies left to make it to the next possible island. Granted, the captain may have been a little rude and abrasive to you when you first met her, but she did allow you to stay on board. You can’t help but feel a little responsible for what happened to her.\n\nThe island appears before you, but you choose not to disembark. Before long, it has disappeared from view.", "action_results": [{"action": "Proceed", "result": "Over the next few days, the airship you’re on continues to drift at the mercy of the wind. You see no other inhabitable islands within range, and have no way of turning the ship around towards the islands you do see. Progress is painfully slow, and you feel sure that you will die here. Your supplies have dwindled down to almost nothing.\n\nThe captain’s condition worsens near the end of the week. You manage to get her conscious enough to eat what little food and water you have left, but she barely eats anything at all. You don’t have much hope for her survival, and every day she seems weaker than ever. A realistic approach would be to leave her to die and save what precious provisions remain, but you can’t see what good that will do. This ship isn’t going anywhere, after all.\n\nIt’s difficult to sleep at night on the hard wooden deck. The stink of the corpses is too much to bear, and you spend hours dragging them off the ship and shoving him over the side. You thought that removing the extra weight would help the ship move faster, but it doesn’t. Nothing works. Nothing you do seems to help anymore.\n\nYou run out of food in the middle of the second week.\n\nThere’s still water. Water can keep someone going a lot longer than food deprivation will. It hasn’t rained for so long. No storms. No rainfall. You almost wish for a storm to hit the ship, something to break the monotony, but right now this isn’t a ship anymore. This is just half a ship, and you’re just half of the skeleton crew.\n\nJust mere skeletons now.\n\nYou’re getting weak from lack of food. The gnawing pain in your stomach won’t go away, and you don’t want to waste what little water is left. You think about denying the captain water altogether. Someone has to survive.\n\nWhen the next week begins, you awaken to see a strange red mist rise up ahead, out of the gloom. You’ve never seen such a thing before, and something about it frightens you. You feel that the airship has entered a part of the sky that nobody should enter, like a forbidden area. You don’t want anything to do with this mist, just want to lie on your bed and clamp your hands over your ears and block everything out.\n\nYou’re so hungry. You’re so hungry and tired, tired and hungry, sick and tired, tired and sick…Does it really matter anymore? Does anything matter?  ", "action_results": [{"action": "Hide in the captain’s room until the mist passes", "result": "You stay huddled in the captain’s room, keeping the door tightly shut. You don’t know why, but something about that mist makes your flesh crawl. As you lock the door, however, you suddenly remember that you left the unconscious captain outside on the deck, right before the red mist was about to descend. She’ll be vulnerable to whatever effects it has. You hesitate to run back out there and get her.\n\nJust then, you start to hear strange noises from outside. It sounds like some kind of wailing, quiet yet piercing, and it's enough to drive you into a corner with your hands clamped firmly over your ears. You start to imagine that some strange force is going to board the ship and break the door down before bearing down on you. Muttering incoherently to yourself, you crouch by the wall and squeeze your eyes shut, hoping that the mist will pass on.\n\nThe air feels thicker than usual. It’s getting harder and harder to breathe. You feel something change in the surrounding atmosphere, something so subtle that you wouldn’t even notice it otherwise. As it is, you’re so busy locked in your own irrational fear with your hands over your ears that you can’t help but notice it.\n\nSlowly, very slowly, you feel everything start to go back to normal.\n\nIt’s nearly half an hour before your fear subsides enough for you to emerge back on deck. You’re shaking as you crawl out of the cabin, shaking with a mixture of extreme hunger and trepidation. The red mist is gone. The captain’s body is lying undisturbed on the upper deck. Nothing bad seems to have happened. You start to relax, realising your mind must have been playing tricks on you. Time can do that to you. Lack of food, lack of sleep, lack of all those little things you need in life until you find yourself getting delusional and seeing things that aren’t there –\n\nYou walk over to the captain’s body. Her skin is cold and her mouth is open slightly. She is dead.\n\nThere is no way to tell if she finally succumbed to her injuries over the past few weeks, or if the strange red mist had something to do with it. You stumble back from her corpse in confusion and terror, searching for somewhere to escape to. There’s nowhere else but here. The red mist disappeared as quickly as it came…\n\nThat’s not all, either. Something else has changed, something that you didn’t count on. It’s not something to do with you, or the captain, or your lack of supplies, yet at the same time it’s one of the most important things you’ve been relying on up to this moment in time.\n\nThe wind has stopped.\n\nDesperately, you run over to the side of the airship and look down. Nothing. Nothing but an empty void stretching down to the surface of the planet. No wind. No wind to blow you forward. The airship is no longer drifting – it’s stationary. Static. Your vessel is at a standstill, here at the edge of an endless sky with no hope of salvation.\n\nYou stare out through endless skies, already weakened by lack of nutrients, before sinking to the ground. Your fate has been sealed. The airship is stranded in an uncharted region of open sky where the wind no longer blows, with no way to move forward on here. Without further resources, your situation is now beyond help. The days will turn into weeks, and the weeks will turn into months, but you have no future from here. You are never seen again.", "action_results": []}, {"action": "Stay up on deck to see what happens", "result": "You stay on deck as the red mist descends upon the airship. Something doesn’t feel right about this, but you’re too tired and hungry to care. The unconscious captain is lying nearby, just as vulnerable to the mist as you are. For a moment you consider taking her inside her room to give her some better protection from whatever effects the mist might have, but it’s too late for that now. You brace yourself, ready to act if anything untoward happens.\n\nSlowly, you feel a strange feeling come over you. The pains of your body begin to recede, here within the red mist. What’s going on? The gnawing hunger in your belly is beginning to disappear, along with your fatigue. There is a movement next to you, and you turn to see the captain open her eyes and slowly get to her feet. Could it be that the effects of the red mist are actually beneficial?\n\nEven if it’s nothing but an illusion, you are grateful for the relief from the constant pain that has plagued you for the past week or so. Your body feels light now, lighter than air, and you feel almost as if you are floating. The captain turns to stare at you, and you realise that both of you are moving upwards. You don’t know what’s going on, but this doesn’t seem too bad. Perhaps you could rise up to a greater height and find an island, where help may be found –\n\nYou chance looking down and see a sight which fills you with horror.\n\nTwo dead bodies lie on the deck of the airship, directly below you. They belong to you and the captain.\n\nYou turn to call out to the captain, thinking to warn her about what’s happening, but no sound escapes your lips. Your face and body is changing, splitting apart, slowly disintegrating…into just another part of the red mist. The same thing is happening to the captain. She opens her mouth in a silent scream just seconds before she, too, is absorbed.\n\nThe red mist marks an uncharted region of the sky, beyond which no wind blows at all. It has one primary, deadly purpose: to leech away the life-force of the poor souls who drift this far away from the sky islands, far away from any hope of civilisation. Your life-force has now been converted into new energy to facilitate the mist, and you exist no longer.\n\nYou are just part of the red mist now, drifting eternally across this patch of sky to prey upon any survivors of doomed airships which come here. You perish here within uncharted territory, yet live on as part of a mass entity, claiming the lives of others who have already given up hope.", "action_results": []}]}]}]}]}, {"action": "Cross over to the other part of the ship where Mother Ghared is, which is plummeting towards the ground", "result": "You must be mad to think of doing this. Quickly, you leap over the gap and onto the separated part of the doomed ship, which is quickly plummeting towards earth at a deadly speed. Above you, the remaining half remains airborne. It quickly disappears from sight as you fall.\n\nIt’s impossible to keep your footing on the deck when the ship is falling so fast; parts of it are beginning to break up again from the constant acceleration. Gritting your teeth, you force yourself to crawl over to where Mother Ghared is lying. Her eyes are open, and she seems faintly aware of what is going on around here, but she is otherwise unhurt. If anything, she just looks exhausted.\n\nWhen she sees you, her eyes widen and she grabs your wrist. “Fljght, Fljght,” she whispers to you urgently, pressing a crumpled scroll into the palm of your hand. The words she speak are not in your language. “Fljght, fljght…”\n\nHer eyes close as she falls back into unconsciousness. You stare at her in confusion as the ship continues to fall. The scroll she gave you is covered with strange symbols and runes that are incomprehensible to you. Somehow, you think she was trying to give you to a clue.", "action_results": [{"action": "Say the word “Fljght”", "result": "You utter the incantation, and the scroll glows faintly before disintegrating into nothing. The glow itself has not faded, however, but has spread to the soles of your feet. With a start, you realise that you are no longer falling, and that your body feels as light as a feather. You are no longer in any danger of plummeting to your death.\n\nMoving forward, you are surprised to find that you can now move in any direction – up and down, too – at will. You have as much freedom as a bird, and can fly through to the air as you see fit. The activated scroll has bestowed this power on you, and you may now fly from here to your heart’s content.\n\nSadly, this power of flight is not extended to Mother Ghared. She continues to fall towards the ground at a faster speed, until you can no longer see her at all. You start to fly down towards her with your new-found ability, but discover that you can only do so at a fixed speed. There is no way to accelerate, and therefore no way of saving Mother Ghared before she disappears into the void far below.\n\nYou have no choice but to travel away from here. Fear washes over you at the thought that this ability may actually be temporary. What if you could lose this power at any given moment?\n\nWith this in mind, you turn to fly as far away from here as you can, away from the ruins of the airship far above you. You don’t know where you’re going, exactly, but anywhere is better than this.", "action_results": [{"action": "Proceed", "result": "For the next few hours or so, you fly across the skies at a mediocre speed. The wind blows through your hair as you travel, and you feel a kind of freedom wash over you that you’ve never quite experienced before. Throughout your life, you’ve been content to remain settled upon your own island, never venturing out into the skies around you. Right now, however, you feel as if you can literally go anywhere. Any island, any port, above the clouds, down to the ruined surface…The sky’s the limit, so to speak. You feel as if you could fly like this forever.\n\nYou’re not going to do that, of course, because you’re still wary that the effect of the scroll will wear off before long. You will have to land somewhere soon, because ultimately you want to find a new island to settle upon. A new home to call your own. A place where you can start again…\n\nWithin the hour, you pass the remains of several islands floating in the sky, broken chains dangling uselessly into empty space. As you approach, you realise that these are parts of bigger islands which have already fallen towards earth. Nothing remains there anymore. They have all suffered the same fate as the place you used to call home.\n\nIt’s some time before you finally see one island which still remains intact. From here, you can see that there’s a considerable number of inhabitants; numerous houses, roads and streets stretch out below you. Why, it looks like there might be a town down there. There’s definitely some kind of community. The question is, will that community approve of you?", "action_results": [{"action": "Land at this new island", "result": "You touch down upon the edge of the island, a thrill racing through you at the thought of what lies beyond. Immediately, the glow fades away from the soles of your feet and the power leaves you. So that’s how it is: the scroll’s effects last as long until you touch solid ground again. In theory, you could abuse such a power, but you don’t want to push your luck.\n\nThe town before you is bustling with crowds of people and shops on every street corner. You’ve never seen anything quite like this. In fact, you’re not quite sure this isn’t just part of a small city. The diversity of species here is mind-blowing: you see Auvahrs chatting to each other in the marketplace, Tenurs tending their stalls and displaying their wares, Gahl’vuhr Sehn officials marching up and down the streets as if they own the whole place, other subspecies you’ve never seen before staring at the scene like some kind of tourist…You ever see nameless ones like you. Unworthy ones, as the captain called them, but you don’t take to that nonsense. Nameless is what you are. It’s what you’ve always been.\n\nA large glistening sign at the main port spells it out for you.\n\n\nWELCOME TO MAJERUK\n\nWHERE DREAMS COME TO LIFE\n\n\nYou could definitely settle in a place like this. You love the city. You love the hustle and bustle of the crowds, the countless things to do on every street, the sheer size and depth of the place you’ve found yourself in. There’s libraries, museums, galleries, bookshops, clothiers, governing halls for Gahl’vuhr Sehn officials, various buildings that you can’t even begin to describe…All you have to do is get a foot on the ladder and you’ll be in.\n\nThis is a place which rewards you for doing very little – or, conversely, which rewards you with little for doing far too much. Exchange of goods and money. Economics. The arts. Societies. Meeting halls. Dance, music, sculptures, concerts, religion…\n\n“Excuse me, ma’am,” a curt voice says behind you.\n\nAll at once, the illusion is broken. You turn round to see three stern-looking Auvahrs in uniform, carrying firearms at their belt. At least, you assume they’re firearms. You’ve only ever seen pictures of them in books before, never having crossed out of your own little island before now. You’ve heard such stories of the city…\n\n“You are under arrest for the unlawful use of privileges available only to high-ranking members of the Gahl’vuhr Sehn,” the man says coldly. “As an Unworthy, you should not have access to such abilities.”\n\nAt first, you just stare at him in confusion. Abilities? Wait a second. Is he talking about the scroll’s power which allowed you to fly here? Perhaps that’s the issue here. Someone saw you using the flying ability – or sensed it, detected it, whatever – and decided that you’d breached some kind of unspoken law of theirs.\n\n“That wasn’t my fault,” you protest. “The airship – ”\n\n“You were caught using a long-distance Flight scroll,” the official says, his tone rather hostile. “Unless you have a very good reason for doing so, Unworthy, you will face the penalty of breathing the laws of Gahl’vuhr Sehn. The island of Majeruk is under the jurisdiction of the Auvahrs of Gahl’vuhr Sehn, and all must abide by our rules. A lifetime upon a prison island will do a world of good for scum like you.”\n\nSurely, if you were to explain yourself rationally to the man, then he should understand that this is all a big misunderstanding and let you go. Right? They wouldn’t judge you on something like this, face to face. Surely they can let it slide just this once. ", "action_results": [{"action": "Tell him your story", "result": "You see no reason not to tell the truth. Swiftly, you explain to the official the full story of how you fell from your island and how Mother Ghared saved your life, taking you on board the Gahl’vuhr Sehn airship. As soon as you mention this, the men exchange glances between each other, shaking their heads doubtfully, and look at you with greater suspicion than ever. You continue talking about how you activated the scroll, gaining the ability of flight for a temporary basis, but the official abruptly holds up a hand to stop you.\n\n“I have heard quite enough,” he says sharply. “Your story is an unlikely one to begin with. Whilst there have been reports that many islands have been falling due to the effects of the chaos on the surface, it is inconceivable that a high-ranking member of the Gahl’vuhr Sehn would choose to save your skin. You are an Unworthy. Your life is not of equal worth to a normal person.”\n\n“That’s not true!” you protest. “Mother Ghared saved my life!”\n\n“Is that so?” He folds his arms. “And where is Mother Ghared now? Can she testify to this?” Taken off-guard, you start to splutter that Mother Ghared probably didn’t make it, but the man pushes aside your excuses. “Even if you are telling the truth, which I greatly doubt, it makes one thing very clear: no true member of the Gahl’vuhr Sehn would choose to save the life of an Unworthy. If Mother Ghared truly acted as you claim, then it means that the rules and regulations of the Gahl’vuhr Sehn have not been followed correctly. I see no reason to trust your word. Rather, it seems far more likely that you were a stowaway on board.”\n\nWith that, the official turns away and issues a sharp command to the men on either side of him. The Auvahrs immediately step forward and grab you, pulling your arms behind your back painfully. You struggle indignantly in their grip, protesting all the way as they frog-march you in the direction of the main port. Nothing about this is fair! Have you survived your trip from the airship only to be taken prisoner by the same race of people who saved you in the first place?\n\n“As the presiding justiciar of the Gahl’vuhr Sehn stationed upon Majeruk,” the lead official says in a rather formal tone, “we find you guilty of the offence of using a long-distance Flight scroll, an item used only by high-ranking members of the Gahl’vuhr Sehn. Normal citizens are not permitted access to such privileges, let alone an Unworthy like you. Having heard your story, we also find you guilty of the additional crime of stowing on board an airship under the command of the Gahl’vuhr Sehn, as well as possible contributing to its destruction!”\n\nYou are forced into the back seat of a cramped-looking aerial vehicle, and strapped in tightly with a grim-looking official seated next to you. Two more men enter the front of the vehicle. The engines start to fire up.\n\n“What’s going on?” you demand, fearful of what they intend to do with you. The Auvahrs are practically treating you like a criminal. You don’t know what they do with such people, because on your island you never had to deal with anyone like that. “Wh…where are you taking me?”\n\nThe lead official barely glances at you. “Prefect, take the Unworthy to Island 39. She is to be classified as a Class 3H criminal of the fourth degree. If she talks at all during the journey, silence her.” He slams the door on you and turns away without another word.\n\nFrightened about what fate lies in store for you now, you can do nothing but watch as the Gahl’vuhr Sehn drive you away from the attractive island of Majeruk, towards a grim-looking location in the distance. You are strapped in so tightly that you can barely breathe, making escape impossible. The man in the seat next to you is watching you closely, making you feel very uncomfortable.\n\nNobody talks. Nobody says a word, not to you or any of their colleagues. The Gahl’vuhr Sehn operate in a professional manner which scares you, honestly. It’s about half an hour before the vehicle you’re in start to slow down. You chance a glance over the side of the vehicle and see an ominous-looking island, surrounded by cliffs on all sides. Nothing about your situation seems promising at all.", "action_results": [{"action": "Proceed", "result": "You are forced out of the vehicle with your hands tied behind your back, where the officials march you over to a tall, grey, oblong-shaped building situated some distance inland. As you step inside, you are shoved into a cramped, featureless interrogation cell with dim lighting and no windows to see through. Another Gahl'vuhr Sehn official sits opposite you, barking personal questions at you whilst the other men search you for any weapons or illegal contraband. You sit through the whole experience in a kind of numb shock, never having been through anything like this before.\n\nAfter about an hour, you are taken to the strip of land which lies beyond. A grim sight greets your eyes. Thousands and thousands of people are locked within maximum security cells, isolated here away from the general public, some of which are suspended above mid-air to conserve space. Men and women of all races, including some mutants like you saw before at the airship, peer out from behind the bars. Food and water are strictly rationed and prisoners are permitted no more than an hour per day at the exercise yard, before being put to work doing hard labour at the mines, located at the other end of the island.\n\n“What're you in for, girl?” a mutant sneers at you as you pass by his cage.\n\nYou are thrown into a square cell of your own, situated underground. A small plate of stale food lies in the corner, and your stomach rumbles fro not having eaten all day. There should be water here, too, but the guard with you informs you that they can't get fresh water to every cell during the day. You may have to remain thirsty until they find the time to give you a refill.\n\n“Sweet dreams, kid,” he says nastily.\n\nThe cell door slams shut behind you with a very real tone of permanency. This is your fate at the hands of the Gahl'vuhr Sehn. You have been sentenced to a maximum of thirty five years of underground confinement and hard manual labour, here upon one of the many prison islands which fill the skies.\n\nMoreover, it is likely that you will not survive long in such conditions. Prisoners who fail to meet their work quota daily are punished severely, and your body does not possess sufficient stamina to bear the torture experienced at a Gahl'vuhr Sehn prison island. Withdrawal of food and water is not uncommon, and many of the inmates are at the mercy of the guards. Females in particularly do not have any protective rights from assault, not whilst they have their prisoner status. Even if you could escape, the island is ringed by cliffs on all sides. You are deprived even of the opportunity to commit suicide.\n\nFate has not been kind to you. You will remain here at the prison island for the rest of your mercifully short life.", "action_results": []}]}, {"action": "Make something up", "result": "“There is an extremely good reason for this,” you say. You doubt that these men will believe you if you tell them the truth, considering their low opinion of your species to begin with. Your best guess is to fabricate something which seems believable. “This Flight scroll doesn’t belong to me.”\n\n“We are quite aware,” the official says fervently.\n\n“No, no.” You’re not used to lying to people. There usually isn’t any need to do so. “I was ordered by…by Mother Gherad to use it.”\n\nHe frowns. “Do you expect me to believe that, Unworthy? A high-ranking member of the Gahl’vuhr Sehn willingly gave you a long-range Flight scroll? I have heard more convincing tales extending from the back of an anteater.”\n\n“She gave me the scroll,” you say quickly, “in order to prevent it from falling into the hands…of…the enemy.” What enemy? Who’s the enemy? Lying to people is a lot harder than you thought. “The enemy, that is, of the Gahl’vuhr Sehn. A…rebel army of mutant rabbits.”\n\n“Rabbits,” the official repeats.\n\n“Yes, really. Really, really big ones. With axes.” You’re babbling now, but you might as well keep this up. “It was a valiant battle against the bunnies, and they were after the scroll of Flight in order to turn into flying mutant rabbits! They planned to assault this island, thousands of flying bunnies throwing axes at the poor citizens of Majeruk. Luckily, I thwarted their plans and now they will never have their rabbit revenge!”\n\n“If I can just stop you there – ” \n\n“Mother Gherad died heroically defending the ship,” you say dramatically, going all out with this story now. Now that you’ve started, you cannot be stopped. “We could not hold them back for long. We had to poison their supply of carrots just to get an advantage. Lettuce, too!”\n\n“Wait a second,” one of the other men interrupts. “You mentioned…it was a rebel army of mutant rabbits?”\n\nYou nod enthusiastically.  “Exactly.”\n\n“A rebel  army. So…how were they rebelling?”\n\n“Rebelling against the Rabbit King,” you say proudly. “There’s a long, long history of all the rabbit rebellions before our time, going all the way back to Lord Rabbiter McRabbit himself. I will enlighten you now.”\n\nWith a flourish, you then continue to rabbit on at great length, detailing the long history of two thousand years of rabbit-themed monarchs and bloody battles which claimed the lives of their citizens to gain vital land on the sky islands. You don’t quite know how you came up with all this stuff, but you’re going too fast to be able to stop now. The officials actually seem genuinely interested about all of this fictional backstory that you’re pulling out of thin air – or at least, you think they are. They might not care at all.\n\n“…and that,” you finish, twenty five minutes later, “is the entire account of the rise and fall of the Rabbit Empire, shortly before Queen Fuzzlebunny came to the throne and brought civil war among the nations.” You let out a long sigh, since you’ve been talking for some time now. “Would you like to hear it again?”\n\n“That was very interesting, but no,” the official says. He is looking at you long and hard. All of them are, actually. You can’t quite tell what is going through their minds, but you’re sure that you must have made a good impression. “I think we’ve had enough of rabbits.”\n\n“Why are you looking at me like that?” you ask. “Is it the rabbits?”\n\n“No,” the first Auvahr states. “It isn’t the rabbits.”\n\n“What is it then?”\n\n“We’re looking at you like this,” he says testily, “because we think you’re insane.”\n\n“Really?”\n\nHe glances helplessly at his two companions, who look back at him in just a helpless a fashion. You watch as they whisper furtively amongst themselves, looking rather worried about the situation. Telling a tall tale about the rise and fall of the majestic Rabbit Empire was definitely a step in the right direction.\n\nEventually, the official steps forward towards you again. “We’ve decided,” he says resignedly, “that we are not going to press charges to you, on account of you straying so far from the original question that we can no longer remember what we were talking about in the first place.”\n\n“It was the scroll,” you remind him helpfully.\n\n“Right. The scroll.” The man sighs. “Look. I’m not prepared to hear you talk about damn rabbits for another thirty minutes. I don’t have time for this. Rules are rules, and the Gahl’vuhr Sehn has to make sure everything is perfect. Especially here in Majeruk. What I’m going to say instead is that your usage of this high-level scroll was some kind of freak accident, because…you do not seem like the kind of person with the mental capability to steal a Flight scroll whilst knowing what you were doing. My colleagues here will bear witness to that.”\n\n“Definitely,” says the official next to him. “She’s bonkers.”\n\n“You may remain in Majeruk for the time being,” he says, with long-suffering patience, “but only because I don’t want to stand here for over an hour listening to a crazy girl talking endlessly about fictional rabbits. You’re free to go. Just…don’t do it again, alright?”\n\nElated, you smile as the three officials turn on their heel and march back down the street the way they came. Somehow, you’ve managed to get away with it. You’re not sure where all of that inspiration for rabbit-themed history came from, but you ought to write it down sometime. Some people like that kind of thing, apparently, although you’re yet to meet anyone like that in person.", "action_results": [{"action": "Proceed", "result": "Majeruk promises to be an exciting place for you to live. There are numerous cities and towns across the island, and you take some time to explore your options before choosing on a suitable career path. In addition, the Gahl'vuhr Sehn occupy the whole of the land here and have set in place a number of strict rules for all citizens. After your last encounter with them, you decide not to do anything to annoy the governing body around here. You don't want to cause any trouble.\n\nThe first week is rather rough for you. With no money or resource of your own to trade – aside from the sword you kept from the airship, and that turns out to be worth very little of value in Majeruk – you are forced to sleep rough at night. The Gahl'vuhr Sehn do not allow people to sleep on the streets, which is fine for you because you see no problem with sleeping outside their towns. It's always good to experience new things, but you have to take care in doing so. The wrong situation could see you lose your life at the hands of the local wildlife, which turn out to be unexpectedly hostile…\n\nIt's some time before you finally manage to secure employment as a courier, delivering goods and packages between the towns in Majeruk. The job gives you an advance payment, enough so that you can afford to rent some accommodation in the suburbs of the central city. It's hard work, with long hours, but you keep at it and soon begin to learn the various trade routes going around the island. It makes your job easier, and it's another year before you have enough money and resources to try your hand at another job.\n\nEvery day, you hear news about the chaos on the surface and how more and more sky islands are falling down to earth in a blaze of constant destruction. It makes you think of home, or what used to be home. You think back to all the events that brought you here in the first place, to Mother Gherad and the captain on the airship which saved your life. You wonder if the captain ever made it out alive.\n\nYou make lots of new friends in Majeruk over the years, but still you worry that such a densely-populated island might suffer the same fate as your first island did. What if everything here is destroyed? With this in mind, you take to travelling. You've become quite an accomplished businesswoman by this point, taking on several jobs and even employing your own staff with ease. You're going up in the world. You manage numerous accounts of money, oversee cargo taken on board airships in an organisation built with your own two hands, and you know that you have to expand your horizons.\n\nMany years have passed, and you have more than enough to purchase an airship of your own now. You travel through the skies, venturing far and wide, but never stay on board for too long. Airships can be dangerous. You become a kind of explorer in your own right, navigating countless islands and assembling a crew of your own. For some time, you pursue this exciting choice of life, but you're not really sure what you're looking for. You know you're searching for something, but you just can't put your finger on it.\n\nIt's several years after that when you finally return to the island of Majeruk. It's the same as always, and business is booming, but you're now experienced enough to put in several advisors who can easily run your organisation by themselves with only limited help from you. Even the Gahl'vuhr Sehn are respectful to you. They still refer to you as “Unworthy”, more out of habit than anything else, but you have a mutual understanding of each other. You a force to be reckoned with.\n\nLooking at everything you've achieved over the years, you finally realise what you've been seeking. You want a place to settle down. Somewhere to settle down. A home, in nature, but you already have several homes across the skies. You decide to settle here in Majeruk. You think about the future, and seek a husband with which to bring up a family of your own. There is no shortage of men in Majeruk, and all of them are falling over themselves to propose to you. It's sweet of them, really, but a woman of your reputation and wealth can afford to be choosy.\n\nAt the end of it all, you remain here in the island of Majeruk for the rest of your days. You have lived a life filled with contentment, riches and great respute. You consider having children of your own and handing down the family business to them, once you grow old enough to retire, but that's in the future. You could have never predicted that things would work out so well.\n\nAfter falling from a great height, you have risen to become a woman of grand accomplishments and great success.", "action_results": []}]}]}, {"action": "Ignore it and keep going", "result": "You continue to fly through open skies, unable to rest anywhere for fear that the scroll’s power will suddenly wear off. Hours pass by, and still you see no other inhabitable islands or places where you can land. You encounter a few passing airships – active ones, thankfully – but they are only merchant ships and pay you no heed. You dare not stop.\n\nThere are numerous lightning storms in this part of the sky, and you are quick to stay away from them. Many an airship has fallen victim to the fierce and unpredictable weather conditions escalated by the deadly situation on the surface far below. As it is, a single strike would probably send you plummeting out of the sky. You need to stay airborne at all costs. You saw what the surface is like now: nobody can survive there anymore, and the people who remain there now have no future.\n\nNightfall comes at last, and you are exhausted from flying for so long in one go. It is too dangerous to keep going in the dark, anyway, so you absolutely need to rest soon. You decide that the next inhabitable island you see will just have to go. You should change your angle of ascent, too, and see what you can find. Up or down? There has to be something here. So many islands have fallen now, so many lives have been destroyed…", "action_results": [{"action": "Choose to ascend", "result": "You fly upwards for over twenty minutes more before you spy a small fragment of an island, almost invisible to the naked eye from this distance. It seems to have broken off from a greater land mass, possibly another victim of the chaos on the surface. The island looks to be too small to offer you many favourable options, but you’re in no position to pass up the opportunity. You’ve been flying all day long now, with limited food to keep you going, and you’re extremely tired. As things stand, you’ll just have to take a chance on this.\n\nHoping that you won’t regret your decision, you disembark upon this small patch of island. Immediately, the glow fades away from the soles of your feet and the power leaves you. So that’s how it is: the scroll’s effects last as long until you touch solid ground again. In theory, you could abuse such a power, but you don’t want to push your luck.", "action_results": [{"action": "Proceed", "result": "The island you stand upon seems eerily similar to the one you lived upon previously. It seems strange to suggest such a thing, but you feel almost as if you've been here before. You take a few steps forward upon the crisp, yellowed sand under your feet, and walk towards a cluster of primitive-looking huts in the distance. A dusty path runs towards the centre of a peaceful-looking village, and there is hardly any wind here at all. It's all very quiet.\n\nUnable to shake off the feeling of deja vu, you continue walking up to the village square. It's quite dark now, but you can see lights up ahead. A small group of people are sharing a bite to eat over a roaring fire, chattering away excitedly in good humour. They are not talking in Common Tongue, like the Auvahrs of the Gahl'vuhr Sehn. They speak your language fluently.\n\nYou approach the fire, and the people turn in surprise to look at you. Their skin and body composition is very similar to yours. You realise, then, that they are the same species as you are: they are nameless. For an instant, you feel almost as if you are back home again, but you push the feeling away on the grounds that it must be some illusion. Your home has already been destroyed, and surely nothing can replace it.\n\n“Hello,” you say to the people here, unsure what to say.\n\nA man and a woman look curiously at you and smile, before offering you a leg of meat. There is no suspicion or aggressiveness in their innocent faces. It's as if they've been expecting someone like you to arrive after all this time.\n\n“Sit and eat,” the man says in a friendly tone as you accept the food. You haven't eaten all day. “You look tired.”\n\n“I am,” you say, sitting down by the fire with him. “I...I'm so tired.” Your words feel slurred and inconsistent from heavy fatigue, but you feel that it's important to get this off your chest. “What...what's the name of this island? Do you have a name?”\n\n“What kind of question is that?” He smiles. “We do not name ourselves. Names give power to other people. Why do you ask these things? Do you have a name?”\n\nYou shake your head. “I do not.”\n\n“Then it is of no consequence.” He gestures to one of the huts behind you. “Feel free to use one of the rooms out back. Our brethren will not mind sharing their bed with a fellow nameless one, but we do not receive many travellers this way. Are you passing through?”\n\nAs it is, you currently have no way off this island. You are stranded here, but somehow you don't see it that way. You look around you with tired eyes at the friendly people here, inviting you inside to share their food and drink with them. It looks so much like the village you used to call home. An island so small and seemingly insignificant that nobody else even knows it exists. You doubt that any airships even come this way. It's a tiny part of the world, isolated away from everything else.\n\nYou could settle here. You feel it in your bones. Start again, rebuild, reconnect with people, contribute to a living community, help each other out and start again...The thought brings tears of happiness to your eyes, and you have to look away for a moment. You didn't think this would ever happen, but you feel...as if you are finally home.\n\n“No,” you answer. “I'm not just passing through. I'm returning home.”\n\nYou see in his eyes that he understands exactly what you mean. This island has not fallen. It is too high above the rest of the world, too isolated in its own little share of the skies to be affected by all the chaos going on at the surface. You hope that things will remain that way. It is true that you cannot predict the future, but you feel optimistic about what's waiting for you out there.\n\nAfter falling from a great height, you have finally found your way back home.", "action_results": []}]}, {"action": "Choose to descend", "result": "You allow yourself to fall downwards, reasoning that you are now too high up to see any inhabitable islands. Your eyelids are heavy and your head drops onto your chest from your exhaustion, but you maintain some element of concentration and continue to descend at a normal pace. It might be your imagination, but the air pressure seems particularly high around here. Dark clouds have built up around you, filled with rain which is pelting down upon the surface…\n\nThunder rumbles in your ears, and your eyes flick open when you realise that you have stumbled into the midst of a storm! Shaking your head, you start to fly away from the area to avoid the bad weather, but the wind buffets you back and forth and blows a torrent of rain right into your eyes. You cry out, shielding your face protectively, and start to fall through the clouds.\n\nYou’re falling a bit too fast for your liking now, but at least you’re clear of the storm. From here, you can see that you’re actually not too far from the surface where chaos rages. That won’t do at all. You decide to force yourself to slow down, trying to fly back up to where the sky islands are.\n\nNothing happens. You continue to plummet, faster and faster towards the earth. Your flying ability is no longer in effect!\n\nYou don’t entirely understand what just happened – perhaps the storm did something to your abilities, or maybe the effect wore off on its own – but what’s important is that you’re now in constant freefall. Quickly, you try to suppress the sheer panic rising up in your chest and struggle to slow yourself down. Something gives, and you manage to lower your speed of descent – just barely. You might survive, but it’s touch and go at this rate…\n\nYou’re so close to the surface of the planet now. You can see people down there. Buildings burned to the ground, screams and crying, the lava flow from an erupted volcano, mass flooding from the rising sea level…It’s not a place where you could ever survive. You need to stay in the skies. You need to stay up here…\n\nThe noise from below gets louder and louder until it becomes almost unbearable. You can no longer stay in the sky, and you’re going so fast that you can’t focus on anything around you anymore. Praying very slightly, you brace yourself for a crash landing.", "action_results": [{"action": "Proceed", "result": "The impact is tremendous as you make contact with the surface. As luck would have it, the trajectory of your descent takes you away from the mainland and sends you into the ocean itself, your momentum forcing you deep underwater. Waves of pain wash over you, and for several long seconds you cannot move at all. You feel as if you have broken several bones in your body.\n\nFighting to conserve oxygen, one truth reveals itself to you: you are alive. You can hardly acknowledge the fact, but you are alive. The wind has been driven out of you, and you are already starting to swallow sea water; swiftly, you struggle to swim up to the surface for air. Agony rushes through your body at every little movement, prompting a scream deep within your throat that nobody will hear. You grit your teeth and keep swimming upwards, your lungs burning. You need to survive.\n\nYou break the surface at last, hacking and coughing as you take in fresh oxygen into your lungs. Air. Fresh air. From here, you can see the coastline isn't too far away. You should be able to make it as long as you tread water and take it nice and slowly. You've survived this far and you're determined to keep going, despite the mind-numbing pain tearing through your limbs.\n\nIt takes several minutes for you to get to dry land, but you can already tell that something is very wrong. You do not feel well. Perhaps it's the effect of swallowing so much sea water, but you are unsteady on your feet and you can feel a surge of unnaturally dark emotions rising up inside you. You do not feel like yourself. Grimly, you force yourself to suppress such thoughts and concentrate on reaching safety.\n\nThe coastline is littered with corpses.\n\nYou stagger forward and see people shambling across the beach. They do not look like people. Humans, yes. You haven't seen a human being for a long time, but you know what a rational person look like and these are different. Their clothes are ripped and torn, their skin covered by a mesh of angry black spots which suggest the telltale designs of disease, and there is a frenzy in their eyes which frightens you beyond anything you have witnessed so far.\n\nThe people have not reacted to your presence. They are screaming at the top of their voices, wielding vicious blades in their hands, and killing each other on sight. Countless bodies cover the blackened ground as far as the eye can see, like the gruesome remnants of some kind of battlefield. It's as if a war is going on, but you can see here that the war is purely internal.\n\nYou see two men beating another to death with a hatchet. A crowd of children have surrounded a woman and are stabbing her repeatedly, all with the same murderous frenzy in their eyes. Three girls are gouging out the eyes of a bystander. A strange haze has settled upon this place, this peaceful village that saw no such violence before. Everything has gone out of control. You knew the situation on the surface was dire, but you had no idea that it had escalated to such extremes...\n\nSomething snaps inside of you. Something wild. It's the same feeling you had just minutes ago, not long after you accidentally swallowed some of that seawater. You turn to look at the ocean curiously for a moment, and can't help but notice that the water is...a different colour than it's supposed to be. It's certainly not blue...\n\nYou drop to the ground, retching, as a new pain takes hold of you. You can't see anymore. Blood fills your eyes and you buckle forward, clutching at the ground in a similar frenzy to the people around you. You hear yourself scream aloud as every thought going through your mind is crushed into nothing, nothing but a maniacal desire for bloodlust. The world feels like it's revolving around you all of a sudden, revolving in a sea of haunted faces…\n\nThere is no need to think anymore. You snarl and shriek like a wild beast, pouncing forward onto the nearest human being to pluck out their eyes and beat their face into a bloody mess. The man is holding a knife of some kind, and you immediately wrest it from his cold dead hands to take for yourself.\n\nGleefully, you charge at your next choice of prey. Two girls covered with blood from head to toe shamble towards you, half-blind. One of them is practically dead already, but she hasn't realised it yet. Both of her arms have been savagely torn off, and her head has been bashed in from one side. You slash at her with the knife and blood spurts out of her throat in a red fountain. The other girl lunges at your neck. You stab her in the stomach. She doesn't react.\n\nA man is clubbing you from behind, but you don't feel a thing. More people are here now. More people, more violence, more chaos. You twist out of your assailant's grip and kill another person, doesn't matter who it is. You're having fun, and every part of you loves it.\n\nThis is your place now. You're part of the neverending chaos on the surface, just another victim of the shambling horde drifting across the planet in your insatiable desire to kill every living creature you see. Nothing else matters, because this is your world.  ", "action_results": []}]}]}]}]}, {"action": "Say “Fljght, Fljght”", "result": "You utter the incantation, and the scroll glows faintly before disintegrating into nothing. The glow itself has not faded, however, but has spread to the soles of your feet. With a start, you realise that you are no longer falling, and that your body feels as light as a feather. You are no longer in any danger of plummeting to your death.\n\nMoving forward, you are surprised to find that you can now move in any direction – up and down, too – at will. You have as much freedom as a bird, and can fly through to the air as you see fit. The activated scroll has bestowed this power on you, and you may now fly from here to your heart’s content.\n\nThankfully, the same ability has also been granted to Mother Ghared. Though unconscious, she remains floating in the air before you. You take hold of her body, which you find to weigh scarcely anything at all, and bring her with you as you fly through the open skies. Perhaps she just needs some rest after what she’s been through.\n\nWith Mother Ghared in tow, you turn to fly from here as far away as you can. You discover that you can only fly at a fixed speed, so there is no way to accelerate. Fear washes over you at the thought that this ability may actually be temporary. What if you could lose this power at any given moment?\n\nWith this in mind, you travel away from the ruins of the airship far above you, out into the vast vast open skies. You don’t know where you’re going, exactly, but anywhere is better than this.", "action_results": [null]}]}]}, {"action": "Turn away and worry about yourself instead", "result": "You can’t risk saving her. Who knows if you will succeed? Guiltily, you turn your eyes away from the scene. You don’t want to see the results of your inaction. The opportunity has now passed, and may never be seized again. She isn’t going to make it in time –\n\n“Fprcf!”\n\nA shrill cry erupts from the other end of the airship. The mast shudders as an invisible force slams to it, snapping it further at an awkward angle. You watch in amazement as the fractured beam crashes through the deck barely a metre away from the captain. She’s alive.\n\nYou turn your head to see Mother Ghared frozen in position, her hands outstretched towards the fallen mast. Your knowledge of her abilities is still limited, but you understand that she has saved the captain’s life. The captain waste no time moving away from the fallen mast and is already on her feet, struggling to defend herself from another group of mutants.\n\nBefore you can move, you see Mother Ghared slump to the ground. She seems exhausted by the effort of stopping the heavy mast, and the energy drain is too much for her. You start to force yourself to your feet, knowing that time is of the essence. She needs help, and fast.\n\nThat’s when you hear the violent splintering sound below you.\n\nFearing the worst, you see that the heavy mast has in fact torn straight through the centre of the airship. It is in no condition to fly. The vessel has already been damaged by the attacks of the mutants, and you can only watch in horror as more and more cracks appear, joining together as one…\n\nThe airship breaks apart down the middle.\n\nYou see the mutants react with surprise as they start to plummet along with their half of the ship. Surprisingly enough, they can no longer fly. You’re not quite sure why, but you have a feeling that their wings from before were only temporary. In addition...part of the airship somehow remains airborne. You’re not in a position to question the laws of aerodynamics right now, but you need to act fast.\n\nYour half of the airship is currently airborne and in no danger of falling – or so you hope. The captain is next to you, slumped in a heap. The other half of the ship is about to plummet downwards, and you realise that Mother Ghared is still on that side. She’s unconscious and has no idea of what has happened.\n\nYou have a split second to decide whether to cross over the gap to Mother Ghared, or stay here with the captain. You have no idea what condition either person is in.", "action_results": [null, null]}]}, {"action": "Retreat into the cabins below deck", "result": "Taking the captain’s advice to heart, you head below deck towards the relative safety of the corridors. There’s nobody else down here, as all of the crewmen have gone upstairs to steer the ship clear of the storm. You start to head towards your bedroom, wondering what will happen next…\n\nA violent tremor shakes the airship, throwing you off your feet. Fearfully, you stay braced against the wall as the atmosphere around the ship becomes increasingly more turbulent. The storm is very close now. Suddenly, you hear cries of alarm go up on deck and the loud tearing of wood. You grab onto one of the banisters for support as the entire vessel rocks back and forth…\n\nYou hear the sound of thunder. It’s right above you. With a start, you realise that the crew have failed to steer the ship clear in time. The storm has made contact.\n\nThe noise around you is now tremendous. Rain and sleet pour in from above, and holes open up above your head as lightning rips through the airship. You cower in the corner of the corridor, frantically looking for cover, but you don’t know anywhere that’s safe anymore. Perhaps you have overstayed your welcome.", "action_results": [{"action": "Hide in one of the cabins", "result": "Forcing yourself to remain upright, you manage to slip into one of the empty cabins. The noise above is getting louder and louder, and you crouch in the corner, hoping that you’ll be safe here. Surely someone else will come down here to seek shelter as well? As time passes, you see no sign of any other crew members. Before long, you cannot hear their voices anymore, drowned out by the sound of the thunder…\n\nThe walls around you are shaking, buffeted by the force of the storm on all sides. It feel as if the ship is starting to break up, and you start to wonder if maybe this wasn’t such a good idea after all. You don’t feel safe here. Even so, you hesitate to move from your current position.", "action_results": [{"action": "Continue hiding here in the hope that the storm will pass", "result": "Despite your better judgement, you remain huddled in the corner of the cabin. The whole ship is shaking violently now. Cracks appear in the walls and ceiling, and you cover your head protectively with your hands. What’s going on out there?\n\nYou start to get to your feet, wanting to move to somewhere more secure, but it’s far too late. The opportunity has already passed. The ceiling of the cabin caves in from above, and your body is crushed under tons of falling rubble. You do not live to see what happens next, but the rest of the airship is destroyed minutes afterwards. You perish here on the airship, in the midst of a violent lightning storm.", "action_results": []}, {"action": "Move out of your hiding place as it’s no longer safe here", "result": "You’re not staying here a second longer. Quickly, you break out of cover and run out into the corridor. Cracks have appeared in the walls and ceiling, and the roof of the cabin caves in as you make it out of there. You’ve spent quite enough hiding from the storm. It’s time to find a way off this ship, once and for all.", "action_results": [{"action": "Proceed", "result": "Judging your chances of survival on board this ship to be diminishing by the second, you start to search the surrounding cabins for a way out of here. There has to be something that you can use. Airships are fitted with emergency safety measures for use in the worst-case scenario, such as equipment failure or a particularly vicious storm. You're not on the surface, after all. You’re not in one of those strange human ships which take people over water, able to throw yourself overboard and swim away from all the pandemonium…\n\nInside one of the cabins near the back, you find a disused aerial vehicle which is fitted with an engine of some kind. At least, you assume that it’s an engine. It looks quite similar to some of the devices you saw in the captain’s room. Buttons and dials cover the inside of the vehicle, and there is only space for one person to drive it.\n\nThe craft is covered with dust and cobwebs and looks as if it hasn’t been used in some time. You have no idea if it still works. If you’re really unlucky, it might even blow up in your face.\n\nFrom far above, you can hear the sound of the storm growing louder and louder. You can no longer hear the voices of the crew members from before. A chill goes up your spine as you realise that the airship is being dragged deeper and deeper into the storm.", "action_results": [{"action": "Try to operate the vehicle", "result": "You step into the vehicle and strap yourself in, before realising that you have no idea how to physically turn it on. With a frown, you examine the numerous buttons and dials on the dashboard in front of you. One of these must start up the machine – if it works at all, that is. After about a minute, you manage to narrow down the correct button to just two of them. They are all labelled, but naturally the words are written in Common Tongue.", "action_results": [{"action": "Push the button which says “Jgnjtjpn”", "result": "You press the button and the vehicle immediately roars to life. Twin engines fire up and you are thrown back in your seat as the craft blasts through the weakened hull and out the other side, breaking free of the airship completely. From here, you can see that the storm has devastated the ship almost to the point of complete destruction! You can't see a single living soul on board the upper deck, and you have a feeling that both the captain and Mother Gherad must be among the dead. The airship is covered with the bodies of mercenaries and crewmen, and you are lucky not to share in their fate.\n\nWith a shudder, you turn your vehicle around to fly away from the ship. You don't know how to drive this thing, exactly, but the controls seem to respond to your touch and you're just glad to get out of here. Gauges pop up all over the dashboard, none of which means anything to you. Fuel, altitude, energy levels...no, you haven't a clue how any of this works. You'll worry about it later.\n\nGrimly, you accelerate away from the doomed airship and fly your craft as far away from here as possible, dodging and weaving through the last of the storm. As you depart, you can just make out the violent wrenching of wood and metal as the airship is ripped apart.", "action_results": [{"action": "Proceed", "result": "For the next few hours, you travel through the open skies within the comfort of your flying craft, searching far and wide for your next destination. The wind blows through your hair as you accelerate forward, and you feel a kind of freedom wash over that you’ve never quite experienced before. Throughout your life, you’ve been content to remain settled upon your own island, never venturing out into the skies around you. Just a few hours in this craft is enough to tell you that there’s much more to life than that.\n\nEven so, you don’t want to push the limits of this vehicle too much. In fact, you have a feeling that it’s starting to run low on fuel and energy. You will have to land somewhere soon, if only to refuel, but ultimately you want to find a new island to settle upon. A new home to call your own. A place where you can start again…\n\nYou pass the remains of several islands floating in the sky, broken chains dangling uselessly into empty space. As you approach, you realise that these are parts of bigger islands which have already fallen towards earth. Nothing remains there anymore. They have all suffered the same fate as the place you used to call home.\n\nContinuing on, you eventually do find an island which is still intact. You do not recognise it, but from here you can see that there is a fair number of inhabitants. You can see houses and huts on the ground, indicating that there is some kind of community there. Of course, you have no idea how this community will react to your presence.", "action_results": [{"action": "Land at this island", "result": "You descend to the surface of the island, which is ringed by a protective metal fence, and land just within the perimeter. Upon first glance, the surrounding region appears to be nothing more than one of many small towns present upon this isle. There’s plenty of land to build fresh houses, and more than enough grassland for animals to graze. It’s quite a pleasant atmosphere. Perhaps this island could be a suitable place for you to settle upon?\n\nAs you turn your vehicle off and step out onto dry land for the first time in a long time, you notice that the people here are staring at you. Much like the captain and her mercenaries, they are not the same species as you. They appear to be Tenurs, in fact – a bipedal species of people who have inhabited the sky islands for generations before you. They are hairless and bald, with three fingers upon each hand, and two separate mouths set into their faces.\n\nTheir appearance is a little strange to those who have not encountered a Tenur before, but your home island was visited by a few Tenurs some years back, and you have some firsthand experience of interacting with their kind. They are quite an intelligent race with a flair for mechanics and engineering. It’s always fascinated you how their skin colour changes with their temperament; they are people who literally carry their heart on their sleeve. Of course, the older Tenurs can control the rate of change in skin tone, but that's another story.\n\n“You are not one of us,” says a male Tenur, watching you critically.\n\nUsually, you can tell what a person is thinking from the way they look at you, or the type of facial expression they wear, or their general body language. With a Tenur, none of that is needed. The man’s skin is pulsating faintly between colours of blue and orange, suggesting that he is both suspicious and anxious about your presence here. It would not do to frighten him.\n\nStill, you’re just glad that he speaks your language, unlike the captain’s entire crew on board the airship, who mouthed off in Common Tongue to no end.\n\n“I mean you no harm,” you say to him. His skin tone does not change; your words have brought him no consolation. “I am a survivor from a nameless island. One that fell out of the sky. I only seek shelter and settlement within an island which will help me.”\n\nHis expression did not change, and you realise now that he staring at the sword in your hand. You’d forgotten that you were still holding it after all this time. Quickly, you lower it down to the ground.\n\n“You carry weapons,” he says sceptically. “But I sense no harm from you. Not many nameless ones come to our island. We place importance upon names, so if you stay here, you may have to take one for yourself.”\n\nYou notice that his skin tone is changing to purple. That confuses you at first, until you recall that purple refers to sexual attraction. His eyes are still fixed on you. Well, this is just brilliant. Your first time on another island and the first native boy you meet is attracted to you.\n\n“We have heard about the falling of the other islands,” he says quietly. “You have my sympathy. We Tenurs are fortunate that we have not been affected by the energy drain which has destroyed the lives of so many. You need not fear such dangers here. If you wish to settle here with us, then we can offer you some protection.”\n\n“I would like that very much,” you say gratefully. “Thank you.”\n\nHis skin colour darkens to a deeper purple. “I...I have just one question for you before I admit you into town.” You do not miss how the tone of his voice has softened. “Are you here from Gahl’vuhr Sehn?”", "action_results": [{"action": "Tell him you are from the Gahl’vuhr Sehn", "result": "Upon hearing your answer, the Tenur's skin tone changes to a murky green.\n\n“Agents of the Gahl'Vuhr Sehn are not welcome here,” he says in a low voice warily. “You have made a dire mistake in coming to this island. Leave here before anybody else sees you. My kin will not be as lenient as I.”\n\n“Who's this?” interrupts a voice from behind him. A tall, female Tenur with two wide smiles on her face turns to face you. “A nameless one. I heard you mention the Gahl'Vuhr Sehn, sister. Do you know what we do to agents of the Gahl'Vuhr Sehn?” The grins on her face carry no friendliness at all. “We don't appreciate what you do here. You will not control us, sister. The other Tenurs may bow down to you, but there is no space in the skies for your kind.”\n\n“Listen, this has all just been a big misunderstanding,” you blurt out, realising things are starting to escalate out of hand. Naturally, you assumed that these people would respect the word of the Gahl'Vuhr Sehn, but it seems that you were dead wrong. “I'm not really with the Gahl'Vuhr Sehn. I escaped from their airship and - ”\n\nWordlessly, the male Tenur points to where you parked your craft near the edge of the island. He is staring at the emblem painted at the front.\n\n“Your vehicle carries the symbol of the Gahl'Vuhr Sehn,” he states, his skin colour becoming more hostile. “You are no friend of ours.”\n\n“I'm telling you, I'm not with them!” you say, starting to panic. “I stole it from their airship!”\n\nTo your dismay, more and more Tenurs are beginning to emerge, drawn by the commotion. You hear murmuring amongst them, and more than a few glares directed towards the emblem of the Gahl'Vuhr Sehn, in full view for everyone to see. People are beginning to whisper to one another, calling for you to be thrown out from the island altogether. The atmosphere has quickly turned very toxic.\n\n“Leave!” one woman yells. “Leave us alone! We will have nothing to do with agents of the Gahl'Vuhr Sehn!”\n\n“Get out!”\n\n“You Gahl'Vuhr Sehn agents are always snooping around. Go back to where you came from! Try taking a trip back to the surface, there's plenty of room now that the humans have killed themselves!”\n\n“Filth!”\n\nThe crowd of people is rapidly turning into an angry mob. Sensing that it is too dangerous to remain here anymore, you stumble back towards your vehicle as the Tenurs continue to hurl insults at you. You hadn't realised that some races actually hated the name of Gahl'Vuhr Sehn. From the look of things, the townspeople must have had very bad experiences with them indeed.\n\n“Get out!” the Tenurs yell at you as you strap yourself into your craft and prepare to take off once more. “We don't want your kind here! Go back to Majeruk with the rest of your slime!”\n\nQuickly, you hit the ignition and fire the engines up, flying away from the island of angry Tenurs. They seemed to be such a friendly sort of people at first, but just the mention of the Gahl'Vuhr Sehn was enough to set them all off. Perhaps you should have been honest with them, but it's too late now. Feeling rather affronted, you take your vehicle back into the skies and decide to look for an island which isn't so aggressive to visitors.", "action_results": [{"action": "Proceed", "result": "You continue travelling for a few more hours, on the lookout for any landmarks or signs of life on various islands. After some time, however, you began to realise that something is wrong with your vehicle. Although you still have sufficient fuel to take you a fair distance…you are starting to lose altitude. You are falling lower and lower in the sky, moving down in a broad spiral which takes you closer and closer to the surface of the planet itself…\n\nDeterminedly, you try fiddling with the controls on the craft to try and fly back up to where you were. Nothing works. You are starting to fall through the clouds by now, but all is not lost. It just means it’s more important than ever to find a decent place to land. For some reason, one of the components of your vessel appears to be malfunctioning.\n\nThere are numerous lightning storms in this part of the sky, and you are quick to veer away from them. Many an airship has fallen victim to the fierce and unpredictable weather conditions escalated by the deadly situation on the surface far below. As it is, you can barely control your vehicle at all. You need to stay airborne at all costs. You saw what the surface is like now: nobody can survive there anymore, and the people who remain there now have no future.\n\nYou accelerate in another downward spiral and cross through the clouds into a graveyard of broken and damaged airships, long-abandoned by their previous owners or simply left to rot. Many of these are ghost ships, whereupon the crew have run out of fuel and starved to death in their limited patch of open sky. The wind doesn’t blow all the time, after all.\n\nOne of the airships, strangely enough, shows faint signs of life. It is also severely damaged and has a faint plume of smoke coming from the hull.  ", "action_results": [{"action": "Approach the airship", "result": "A strong, putrid stench arises from the remains of the airship as you draw near. It’s easy to see why: the deck is covered with a mass of dead bodies, many of which have rotted away completely. Some of the corpses are now nothing but skeletons. You gag on the smell, forced to cover your mouth and nose with your sleeve. It’s inconceivable that anybody could be still alive out here.\n\nWhat on earth happened here? Your first thought is that there must have been a ferocious battle of some kind, but many of the bodies show no signs of any physical wounds. There is some blood, yes, but not enough of it to give a concrete explanation. Mass starvation might be more likely, but this kind of airship seems big enough to carry a large number of supplies, and you don’t think that any of these people died from malnutrition.\n\nThere is a crunching sound from ahead of you, and you look over to see a single man crouched in the centre of the deck. He appears to be humanoid in appearance, aside from a third eye in the centre of his forehead, indicating that he is one of the rare subspecies of the sky races. His eyes are sunken and there are black blotches covering his skin.\n\nHe is gnawing hungrily upon the severed limb of a dead comrade.\n\nAlarmed, you glance from the man to the countless bodies surrounding him. The smell of death and decay doesn’t appear to bother him. He must have been exposed to it for a very long time.\n\nThe man suddenly whirls around to face you, hearing the telltale sound of your vehicle’s engines. His eyes narrow when he sees you, watching you furtively, and he slowly puts down the bloodied limb that he was eating. Three more skeletons are lying behind him. You have a feeling that he is responsible for all the bones in sight. How long has this man been feeding off the flesh of the dead?\n\n“Good day,” he calls out to you in a surprisingly jovial fashion.\n\nYou’re not quite sure how to respond. This cannibal is behaving as if you have simply strolled into his house for a brief chat. Every instinct you have screams at you to get as far away from this place as you possibly can.\n\n“I have not had visitors for some time,” the man says. He beckons to you with one skinny finger, and you can see the bones through his skin. “Come aboard. Dine with me.”", "action_results": [{"action": "Come aboard as he requests", "result": "With extreme caution, you bring your vehicle up to the edge of the airship and climb aboard. This man looks dangerous, and you feel as if any moment he's going to suddenly snap and lunge at you to consume your flesh for himself. Nobody could possibly be so calm munching upon the flesh of the dead. You hold your sword out in front of you and keep your distance from him.\n\n“You need not fear me,” he says. The sight of your weapon does not appear to worry him. “I have no intention of feeding on you, girl. There is more than enough food to go on already.” He nods towards the mound of rotting carcasses piled up across the ship.\n\nYou gag on the smell, trying not to breathe. “What happened here?” you demand. “Are you responsible for all this?”\n\nHe laughs shortly and takes another bite out of the severed arm at his feet, chewing slowly. “Unlikely. A third of the crew had already died before they let me out of the brig.” The man gestures at the black spots covering his body. “Worked it out yet? It's a disease. I contracted it from one of the islands to the south, whilst on an exploration mission for the captain. Itches like hell.”\n\n“And yet you're still alive.”\n\nThe man smiles. “That's the thing. I'm just the carrier, but I suffer no ill-effects apart from...what you see here, but...it's very, very contagious. The rest of the crew received a fatal dose of the infection as soon as I returned to the ship. It attacks the vital organs, you see. Shuts them down, one by one. Body stops working. You hardly know it's happening to you at all until the starvation starts settling in. You live a long time, but you're...not really living anymore...”\n\nHe licks his cracked lips. “You asked me if I was responsible. Take a wild guess.”\n\nYou stare at him for a few moments, sitting here surrounded by bodies. The bodies of people who died as a result of the disease he brought on board. Slowly, the real horror of his words washes over you, and you start to back away. Have you been infected, too, just by coming on board this ship?\n\n“Oh, don't worry,” the man says reassuringly. “I haven't infected you. Actually, I can't. The virus itself isn't active anymore. I think it's to do with the amount of dead tissue that I've taken into my body lately...but it's fine now. I can feel it. Doesn't get rid of the black spots though.” He rubs at his cheeks self-consciously. “Still itches.”\n\nYou don't want to trust a single thing he says. Your life could be in danger, just by standing here talking to him. Is the virus spread through the air? You shuffle back towards your vehicle, not wanting to have anything more to do with this...this cannibal.\n\n“Why did you invite me on board?” you ask quietly. “Did you really think I wanted to hear your life story?”\n\n“No,” he said simply. “I want you to do something for me.” The man gets to his feet, and you tense unconsciously. “I've been here for so long, feeding off the dead. Too long. I want you to get me out of here. That vehicle of yours can support another passenger, so long as you don't go too fast.”\n\nHe takes another step towards you, eyes burning into yours. “I don't weigh much. Not anymore. I want you...to take me with you. You're a wanderer too, girl. You're trying to survive. I...can help you.”", "action_results": [{"action": "Allow him to ride on the back of your vehicle", "result": "You must be crazy to even consider allowing this disease-ridden, filthy cannibal on the back of your vehicle, but part of you is curious about his offer of help. How could he possibly help you? You watch him very closely as he climbs onto the back of the craft, but the man shows no aggression to you at all. It's difficult to tell what his motivations are, but you know that he must have a reason.\n\n“One wrong move,” you tell him, “and I'm throwing you off into open sky.”\n\nHe doesn't seem to be worried by that. “You're looking for somewhere to go,” he says. Slowly, the man lifts his arm up and points in a specific direction above you, roughly to the northwest. “You...should go that way, I think...”\n\nYou stare at him in disbelief for a moment, wondering what he's playing at. He surely didn't come along just to give you directions. Besides, you've been driving for hours and haven't seen any signs of inhabitable islands at all. It's worth a short, though, and might be better than just drifting through the skies without knowing where you're going.\n\nYour vessel is still losing altitude steadily, and that worries you. You don't want to find yourself getting too close to the surface. Nevertheless, you manage to gain some height by pushing the levers on the dashboard as far as they can go, adding an extra boost to the engines and burning more fuel than usual. This had better work. The craft shifts upwards at a steep angle, and you lean back on your seat; the cannibal behind you lets out a cry of alarm as he is almost jolted off the vessel into the void.\n\n“What was that for?” he demands, clutching onto the back of the vehicle with both hands and holding on for dear life. “You almost threw me off!”\n\n“This craft is nearly out of energy,” you say. “There's something with the altitude on this thing...”\n\nYou climb steadily for about fifteen minutes, breaking through a new layer of clouds. At once, you spy a small fragment of an island, almost invisible to the naked eye from this distance. It seems to have broken off from a greater land mass, possibly the victim of the chaos on the surface. You almost missed it from here.\n\nThe island looks to be too small to offer you many favourable options, but you’re in no position to pass up the opportunity. Your vehicle is in dire need of maintenance, since you don't know how much longer you can keep it airborne. Only skill and luck have managed to keep it going for so long up to now. As far as provisions go, you've had limited food to keep you going, and you’re extremely tired. As things stand, you’ll just have to take a chance on this.\n\nHoping that you won’t regret your decision, you disembark upon this small patch of island. Hopefully there's some kind of intelligent life here, and if you're really fortunate you might be able to find someone who can fix your vessel. Perhaps…\n\nThere is a roar of engines behind you.\n\nYou whirl around to see that the man who guided you here has seized control of the aerial vehicle and is driving away from the island, almost straight down. With a yell, you dart forward to confront the cannibal, but he has already disappeared below. You're never going to see it again. He has effectively stranded you here in the middle of nowhere.\n\nWith little choice left to you, you decide to investigate the tiny island around you. Perhaps you can make the best of a bad situation.", "action_results": [null]}, {"action": "Refuse and drive away from here as quickly as you can", "result": "The sight of this cannibal gorging himself upon the bodies of his dead comrades sickens you to no end. You're not staying here a second longer. Without hesitation, you strap yourself back into your vehicle and fire up the engines, speeding as far away from the airship as you can. You can feel the man's gaze burn into your back as you depart.", "action_results": [{"action": "Proceed", "result": "You continue to fly forward for about an hour, mindful that your craft is now losing altitude at a rapid pace. The gauges on the dashboard are showing warning signs, but you still don’t understand what they mean. Power? Are you losing power now? You still haven’t seen a single island since the last one, and there’s nowhere for you to land at all…\n\nThe vehicle falls through the clouds, and you realise you are getting dangerously close to the surface. No. No, you can’t go this way. You’ve already seen the kind of chaos that’s happening down there. You saw every little part of it with the captain on the airship. Your place is up in the sky, among an island where you belong…\n\nYour vessel runs out of power, and now you are veering towards the rocky ground below at a deadly speed. Frantically, you try every button and dial which makes any kind of sense. Anything. There has to be something which can slow down your descent. This isn’t what you wanted at all. Parachutes? Destabilisation of air pressure? No, of course not, of course this type of vehicle isn’t designed for going anywhere near the surface…\n\nYou’re so close to the surface of the planet now. You can see people down there. Buildings burned to the ground, screams and crying, the lava flow from an erupted volcano, mass flooding from the rising sea level…It’s not a place where you could ever survive. You need to stay in the skies. You need to stay up here…\n\nThe noise from below gets louder and louder until it becomes almost unbearable. Your vehicle is not going to stop. Praying very slightly, you brace yourself for a crash landing.", "action_results": [{"action": "Proceed", "result": "The impact is tremendous sending multiple shockwaves through your vehicle as it crashes into the ground, continuing forward for several more metres before coming to a grinding halt. Waves of pain wash over you, and for several long seconds you cannot move at all. You feel as if you have broken several bones in your body. Smoke billows out from the front of your vehicle, and you see that the exterior has been completely ripped apart. At the same time, it has cushioned the blow for you.\n\nYou are alive. You can hardly acknowledge the fact, but you are alive. Sparks fly from the dashboard, igniting another smaller fire within the interior, and you force yourself to get to your feet. Agony rushes through your body at every little movement, prompting a scream from your throat. You grit your teeth and keep moving. You need to survive.\n\nYou manage to force open the door. It's so badly damaged from the crash that it practically falls off its hinges. You can hear the screams from here.\n\nThe ground is blackened and burnt, and not because of the impact of your arrival. No, it was already like this. You have landed at the edge of what used to be a peaceful village. Buildings lie in ruins, farm animals lie dead on their side or half-devoured, and any crops have long since been the victim of multiple fires which raged here.\n\nThere are people around you.\n\nThey do not look like people. Humans, yes. You haven't seen a human being for a long time, but you know what a rational person look like and these are different from that. Their clothes are ripped and torn, their skin covered by a mesh of angry black spots which suggest the telltale designs of disease, and there is a frenzy in their eyes which frightens you beyond anything you have witnessed so far.\n\nThe people around you have not reacted to your crash landing. They are screaming at the top of their voices, wielding vicious blades in their hands, and killing each other on sight. Countless corpses litter the blackened ground as far as the eye can see, like the gruesome remnants of some kind of battlefield. It's as if a war is going on, but you can see here that the war is purely internal.\n\nYou see two men beating another to death with a hatchet. A crowd of children have surrounded a woman and are stabbing her repeatedly, all with the same murderous frenzy in their eyes. Three girls are gouging out the eyes of a bystander. A strange haze has settled upon this place, this peaceful village that saw no such violence before. Everything has gone out of control. You knew the situation on the surface was dire, but you had no idea that it had escalated to such extremes...\n\nDesperately, you run for the safety of your aerial vehicle, even though there is no chance of getting it off the ground anymore. You can't take this. This is not an atmosphere in which you can survive. The people around you do not look as if they have eaten for days, a fact which hardly seems to bother them as they repeatedly murder each other on the spot with little regard as to the consequences. You are stranded on the surface of a world gone insane, and little hope remains to you at all.\n\nYou limp forward a few more steps before the pressure on your broken leg sends you crashing to the ground. The pain flares up anew, and you claw at the dirt around you. Your hands grasp at the morbid remains of a grinning human skull.\n\nThe humans turn around at the noise of your fall and shamble forward slowly, before charging towards you in a frenzy of bloodlust. All of them are already covered by vicious cuts and wounds which would usually kill a normal person, but these people do not seem to notice their injuries. They are far too gone. No semblance of reason remains in their minds. Not anymore.\n\nThe last thing you see is the irrational hatred and rage burning in their eyes, before your body is hacked to pieces by the inhabitants of the surface. Your screams are lost in a storm of mindless insanity which has already engulfed everything around you, mind and soul. You perish here, upon arrival.", "action_results": []}]}]}]}, null]}, null]}]}, {"action": "Deny that you have anything to do with the Gahl’vuhr Sehn", "result": "“I promise you that I have nothing to do with the Gahl'Vuhr Sehn,” you tell him in a sincere tone of voice. Even as you speak, you realise that the vehicle you took from the airship has the telltale emblem of the Gahl'Vuhr painted on its front, and hope that the Tenur does not think to look. You hold his gaze, mindful of his current temperament. “Can you offer me shelter today upon this island? It would be nice to have someone show me around.”\n\nYou play upon his insecurities and any remaining doubt vanishes from his face. He smiles with both mouths. “Of course,” he says, extending one hand towards you. “Come this way. I would be happy to be your guide for today.” You take his hand, and notice the colour of his skin tone fluctuate ever so slightly. “Whilst we walk, perhaps I can tell you a little about the history of this island. Our ancestors first colonised this region of the skies over three hundred and fifty years ago...”\n\nHe clearly likes to talk and you spend some time getting acquainted with the Tenur male, who seems quite smitten with you. You're not sure that you find Tenurs particularly attractive in return – they do have two mouths in their head, after all – but you are keen to take advantage of his feelings. You decide not to risk going back to your vehicle and instead remain with your guide for the rest of the day.\n\nOne thing leads to another, and you start making enquiries about possible lodging and settlement upon the island. You soon learn that the Tenur man can put you in touch with various contacts in town. Money is no problem here; rather, Tenurs value work and resources to trade rather than currency, and you work to secure a steady job for yourself. The island is in need of miners, couriers and helpers for building work and you soon find an available position.\n\nAfter that, the rest of the week passes quite quickly. You become close friends with the Tenur man and become acquainted with many people in his circle, as well as other Tenurs at your place of employment. A settlement has been reached. Before the end of the week, you even procure a name for yourself so as to fit into Tenurian society. Annabel. That's what you call yourself now. Annabel. It has a nice ring to it, and you refuse to answer to anything but that. Nobody can call you Unworthy anymore.\n\nAn entire month passes, and you find that you are enjoying month here with the Tenurs. The vehicle you used to travel here is found smashed up just a week after that, turned into scrap metal. Apparently, the locals here really don't like the Gahl'Vuhr Sehn. It's a good thing you didn't associate yourself with the organisation, because the people here seem so friendly otherwise.\n\nMonths turn into years, and you soon forget about the chaos happening on the surface far below. There's nothing to fear here. There is frequent news about the other islands which have fallen, but the Tenurs are a proud people and often talk about how the humans have destroyed themselves. It's nothing for you to be concerned about, really, so long as that kind of destruction doesn't affect your daily life.\n\nYou amass enough resources to improve your place of residence, and even start moving in with a few Tenur males who are interested in you. In fact, you become quite popular upon this island. You spend your resources wisely and save when you can. You have much to look forward to. You start to think about the future, about marriage and children and what prospects you have for them upon this island. The future is bright. This island is not going to fall, after all. The people here have amassed enough energy and resources to keep it going for a long, long time.\n\nYou end up settling permanently upon the Tenurian island, content with the life you lead right now. Not a day goes by where you regret your decision. Sometimes you gaze up into the sky and wonder about the crew of the airship that saved you, about the captain and Mother Ghared. They probably didn't survive. You are glad to live on.\n\nAfter falling from a great height, there is no longer anything that can hurt you anymore.  ", "action_results": []}]}, null]}]}, {"action": "Push the button which says “Sflf-dfstrvct”", "result": "As soon as you push the button, the entire dashboard lights up. Alarmed, you freeze in your seat as the controls start to glow faintly. A few seconds later, the vehicle explodes in a great ball of fire, taking you with it! You have initiated the self-destruct sequence set into the craft, installed by the Auvahrs for use in dire emergencies, and your death is instantaneous. You perish here upon the airship, trying to escape.", "action_results": []}]}, {"action": "Decide not to risk it and continue searching for another way out", "result": "You continue searching through the other cabins for any alternative methods of escape. The ship is shaking rather violently by now. Within minutes, cracks begin to appear in the walls and ceiling, until you realise that the damage to the vessel is more serious than you thought. Frantically, you dash into one of the last cabins to find an escape route as quickly as possible.\n\nHowever, you are far too late. The opportunity has already passed. The ceiling of the cabin caves in from above, and your body is crushed under tons of falling rubble. You do not live to see what happens next, but the rest of the airship is destroyed minutes afterwards. You perish here on the airship, in the midst of a violent lightning storm.", "action_results": []}]}]}]}, null]}]}]}]}]}]}]}, null, null, null, null]}]}, {"action": "Decide not to and go back downstairs", "result": "You decide not to trust the woman and retreat back down the stairs. She is already several steps ahead and does not notice that you are not following her until you are well out of sight. Quickly, you decide to return to the corridor below and head to the right, where you heard the voices before.", "action_results": [{"action": "Proceed", "result": "You follow the corridor for some time as the voices become more distinct. They sound rather jovial and cheerful in nature; foreign, too, because they are speaking in a language that you do not understand. It should not be surprising at that, since there are many different varieties of races which populate the skies, each of their own language and culture. Having never left the relative comfort of your own island before, you are unacquainted with the language of any other species.\n\nAt the end of the corridor is a large room filled with uniformed men and what you assume to be soldiers. Mercenaries, more likely, from their get-up. Large groups of them are gathered around each table, drinking from mugs and chattering to one another at great volume. Is this some kind of bar, perhaps? It seems a little rough and rowdy for your taste.\n\nYou look around and see that the place is not in good condition. Furthermore, none of the men in this room are human. Of course, neither are you, but you do not recognise their kind. Their skin colour varies from pearly-white to a pale purple, and many of them appear to sport partial reptilian features. Are these people really your rescuers? From the way they are looking at you now, you are inclined to doubt it…\n\n“Vnwprthy!” one man shouts, as you step into the room. His gaze is fixed upon you steadily. “Jt’s thf Vnwprthy! Shf’s vp bt lbst.”\n\nSelf-conscious about the sudden attention, you automatically tense yourself, but the mercenaries here do not seem necessarily aggressive. All of them are armed to the teeth with various edged weapons and crossbows which are slung across their backs, but even so they appear to be regarding you with genuine curiosity. Perhaps they are just as fascinated by your unique appearance as you are by theirs. Low murmuring echoes through the room, with a few of the man shaking their heads at you. You do not understand the significance of such a gesture.\n\n“Vnwprthy,” one of the men says, standing up and walking towards you. He smiles at you warmly and makes a gesture you do not recognise. “Brf ypv wfll? Ypv’vf bffn bslffp fpr b lpng tjmf. Hpw dp ypv fffl? Brf ypv rfstfd?”\n\nThe brief silence which follows his words suggests that he has asked you a question, and is expecting an answer from you. Unfortunately, you haven’t the faintest idea what he just said.", "action_results": [{"action": "Nod your head in answer", "result": "The mercenary seems satisfied with your answer, and you sense that you have given the correct response. “Thbt's gppd,” he says in a gracious tone of voice. “Npt mbny svrvjvfd thf fbll. Ypv wfrf pnf pf thf lvcky pnfs.” The man sits down on one of the chairs and calls over to one of his companions. “Hfy, thf Cbptbjn wjll wbnt tp sff hfr npw thbt shf's bwpkfn. Spmfpnf tbkf thf Vnwprthy tp sff hfr, vndfrstbnd?”\n\n“Svrf thjng,” the other man ventures, getting up and moving towards you. “Cpmf pn,” he says to you, beckoning you over with one finger. “Thjs shpvldn't tbkf tpp ljng.”\n\nYou do not understand his words, but it seems that he wants you to follow him.", "action_results": [{"action": "Follow the mercenary", "result": "You follow the mercenary to the far end of the corridor, towards where a set of stairs lead to the upper level, feeling the wind grow stronger as you do so. Soon enough, you find yourself standing once more upon the upper deck of the airship. It still feels quite surreal, staring out into open skies at such a great height, and you don't think you'll ever get used to this.\n\nYour guide watches you curiously as you gaze over the deck of the airship, before motioning you forward. Resignedly, you follow him into another part of the airship, through twists and turns in the corridors. As you walk, you pass several more uniformed men who watch you with interest. Only now do you realise that they must be part of the ship's crew.\n\nAfter a few minutes, the mercenary leads you to a brass door which lies at the top of a final flight of stairs. There is a sign on top of the door, but you lack the knowledge to read the symbols and runes displayed there.\n\n\"Gp jn,\" he says, gesturing for you to enter. \"Thf cbptbjn bwbjts ypv.\"\n\nAt his request, you push open the door and enter the room beyond.", "action_results": [null]}]}, {"action": "Shake your head", "result": "“Ypv'rf npt?” The man seems to be confused by your answer. “Np. Np, ypv're...” He scratches his head and gives you a funny look. “Pf cpvrsf! Vnwprthy. Lvngvbgf...laaa….lan...” For some reason, the mercenary seems to be having a hard time speaking, as if he can't pronounce the word right. “Lan...lang-goo...”\n\n“Lan-goo-rah?” another one tries.\n\nHe shakes his head, gesturing to you. “Lan...lan-grah. Lan-gredge. Language. Lan-gruage bah...bah-wee-uh...barrier...” The man steps forward in your direction, an inquisitive look in his eyes. “We...we do not...we do not speak your...” He winces again. “Your lan-grah...”\n\n“Language,” you say helpfully, getting the gist. You try nodding.\n\nHe smiles and nods too. “Yfs.”\n\n“Yes,” you say.\n\n“Yfs,” he says, nodding more enthusiastically. Then he shakes his head emphatically. “Np.”\n\n“No,” you say.\n\n“Fxbctly.” A nod of the head. “Yfs.” Shake of the head. “Np.” He sighs. “Js hbrd...is hard.”\n\n“Hard,” you agree.\n\nHe sits down on one of the chairs and calls over to one of his companions. “Hfy, thf Cbptbjn wjll wbnt tp sff hfr npw thbt shf's bwpkfn. Spmfpnf tbkf thf Vnwprthy tp sff hfr, vndfrstbnd?”\n\n“Svrf thjng,” one of the other men ventures, getting up and moving towards you. “Cpmf pn,” he says to you, beckoning you over with one finger. “Thjs shpvldn't tbkf tpp ljng.”\n\nYou have a very limiting understanding of his words, but it seems that he wants you to follow him.", "action_results": [null]}, {"action": "Look at him blankly in response", "result": "The silence continues for several more seconds, until the mercenary starts to exchanges worried glances with the others. “Js spmfthjng wrpng?” he says to you, a concerned expression on his face. “Djd ypv npt fvlly vndfrstbnd me?”\n\nA look of realisation suddenly washes over him. “Pf cpvrsf! Vnwprthy. Lvngvbgf...laaa….lan...” For some reason, the mercenary seems to be having a hard time speaking, as if he can't pronounce the word right. “Lan...lang-goo...”\n\n“Lan-goo-rah?” another one tries.\n\nHe shakes his head, gesturing to you. “Lan...lan-grah. Lan-gredge. Language. Lan-gruage bah...bah-wee-uh...barrier...” The man steps forward in your direction, an inquisitive look in his eyes. “We...we do not...we do not speak your...” He winces again. “Your lan-grah...”\n\n“Language,” you say helpfully, getting the gist.\n\n“Yfs. Language barrier.” He sits down on one of the chairs and calls over to one of his companions. “Hfy, thf Cbptbjn wjll wbnt tp sff hfr npw thbt shf's bwpkfn. Spmfpnf tbkf thf Vnwprthy tp sff hfr, vndfrstbnd?”\n\n“Svrf thjng,” another man ventures, getting up and moving towards you. “Cpmf pn,” he says to you, beckoning you over with one finger. “Thjs shpvldn't tbkf tpp ljng.”\n\nYou do not understand his words, but it seems that he wants you to follow him.", "action_results": [null]}]}]}]}, null]}]}, null]}, null]}, null, null]}]}]}]}, {"action": "Try to move to a different location", "result": "It would be foolishness to remain here. As quickly as you can, you crawl out of cover into the open. Almost immediately, you are buffeted by the force of the wind on your back. You dig your fingernails into the ground at your feet, refusing to let go. You will not die here, not so easily, like a candle sputtering out in the midst of total darkness. You are determined to survive.\n\nBehind you, the wall of your house collapses and crumbles apart. There’s no going back now. The wind is now fiercer than ever.", "action_results": [{"action": "Call out to your neighbours for aid", "result": "You raise your voice and let out a desperate cry for help, but your voice is drowned out by the sound of the wind. Your plea goes unheard. In any case, your neighbours and friends have their own problems to deal with. During a crisis of this nature, the act of helping another soul would compromise the safety of another. Nobody is going to help you. This is the reality that you're faced with.\n\nThe wind suddenly picks up speed, and you are thrown off your feet, clumps of grass falling uselessly from your bleeding fingers. You scream as you are flung from the surface of the island, spiralling towards certain death far below…", "action_results": [null]}, {"action": "Inch your way towards one of the few houses still standing", "result": "Gritting your teeth, you pull yourself along the ground at a painfully slow pace towards one of the more sturdy-looking houses. You can already see several faces huddled inside the walls, frightened and helpless at what is going on outside. As you draw nearer to them, you see panic rise in their eyes, as if your mere presence is compromising their chances of survival. Perhaps they are simply too scared to move.\n\nThe door, miraculously, appears to be secure. You duck your head down as the wind buffets against your back, and succeed in making it to the threshold. It is then that you discover that the door has been locked and bolted from the inside. The people inside remain huddled together, staring out at you with empty expressions.\n\n“Let me in,” you cry out to them in desperation, banging on the door with your fists. Your fingers are bleeding from clutching the ground, and you dare not raise your head too far up. “Please. Let me inside!”\n\nNobody unlocks the door. Nobody dares to move.\n\nYou are still frantically banging on the door when the wind picks up and throws you off your feet. The people's stares burn into you as you are flung from the surface of the island, screaming as you spiral towards certain death far below…", "action_results": [null]}, {"action": "Maintain your current position and hold on for dear life", "result": "You feel that there is no use in moving from here. The slightest motion might give the wind enough leeway to knock you off balance. You grit your teeth and hold on tight, aware that you are exposed and vulnerable, but hopeful that you will be able to get through this. You may be alone, but your strength of will has seen you through many trials in life. You can do this...\n\nThe wind suddenly picks up speed, and you are thrown off your feet, clumps of grass falling uselessly from your bleeding fingers. You scream as you are flung from the surface of the island, spiralling towards certain death far below…", "action_results": [null]}]}]}, {"action": "Pick up some of the fragments of wood", "result": "You scramble across the floor to where your bed used to be. It is now nothing but rubble, broken into multiple pieces by the pressure of the fall. Most of the fragments are too small to be of any use, but you do find a few sturdy pieces which could be used as a weapon. A weapon? Why on earth are you thinking of weapons now? The realisation comes in an instant: the world really has gone wrong. The crumbling of your island may not be the only danger which awaits you. You need to get your hands on everything you can get.\n\nThe wind is now powerful enough to shred this little piece of wood into pieces, so you hastily tuck it inside your thin tunic for safekeeping. Perhaps it will come in useful later, assuming you have a future to look forward to...\n\nAt your back, small cracks start to spread out across the walls of your house. The entire island is shaking, causing the cracks to widen.", "action_results": [null, null]}]}, null, null, null]}]}