{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=53356", "context": "", "first_story_block": "The HMS Bounty set sail on a gloomy winter’s day a few days before Christmas.\nYou like the little ship, which is just ninety feet long and fairly small at just over 200 tons for the 46 men she carries. She has three masts and sails extremely well however and you are quite content aboard her, despite the gloomy weather. She carries four small cannons for defense and a compliment of muskets and cutlasses as well as enough provisions for the voyage. The purpose of the voyage is to sail to Tahiti to pick up breadfruit and transport them to Jamaica to feed the slaves who work the plantations there. It should be an easy enough voyage.\n\nIf you are soon familiar with the ship but the crew are more difficult. You have joined them as an Able Seaman for what should be an easy voyage but there are far too many of men on the ship to remember all of their names. The one name you do remember is Lieutenant William Bligh, the ship’s commander. He is a chubby, little man with very white skin, wispy fair hair and blue eyes looking for all the world like a little girl’s porcelain doll. Bligh is supposed to be a superb navigator, having sailed under the famous Captain Cook, discoverer of Australia, on his last voyage, but he seems a bit excitable and a little difficult to take seriously.\n\nAlmost from the beginning the ship seems to hit bad luck. The weather in the Channel is awful and barely have you sailed out of port than you lose your grip while climbing the rigging. You are plunging towards the deck and almost certain doom when you manage to grab a rope tied between two sails, halting your fall with a heart-stopping judder. Days later a storm breaks the windows of Bligh’s cabin, quickly flooding it with water.\n\nAs the year of 1788 and the voyage of the Bounty begins you hope that things will get better…\n\nNOTE: PICK UP THE CREW LIST TO HELP YOU KEEP TRACK OF WHO IS WHO IN THIS STORY.", "action_results": [{"action": "The Atlantic", "result": "After leaving the English Channel the weather does indeed improve and you stop off at the Canary Islands for a week. Spirits are high as you sail onto the southwest bound for Tahiti, an island which you have heard of but have no idea where it is. You gather Bligh intends to sail around Cape Horn, the southernmost tip of South America, to get there. The ship is sailing so well Bligh decides to promote a protégé of his called Fletcher Christian from Master’s Mate to Acting Lieutenant, effectively making him Bligh’s deputy.\n\nLike everyone else on board the ship you like Christian. He is a cheerful and very likable young man, though a slightly sensitive soul who takes a solicitous interest in everyone’s welfare. His promotion comes at the expense of the Sailing Master John Fryer, a professional man, whose strong, independent opinions seem to irritate Bligh. He takes Christian’s promotion without a word but some of the crew are not so subtle.\n\nMatthew Quintal is one of your fellow seamen, a young Cornishman and a natural-born trouble-maker, always looking for an opportunity to make a little mischief. One morning he is scrubbing the deck close to where Fryer is sighting the sun with a sextant and begins to mock Fryer about Christian’s promotion, lightly at first and then more harshly when Fryer shows no response. Some of the other sailors standing nearby are exchanging glances and grinning.", "action_results": [{"action": "Join Quintal in mocking Fryer", "result": "You join Quintal in ribbing Fryer about Christian being replaced over him. He takes it all with ill-tempered terse sentences but suddenly there is a bizarrely high-pitched cry from further up the deck, you glance up to see Bligh striding towards you.\n\n“You infernal scoundrels!” he roars. “How dare you cowardly rascals show such insolence and contempt for Mr Fryer! Mr Fryer, how came you to permit such a thing to happen sir? Twenty-four lashes each to remind you men of the proper way of addressing your superiors! Master-at-Arms, fetch the lash! Quartermasters, prepare these men!”\n\nHardly before you know what is happening strong hands have seized you and Quintal, stripped the shirts from your backs and your are being roped to the mast. The Quartermasters stand behind you and on Bligh’s orders begin to whip you mercilessly with the lash, which burns like a fire. Soon it is stripping flesh from your back and just as the agony is becoming unbearable the punishment is over.\n\n“May that be a lesson to you all!” Bligh declares.", "action_results": [{"action": "The Horn", "result": "After the lashing of Quintal you and the rest of your crew go about your duties quietly and you soon come upon Cape Horn in atrocious weather. For over four weeks Bligh tries to sail the Bounty into the face of a terrible wind, tacking into the face of a gale. You and several other sailors come down with fevers, brought on by constant exertion in freezing rain and tiredness, and finally Bligh admits defeat and turns the ship east.\n\nYou will sail to Tahiti east, around the southern tip of Africa instead. Despite the storm damage the Bounty makes good speed and arrives off Cape Town on the tip of South Africa after a month of sailing. Bligh steers the Bounty carefully into the busy harbor and you and another sailor called John Williams are sent to sound the depths with a lead line. You are both feeding the rope out when the lead snags on some rocks far below. Because the Bounty is still going pretty fast the rope starts sliding rapidly through your hands cutting them badly.", "action_results": [{"action": "Hold on", "result": "You grimace and grasp the rope tight. Williams releases the rope and it drags you across the deck, slamming you painfully into the railing and you are nearly lost overboard but suddenly the lead comes free and you haul it up on the line. Williams, blowing on his burnt hands, only watches you when suddenly you hear a familiar high-pitched cry and look up to see Bligh striding towards you both.\n\n“You incompetent mongrel!” he spits at Williams. “Why did you not help that man? Six lashes for neglect and dereliction of duty!”\n\nThe lash is fetched again, Williams is tied to the mast and the Quartermaster once more lays into him, drawing blood. Bligh doesn’t even look at you, merely watches the punishment coldly until it is over and he returns to his cabin.", "action_results": [{"action": "The Pacific", "result": "After making it safely into Cape Town the Bounty spends nearly a month resupplying and repairing storm damage, allowing you plenty of time to enjoy the delights of that port. You set sail again on the first day of July and the following month you arrive at Adventure Bay on the island of Tasmania to the south of Australia. You pause there again to re-supply and sail on again in September bound for Tahiti. Spirits are high on board as you near your destination.\n\nUnfortunately, you and another sailor called James Valentine begin to develop a breathing problem, sometimes after exertion you find you have difficulty catching your breath. You and Valentine decide to see the Ship’s Surgeon, a heavy-drinking red-faced fat man called Thomas Huggan, who seems rather surprised to be consulted on something medical. Huggan examines you both, wheezing the whole time, and when he has finished he wipes the sweat off his face and gulps down a glass of rum.\n\n“Internal disorder of some kind,” he tells you both. “Probably too much blood in your spleens. If you would let me open a vein I will bleed you both about a pint and this will relieve the pressure on your organs, you’ll be up and down the rigging free as birds then.\"\n\nYou and Valentine exchange glances.", "action_results": [{"action": "Agree to let the Surgeon bleed you", "result": "The Surgeon fetches a grimy scalpel, spits on it and rubs it with a dirty cloth to clean it and slices open veins in your arms. Blood immediately pours out like a high-power hose and Huggan looks rather alarmed. With difficulty he manages to secure bandages to both your arms and pronounces you good as new. You are both doubtful, particularly as the bleeding doesn’t really stop but continues to ooze out of your cuts. Within days you have lost all feeling in your arm.\n\nWhen you peel the bandage away you find the area around the wound has turned green and black. You and Valentine are soon both feeling faint and feverish, forced to remain in your hammocks as almost your entire arms turn black. It doesn’t take you long to realize you are dying but there is nothing Huggan can do. Bligh learns of the situation, visits you both and rages at Huggan but your days are numbered.\n\nYou die two weeks before the Bounty reaches Tahiti, the first of that ill-fated crew to perish.", "action_results": [{"action": "You are Dead", "result": "You have died too early in the story to even experience the Mutiny on the Bounty. Your only option is to return to the beginning of the story and try to live longer by making different choices. After the Mutiny on the Bounty if you die you may end the game and leave a comment.\nBetter Luck this time!", "action_results": [{"action": "Back to the Beginning...", "result": "The HMS Bounty set sail on a gloomy winter’s day a few days before Christmas.\nYou like the little ship, which is just ninety feet long and fairly small at just over 200 tons for the 46 men she carries. She has three masts and sails extremely well however and you are quite content aboard her, despite the gloomy weather. She carries four small cannons for defense and a compliment of muskets and cutlasses as well as enough provisions for the voyage. The purpose of the voyage is to sail to Tahiti to pick up breadfruit and transport them to Jamaica to feed the slaves who work the plantations there. It should be an easy enough voyage.\n\nIf you are soon familiar with the ship but the crew are more difficult. You have joined them as an Able Seaman for what should be an easy voyage but there are far too many of men on the ship to remember all of their names. The one name you do remember is Lieutenant William Bligh, the ship’s commander. He is a chubby, little man with very white skin, wispy fair hair and blue eyes looking for all the world like a little girl’s porcelain doll. Bligh is supposed to be a superb navigator, having sailed under the famous Captain Cook, discoverer of Australia, on his last voyage, but he seems a bit excitable and a little difficult to take seriously.\n\nAlmost from the beginning the ship seems to hit bad luck. The weather in the Channel is awful and barely have you sailed out of port than you lose your grip while climbing the rigging. You are plunging towards the deck and almost certain doom when you manage to grab a rope tied between two sails, halting your fall with a heart-stopping judder. Days later a storm breaks the windows of Bligh’s cabin, quickly flooding it with water.\n\nAs the year of 1788 and the voyage of the Bounty begins you hope that things will get better…\n\nNOTE: PICK UP THE CREW LIST TO HELP YOU KEEP TRACK OF WHO IS WHO IN THIS STORY.", "action_results": [null, null]}]}]}, {"action": "Politely decline", "result": "You politely refuse and Huggan shrugs, fetches a dirty scalpel and slices Valentine’s arm open. Blood sprays out over the walls and a startled Huggan desperately staunches the bleeding with a stained rag. He bandages Valentine’s arm but the damage is done. Over the following days the wound continues first to bleed, then to ooze and Valentine becomes increasingly faint and weak. Soon his entire arm is black and green.\n\nWithin days Valentine is consigned to his bunk, feverish and fading. Huggan is powerless to do anything, when Bligh learns of the situation he rages at the Surgeon in the most violent language possible. Valentine continues to weaken and dies late one night. A somber mood descends over the whole crew as he is sewn into his hammock and the following morning it is cast into the sea. You sit next to his body on the first night thinking grimly how that could have been you.", "action_results": [{"action": "Sinking spirits", "result": "Valentine’s death sends the crew’s spirits plunging low and Bligh decides to raise morale by instructing the crew to dance a jig to the tunes of a half-blind fiddler he has brought on board. The last thing the crew feel like doing is dancing but the sailors obligingly force themselves to their feet and dance wearily to the tunes the fiddler plays. You are dancing when you notice two men are remaining seated.\n\nWilliam Brown, a mild scientific man who Bligh brought on board as a botanist to take care of the breadfruit plants is talking quietly to John Mills the Gunner’s Mate, a tough and unfriendly older man. You see Fletcher Christian go over and encourage them to dance but Mills shakes his head emphatically and Brown lowers his head. Christian shrugs and walks away.", "action_results": [{"action": "Join the two men in their refusal", "result": "You walk over and sit next to Mills but you have been spotted.\n\nBligh yells for the music to stop and strides towards you three.\n\n“Why are you not dancing like the others?” he demands.\n\n“It does not seem like an appropriate time for that,” Brown says quietly.\n\n“Damn you for contemptible rascals,” Bligh cries. “All three of you will have your grog stopped from now until we reach Tahiti.”\n\nMills glares back at him with a half-smile on his face as Bligh turns, returns to his former position near the helm and orders the fiddler to keep playing. The punishment is a harsh one but not as bad as it could have been: a week later you reach Tahiti.", "action_results": [{"action": "Tahiti", "result": "You are all relieved when the beautiful tree-lined round island of Tahiti is spotted. Bligh has been getting on everyone’s nerves: he is no longer on speaking terms with Sailing Master Fryer, Surgeon Huggan or the Carpenter William Purcell and he has been grating the nerves of most of the rest of the crew. It is with relief that Tahiti is sighted and within hours hundreds upon hundreds of canoes packed with scantily clad but cheering Tahitian men and women surround the Bounty. The women are a particularly lovely sight.\n\nAfter a week anchored offshore Bligh sends Christian to lead a party of nine ashore in the ship’s cutter to begin setting up tents and making a camp for the crew to use while they gather the breadfruit. You are part of this group and are left with another sailor called John Adams to guard the boats. Adams is a clever young fellow and the two of you are chatting when you notice a pair of young ladies eying you from behind some nearby huts. When they see you looking they glance at each other and giggle.\n\nLike all Tahitians they are dark skinned and wear nothing above the waist, their full breasts and brown nipples peep out shyly between the strands of their long black hair. They seem to have more than a casual interest in you and Adams nudges you in the side and points at the women grinning. He suggests you go over, introduce yourselves and keep the young ladies company for a while.", "action_results": [{"action": "Go and get acquainted with the young ladies", "result": "With a shrug you go over with Adams to meet the two young ladies. With many smiles they lead you into an empty hut where they offer you some fruit and nut snacks and begin examining your skin and clothes. They don’t mind your touching them and when you kiss them they seem to like it and kiss you back. Before things can get too interesting you hear Christian calling your name outside and with a curse you and Adams give your new friends a goodbye kiss and hurry outside.\n\nChristian is all smiles and thanks you both for doing your bit to improve England’s relationship with the Tahitian people, with embarrassed smiles and to the, slightly jealous, quips of your companions you row back to the Bounty for the evening. Bligh talks to Christian after you arrive and as you and Adams are clearing the boat after swinging it in he suddenly gives a high-pitched yelp.\n\n“A gudgeon is missing!” he exclaims. “You damned fools, where is the aft gudgeon?”\nYou and Adams both look for the little metal tube that fixes to part of the rudder but it is indeed missing. Inevitably Bligh fetches Christian, who reluctantly confirms that you both left the boats unattended for a short time. Bligh yells at Christian before inevitably sentencing you both to twelve lashes each for the disappearance of the little metal tube.\n\nLater as you lie down in your hammock, your back burning, you reflect that you are really beginning to hate that man.", "action_results": [{"action": "Discontent", "result": "The Bounty remains anchored in Matavai Bay for the next month while every day Bligh, Christian or Fryer lead a party of men ashore to gather breadfruit trees. You get the impression that the men are working deliberately slowly to prolong their stay on Tahiti, as often as they are able the men contrive to spend time with the Tahitians in their villages. All of the Natives are extremely friendly and the women remarkably so. Christian and, surprisingly, Bligh are fairly relaxed about these interactions between the crew and the women but after a year at sea it would have been very unwise to try to restrain the men.\n\nBligh inevitably tries however. One day you are a part of a party that is working even more slowly than usual and Bligh is becoming irritable and orders you all to work faster. Repeatedly a sailor called Matthew Thompson, an older and extremely tough man keeps demanding, increasingly more insistently that he be allowed to go into the village. Bligh continues to refuse him. Finally, Thompson has had enough.\n\n“Damn you sir,” he growls. “If you were any sort of officer you would know better than to deny your men what they want.”\n\nThere is stunned silence following this outburst.", "action_results": [{"action": "Join Thompson in criticising Bligh", "result": "You speak up, agreeing with Thompson that is the way the whole crew feels. Bligh has gone very pale.\n\n“Damn you for mutinous dogs,” he growls. “Quartermaster, twelve lashes each!”\n\nThe lash is fetched, the blows are landed and your back is transformed into agony. Sullen and muttering the crew return once more to the Bounty.", "action_results": [{"action": "Defiance", "result": "Work continues on gathering the breadfruit plants while the crew members continue to enjoy the hospitality and affections of the local people. As well as the company of the women they now have strong locally-brewed alcohol to enjoy, though such gatherings have to be kept secret when Bligh is ashore. The lure of strong alcohol succeeds in drawing the overweight surgeon Huggan from his cabin (which he has rarely left for the last year) and he comes ashore.\n\nThe Tahitians find the fat, red-faced man great fun and the men insist on plying him with more and more alcohol. Finally, it is getting late and Christian, who is part of the party though not drinking himself, informs everyone it is time to return to the ship or risk the wrath of Bligh. Most of the men stumble to their feet and stagger towards the boat but Huggan is too far gone. Making a rude comment about Bligh he tells Christian to leave him there.\n\nChristian licks his lips nervously. Huggan as a Surgeon is a fellow officer and Christian has no authority to order him back to the ship, on the other hand Bligh is sure to notice his absence and punish Huggan in some way. When Christian points this out Huggan laughs and again voices uncomplimentary views about your Commander. Christian shrugs, turns to you and suggests you come back.", "action_results": [{"action": "Join Huggan on an all-night bender", "result": "You refuse and Christian reluctantly leads his party back to the ship. All that night you and Huggan down cup after cup of the burningly strong local spirits. The Tahitian men may be used to the strong alcohol but you not so much. Some time before dawn you lie down on your back and pass out. When the inevitable vomit comes your mouth is closed and it remains in your mouth and throat.\n\nYou suffocate and choke to death as the morning sun rises over this tropical paradise.", "action_results": [null]}, {"action": "Return to the Bounty", "result": "You join the rest of Christian’s group in returning to the Bounty. The following morning you again go ashore and find a group of Tahitian men gathered silently round the motionless figure of your ship’s surgeon. Vomit covers his face and hands and he lies unmoving on his back, his eyes shut. Christian calls out to him and when he doesn’t respond he examines him. At first you think he is dead drunk. You soon realize he is just dead.", "action_results": [{"action": "Paradise", "result": "After the death of Surgeon Huggan Bligh orders the Bounty sailed from Matavai Bay to Toaroa, a small bay and village further round the island. The reason Bligh gives is that there are more breadfruit trees there but the crew suspect it is to move them further from the scene of Huggan’s death and the temptations of alcohol and women. If that is the intention it is unsuccessful, there are even more of both at Toaroa.\n\nThe women are, if possible, even more free with their affections and breath-takingly beautiful, here and one of your fellow sailors, a friendly, bearded man called William Muspratt, comes up to you one day with an excited whisper as you are moving breadfruit trees as part of a party under Bligh. He tells you he has found some exceptionally affectionate Native women who will apparently trade sex in exchange for odd trinkets such as coins, utensils like cutlery or other odds and ends. He tells you he is going to sneak away now and offers to show you where they may be found.", "action_results": [{"action": "Accept his offer", "result": "You and Muspratt sneak away from the work party and go to the huts Muspratt found before. He goes in one and you go in the other. You are a little nervous and uncertain this is wise as you step into the darkened interior of the hut. Inside, as your eyes adjust you see a pretty young lady lying under a blanket on the floor, she props herself in one elbow and smiles at you. Nervously you put a spare belt buckle on the floor and she folds back the blanket to reveal she is naked underneath, dark and soft in the darkness.\n\nFifteen minutes later you are really starting to enjoy yourself when a small figure strides into the hut.\n\n“What do you think you are doing you infernal rat?” Bligh barks at you. “Climb off that person, get dressed and come outside at once.”\n\nHe storms from the hut and you sheepishly emerge minutes later, your clothes reassembled and reapplied to you. Muspratt is looking similarly crestfallen and of course Bligh has his quartermasters standing by. You and Muspratt both get twelve lashes each, your backs burn like they are on fire and so it goes on.", "action_results": [{"action": "The temptations of Tahiti", "result": "Word soon spreads among the crew that Muspratt has found what amounts to a brothel in Toaroa, though actually many of the Native women seem happy to perform sexual services in exchange for gifts. One of your fellow seamen Robert Lamb, who often cuts the meat for the cook, decides to sneak off the next time he is in one of Christian’s work parties and give away his cleaver in the hope of getting two women at the same time. You have a knife and wonder if that would be worth the same.", "action_results": [{"action": "Sneak into the village with Lamb", "result": "You and Lamb walk off from Christian’s work group to the huts in the village. You make your offerings to the women and hold up two fingers to indicate your desires. To your amazement it works, two women lead Lamb away while two women guide you into one hut where you all hastily disrobe. Both women assume a position some might refer to as riding double and by the time you and Lamb stagger back to the ship that evening you are both feeling exhausted but rather at peace with the whole world.\n\nThis feeling lasts right up until you see Bligh’s mad face.\n\n“Impertinent dogs!” he screams in your faces. “You think a cleaver and a knife are not as valuable as your disgusting perversions? Quartermasters, twelve each!”\n\nThis whipping feels exceptionally agonizing on your already exhausted body.", "action_results": [{"action": "Rebellion", "result": "By the beginning of 1789 the crew have had enough of Bligh and his ways.\n\nCharles Churchill, a middle-aged Manchurian and the Master-at-Arms (the man nominally in charge of discipline on the ship) gathers you, the recently flogged Muspratt and another sailor called John Millward, a young and reasonably well-educated fellow, into a secret meeting a short way from the shore party.\n\n“I will tell you plainly boys I don’t care a damn for our Commander,” he whispers. “He deserves nothing better than to be shark bait for all I care. But this place is the closest thing to heaven on each I have ever clapped eyes on in all my years of sailing. I say tonight we take a boat and sneak away, Haywood has the watch with us tonight, he is ever sleeping on duty and besides was up most of last night at cards in the wardroom. I will get us a brace of guns each, we can take the cutter and sail round to Matavai Bay and from there light out to one of the smaller islands. After our shipmates have left on the Bounty we can return and live here forever.”\n\nIt is a bold but extremely dangerous plan, desertion can be punished with hanging. Millward and Muspratt quickly agree to it and all three turn their gazes on you. You know if you refuse you must promise to keep silent about the plan.", "action_results": [{"action": "Join the three men in deserting", "result": "To begin with your plan goes smoothly.\n\nMidshipman Thomas Haywood is a lazy and indifferent officer who usually sleeps on the nights he has the watches. You, Churchill, Millward and Muspratt climb aboard the cutter and row it away from the ship, by hard rowing all through the night you reach Matavai Bay by dawn and exchange one of your muskets for a sailing canoe. By noon you are paddling north for a small island called Tetiroa, which you have heard of from the Tahitians.\n\nYou make it to the island safely a few days later, though your boat capsizes as you reach the shore soaking your gunpowder and rendering your muskets useless. Notwithstanding this setback you take the boat ashore and set to work gathering edible fruits and nuts, coconuts and preparing nets and spears for fishing. The weather soon turns bad and for two weeks rainstorms lash the island. Soaked to the skin and huddled in what feeble shelters you can build from branches and leaves the four of you are beginning to reflect this might not have been a wise idea…\n\nEventually the weather clears and to your dismay you catch sight of the Bounty and dozens of native canoes sailing towards your little island. The Tahitians must have told Bligh where you have gone. Hiding would be pointless so when a party from the Bounty lands on the beach you all go to the edge of the tree line to meet them, muskets in hand. Bligh walks alone up to you, cutlass in hand, and halts a short way from you.\n\n“Men, if you come back with me without trouble this is what I will do,” he tells you angrily. “I will whip the three of you forty-eight times and you Mr Churchill twenty-four but then that will be the end of it. There will be no hangings, no further punishment, no more word of this will be spoken of. I will write a note to the Admiralty, that I will include when I submit my account of the voyage, stating that I have dealt with this matter accordingly.”\n\nIt seems to be the best you are going to get and the four of you surrender. You are taken back to Toaroa and flogged alongside an American sailor called Isaac Martin who punched a native man in the face for trying to steal an iron hoop from him. By the time the second flogging is over your back is mess of gristle, flesh and blood and you feel completely and utterly exhausted.", "action_results": [{"action": "Farewell Tahiti", "result": "Discontent continues to seethe in the crew as the last of the breadfruit trees are gathered. Two days after the last floggings someone cuts the Bounty’s anchor cable, apparently hoping the ship would drift away and that you would all be stranded in the paradise of Tahiti, it is only because there is no wind that night that the ship is not lost. Bligh is apoplectic, roundly cursing you all for a pack of traitors and has the spare anchor cable run down.\n\nThe following month a Tahitian man is caught trying to steal Gunner William Peckover’s bedding, Bligh has him flogged a back-breaking one hundred times and hung in irons for a week but the next day he either escapes or is released. So it goes on until by the end of March the gathering of the breadfruit is complete and over 1,000 healthy plants have been safely brought on board until the Bounty resembles a floating garden.\n\nOn the fourth day of April Bligh orders the anchor raised and the Bounty sails away from Tahiti to the great sadness and sorrow of both of the crew, most of which have at least one girlfriend and several male friends ashore by now, and the hospitable Tahitians who seem to have enjoyed spending time with their new visitors. The mood on board the ship is grim and tense, like an explosive ready to blow at any spark.\n\nBligh, as usual, provides such sparks.\n\nThe first comes three weeks after leaving Tahiti when the Bounty stops at Nomuka in the Friendly Islands to take on fresh water. Fletcher Christian is sent ashore with a party but Bligh orders him to leave his musket's ammunition behind for fear of harming the Natives and making them anti-English. Despite this order you and some of the other sailors in the party disobey the order and carry knives or dirks ashore. You take a small adze or hand-axe.\n\nNo sooner have you landed than dozens of Tongan Natives armed with spears, clubs and rocks come out and surround you all. Christian yells at them to clear away but the only response is what sounds like shouted threats and a few thrown stones. One warrior, a great big naked man in war-paint snatches your adze out of your hand. Unable to make any headway you are forced to return to the Bounty.\n\n“You cowardly rascals!” Bligh yells at you all. “You, Mr Christian, are you afraid to go through a set of naked savages when you have arms.”\n\nFor the first time you see Christian lose his temper.\n\n“The arms are of no use when your orders prevent them being used!” he cries.\n\n“You sir, are a coward!” Bligh declares and turns away in disgust.\n\nYou and your fellow sailors glance at each other. In England one gentleman calling another a coward would be considered grounds for a duel. Every single one of you feels sympathy for Christian who stands on the deck looking completely paralyzed by indecision.\n\nThe next day you put the Friendly Islands behind you and sail on west towards Australia.", "action_results": [{"action": "Bligh breaks Christian", "result": "The next afternoon Bligh is on at Christian again.\n\nYou are scrubbing the deck when you see Bligh suspiciously inspecting a pile of coconuts piled between two cannons.\n\n“Those coconuts look fewer than they did yesterday... why you damned hounds have been stealing my coconuts! You could not have done it unless your officers had known!”\n\nInevitably the ship’s officers, including Christian are called out and hear Bligh’s accusations.\n\n“No one has been stealing your coconuts sir,” Fryer says wearily.\n\n“Damn you, you must have taken them yourselves! Mr Christian, how many coconuts did you bring with you?”\n\n“I don’t know sir,” Christian replies. “I hope you don’t think me guilty of stealing your things.”\n\n“Yes you damned hound I do!” Bligh barks back. “You must have stolen them from me or you could give a better account of them, god damn you for a scoundrel, you are all thieves alike and combined with the men to rob me, I suppose you’ll steal my yams next but I’ll sweat you for it you rascals! I’ll make half of you jump overboard before we get through the Endeavour Straights!”\n\nBligh turns to the scowling Master-at-Arms Charles Churchill.\n\n“Stop these villains’ grog and give them nothing but half a pound of yams tomorrow to eat and if they steal any more I’ll reduce them to a quarter.”\n\nChristian steps forward and clears his throat.\n\n“Sir, this treatment is intolerable.” He says, his voice breaking. “My family have been gentlemen for twenty-five generations and not once have any of them been accused of being cowards or thieves without responding.”\n\n“God damn you, what does that mean!” Bligh explodes. “You sir are the worst of the lot, a contemptible thief, an infernal scoundrel, a cowardly rascal and an incompetent mongrel and that is what my opinion of you is sir.”\n\nBligh turns on his heel and storms back down to his cabin. The rest of the officers, avoiding Chistian’s eyes disband and wander down to their cabins or about the deck. Fletcher just stands there, his jaws grinding over and over. Finally, he goes below decks.\n\nFor the rest of the afternoon and evening there is one topic of conversation among the crew, a discussion about Christian and a feeling of great sympathy for him and great hatred towards Bligh. The rumors about Christian are wild: that he has been seen tearing up his personal papers, that he has given away many of his most valuable possessions to his fellow officers, that he has got some spare wood from the carpenter and is trying to build a raft out of it. You go out to the Officer’s Wardroom on an errand and find Christian lying listlessly in his hammock, eyes staring at the ceiling, an almost empty bottle of rum at his side.\n\nDespite your fears about Christian neither you nor any of the crew are ready for what happens next.", "action_results": [{"action": "Mutiny on the Bounty", "result": "Early the next morning you are woken from your sleep by wild and confused shouting that seems to come from all around the ship. You and the other sailors spring from your hammocks and rush out on deck to see a bizarre sight. Christian and several other men armed variously with bayonets, cutlasses and muskets are herding a loudly protesting and threatening Bligh out onto deck. His hands are tightly bound behind his back.\n\nChristian seems half-crazy, he is alternately yelling at Bligh and talking to his fellow mutineers and has a heavy sounding plummet hanging from his neck (you later learn it was so he could jump overboard and drown if the mutiny failed).\n\n“Knock Christian down men,” Bligh is shouting. “Knock Christian down!”\n\n“Hold your tongue or you are a dead man!” Christian screams in his face.\n\nJohn Fryer emerges on deck at cutlass point.\n\n“Fletcher, you must stop this,” he calls out.\n\n“I have been in hell for weeks past!” Christian shouts at him. “Commander Bligh has brought this on himself!”\n\nYou are not sure what is going on but Christian and at least a dozen of the crew seem to have taken control of the ship and no one is really opposing him, the only person arguing against him is the vitriolic Bligh. Christian has decided to cast Bligh and his loyal companions adrift and orders the jolly boat lowered but it found to have several leaks so he orders the cutter lowered instead. It soon becomes apparent that the cutter is too small for all the loyal crew who want to leave with Bligh.\n\n“You are all pirates!” Bligh shouts at Christian. “Any man who stays on this ship is a pirate and will be hunted down and hanged by the Royal Navy!”\n\n“Get him away!” men shout loudly.\n\nThe launch, a twenty-three-foot-long boat designed for fifteen men is soon in the water and Bligh is roughly thrown in. Several other crew members starting with Fryer join him, not so much because they like him but because they don’t want to stay on the ship and be labelled as pirates, a crime which carries the death penalty. Soon there are more people in the boat than there is room for and still others want to get in, the ship seems almost equally divided between Bligh Loyalists and Mutineers.\n\nYou stand by the rail looking down at the crowded boat. The island of Tofua is visible nearby and as Christian is throwing a sextant, compass, charts, tools and even four cutlasses (!) down into the boat it seems the nineteen, loyal people in the boat have a good chance of reaching it in safety. It seems that the twenty-five mutineers or pirates remaining on the Bounty (including at least four people who want to go with Bligh but who there is no room for) are planning to return to Tahiti.\n\nYou must choose whether to go with Bligh or remain aboard the Bounty, a decision that will affect the rest of your life.", "action_results": [{"action": "Go in the boat with the Loyalists and Bligh", "result": "You make your decision and with a deep breath you jump off the Bounty to become the twentieth man in the Loyalist boat. Seconds after you jump in the Mutineers cast the rope off connecting the launch to the Bounty and your boat steers away. There is barely room to move but you row clear of the Bounty to the sound of the pirates’ jeers and last insults and Bligh watches silently as hundreds of his precious breadfruit plants are thrown over the sides of the ship.\n\nThe last you see of the Bounty is her turning away and sailing east, presumably back to Tahiti. Her sails get smaller and smaller before she is just a speck on the horizon and eventually, like a ghost ship or the memories of a dream, she vanishes from sight. You all stare at Bligh with hostility while he clears his throat and doesn’t even have the good grace to look ashamed at the predicament he has landed you all in.\n\n“Men, the Dutch settlement of Coupang in Timor is about 4,000 miles west of here. With careful navigation and rationing I can get us there. From there we can take ships back to England and report the Mutiny on the Bounty to the Admiralty who will send ships out to Tahiti to hunt down those pirates and bring them back to England for justice. We can do it men.”\n\nNo one answers but you all just go on staring angrily at him in silence.\n\nTofua is little more than an active volcano jutting from the sea and the plume of smoke rising from it is clearly visible. With hard rowing you reach the island the day after the mutiny and spread out to search for supplies. There are Natives on the island and unlike the Tahitians they do not appear to be friendly. Within a few days it appears that your return to England will not be as easy as Bligh claims...", "action_results": [{"action": "Attack！", "result": "After four days ashore with the Natives gathering in increasing numbers and hardly any supplies to be found Bligh gives the order for you all to return to the boat and resume sailing westwards. As soon as the Natives see you are leaving they attack, they race to the shore and run through the water towards you armed with spears and axes. You are pushing off as fast as you can but one fast moving Native manages to grab a rope attached to the stern. You all quickly realize you can’t escape as long as he is holding that rope.", "action_results": [{"action": "Jump off the boat and run out to fight the Native", "result": "You grab a cutlass and clamber out of the boat, splashing through waist-deep water towards the warrior. He lets go of the rope and jabs at you with a spear but you side-step it and drive your cutlass through his chest. As you turn back towards the boat you find it is indeed escaping, rowing quickly out to sea. You start to stagger after it but a Native comes up behind you and hits you on the head with a rock. You fall down into the foaming waves and more natives beat and stab you to death, your sacrifice enabling your comrades to escape to safety.", "action_results": [{"action": "You are Dead", "result": "So you are dead, in fact in the immortal words of John Cleese you are no more, you have ceased to be, bereft of life you rest in peace and are, in fact, an ex-sailor. The great thing about this story (and possibly life in general if the Buddhists are right) is that you don't have to stay this way. You can return to the story either from the beginning or from the Mutiny on the Bounty, if you feel like exploring different story branches.\n\nAlternatively if, like a glutton at a delicious feast, you really feel like you couldn't take anymore of this wonderful writing, you can End the Game and Leave Comments.\n\nIf that is the case thank you for taking the time to read my story.", "action_results": [null, null]}]}, {"action": "Let someone else get off the boat", "result": "You remain on the boat and watch as stout Quartermaster John Norton jumps overboard, crosses to the Native holding the rope, dodges his spear and cuts him down with his cutlass. The dying Native releases the rope releasing your boat and enabling the oarsmen to row rapidly away from the shore. Norton turns to follow you but is knocked down by a Native with a rock and as he tries to rise he is beaten and stabbed to death. The rest of you escape by throwing spare garments of clothes into the sea, which pursuing Natives stop to pick up.\n\nThe month following your escape from Tofua is a difficult one for you. The weather is constantly cold, there are frequent storms and practically all of your time is spent either rowing or bailing out the boat. Sleep for more than a few hours at a time is impossible. You have nothing but tiny amounts of bread and water, your stomach shrinks massively and you are constantly thirsty. Life becomes blurred.\n\nBy the time you arrive at Restoration Island you can barely drag yourselves ashore. The island receives its name from Bligh after you all find fresh fruit and oysters which go a little way to restoring your strength. You find deserted Native campsites and after your previous experience you are not keen to make contact with them. After two days resting you sail on, reaching an island Bligh calls Sunday Island the next day where tensions again erupt.", "action_results": [{"action": "Another Argument", "result": "On Sunday Island on the last day of May Bligh nearly faces another mutiny.\n\nYou and the Carpenter William Purcell spend the morning clam hunting and return to the boat that evening with your findings. Bligh orders you to hand the clams over and, considering them personal property, you both refuse.\n\n“You ungrateful scoundrels!” Bligh exclaims. “If I had not brought you here you would all have perished!\n\n“If it had not been for you we should not have been here,” you reply angrily.\n\n“You are scoundrels!” Bligh exclaims.\n\n“I am not a scoundrel,” Purcell replies coldly. “I am as good a man as you.”\n\nBligh grabs a cutlass from the boat and Purcell does likewise.\n\n“Mr Cole, arrest both of those men,” Fryer calls out to the Boatswain.\n\n“You will do no such thing,” Bligh snaps.\n\n“There are other methods in making people do as they are ordered without fighting them sir,” you tell Bligh stepping between him and Purcell.\n\nBligh glares at you for a moment, apparently too angry to speak, and then abruptly throws his cutlass into the boat. Purcell does likewise and the next day you sail on to Coupang. Hardly anyone talks to Bligh more than is absolutely necessary, no one can stand him any longer. All of you are too sick, weak and tired and the monotonous waves roll you onwards steadily until finally, gloriously, you arrive at Coupang.\n\nThe little Dutch town huddled against the waves looks the sweetest place on earth as you all sail in, dock and disembark, feeling like kissing the ground. Bligh coldly orders Fryer and you to stay and guard the boat while he leads the rest ashore. You ignore him and join the others in receiving food and medical attention from the kind inhabitants of the colony.\n\nYour troubles are a long way from over yet however.", "action_results": [{"action": "Getting home", "result": "Coupang is a small settlement with no large vessels so Bligh arranges the purchase of a derelict 34-foot schooner he names HMS Resource and orders you all to work hard in making it seaworthy enough to sail on to the larger port of Batavia on the island of Java where you should be able to find a ship going back to England. Tensions remain with Bligh bickering frequently with Fryer, Purcell and now also Acting Surgeon Thomas Ledward, who accuses Bligh of eating more than his fair share of supplies.\n\nBligh responds by insisting that you all work hard so that you may get back to England sooner, despite your still generally weak state.", "action_results": [{"action": "Work hard", "result": "You push yourself hard but it turns out to be a mistake, you soon contract a serious inflammatory fever, as does David Nelson the gentle but weak Botanist Bligh also brought with him on the Bounty. Both of you worsen, despite the best efforts of the Doctor and even Bligh’s comments that “your generally good conduct and manly fortitude deserve special tribute to your memory” fail to raise your spirits.\n\nYou succumb to the sickness a short time before your companions sail to Batavia and safety.", "action_results": [null]}, {"action": "Work at your own speed", "result": "You continue to work steadily but Bligh’s relentless hectoring drives the gentle but weak Botanist David Nelson into a tropical disease which claims his life the month after you arrived in Coupang. By August the HMS Resource is ready and the remaining eighteen Loyalists under Bligh make a short voyage to the busy Indonesian port of Batavia, another Dutch port, arriving on the first day of October. The constant bickering between Bligh and the rest of you continue during this\nvoyage.\n\nAt one point Fryer declares to Bligh “You do not only use me ill but every man in the vessel will say the same.”\n\n“Yes by God, we are used damn ill and you do not have any right to do so,” Purcell declares.\n\nBligh grabs a cutlass and has the two men clapped in irons, releasing Fryer after an apology but keeping Purcell imprisoned for the last ten days of the trip. Bligh quickly begins making arrangements to sell the HMS Resource and the boat you left the Bounty on in order to finance the return home of all of you.\n\nThe boat has been mislaid and officials in Batavia have mistakenly moored it in a mosquito-infested inland bit of water. Bligh orders Seaman Thomas Hall to go and retrieve it despite the risk from the mosquitoes.", "action_results": [{"action": "Help Hall retrieve the boat", "result": "You and Hall have to venture through thick clouds of mosquitoes to move the boat and by the time you have rowed it back to where it should be both of you have been badly bitten many times. Malaria sets in almost immediately and within days you both succumb to the illness. An indifferent Bligh sails home soon after leaving most of his loyal crew behind in Batavia.", "action_results": [null]}, {"action": "Let him do it on his own", "result": "You avoid helping Hall and predictably he becomes sick with malaria from mosquito bites while retrieving the boat and quickly dies. Bligh has also become sick with malaria and just five days after Hall’s death he books passage aboard the Dutch ship Vlydte bound for Portsmouth. By this point hostility against him is so widespread that only two men, his clerk John Samuel and his servant John Smith are willing to travel with him, the remaining thirteen prefer to wait under Fryer's command for another ship.", "action_results": [{"action": "Return to England with Bligh", "result": "The voyage back to England is thankfully smooth sailing. It takes two months to reach Cape Town in South Africa, which the Vlydte departs in the first days of 1790. Three months later you are back in England after over two years away and never have you been so relieved to return to your native country. While Bligh goes to London to report the Mutiny on the Bounty to the Admiralty you remain in Portsmouth to rest and wait for your comrades to rejoin you in the safety of England.", "action_results": [{"action": "Hunting for the Bounty Mutineers", "result": "Just thirteen of the twenty loyal crew members cast adrift with Bligh survive to return to England in the spring and summer of 1790, yourself among them. Bligh quickly reports the Mutiny on the Bounty and publishes a book about it, snappily titled A Narrative Of The Mutiny On Board His Majesty’s Ship Bounty And The Subsequent Voyage Of Part Of The Crew In The Ship’s Boat, which you never both to read.\n\nIn October Bligh is court martialed for the loss of the Bounty, acquitted and subsequently promoted from Lieutenant to Post Captain. The Admiralty begins making plans to deal with the twenty-five Bounty pirates and decides to send the 24-gun frigate HMS Pandora with 134 men under Captain Edward England to Tahiti to capture all the pirates they can find and bring them back to England for trial. The Admiralty puts out a request for former crew of the Bounty to join the voyage to help identify the pirates and Midshipman Thomas Haywood volunteers for the voyage in exchange for a promotion to Third Lieutenant.\n\nYou consider whether to go or not.", "action_results": [{"action": "Sail with the Pandora to Tahiti to hunt down your former companions", "result": "It is with considerable trepidation that you agree to a second voyage to Tahiti but to your relief this one goes smoothly. The Pandora leaves Spithead and sails directly to Tahiti, travelling successfully around Cape Horn. After a swift four month voyage, which last time took you nearly a year, you arrive off the familiar tropical paradise of Tahiti and sail into Toaroa Bay.\n\nYou and Lieutenant Haywood, a lazy and arrogant character whom you despise, remain on board the HMS Pandora while parties of heavily armed sailors go ashore. They swiftly return with three men (Armourer Joseph Coleman and Midshipmen Peter Heywood and George Stewart) who surrender themselves and the following day they capture another man. The remaining Mutineers flee into the mountains prompting sailors to scour the island in order to capture them all.\n\nWithin two weeks three more men are captured and a fourth has surrendered. By the middle of April six more men have been captured bringing the total up to fourteen of the twenty-five who remained on the Bounty, including all four of the men who wanted to join Bligh in the boat but had no space to do so. They claim two of the remaining men were killed in fights on the island while the other nine Mutineers sailed away aboard the Bounty with several Tahitians in September of 1789 and they haven’t been seen since. The Natives confirm these stories.\n\nWith nine Mutineers and the Bounty still missing Captain England hoists anchor on 8 May and sets sail to find them. The fourteen prisoners are kept in a specially designed prison on the Pandora's deck.", "action_results": [{"action": "Disaster!", "result": "The Pandora spends three fruitless months scouring the Pacific for signs of the remaining pirates and the Bounty while the fourteen Mutineers they have captured are kept imprisoned in a makeshift prison cell on the quarterdeck inevitably dubbed “Pandora’s Box”. The voyage is hopeless: with hundreds, if not thousands, of islands to hide on the chances of finding the Bounty and the Mutineers is small.\n\nDisaster strikes you once more one summer’s day when the Pandora runs aground on the Great Barrier Reef. She immediately begins sinking and all efforts to either free her or patch up the damage is hopeless. By the next day she is listing worse than ever and you and Haywood are among the first into the boats. The Mutineers are not released in time and four of them drown, only ten swim to the safety of the boats.\n\nThe survivors of the Pandora, about one hundred of you including the prisoners re-assemble on a small sand cay. Once more you are sailing to Coupang in four open boats and from there onto Batavia and thence to England, this time with your ten prisoners in tow. The prospect of repeating the same arduous trip you took before fills you with dismay but there is nothing else you can do.", "action_results": [{"action": "Another remarkable voyage", "result": "This time your return back to England is much easier than last time.\n\nYou reach Coupang after a voyage of twenty days and from there arrange transport on to Batavia. In Batavia you are lucky enough to find the HMS Gorgon at anchor and board it to return to England. You reach England one summer’s day and disembark at Spithead with your ten prisoners in tow. Altogether fifty-six of the one hundred and thirty-four-man crew of the Pandora died during the sinking or of disease as well as four of the prisoners. Captain Edwards is court martialed and acquitted of the loss of the Pandora and the Admiralty prepares for the trial of the surviving Bounty Mutineers.", "action_results": [{"action": "Trials", "result": "Following your safe return to England a Court Martial is quickly arranged to try the ten captured mutineers you and Haywood managed to help the crew of the Pandora get back. Bligh and another of your former comrades, a sailor called Lawrence LeBogue, have gone sailing on a second voyage to try and do what Bligh failed to do on his first voyage and deliver breadfruit from Tahiti to the slave plantations in Jamaica.\n\nThe Admiralty requests that as many of the eleven remaining loyal members of the Bounty crew that can be found (not counting Bligh and LeBogue) should testify against the ten captured mutineers and you read in newspapers that seven, including Fryer, Cole, Peckover, Purcell and Haywood, have volunteered their services. You wonder whether you should go or not.", "action_results": [{"action": "Testify against your former companions", "result": "You decide to attend the court martial proceedings aboard the HMS Duke overseen by Admiral Hood. Of the ten prisoners Carpenter’s Mates Thomas McIntosh and Charles Norman, Armourer Joseph Coleman and Seaman Michael Byrne have letters from Bligh allowing that they wanted to join him in his boat but had to remain aboard the Bounty due to lack of room. They are quickly acquitted.\n\nSailing Master John Fryer, Boatswain William Cole, Gunner William Peckover, Carpenter William Purcell, Lieutenants Thomas Hayward and John Hallet, Seaman John Smith and yourself all testify against the six remainder: Midshipman Peter Heywood, Boatswain’s Mate James Morrison and Seamen Thomas Burkett, Thomas Ellison, John Millward and William Muspratt. With eighteen former crew members of the Bounty present it is the closest you get to a reunion.\n\nHeywood fights a strong case, pointing out he was just sixteen at the time, that he slept through most of what was going on and arrived on deck too late to help and wanted to join Bligh in the boat but there was no room. Witnesses agree they never saw him helping the mutineers but also that he never did much to help the Loyalists either. Ultimately the Judges decided to pardon him.\n\nMorrison is another man who wins a pardon, arguing a tenacious defense that successfully convinced the Judge’s he had also taken no part either for or against the Mutineers. Muspratt has a harder time as he was seen at the time of the mutiny standing by with a musket in his hands. He wins a pardon largely based on a technicality: his request to call Byrn and Norman as witnesses was refused and a mistrial was later ruled.\n\nBurkett, Ellison and Millward had no chance. Burkett was among those who forced Bligh from his cabin at gunpoint. Ellison and Millward both had cutlasses in their hands and took an active part in forcing people into the boat. All three are sentenced to be hung and two months after the court martial all three are executed upon the HMS Brunswick in Spithead and their bodies left hanging for all to see.\n\nThe following summer Bligh returned from his breadfruit expedition, doubtless disappointed to have missed the trials of the Bounty mutineers. This voyage had been a success but on bringing the breadfruit to Jamaica the slaves refused to eat it, not liking the taste. It seems that the reason behind the voyage of the Bounty, and everything that arose from it, was fundamentally pointless.", "action_results": [{"action": "The Future", "result": "By the end of 1793 there are just thirteen men who survived the boat journey to Coupang in England, including you. Of these you have lost contact with Gunner William Peckover, Clerk John Samuel and Captain’s Servant John Smith. You know some of your former companions have had enough and want to retire from the sea but most are happy to keep serving. You must make your choice.", "action_results": [{"action": "Retire from the sea", "result": "The years go by and as you age you read in newspapers about what befalls your former comrades. Lieutenant John Hallett dies in 1794 of lingering malaria from your voyages. Lieutenant Thomas Haywood drowns when the HMS Swift sinks in 1798, Sailmaker Lawrence LeBogue dies of a fall the same year. Quartermaster’s Mate George Simpson dies on land in 1801. Others go on to long and distinguished careers.\n\nWilliam Bligh and John Fryer both enjoy success and promotion in the Navy, both die in 1817. Midshipman Robert Tinkler dies in 1820. Boatswain William Cole dies ashore in 1833 and the last of your companions, opinionated Carpenter William Purcell dies in 1834. You live on, well into your sixties and in your later years you finally learn what happened to the Bounty and its missing nine Mutineers, including Fletcher Christian.\n\nIn 1808 an American ship, the Topaz, happens upon isolated Pitcairn Island. There the sailors are astonished to discover a thriving Tahitian Community ruled over by one man: John Adams. He is the sole survivor of the nine Mutineers and six Natives who landed on that island and variously killed each other or died of illness leaving Adams patriarch of a thriving community of forty-six people, except for him all women or children. The Admiralty decides against taking any action.\n\nJohn Adams, the King of Pitcairn Island, dies in 1829.", "action_results": [{"action": "Conclusion", "result": "By the end of 1835 you have outlived every single one of the forty-six men who sailed from England aboard the Bounty in the winter of 1787 and go to your grave peacefully.\n\nFrom 1787-1793 twenty-four, over half, of the Bounty's crew died of disease, drowned, were killed by Natives or each other or were killed in England. Over the next fourteen years seven more met similar fates. Of the entire Crew only nine are known to have definitely suffered natural deaths. You are one of the few lucky ones who experienced disease, piracy, Native attacks, shipwrecks, fighting and all the other hazards that befell you and survived. Ultimately hundreds of deaths including seventy-eight Natives killed on Tubai, and the fifty-eight who died from the HMS Pandora’s crew, are connected with the Mutiny on the Bounty.\n\nEven the 2012 death of Claudene Christian, Fletcher Christian’s descendent, who drowned when the Bounty, a replica of the HMS Bounty, sank during Hurricane Sandy, can be connected to the Mutiny.\n\nSingularly each of these events, the Mutiny, the wrecking of the Pandora, the Trials of the Mutineers in Spithead, Massacre Day on Pitcairn, the loss of the replica Bounty were fairly common place events, especially in the 1700’s and 1800’s in England but taken altogether they form a remarkable story. The greatest legacy of this remarkable legacy is the still-populated island of Pitcairn, with approximately fifty people descended from Pirates it remains the smallest country in the world.\n\nSo who was ultimately to blame for the Mutiny, Bligh or Christian?\n\nCarpenter William Purcell, who hated Bligh, had no doubt.\n\n“Christian was a gentleman,” he told Christian’s brother after his return to England. “A brave man and every officer and seaman on board the ship would have gone through fire and water to serve him. As much as I have lost and suffered by him if he could be restored to his country I should be the first to go without wages in search of him.”\n\nIt was Christian’s fate, in a moment of madness, to set off a chain of events that would end with him being shot in the back while carrying wood across his garden on Pitcairn four years later. There is a tale oft-told on Pitcairn of a certain cave that Christian had stocked with muskets in case he needed to make a last stand if the island were ever found by the Royal Navy. Often he sat alone up there at night, mournfully reflecting on all that he had lost and the nineteen men he had cast adrift at sea for the sins of one of them.\n\nThe story of the Mutiny on the Bounty can be seen as much as a Tragedy as an Adventure.\n\nThank you for taking the time to read my story.", "action_results": [{"action": "Sources", "result": "I will end this story game with a few notes about my Sources.\n\nThe story of the Mutiny on the Bounty has been made into movies five times, in 1916, in 1933 (with Errol Flynn), in 1935 (with Clark Gable), in 1962 (with Marlon Brando and Richard Harris) and in 1984 (with Laurence Olivier, Anthony Hopkins, Mel Gibson, Daniel Day-Lewis and Liam Neeson). The most recent version is also the most accurate and all are worth watching, if only for entertainment value.\n\nWikipedia gave me a good start on sources about the Bounty, the Pitcairn Islands Study Centre proved an invaluable resource and the Famous Trials page on the Mutiny on the Bounty by Doug Linder provided me with detailed accounts of the 1792 trial of the surviving mutineers. Firsthand accounts by William Bligh and a rather good later 1831 book by Sir John Barrow, accessed through Project Gutenberg, also helped immerse myself in the period including Bligh’s bizarre vocabulary of insults.\n\nAs the replica of the HMS Bounty used in the 1984 movie in anchored off Lantau Island in Hong Kong I took the opportunity to pop over from Shenzhen and see it (from a distance as it is a privately-owned ship) on one of my rest days. This replica was made in 1979 and helped drive home the small size of the Bounty, as already noted a second vessel made in 1962 sank during Hurricane Sandy fifty years later resulting in the death of two people including Fletcher Christian’s descendent Claudene Christian. The Christian Science Monitor called her death “an almost inexplicable twist in that family’s legacy”.\n\nOne of my biggest hopes for the future is to one day visit Pitcairn Island.\n\nThank you for taking the time to read my story.\n\nNOTE: IF YOU ARE INTERESTED IN LEARNING ABOUT THE VARIOUS FATES OF THE BOUNTY CREW USE THIS ITEM.", "action_results": [null]}]}]}, {"action": "Find another ship", "result": "You decide to resume service at sea and look about for whom to serve. William Bligh is now Captain of the HMS Calcutta, you could serve with him. Sailing Master John Fryer is now serving with the HMS Britannia. Lieutenant John Hallett is with the HMS Penelope. Lieutenant Thomas Haywood is the Lieutenant Commanding of the sloop HMS Swift. Lieutenant Robert Tinkler is aboard the HMS Isis. Sailmaker Lawrence LeBogue is serving aboard the HMS Jason. You can choose who to follow.", "action_results": [{"action": "Captain William Bligh", "result": "You join William Bligh and serve with him for the next twenty years. You are with him at the Battle of Camperdown in 1797 and fight for him under Nelson at the Battle of Copenhagen in 1801. In 1805 you accompany him to Australia to rule as Governor and stick with him when he is deposed in yet another mutiny, a Rum Rebellion in 1808 in which he is imprisoned for two years before returning to England. He is cleared of blame once more, serves at sea for three more years before retiring, a Vice Admiral. He dies in 1817 at the age of 63.\n\nYou live on, well into your sixties and in your later years you finally learn what happened to the Bounty and its missing nine Mutineers, including Fletcher Christian. In 1808 an American ship, the Topaz, happens upon isolated Pitcairn Island. There the sailors are astonished to discover a thriving Tahitian Community ruled over by one man: John Adams. He is the sole survivor of the nine Mutineers and six Natives who landed on that island and variously killed each other or died of illness leaving Adams patriarch of a thriving community of forty-six people. The Admiralty decides against taking any action.\n\nJohn Adams, the King of Pitcairn Island, dies in 1829.", "action_results": [null]}, {"action": "Sailing Master John Fryer", "result": "You join John Fryer and serve with him for the next eighteen years. You are with him under Nelson at the Battle of Copenhagen in 1801. He rises to become one of the foremost Sailing Masters in the Royal Navy before retiring in 1812 and dying five years later at the age of 63. You retire from the sea soon after.\n\nYou live on, well into your sixties and in your later years you finally learn what happened to the Bounty and its missing nine Mutineers, including Fletcher Christian. In 1808 an American ship, the Topaz, happens upon isolated Pitcairn Island. There the sailors are astonished to discover a thriving Tahitian Community ruled over by one man: John Adams. He is the sole survivor of the nine Mutineers and six Natives who landed on that island and variously killed each other or died of illness leaving Adams patriarch of a thriving community of forty-six people. The Admiralty decides against taking any action.\n\nJohn Adams, the King of Pitcairn Island, dies in 1829.", "action_results": [null]}, {"action": "Lieutenant John Hallett", "result": "You join Lieutenant John Hallett aboard the HMS Penelope but unfortunately neither of you are destined for a long career. You continue to suffer from malaria you became infected with during your voyage and your health worsens. Despite the fact you are both in your early twenties it quickly becomes apparent it is fatal. The two of you journey to Hallett’s home in Bedford where you succumb to your illness.", "action_results": [null]}, {"action": "Lieutenant Thomas Haywood", "result": "You join Lieutenant Thomas Haywood aboard his sloop the HMS Swift and spend four happy years running letters for the Royal Navy in Asian waters. Your careers come to an end one terrible night when your ship is sunk with all hands in the South China Sea. The sea is an unforgiving mystery.", "action_results": [null]}, {"action": "Lieutenant Robert Tinkler", "result": "You serve loyally under Lieutenant Robert Tinkler for the next twenty-six years. He rises from Lieutenant to Commander of the HMS Isis after good service under Nelson at the Battle of Copenhagen in 1801. You sail the oceans for many years before Tinkler, his health suffering, retired to Norwich where he dies in 1820. You retire from the sea that same year and live a long and peaceful retirement.\n\nYou live on, well into your sixties and in your later years you finally learn what happened to the Bounty and its missing nine Mutineers, including Fletcher Christian. In 1808 an American ship, the Topaz, happens upon isolated Pitcairn Island. There the sailors are astonished to discover a thriving Tahitian Community ruled over by one man: John Adams. He is the sole survivor of the nine Mutineers and six Natives who landed on that island and variously killed each other or died of illness leaving Adams patriarch of a thriving community of forty-six people. The Admiralty decides against taking any action.\n\nJohn Adams, the King of Pitcairn Island, dies in 1829.", "action_results": [null]}, {"action": "Sailmaker Lawrence LeBogue", "result": "You join Sailmaker Lawrence LeBogue and enjoy his steadfast and resolute companionship during three years of voyages around the world aboard the HMS Jason. Your voyages come to an end one terrible day when a poorly tied rope gives way beneath your hands. Both of you plummet to the deck, killed instantly by the fall. Your bodies are tied in hammocks and thrown overboard: just two more dead sailors.", "action_results": [null]}]}]}]}, {"action": "Remain in Portsmouth", "result": "You stay away from the trial of your shipmates and read about the proceedings in the newspapers. The detained Loyalists Carpenter’s Mates Thomas McIntosh and Charles Norman, Armourer Joseph Coleman and Seaman Michael Byrne were quickly pardoned. Midshipman Peter Heywood, Boatswain’s Mate James Morrison and Seaman William Muspratt manage to persuade the Judges they took no active part in the mutiny and win a pardon. Seamen Thomas Burkett, Thomas Ellison and John Millward are found guilty and executed.\n\nThe following summer Bligh returned from his breadfruit expedition, doubtless disappointed to have missed the trials of the Bounty mutineers. This voyage had been a success but on bringing the breadfruit to Jamaica the slaves refused to eat it, not liking the taste. It seems that the reason behind the voyage of the Bounty, and everything that arose from it, was fundamentally pointless.", "action_results": [null]}]}]}]}]}, {"action": "Remain in England", "result": "You remain in England while the HMS Pandora sets sail and continue to rest for another year. To your amazement you soon get word that William Bligh is setting sail to Tahiti again to fulfil the mission he failed at last time: gather breadfruit and transport them to Jamaica. This time he is traveling aboard the HMS Providence, a much larger and powerful 10-gun sloop-of-war with a crew of one hundred. Among this crew is Lawrence LeBogue, a sailor who survived the open boat voyage to Coupang and Batavia with you and Bligh.\n\nBligh sends a letter to you asking if you would like to join him on this voyage.", "action_results": [{"action": "Accept", "result": "Against your better judgement you agree to sail with Bligh again. To your surprise this voyage goes absolutely smoothly. After leaving England in August of 1791 you reach Tahiti the following April. There you learn that the previous summer the HMS Pandora arrived in Tahiti and captured fourteen of the Bounty mutineers (two having previously been killed in violent altercations). Nine of the mutineers had sailed off aboard the Bounty in the autumn of 1789 but the Pandora left in search of them and Bligh is confident all the Pirates will be tracked down and captured.\n\nYou stay in Tahiti only three months, leaving that July and sailing onto Jamaica. You reach Jamaica in January of 1793 with the breadfruit for the plantation slaves where you discover something that makes you laugh. The slaves can’t stand the taste of breadfruit and refuse to eat it. The whole breadfruit expeditions and everything that arose from them were, fundamentally, pointless.\n\nYou stay in Jamaica for five months, enjoying the Caribbean and all it has to offer, before sailing onto England, arriving that September. There you learn more news of the Pandora: at the same time you set sail she was wrecked on a reef and many of the crew, including four of the captured pirates, drowned. The remainder struggled back to England last year and after trials three of the mutineers were hanged, of the others four had been the detained loyalists while the last three escaped execution due to extenuating circumstances.\n\nThe Admiralty now feels that enough justice has been done. The whereabouts of the Bounty and the nine mutineers who sailed from Tahiti in the autumn of 1789 must, it appears, remain a mystery of the sea.", "action_results": [null]}, {"action": "Refuse", "result": "You decline Bligh’s unattractive offer to sail with him again and remain in England for another year. The time passes quietly until, quite unexpectedly, the crew of the HMS Pandora return to Portsmouth aboard another ship. It seems that on arrival in Tahiti the previous year the Pandora found and captured fourteen of the mutineers, two having been killed in fights and another nine having sailed off aboard the Bounty previously. While searching for the Bounty and the remaining pirates the Pandora sank off the Great Reef with the loss of many lives, including four of the mutineers. The surviving crew, including the remaining ten mutineers, sailed to Coupang in open boats, much as you did, then to Batavia and from there returned to England.\n\nThe Admiralty requests that as many of the eleven remaining loyal members of the Bounty crew that can be found (Bligh and LeBogue are still off on Bligh’s second breadfruit voyage) should testify against the ten captured mutineers and you read in newspapers that seven, including Fryer, Cole, Peckover, Purcell and Haywood, have volunteered their services. You wonder whether you should go or not.", "action_results": [null, null]}]}]}]}, {"action": "Remain on Java waiting for another ship", "result": "When Bligh and his two companions depart there remains fourteen of the Loyal Bounty crew in Java under the command of Sailing Master John Fryer. He finally finds a ship willing to take you all home but they require you all to do some labor first, either moving supplies from the island’s interior upriver or by the docks loading them on. A party of four: Midshipman William Elphinstone, Quartermaster Peter Linkletter, Acting Surgeon Thomas Ledward and Seaman Robert Lamb volunteer to move supplies down river while the rest work with Fryer to load the ship.", "action_results": [{"action": "Help move the supplies by river", "result": "You help the other group move the supplies by river and quickly realize you have made a mistake. All five of you are seriously bitten by mosquitoes and quickly develop malaria. You are the first to die just ten days after getting the illness, the others die either on Batavia or on the ship on the way home. Your companions return to England safely where they join Bligh in reporting the Mutiny on the Bounty.", "action_results": [null]}, {"action": "Help load the supplies on the ship", "result": "You sensibly stay with the ship while the others contract malaria from mosquito bites obtained while working on the river. Elphinstone and Linkletter die before even leaving Bavaria while Lamb and Ledward succumb on the journey home. Your ship is finally ready to depart on the first day of December and you reach Cape Town in February of 1790. You stay there for one month before sailing on, finally arriving back to England in the summer after two and a half years away. It seems like a lifetime… but your trials are not over yet.", "action_results": [null]}]}]}]}]}]}]}]}]}, {"action": "Remain abouard the Bounty with the Mutineers and Christian", "result": "You remain aboard the Bounty with the twenty-five Pirates and watch as the boat containing Bligh and his companions fades away into the distance. Christian quickly assumes command of the ship and the navigating, realizing quickly that Tahiti will be the first place that the Royal Navy will look for you all but that Bligh will not get back to England, if he gets back to England, for at least one year and a ship from England would not arrive at Tahiti at least until the summer of 1791.\n\nChristian sets course for an island called Tubai hundreds of miles south of Tahiti which was sighted once twelve years ago but never visited. On arrival the Bounty is attacked by hundreds of warriors in canoes firing arrows at the ship. You and the other sailors return fire killing twelve of the Natives and forcing the rest to scatter. After three days off the island Christian decides to return to Tahiti to seek supplies and support from among the friendlier Natives there. You return to the welcome shores of Tahiti that June.", "action_results": [{"action": "The Battle for Tubai", "result": "Christian lets you all stay on Tahiti just ten days, long enough to pick up fresh supplies and twenty-eight Tahitians before sailing back to Tubai to try and seize control of it from the Natives. He builds a Fort which he calls Fort George and tries to man it against all comers. When the Natives attack they are repulsed again and again and sixty-six of them were killed, the only casualty on your side being Seaman Thomas Burkett who is speared through the side. Finally, Christian allows a vote between returning to Tahiti or staying on Tubai. The Pirates vote 16-9 to return to Tahiti. Christian sighs.\n\n“Gentlemen, I will carry you and land you wherever you please. I desire none to stay with me but I have one favor to request: that you will grant me the ship, tie the foresail, give me a few gallons of water and leave me to run before the wind and I shall land upon the first island the ship drives to. I have done such an act that I cannot stay on Tahiti. I will never live where I may be carried home to be a disgrace to my family.”\n\n“We shall never leave you Mr Christian,” Midshipman Edward Young promises him. “Go where you will!”\n\nAfter just three months in Tubai Christian sails the Bounty back to Tahiti. There the sixteen men who voted to remain there disembark the ship while Christian remains aboard with eight other companions. You have a decision to make now: you can remain on Tahiti knowing that it will probably be the first place the Royal Navy looks for you and your companions (if they look for you) or you can join Christian in sailing into the unknown to find the most obscure island possible, knowing you will probably never see England again.", "action_results": [{"action": "Remain on Tahiti", "result": "You remain on Tahiti and in the autumn of 1789 you watch the Bounty sail away for the last time. There is little left to do now but settle down to living among the Tahitians and hope that the first ship to visit the island will be a friendly one. Like many of the Mutineers you get into a long-term relationship with a beautiful Tahitian woman and enjoy long days spent relaxing on the beautiful island and nights of hard-drinking and partying with the locals. Seven months after the Bounty leaves violence erupts, threatening to destroy your peaceful existence.\n\nThe problem is Matthew Thompson, a middle-aged and brutal man who alone out of all of you doesn’t have a romantic partner as the Native women avoid him. One day there is chaos in the village and you learn that Thompson, drunk on strong spirits, has tried to rape a Tahitian woman but was fought off when her screams brought her brother and other men running to her aid.\n\nYou go out of your hut and walk towards Thompson’s, as do several of your companions, to find him outside his hut shouting at a small crowd of angry Tahitians to go away. He has a musket in his hands and without warning he raises it and fires it at a man. The bullet passes through a baby the man is holding in his arms and into his chest, killing them both. Reversing the musket Thompson swings it in a wild arc, cracking a woman in the head and knocking her unconscious to the ground. The rest of the crowd flees.\n\nThompson sensibly flees to the shoreline, steals a canoe and paddles away to a small nearby island called Taiarapu. The rest of you have a meeting with the Tahitians where you emphasize that Thompson’s actions had nothing to do with the rest of you and you all condemn his cruelty. The Tahitians accept your explanations, largely because Quartermaster Charles Churchill has been adopted by a local chief and is gaining considerable status among the Natives.\n\nAfter some talk you decide on what to do: you will send a messenger to Thompson telling him he can safely return to Tahiti and when he comes back one or two of you will steal his muskets and cutlasses from his hut and give him no more to prevent him doing anymore harm. It is a risky thing to do as Thompson is a violent man but Churchill volunteers for the task.", "action_results": [{"action": "Join Churchill in stealing Thompson's weapons", "result": "You send a Native to Thompson telling him all is forgiven and he can return and a suspicious Thompson dutifully returns to Tahiti. About a week after his return when Thompson is elsewhere you and Churchill sneak into his hut, take his weapons and hide them in your own huts. Thompson is absolutely furious when he discovers the theft unfortunately for you a Native man with a grudge against Churchill tells him who stole the weapons.\n\nYou are standing talking to Churchill one day when, without warning Thompson, comes up behind you and shoots you in the back of the head with the musket he has recovered from your hut. You fall instantly dead to the ground and a moment later Thompson shoots and kills Churchill with a second weapon. It might be some consolation for you that your Tahitian friends avenge your death and beat Thompson to dead with rocks later that same day.", "action_results": [null]}, {"action": "Stay out of the whole business", "result": "You all send a Native to Thompson telling him all is forgiven and he can return and a suspicious Thompson dutifully returns to Tahiti. About a week after his return when Thompson is elsewhere Churchill sneaks into his hut, takes his weapons and hides them in his own hut. Thompson is absolutely furious when he discovers the theft and unfortunately a Native man with a grudge against Churchill tells Thompson who stole his weapons. Thompson recovers his musket, walks up behind Churchill one day and shoots him dead.\n\nThompson again flees into the jungle interior and again you all meet to decide what to do. The Tahitians are furious over the death of their friend and intend to tell Thompson all is forgiven before jumping on him and beating him to death with rocks. It is a cold-blooded plan.", "action_results": [{"action": "Warn Thompson about it", "result": "You hurry out of the village to warn Thompson of the Natives’ intentions but you are spotted. Quickly realizing what you are intending to do the Natives give chase and run you down after a few hundred meters. A spear stab in the back knocks you down and then the Natives beat you to death with rocks. They then go on and kill Thompson anyway.", "action_results": [null]}, {"action": "Stay out of the whole affair", "result": "You stay in the village while a large band of Tahitians leave and return later with Thompson’s bloodied and battered body. After the killings of Churchill and Thompson things settle down and the remaining fifteen of you live peaceful lives on this island paradise for one more year. The calm is broken again one spring morning by the terrifying sight of a large Royal Navy vessel sailing steadily towards the island. It anchors offshore and several boatloads of heavily-armed sailors are soon rowing towards shore.\n\nSome of your companions, notably the Bligh Loyalists who were detained against their will, are in favour of surrendering at once while others propose hiding out in the island interior and on other nearby islands in the hope of eluding capture. You know if captured all of you will be taken back to England and tried for piracy: if found guilty you know you will dance on the end of a rope.", "action_results": [{"action": "Surrender to the sailors", "result": "You and three other men promptly surrender yourselves to the first sailors who reach the shore, clapped in irons you are swiftly brought back to the ship where, to your surprise, former Bounty shipmate Midshipman Thomas Hayward is waiting to identify you. You are imprisoned in a makeshift prison on the ship’s quarterdeck and over the next month all of your remaining companions are captured.\n\nYou learn that after the Mutiny Bligh sailed his overcrowded boat to safety and returned to England with eleven surviving companions out of the eighteen who were in the boat with him. He reported the Mutiny to the Admiralty who dispatched this ship, the HMS Pandora, to Tahiti to arrest you all. You and your fourteen companions are questioned on the whereabouts of the other nine Mutineers and the Bounty but you can only tell them that you last saw them sail away in the autumn of 1789.\n\nThe Pandora leaves Tahiti that May and spends the next three months scouring the Pacific for your remaining companions but finds no trace of them. One day the Pandora suddenly runs aground off the Great Barrier Reef. Despite desperate efforts that go on for twenty hours the damage is too severe to be repaired and the ship starts to sink increasingly fast. Finally, in desperation the order if given to abandon ship.\n\nFor a few moments it seems that you and your fellow prisoners will all be left shackled to the quarterdeck to drown but as water washes over the main deck a sailor remembers you all and runs up to unlock your leg irons. He gives the keys to you and orders you to unlock the rest. You have managed to free ten of your fourteen companions when the Quarterdeck vanishes beneath your feet into cold clear seawater. Your remaining trapped companions shout for help.", "action_results": [{"action": "Work underwater to free the remaining men", "result": "Waist-deep in water you wade across the deck and taking a deep breath you plunge underwater to try and untie more leg irons. In the strange underwater world you can barely see and are unaware when the Pandora’s mainmast gives way, breaks and falls on you, pinning you to the deck beneath its vast weight. You desperately try to free yourself but there is nothing you can do: the last bubbles escape your lips and you share the watery grave of the four comrades you died trying to save.", "action_results": [null]}, {"action": "Abandon the sinking ship and swim for one of the nearby boats", "result": "Recognizing it would be suicide to remain on the ship any longer you dive into the sea and wade towards one of the four boats the sailors of the Pandora have succeeded in launching. You are hauled aboard and watch as the last of the HMS Pandora vanishes from sight. It takes with it four of your companions were still manacled to the ship: Midshipman George Stewart and Sailors Henry Hillbrant, Richard Skinner and John Sumner.\n\nTogether with your ten surviving companions you join the other survivors in a three-week open boat voyage, not unlike that Bligh endured two years before) to Coupang in Timor with no mishap. From there you travel on to Batavia on Jakarta and from there take passage aboard the HMS Gorgon, arriving back in England in June of 1792, nearly five years after you left her aboard the Bounty.\n\nIt is good fortune for you that William Bligh is not in England at the moment, having left the previous year to fulfil his mission of taking breadfruit from Tahiti to the slave plantations in Jamaica. Many of your former comrades are in England however and seven (Sailing Master John Fryer, Boatswain William Cole, Gunner William Peckover, Carpenter William Purcell, Midshipmen John Hallett and Thomas Haywood and Seaman John Smith) have been recruited to testify against you and your companions in your trials that August.\n\nFor four of your companions the trials are an easy affair: Carpenter’s Mates Thomas McIntosh and Charles Norman, Armourer Joseph Coleman and Seaman Michael Byrne are acquitted when letters are produced written by Bligh confirming they wanted to join him in the boat but were unable to due to lack of space. For you and six of your companions things look much more dangerous and all of you are keen to argue you took no active part in the mutiny but need to explain your failure to act.\n\nYour companions intend to do this in two ways. Midshipman Peter Heywood, Boatswain’s Mate James Morrison and Seaman William Muspratt intend to claim they were too confused by what was happening to act. Seamen Thomas Burkett, Thomas Ellison and John Millward intend to claim they were too intimidated by the Mutineers and that they intended to recapture the Bounty at a later date if they could find support among the crew. You need to choose which defense line you go with.", "action_results": [{"action": "Too confused to act", "result": "You decide to go with the claim that you were too confused by what was happening to act. Somewhat surprisingly this defense works with the Judges: though sentenced to death you, Heywood, Morrison and Muspratt are pardoned for your part in the Mutiny. Burkett, Ellison and Millward are executed by hanging a few months later. You and your companions all feel the most incredible relief at your very narrow escape, Muspratt is so affected by his brush with death he rarely speaks again.\n\nThe following year Bligh returns to England after a successful voyage which brought breadfruit from Tahiti to Jamaica, only to discover the slaves there would not eat it. He is furious that you and your companions escaped death and writes an account roundly condemning you all. Withstanding his fury you are one of the eight Bounty mutineers that survived to return to England. Not a day goes by when you do not wonder what happened to Fletcher Christian and his eight companions who vanished that autumn afternoon so long ago aboard the Bounty.\n\nYou now have a decision to make: whether you return to the sea or retire to the land. McIntosh, Coleman and Byrne have all already turned their backs on the sea and drifted out of touch while Peter Heywood, James Morrison, Charles Norman and William Muspratt are all intended to resume a life on the ocean’s waves. You need to decide whether you too will retire ashore or return to the sea.", "action_results": [{"action": "Retire from the sea", "result": "The years go by and as you age you read about what befalls your former comrades.\n\nCarpenter’s Mate Charles Norman dies of a disease, probably brought on by his experiences, in 1793. Seaman William Muspratt also dies at sea of a disease in 1797. Boatswain’s Mate James Morrison drowns when the HMS Blenheim sinks in 1807. Midshipman Peter Heywood serves honorably in the Navy for twenty-two more years, retiring from the Navy in 1816 with the rank of Captain. He dies in 1831, his former status as a Pirate and Mutineer hidden behind a long and distinguished service. You live on, well into your sixties and in your later years you finally learn what happened to the Bounty and its missing nine Mutineers, including Fletcher Christian.\n\nIn 1808 an American ship, the Topaz, happens upon isolated Pitcairn Island. There the sailors are astonished to discover a thriving Tahitian Community ruled over by one man: John Adams. He is the sole survivor of the nine Mutineers and six Natives who landed on that island and variously killed each other or died of illness leaving Adams patriarch of a thriving community of forty-six people. The Admiralty decides against taking any action.\n\nJohn Adams, the King of Pitcairn Island, dies in 1829.", "action_results": [null]}, {"action": "Return to the sea", "result": "You decide to return to the sea and need to decide where you serve. You can join Midshipman Peter Heywood aboard the HMS Queen Charlotte or you could join Boatswain’s Mate James Morrison aboard the HMS Blenheim or you could join Carpenter’s Mate Charles Norman aboard the HMS Duke or you can join Seaman William Muspratt aboard the HMS Bellerophon.", "action_results": [{"action": "Join Heywood", "result": "You serve with Heywood for twenty-two years on various ships, watching him rise to the rank of Captain. You are with him on the Glorious First of June when the French fleet is defeated off Ushant and in the Invasion of the River Plate in 1806. After a long and distinguished service you both retire from the sea in 1816. Fifteen years later your friend dies in London. By that time you have learned what happened to the Bounty and its missing nine Mutineers, including Fletcher Christian.\n\nIn 1808 an American ship, the Topaz, happens upon isolated Pitcairn Island. There the sailors are astonished to discover a thriving Tahitian Community ruled over by one man: John Adams. He is the sole survivor of the nine Mutineers and six Natives who landed on that island and variously killed each other or died of illness leaving Adams patriarch of a thriving community of forty-six people. The Admiralty decides against taking any action.\n\nJohn Adams, the King of Pitcairn Island, dies in 1829.", "action_results": [null]}, {"action": "Join Morrison", "result": "You serve with Morrison in the Navy for thirteen years, Morrison rising to the rank of Chief Gunner. Your long and distinguished careers end aboard the Blenheim one terrible winter’s day in the Indian Ocean when the Blenheim and her accompanying ship HMS Java are caught in a storm while under the command of Admiral Thomas Troubridge. Both ships capsize and sink quickly sending nearly nine hundred men to their watery graves.\n\nThe sea is a cruel and unforgiving mistress.", "action_results": [null]}, {"action": "Join Norman", "result": "You join Norman aboard the HMS Duke but your mutual experiences in Tahiti and the trial have weakened you both. Just three months after joining the ship an outbreak of cholera decimates the crew and both of you quickly catch the disease and weakened. You die of the illness just one year after the execution of your companions and are just one of the several anonymous bodies cast into the sea that day.", "action_results": [null]}, {"action": "Join Muspratt", "result": "You serve with Muspratt aboard the Bellerophon for three years. Your narrow escapes from death have had a great effect on both of you and in all your service you hardly speak a word, just quietly and diligently working together. Cholera spreads through the crew one winter and both of you quickly catch the disease and weaken. You die of the illness just five years after the execution of your companions and are just one of the several anonymous bodies cast into the sea that day.", "action_results": [null]}]}]}, {"action": "Too intimidated to act", "result": "You decide to go with the claim that you were too intimidated by the Mutineers to act but the Judges refuse to believe it. You, Burkett, Ellison and Millward are all sentenced to death while Heywood, Morrison and Muspratt win pardons. Your sentences is scheduled to be carried out aboard the HMS Brunswick in Portsmouth Harbour soon after the trial.\n\nOn the scheduled morning you and your companions march out in silence onto the ship's deck. Some of your companions insist on their innocence or beg for mercy but as the noose is slipped over your neck you remain silent. On the word of command all four of you are hoisted into the air and after a few seconds of frantic kicking it is all over: you have paid the ultimate price for your part in the Mutiny on the Bounty.", "action_results": [null]}]}]}, {"action": "Hide in the island's interior", "result": "You and most of the others scatter into the island’s interior and hide. You avoid the others, steal a Native canoe one night and paddle to an isolated little volcano jutting out of the sea to the east called Mehetia. You manage to hide out here for nearly a month, surviving on nothing more than rainwater and a few fish you manage to catch in the sea and eat raw, as the island has no vegetation.\n\nEventually, on 16 April a party of sailors lands on the island and searches it in detail, finally finding you hiding under a rock, too weak to resist capture. You are taken aboard the ship where you find you are the last of the mutineers on Tahiti to be captured, the others all having been found at least a week before. You are clapped in irons and secured in a makeshift prison on the ship’s quarterdeck.\n\nYou learn that after the Mutiny Bligh sailed his overcrowded boat to safety and returned to England with eleven surviving companions out of the eighteen who were in the boat with him. He reported the Mutiny to the Admiralty who dispatched this ship, the HMS Pandora, to Tahiti to arrest you all. You and your fourteen companions are questioned on the whereabouts of the other nine Mutineers and the Bounty but you can only tell them that you last saw them sail away in the autumn of 1789.\n\nThe Pandora leaves Tahiti that May and spends the next three months scouring the Pacific for your remaining companions but finds no trace of them. One day the Pandora suddenly runs aground off the Great Barrier Reef. Despite desperate efforts that go on for twenty hours the damage is too severe to be repaired and the ship starts to sink increasingly fast. Finally, in desperation the order if given to abandon ship.\n\nFor a few moments it seems that you and your fellow prisoners will all be left shackled to the quarterdeck to drown but as water washes over the main deck a sailor remembers you all and runs up to unlock your leg irons. He gives the keys to you and orders you to unlock the rest. You have managed to free ten of your fourteen companions when the Quarterdeck vanishes beneath your feet into cold clear seawater. Your remaining trapped companions shout for help.", "action_results": [null, null]}]}]}]}, {"action": "Sail on into the unknown", "result": "Fletcher Christian sets sail with the ten of you Mutineers, twelve women and six Tahitian men (including three discovered hiding on board) and spends three months trying to find an island isolated enough to avoid discovery. He finally settles on Pitcairn Island, an isolated little island spotted once twenty-three years ago. Best of all you discover the island has been mis-plotted by around two hundred miles making it impossible to find until a ship sailing outside the usual routes actually comes upon it.\n\nYou like the island, a pleasant little grassy spot with a few hills, and begin unloading the Bounty Just eight days after arriving a very drunk Matthew Quintal sets fire to the ship to prevent any of you from changing your minds and leaving. The twenty-eight of you gather on the shore and watch the ship burn and sink beneath the waves. For better or worse you are on Pitcairn Island for good now.", "action_results": [{"action": "A New Life", "result": "Three years pass quietly on the island but a few accidents mar the peace.\n\nSoon after you arrive one of the women falls to her death while gathering eggs from the clifftops, soon after Fletcher Christian’s wife gives birth to the first child born on Pitcairn. The year after a second woman dies of an illness. Previously each of the Mutineers had one female partner each while the six Tahitian men had just two women to have sexual relations with. In the summer of 1793 you and the other Mutineers decide to take the two remaining women from the Tahitian men and give them to John Adams and William Brown respectively, the two men whose wives have died.\n\nTrouble erupts when four of the Tahitians take the two women and go to live elsewhere on the island. You and the other Mutineers give one of the remaining Tahitians, a tough character called Menalee a musket and send him off to kill the leader of the rebellious Tahitians, a man called Talaloo. On the first day of August Menalee finds him and shoots him dead. The following day he is sent off again and kills a second man called Oho. The two remaining men return and for a time it looks like all has settled down: Adams and Brown have their wives and the four remaining Tahitian men seem suitably chastised.\n\nOne day in September you are in your hut when you hear a few gunshots somewhere nearby. You think nothing of it and a short time later you hear more gunshots. You assume someone is hunting. A short while later you hear loud and excited yells followed by even more gunshots and prolonged shouting. You are now growing concerned and step warily out of your hut. You wonder what to do.", "action_results": [{"action": "Go down and investigate the gunshots", "result": "You stroll down through the village to see what is happening and encounter the four Tahitian men coming the other way. Each are armed with a musket and others weapons such as axes and rocks. You call out to them, asking what the noise was. In response the Natives raise their muskets and fire a volley of shots at you. Two bullets hit you in the chest and knock you down, before you can rise they beat you to death with axes.\n\nYou are one of the six mutineers to die on what will ever after be known as Massacre Day.", "action_results": [null]}, {"action": "Head away from the village and up into the hills", "result": "You wisely flee up into the hills and are startled to meet a panting William McCoy there, he has run all the way from the village after witnessing the Natives shoot and kill his friend John Mills. Soon after you are joined by a breathless Matthew Quintal, who has likewise escaped the village. He has shocking news to tell you, five of your friends: Fletcher Christian, John Mills, William Brown, Isaac Martin and John Williams are dead. Your remaining two companions, John Adams and Edward Young remain in the village, protected by the Native women.\n\nYou and your two unarmed companions remain hiding up in the mountains for two weeks, sometimes receiving messages from your wives still in the village. You learn that Menalee has killed another Native man called Timoa after an argument. Scared of his companions Menalee himself joins you two in the mountains saying he would be safer hiding with you. That night when Menalee falls asleep McCoy picks up his musket and shoots him dead.\n\nThree days later Adams and Young succeed in persuading the Native women they should kill the two remaining Tahitian men Nehow and Tetaheite. Young shoots Nehow in the back of the head while a woman called Susan kills Tetaheite with an axe. Your friends quickly send word to you all that it is safe to come back to the village. There are now five of you men left with ten Native women and a few small children.\n\nPeace returns to the island once more.", "action_results": [{"action": "Alcohol", "result": "Four years pass by peacefully on the island, you live with the women, begin raising a child and live a good life. William McCoy and Matthew Quintal are more restless characters than you, John Adams and Edward Young and McCoy, who once worked in a brewery in Scotland, spends a long time trying to brew alcohol out of various things. He finally succeeds in creating an incredibly strong alcohol from the ti-root and he and Quintal quickly become addicted to it, despite the fact it seems to trigger hallucinations. Adams and Young refuse to drink any.", "action_results": [{"action": "Join in the drinking", "result": "You and McCoy soon develop a heavy dependency on the dangerous drink and have many hallucinations. After one particular bout to celebrate the beginning of 1798 you and McCoy decide in your drunken states that you want to swim back to England. You run to the edge of a cliff and plunge down into the sea below. You disappear beneath the waves forever, victims of the terrible alcohol you have created.", "action_results": [null]}, {"action": "Refuse to drink", "result": "You refuse to drink and it seems a sensible decision, McCoy throws himself off a cliff in a drunken fit of depression, plummeting to his death. With his friend gone Quintal becomes more depressed also, drinking more and becoming more violent. In one incident he bites the ear off his wife Tevarua when she fails to catch enough fish one day. Tevarua, herself a heavy drinker, imitates McCoy in throwing herself off a cliff to her death.\n\nDeprived of his wife Quintal takes another one and when Adams and Young protest Quintal threatens to kill them both. He is now moody and unpredictable and Adams and Young confer with you in a secret meeting and tell you that the next time Quintal is passed out drunk they intend to kill him with an axe. You consider whether to join them in this plot or warn Quintal of what is happening.", "action_results": [{"action": "Join Adams and Young in killing Quintal", "result": "That night when Quintal is passed out you, Adams and Young sneak up on him and Adams decapitates him with one swing of the axe. Quintal’s death finally restores peace to the island which lasts another year until Young dies of asthma on Christmas Day of 1800. All that is left now is for you and John Adams to rule over a Pitcairn Island inhabited exclusively by women and children...", "action_results": [{"action": "Discovery", "result": "The next thirty or so years are peaceful ones for you and Adams, raising your many children and taking care of the island. A ship was spotted out to sea in 1795 and another in 1801 but it is not until February of 1808 that an American ship called the Topaz finally visits the island. You and Adams cautiously meet with the sailors who come ashore and finally learn what has happened on the outside world.\n\nAfter the Mutiny on the Bounty in 1789 Bligh and his surviving companions made it back to England and reported the Mutiny. A ship called the Pandora was sent to Tahiti where she captured your remaining companions, while searching for you the Pandora sank off the Great Barrier Reef. The survivors eventually made it back to England where some more of your companions were executed. The search for the Bounty and the rest of you was eventually abandoned.\n\nYou are nervous of what effect the news that you and Adams (after all, still wanted pirates) are living on Pitcairn Island will have but it is not until 1814 that a pair of Royal Navy ships finally visit the island. Twenty-five years after the Mutiny on the Bounty the men aboard report that the Admiralty has decided to grant you both amnesty for your parts in the Mutiny and allow you to continue living on the island. Relieved you continue your peaceful lives.\n\nYour great friend John Adams dies in 1829 at the age of sixty-one leaving you the sole King of Pitcairn Island.", "action_results": [null]}]}, {"action": "1 January 1799: Pitcairn Island, Pacific Ocean", "result": "You warn Quintal of what is happening and both of you are on your guard. It doesn’t take Adams and Young long to learn what you have done and a few nights later they confront both you and Quintal with muskets. Before you can defend yourselves your former friends shoot both of you dead, finally bringing peace to the island. They throw your bodies in the sea for the fish to eat.", "action_results": [null]}]}]}]}]}]}]}]}]}]}]}]}, {"action": "Remain aboard the Bounty", "result": "You refuse to have anything to do with such a dangerous plan and the deserters swear you to silence. That evening, while Midshipman Thomas Haywood is sleeping over the arms chest Churchill, Millward and Muspratt sneak into the ship’s cutter and desert. That morning Bligh is furious when he discovers the missing men’s absence, suspecting you and Haywood of being involved he orders you both clapped in irons for a week.\n\nBligh pursues the deserters to Matavai Bay where he learns from Natives that the trio of fugitives traded for a canoe and paddled north in the direction of a small island called Tetaroa. Bligh is set to pursue but the weather turns nasty and for two weeks a storm rages (Bligh has a rage of his own when he discovers the spare sails have rotted into uselessness). Finally, it clears and Bligh sails north to the small island accompanied by dozens of Native canoes.\n\nYou and Haywood are still under suspicion so you are not part of the party Bligh leads ashore which succeeds in recapturing the fugitives without trouble. Between the three deserters Bligh sentences them to one hundred and twenty lashes and steers the Bounty back to Toaroa. By now the crew are all seething with quiet discussion about Bligh’s disciplinary methods and a week after the recapture of the fugitives you are chatting ashore about the matter with Isaac Martin, a good-natured American sailor.\n\nWhile you are talking a Tahitian man wanders over to your boat to have a look, a fairly common occurrence. You both ignore him until the man suddenly grabs an iron hoop that has come loose from a barrel and starts running off. Martin yells at you to get him as you both know Bligh is fond of flogging sailors who let Natives steal things from the ship, no matter how small. You both race after the Native and get close to him but there seems to be no way of stopping him short of violence.", "action_results": [{"action": "Crash-tackle the man to the ground", "result": "You make a flying leap, manage to grab the man’s legs and bring him down. Martin is on him in a moment and as the man tries to squirm free he punches him in the face. This calms the Native who lies there clutching his broken nose while Martin picks up the iron hoop and returns to the boat. You are both feeling rather good about your successful protection of Bounty property until you hear that familiar, hated, yelp from the trees.\n\n“What do you infernal creatures think you are doing?” Bligh exclaims running towards you.\n\n“Stopping that man stealing our things,” you tell Bligh irritably. “As you ordered.”\n\n“As I ordered you insolent cur?” Bligh exclaims. “I also ordered no violence towards Natives, both of you twenty-four lashes each!”\n\nThat evening you are both lashed to trees and whipped by the quartermasters and it is only the intercession of the local Natives, who accept responsibility for the crime, that Bligh reluctantly stops the punishment at nineteen lashes. Regardless, by the time you are cut down you feel completely and utterly exhausted.", "action_results": [null]}, {"action": "Keep running", "result": "You continue to run but Martin springs ahead of you and brings the native down with a fierce punch to the back of the head. Martin forces the hoop from his grip and begins returning it to the boat when you both halt at the sound of a familiar, and despised, yelp from nearby.\n\n“What do you infernal creatures think you are doing?” Bligh exclaims running towards you.\n\n“Stopping that man stealing our things,” Martin tells Bligh irritably. “As you ordered.”\n\n“As I ordered you insolent cur?” Bligh exclaims. “I also ordered no violence towards Natives. You, Martin, twenty-four lashes!”\n\nThat evening you watch angrily as Martin is lashed to a tree and whipped by a quartermaster and it is only the intercession of the local Natives, who accept responsibility for the crime, that Bligh reluctantly stops the punishment at nineteen lashes. Regardless, by the time Martin is cut down you nothing but searing anger and hatred towards Bligh.", "action_results": [null]}]}]}]}, {"action": "Avoid the risk", "result": "You remain with Christian’s work party while Lamb heads off and he returns that evening looking utterly exhausted but grinning from ear to ear. His good feeling lasts until he returns to the Bounty to find an angry Bligh waiting for him.\n\n“Impertinent dog!” he screams in Lamb’s face. “You think a cleaver is not as valuable as your disgusting perversions? Quartermaster, twelve at once!”\n\nBy now whippings have become so depressingly commonplace that the crew feel nothing but a dull hostility towards Bligh.", "action_results": [null]}]}]}, {"action": "Remain at work on the breadfruit trees", "result": "You know your place and continue to unearth breadfruit trees, pack them carefully into pots and leave them ready to return to the ship. Bligh soon notices Muspratt’s absence and takes his two quartermasters in search of him. They return with Muspratt a few hours later, the latter having to be helped to walk after having received a dozen lashes for neglect of duty. You are tempted to ask him if it was worth it but fight the urge away.", "action_results": [null]}]}]}]}]}, {"action": "Keep quiet", "result": "Bligh has gone very pale.\n\n“Damn you Thompson for a mutinous dog,” he growls. “Quartermaster, twelve lashes each!”\n\nThe lash is fetched, the blows are landed and another sailor’s back is transformed into ruin. Sullen and muttering the crew return once more to the Bounty.", "action_results": [null]}]}]}, {"action": "Think of England and continue guarding the boats", "result": "Steadfast, British and sex-less to the last you resist the temptation of attractive women and stolidly remain in the boats while Adams goes off to try and get laid. You are still in the boat when Christian and his party return. After hearing where Adams is from you Christian laughs and calls him out of the hut, he emerges hastily buckling up his trousers. With many a light-hearted jibe you all return to the Bounty.\n\nBligh is not so amused, when you return he curses Adams for a scoundrel and orders him lashed twelve times for interfering with the Natives. Immediately the previously cheerful mood evaporates and you all stand around stone-faced as Adams is mercilessly whipped .You help him back to his hammock that evening and all around you can hear angry mutterings about Bligh.", "action_results": [null]}]}]}, {"action": "Keep dancing", "result": "You continue to dance but moments later Bligh shouts for the music to stop and storms towards the seated men.\n\n“Why are you not dancing like the others?” he demands.\n\n“It does not seem like an appropriate time for that,” Brown says quietly.\n\n“Damn you for contemptible rascals,” Bligh cries. “Both of you will have your grog stopped from now until we reach Tahiti.”\n\nMills glares back at him with a half-smile on his face as Bligh turns, returns to his former position near the helm and orders the fiddler to keep playing. The punishment is a harsh one but not as bad as it could have been: a week later you reach Tahiti.", "action_results": [null]}]}]}]}]}, {"action": "Let go", "result": "You are not going to get your hands sliced open for a lead and line and you and Williams both release the rope. Like a demented snake it zooms across the deck and over the rail, landing in the sea below with a splash. You are both standing there blowing on your burnt hands and cursing when you hear a familiar high-pitched cry and look up to see Bligh striding towards you both.\n\n“You incompetent mongrels!” he snarls at you both. “You think that losing that lead is a small thing? Six lashes each for neglect and dereliction of duty!”\n\nThe lash is fetched again, you and Williams are roped to the mast and the Quartermasters begin whipping you both, drawing blood. Bligh watches emotionlessly until it is all over and then he turns on his heel and returns to his cabin.", "action_results": [null]}]}]}, {"action": "Stay quiet", "result": "You stay silent as Quintal continues to jeer Fryer, who largely ignores him, replying with brief, disdainful sentences. Suddenly you all jump as a bizarrely high-pitched cry rings out from further up the deck and you all glance up to see the comical form of Bligh striding towards you.\n\n“You infernal scoundrels!” he roars. “How dare you cowardly rascals show such insolence and contempt for Mr Fryer! Mr Fryer, how came you to permit such a thing to happen sir? Twenty-four lashes sailor to remind you of the proper way of addressing your superiors! Master-at-Arms, fetch the lash! Quartermaster, prepare this man!”\n\nQuintal is seized, the shirt torn from his back and he is lashed to the mast. The Master-at-Arms approaches with the cat o’nine tails and begins flaying Quintal’s back. Soon blood is pouring down his backside and legs as the flesh is stripped from his back but Quintal takes it all in silence. The crew also watch in grim silence until the punishment is complete.\n\n“May that be a lesson to you all!” Bligh declares.", "action_results": [null]}]}]}