{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=45866", "context": "", "first_story_block": "Your world is rot. Your nostrils fill with the smell of excrement and decay that tends to fill your home. Still, it's all you have. You scurry among the scattered ruins, climbing atop a massive section of castle wreckage, sniffing the air.\n\n\nA rusted, blood-stained sword sits in one hand, a leather pouch hanging from your shoulder. Your whiskers tingle with excitement as you smell the scent of burning meat. Campfires are near, and where there's campfire, there's a caravan. Where there's a caravan, there's food.", "action_results": [{"action": "Head towards it", "result": "You scurry towards it, as do the others. Dozens of brown and black bodies scurry up from among the rubble and out of the ancient sewers underneath where your camps lie. You're one of the first on the sign, climbing atop a crushed tower as you see it. Three wagons circled around a campfire, basking in its light. The moonlight shines on your brown, shit-matted fur and catches on your blade as you run forward towards the camps. The man on guard, a young, cleanly shaven guard with armor that's too small for him yell as he sees you approach,. He readies his spear, looking ready to plunge it into you. You dance at the edge of the spear point, waiting for your chance.", "action_results": [{"action": "Grab at the spear", "result": "You step forward, grabbing the spear's shaft and yanking the guard forward. You swing your sword, slashing him in the massive gap between his helmet and shoulder pads, biting into his neck. He screams, collapsing to the ground as blood spurts forth.\n\n\nYou yell with glee, at other Ratlings begin arriving to take care of the other guards. The merchants and passengers of the caravan either flee back inside the caravans or procur weapons and get ready to fight, but this isn't a unified raid where the scraps will be given out later. You take what you can get. You run towards the camp fire, grabbing the stew cooking there, jabbing your snout into it and beginning to gulp down the delicious mixture. You manage to finish half before a much bigger rat grabs the pot from you, and you know you can't fight him. You turn to one of the caravans, where rats have killed the guards and are dealing with the merchants. The merchants are surrounded, looking terrified, as all those willing to fight have been cut down.\n\n\nAlthough the majority of them are to be enslaved and sold to the Lizards or the Eastern Tribes, while the women will be taken back to the burrows for a less than kind fate, one unfortunate soul has made his presence known by trying to negotiate.\n\n\n\"Please, taken the cargo! It's yours! Keep the men as well, we'll fetch a heavy ransom! But leave the women and the child go, won't you?\" the merchant leader says.\n\n\nBad choice. The boys have taken note of him now, and he's a fat one. His weight, the fact that he has so much food he can grow weak and fat, only angers you all thanks to the fact that you're all constantly hungry and eating scraps. One of the ratlings slashes his axe, cutting open the man's belly in a superficial wound. Another ratling jabs him with a spear, as the boys begin to jab and slash at the man as he yelps in pain as he's slowly cut and hacked apart.\n\n\nThe torture has drawn the others attention away from the actual carriages. You stare at them, contemplating sneaking away and grabbing yourself some more food.", "action_results": [{"action": "Join the torture", "result": "You laugh gleefully as you dash forward, punching the man in the side of the head and knocking him backward as he grunts in pain, knocking into the blow of a sword blade. You slash at his ankle as he collapses to a knee, before one of the ratlings decks him a blow from the butt of his spear. He tries to stand, blood down streaming down his face.\n\n\n\"Please, I'm sorry. I didn't...!\" he cries, looking genuinely petrified, before one of the rats takes it too far and stabs him in the throat with his sword, killing him.\n\n\nHe slumps to the ground, before lying still.\n\n\n\"Bah! Could've played with him for hours!\" you complain.\n\n\nThe largest rat, a big brute who's taken charge of the raid named Pak, strides forward. Not too many ratlings have joined the raid, a fact Pak is clearly enjoying as it means he gets to take charge, and since you all get a bigger part of the profit, all the better.\n\n\n\"You, you and you!\" he shouts, selecting three rats from the group. \"Start moving the prisoners back.\"\n\n\n\"Yes, yes,\" they snarl, as they begin to shout and whip the prisoners into movement.\n\n\n\"You!\" he shouts, pointing a long finger at you. \"Kill the horses.\"\n\n\nYou nod, walking over to the horses. They seem terrified and scarred, and look at you as if begging for mercy. You wonder if it's best just to untie them and scare them off.", "action_results": [{"action": "Kill the horses", "result": "You slash your sword, cutting open one of the horse's throats. You jab your sword through its skull to finish it off, before slashing another's throat. You kill the few horses, before returning to Pak, who's already ordering the others to carve up the horses and bring the meat and hides back to the home. Suddenly, you see two ratlings dragging a teenage girl out of a caravan, whose crying and screaming has gathered the rest of your attention.\n\n\n\"Please! Please! Let me go!\" the girl sobs.\n\n\nThe ratlings toss her in front of Pak, who grins eagerly.\n\n\n\"Perfect! I'll have some fun with her!\" he says.\n\n\nHe glances at you, noticing you're finished with the horses.\n\n\n\"Bring the girl back to the burrow. I'll have my fun with her later. Let the others have some fun, too.\"\n\n\nYou nod, walking over to the girl, grabbing her by the hang and beginning to drag her towards the burrow.", "action_results": [{"action": "Lead the girl back to the burrows", "result": "You drag the girl along the path to the burrow, as she cries.\n\n\n\"Please, you have to help me get out of here. We can run, just run into the wilderness.\"\n\n\n\"Can't do it. Too many bad things there. They'd kill on site a ratling. No, no,\" you say.\n\n\n\"Please! I don't want to die...\" she whimpers. \"Can... can you tell me what's going to happen to me?\"", "action_results": [{"action": "Walk in silence", "result": "You keep walking, as the girl falls silent, becoming quiet. Soon, you walk down into the burrows through the caved in portion of sewer and into the top layer of the many layered burrows. The weakest and most feeble rats are forced to live here, away from the safety that waits lower down. They look gleefully at the girl, talking and chattering among themselves. They grab at her, groping at her breasts and bosom and tearing pieces of fabric off her dress. You raise your sword to threaten them off, and they easily follow orders. You're weak for a Ratling, but you could easily kill the crippled and the the meek who surround you. You find a corner of the room, shoving the girl into it and raising your sword, waiting for Pak to arrive and take his prey.\n\n\n\"I'm scared,\" the girl says.\n\n\n\"I'd be, if I were you,\" you admit.\n\n\n\"What's your name?\" she asks.\n\n\n\"Ritz,\" you say.\n\n\n\"I'm Julianne,\" she says. \"I don't want to die here.\"\n\n\nYou don't say another word, as she begins to chant.\n\n\n\"I have the soul of the dragon. Dragons to not break. Dragons do not die. Dragons do not show fear. Dragons survive the flames. I have the soul of the dragon...\" she continues to chant.\n\n\nYou turn, staring at her. You notice a long, silver necklace hanging around her, and grab it.\n\n\n\"This is pretty,\" you say, admiring the silver.\n\n\n\"You can have it. If you help me get out of here, it's all yours. It was a gift from my father.\"\n\n\nYou stare at the necklace, knowing there's not a chance she's getting out of here alive, even if you tried to save her.", "action_results": [{"action": "Snatch it off her", "result": "You grab the necklace, snatching it off her neck and clutching it in her hands.\n\n\n\"Hey!\" she cries, grabbing at it before you snarl, scarring her away.\n\n\nShe whimpers, shuffling away from you. You stare at her, wrapping it around the hilt of your sword and clutching it tightly. You wait patiently for Pak to arrive.\n\n\nAfter a few minutes, the massive, black-furred rat clambers into the burrow, grinning as he sees her prey. He stomps forward, grabbing her by the hand.\n\n\n\"Come on, darling. Let's take you down to the lower levels. I have a few of the others I want pulled over to my side, and I'm sure your sweet ass will do a great deal in getting them there.\"\n\n\nThe huge brute begins dragging the girl away, leaving you standing there. Suddenly, he stops, turning around.\n\n\n\"What's your name?\"\n\n\n\"Ritz,\" you say.\n\n\n\"You did a good job protecting her from the cripples and in the raid, and I'm feeling generous. Care to join in the fun?\"", "action_results": [{"action": "Join in", "result": "You allow your bestial nature to take over, nodding vigorously. You follow him as he drags the weeping girl along with him. Soon, you venture down the twisted staircases and pathways down to the lower layers. Eventually, you enter the chamber filled with whatever Ratlings Pak wants to impress.\n\n\nYou watch in a mixture of fear and lust as the Ratlings appear, more than willing to be entertained by the new flesh that's entered their homes. They quickly undress her and begin to have their fun despite her horrified, screaming protests which soon turn to pained screams and begging. The Ratlings have their fun with her, and eventually you have your turn. You focus on the physical sensations rather than the pitiful weeping, and soon embrace the pure pleasure of the act. You achieve release, almost collapsing back as your body fulfills one of its prime functions. A ratling pulls you back to take your place with the hostage, and you're tossed gently aside.\n\n\nYou crawl back towards your home, curling up in a bed of animal hides and quickly letting sleep take you. The life of a ratling is a pleasurable one if you're smart enough to take advantage of it, you have to admit.", "action_results": [{"action": "Awaken", "result": "You awaken to a knife pressed against your throat. You reach for your sword in the darkness, but a hand catches yours.\n\n\n\"Scream for help or try anything and I cut you open,\" a harsh voice growls.\n\n\nYou try to nod, but the knife is pressed so tightly any movement would slice open your throat.\n\n\n\"A prisoner was taken into the burrows. Where is she?\"", "action_results": [{"action": "Claim ignorance", "result": "\"I don't know anything,\" you say.\n\n\nThe man grabs your throat, strangling it as he impales your hand. You try to scream, but you can't even get out a breath.\n\n\n\"Quiet,\" the man says, pulling out the knife and releasing your throat as you whimper, clutching at your wound.\n\n\n\"Do you think I picked you out by chance? You have her necklace. I tracked it here. Now, answer me.\"", "action_results": [{"action": "Plead ignorance", "result": "\"I swear to everything I don't know!\" you say.\n\n\n\"Filthy lying vermin,\" the man hisses. \"Perhaps the next rat will be more trustworhy.\"\n\n\nThe man slices open your throat, and you collapse against the ground, quickly dying.", "action_results": []}, {"action": "Lie", "result": "\"She was taken off to be ransomed off by one of the travelling ratlings.\"\n\n\nYou see the runes of the blade glowing, as the man snarls.\n\n\n\"Filthy lying vermin,\" the man hisses. \"Perhaps the next rat will be more trustworthy.\"\n\n\nThe man slices open your throat, and you collapse against the ground, quickly dying.", "action_results": []}, {"action": "Tell the truth", "result": "\"She's been taken down to the fifth layer. You... you won't want to find her. She's dead by now, and her body won't be in the best condition.\"\n\n\nThe man doesn't respond for some time, before snarling.\n\n\n\"No, she's alive. I can feel it. You, however, are no better than the rest of your lying kind. Death's for you.\"\n\n\nThe man slices open your throat, and you collapse against the ground, quickly dying.", "action_results": []}]}, {"action": "Lie", "result": "\"She was taken off to be ransomed off by one of the travelling ratlings.\"\n\n\nYou see the runes of the blade glowing, as the man snarls.\n\n\n\"Liar. The knife speaks to your honesty. The truth, now, or you die.\"", "action_results": [null, null]}, {"action": "Tell the truth", "result": "\"She's been taken down to the fifth layer. You... you won't want to find her. She's dead by now, and her body won't be in the best condition.\"\n\n\nThe man doesn't respond for some time, before snarling.\n\n\n\"No, she's alive. I can feel it. Your fate, however, is less certain.\"\n\n\nThe man's blade illuminates, casting golden light on the both of you. You stare at his grizzled face with a thick beard growing. However, he gets a clear view of you, seeing your blood, sweat and semen-encrusted fur. He stares at you, realizing what you've done.\n\n\n\"You had her way with her... you disgusting vermin!\" he near shouts, hopefully waking some of the other Ratlings to come to your side.\n\n\nThe man slices open your throat, and you collapse against the ground. He rams his knife into your chest repeatedly as you try to scream in pain, but blood quickly fills your throat. Your life is quickly drained from you, and you lie there as death takes you.", "action_results": []}]}]}, {"action": "Refuse", "result": "You shake your head sadly, just staring at the rat. He lets out a grunt of disgust, before dragging the girl away despite her crying protests.  \n\n\nYou head to your chamber, curling up in a bed of animal hides and lying there. You hear the girl's crying and screaming for help in the distance of the caverns, but know you can do nothing. You push your furs against your floppy ears to drown out the sound, trying to find sleep. Eventually, you manage to do so.", "action_results": [null]}, {"action": "Try to stop him taking her", "result": "\"No!\" you say, punching the massive ratling in the jaw and sending him stumbling backwards, more out of surprise than anything else. \n\n\n\"What did you say to me, you little prick?\" he says, raising his club to strike.", "action_results": [{"action": "Go for his eyes", "result": "You leap into the air, grabbing the massive ratling's shoulder and jamming your sword into his eyes. \n\n\n\"Ah! Fuck, fuck, fuck! I can't see! I can't fucking see!\" he yells, grabbing you by the fur and flinging you against the ground with a painful thud.\n\n\nAlthough he can't see, he still hears where you thud against the ground. With a scream of rage and pain, he raises his club into the air and swings with all his might. It slams into your legs, shattering both of your legs as you scream in pain. He snarls, lifting up his club once more as you yell and grab at your broken legs, trying to focus on survival rather than the awful pain. He swings down his club once more, crushing your skull.", "action_results": []}, {"action": "Dodge", "result": "You roll to avoid his club swing, which slams into the stones next to you, sending splinters of wood flying in all directions. With his heavy club now on the ground, you now have a chance to do something.", "action_results": [{"action": "Dodge again", "result": "You slash at him, ready to dodge again as he lifts his club back up. He roars, swinging his club back at you. You roll under it again, before he changes direction of his swing, prepared for this. It slams into your legs, shattering both of your legs as you scream in pain. He snarls, lifting up his club once more as you yell asd grab at your broken legs, trying to focus on survival rather than the awful pain. He swings down his club once more, crushing your skull.", "action_results": []}, {"action": "Strike at his side", "result": "You step forward, jabbing your sword between his ribs and into his guts as he lets out a horrid scream. He snarls and focuses through his pain, smashing his fist into your snout and sending you toppling to the floor.\n\n\n\"Little cunt!\" he screams, grabbing your sword and yanking it from his side.\n\n\nWith a scream of rage and pain, he raises his club into the air and swings with all his might. It slams into your legs, shattering both of your legs as you scream in pain. He snarls, lifting up his club once more as you yell and grab at your broken legs, trying to focus on survival rather than the awful pain. He swings down his club once more, crushing your skull.", "action_results": []}, {"action": "Flee", "result": "You turn, grabbing Julianne by the hand and yanking her away. The ratling is faster, though, swinging his club again with more accuracy this time and knocking your feet away, sending you slamming into the stone floor. As you go to stand, he swings his club and slams it into your head, cracking your skull and killing you with a heavy blow.", "action_results": []}]}, {"action": "Run", "result": "You turn, grabbing Julianne by the hand and yanking her away. The ratling is faster, though, swinging his club and knocking your feet away, sending you slamming into the stone floor. As you go to stand, he swings his club and slams it into your head, cracking your skull and killing you with a heavy blow.", "action_results": []}]}]}, {"action": "Lie and agree", "result": "\"I'll get you out of here,\" you say, unable to meet her gaze.\n\n\n\"Thank you! Thank you!\" she whispers in relief, taking off her necklace and placing it in your hands.\n\n\nYou sigh, nodding as you wrap it around the handle of your sword. You wait patiently for Pak to arrive.\n\n\nAfter a few minutes, the massive, black-furred rat clambers into the burrow, grinning as he sees her prey. He stomps forward, grabbing her by the hand.\n\n\n\"Come on, darling. Let's take you down to the lower levels. I have a few of the others I want pulled over to my side, and I'm sure your sweet ass will do a great deal in getting them there.\"\n\n\nThe huge brute begins dragging the girl away, leaving you standing there.\n\n\n\"Ritz! Help, help!\" she cries out, looking desperately to you.\n\n\nSuddenly, he stops, turning around.\n\n\n\"Ritz, huh? That's your name?\" he asks.\n\n\nYou nod cautiously.\n\n\n\"You did a good job protecting her from the cripples and in the raid, and I'm feeling generous. Care to join in the fun?\"", "action_results": [null, null, null]}, {"action": "Tell her the truth", "result": "\"I can't. Even if I wanted to, they'd kill us before we got out,\" you admit.\n\n\n\"No, we can! We have to be able to! You can help me!\"\n\n\nYou stare at your feet, not saying another word.\n\n\n\"Take the necklace! Take it!\" she says, taking off her necklace and placing it in your hands. \"Please, there's a chance, there has to be a chance. You can help me. You can help me, please!\"\n\n\nYou don't answer, and as if the hopelessness of her situation is just hitting her she quiets down. You wait patiently for Pak to arrive.\n\n\nAfter a few minutes, the massive, black-furred rat clambers into the burrow, grinning as he sees her prey. He stomps forward, grabbing her by the hand.\n\n\n\"Come on, darling. Let's take you down to the lower levels. I have a few of the others I want pulled over to my side, and I'm sure your sweet ass will do a great deal in getting them there.\"\n\n\nThe huge brute begins dragging the girl away, leaving you standing there. \n\n\n\"Ritz! Help, help!\" she cries out, looking desperately to you.\n\n\nSuddenly, he stops, turning around.\n\n\n\"Ritz, huh? That's your name?\" he asks.\n\n\nYou nod cautiously.\n\n\n\"You did a good job protecting her from the cripples and in the raid, and I'm feeling generous. Care to join in the fun?\"", "action_results": [null, null, null]}]}, {"action": "Tell her the truth", "result": "\"Most likely? They'll take you down to the lower chambers as a treat for the more important Ratlings. They'll rape you for a few hours, maybe a few days depending on how resilient you are, and then they'll finally kill you and feed you to the giant rats.\"\n\n\nThe girl bursts into tears, sobbing with terror. You stare at her with a twinge of sympathy and guilt, before continuing walking.\n\n\n\"I need to get out of here! I need to...!\" she says, looking as if she wants to run, so you tighten your grip on her arm, knowing there's no way she'll escape either way.\n\n\nSoon, you walk down into the burrows through the caved in portion of sewer and into the top layer of the many layered burrows. The weakest and most feeble rats are forced to live here, away from the safety that waits lower down. They look gleefully at the girl, talking and chattering among themselves. They grab at her, groping at her breasts and bosom and tearing pieces of fabric off her dress. You raise your sword to threaten them off, and they easily follow orders. You're weak for a Ratling, but you could easily kill the crippled and the the meek who surround you. You find a corner of the room, shoving the girl into it and raising your sword, waiting for Pak to arrive and take his prey.\n\n\n\"I'm scared,\" the girl says.\n\n\n\"I'd be, if I were you,\" you admit.\n\n\n\"What's your name?\" she asks.\n\n\n\"Ritz,\" you say.\n\n\n\"I'm Julianne,\" she says. \"I don't want to die here.\"\n\n\nYou don't say another word, as she begins to chant.\n\n\n\"I have the soul of the dragon. Dragons to not break. Dragons do not die. Dragons do not show fear. Dragons survive the flames. I have the soul of the dragon...\" she continues to chant.\n\n\nYou turn, staring at her. You notice a long, silver necklace hanging around her, and grab it.\n\n\n\"This is pretty,\" you say, admiring the silver.\n\n\n\"You can have it. If you help me get out of here, it's all yours. It was a gift from my father.\"\n\n\nYou stare at the necklace, knowing there's not a chance she's getting out of here alive, even if you tried to save her.", "action_results": [null, null, null]}, {"action": "Lie to her", "result": "\"They'll... ransom you off back to the humans after a few days of imprisonment,\" you say.\n\n\n\"Oh... I can survive that. I can do that,\" she says.\n\n\nYou nod grimly, continuing walking. Soon, you walk down into the burrows through the caved in portion of sewer and into the top layer of the many layered burrows. The weakest and most feeble rats are forced to live here, away from the safety that waits lower down. They look gleefully at the girl, talking and chattering among themselves. They grab at her, groping at her breasts and bosom and tearing pieces of fabric off her dress. You raise your sword to threaten them off, and they easily follow orders. You're weak for a Ratling, but you could easily kill the crippled and the the meek who surround you. You find a corner of the room, shoving the girl into it and raising your sword, waiting for Pak to arrive and take his prey.\n\n\n\"I'm scared,\" the girl says.\n\n\n\"I'd be, if I were you,\" you admit.\n\n\n\"What's your name?\" she asks.\n\n\n\"Ritz,\" you say.\n\n\n\"I'm Julianne,\" she says. \"I don't want to die here.\"\n\n\nYou don't say another word, as she begins to chant.\n\n\n\"I have the soul of the dragon. Dragons to not break. Dragons do not die. Dragons do not show fear. Dragons survive the flames. I have the soul of the dragon...\" she continues to chant.\n\n\nYou turn, staring at her. You notice a long, silver necklace hanging around her, and grab it.\n\n\n\"This is pretty,\" you say, admiring the silver.\n\n\n\"You can have it. If you help me get out of here, it's all yours. It was a gift from my father.\"\n\n\nYou stare at the necklace, knowing there's not a chance she's getting out of here alive, even if you tried to save her.", "action_results": [null, null, null]}, {"action": "Change topic", "result": "\"Where are you from?\"\n\n\n\"Maryborough, a small trading town. My father lives there.\"\n\n\n\"Was he the merchant we killed?\"\n\n\n\"No, my father is a Paladin. I was given passage on the trading caravan to meet with him in the town over. He wanted to move me to our summer home in the country, where it's safer.\"\n\n\nAll this talk of summer houses and fine lives depresses you. You sigh, and continue walking. Soon, you walk down into the burrows through the caved in portion of sewer and into the top layer of the many layered burrows. The weakest and most feeble rats are forced to live here, away from the safety that waits lower down. They look gleefully at the girl, talking and chattering among themselves. They grab at her, groping at her breasts and bosom and tearing pieces of fabric off her dress. You raise your sword to threaten them off, and they easily follow orders. You're weak for a Ratling, but you could easily kill the crippled and the the meek who surround you. You find a corner of the room, shoving the girl into it and raising your sword, waiting for Pak to arrive and take his prey.\n\n\n\"I'm scared,\" the girl says.\n\n\n\"I'd be, if I were you,\" you admit.\n\n\n\"What's your name?\" she asks.\n\n\n\"Ritz,\" you say.\n\n\n\"I'm Julianne,\" she says. \"I don't want to die here.\"\n\n\nYou don't say another word, as she begins to chant.\n\n\n\"I have the soul of the dragon. Dragons to not break. Dragons do not die. Dragons do not show fear. Dragons survive the flames. I have the soul of the dragon...\" she continues to chant.\n\n\nYou turn, staring at her. You notice a long, silver necklace hanging around her, and grab it.\n\n\n\"This is pretty,\" you say, admiring the silver.\n\n\n\"You can have it. If you help me get out of here, it's all yours. It was a gift from my father.\"\n\n\nYou stare at the necklace, knowing there's not a chance she's getting out of here alive, even if you tried to save her.", "action_results": [null, null, null]}]}]}, {"action": "Scare off the horses", "result": "You walk over to the horses, untying them from their carriage before gently giving them a hit with their sword on the rump, sending them running off into the wilderness. Pak notices what you're doing, turning to stare at you, snarling. \n\n\n\"What the fuck do you think you're doing? That was good meat, good leather! You dumb cunt!\" he snarls, enraged by your lack of obedience.", "action_results": [{"action": "Try to convince him they deserved to live", "result": "\"But they were ki...\" you begin to say.\n\n\nUnfortunately, in all your life here you seem to have failed to pick up how society functions. By now, Pak's club is already flying through the air, and it smashes into your head, crushing your skull against the carriage and killing you instantly.", "action_results": []}, {"action": "Duck", "result": "You duck, but Pak slams his foot up, smashing you in the face. You sumble back and he punches you, sending you toppling to the floor. Pak stands over, stomping on you repeatedly as his weight and muscle breaks your bones as he smashes into you repeatedly as you scream for help.\n\n\nWith your limbs broken and lacking the strength to move, you hope you die of your wounds before something, some enterprising scavenger or worse, finds you.", "action_results": []}]}]}, {"action": "Loot some more", "result": "You scurry into one of the carriages, clambering outside. Blood cakes the inside, where some poor soul was hacked apart in their sleep. You find a jar of cider, opening it and quickly downing the delicious drink, before tossing it aside. You grab a jar of honey that's almost empty and begin scooping it into your mouth.\n\n\n\"Everyone out here! Now!\" one of the ratlings yells, as you turn and walk outside.\n\n\nThe largest rat, a big brute who's taken charge of the raid named Pak, stands there. Not too many ratlings have joined the raid, a fact Pak is clearly enjoying as it means he gets to take charge, and since you all get a bigger part of the profit, all the better.\n\n\n\"You, you and you!\" he shouts, selecting three rats from the group. \"Start moving the prisoners back.\"\n\n\n\"Yes, yes,\" they snarl, as they begin to shout and whip the prisoners into movement.\n\n\n\"You!\" he shouts, pointing a long finger at you. \"Kill the horses.\"\n\n\nYou nod, walking over to the horses. They seem terrified and scarred, and look at you as if begging for mercy. You wonder if it's best just to untie them and scare them off.", "action_results": [null, null]}]}, {"action": "Charge him", "result": "You raise your sword, charging forward. The guard yells and steps back, jabbing his spear out. The metal spear jabs into your fur and into your chest and you yelp as he runs you through. He pulls the spear out as you collapse to your knees, before he jabs it through your throat, killing you.", "action_results": []}, {"action": "Wait for the others", "result": "You continue circling the man the as he jabs at you, as you back step to avoid the jabs. Soon, other rats arrive. You can see the man's eyes bulge as he realizes how outnumbered he is. He jabs at another ratling and you take advantage, grabbing your sword forward and stabbing him in the throat. He tries to yell but blood bursts into his throat as you pull out your blade. \n\n\nYou turn to one of the caravans, where rats have killed the guards and are dealing with the merchants. The merchants are surrounded, looking terrified, as all those willing to fight have been cut down.\n\n\nAlthough the majority of them are to be enslaved and sold to the Lizards or the Eastern Tribes, while the women will be taken back to the burrows for a less than kind fate, one unfortunate soul has made his presence known by trying to negotiate.\n\n\n\"Please, taken the cargo! It's yours! Keep the men as well, we'll fetch a heavy ransom! But leave the women and the child go, won't you?\" the merchant leader says.\n\n\nBad choice. The boys have taken note of him now, and he's a fat one. His weight, the fact that he has so much food he can grow weak and fat, only angers you all thanks to the fact that you're all constantly hungry and eating scraps. One of the ratlings slashes his axe, cutting open the man's belly in a superficial wound. Another ratling jabs him with a spear, as the boys begin to jab and slash at the man as he yelps in pain as he's slowly cut and hacked apart.\n\n\nThe torture has drawn the others attention away from the actual carriages. You stare at them, contemplating sneaking away and grabbing yourself some more food.", "action_results": [null, null]}]}]}