{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=31353", "context": "", "first_story_block": "You are a Private Detective living in Victorian London.\n\n\nCrimes are common and you are frequently called upon to assist the policemen in Scotland Yard. You have been a Detective for a few years now and by combining hard work with intelligence you have had a few successes in uncovering the information that has enabled the Police to arrest wanted criminals. This has earned you a good Reputation but you must be careful not to lose it: if you do Scotland Yard will no longer trust you to help them.\n\n\nOne evening you are at home when Commissioner James Monro, an experienced Policeman, visits you.\n\n\n\"We would like your help again,\" he tells you. \"A lunatic murderer called James Kelly escaped from\n\nBroadmoor Asylum for the Criminally Insane ten days ago. My detectives have investigated and found no trace of him. Perhaps if you look into the case you might be able to find something?”\n\nWhat do you do?\n\n ", "action_results": [{"action": "Search for the escaped killer", "result": "\"I'll see what I can do,\" you tell Monro who nods.\n\n\n“I’m glad you can help,\" he tells you. \"I’ll send a telegram to Dr Orange, the Superintendent at Broadmoor,  asking him to meet you tomorrow. He can tell you more about Kelly.”\n\n\nThe next day you take a train out to the Asylum in the heart of the Berkshire countryside. A servant from the Hospital meets you at the station and takes in a horse and carriage through the sleepy village of Crowthorne and up to the gloomy and looming concrete walls of the Hospital. You are shown directly into Orange’s office where the Doctor shakes your hand. He is a middle-aged profession with a no-nonsense manner.\n\n\n“I got Commissioner Monro's telegram and I will be glad to help you in any way I can,” he tells you. “We are all rather concerned here: James Kelly was one of our most clever patients and I believe him to be a real danger to the general public, especially women.”\n\n\nYou nod and consider which questions to ask first.\n\n ", "action_results": [{"action": "What is Kelly's criminal history?", "result": "“Five years ago Kelly stabbed his wife Sarah in the neck with a knife killing her,\"  Dr Orange tells you. \"He believed she was a prostitute who had infected him with a sexually transmitted disease. He surrendered at once to policemen and became very remorseful afterwards, claiming he was mad. At the trial he was originally sentenced to be executed but at an appeal he was found mentally unfit and sentenced to life imprisonment at this facility. During his time here Kelly has shown no violent tendencies and in fact displayed no signs of insanity whatsoever. I would say he was one of the cleverest patients we've ever had here.\"\n\nYou nod, considering what to ask next.\n\n\n ", "action_results": [{"action": "\"How did Kelly escape your prison?\"", "result": "\"Kelly and another prisoner called George Shatten both play instruments in the Asylum’s band,\" Dr Orange tells you. \"On the evening Kelly escaped they went out into the garden where the band meet to practice. When the rest of the band joined them an hour later only Shatten was still there. When we searched him we found two keys that he and Kelly had carved made out of some metal they found in the asylum’s garden. Kelly used this to let himself through a gate in the inner wall and afterwards climbed the six-foot high outer wall. He vanished without a trace but guards do report seeing a man called John Merritt near the Hospital during the day yesterday. He is an old friend of Kelly’s and visits him occasionally.”\n\n\nYou nod, considering your next question.\n\n\n ", "action_results": [null, {"action": "\"Where do you think Kelly will go now?\"", "result": "\"I have no idea,\" Dr Orange says heavily. \"The house he lived in and where he killed his wife Sarah is in Shoreditch, London. He has told me he was born in Liverpool and may still have family there. Two of his old friends, a Mr John Merritt and a Mr Walter Lamb, used to visit him from time to time here at the Asylum. Unfortunately we have no registered addresses for either of them. The only address we have on file is Kelly's former residence in Shoreditch.\"\n\n\nYou nod, considering your next question.\n\n\n \n\n ", "action_results": [{"action": "\"What is Kelly's criminal history?\"", "result": "You are not interested in trying to find Kelly and turn the case down.\n\n\nTwo months later two policemen visit your home introducing themselves as Constables Wildey and Dillworth. “A lady called Ada Wilson has been stabbed in her home in Mile End” Dillworth tells you. “She is in hospital in a serious condition but hopefully she'll pull through. My colleague and I have been tasked with finding the assailant and Commissioner Monro recommended we talk to you. Would you be willing to help us?”\n\n\n ", "action_results": [{"action": "Agree to help search for this mysterious knifeman", "result": "You agree to help the investigation and the Policemen smile.\n\n\n“Thank you sir,\" Dillworth replies. \"The attack took place at Mrs Wilson’s residence on Maidman Street. She is currently under the care of Dr Wilson at the Mile End Hospital. The attacker stabbed Mrs Wilson twice in the throat but fortunately the windpipe was not severed. If you tell us where you will go we will accompany you.”\n\nWhat do you do?", "action_results": [{"action": "Go to Maidman Street", "result": "You travel to Maidman Street where the Constables identify Mrs Wilson's house and you knock on the door. It is opened a crack by a nervous young lady who looks relieved when she sees you are accompanied by two uniformed policemen. Opening the door wider she introduces herself as Miss Bierman.\n\n\n\n\n“I live here with Mrs Wilson” she tells you. “Last night I heard her come home with a man but I was upstairs in my bedroom and did not see them. At around midnight I heard the most terrible screams you could imagine! I ran downstairs and as I was coming down the stairs Mrs Wilson shouted to me 'Stop that man for cutting my throat! He has stabbed me!' She collapsed in the hallway and as she did a young man ran to the front door, threw it open and raced outside.”\n\n\n\n\n“Can you describe this man?” you ask Miss Bierman who nods.\n\n\n“He was young with fair hair and had a light coat,\" she tells you. \"I only caught a glimpse of him, after he left I ran to help Mrs Wilson who was bleeding badly. I don’t know what to do now, it is just me and my mother here. What should we do if he comes back?”\n\n\nThe policemen reassure her that she is perfectly safe and after thanking her for her help you walk away, considering where to go now.", "action_results": [{"action": "Go to the Mile End Hospital", "result": "Traveling to the large Mile End Hospital you find the ward with Ada Wilson on and approach her bed. Mrs Wilson is a young lady with a blood-stained bandage wrapped around her neck, she is very pale but greets you with a hoarse voice. The policemen explain to her who you are and ask her to describe her attack.\n\n“I was at home when I heard a knock on the door,\" she tells you. \"When I opened it I saw a man I did not know waiting. He demanded money from me and told me if I didn’t give him any I would be dead in a few moments. I refused so he drew a clasp knife from his pocket, stabbed me twice in the throat and ran off. He was about 30 years old, five foot six inches with a sunburned face and a fair mustache. He was wearing a dark coat, light trousers and a hat.”\n\nThanking Mrs Wilson you think about what to do next.\n\n\n ", "action_results": [null, {"action": "Wrap up the investigation", "result": "You decide you have done all that you can for now, you have a description of the attacker but in a city the size of London there are probably thousands of men who match it. Constables Wildey and Dillworth are disappointed but thank you for your help, promising to keep looking for the man who matches the description of Mrs Wilson's attacker. A few days later Constables Wildey and Dillworth visit your home again. You ask them if they have had any luck looking for their man but they shake their heads.\n\n\n“We’ve just heard a woman called Annie Millwood has collapsed and died at a workhouse in South Grove,\" Dillworth tells you. “It seems last month she was stabbed numerous times and had only recently been discharged from a hospital in Whitechapel. If you have time perhaps you could investigate this murder for us?”\n\n\n ", "action_results": [{"action": "Agree to look into it", "result": "“Mrs Millwood’s body has been taken to the mortuary at Baker’s Row Infirmary” Wildey informs you when you agree to help. “The Workhouse where she died is the Whitechapel Union Workhouse in Southgrove, apparently she had been living there for ten days prior to her death. You will want to start your search at one of those places. I’m afraid me and Constable Dillworth will not be able to accompany you personally as we have other duties to attend to.”\n\n ", "action_results": [{"action": "Go to the Bakers Row Infirmary", "result": "Going to the Baker’s Row Infirmary you make inquiries about Mrs Millwood to a nurse at the front desk.\n\n\n“Ah yes, poor woman” the nurse says sadly. “Dr Wheeler treated her when she was first stabbed and Dr Arthur has just finished conducting the autopsy on her body. You will want to talk to one of those gentlemen.”", "action_results": [{"action": "Ask for Dr Arthur", "result": "You are directed to Dr Arthur's office to find the Doctor is a grey-haired professional. Identifying yourself you ask him if he conducted the autopsy on Mrs Millwood.\n\n\n“I did,\" he replies heavily. \"Mrs Millwood died from a sudden effusion into the pericardium from the rupture of the left pulmonary artery through ulceration.”\n\n\n“Pardon?” you ask, completely baffled, and Dr Arthur smiles.\n\n\n“Natural causes sir. Mrs Millwood died from natural causes unrelated to her previous knife wounds.”\n\n\nIt seems there has been no murder at all so you return home and that evening inform Constables Dillworth and Worthey that Annie Millwood died from natural causes. They thank you for your good detective work, increasing your reputation with the police.\n\n\n1 has been added to your Reputation Points.\n\n\nAgain after just a few days Constables Dillworth and Worthey return to visit you, looking concerned. “There has been another attack,” Dillworth tells you. “A prostitute called Emma Smith is at the London Hospital in Whitechapel with what I’m told are horrific injuries. It does not seem likely that she will survive. Unfortunately my partner and I are unable to attend to this case ourselves as we are involved with another investigation, could you look into this for us?”\n\n\n ", "action_results": [{"action": "Agree to help them", "result": "“It seems that Miss Smith was attacked on the corner of Brick Lane last night at around 4am,” Constable Worthey tells you after you agree to help. “She managed to walk back to her lodgings on George Street in Spitalfields where two ladies helped her to the Whitechapel Hospital. She's there now in a serious condition. You will probably want to start your investigation in one of these three places.”\n\n\n \n\n ", "action_results": [{"action": "Go to the crime scene on Brick Lane", "result": "You make your way to Brick Lane which is a busy street in the heart of London's East End. You make your way to the corner where the attack hapenned but there is nothing to be seen in the light of day, not even any blood on the ground. After examining the area where Emma Smith was attacked and not finding any trace of evidence you consider your next move.\n\n\n ", "action_results": [{"action": "Go to Miss Smiths house in Spitalfields", "result": "You travel to George Street in Spitalfields and knock on the door of Miss Smith's house. It is opened by a pale-faced lady who watches you carefully as you identify yourself as a Private Detective.\n\n\n“I’m Mary Russell, I’m the Landlady of this lodging house” she tells you. “I’ve known poor Emma for about two years and helped her when she came home this morning. It was me and Emma's friend Margaret who took Emma to the Hospital and I've never seen so much blood in all my life...\"", "action_results": [{"action": "Question Mrs Russell about the attack", "result": "You ask Mrs Russell to describe Emma‘s appearence when she returned.\n\n\n“It was terrible,” Mrs Russell tells you. “Emma got in at around four or five o’clock and woke me up. She said she had been attacked and raped by three men. They’d given her black eyes and half-torn off one of her ears. She was bleeding so much that the shawl she'd put between her legs to soak up the blood was soaked and dripping. How she managed to walk home I’ve no idea. Me and Margaret helped her to the Hospital and left her with Dr Haslip.”\n\n\nYou thank Mrs Russell for her information including the important fact that Emma was attacked by a gang instead of just one person. You return home and share this information with the Constables when they visit.\n\n\n“The East End is dangerous at night with all these street gangs roaming around,” Dillworth tells you. “Still, at least we know Mrs Smith’s assailant in probably not the lone man who attacked Mrs Wilson. Thank you for finding this out for us.” You reputation with the police has improved slightly and you gain 1 Reputation Point. Two days later you are saddened to read that Emma Smith has died of her injuries.\n\n\nYou have added 1 to your Reputation.\n\n\nThe next four months are quiet ones for your Detective Practice until one morning your breakfast is interrupted by the arrival of Detective Inspector Edmund Reid, a senior figure in the Metropolitan Police. Serious and matter-of-fact he comes straight to the point. \n\n\n“I would like your help,” he tells you. “Last night a woman was brutally murdered in the George Yard buildings in Whitechapel. She has been stabbed some forty times. When this reaches the newspapers there will be a lot of public interest in finding the murderer. I am aware of your abilities and would like your assistance in this business.\"", "action_results": [{"action": "Agree to investigate", "result": "\"Good man,” Inspector Reid says briskly. “As I understand it this unfortunate lady’s body was found inside the George Yard building at around 5am by a man who informed Constable Barrett. Barrett in turn notified Dr Killeen who has taken the body of the deceased to the mortuary on Old Montague Street to perform an autopsy. Constable Barrett is over at H Division’s Police Station and we can either go to the scene of the crime, collect the results of the autopsy or talk to Barrett.”", "action_results": [{"action": "Go to the crime scene in George Yard", "result": "You and Inspector Reid walk out to the George Yard Building in Whitechapel, an old factory that has been converted into an apartment block. Reid leads you through the main entrance and up a flight of stairs onto a landing. “The body was discovered lying there” he says pointing to a large circlular pool of dried blood at the foot of the next set of stairs leading up. Apart from the blood there is no trace of any evidence at the scene. Just a few feet from the blood is a door. “The Superintendent of the buildings, a Mr Hewitt lives there with his wife,” Reid tells you consulting a notebook. “Mr Reeves, the man who discovered the body, resides in room 37 in this building.”", "action_results": [{"action": "Talk to Mr Hewitt", "result": "You knock on the door next to the pool of blood and it is opened by an old man. You are startled to see a short way from the door is a bed on which an old lady, undoubtably his wife, sits. From the bed to the pool of blood it can only be a few meters. Inspector Reid introduces you both to the couple who look understandably nervous. You ask them if they heard any sounds of a struggle or of voices last night and they both shake their heads.\n\n\n“I didn’t hear anything all night,” Mr Hewitt tells you firmly.\n\n\n“It seems a bit strange that a woman was stabbed forty times outside your bedroom door and neither you or your wife heard anything,\" Reid says skeptically.\n\n\n“At one point last night I heard someone cry out 'Murder' in a loud voice but it seemed to me that the sound came from outside the building,” Mrs Hewitt says suddenly.\n\n\n “This is a rather rough neighborhood and cries, screams for help and loud drunks can be heard round here most nights,” Mr Hewitt puts in. “We don' think much of them. Personally I think this poor creature crept up the staircase accompanied by a man for... immoral purposes, that a quarrel took place for some reason or another and that he stabbed her.”\n\n\n\n\nYou and Reid exchange glances and thank the pair. As you turn to go Mr Hewitt holds up a hand.\n\n\n“You might want to talk to Alfred Crow in Room 35 or Elizabeth Mahoney at number 47. They have told me they moved through this landing at different times last night and may have seen something. John Reeves who found the poor lady lives at number 37.\"\n\n\n ", "action_results": [{"action": "Talk to Mr Reeves", "result": "Going upstairs to room 37 you knock on the door. A burly man with a beard opens the door and introduces himself as Mr Reeves.\n\n\n“Yes sir, I found the body sir,” he tells you in response to your inquiries. “I generally go down to the docks around 5am to start work. This morning I saw that woman lying in a pool of blood on the landing. Her skirts were hitched up to her stomach and she looked like she’d been raped... it was a tough thing to see. Well sir I ran out into the street right away and found this copper Barrett walking his beat. I brought him straight here and he sent me to fetch Dr Killeen from Montague Street. After that your man Barrett told me to stay in my room today so that I might be available for any inquiries.”\n\n\n“Did you see any evidence of weapons at the scene?” Reid asks him, taking notes. “Anything like footprints or personal belongings?”\n\n\nReeves shakes his head. “No sir, nothing like that.”\n\n“Did you hear any disturbances last night?” you ask him.\n\n\nReeves frowns. “There were two fights on the street outside before and after midnight” he tells you. “I heard people shouting 'police' and 'help' and there was some screaming, terrible screaming. I looked outside and there was some crowds out on the street fighting but policemen came and cleared them away. There was another fight around two am and some more screaming. I looked outside again and there was some drunks out there fighting but they moved away after a while and I didn’t hear anything else.”\n\nYou and Reid thank Reeves for his information.\n\n\n ", "action_results": [null, {"action": "Get the results of the autopsy from Montague Street Mortuary", "result": "You and Detective Reid walk down to the mortuary on Montague Street where you meet Dr Killeen, an elderly and professional medical man. The body of the murdered woman is lying under a bloody sheet on a table nearby, judging by her face she is a plump, middle aged woman. Her eyes are closed and her mouth is open as if in surprise: she looks surprisingly calm like she is sleeping. After introducing you Reid asks Dr Killeen for the results of his examination.\n\n“This lady was killed by thirty-nine separate stab wounds to her body,” Dr Killeen says monotonously. “The killing occurred around two thirty this morning I should guess. This lady is around thirty-six years old and well fed. She has seventeen stab wounds in her breasts, six stab wounds in her stomach, five stab wounds in her left lung, five in her liver, two in her right lung, two in her spleen, one in her groin and one in her heart which I would identify as the fatal wound. This injury penetrated her beast bone and must have been inflicted with some force by some sort of dagger or bayonet.”\n\n“A bayonet?” you ask surprised and the doctor nods.\n\n\n“Most of these injuries could have been inflicted by a right handed man armed with a pen knife or similar weapon except for that one. In addition to her other wounds this subject has been stabbed nine times in the throat. These injuries were all inflicted on her while she was still alive and her death was the result of massive blood loss. I found no evidence of recent sexual intercourse.”\n\n\n\n\nThe image of a man hacking this lady to death on a darkened landing with nearly fifty stabs is a grim one and her death must have been very painful. You and Reid thank Dr Killeen for his work and quietly leave. Outside you breath in the fresh summer air and pause to brace yourself so you can continue the investigation.\n\n\n ", "action_results": [null, {"action": "Go to the police station to talk to PC Barrett", "result": "Detective Reid takes you to the H Division Police Station where you meet with PC Barrett, an honest looking middle-aged policeman.\n\n\n“Please describe your experiences last night” Reid tells his deputy.\n\n\n“I was walking my beat last night which takes me past the George Yard buildings on Wentworth Street,” Barrett begins, consulting his notebook as he speaks. “At approximately 2am I was walking past them when I saw a soldier waiting next to the building’s entrance. I would describe him as a Private wearing the uniform of the Grenadier Guards, aged between 22 and 26, approximately five feet and nine inches tall with a fair complexion, dark hair, a small brown mustache and a good conduct badge but no medals. I asked him what he was doing and he told me he was “waiting for a chum who had gone off with a girl.'”\n\nYou and Reid exchange glances, your excitement mounting.\n\n\n“Approximately three hours later this man John Reeves ran up to tell me he had found a dead woman lying inside the George Yard Building. We went there and saw a plump woman lying on her back on the landing in a great pool of blood. Her hands were tightly clenched at her side, her legs were spread open and her clothes were pulled up leaving her lower half exposed. She was approximately thirty five years old, five feet three inches with a dark complexion, dark hair and wore a green skirt, brown petticoat, black jacket, spring-sided boots and a black bonnet. Her clothes were all old and stained. I sent Reeves to fetch Dr Killeen who arrived, pronounced the unfortunate lady dead and I helped remove her body to Montague Street before coming here to make my report.”\n\n\n\n\n\"This is a model of good police work Barrett,\" Reid says happily. You thank Barrett too and consider your next step.", "action_results": [null, null, {"action": "Wrap up the investigation", "result": "You and Detective Reid are thoughtful as you return to your home that evening.\n\n\n\"Well, we've received a good deal of information,\" Reid tells you. \"Where do you think we should focus our search for this murderer?\"\n\n\n ", "action_results": [{"action": "In the pubs near the George Yard Building", "result": "You suggestion is a commonsense one but you've overlooked important information and consequently the police inquiries in the pubs lead nowhere. When a photograph of the murdered woman is published in the papers she is identified by friends as a prostitute called Martha Tabram. Ten days after her murder DI Reid arrives at your home looking tired.\n\n\n“We have been concentrating our search on a soldier who was allegedly with Mrs Tabram around the time of her death” Reid tells you. “I have been at the Tower of London and to the Wellington Barracks with PC Barrett and a lady called Pearly Poll who was with Mrs Tabram at the night of her death. They’ve picked out several soldiers between them as the one that went off with her but all the men they picked have solid alibis for the night of the murder. We’ve spoken to Mrs Tabram’s husband Henry Tabram, Mrs Tabram’s boyfriend Henry Turner, Mrs Tabram’s sister-in-law Mrs Morris and Mrs Tabram’s former landlady Mrs Bousfield as well as this woman Pearly Poll but the investigation has ground to a halt. I’d like you to talk to some of the people on this list to see if you can get any information which might help us.\"\n\n\nYou nod, considering who to approach first.\n\n\n ", "action_results": [{"action": "Talk to Martha Tabram's friend Pearly Poll", "result": "Traveling to Pearly Poll’s home on Dorset Avenue you arrive to find she is a big, red-faced woman smoking a pipe. After you convince her that you work with the police she reluctantly talks to you.\n\n\n“Sure I knew Martha though round these parts she called herself Emma Turner. Known her four or five months. I was with her the night she snuffed it, we was drinking ale and rum first at The Two Brewers and later at The White Swan. We met two soldiers there and were drinking with them for a few hours. One was a private and one was a corporal. They had white bands round their caps. Just before midnight we separated, I took the corporal up Angel Alley and Martha took hers towards the George Yard Building. That was the last I saw of her.\"\n\n\nPearly Poll sighs.\n\n\n\"Me and the corporal did our thing and then we had an argument over payment and he hit me with a stick. The first thing I knew about the murder was when I read it in the morning papers. Poor Martha! Since then I have been to two parades with DI Reid to try and pick out the soldiers we were with but all the ones I thought I knew have proven they was elsewhere. I don’t know what to do now, same as always I guess. Least Martha's out of this terrible life now.”\n\n\nYou thank the woman for her help and quietly leave.\n\n\n ", "action_results": [{"action": "Talk to Martha Tabram's husband Mr Tabram", "result": "Traveling out to a nice part of London called River Terrace you knock on the door of the house owned by Mr Tabram. He turns out to be a short, well-dressed man with iron grey hair and a mustache. You identify yourself and try to ask him about his wife but he cuts you off pretty quickly.\n\n\n“I have not seen her for eighteen months,” he tells you shortly. “We were married and had two sons but we separated thirteen years ago on account of her drinking. I used to send her twelve shillings once a week but I stopped doing that when I learned she was living with another man. When I saw her photo in the papers I went down to Montague Street and identified her body. She has…she had... well she'd sunk very low in life.”\n\n\nBefore you can ask another question Mr Tabram slams his front door shut.", "action_results": [null, {"action": "Talk to Martha Tabram's boyfriend Mr Turner", "result": "Traveling to the Working Men’s Home in Spitalfields you meet with Mr Turner. He is a little man with a light sandy mustache but very dirty clothes and hands.\n\n\n“I was with Martha on and off for about twelve years,” he tells you. “Since we lived together her drinking has picked up. If I gave her money she'd spend it on drink, any money I gave her she would spend on drink. I do not drink and when she was sober we were fine but when she was drunk I would leave her to her own affairs. She was usually out late drinking most nights and I knew how she made her money when I gave her none..”\n\n\n\n\nYou nod sympathetically. “When did you last see her?” you ask.\n\n\n“Well I moved in here a few weeks ago and last saw her alive three days before she died. I gave her a shilling and a half to help her get by. I saw her photo in the newspaper… I had hoped that if she could just stop drinking we could get back together again. Guess that won't be happening now.. my Martha is gone and I’ll never see her again.”\n\n\nMr Turner turns his head away to try to hide the tears in his eyes and thanking him for his time you quietly leave.\n\n\n ", "action_results": [null, null, {"action": "Talk to Martha Tabram's sister-in-law Mrs Morris", "result": "Traveling to a respectable-looking house in Mile End you find Mrs Morris's house and knock on the door. It is opened by a serious-looking woman dressed all in black who turns out to be Mrs Morris.\n\n\n“I didn’t see very much of Martha on account of her heavy drinking” Mrs Morris tells you after you identify yourself. “I’ve never known her to work for a living and I knew she was a prostitute. She was always asking me for money to spend on drink… I last saw her at 11pm on the night of her death. I was walking down Whitechapel Road and saw her going into the White Swan pub with a big ugly lady and two soldiers. I didn’t talk to her and I don't think she saw me. The first thing I knew about this tragedy was when I read about it in the papers. I can't say I'm surprised, just a bit sad I guess. Me and my husband always hoped Martha would pull herself together.”\n\n\nYou thank Mrs Morris for talking to you and leave.\n\n\n ", "action_results": [null, null, null, {"action": "Talk to Martha Tabram's former landlady Mrs Bousman", "result": "Traveling out to Dorset Street you knock on the door of a house which is quickly opened by a middle-aged lady who introduces herself as Mrs Bousfield. She readily answers your questions when you tell her you work with the police.\n\n\n“Mrs Tabram and her man Turner were living here earlier in the summer for three months,” Mrs Bousfield tells you. “They snuck out one night owing me rent money. I would describe her as the sort of person who would rather have a glass of ale than a cup of tea but she was not always drunk and she never brought any man home with her except Mr Turner. You could tell how she made her living though. She was always very good helping me with my children and I was sad to hear what happened to her...”\n\n\nYou leave after thanking Mrs Bousfield for talking to you.\n\n\n ", "action_results": [null, null, null, null, {"action": "Wrap up your investigation", "result": "That evening you return home weary and unhappy: your latest investigations haven't revealed anything new except the details of Martha Tabram's life. Once she had a family and a prosperous life: after a dozen years of suffering her life ended in a frenzied assault at the foot of some stairs in a crappy apartment block. DI Reid is equally pessimistic when he calls the next day.\n\n\n\"It's no use,\" he confesses. \"We can't identify the soldier Mrs Tabram was with. It might not even have been him who killed her but someone else entirely.\"\n\n\nThis theory will gain strength very soon: just a week later a second brutal murder occurs which signals a monster's reign of terror over a frightened city and will catapult you into the hunt for the most ruthless killer London has ever known...\n\n\nAt this point you might want to save the game or take a break: your hunt for the Ripper is about to begin.", "action_results": [{"action": "Are you ready?", "result": "One night you cannot sleep.\n\n\n\n\nRestless and feeling unaccountably anxious you rise from your bed with a sigh after several hours of trying and failing to fall asleep. A glance at your watch tells you it is 3am. Pulling on your clothes you set off for a walk down London’s dark and lonely streets with thoughts of buying some snack somewhere. Some time later you are walking down a lonely alley called Buck’s Row when you see a man walking just ahead of you. He looks like a cabman on his way to work and a second cabman can be seen just up ahead standing in the middle of the street looking at a strange shape lying in front of a gateway. From a distance it looks like a tarpaulin.\n\n\n\n\n“Come and look over here,” the stationary cabman calls out to you and the other man. “There is a woman lying on the pavement.”\n\n\n\n\nWith a foreboding feeling you approach cautiously and see a middle-aged little woman lying on her back on the ground, her eyes wide open and staring blindly at the night sky. She does not appear hurt but the first cabman kneels next to her. He picks up her hands in his.\n\n\n\n\n“I think she is dead,” the cabman says looking up. You lean over the woman’s round face and greying hair and are startled when she gives a faint sigh of breath, the air brushing against your face\n\n\n\n\n“She is breathing but only just,” you reply nervously.\n\n\nHearing footsteps you spring to your feet and see a policeman walking down the street at the mouth of the alleyway, a lantern held in his hand. The two cabmen run up the street towards him.\n\n\n ", "action_results": [{"action": "Follow them", "result": "Your hurry after the two cabmen and call out to the policeman that there is a woman lying in the alley.\n\n“She looks either dead or drunk but I think she is dead,” you tell the officer. The cabmen explain they are late for work and hurry off so you walk back down the alley with the policeman and show him where the woman is lying. Almost simultaneously two other policeman arrive with their lamps, attracted by the commotion. After looking at the motionless woman lying on the ground one of the policeman tells his companion to fetch the local police doctor, Dr Llewellyn.", "action_results": [{"action": "Go with the officer to fetch the Doctor", "result": "You hurry off with a Constable at a steady jog to a house a few streets away. The policeman knocks on the door and calls for Dr Llewellyn to come quickly as there has been a murder. After a few minutes an old doctor emerges from the house pulling on his coat and orders you and the officer to fetch a stretcher from a shed across the road. Together the two of you find the stretcher and follow the Doctor quickly back to the alleyway. The crime scene is as you left it with the two policemen still standing there alongside the murdered woman. The Doctor takes one glance and shakes his head.\n\n\n\n\n“Move her to the mortuary,” he instructs. “She is dead and I will make a further examination of her.”\n\n\n\n\nYou are shaken as the woman’s small body is lifted, revealing a large pool of dried blood beneath her head. The policemen place the body on a stretcher and hurry away with the Doctor leaving one policeman to guard the crime scene. You consider whether you should lean on your status as a Private Detective to try and accompany the body to the mortuary or go home for a stiff drink. It can be difficult enough sometimes investigating murders but discovering one is so much more worse.\n\n\n ", "action_results": [{"action": "Remain and examine the crime scene", "result": "As the Doctor’s group leave carrying the corpse on the stretcher between them you are left in the alleyway with the policeman guarding the small pool of blood on the ground. Suddenly the gate in front of the blood opens and a middle-aged woman in a nightgown appears there with a half-dressed teenage son at her side. She asks what has been going on and looks astonished when the policeman tells her there has been a murder.\n\n\n“I never heard a sound though and I’m such a light sleeper,” she says in surprise. “Look my bedroom window is right there,” she says and points to a window right alongside to the gate and just five feet away from the pool of blood. She shakes her head and then says something to her son that you don’t catch. He hurries off and returns a few moments later with a bucket in his hands. Before you can intervene he tosses it's contents of water over the pool of blood on the ground, washing it clean away.\n\n\n\"What on earth do you think you are doing?\" the policeman exclaims in alarm.\n\n\n\"This is our stable back here,\" the woman exclaims jabbing her feet at the yard behind her. \"Do you think anyone will want to keep their horses here again if they hear some poor unfortunate was murdered in the gateway?\"\n\n\nThe woman and her son go back inside their home leaving the policeman looking horrified at the now clean cobblestones of the street. You decide there is nothing more to be learned here now all the evidence has been washed away.\n\n\n ", "action_results": [{"action": "Hurry to the mortuary to view the autopsy", "result": "You go to the mortuary where you find Dr Lewellyn is preparing for the autopsy. Two assistants are stripping the body of it’s clothes and as they remove the dead woman’s upper shirt they suddenly give a sudden shout of fright. You and the doctor spin around in alarm. Across the dead woman’s stomach are several fresh slashes running diagonally downward from left to right. Someone has slashed savagely at this woman’s stomach with a knife of some kind, partly disemboweling her. One of the assistants staggers away pale, his blood-soaked hands shaking\n\n“You might want to step into the yard for a time,” Dr Lewellyn suggests to you. “Autopsies can be difficult experiences. I’ll have my men provide you with this unfortunate lady’s clothes and possessions for you to examine.”\n\n\n ", "action_results": [{"action": "Insist on witnessing the autopsy", "result": "You insist on staying in the room while the Doctor examines the woman’s body. With infinite care he opens the dead woman's mouth and finds she is missing several teeth, though these seem to be old injuries as our bruises on her face. The Doctor reports that the dead woman’s neck has been slashed through to the backbone by a single slash, the windpipe completely severed. Apart from the various slashes to her abdomen these are the only injuries, the Doctor tells you he thinks it would have taken a knife at least eight inches long to inflict such wounds.\n\n ", "action_results": [{"action": "Feeling sick you go into the yard to examine the dead woman's possessions", "result": "In the yard of Dr Lewellyn’s home you examine the dead woman’s things. Her clothes are dirty and blood-soaked, you find that the petticoats have “Lambeth Workhouse” stencilled on the labels. In the pockets are a comb, a handkerchief and a broken shard of mirror, the meager possessions of a tough life, indeed the only thing that looks new and clean is a pretty black bonnet. You turn it over, looking at it thoughtfully as the dead woman must have. You are still thinking when a man strides into the yard; you recognise him as a Police Inspector you have worked with in the past called John Spratling.\n\n“This is a terrible business,” he tells you. “The Doctor says this woman had her throat cut by a man with a knife who then slashed up her stomach. You best take yourself home and get some rest, if I'm not mistaken someone will call on you later.”\n\nYou nod and walk through the doctor's house, passing the motionless and practically decapitated corpse on the way out.\n\n\n ", "action_results": [{"action": "You already know these memories will haunt your dreams for a long time to come", "result": "You don’t have the stomach to investigate any more. Returning home you pour yourself a whisky with nerveless hands and as the morning sun rises over London you stay awake, turning the night's events over in your mind. You are still in your armchair when a tall officer with a mustache and sharp, intelligent eyes calls on you a few hours later.\n\n\n\"I'm Inspector Frederick Abberline of Scotland Yard,\" he introduces himself. \"I understand you are one of the men who found the murdered woman’s body in Buck's Row last night? We have identified her as one Mary Ann Nichols, a prostitute well known in the Whitechapel area. Dr Llweyllen tells me she had her throat cut and was also disemboweled. That makes the crime particularly worrying because that means her killer wasn't just trying to kill her, he wanted to cut her up as well...”\n\n\n\n\nAbberline is silent for a moment before looking at you carefully.\n\n\n\n\n“I understand you have had some success in working with us in the past. Well I have been given charge of this investigation and I am officially hiring you as a Private Detective to help us track down whoever was behind this killing and bring them to justice. This is the second prostitute killed in a month and the police must be seen to be taking action. All your expenses will be reimbursed and you can rest assured if you help me in this investigation I will certainly help you.\"\n\n\nAbberline pulls a notebook from his pocket and opens it.\n\n\n\"Now I already have quite a few leads I would like you to help run down some of them for me. Let me see... we have traced Mrs Nichols’s father Mr Walker to an address in Camberwall. Her ex-husband William Nichols is living in Old Kent Road while a woman named Mrs Holland has made herself known to us as a friend of Mrs Nichols. Already a number of witnesses have come forward, Mr Birch, a milkman, claims to have encountered a suspicious man, another man Mr Ede claims he saw a suspicious man with a knife in the street, a Mrs Colwell says she heard someone screaming murder, and a Mrs Lilly who lives in Buck’s Row claims she may have heard the murder occur. Interview who you think best, learn what you can, and I will return tomorrow morning to compare notes on this investigation.\"\n\n\nYou nod, wondering who would be best to talk to or whether you should play it safe and talk to everyone. Past experience has taught you that not everyone will have equally useful testimony and it is up to you to determine what is important information and what is not.\n\n\n ", "action_results": [{"action": "Talk to Mary Ann Nichol's father Mr Walker", "result": "Traveling to Camberwell you go to the home of Mr Walker who turns out to be a big man with a gray beard.\n\n\n\n\n“Well I haven’t seen Polly for about three years but I recognized her in the mortuary when I heard the news,” he says gruffly. “She was a drunk who I knew would come to a bad end. I turned her out of my house five years ago because of her drinking. She had no need to be like that when I had a home for her. I got a letter from her about four months back saying she had found work as a maid but I heard she got fired soon after for stealing… I was surprised when the police told me she had been murdered like that though. She had no enemies in the world: she was too kind for that.”\n\n\n\n\nThanking Mr Walker for his time you head on.\n\n\n ", "action_results": [{"action": "Talk to Mary Ann Nichols's ex-husband Mr Nichols", "result": "You go and find Mr Nichols in his home on Old Kent Road, who turns out to be a somewhat bitter middle-aged machinist.\n\n“We have been apart eight years and I haven’t seen Polly for three,” he tells you tersely. “She left me for a man called Drew who soon threw her over for another woman. She left me with five children to raise on my own and no help to give. If it hadn’t been for her drinking we would have gotten along just fine.”\n\n\nHis story of moral outrage is slightly ruined by the sight of a scantly-clad woman passing through the room behind him, counting coins in her hand. You head on quickly.\n\n\n ", "action_results": [null, {"action": "Talk to Mary Ann Nichols's friend Mrs Holland", "result": "You meet Mrs Holland in Lambeth Workhouse; she is a big, tough-looking woman who insists that you call her Nelly.\n\n\n\n\n“I’ve known Polly for years,” she tells you. “She’s been in and out of workhouses the whole time when she wasn’t sleeping rough but she was a quiet woman who never argued with nobody. We were lodging together for a bit but on the night she was killed she couldn’t afford the room. She told me ‘Never mind Nelly, I’ll soon get money. See what a pretty bonnet I’ve got now.’ I remember that because she had no money and the bonnet was new so I was puzzled where she'd got it from.”\n\nNelly frowns briefly before going on.\n\n\n“I saw her about an hour before her body was found. She was very drunk and slumped against a wall, she told me she’d been drinking all day. She looked unusually worried. ‘I’ve had money three times today and spent it all on drink,’ she told me, ‘ but it won’t be long before I’m back’. She go up and staggered off down Whitechapel Road and that was the last I saw of her before I heard a woman had been killed, went to the morgue and saw Polly lying there…”\n\n\n\n\nNelly falls silent and thanking her you turn away, your mind whirring. You remember Mary Ann Nichol's bonnet quite clearly, it was lying next to her body when you found her. It was a black hat with a velvet band, quite expensive and smart compared to the rest of her clothes Nichols’s. If she didn’t have enough money for a room (which in the Workhouse is far cheaper than a bonnet) how did she buy a new hat? Frowning you consider where to go next.\n\n\n ", "action_results": [null, null, {"action": "Talk to Witness Mr Birch who saw a suspicious man", "result": "You make your way to Commercial Road where you find Mr Birch, an excited, young milkman with a story to tell.\n\n\n\n\n“Well it goes like this sir,\" he says eagerly. \"This morning I was at my milk stand when a man in smart clothes with a black bag hurried up, asked for a glass of milk and drank it down in one. He asked if could step into the yard behind me and when I let him he pulled trousers and a jacket out of his bag and pulled them on over his existing clothes. Seeing me watching him he said ‘that was a terrible murder last night wasn’t it’ before adding ‘I think I’ve got a clue’. He snatched up his bag and ran off.”\n\n\n\n\nBirch smiles happily at your bemused expression before plunging on.\n\n\n\n\n“At first I thought he might be a detective or something putting on a disguise but I spoke to my mates and they reckoned detectives don’t behave like that so I thought I'd better tell the coppers. The first set of clothes wore was a blue suit, a hat and a watch chain. The overalls were like engineer overalls or perhaps something a sailor might wear. He had no beard but he had a black mustache and a sunburnt face. Do you think he might have anything to do with that woman killed down Whitechapel way last night?\"\n\n\n\n\nWithholding your opinion and thanking Mr Birch for his strange story you consider your next step.", "action_results": [null, null, null, {"action": "Talk to Witness Mr Ede who also saw a suspicious man", "result": "Visiting Mr Ede at his place of work at the East London Railway you find him hammering a new track down with a few work-mates. Identifying yourself as a private detective you ask for his story.\n\n\n\n\n“I was walking down the road when I saw a suspicious man standing outside the Forester’s Arms Pub,” he tells you. “He had a wooden arm which was hanging at his side. He moved his other arm and I saw about four inches of a knife sticking out of his pocket. He walked off when he saw that I'd seen him, he was about thirty-five years old with a dark mustache, brown jacket, dark trousers and he had a wild look in his eyes.\"\n\n\n\n\n“I told you Tom that was just Henry James,” one of his companions says with a laugh. “He’s a local idiot but harmless and he don’t have no wooden arm! He always looks that crazy but he’s got the mind of a child. A stupid one.”\n\n\nThomas Ede just shakes his head stubbornly and insists it wasn't an idiot he saw.\n\n\n ", "action_results": [null, null, null, null, {"action": "Talk to Witness Mrs Colwell who may have heard the murder", "result": "Going to Brady Street you knock on the door of Mrs Colwell’s house, which stands a short way from Buck’s Row. Mrs Colwell is an excited young lady who launches into her story as soon as you identify yourself.\n\n\n\n\n“On the night of the murder around Midnight I heard a woman running down the street outside shouting ‘murder, murder, police,’” she tells you breathlessly. \"Soon after I heard someone trying to get into this house and then the sounds faded away as the woman ran towards Bucks Row. It might have been that poor young woman, to think if I had only opened the door to my house she might have lived!”\n\n\nWith a sigh you thank her and head on.\n\n\n ", "action_results": [null, null, null, null, null, {"action": "Talk to Witness Mrs Lilly who also may have heard the murder", "result": "You go to visit the home of Mrs Lilly on Buck’s Row, she lives just a few doors down the alley from where you found Mary Ann Nichols’s body. When she opens the door you find she is a scared-looking lady.\n\n“I didn’t sleep very well on the night of the murder and in the middle of the night I heard a strange sound,\" she tells you looking pale. \"It was a painful moan, two or three gasps and then silence. I’ve heard fights before but they were nothing like that, I am sure it was the murder. Soon after I heard whispering in the alleyway, I couldn’t hear what was being said because it was too faint. I think I fell asleep soon after but I woke early, went out and heard about the murder. I thought I'd better tell someone what I heard...”\n\n\nShe trails off into silence. Thanking her for her time you thoughtfully leave.", "action_results": [null, null, null, null, null, null, {"action": "Wrap up the investigation", "result": "You return home and ponder all that you have found out. The next morning Inspector Abberline comes calling and asks if you have uncovered any important evidence. Thinking carefully about the different testimony what do you think is the most important thing to tell him about?", "action_results": [{"action": "Mrs Holland's testimony about Mary Nichols's new bonnet", "result": "Inspector Abberline listens carefully and when you have finished he looks impressed.\n\n\n\n\n“Do you think that the murderer gave Mrs Nichols’s this new bonnet as a gift to earn her trust?” he asks you. “The deceased lady’s clothes were removed prior to her autopsy. I will go to Dr Lewyllen’s house and see what became of them.”\n\n\n\n\nAbberline leaves and returns a short time later.\n\n\n\n\n“The clothes have been thrown away and burnt,” he says unhappily. “Still I believe the new bonnet may be a significant clue. Good work!”\n\n\nYour Reputation with the police has increased by 1.\n\n\n\n\n ", "action_results": [{"action": "Less than a week later he strikes again.", "result": "Early one morning you are woken from your sleep by a loud knocking on your front door.\n\n“Another woman has been killed sir,” a voice calls out and looking out of your window you see a policeman standing in the street. “Inspector Chandler says your to come to 29 Hanbury Street as quickly as you can please.”\n\n\n\n\nSpringing from your bed you pull on your clothes and race downstairs to find the policeman has already gone. You race to Hanbury Street to find a large crowd has already gathered outside one of the houses. Pushing your way through the crowd you spot Inspector Joseph Chandler, another veteran you have met before, who recognizes you and calls for his officers to let you through.\n\n\n“It looks similar to the Buck’s Row murder,” he tells you leading you across the hallway of the house from the front door to the back door. “I’ve sent for Dr Phillips and questioned the people who live here. None of them heard a thing and one of them found the body at 6am this morning when he came downstairs and saw the front door was open. One of the residents went through the backyard a little before 5am and saw no sign of anything then so the murder must have happened between 5 and 6. I must warn you sir: it‘s not a pretty sight.”\n\n\n\n\nYou stop at the back door at the sight of a woman’s body lying just below three stone steps that lead from the house to the yard. She is a wide but thin woman with brown hair and is lying alongside a wooden fence. Her legs are drawn up and her skirts pulled up, her left arm resting across her upper chest. Her throat has been cut and blood has pooled not only around her head but sprayed across the fence alongside as well. A nest of fat purple worms lies next to the woman’s left shoulder it takes you a moment to realize they are her intestines. The woman’s lower chest has been completely torn apart and many of the organs removed.\n\n\n\n\nYou turn away and swallow an urge to be sick. You hear footsteps behind you and turning around you see a middle-aged man in civilian clothes hurrying up followed by two policemen carrying a stretcher: Dr Phillips has arrived. He makes a quick examination of the body and makes the fairly obvious deduction that the woman is dead. He orders her taken to a nearby mortuary for an autopsy. As she is carried away you consider whether to search the crime scene or go and view the autopsy.", "action_results": [{"action": "Search the crime scene", "result": "You walk through the little yard, carefully avoiding the large puddle of blood at the foot of the steps. Using a tape measure you find that the blood sprays on the fence go as high as fourteen inches. Half-hidden in some weeds near the fence you make a very interesting discovery. Two small objects are glinting near the pool of blood. Stooping you pick them up and turn them over in your hand. They are two farthings, perhaps the price a cheap prostitute might accept for her services. You wonder if you are holding the payment passed by the killer to his victims… sensing this is an important discovery you pocket the coins.\n\n ", "action_results": [{"action": "Rising to your feet you head over to the mortuary", "result": "At the mortuary Dr Phillips wastes no time in instructing his assistants to remove the dead woman’s clothes in preparation for his autopsy. The workmen are visibly disgusted: the blouse and upper clothes of the body are saturated and literally dripping with blood and removing them reveals horrific injuries on the dead lady that extend well down to the groin area. Despite your disgust you can stay and assist Dr Phillips with the autopsy or examine the dead women’s clothes and possessions in a nearby room.\n\n\n ", "action_results": [{"action": "Stay and help with the autopsy", "result": "You remain at Dr Phillips’s side as he examines the body, muttering to himself all the while.\n\n\n\n\n“Old bruises on the face, tongue swollen and protruding slightly… neck severed by a knife at least six inches in length and probably longer… body eviscerated with intestines, uterus and bladder removed. Hm, I think whoever did this had some medical training or knowledge at any rate. I could not have made these operations in less than a quarter of an hour and if I was doing a deliberate surgical operation it would have taken at least an hour… ah this is interesting.”\n\n\n\n\nFighting your disgust you force yourself to pay attention.\n\n\n\n\n“There used to be rings here,” Dr Phillips tells you holding up the dead woman’s right hand. Sure enough there are three white bands clearly marked on the lower portion of the middle finger. “This woman has worn rings here but they have recently been removed. Unless she removed them herself, which seems unlikely, they must have been taken from her by the killer.”\n\n\nWith a jolt you realize this could be a very important clue: if you can find the rings perhaps you can find her killer too.\n\n\n ", "action_results": [{"action": "With nothing more to learn here you go to look at the dead woman's things", "result": "The woman’s blood-soaked clothes are piled into a heap. Picking through them you find nothing interesting and go through her possessions. In the dead woman’s pockets were found two combs, a scrap of cloth and interestingly a small scrap of envelope wrapped around two small pills. On the envelope are written the words “London, 28, Aug, 1888...M…2...S.” Above these words is an engraved stamp of an emblem of some kind. As you are turning the scrap of paper over in your hand Inspector Chandler enters the room. You show him your discovery and he becomes very excited.\n\n\n\n\n“That’s the seal of the Royal Sussex Regiment,” he tells you. “This could be an important clue! We’ll take it from here, good work! Go home and have a rest and I’m sure someone from Force will be in touch with you very soon.”\n\n\n\n\nYou step out into the mortuary room as Dr Phillips is finishing his autopsy. The dead woman lies still, eyes closed and head turned to the side as if asleep. You get one last glimpse of her before Dr Phillips throws a blanket over her, hiding her from your sight.\n\n ", "action_results": [{"action": "Feeling tired but determined to catch this killer you return home", "result": "“We have a serial killer out there.”\n\n\n\n\nInspector Abberline looks deadly serious when he calls on you the next day.\n\n\n\n\n“This killing and the murder of Mary Ann Nichols are too similar to be the work of different men,\" he insists. We have identified the deceased woman as a local prostitute called Annie Chapman. The scrap of letter you found is a dead lead, it seems Chapman picked up the scrap herself from her lodging house and the pills inside are medication for a terminal lung disease she had. We’ve got to get moving on this,  all over Whitechapel fear is spreading and private citizens have started forming vigilante societies, giving us their theories and offer rewards for the capture of this monster dead or alive.”\n\n\n\n\nAbberline produces his notebook and clears his throat.\n\n\n\n\n“We have traced Mrs Chapman’s brother Mr Smith to an address in Knightsbridge. A man called Mr Donovan ran the lodging house in Spitalfields where Mrs Chapman was living at the time of her death. A resident of the same house, Mrs Palmer, has identified herself to us as Mrs Chapman’s friend. A Mr Cadosch, who owns the house adjacent to where Mrs Chapman was murdered claims he may have heard the murder. A Mrs Chappell has reported seeing a suspicious man in a pub to us. Finally a Mrs Long claims to have witnessed the deceased talking to an unknown man shortly before her death. You know the drill: I want you to investigate any of these leads which seem promising to you and report back to me tomorrow.\"\n\n\n\n\nInspector Abberline closes his notebook and turns to go before hesitating.\n\n\n\n\n“I should tell you that Sir Charles Warren, the Head of the London Police Force, spoke with me this morning stressing how important it is that we find and arrest this killer. I will be conducting my own investigations alongside yours and I will share information equal in value to that which you share with me. Hopefully if we both do good work we can solve these terrible murders quickly and capture this brutal, but so far frighteningly successful, murderer.”\n\n\n\n\nAs the Inspector leaves you consider who to interview first.", "action_results": [{"action": "Talk to Annie Chapman's brother Mr Smith", "result": "You travel to Knightsbridge and meet Mr Smith, a youngish well-dressed man who looks on the verge of tears throughout your interview.\n\n“She was such a lovely person, I can't understand why anyone would do this,\" he says sadly. \"It all went downhill after she split up with her husband, they both used to get drunk and fight. He died a few years back and she never got over that, she never had any money afterwards neither. I saw her a few weeks ago and gave a little money. Did you know she has three children? Our mother takes care of them now. We hoped one day she’d find a steady job and come back to us but… now...”\n\nMr Smith's voice breaks so thanking him for his time you leave.", "action_results": [{"action": "Talk to Annie Chapman's landlord Mr Donovan", "result": "You head out to Annie Chapman’s lodging house in Spitalfields and going you find Mr Donovan, a young man with a serious air.\n\n\n\n\n“Annie was normally a lovely, good-natured lady but she got a black eye in a fight a little while back,” he tells you. “On the night of she died she came up to my office around 1.30am and said ‘I haven’t the money for my bed but don’t let it: it won’t be long before I’m in.’ I could see her swaying a bit and told her off for finding money to get drunk but not for a bed. ‘Never mind Tim’ she said, ‘I’ll soon be back. Keep that bed for me.’” She headed out soon after, before she left I saw her put some of her tablets in a scrap of paper which she put in her pocket. She took the medicine for a bad lung condition she had but she never complained about it.”\n\n\n\n\nThanking Mr Donovan for his time you head on.", "action_results": [null, {"action": "Talk to Annie Chapman's friend Mrs Palmer", "result": "You find Mrs Palmer in Spitalfields, a middle-aged woman with a prematurely lined face.\n\n\n\n\n“I knew poor Annie well,\" she tells you. \"She had a bad fight with another woman over a man a little while back and got some bruises from it. She was terribly ill in the days before she died and the evening before her death she could hardly move for the pain. ‘It’s no use my giving up Amelia,’ she said to me. ‘I must pull myself together, go out and get some money or I shall have no lodgings.’ She went out for a coin or two but she never came back... I’ve lived here all my life and seen what can happen to the women round here but I’ve never seen anyone hurt so badly until I saw Annie lying in that morgue… whatever did that to her wasn‘t human.”\n\n\n\n\nThanking the old woman for her time you head on.\n\n\n ", "action_results": [null, null, {"action": "Talk to Witness Mr Cadosch who may have heard the murder", "result": "Traveling to 29 Hanbury Street you meet Mr Cadosch, a middle-aged Frenchman. He lives next door to the house behind which Annie Chapman was killed and he wastes no time in leading you into the backyard of his house. A wooden fence separates the yards of 27 and 29 from each other, it was on the other side of that fence that Annie Chapman's body was found. Mr Cadosch stands next to the fence as he tells you his story.\n\n\n\n\n“I got up for work at 5am and about fifteen or twenty minutes later I went into the yard to use the outside toilet,” he says indicating a little shed at the far end of his yard. “As I walked back through the yard I heard a woman quietly say ‘no’ and then soon afterwards something fell or leant against the fence. I guessed it was trouble but I didn’t want to be caught up in anything and I had to go to work so I went back into the house and headed out.”\n\n\n\n\nYou look at him startled, this man might have passed just feet away from the murder as it was happening. The fence is only six feet high, if he had just peered over it he would have seen the killer. On reflection you realize perhaps if he had though the amiable man standing before you might not be alive now. Thanking him for his time you move on.\n\n ", "action_results": [null, null, null, {"action": "Talk to Witness Mrs Chappell who saw a suspicious man", "result": "You meet Mrs Chappell at the Prince Albert Pub, she is an excited, young, barmaid with a story to tell.\n\n\n\n\n“In the morning an hour or two after that poor woman was murdered I was standing in this bar talking to my friend when a man came in,” she tells you. “He wore a dark coat and had a hat pulled low over his eyes. He asked for a pint of ale from me and took it into a corner to drink. I saw spots of blood on the back of his right hand. He drank the beer in one gulp and left quickly. I didn’t like the look of him so I went to the door and saw him walking away to Bishopsgate.”\n\n\n\n\nYou thank Mrs Chappell for her information and move on.", "action_results": [null, null, null, null, {"action": "Talk to Witness Mrs Long who have have seen the killer and victim together", "result": "You go to see Mrs Long in Spitalfields, she is an old and serious woman.\n\n\n\n\n“I was walking to the Market at 5.30am on the morning of the murder when I saw a man and a woman talking in front of 29 Hanbury Street where this dreadful murder occurred,” she tells you. “The woman had her back to me but I saw the man quite clearly, he wore a dark coat, a brown hat and looked about forty. I think he was a foreigner. I heard him ask the woman ‘Will you’ and she said ‘yes’ as I walked by. I often see people standing in that street talking but when I heard about the murder I thought I'd better tell somebody what I saw.”\n\n\n\n\nFrowning you consider the value of her information as you bid her farewell.\n\n\n ", "action_results": [null, null, null, null, null, {"action": "Wrap up your investigation", "result": "You return to your apartment that evening and the next morning Inspector Abberline drops by.\n\n“There have been some important developments in this case and I can’t stay long,” he tells you. “Is there any aspect about Mrs Chapman's that particularly strikes you?”\n\nWhat evidence that you may have uncovered do you think is the most important?\n\n\n ", "action_results": [{"action": "The two farthings", "result": "Quickly you tell Inspector Abberline about the two farthings you found near Annie Chapman’s body.\n\n“That’s interesting,” Abberline agrees when you have finished. “Do you think the killer used them to pay for Mrs Chapman’s services before killing her? It's possible I suppose, very well: I shall share a clue with you. I have heard that an American Doctor has been asking around the medical colleges to see if he can obtain a woman's uterus for his studies. He has been refused quite naturally but I have been informed by Dr Phillips that Mrs Chapman’s uterus was one of the organs the killer took from her body. Is this a coincidence? I don’t know yet but I think we had better keep an eye out for this American doctor.”\n\nYou nod your head and as you do you hear a voice calling Abberline’s name from the street. Looking down you can see an excited Policeman standing there.\n\n“Inspector!” he calls up. “They have arrested the Ripper!”\n\n ", "action_results": [{"action": "You and Abberline set off at once for the nearest police station", "result": "Hurrying to Leman Street Police Station you find the suspect that the police have arrested, one John Pizer. He is short, thick-set and ugly with a face covered in black hair and an undeniably unpleasant look about him. A Police Sergeant shows you a large knife he found on the man when he was arrested.\n\n“This is him sir, old Leather Apron as he's known around these parts,” the Sergeant says. “He is notorious for beating up prostitute in the area after he has had his way with them.”\n\nInspector Abberline grants you permission to conduct a quick interview.\n\nWhat do you ask Pizer?", "action_results": [{"action": "\"Is it true you have a history of hitting prostitutes?\"", "result": "“Of course I don't beat up prostitutes,” Pizer protests. “Those are lies spread about me because I’m a Polish Jew. Sure, I’ve slapped a couple of girls around every now and then, if they are going to sell themselves I want to get what I pay for or I want my money back. But I’ve never met this Chapman woman.”\n\nYou look at him with disgust.", "action_results": [{"action": "Ask him where he was on the night of Annie Chapman's death", "result": "“I was a lot of places the night that woman was cut up,” Pizer tells you. “After midnight I went to go see a big fire at London Docks and spoke to a policeman I know there. I walked back to my home on Holloway Road, had a smoke with my brother until 3am and then slept in until 11am when I got up and ate lunch with the other people I live with. You can check with all of them, I didn’t even learn about the murder until I read about it in the papers.”", "action_results": [null, {"action": "Ask him why he is called Leather Apron", "result": "Pizer grins. “I polish boots for a living and I wear a leather apron so my day clothes don’t get dirty. Sometimes I cut the leather off boots or cut laces to trim them to size which is why I always carry a knife.”\n\nHe begins talking enthusiastically about shoe-fitting until you stop him.\n\n\n ", "action_results": [null, null, {"action": "End the interview", "result": "You stop the interview and leave Pizer’s cell to talk to Abberline.\n\n“Well,” the Inspector asks. “Is he our man?”\n\n\n ", "action_results": [{"action": "\"Yes\"", "result": "You declare that  John Pizer a.k.a. Leather Apron is Annie Chapman’s murderer and he is held in prison.\n\n\nYou are publicly humiliated when his brother and several others including a policeman arrive within hours to confirm his alibis that he was at home in bed at the time of her murder. This has cost you a great deal of respect among the police.\n\n\n ", "action_results": [{"action": "That could have gone better...", "result": "A few weeks after Annie Chapman’s murder Inspector Abberline drops by your home. Neither of your investigations are going anywhere and Abberline looks tired.\n\n\n\n\n“On top of everything else we have started receiving these strange letters,” he tells you. “Listen to this one we got the other day: ‘Dear Boss. So now they say I am a Yid, when will they learn Dear Old Boss! You and me know the truth don’t we? You can look forever, you'll never find me but I am right under your nose all the time. I watch them looking for me and it gives me fits ha ha. I love my work and I shan’t stop until I get buckled and even then watch out for your old pal Jacky. Catch me if you can. Jack the Ripper. Sorry about the blood, still messy from the last one. What a pretty necklace I gave her!”\n\n\n\n\nAbberlne shakes his head, lays that letter down, picks up a second one and reads it.\n\n\n\n\n“Dear Boss, I keep on hearing the police have caught me but they won’t fix me just yet. I have laughed when they look so clever and talk about being on the right track. That joke about Leather Apron gave me real fits. I am down on whores and I shan’t quit ripping them till I do get buckled. Grand work the last job was. I gave the lady no time to squeal. How can they catch me now? I love my work and want to start again. You will soon hear of me with my funny little games. I saved some of the proper red stuff in a ginger beer bottle over the last job to write with but it went thick like glue and I can’t use it. Red ink is fit enough I hope ha ha. The next job I do I shall clip the lady’s ears off and send to the police officers just for a jolly. Wouldn’t you keep this letter back till I do a bit more work, then give it out straight. My knife’s so nice and sharp I want to get to work right away if I get a chance. Good luck. Yours truly Jack the Ripper, don’t mind me giving the trade name. PS wasn’t good enough to post this before I got all the red ink off my hands curse it. No luck yet. They say I’m a doctor now. Ha ha.”\n\n\n\n\nAbberline looks up wearily.\n\n\n“We’re getting dozens of these every week, most of them signed ‘Jack the Ripper’. Some we’ve tracked down to crazy people or journalists trying to start a story but more keep coming. Just yesterday we had a fellow named Fitzgerald told all his friends he had killed Mrs Chapman. We arrested and held him for three days until several of his friends and family confirmed he’d been in his home in Hammersmith at the time of the murder. This Ripper killer is causing panic and I’ve got a feeling more trouble is on the way.”\n\n ", "action_results": [{"action": "Abberline is right and you are in for another night of hell", "result": "“The Ripper has killed again!”\n\n\n\n\nThe familiar cry launches you from your sleep. Pulling on your clothes you rush downstairs to find a pale young Policeman standing outside. He looks plain terrified.\n\n\n\n\n“This one's in Dutfield’s Yard on Fairclough Street sir,” he tells you. “She’s not been cut up as badly as the other ones.\"\n\n\n\n\nYou both hurry there as fast as you can but it is still nearly 1.30am by the time you arrive. Several Policemen and the police surgeon Dr Phillips are already at the scene while a cabman stands nearby wringing his hands together. A woman is lying just inside the open gateway that leads into the yard, her feet pointing out towards the street. She is a tall woman with brown curly hair and is wearing black clothes. Her eyes are closed and she looks as though she is sleeping except for a savage slash across her throat and a pool of blood under her head.\n\n\n\n\nInstantly your sharp eyes spot several interesting things on and around the body. Pinned to the dead woman’s jacket is a fresh red and white flower. In her left hand is a packet of Cachous (a type of breath mint), which she is clenching in a tight death grip. Apart from the slash to her throat she has no other injuries which is unusual to say the least. You listen as the cabman nervously describes his discovery of the body to the police.\n\n\n\n\n“I was driving my cart into the yard at about 1am to put it away from the night when my pony suddenly gave a yelp and refused to go forward, pawing the ground in terror and becoming mighty agitated. I peered forward and saw this woman lying there in the darkness. I thought she was drunk or asleep so I immediately backed my cart out of the yard and ran to the nearby Working Men’s Club to get some help. When I came back I found she was dead.”\n\n\n\n\n“Do you think your arrival interrupted the killer before he could mutilate the victim?” you ask him.\n\n\n\n\nThe driver hesitates before nodding. \"To tell you the truth sir I think he might still have been hiding in the yard when I arrived. My pony was mighty agitated, kept looking into the yard and trying to back up. He might have slipped away when I ran off to get some help but I didn't know then that she was dead, I swear I didn't.\"\n\n\n\n\nYou are still digesting this information when another Policeman runs up.\n\n\n\n\n“They’ve found another body over in Mitre Square sir. This lady… begging your pardon sir but it’s fucking terrible there.”\n\n\n\n\nInstantly several of the policemen hurry off towards the Square while Dr Phillips and the remaining policemen gently lift the dead woman’s body onto a stretcher to take it to the mortuary.\n\n\n ", "action_results": [{"action": "Stay and search this crime scene", "result": "You remain behind briefly and explore the small yard for clues. Entering the darkened space you know you must be standing pretty much where the killer stood less than an hour ago but he is gone now leaving no trace behind except the pool of blood on the ground. With a brief sigh at the killer's terrifying effectiveness you hurry off to the next crime scene. \n\n\n ", "action_results": [{"action": "Mitre Square", "result": "The policeman was not exaggerating.\n\n\nWhen you arrive at the square you see a little woman with brown hair lying on her back in one of the square's corners. A savage slash through her neck bubbles with blood and her mouth is open in a silent scream of agony. A purple and blue mound of fat worms that is her intestines have been extracted from the carnage of her stomach and thrown across her shoulder. Her face has been slashed so savagely that parts of her right ear and nose have been cut off.\n\n\n\n\nWith a jolt you remember the words in the last letter Inspector Abberline read to you, purportedly from Jack the Ripper “the next job I do I shall clip the lady’s ears off and send to the police officers just for a jolly.” Feeling sick you sit down on the pavement and take several deep breaths. As you do a local Doctor arrives on the scene joining the crowd of policemen already there. The Policeman who discovered the body is sitting on a step nearby looking just as sick as you.\n\n\n\n\nYou barely hear what people are saying as they crowd around the body and try to put it back together so they can load it onto a stretcher. The Ripper is now killing women as such a fast rate it seems impossible that he can be stopped but you know you have to keep trying. The possibility that the Ripper killed another woman after his mutilation of the first was interrupted just to obtain her ear and organs sickens you. You barely hear as a Policeman asks you if you want to help search the scene.\n\n\n ", "action_results": [{"action": "Join the search of the area", "result": "Mentally fortifying yourself you join the search of the area. You have found nothing for about an hour until suddenly a Policeman shouts out that he has found something as you are searching about several streets from Mitre Square. He holds up a scrap of dirty white apron that is covered in blood stains. The apron has been found beneath some chalk graffiti on a wall that reads “the Jewes are the men that will not be blamed for nothing”. You stare from the blood-soaked apron to the graffiti.\n\n\n\n\nAt a guess it instinctively occurs to you that the killer may have carried the dead woman’s missing organs away in the apron before discarding it beneath the graffiti. Is the graffiti a red-herring or a clue or is it coincidence that the killer dropped the apron there? You stare at the writing on the wall wondering if it can be matched to the writing in any of the letters the police have received. You will never find out: senior police officers fearing the graffiti might inspire hostility against the Jewish community in London order the chalk washed away hours later.\n\n ", "action_results": [{"action": "With much to think about you head home", "result": "You go home and have a strong drink to recover. Inspector Abberline arrives at your house just hours later as the morning sunlight is creeping over London.\n\n\n\n\n“We need to move fast if we are to find evidence that will lead us to this bastard,” he tells you, looking more angry and determined than you have seen him yet. “We have identified the dead woman in Dutfield’s Yard as Elizabeth Stride and the woman in Mitre Square as Catherine Eddowes, both prostitutes working in the Whitechapel district. I want you to investigate Mrs Stride’s murder while I will handle the investigation into Mrs Eddowes's killing. Dr Phillips has conducted an autopsy and also listed Mrs Stride’s possessions and can supply you this information if you visit him. We have also traced Mrs Stride’s partner Mr Kidney to an address on Commercial Road.”\n\nAbberline opens his ever-present notebook.\n\n\n“We have been overrun with eyewitnesses. A Mr Gardner, Mr Marshall, Mr Packer, one of our own Policemen Constable Smith and Mr Schwartz all claim to have seen Mrs Stride with a suspicious man on the night of her death and Mr Coram has found a bloodied knife in the street that may be relevant. I would like you to chase these leads up and see which are credible. Depending on your findings I may have some useful information to share with you.”\n\n\n\n\nFeeling slightly overwhelmed you prepare yourself for your latest investigation.", "action_results": [{"action": "Talk to Dr Phillips to learn about Elizabeth Stride's autopsy and view her possessions", "result": "Going to Dr Phillip’s mortuary he presents you with a very brief autopsy report: Elizabeth Stride was killed when her throat was cut and no other wounds were inflicted. You go through her possessions, in her pockets were found a key, a pencil, several buttons, two combs, a spoon, a hook, a strip of cloth, a thimble, a reel of thread, some handkerchiefs and a few scraps of paper. Her clothes are likewise unremarkable, shabby and blood-stained. Two interesting objects were found on her however, the packet of Cachous and the flower pinned to her dress.\n\n\n\n\n“She never had time to swallow one as none were found her mouth,” Dr Phillips says indicating the breath mints. “The flower is interesting, her friends say she was not wearing it at the time she left her lodging house about five hours before her murder. At some point in the intervening time she must have brought it or had it brought for her as a gift from someone.” You examine the flower closely, it is a beautiful and fresh red and white fern.\n\n\n\n\nLaying it down you thank Dr Phillips for his help and move on.\n\n\n ", "action_results": [{"action": "Talk to Elizabeth Stride's partner Mr Kidney", "result": "You go to Mr Kidney’s house on Commercial Road to find him a drunk and emotional man.\n\n“I’ve known Liz for years,\" he declares. \"She came here from Sweden twenty years back, she told me her husband and children drowned when the Princess Alice sank ten years ago. We’ve stuck together through the highs and lows, been arrested a few times for being but who hasn’t round here? We had our fighs sometimes and split up, it was always the drink that made her go away but she always came back. She said she liked me more than any other man.”\n\n\n\n\nHe pauses to take an impressively big gulp from a bottle of gin at his side and blinks at you.\n\n\n\n\n“We spoke about this Ripper you know? She told me ‘Me and my friends, we’re all up to no good, no one cares what becomes of us. Perhaps some of us will be killed next.’ If you gave me a dozen coppers I would find this murderous fuck. I’d get him right in the act and see him hung like a dog from a noose in Tyburn for what he did to Liz… she never did any harm to anyone and helped many who didn't deserve such kindness. She was a good girl.”\n\n\n\n\nThanking Mr Kidney for his time you leave.\n\n\n ", "action_results": [null, {"action": "Talk to Witness Mr Gardner who saw the victim with a suspicious man", "result": "Going to Chapman Street you meet Mr Gardner, a burly dockside laborer.\n\n\n\n\n“I saw this woman Liz Stride who I knew near the door of the Bricklayer’s Arms Pub when me and my mate went in for a drink around 11pm,\" he tells you. \"She was hugging and kissing a man and me and my pal were surprised by how much they were getting into it. The man wore a suit and coat, he was a short man with a dark mustache and hair. I’d already had a few drinks and thought this was pretty funny so I called out to her “that’s Leather Apron getting on your good side Liz.” They left soon after.\"\n\n\nYou thank Mr Gardner for his information.\n\n\n ", "action_results": [null, null, {"action": "Talk to Witness Mr Marshall who saw the victim with a suspicious man", "result": "You go to Berner Street where you meet Mr Marshall, a middle-aged labourer.\n\n“I was heading home just before midnight when I saw this woman Elizabeth Stride standing with a man in a doorway just down from my house,\" he tells you. \"The man wore a suit and was on the stout side, he also had on a small peaked cap like a sailor might wear but his suit looked more like a clerk. I recognized the woman the photo in the papers only when I saw her she didn’t have no flower pinned to her jacket. The couple were kissing and as I walked by the man said to her ‘you would say anything but your prayers’, I didn’t linger to spy on their love-making but went right into my house and off to bed.”\n\nThis might be linked to other testimony you have heard.\n\n\n ", "action_results": [null, null, null, {"action": "Talk to Witness Mr Packer who saw the victim with a suspicious man", "result": "You go to see Mr Packer, an elderlr man who runs a fruit shop on Berner Street close to where the body was found.\n\n\n\n\n“I saw this Catherine Eddowes… no Elizabeth Stride woman at 11pm… or was it midnight?\" he says in a confused, halting sort of way. \"She came by with a young man with a black coat, a hat and a rough voice. She was playing with a sort of red and white flower and after he brought them both grapes they moved off. This happened last night… or was it the night before? Anyway I saw the man again in the street this morning, he stared at me for a while before running away when I challenged him.”\n\n\n\n\nUnsure what to make of this old man’s confused statements you thank him and move on.\n\n\n ", "action_results": [null, null, null, null, {"action": "Talk to Witness PC Smith who saw the victim with a suspicious man", "result": "You go to talk to PC Smith an experienced officer with a professional manner.\n\n\n\n\n“I was walking down Berner Street just after 12.30am when I saw a man and a woman standing on the pavement opposite the entrance to Dutfield’s Yard where the dead woman’s body was later found,\" he tells you consulting his notebook. \"I am certain the woman I saw was Elizabeth Stride. Her companion was a young man in dark clothes in an hat, overall he looked respectable. He was carrying a parcel about twenty inches long and several inches wide. The woman had a red and white flower on her jacket. I didn’t hear them say anything as I walked by but they didn’t seem in any way drunk. When I walked back down the street thirty minutes later two police officers and a small crowd had already gathered outside the yard to view the body. I remember seeing you there sir but I don't know if you remember me.”\n\n\n\n\nYou don't but pretending you do you thank PC Smith for his interesting information.", "action_results": [null, null, null, null, null, {"action": "Talk to Witness Mr Schwartz who saw the victim with a suspicious man", "result": "Mr Schwartz is a nervous little man who hurries you into his home in Backchurch Lane when you visit him.\n\n\n\n\n“I was walking down Fairclough Street when I saw a stout man in a black coat and hat leading the dead woman down the road,\" he tells you looking frightened. \"She said ‘no not tonight, some other night’. They turned into Berner Street. By the time I arrived I saw them standing in the gateway where the murder happened. The man seized the woman and threw her down on the pavement and she gave some quiet cries of alarm. Across the street a second man was lighting his pipe.”\n\n\n\n\nSchwartz takes a deep breath and goes on.\n\n\n\n\n“This second man was middle-aged with dark hair and a brown mustache. He wore an overcoat and an old black hat. I didn't see the first man clearly. The man who threw drown the woman called out to the one with the pipe ‘Lipski’. I turned to walk away and the second man, the one with the pipe, began following me. I ran as fast as I could and the man stopped following me. About fifteen minutes later I heard the first cries of “murder” in the street and saw people running towards Berner Street.”\n\n\n\n\nYou frown at Schwartz unsure what to make of him and uncomfortably aware that he is suggesting that the Ripper does not work alone. Thanking him you move on.", "action_results": [null, null, null, null, null, null, {"action": "Talk to Witness Mr Coram who saw the victim with a suspicious man", "result": "Going to Plumber’s Row you meet Mr Coram, a warehouse packer.\n\n\n\n\n“Soon after the murder I was walking along Whitechapel Road in the morning when I saw a knife lying on the edge of the street,\" he tells you. \"It was about ten inches long, blood-stained and had a white blood-stained handkerchief tied around it’s handle. I gave the knife to a policeman who said he had passed the spot fifteen minutes before and that the knife had not been there then. He told me later that he took it to Dr Phillips who said it was probably not the weapon used to murder those women. I don’t know where the knife is now.”\n\n\n\n\nYou thank Mr Coram for his interesting information.\n\n\n ", "action_results": [null, null, null, null, null, null, null, {"action": "Wrap up this investigation", "result": "Feeling tired after hearing so much confusing testimony you go home and the next day Inspector Abberline calls on you. He looks tired too.\n\n\n\"We've now got at least a dozen witnesses including a pony who may have seen the killer and I'm not sure any of them are reliable,\" Abberline tells you, shaking his head. \"Apart from the bodies we've got precious little physical evidence and the public are not helping: everybody has a theory. I even had to deal with one woman who kept insisting that Elizabeth Stride was her sister until two of my officers found her sister living alive and well in a nearby street. Still, out of all the witness descriptions of the men with Elizabeth Stride on the night she was killed who sounds most likely to be the murderer?\"\n\n\n ", "action_results": [{"action": "You tell Abberline about the stout man in the suit who Stride was seen kissing", "result": "Abberline listens to your description and sighs.\n\n“A little man in a suit with a sailor’s hat with dark hair and mustache who was embracing and kissing Mrs Stride in front of a crowded pub and in a busy street? I think he sounds more like a boyfriend or client than a potential killer to me and besides he’d left the scene by midnight when the other men were seen with Stride.”\n\nYour poor detective work damages your Reputation.\n\n\n ", "action_results": [{"action": "Abberline tells you about his investigation of Catherine Eddowes's murder", "result": "“Now as you know I have been looking into Catherine Eddowes's killing and we have a pretty good idea of her movements on the night she died,” Abberline tells you. “It seems she spent most of the night in a jail cell for being drunk and disorderly but was released less than an hour before she was killed. Her belongings are with Dr Frederick Brown of the London Police and we have traced her partner John Kelly to a lodging house in Flower and Dean Street. Sergeant Byfield was the Desk Sergeant at Bishopsgate Police Station who discharged Mrs Eddowes while a Mr Lawende and some friends claim to have seen Mrs Eddowes talking to an unknown man near Mitre Square just ten minutes before her body was found.\"\n\n\n\n\nAbberline looks up from his notebook at you.\n\n\n\"I think you might find it useful to talk to some of these witnesses to see if you can uncover any facts I've missed. Specifically I want you to visit Dr Brown and take a look at Mrs Eddowes's belongings... I am forming a theory about the way our killer operates and I want to see if the evidence you find supports this theory or not. Hopefully we can start to get the upper hand over this brute if we can understand how he thinks and operates.\"\n\n \n\nAgreeing to help you set out once more.\n\n\n ", "action_results": [{"action": "Talk to Dr Brown so you can see Catherine Eddowes's possessions", "result": "Going over to Dr Brown’s mortuary in the City of London (the heart of the financial district) you go inside. You get a shock when you see Catherine Eddowes’s naked body hanging from a hook on the wall directly opposite the door, it's savaged face drooping lifelessly. A massive pile of clothes and possessions lie on the floor in front of her. Dr Brown gives you permission to look through them: among her belongings are two small bags, two smoking pipes, two boxes containing tea and sugar, a matchbox, fifteen rags, six chunks of soap, a comb, a small butter knife, a tea spoon, a very expensive-looking red leather cigarette case, a ball of string, a dirty apron with a piece cut out of it, several buttons, some receipts for selling a shirt and boots, a pair of glasses and a cheap red glove.\n\nYou look carefully through the items as some are more important than others.", "action_results": [{"action": "Talk to Catherine Eddowes's partner Mr Kelly", "result": "You meet Catherine Eddowes’s partner Mr Kelly at their home on Flower and Dean Street, he is a sickly-looking middle-aged man with a wracking cough who is so overwhelmed with sadness he can barely speak.\n\n\n\n\n“I took up with her several years ago after she split with her last partner,\" he says hoarsely. \"We took one of her two children in to live with us, the other stays with her mother. Catherine liked a drink but I swear to you she was no prostitute. We’ve been hard up lately and she had to sell one of my shirts and a pair of boots a little while back. I left her at 2pm on the afternoon before her death and heard that evening she’d been arrested for being drunk. I don’t know how she got the money to buy drink as she didn’t have any when we parted. That was the last I heard of her until I saw- I saw her in the morgue... and-”\n\n\n\n\nKelly breaks into sobs and buries his face in his hands. You quietly leave.", "action_results": [null, {"action": "Talk to Sergeant Byfield who was one of the last people to see the victim alive", "result": "You go to Bishopsgate Police Station where you find Sergeant Byfield, a sensible middle-aged police officer he gives you a straight-forward account.\n\n\n\n\n“Mrs Eddowes was brought in just before 9pm sir,\" he tells you. \"She was hardly able to stand and fell asleep as soon as we put her in one of the cells. Soon after midnight she woke up and started singing loudly before asking me to release her. She seemed steady enough so I let her out around 1am. She asked for the time and I told her it was too late for her to buy any more drink. ‘I’ll get a damn fine hiding when I get home,’ she told me. ‘It serves you right, you had no right to get so drunk,’ I told her. She said goodnight to me and went out the front door, shutting it behind her. Forty-five minutes later her body was found in Mitre Square.”\n\n\n\n\nYou thank Sergeant Byfield for his information.\n\n\n ", "action_results": [null, null, {"action": "Talk to Mr Lawende who saw the victim with a suspicious man", "result": "You go to Norfolk Road where you meet Mr Lawende, a surprisingly wealthy-looking gentleman in a suit who speaks English with a Polish accent.\n\n\n\n\n“Me and my friends came out of the Norfolk Club just after 1.30am,” he tells you. “Near the entrance to Mitre Square we saw this lady Mrs Eddowes talking to a man. I only got a brief glimpse of him as I walked by but I suppose he was around thirty with fair hair and mustache and a suit. He wore a red handkerchief across his neck which made me think of him as a sailor. The couple weren’t arguing in any way, just talking. I passed them by and didn’t think anything of it until I read about the murder the next day.”\n\n\n\n\nYou are impressed by Mr Lavender’s matter-of-fact description and thank him for his help.\n\n\n ", "action_results": [null, null, null, {"action": "Wrap up this investigation", "result": "Having finished your inquiry into Catherine Eddowes’s murder you return to your home where Inspector Abberline drops by in the evening. You ask him how his investigation is going.\n\n\n\n\n“Not well,” he admits. “We had three men in custody at the time of the double murder a few nights ago: a crazy butcher called Jacob Isenschmid, a lunatic who was screaming he hated all women when we arrested him called William Piggott and a German man who threatened his friend with a knife called Charles Ludwig were all under arrest under suspicion of being the Ripper but we had to release them after somebody else killed Stride and Eddowes. That is by the by though, more importantly did you find any interesting items in Mrs Eddowes’s things?”\n\n\nYou think back to the large collection of items taken off the dead woman to try and recall if any particularly stood out.\n\n\n ", "action_results": [{"action": "Talk to Abberline about the expensive red cigarette case", "result": "Abberline smiles and nods.\n\n\n\"Exactly,\" he declares. \"Mr Kelly told me he and Eddowes were so short on money they had to sell one of his old shirts and a pair of shoes. If Mrs Eddowes had no money how did she come into possession of an expensive cigarette case and find the money to get drunk the evening of her death? My theory is that the Ripper gave her this item and probably the money too. My theory is the Ripper meets his victims beforehand and gets to know them, build up a trust if you will before he kills them. Even now my guess is there are prostitutes out there who know his face, maybe even his name. These women are in great danger though, we must find him.”\n\n\nYour good work has improved your Reputation with the police.\n\n\n ", "action_results": [{"action": "Abberline produces another letter", "result": "“We have just received this postcard from the killer today,\" Abberline tells your and reads it:\n\n\n\"I was not kidding dear old Boss when I gave you the tip, you’ll hear about Saucy Jack’s work tomorrow, double event this time. Number one squealed a bit, couldn’t finish straight off. Ha, not the time to get ears for police. Thanks for keeping last letter back till I got to work again. Jack the Ripper.’\n\n\n\"I’m convinced it was written by the same man who wrote the earlier ‘dear boss’ letter promising to cut one of his victim’s ears off as he did with Mrs Eddowes,\" Abberline tells you.\" This killer is toying with us and the bugger's enjoying himself.”\n\n\n\n\nAbberline is interrupted by a Policeman bursting through the door into your study.\n\n\n\n\n“Sir they’ve found another body, this one right inside the grounds of Scotland Yard!”\n\n\n\n\n“But that’s the third in three days!” Abberline exclaims looking thunderstruck.\n\n\n\n\nYour legs suddenly feel weak and you sink into a chair.\n\n\n ", "action_results": [{"action": "The three of you rush to Scotland Yard", "result": "When you arrive at Scotland Yard you find yourself confronted by a real mystery: the decomposing torso of a woman has been found in one of the police headquarter's old vaults partly wrapped in paper. The limbs have been sawn off but otherwise all the organs remain inside. It is estimated by doctors the victim has been dead around two months and they do not think this is the work of the Ripper. Later the woman’s arms are fished out of the Thames and strangely enough police doctors suggest they thinks the victim died of natural causes but can't explain why she was disposed of in this terrible manner. Inspector Abberline decides it must be some medical students playing a horrible prank. \n\n\nIn the weeks following the double murder your investigation goes nowhere and still hundreds of letters, most allegedly written by the Ripper pour into Scotland Yard. Abberline sends you the most credible to read.\n\n\nOne addressed to an unknown source reads says \"You thought yourself very clever I reckon when you informed the police. But you made a mistake if you thought I didn’t see you. Now I know you know me and I see your little game and I mean to finish you and send your ears to your wife. If you show this to the police or help them… if you do I will finish you. It’s no use your trying to get out of my way because I have you when you don’t expect it and I keep my word as you soon see and rip you up. Yours truly Jack the Ripper PS you see I know your address.”\n\n\nThe most chilling letter is sent to George Lusk, a prominent London resident who has personally offered a large reward for the killer's capture.\n\n\nThe most chilling of all these letters is sent to George Lusk, a private citizen offering a generous reward for the capture of the Whitechapel killer. Accompanying the letter was half of a woman’s kidney, kidneys being one of the many organs removed from Catherine Eddowes. The letter reads: “From Hell. Mr Lusk, sir. I send you half the kidney I took from one woman and preserved it for you, the other piece I fried and ate. It was very nice. I may send you the bloody knife that took it out if you only wait a while longer. Catch me if you can Mister Lusk.”\n\n\nWhen Dr Openshaw, a Police Doctor, publishes his opinion that the kidney may have come from Catherine Eddowes he too received a letter from the Ripper. This one reads: “Old Boss you were right, it was the left kidney. I was going to operate again close to your hospital, just as I was going to draw my knife along her throat those coppers spoiled the game but I guess I will be on the job soon and will send you another bit of innerds. Jack the Ripper. O have you seen the devil with his microscope and scalpel looking at a kidney with a slide?”\n\n\nYou are beginning to find yourself unable to sleep at night, knowing another lady's life hangs in the balance. Abberline is just as stressed, one week he has to travel up to Birmingham where a drunk called Alfred Blanchard claims to be the Ripper (several friends come forward providing alibis). Soon after two London men, William Bull and Benjamin Graham both claim to be Jack the Ripper as well and again Abberline has to waste his time interviewing them only for friends to clear them. One promising lead, a French criminal called John Langan, is found to have been in Boulogne at the time of the murders.\n\n\n \n\n ", "action_results": [{"action": "Inevitably the Ripper kills again and you are unable to stop him", "result": "You are not prepared for the horrors you will witness today.\n\n\n\n\nYou are eating lunch when a visibly shaken Policeman calls you from the window. Though it is nearly noon you know at once what has happened and hurry with him to Millers Court on Dorset Street. Several policemen are standing outside the ground floor door of one of the rooms. Incredibly though there are six experienced veteran Policemen on the scene not one of them is willing to enter the room. Two are sitting on the ground and one is actually crying, tears running uncontrollably down his face.\n\n\nAs you approach the window you know it's going to be bad but you have no idea how bad.\n\n\n\n\nWhatever is lying on the bed in that room has not been killed. It has been obliterated.\n\n\nThe shape lying on the bed is only vaguely recognizable as human. The face has been completed hacked apart and the chest torn open, emptied of it’s organs which are scattered around the room. The bed and walls around it are drenched with blood. The only thing that has escaped destruction are the legs. A badly slashed left arm rests inside the open chest cavity. A full set of women's clothes are lying neatly folded on a chair near the bed.\n\n\n\n\nYou have never even heard of one person doing this to another person before and now you have just seen it. It is little wonder the Policemen outside don’t want to go into the bedroom. When the Police Doctor, Dr Bond, arrives even he looks stunned by the level of carnage. He declares he has treated train wreck and coal-fire victims but this is the worst he's ever seen. You're as brave as any other person but you've had enough. You can't deal with this.\n\n\nReturning home you sit in a chair and  cry uncontrollably for forty-five minutes for this unknown woman you've been trying to save but couldn't. You manage to pull yourself together when Abberline arrives. The tough old Inspector looks sick. In robotic movements he draws out his notebook and opens it.\n\n\n\n\n“Mary Jane Kelly,” he says flatly. “Twenty-five. Her friends say she was beautiful. Her partner is a Joseph Barnett. Witnesses Mrs Cox and Mr Hutchinson saw her with a man. Witness Mrs Prater heard someone cry out “murder”. Witness Mrs Maxwell claims to have seen Mrs Kelly this morning though Dr Phillips is certain that she was killed in the night. These are the people I want you to talk to.”\n\n\n\n\n“I'm out,\" you tell him. \"I've had enough. We'll never catch him.\"\n\n\n\"Yes we fucking will,\" Abberline says ferociously. \"Because if we don't he'll never be punished. He'll just keep on killing and killing. You have to get out there and help me find this cunt. He's human. He'll make mistakes. If someone does enough bad then soon or later it will come back to get them, a criminal can't do anything against people who are in the right and who keep on after them. All they can do is run. Sooner or later we will catch up to him and when we do... he's dead.\"\n\n\nGritting your teeth you set out once more.\n\n\n ", "action_results": [{"action": "Talk to Mary Kelly's partner Mr Barnett", "result": "Joseph Barnett is a man of medium height, about thirty years old with a mustache. He clutching a bottle of ginger beer looking utterly destroyed when you find him sitting near the entrance of Miller’s Court.\n\n\n\n\n“I’ve been with Mary for about a year,” he tells you in a monotone. “She was born in Ireland but grew up in Wales. She had a husband before me but he died in a fire. I lost my job a little while back, I was a porter in the market, and Mary went back on the game… I left her after that. She was a good lass, beautiful and not an alcoholic but she knew how to drink. She had lots of friends and everyone liked her… I don’t know why someone would do this to her. I can't understand it. I just can't.\"\n\n\n\n\nYou thank Mr Barnett for his information\n\n\n ", "action_results": [{"action": "Talk to Witness Mrs Cox who saw the victim with a suspicious man", "result": "Mrs Cox is a middle-aged widow with a pale, thin face and she tells you her story through tears.\n\n\n\n\n“I knew Mary well,\" she tells you. \"Last night I headed to my home in Millers Court just before midnight to get something when I saw Mary walking ahead of me with a stout man in an overcoat. He was about 35 with a blotchy face, a mustache and was carrying a pint of beer. He led her to her room and said ‘goodnight’ and she said ‘goodnight, I am going to sing.’ Mary was very drunk and soon after I went to my room I could hear her singing the lament ‘A violet for my mother’s grave.’ I went out again soon after and she was still singing... I got back in at three. At that time there was no sound or light coming from Mary’s room. I went to bed, during the night I occasionally heard people going in and out of the Court but nothing to until the alarm was raised at lunchtime.\"\n\n\n\n\nYou thank Mrs Cox for her information and move on.\n\n\n ", "action_results": [null, {"action": "Talk to Witness Mr Hutchinson who saw the victim with a suspicious man", "result": "You find Mr Hutchinson, an unemployed labourer, at his home on Commercial Street where he has a very interesting story to tell.\n\n\n\n\n“At 2am I was walking down Flower and Dean Street when I saw Mary who I knew well enough,” he tells you. “She said ‘Mr Hutchinson can you lend me sixpence’. I told her I couldn’t because I’d spent all my money visiting Romford that day. ‘I must go and find some money,’ Mary told me. She walked on past me and met a man who put his hand on her shoulder. He said something quietly to her that made her laugh and reply ‘all right’. The man told her ‘you will be alright for what I have told you.”\n\n\n\n\nHutchinson nods and smiles at your keen interest.\n\n\n\n\n“I was interested too, it was strange to see Mary with such a well-dressed man so I followed them towards Dorset Street. The man had a small parcel in his left hand. He had a mustache, dark hair, a hat pulled low over his eyes, a dark coat and a black neck tie. He wore a gold chain on his waistcoat and I would put his age at around 35. They walked to Miller’s Court and stopped there talking for a bit. Mary said ‘all right my dear, come along. You will be comfortable.’ The man hugged Mary who kissed him before suddenly saying ‘I’ve lost my handkerchief’. The man pulled a red one out of his pocket, gave it to her and they went into the Court.”\n\n\n\n\nYou stare at Hutchinson, mental alarm bells ringing. The man with Mary Kelly gave her a handkerchief! If you're investigations have taught you anything (and hopefully they have) it is that the killer you are hunting is in the habit of giving little gifts to his victims. You are a little surprised by the level of detail in Hutchinson’s description, your guess is that he had more than a friendly interest in Mary Kelly which might be why he was keeping such a close eye on the well-dressed man who was with her. \n\n\nThanking him for his information (which may be the most important you have heard yet) you head on.\n\n\n ", "action_results": [null, null, {"action": "Talk to Witness Mrs Prater who heard someone cry \"murder\"", "result": "Mrs Prater, a middle-aged woman with a bad hangover, looks shell-shocked when you interview her outside Miller’s Court. Her room is directly above Mary Kelly’s.\n\n\n\n\n“I went in to bed at around 1.30am,\" she says quietly. \"I passed Mary’s room but heard nothing and saw no light. In the middle of the night, around 4am, I heard a woman’s voice call out ‘murder’ once or twice, not as a scream as such but loud enough to be heard. I paid no attention because we often hear such cries in this neighborhood, also I was very tired. The next morning I went out at 5.30am for a drink, I saw no one and went back to bed until 11 when I got woken up by all the policemen outside Mary’s room. I went down and looked in… I only looked for a second but if I live to be one hundred I’ll never forget that sight.”\n\n\n\n\nYou understand exactly what she means", "action_results": [null, null, null, {"action": "Talk to Witness Mrs Maxwell who claims to have seen the victim this morning", "result": "You go to Mrs Maxwell’s home on Dorset Street and find she is a practical and fast-talking woman.\n\n“I do not know the murdered woman well but I am certain that I saw her at 8.30am this morning,” she tells you straight away. “She was leaning against a wall and told me she felt bad. I suggested she get a drink at the Britannia Pub, she told me she already had and pointed to a patch of vomit. I went into a shop and when I came back Mrs Kelly was talking to a man outside the pub. He was about thirty and dressed like a market porter. About an hour after that I’m sure I saw her inside the Britannia drinking with some people, that would be around 10am.\n\n\n\"You are saying that you saw Mary Kelly alive and well an hour before her body was found and several hours after the Doctor said she died?\" you ask to make sure.\n\n\nMrs Maxwell nods.\n\n\n\"I know how it must sound but I am sure it was the murdered woman. I had only spoken to her twice before but I am sure it was her. I have seen her around Millers Court for the last four months.”\n\n\nYou nod thoughtfully and thanking her for her time you move on.\n\n\n ", "action_results": [null, null, null, null, {"action": "Wrap up this investigation", "result": "That afternoon you return to your home to await Inspector Abberline’s inevitable visit. When he arrives a few days later he looks exhausted.\n\n\n\"We're getting a lot of contradictory claims and wild theories about when Mrs Kelly was killed and even people claiming it wasn't her who was killed at all as because of the incredible amount of damage done to the body it's proving difficult to identify her. When do you think she was killed?\"\n\n\n ", "action_results": [{"action": "Tell him Mary Kelly was killed in the night by a man she brought back to her room", "result": "Inspector Abberline listens thoughtfully to your opinion and nods slowly.\n\n\n\"I agree. I have spoken to this man Hutchinson and I think if any witness testimony we've heard yet is to be believed it is his, his description tallies very closely with the man PC Smith saw with Elizabeth Stride. Hutchinson mentioned the man gave Mrs Kelly a red handkerchief, it is likely he is the same man who I believe earned the trust of the other victims with little gifts including money. I think if we know what he looks like we are much closer to catching him. You have done good work here.\"\n\n \n\nYour Reputation with the police has improved.\n\n\n ", "action_results": [{"action": "It is time to take back control from the Ripper", "result": "Inspector Abberline pulls out a cigar and lights it, the first time you have seen him smoke. Clearly the stress of this case is getting to him.\n\n\n\"Let's look at what we know,\" he declares. \"In the last three months this killer has murdered at least six prostitutes if we could Martha Tabram and eight if we include Emma Smith and the body fragments we found in Scotland Yard. We are no nearer to identifying him now that we were three months ago, our most reliable witnesses describe him as a dark-haired well-dressed man with a mustache around 35. He may carry a package with him that contains his knife. We know how he operates: he earns the trust of his victims with little gifts and money before going some place secluded with them, slitting his throat and killing them.\"\n\n\nAbberline suddenly throws the cigar to the floor in a flash of irritation.\n\n\n\"God that tastes like shit. We know how the man works, we've got people who've seen him and heard him speak, god-damn it we've even got letters from the bastard! How the hell have we not caught him yet? We've been close. When that cabman found Elizabeth Stride's body the Ripper was there, hiding in that yard. When he killed Tabram (if that was him), when he killed Nichols and when he killed Chapman people heard him, but for an opened door, a glance out a window or a peek over a fence they would have seen him in the act! Still he eludes us. We've been going in the wrong direction perhaps. Let's look at our suspects.\"\n\n\nCalming down Abberline opens his notebook.\n\n\n\n\n“First there is James Kelly who killed his wife with a knife five years ago and escaped prison earlier this year. We raided his old home this morning and found no trace of him. Next we have all these men who have come forward claiming to be the Ripper, the latest was a drunk soldier called John Avery who we arrested yesterday after he claimed to be the Ripper. We’ve sentenced him to two weeks imprisonment for wasting police time and hopefully that will send a message.\"\n\n\n\n\nAbberline looks thoughtful.\n\n\n\"I think it is time we approached this killer from another direction my friend. We will make a list of likely suspects and track each of them. If one of them is the Ripper there will be clues and signs, I imagine it's quite hard to be entirely normal in day to day life if you spend your nights cutting up women and taking their organs and whatnots. Together we'll come up with a list of suspects, you and I, and go after each and every one of them until we find our man. The Ripper's clever, he's ruthless and he's effective but we will catch him.\"\n\n\nYou are about to begin the final and hardest part: the search for the one correct Ripper suspect out of many. With perception and persistence you WILL find him.\n\n\n Again you might want to save the game or take a short break at this point.", "action_results": [{"action": "You know what to look for, now you have to find him", "result": "After a week of working together you and Inspector Abberline manage to come up with a list of five possible Ripper suspects: James Kelly, Joseph Barnett, George Hutchinson, Alois Szemeredy and Dr Francis Tumblety.\n\n\nJames Kelly is of course the man you unsuccessfully tried to track down after he escaped prison earlier this year after being incarcerated for killing his wife by stabbing her through the throat with a knife. Since escaping detectives in Liverpool he vanished are unknown though rumors put his current whereabouts in anywhere from London to France.\n\n\nThen there is Joseph Barnett, Mary Kelly's boyfriend. Abberline has actually put together a rather strong case on him: generally his apearrence tallies with various descriptions of the killer. Mary Kelly's room was locked from the inside, either the killer reached through the broken window next to the door to lock the door from the inside and took the key with him (a perfectly possible scenario) or Barnett used his own key to lock the door. Finally there were ginger beer bottles in Mary Kelly's room, in letters most likely to have been written by the Ripper he mentions keeping blood in ginger beer bottles.\n\n\nGeorge Hutchinson, one of the witnesses who saw a suspicious man with Mary Kelly came to Abberline's attention as his description of the man with her seemed a little too detailed and it seems strange that he followed the pair of them around for some time. Abberline suspects if Hutchinson was the real killer then this was a ruse to throw you off the scent.\n\n\nAlois Szemeredy is an interesting man you learn about in police records. Twelve years ago in Buenos Aires, Argentina a prostitute called Carolina Metz had her throat cut by an unknown man. Szemeredy, a notorious thief and certified lunatic, was arrested on suspicion of murder but eventually acquitted after a long and closely-fought trial. Afterwards he fled back to his native Hungary where he vanished again three years ago, Abberline has heard rumors that he may be in London now.\n\n\nFinally there is Dr Francis Tumblety. Tumblety is currently wanted by the London Police for \"committing indecent acts with other men\" (as Abberline diplomatically puts it). Tumblety has skipped bail and fled to France where he has booked passage on a ship back to his native America. Because Tumblety is an out-spoken woman-hater he is being tracked by Abberline's officers who want to question him in connection with the Ripper murders.\n\n\nYou will have to move fast as all of these suspects are constantly on the move and in the cases of Kelly and Szemeredy you are not even sure of their current locations. It is up to you to consider who you want to investigate first.\n\n\n ", "action_results": [{"action": "Joseph Barnett", "result": "With some reluctance you return to Millers Court to talk to Joseph Burnett only to learn from the landlord that Burnett has understandably moved out of his and Mary's old room. The landlord explains that Burnett just couldn’t keep bring himself to live in the room where his girlfriend met such a horrible death. Unfortunately he did not leave a forwarding address and the landlord has no idea where he has gone now. Your efforts to locate him are unsuccessful.\n\n\n ", "action_results": [{"action": "Another attack", "result": "You are still trying to trace your various suspects, all of whom have vanished, when you read in the newspapers that the Ripper may have struck again in a bizarre attack. A prostitute named Annie Farmer took an unknown man to her home where he promptly cut her in the throat with a knife and fled the scene. The cut itself is described as a mere graze and the article describes how arriving officers found Farmer hiding several gold coins in her mouth leading to them to conclude she robbed the man and faked the attack on herself. The incident bears few similarities to the Ripper's own horrific killings but if you want to investigate the papers do list Mrs Farmer's address in Spitalfields.\n\n\n ", "action_results": [{"action": "Look into this unusual case", "result": "Traveling out to Spitalfields you find Annie Farmer's house and knock on the front door, it is opened by a nervous young woman who identifies herself as Mrs Hall, another resident of the house.\n\n\n\n\n“I heard everything,\" she tells you. \"I sleep in another room and was woken by a yell. Running upstairs I saw Annie partly undressed and holding a bloodied rag to her throat. I asked if she knew her attacker and she said “yes, I was with him about twelve months ago and he hurt me then.” She told me the man had a black mustache, dark clothes and she thought he was a saddler. He brought her drinks until she was drunk before she invited him to her home. He cut her a little in the throat and ran away yelling \"what a cow!\" Yes, it's true Annie had coins hidden in her mouth but she told me she didn't steal them.\"\n\n\n\n\n ", "action_results": [{"action": "This does not sound like a Ripper attack", "result": "Soon after the Annie Farmer attack Inspector Abberline drops by.\n\n\n\n\n“We’re not getting very far in our investigations,” he admits to you. “Joseph Burnett and George Hutchinson have vanished into London, we can’t find James Kelly or Alois Szemeredy and Francis Tumblety has escaped into some part of America. The one good piece of news is that the Ripper seems to have stopped killing. You heard about this Farmer woman’s attack I suppose? That doesn't sound much like our man to me.\"\n\n\nAbberline scratches his head thoughtfully.\n\n\n \n\n\n\n“A new suspect has come to our attention though. We’ve picked up a young Polish Jew roaming the streets of London babbling incoherently in Yiddish. He became violent when we arrested him so we’ve transferred him to the lunatic asylum at Colney Hatch. We can't identify him so for now we're calling him David Cohen. There's nothing to prove he's the Ripper per se but he's definitely insane, somewhat violent and it’s possible the depravity of his crimes have caused his mind to break altogether. In fact my superiors are leaning towards the likelihood that a lunatic such as this Cohen boy is responsible for these horrific crimes.  You can go to Colney Hatch and talk to him if you like but I don't think you will get much sense of him.”", "action_results": [{"action": "Go to Colney Hatch to talk to this lunatic", "result": "You travel to Colney Hatch and are shown into David Cohen’s cell. He is a plain-looking young man in a straight jacket sitting in the corner babbling incoherently to himself.\n\n\n\n\n“Don’t let him fool you,” a guard warns. “He’s a spiteful little sod. He'll lash out and scream without warning and we often have to put him in a straight jacket to stop him tearing his clothes off. He spits out food if we give it to him, tears down piping if he can and smashes windows. Don't get too close to him.\"\n\n\nCohen completely ignores you the whole time you are there, muttering and hissing to himself endlessly and occasionally laughing.\n\n ", "action_results": [{"action": "Not getting anywhere here you go back home", "result": "A month after Mary Kelly’s death Inspector Abberline visits you looking worried.\n\n\n\"We might have another murder on our hands,\" he tells you. \"A prostitute called Rose Mylett has been found dead under suspicious circumstances. One of my officers found her body in a disused yard. She didn't have any injuries as such but our police doctors aren't sure if she died from natural causes or strangulation. We're pretty sure the Ripper's not behind this one but you might want to look into it anyway. We're still getting bombarded by suggestions and theories from the general public and as soon as news of this unfortunate death hits the papers we'll get a whole lot more.\"\n\n\n ", "action_results": [{"action": "Do some investigating into Rose Mylett's death", "result": "Your investigation into Rose Mylett’s death leads you to her house on George Street where you talk to her friend, the exotically-named Mr Ptolomey.\n\n\n\n\n“I saw Rosie around 8pm having an argument with two sailors yelling “no, no, no”,\" he tells you. \"I saw her later at 3am with two different men, she looked very drunk. I heard the Police found her body just off the high street around 4am, they don’t know if it was murder or natural causes or what. Rose was a pretty girl but she had a terrible fondness for drink. I don’t know how her health was but she was drunk most nights.”\n\n \n\n ", "action_results": [{"action": "This doesn't look like a Ripper crime to you", "result": "The year ends with no more killings and all of London seems to breath a sigh of relief. It seems the Ripper has definitely moved onto other parts and now you and Abberline have the difficult job of tracking him down. After a few months Abberline visits your home with a new lead.\n\n\n\"Officers in Dundee have just arrested a man called William Bury for killing his wife,\" Abberline tells you. \"It seems he strangled her with some rope and then stabbed her repeatedly in the abdomen with a knife. That's not the clincher though: when police searched his home they found some childish chalk scribbles in the basement that read \"Jack the Ripper lives in this cellar.\" I've done some digging and it seems Bury was living in London during the Ripper killings but moved up to Dundee soon after Mary Kelly's death. Bury's scheduled for trial and an execution looks likely so if you want to interview him you'd better set off for Dundee at once.\"\n\n\n ", "action_results": [{"action": "Go up to Dundee to talk to this suspect", "result": "You journey up to Dundee in Scotland and arrange to see William Bury in his prison cell on the eve of his execution. He is a big bearded middle-aged man with a hard look about him.\n\n\n\n\n“I’m not the Ripper,” he tells you as soon as you start asking questions. “But I never killed anybody except my wife… we had a fight when I was drunk and I got angry. A red mist came down and when it cleared she was lying there dead with that rope around her neck. I wasn't thinking clearly. I tried to cut her up with a knife but the blood coming out of her stomach made me feel sick. I went to the police and told them she'd hung herself but when they saw the knife wounds in her chest they knew the truth right away. I deserve to be killed I suppose but I wish to God I hadn't done what I did.”\n\n\n\n\nTwenty-four hours later Bury is dead, hung by an ominously silent crowd.\n\n\n ", "action_results": [{"action": "You return to London", "result": "Spring turns into summer and it is now nearly a year since the first of the Ripper murders. You know he is out there somewhere but where? William Bury is dead, executed in Scotland for his wife's murder. Joseph Barnett, George Hutchinson, James Kelly, Alois Szemeredy and Francis Tumblety remain elusive. David Cohen is still in Colney Hatch Lunatic Asylum, incoherent and insane. The Ripper could be one of these suspects or one you have yet to uncover. It is very, very frustrating.\n\n\nThen the killings begin again.\n\n\nThe first is a prostitute called Emma Jackson whose dismembered body is fished out of the Thames one piece at a time. Newspapers speculate that her murder is another Ripper killing but you and Abberline agree it does not sound like his work. Then one morning while reading the papers you are stunned to read of another killing that sounds just like his earlier victims: a prostitute called Alice McKenzie has been brutally killed and mutilated.\n\n\nYou read the article in a state of shock. It seems McKenzie's body was found in an alley by a patrolling policeman at 1am that morning. The unfortunate lady was killed by two stab wounds to the throat and several knife slashes were also made across her chest. Though it does differ in some ways from other Ripper murders (her throat being stabbed rather than slashed for instance) it does bring back vividly memories of your discovery of Mary Ann Nichols's body. You consider whether or not to investigate.\n\n\n ", "action_results": [{"action": "Look into this killing", "result": "Finding Alice McKenzie's address listed in the article you make your way to her home in Spitalfields where you meet her partner, John McCormack, who is an old Irish labourer. He looks devastated.\n\n\n\"“She’s been my girl for nigh on seven years now,” he tells you. “She never did a bad thing in her life except smoke like a chimney when she thought I didn’t know. It's all my fault she ended up where she did, I came home from work at 4 in the afternoon and gave her some money to pay the rent. She went out and spent the money on drink. She was drunk when she came back and we had a row about it. She went back out and said she'd get the money back one way or another...\"\n\n\nMcCormack sniffs and carries on.\n\n\n\"I heard from friends she went back to a pub and carried on drinking. They last saw her around midnight hurrying down Whitechapel Road. They asked her if she was alright and she said \"Yes, I can't stop now\". They said she looked like she was late for some sort of appointment. She hurried off and... and... they found her body soon after that. What do I do now my girl is gone? In a few days London will lose interest in her murder but for me this is my life. It's fucked now.\"\n\n\nOffering your condolences the best you can you leave.\n\n\n ", "action_results": [{"action": "Is this another Ripper killing?", "result": "Soon after Alice McKenzie's murder Inspector Abberline turns up unexpectedly one evening at your home. To your amazement there is a faint smell of whiskey about him and he is swaying slightly.\n\n\n\"Sometimes I hate this city,\" he says wearily accepting your offer of a seat. \"As a policeman you only see the worst of it, never the good. The day after this McKenzie woman was killed a man called William Brodie got drunk and told everyone in a pub he'd killed her and was Jack the Ripper. It's taken us three days to prove he's been in South Africa for the last year. Did you know we've found another body? This one hasn't even made the papers.\"\n\n\nAbberline pulls a hip-flask from his pocket, takes a gulp and replaces it.\n\n\n\"We found a woman's torso under a bridge, we think it might be a missing prostitute called Lydia Hart. You know that's the third dismembered body we've found in the last year? We don't think it's the Ripper so that must mean there's another serial killer out there and we don't have a clue who either of them are. Where's Burnett? Where's Hutchinson? Where's Kelly, Szemeredy or Tumblety? I've just heard David Cohen's died in Colney Hatch from what the doctors are calling 'manic exhaustion'.\"\n\n\nAbberline forces himself to his feet.\n\n\n\"Still, we've got to keep trying I suppose. We keep going, keep searching then eventually we must find the Ripper. We must. I found another suspect you might want to investigate, a man called Hyam Hyams. He's has been in and out of lunatic asylums in London since shortly after Mary Kelly’s murder and doctors say he's an uncontrollable drunk. The other night he cut his mother in the head with an axe and stabbed his wife with a knife. We’ve certified him as insane and incarcerated him in Colney Hatch. Perhaps you'd like to talk to this charming fellow?\"\n\n\n ", "action_results": [{"action": "Talk to this latest suspect", "result": "Going up to Colney Hatch you are shown to Hyam Hyam’s cell. He is a middle-aged man in a straight-jacket with grey hair and beard.\n\n\n\"It's very nice to meet you,\" he says pleasantly. \"How do you do?\"\n\n\n“Be careful of him,” the guard warns. “He is a dangerous maniac and he's already stabbed one warden in the neck with a piece of sharp steel. He covers the walls in filth and screams death threats to staff when the mania is on him, at other times like now he can be as nice as you could hope for.\"\n\n\nHyams laughs pleasantly and shakes his head. When you try to talk to him further he just smiles, shakes his head and hums to himself. After five minutes of this you get the hint and leave.\n\n\n ", "action_results": [{"action": "Is this the Ripper?", "result": "Time passes and still the Ripper remains as elusive as ever. Abberline drops by your home one morning, you are surprised to see his black hair is starting to turn grey.\n\n\n\"Another suspect,\" he says unenthusiastically. \"A man called Jacob Levy has just been sent to Colney Hatch. He's insane and possibly violent. He could be our man, who knows? Anything's possible.\"\n\n\nEven Abberline is starting to sound defeated by now.\n\n\n ", "action_results": [{"action": "Go to Colney Hatch and interview Levy", "result": "Going to Colney Hatch you are shown to Jacob Levy’s cell, which is quite close to Hyam Hyams's cell. Levy is a pitiful sight, a naked man with overgrown beard and hair crying uncontrollably throughout your visit before suddenly breaking into fits of laughter. It quickly becomes clear he is unable to answer any of your questions. \n\n\n ", "action_results": [{"action": "This is not getting you anywhere", "result": "Later that year you read in the papers about an unusual double murder that has just occured in London. A woman called Mary Pearcey brutally slaughtered a rival called Phoebe Hogg and her eighteen-month-old baby with a poker and a knife. Arrested almost immediately what catches your attention is that Arthur Conan Doyle, the creator of the Sherlock Holmes detective stories, has claimed he believes that Mary Pearcey is in fact Jack the Ripper, using her gender to lull her victims into a false sense of security. Mary Pearcey has been sentenced to death for her terrible crimes so if you want to talk to her you'd better move quickly.\n\n\n ", "action_results": [{"action": "Go to Mary Pearcey's prison and interview her", "result": "You go over to Holloway Prison to talk to Mary Pearcey. You find her in her cell, a very strong-looking woman who is chanting softly to herself the same words over and over: “killing mice, killing mice, killing mice\". She refuses to talk to you or acknowledge your presence at all and you examine her wondering if she is capable of inflicting the horrific injuries the Ripper did. The fact that all the witness sightings of the Ripper's victims describe them as being accompanied by men rather than women making it seem a bit unlikely she is the Ripper.\n\n\n ", "action_results": [{"action": "Days later Mary Pearcey is put to death", "result": "After Mary Pearcey is executed at you continue your search for the Ripper. One morning you are flicking through a newspaper when you are stopped by a headline that screams RIPPER KILLS AGAIN! The article goes on to describe how a policeman was walking down Chamber Street at 2am when he found the body of a prostitute called Frances Coles lying on the ground.\n\n\n\n\nAs the policemen knelt to examine her Coles suddenly opened her eyes and stared at him but couldn’t speak because her throat had been slashed apart. Though the policemen heard a man’s footsteps running away down a nearby street he tried to staunch Coles’s wound rather than pursue the man but she died moments later. Apart from her slashed throat Coles had no other injuries but journalists covering the story are convinced her murder is the work of the Ripper. You frown wondering whether you should investigate for clues.\n\n\n ", "action_results": [{"action": "Look into this murder", "result": "The article mentions that a man called James Saddler has already been arrested for Frances Coles's murder. Going to a local police station you find Saddler, a middle-aged Irishman with a bruised face.\n\n\n“Like I keep telling everyone I had nothing to do with that woman's death, I only met her two days ago,” he insists to you. “We had been drinking all day and on the way back to my lodgings I got attacked by two thugs and robbed of all my money. I couldn't afford money for a bed so I went out again. I got into two more fights and I suppose I was in a pretty bad way when I booked myself into the London Hospital at 5am. The first I learned that Frances was dead was when those coppers came round and arrested me.”\n\n\nSaddler sighs and shakes his head.\n\n\n\"“It couldn't have been me. Frances was with her friends until half hour before she was murdered. They said a man came up, a little man with a dark mustache and blue trousers who looked like a sailor. He was looking for some fun and when one of the girls turned him down her punched her. He spoke to Frances and she went with him. They walked off down White Street and that was the end of her. Her friends will clear me, they know it wasn't me.\"\n\n\nAs it turns out Saddler is right, the testimony of Coles's friends help acquit him and he walks free.\n\n\n ", "action_results": [{"action": "Is this the work of the Ripper or just another prostitute killing in this rough town?", "result": "Not long after Frances Coles's murder your is caught by an account of a newspaper article about another violent murder, this time across the Atlantic in New York. A prostitute called Carrie Brown checked into a hotel room with a man and was found the next morning strangled and mutilated. According to the doctors who examined her body she had been slashed and hacked savagely  and it appeared that her killer had tried to remove her organs.\n\n\n\n\nThe description of the man that checked in with Brown sounds familiar to you: around thirty years old with a light mustache, slim build, dark suit and hat. The article is light on details making you ponder. You know Dr Tumblety was last seen in America, though where he, Barnett, Hutchinson, Kelly or Szemeredy are now is anyone's guess. Jacob Levy has recently died of syphilis at Colney Hatch leaving Hyam Hyams your remaining suspect incarcerated there.  \n\n\nOnce more Inspector Abberline visits again, balding now and weary.\n\n\n\n\n“Another suspect,” he tells you. “Thomas Cutbush. He’s a medical student who has been certified insane after stabbing a woman with a knife in a fit of madness. He’s being held in Broadmoor Hospital currently if you want you to go and talk to him there.”\n\n\n ", "action_results": [{"action": "Talk to Cutbrush", "result": "You go to Broadmoor where you are introduced to the medical student Thomas Cutbush. He is a fair-haired young man who sits in absolute silence, refusing to talk to you for the whole time you are there.\n\n\n“He’s been catatonic since he arrived,” a guard explains to you. “Never says a word.”\n\n\n ", "action_results": [{"action": "Your suspects don't seem to be very talkative", "result": "One evening Inspector Abberline pays his last visit to you.\n\n\n\"He's beaten me,\" he says wearily. \"I have no more idea who the Ripper is now that when we began this investigation. I've just announced my retirement, I'm handing the entire case over to you. The police are drawing a line under it, no one's investigating now. Out of our suspects Bury, Cohen, Levy and Pearcey are dead, Cutbrush and Hyams are in asylums and Burnett, Hutchinson, Kelly, Szemeredy and Tumblety are who knows where. It's all in your hands now but I am certain that if anyone can find and unmask this monster it is you.\"\n\n\nDetermined not to let the man who snuffed out the lives of several women go unpunished you keep searching. Soon you read about a man called Frederick Deeming who has just been arrested in Australia for cutting his wife's throat and smashing her head in. What links the case to London is that the bodies of Deeming's first wife and there four young children are found rotting beneath the floorboards of a London house where Deeming lived prior to emigrating to Australia. Their throats had all been cut. Predictably the newspapers are full of speculation that Deeming is Jack the Ripper. You could travel to Australia and interview him but as he has already been sentenced to death you will have to go as fast as you can.\n\n\n ", "action_results": [{"action": "Go to Australia to interview Deeming", "result": "Crossing the world by steamship you reach Deeming’s prison cell in Melbourne on the eve of his execution and manage to secure an interview with him. The ruthless killer is a fierce and tough looking man who laughs loudly when you ask if he is the Ripper.\n\n\n\n\n“How could I have been?” he asks. “I was in Cape Town, South Africa mining diamonds out of the Transvaal the year those prostitutes were hacked up. I didn’t get back to England until a year afterwards. Hang on,  you don’t reckon if I say I am the Ripper they’ll stay my execution and send me to a new trial in England? It'd be nice to see the old girl one last time.\"\n\n\n\n\nNothing comes of his idea: Deeming is executed the next day before a cheering crowd and you return to London.\n\n\n ", "action_results": [{"action": "So ends another suspect lead", "result": "Your search for the Ripper unearths another suspect a few months after Deeming’s execution when yet another serial killer is arrested in London. You read in the papers Dr Thomas Cream was arrested after poisoning and killing four prostitutes  with strychnine over a six month period for his own enjoyment. It is later found he was also responsible for the poisoning murder of a man in Chicago in 1881. Again the papers are full of claims that Cream is the Ripper, though his method of killing with poison is far different than the Ripper’s brutal slaughter of his victims with a knife. Still, when Cream is sentenced to death in Newgate Prison he is only a short way from where you live if you want to visit him.\n\n\n ", "action_results": [{"action": "Go and interview Cream", "result": "Going to Newgate Prison you meet the murderous doctor in his cell. He is an amiable middle-aged man with a moustache and glasses who is amused by your suggestion that he is the notorious Whitechapel murder.\n\n\n“How could I be killing prostitutes in London in 1888 when I was serving a ten year sentence for murder in Missouri until 1891?” he asks with a smile and sighs. “I wish I had been Jack the Ripper. His killings were the sort of thing us medical fellow can appreciate, so skillfully done!”\n\n\nCream dies unrepentant at the end of a noose soon after.\n\n\n ", "action_results": [{"action": "Another one bites the dust", "result": "After searching for them for so long you finally begin to get some closure on your missing suspects Burnett, Hutchinson, Kelly, Szemeredy and Tumblety. You learn from police reports that Alois Szemeredy has surfaced in Hungary. After committing a series of burglaries, one of which resulted in him beating a shopkeeper to death, Szemeredy is finally tracked down and arrested. As he is taken into custody he produces a hidden razor blade and cuts his own throat, bleeding to death before help can arrive. Whatever secrets he might harbour go to the grave with him.\n\n\nIt is not so with Dr Francis Tumblety, who to your excitement finally surfaces in the town of Rochester in New York where he is practicing medicine and giving newspaper interviews insulting the London Police and ridiculing claims that he is Jack the Ripper. Now you have finally found him your first thought is to go to America and interview this important suspect at once in case he slips away again.", "action_results": [{"action": "Travel across the Atlantic to interview Tumblety", "result": "You book passage on a liner across the Atlantic and within months you are standing in Dr Francis Tumblety’s house. The doctor is a man of medium height with graying hair, a mustache and wears a suit. When he shakes your hand you notice three cheap brass rings on his fingers which look strangely out of place alongside his gold watch chain and diamond stickpin. Weirdly various organs float in glass jars of alcohol on different tables behind him. He sees you looking at them and smiles.\n\n\n“That’s just my collection of wombs,” he says as if wombs are normal household decorations. “Anyway you say you are from London? I have no idea why the London Police considered me a suspect in these Whitechapel killings. They hadn't one single piece of evidence against me. I have never done a single human being any harm and there are many I have helped. Though I don’t care much for women personally but I have often helped many of them out of difficulty. I am no woman hater, in fact there are some parts of them I rather admire.”\n\n\nHe smiles benignly, playing with the three cheap brass rings on his fingers as he does so.\n\n\n ", "action_results": [{"action": "Slightly unnerved by this strange man you return to London", "result": "One morning out of the blue you are surprised to receive a note inviting you to visit Scotland Yard. Once you arrive you are led into the office of Chief Constable Melville Macnaghten, a rising star in the force despite only having joined the police recently. He shakes your hand briefly and invites you to sit down.\n\n\n\n\n“I understand you have continued to investigate the Ripper Case even though everyone else seems to have given up on it,” he tells you looking pleased. “I understand you have some suspects but I want to see this investigation concluded and have found some suspects of my own I'd like you to investigate to see if we can bring a case against them. There is a lawyer called Montague Druitt who drowned himself the month after Mary Kelly was killed, a highly suspicious coincidence eh? There is a Polish Jew called Aaron Kosminski who was certified insane soon after Mrs Kelly's murder, I consider him a likely suspect as well. Finally there is a mad Russian Doctor called Michael Ostrog who was in London at the time of the murders. I would be very glad if you could investigate these suspects for me and report back your findings.\"\n\n\n\n\nYour attempts to get him to listen to who you consider the most likely Jack the Ripper suspect is politely ignored.\n\n\n ", "action_results": [{"action": "Investigate the background of Montague Druitt", "result": "You look into the case of the lawyer Montague Druitt who drowned himself on the last day of 1888. You quickly discover that at the times Mary Ann Nichols and Annie Chapman were being murdered Druitt was playing cricket and when Stride and Eddowes were killed when he was in Cornwall. The only murder that occurred while he was in London was that of Mary Kelly. Following these discoveries you turn your attention elsewhere.\n\n\n ", "action_results": [{"action": "Investigate Aaron Kosminski", "result": "A search into the background of Aaron Kosminski reveals he is still alive and living in a lunatic asylum. You visit him there and find he can't speak any English except \"hello\" and \"bye bye\" and seems to have the mind of a child. He seems quite peacefully content and weaves a wicker basket the whole time you are there while his guards cheerfully inform you he is never any trouble at all. He doesn't seem like Ripper-worthy material to you.\n\n\n ", "action_results": [null, {"action": "Investigate Michael Ostrog", "result": "Your search into the background of Michael Ostrog reveals he isn't quite the \"mad Russian doctor\" Macnaghten apparently believes he is but rather a fairly unsuccessful criminal who has been in and out of prison ceaselessly for petty burglary charges.  Though he has a history of insanity his records show he was serving time in prison for the theft of a metal cup at the time of all the Ripper Murders. It doesn't seem likely at all that he is the Ripper.\n\n\n ", "action_results": [null, null, {"action": "Wrap up your final investigation", "result": "When you return to Scotland Yard and tell Chief Constable Macnaghten that you have not found any credible proof linking his suspects to the Ripper Killings he looks unhappy.\n\n\n\n\n“Each to his own opinion I suppose,” he says grumpily. You tell him your own theory about who you think the Ripper is most likely to be but Macnaghten just shrugs and tells you it’s a nice theory. You are frustrated by his lack of support but there is nothing you can do. After so many years of research it seems the Police are unwilling to help you catch the Ripper at long last. You feel utterly failed by the London Metropolitan Police.\n\n\n\n\nDespite your frustration with the lack of support you continue to watch for Ripper-related news. In 1894 a man called Carl Feigenbaum slashes the neck of his landlady in New York and is promptly arrested. His lawyer claims he is Jack the Ripper soon after his client’s execution but there is no real evidence to prove it one way or the other. Far more interesting is another article that you read with a jolt: the murderer James Kelly who you have hunted since the start of your career has walked into the British Consul in New Orleans in America and offered to surrender himself and return to prison in England after eight years on the loose. Immediately your first thought is to go and meet him.\n\n\n ", "action_results": [{"action": "Interview Kelly when he returns to England", "result": "You take a train up to Liverpool and weeks later you finally meet the man you have hunted for so long. James Kelly is a handsome man with a mustache who greets you with a handshake. As you stare into the killer’s face you become uncomfortably aware that you are the only person who has come to meet him when his ship from America docked, no police officers or officials are on the scene presumably because Kelly's ship has arrived a day early. Kelly has noticed this too and sighs.\n\n\n\n\n“I guess they’re not that interested in me after all,” he says. When you eagerly ask him about the Ripper murders Kelly just smiles. “I was in London at the time but I didn't kill anyone,” he replies. “In December I went to France and then America. I guess if no one is here to meet me I’ll just take a walk. It was nice meeting you.” Kelly shakes your hand and that is that, the pair of you part ways once more. By the time the police show up the next day the killer has vanished once more.\n\n\n ", "action_results": [{"action": "One last suspect", "result": "The years pass by slowly, after arresting officers missed him in Liverpool James Kelly continues to elude capture. You never do find Joseph Burnett or George Hutchinson. Thomas Cutbush, Hyam Hyams and Aaron Kosminski remain in asylums, Michael Ostrog remains in prison following further thefts. Dr Francis Tumblety remains at large in America. Finally, fifteen years after the Ripper murders, one last suspect emerges.\n\n\n\n\nA Polish man called George Chapman is arrested on suspicion of poisoning and killing his three previous wives. He is found guilty of the murders and sentenced to hang, it quickly emerges in the papers that as a young man he lived in London during the time of the Ripper Murders. The shop where he worked was just opposite the George Yard buildings where Martha Tabram’s body was found. Inspector Abberline, by now in his 60’s and looking quite healthy now he is free from the stress of his job, drops by your home brandishing the article.\n\n\n\n\n“Well, they’ve caught Jack the Ripper at last,” he tells you happily. “I'm sure this is the man we struggled so hard to catch fifteen years ago.”\n\n\n\n\nThough you are not a young man yourself anymore you consider making one last trip up to Wandsworth Prison to interview Chapman before his execution.\n\n\n ", "action_results": [{"action": "Go and talk to your last suspect", "result": "Going to Wandsworth Prison you meet George Chapman. He is a ruthless looking man with dark eyes and a mustache. He looks quite capable of the three murders he has been convicted of. When you ask him about the Jack the Ripper murders he says nothing, he simply faces you with blank eyes and a cold smile. Feeling glad he is to be executed soon you return to your home.\n\n\n ", "action_results": [{"action": "Time to close this case", "result": "Soon after George Chapman’s execution, you are invited to the office of Private Investigator John Littlechild and he looks excited.\n\n\n\n\n“Sir, I have just come from a meeting with Chief Constable McNaghten, former Inspector Abberline and the Home Secretary and together we have decided to act on the evidence you have been gathering on the identity of the man behind the Whitechapel murders, the killer known as Jack the Ripper. If you can supply us with enough evidence me and my private team of Detectives will act on it to arrest the person you name.”\n\n\n\n\nThis is the moment you have been waiting for!\n\n\nYou run your list of suspects through your head to decide on the one you think is most likely to be the killer.\n\n\nSo, who is Jack the Ripper?\n\n\n ", "action_results": [{"action": "Joseph Barnett", "result": "Joseph Barnett could have been Jack the Ripper.\n\n\nEagerly you explain your theory to Inspector Littlechild, that Barnett may have started killing prostitutes with increasing savagery to discourage his girlfriend Mary Kelly from entering that particular line of work. When she did not change her ways he slaughtered her with unimaginable savagery. His apearrence matches many eyewitness descriptions but Inspector Littlechild is quick to point out the main problem.\n\n\n\"We don't have any proof whether this theory is correct or not,\" he says unhappily. \"No one has seen Barnett for fifteen years and we are unlikely to find him now.\"\n\n\nYou are forced to concede that this is true.\n\n\n ", "action_results": [null, {"action": "Settle with this one", "result": "You are disappointed that your hunt for Jack the Ripper could not have ended more satisfactorily.\n\n\nAs the years pass you find yourself interviewed ceaselessly by journalists fascinated with the mystery of Jack the Ripper. The killer's victims, mother of four Mary Ann Nichols, Annie Chapman who battled terminal illness in her struggle to survive, Elizabeth Stride, who once ran a successful coffee shop, Catherine Eddowes, who battled alcoholism while trying to hold a relationship together and Mary Jane Kelly, a beautiful and social party girl, are all but forgotten while towering over them is the killer whose name has become synonymous with brutality and mystery: Jack the Ripper.\n\n\nThank you for taking the time to read my story.\n\n\n ", "action_results": [{"action": "If for some reason you want to know more about my research and thoughts on Jack the Ripper click here", "result": "For my research in writing this story I mainly used casebook.org, a one-stop world about Jack the Ripper.\n\n\nIt is no wonder Jack the Ripper remained uncaught as the police at the time were awful. They believed the Ripper was literally a foaming-at-the-mouth madman and because they were anti-Semitic they guessed he was probably Jewish too, hence \"the mad Jew\" theory that crops up in police documents like the Macnaghten Memorandum. Frederick Abberline was probably the best of a bad bunch while I think the later detective John Littlechild was on the right track too.\n\n\nSince the Victorian era literally hundreds of books have been written naming possible Ripper suspects. Though anyone who was in London and alive at the time could be a suspect I think there is something in believing that the Ripper could have been a known serial killer like George Chapman. Strong cases have been made for non-killers, books like Miriam Rivett's and Mark Whitehead's Jack the Ripper (naming suspect Joseph Barnett) and Donald Rumbelow's The Complete Jack the Ripper (naming suspect Francis Tumblety) particularly stand out.\n\n\nThough Tumblety is the most likely of all the suspects to my mind it's certain the mystery of who Jack the Ripper was will never be solved. I have included sixteen suspects in this book but there are literally hundreds including artist Walter Sickert, Lewis Carroll (who wrote Alice in Wonderland), Thomas Bernardo (founder of Bernardo's children's homes) and of course members of the Royal Family who usually get blamed by someone when bad things like car crashes and mad cow disease happens.\n\n\n One thing I don't like is that while killers like the Ripper, Ted Bundy or Jeffrey Dahmer have become celebrities their victims are forgotten. All of the Ripper's victims left behind families who had to cope with the pain. They were trapped in a cycle of alcoholism and prostitution, if you go to the red light district in Soho, London (as me and my friends sometimes would in our uni days, purely for research purposes of course) you will see things have not really changed much since the Ripper's time except it's drugs rather thank drink that fuel the sex trade now. In dark worlds like this it's easy for modern-day serial killers to operate anonymously in the shadows just as the Ripper did.\n\n\nIf you're still reading by this point either you're very polite or have become interested in Jack the Ripper, if you have your own theories I'd enjoy hearing them.\n\n\n ", "action_results": []}]}]}, {"action": "William Bury", "result": "William Bury could have been Jack the Ripper.\n\n\nEagerly you explain your theory to Inspector Littlechild. William Bury is one of the few men who has proved capable of murder (though using a different method to the Ripper) who was living in London at that time. The graffiti in his cellar claiming that Jack the Ripper lived there could be a form of self-confession. The Ripper killings stopped soon after Bury left London but Inspector Littlechild isn't convinced.\n\n\n\"The killing of his wife was not very similar to the Ripper murders at all,\" he points out. \"Straight after it he confessed as well. Even if Bury was the Ripper, which Bury himself denied, he was executed fourteen years ago.\"\n\n\n ", "action_results": [null, null]}, {"action": "George Chapman", "result": "George Chapman could have been Jack the Ripper.\n\n\nEagerly you explain your theory to Inspector Littlechild. Chapman is a ruthless serial killer who was certainly living in London at the time in the heart of Whitechapel. Though his method of killing with his later victims was poison rather than stabbing you think it is possible he could have changed the way he worked. Finally he is Inspector Abberline's preferred suspect. Littlechild listens frowning.\n\n\n\"It is possible that Chapman was the Ripper but there is no proof to confirm this theory,\" he tells you. \"Chapman never spoke about the Ripper murders and was executed a few days ago.\"\n\n\n ", "action_results": [null, null]}, {"action": "David Cohen", "result": "David Cohen is probably not Jack the Ripper.\n\n\nAwkwardly you try to explain to Inspector Littlechild why you think Levy was the Ripper, telling him he was a mentally-ill young man who may have been living in London at the time of the killings and that the murders stopped after he was committed to a lunatic asylum.\n\n\n\"I don't think this is our man,\" Littlechild says, looking unimpressed. \"You haven't got any evidence against him at all except that he was mad. We're hardly going to get any now if Levy died of his illness fourteen years ago.\"\n\n\nYour Reputation has been damaged.\n\n \n\n ", "action_results": [null]}, {"action": "Dr Thomas Cream", "result": "Dr Thomas Cream is definitely not Jack the Ripper.\n\n\nYou try to explain that Dr Cream was responsible for killing at least five people with poison and could well have been responsible for the Whitechapel Murders but Inspector Littlechild cuts you off.\n\n\n\"I'm afraid you have this all wrong,\" he tells you. \"Dr Cream was incarcerated in Joliet Prison at the time of the Ripper murders. We have proof of that. He could not have been the Ripper.\"\n\n\nThis has seriously damaged your Reputation.\n\n\n ", "action_results": [null]}, {"action": "Thomas Cutbrush", "result": "Thomas Cutbush is probably not Jack the Ripper.\n\n\nAwkwardly you explain your theory to Inspector Littlechild, that he was a mentally-ill man who may have lived in London at the time and enjoyed poking women with knives. Inspector Littlechild listens with a frown on his face.\n\n\n\"I don't think so,\" he tells you. \"There is no real evidence he is the Ripper apart from the fact he was mad and the way he poked women in the rear with knives is very different to the way the Ripper used his knife. We can't ask him anyway, Cutbrush died in the asylum two months ago.\"\n\n\nYour Reputation has been damaged.\n\n\n ", "action_results": [null]}, {"action": "Frederick Deeming", "result": "Frederick Deeming is probably not Jack the Ripper.\n\n\nYou explain your theory to Inspector Littlechild. Frederick Deeming was a brutal serial killer who used a knife to slaughter six people, cutting their throats in the same way the Ripper did. Inspector Littlechild listens with a patient smile.\n\n\n\"It's an excellent theory,\" he tells you. \"But there is one problem. We have very strong evidence that Deeming was in South Africa at the time of the Ripper murders. Also none of Deeming's victims were mutilated in any way and four of them were children. Besides we can't ask him now, he was executed eleven years ago.\"\n\n\nYour Reputation has been damaged.\n\n\n ", "action_results": [null]}, {"action": "Montague Druitt", "result": "Montague Druitt is definitely not Jack the Ripper.\n\n\nAwkwardly you try to explain your theory to Inspector Littlechild, that the Ripper murders stopped after he committed suicide but Inspector Littlechild sighs.\n\n\n\"Have you been talking to Macnaghten? Druitt could not have been the Ripper: he was playing cricket far from London on the days of the first two murders and was in Cornwall the night Stride and Eddowes were killed. He is one of the few people we know who definitely could not have committed those crimes.\"\n\n\nYour Reputation has been seriously damaged.\n\n\n \n\n ", "action_results": [null]}, {"action": "Carl Feigenbaum", "result": "Carl Feigenbaum is probably not Jack the Ripper.\n\n\nAwkwardly you explain your theory to Inspector Littlechild. Feigenbaum committed a brutal murder in America broadly similar to the Ripper murders. Before that he was a sailor and could have been in London at the time of the Ripper killings.\n\n\n\"There is no real proof this is our man,\" Littlechild tells you. \"We've got no evidence against him except the word of Feigenbaum's lawyer after his client's execution when Feigenbaum wasn't around to contradict him. Finally the murder Feigenbaum was convicted for was in a brightly-lit house in front of other people, he doesn't sound much like the Ripper does he?\"\n\n\nYour Reputation has been damaged.\n\n\n ", "action_results": [null]}, {"action": "George Hutchinson", "result": "George Hutchinson is probably not Jack the Ripper.\n\n\nAwkwardly you explain your theory to Inspector Littlechild, that Hutchinson gave an overly-detailed statement of a man with Mary Kelly to mask his own responsibility for her death. Littlechild listens and sighs.\n\n\n\"That's speculation,\" he says. \"It's more likely that Hutchinson was watching the man with Kelly due to envy and jealousy. There is no evidence against him at all and no one has seen him for fifteen years so we've no idea where he is now.\"\n\n\nYour Reputation has been damaged.\n\n\n ", "action_results": [null]}, {"action": "Hyam Hyams", "result": "Hyam Hyams is probably not Jack the Ripper.\n\n\nAwkwardly you explain your theory to Inspector Abberline. Hyams is a violent and mentally unstable alcoholic who was living in London at the time of the Ripper murders. Inspector Littlechild listens and shakes his head with a sigh.\n\n\n\"I don't think so,\" he tells you. \"Hyams is a weak-minded man and his attacks on his mother and wife were due to childish rage. We've no evidence that he was responsible for committing these horrific acts of carnage.\"\n\n\nYour Reputation has been damaged.\n\n\n ", "action_results": [null]}, {"action": "James Kelly", "result": "James Kelly could have been Jack the Ripper.\n\n\nEagerly you explain your theory to Inspector Littlechild. Kelly is a clever man who has proven himself capable of murder and was probably in London at the time of the killings. He could have been responsible for the attacks.\n\n\nInspector Littlechild looks thoughtful. \"It's a sound theory but we have no way to prove it,\" he tells you. \"The last I heard he was living in Canada and he has never been connected to any murders apart from that of his wife.\"\n\n\n ", "action_results": [null, null]}, {"action": "Aaron Kosminski", "result": "Aaron Kosminski is probably not Jack the Ripper.\n\n\nAwkwardly you explain your theory to Inspector Littlechild: Kosminski was a mentally-ill man who was living in London at the time of the murders. Inspector Littlechild listens carefully, sighs and shakes his head firmly.\n\n\n\"I don't think so,\" he tells you. \"Kosminski's staff at Colney Hatch describe him as harmless and child-like. There is no shred of evidence against him at all and judging by his current behaviour I would say the Ripper couldn't have been him.\"\n\n\nYou had better choose another suspect.\n\n\n ", "action_results": [null]}, {"action": "Jacob Levy", "result": "Jacob Levy was probably not Jack the Ripper.\n\n\nAwkwardly you explain your theory to Inspector Littlechild: Levy was a mentally ill man living in London at the time of the Ripper murders. Littlechild shakes his head.\n\n\n\"There is no evidence at all that Levy is the Ripper and in fact we know from his guards that Levy was a non-violent prisoner,\" Littlechild tells you. \"We can't ask him now anyway, Levy died from his illness twelve years ago.\"\n\n\nYour Reputation has been damaged.\n\n\n \n\n ", "action_results": [null]}, {"action": "Michael Ostrog", "result": "Michael Ostrog was definitely not Jack the Ripper.\n\n\nAwkwardly you try to explain your theory to Inspector Littlechild. Ostrog was an insane career criminal who you believe was responsible for the crimes. Littlechild sighs.\n\n\n\"You have been speaking to Macnaghten haven't you?\" he asks. \"Ostrog is a petty criminal who was in prison for stealing a metal cup at the time of the Ripper killings. In fact he's in prison now for more minor burglaries, he could not be the Ripper.\"\n\n\nThis has seriously damaged your Reputation.\n\n\n ", "action_results": [null]}, {"action": "Mary Pearcey", "result": "Mary Pearcey was probably not Jack the Ripper.\n\n\nAwkwardly you explain your theory to Inspector Littlechild. Pearcey was an incredibly strong woman who brutally slaughtered a woman and her baby and was living in London at the time of the Ripper murders. Littlechild smiles.\n\n\n\"It's an imaginative theory for sure,\" he tells you. \"But all the witnesses who may have seen the Ripper identified him as a man. Mrs Pearcey's crimes were crimes of passion, why on earth would she cut up prostitutes? We can't ask her now anyway, she was executed thirteen years ago.\"\n\n \n\nYour Reputation has been damaged.\n\n\n ", "action_results": [null]}, {"action": "Alois Szemeredy", "result": "Alois Szemeredy was possibly Jack the Ripper.\n\n\nEagerly you explain your theory to Inspector Littlechild. This slippery and insane Hungarian criminal was responsible for at least one but probably two murders and may well have been in London at the time of the Ripper murders. Inspector Littlechild looks thoughtful.\n\n\n\"It's possible,\" he agrees reluctantly. \"Buy Szemeredy was primarily a burglar and thief rather than a killer. There is nothing to prove he was in London at the time and in fact there's no real evidence against him at all. We'll never know now, he committed suicide years ago.\"\n\n\n ", "action_results": [null, null]}, {"action": "Francis Tumblety", "result": "Dr Francis Tumblety is Jack the Ripper.\n\n\nMethodically you explain the solution to Inspector Littlechild.\n\n\n\"This doctor was arrested days after the last Ripper murder and promptly skipped bail and fled to America where he went into hiding,\" you tell Littlechild. \"He hated women but has a fascination with possessing women's organs. He has the charm, intelligence and wealth to trick his victims with valuable gifts and his apearrence generally matches witness descriptions of the Ripper. Finally I can prove he was the Ripper: he wears the three cheap brass rings he stole from Annie Chapman's body at all times.\"\n\n\n\"You've cracked it,\" Inspector Littlechild exclaims looking amazed. \"Let's arrest Jack the Ripper!\"\n\n\nIn the summer of 1903 you cross the Atlantic in an ocean liner accompanied by Inspector Littlechild and three of his detectives but the Ripper will elude you one last time. When you arrive in Rochester, New York, you learn that Tumblety died just two days before, passing away peacefully in his sleep. You go to view the serial killer's body where it lies in the funeral home, Tumblety looks peaceful and seems to wear a faint smile on his face. You remove Annie Chapman's brass rings from his lifeless fingers which he stole from her when he stole her life in that dirty yard all those years ago.\n\n\nInspector Littlechild is disappointed and tells you that if Tumblety had lived he surely would have been arrested, convicted and executed. There is no point raising a fuss now. Returning to London you go to Manor Park Gate Cemetery to find Annie Chapman's grave intending to bury her rings with her only to find her grave has already been paved over as workmen build a new street. In death as in life no one cares about London's prostitutes.\n\n \n\n ", "action_results": [null]}]}]}, null]}]}, null]}]}, null]}, null, null]}, null, null]}]}, null]}]}, null]}]}, null]}]}, null]}]}, null]}]}, null]}]}, null]}]}, null]}]}, null]}]}, null]}]}, null]}]}, null]}]}, null]}]}, {"action": "George Hutchinson", "result": "You go to the Victoria Men’s Working Home on Commercial Road where George Hutchinson was last living but when you are arrive you are in for an unpleasant surprise: Hutchinson has moved out and no one seems to know where he has gone now. No one has heard from him and your efforts to find him are in vain.\n\n\n ", "action_results": [null]}, {"action": "James Kelly", "result": "Going to the local police station you look over the police files on the hunt for James Kelly. Since his escape from Liverpool five months ago there have been no confirmed sightings of him but unconfirmed rumors indicate he is or is shortly planning to flee to France. Raids on his former home and the homes of his relatives in Liverpool have found no trace of him leaving you at a loss of how to find this clever man.\n\n\n ", "action_results": [null]}, {"action": "Alois Szemeredy", "result": "Your search for Alois Szemeredy takes you to Budapest where he was last sighted. You are able to trace his medical files which report he has been in and out of lunatic asylums for more than twenty years and police records show he has been arrested repeatedly for theft and attempted murder. His trial for murder in Argentina took six years before ending in unexpectedly in his acquittal, he afterwards returned to Hungary (his birth country) which he left two years ago to parts unknown. Despite all this information you are unable to find no trace of the man himself and return to London.\n\n\n ", "action_results": [null]}, {"action": "Dr Francis Tumblety", "result": "Learning that Dr Tumblety has indeed fled France back to his native America you book passage on a ship to New York, traveling with an Inspector from Scotland Yard who also wants to interview Tumblety. When you arrive in New York you learn that Tumblety has escaped one step ahead of you, fleeing New York for parts unknown. Despite an extensive search of the city by American lawmen they cannot discover where the elusive Doctor has gone. You do however learn that Tumblety has a criminal record, having been arrested in the past for unlicensed abortions, malpractice and even suspicion of involvement in President Lincoln’s assassination. With no clue of his current whereabouts you have no choice but to return to London.\n\n\n ", "action_results": [null]}]}]}]}, {"action": "Tell him Mary Kelly was killed late in the morning by a man she was drinking with", "result": "Inspector Abberline frowns when you tell him about Mrs Maxwell's evidence.\n\n\n\"Yes I spoke to her too, she did sound very sincere didn't she?\" he asks. \"Personally though I think she has made an honest mistake. She has got Mrs Kelly mixed up with this other woman who she spoke to this morning and thinks they are one and the same. I'm not going to consider this serious evidence and I don't think you should either.\"\n\n\nYou nod and Abberline smiles, though he still looks a little uncertain by this contradictory evidence.\n\n\n ", "action_results": [null]}, {"action": "Tell her you do not think it was Mary Kelly who was killed at all", "result": "Inspector Abberline looks astonished.\n\n\n\"Of all the people I would have thought would have brought into this ridiculous theory you are the last!\" he exclaims. \"Just because the killer destroyed her face there is no reason to doubt this is Mary Kelly. Joseph Barnett, who has been her boyfriend of the last year and ought to know what she looks like, has identified her. If the dead woman is not Mary Kelly then the real Mary Kelly would have identified herself by now. I don’t think we will make any progress at all if you follow such mad ideas as these.\"\n\n \n\nYour Reputation with the police has been damaged.\n\n\n ", "action_results": [null]}]}]}, null]}, null, null]}, null, null, null]}, null, null, null, null]}, null, null, null, null]}]}]}]}, null, null]}]}, null]}, null, null]}, null, null, null]}, null, null, null]}]}, null, null]}]}, null]}, null, null]}, null, null, null]}, null, null, null, null]}, null, null, null, null, null]}, null, null, null, null, null, null]}, null, null, null, null, null, null, null]}, null, null, null, null, null, null, null]}]}, null]}]}, null]}]}]}, null]}]}, null]}, null, null]}, null, null]}]}, null, null]}]}, null]}, null, null]}, null, null, null]}, null, null, null, null]}, null, null, null, null, null]}, null, null, null, null, null]}]}]}, null]}]}, null]}]}, null, null, null, null]}]}, null]}, null, null]}, null, null, null]}, null, null, null, null]}, null, null, null, null, null]}, null, null, null, null, null, null]}, null, null, null, null, null, null]}]}]}, null]}, null]}, null, null]}, null]}, null]}]}]}, null]}, null, null]}, null, null, null]}, null, null, null, null]}, null, null, null, null]}, null, null]}]}, null]}, null, null]}, null, null]}, null]}, null, null]}, null]}, null]}, null, null]}, null, null]}, null]}, null]}, null]}, null]}]}, null]}, null]}, null]}, null, null]}]}, null]}, null, null]}]}