{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=16489", "context": "", "first_story_block": "The dead branches outside the large window rustle softy in the wind, whispering softly in the pallid light.. Pale snowflakes dance their ghastly dance before they fade away on the frozen ground. Shadows move silently over the floor as the full moon travels through the heavens. A grandfather clock calls nearly inaudible from the hallway, announcing the ghost hour with a faint 'DONG'. The ancient house around you creaks and crunches as if it's stirring in some deep sleep.\n\n\nYour mind barely registers your surroundings as you are sitting inside your comfortable chair. The library is almost completely engulfed by shadows, safe for the dying embers in the hearth next to you. Reading some dusty tome about knowledge which most people have already forgotten, you often forget that the house around you even exists. However, tonight you can't keep your eyes open. Nearly nodding, nearly napping you try to continue reading, but you notice you've already read the same line seven times over. With a sigh, you decide to give in and rest your eyes for a little while.\n\n\nImages from long forgotten times unfold themselves in front of your mind's eye. A garden in spring time. The morning sun shimmers on the surface of a blue lake. Two swans glide side by side near the water's edge. Pebbles crunch as a beautiful woman runs towards you. Wearing a plain white dress, with a skin like...\n\n\nTAP TAP TAP\n\n\nYou are roughly awaken by a sudden tapping at your door. Desperately you try to cling on to your memories, but they fade away like shadows before the sun. With one foot still in Morpheus' realm you wonder if the noise was merely part of your dream. With a curt shrug  you decide to return to your book, when suddenly...\n\n\nRAP RAP RAP\n\n\nFear begins to wrap it's shadowy fingers around your heart. 'Tis just some visitor', you mutter to yourself, 'only this, and nothing more'. With a mind still firmly in sweet dream's grasp, but tempted by curiosity, and fear, you decide to...\n\n\n \n\n ", "action_results": [{"action": "open the door.", "result": "With your hands and legs trembling you lift yourself from your chair. Slowly shuffling trough the cold shadows you feel a chill tingling at your spine. Feeling more and more unsettled you notice the rhythmic swaying of your purple curtains. Against your better judgement this image thrills you, fills you with fantastic terrors, the likes you've never felt before.\n\n\nTo still the beating of your heart you stand near the door, repeating to yourself: 'Tis some visitor entreating entrance at my chamber door. Some late visitor at my door. But why would a visitor come knocking at my chamber door, in stead of the front... No, do not dwell upon these thoughts. Tis some visitor, and nothing more.'\n\n\nWith your trembling hand extended you reach for the gleaming brass knob. As your hand envelops the cold metal you stand frozen in place, neither capable of opening the door, nor relinquishing you grip. While all of your instincts are raging within you, you open the door. \n\n\nThe creaking of the rusty hinges pierces your ears and torments your mind. It takes hours before the door is finally open and the darkness of the hallway comes pouring into the library. Shadows and dust whirl around each other, moved by the smallest wind created by opening the door. You gaze at this play when you realize the hallway is empty. Shadows and dust, and nothing more.\n\n\n ", "action_results": [{"action": "Continue...", "result": "Softly whispering, but slowly strengthening, you call into the black abyss: Sir, or madam, I implore your forgiveness. I was napping while reading a book and so gently came your rapping that I scarce was sure I heard you. Please good sir, or madam, make yourself known.'\n\n\nYou look around once more, but no further sounds can be heard coming from the shadows. Strange thoughts and dreams circle through your mind, but still the darkness gives no token. Wary, you whisper with a trembling voice: 'Lenore?' Silence follows, but an echo murmurs back this one word: 'Lenore!'\n\n\nAs you turn to return to the chamber, you once more feel an ominous tingling in your spine. With a beating heart you once more survey your surroundings. The hallway is the same as before, although the dance of dust and shadow has ended, and yet you can't shake of the feeling that someone, or something, is watching you. Suddenly the silence is broken by a ghastly noise, that same noise that led you into this darkness.\n\n\nTAP TAP TAP\n\n\nThis time it is louder than the last. As your heart once more tries to leap out of your chest, you can feel the air grow colder. Shaking and shivering you try to determine the origin of that dreadful noise. Warily, you turn your head, convinced that an unknown assailant can reveal itself at any moment. Yet only shadows surround you. Anxiously, you keep repeating to yourself: 'There's nothing here but shadows and dust. Tis a leaking pipe that's making that noise, that it is and nothing more.'\n\n\nFeeling slightly more secure you are about to return to the library, just as the eerie sound returns once more.\n\n\nTAP TAP TAP   TAP TAP TAP   TAP TAP TAP\n\n\nStartled, you look around and you notice the door near the end of the hallway. It's there were the origin of that noise resides. As you continue to gaze upon it, the doorknob begins to rattle, turned by an invisible hand, and the tapping sound strengthens.", "action_results": [{"action": "Thoroughly scared, you retreat into the library.", "result": "With a pounding heart, you slam the doors of the library shut, trying to block out the shadows and demons of your minds eye. In the pale light of the hearth's dying embers, you stand panting. With your heart beating in your chest, pounding in your throat, you feel light-headed. \n\n\n'Surely 'tis but a passing fancy, a shadow of an imaginative mind. There is really nothing wrong, as in the morning you shall find. You have never been a madman, nor have you have been told you are. Let us not start doubting now, 'tis a fancy by far. Let's just continue reading my book, that'll calm me down. It is winter, it is cold, it is the season to feel unsettled.'\n\n\nStill slightly trembling, you sit down in your comfortable chair, and pick up your volume of long-forgotten knowledge. Though the words tend to jumble and jump in front of your eyes, an aftereffect of your shaken heart, the gathering of knowledge does sooth your spirits. After a few minutes pass, you have all but shaken the last remnants of the night's terrors from your mind. Until you hear a tapping on your window's lattice. \n\n\nYou turn towards your window, your soul within your burning, yet you cannot see past its closed shutters. Scared, yet inquisitive, you decide to approach it. For what if it is a visitor who, having tried knocking on your door, tries to seek your attention in other ways? Maybe they're throwing small stones against your window?\n\n\nOnce you reach your window, your hand on the shutters' latch, you feel the cold, winter's air blowing through it. Shivering, you briefly wait, but decide to open the shutters. A flurry of feathers blows past you, too fast to focus on, startling you, and making you jump backwards. \n\n\nCAW CAW CAW \n\n\nA raven, a beast as black as the darkest night, flies around your library and perches itself above your chamber door. On the pallid bust of Pallas high above your chamber door. How long you've stood watching it in bewilderment, you do not know, but once you've gathered your senses, you burst out into laughter.\n\n\n'You my dear, sweet raven, surely art no craven. Tell me fearless raven, flying through this winter's snowy night, tell me why you bless me with this wondrous new sight?'\n\n\n'Nevermore.'\n\n\nFrom the its elevated perch a voice rung out, clear as water, yet creaking like ice. The raven, that enigmatic being, spoke as if answering your query. \n\n\n'Can you understand me, are you answering, am I right? Tell me what your name is on the dark shore of this night?'\n\n\n'Nevermore.'\n\n\nAgain, that singular word. Gazing into the eyes of that bird, you feel slightly unsettled. Slowly, a soft tingling starts to spread over your spine, as if the shadows of the library, surrounding you, are watching, closing in on you. You try to shake the thought. Focusing your attention back on the raven, you notice that he is still sitting completely still. Not a feather has rustled since you last addressed him. \n\n\n'Tell me, oh saintly raven, of the region whence you came. Tell me of your master, who gifted such a singular name. How did you ever learn this, did you witness great a pain? Tell me of the grief which shall hold no more name.'\n\n\n'Nevermore.' \n\n\nAn illogical annoyance bubbles up within your soul. You start to feel like this bird, this beast has been sent here with the sole intention of mocking you. With a slightly raised voice, you address him for one last time: 'Curious demon, mocking tormentor, tell me why you came. Tell me why you carry such a strange and ominous name. Were you sent here by the heavens, or does the devil play a game? Are you here to mock me, or is my own, sad mind to blame?'", "action_results": [{"action": "'Nevermore.'", "result": "Annoyance turns into anger as that beast mocks you once more. Grunting, you mutter to yourself: 'Other friends have flown before, on the morrow he will leave me as my hopes have flown before. On the morrow, all will be as was before.'\n\n\n'Nevermore.'\n\n\nAngry, yet curious, you gaze once more at that singular bird, perched on the pallid bust of Pallas high above your chamber door. Yet, as your gaze meets his, you feel a dark pit of sadness and despair open up, deep within your heart. With a voice filled with grief and wrath, you address the raven once more: 'Beast or devil, work of evil! Vile demon you might be! Tell me if you know of one no longer here with me. Tell me if the saints and angels have the one that I adore. Tell me of the one I lost, my radiant Lenore.'\n\n\n'Nevermore.'\n\n\nLenore, the name haunts you still, even after so many, many months. Briefly, you break free of the raven's gaze, as you look once more upon her portrait, hanging on one of your library's walls. From within her wooden frame, Lenore looks at you with sad eyes, a kind smile upon her lips, filling you with longing. \n\n\n'Nevermore.'\n\n\nThe raven once more utters that singular word with his creaking, icy voice, mocking your loss, your despair. Icy tendrils grasp at the corners of your mind, and a deep fear makes its way into your heart. You once more turn your eyes towards the placid bust of Pallas high above your chamber door. There, your tormentor, never flitting, still is sitting, still is sitting. \n\n\nStaring into the unblinking eyes of that shadowy prophet, you feel the last of your courage leaving your body. The shining image of Lenore slowly fading from your mind. Suddenly, in the blackness of the raven's eyes, you see the shimmer of a reflection, of the maiden you adore. Yet now, instead of love, instead of longing, it fills you with an overwhelming feeling of... ", "action_results": [{"action": "Sadness.", "result": "'Heartless demon!' You cry out, 'Tormentor from the nightly shore! Have you no mercy for a poor man, mourning the mem'ry of his late Lenore? Take your break from out my chest, and take your form from off my door! Leave me here in peace this evening, let me forget my sweet Lenore.'\n\n\nQuoth the raven 'Nevermore'. \n\n\nTears well up in your eyes, and your knees give way beneath you. The image of Lenore, once shining and radiant, has now turned into a mockery, a shadow of her former self. That rare and radiant, saintly-clasped maiden that you once loved, whose portrait still adorns your chamber wall, shall visit you nevermore. Her memory, haunting you like a shadow of despair. \n\n\nCAW CAW CAW \n\n\nThe raven's cry sounds once more, mocking you, laughing at your misery. That grim and beastly devil sitting above your chamber door. Behind you, you hear the final hiss of the embers in your hearth. In the pale moonlight, the raven seems but a shadow against the pallid bust above your door. Yet you know that he is watching you, observing you, peering deep inside your soul. The shadow of death, mocking your loss, and your powerlessness to overcome it. \n\n\nYou meet its gaze once more, its piercing, dead gaze, but cannot find any remorse in it. Silently it watches, waiting tirelessly. For what, only the heavens know. Yet in that cold darkness, in those remorseless eyes, you see that whatever your actions, whatever you do in your life, whatever the cold, lonely future has in stall for you, this demon, this beast, this devil from the nightly realm, shall leave you never- nevermore.", "action_results": []}, {"action": "Fear.", "result": "The gaze of that winged demon, that messenger of death, is too much for you to bear. A sliver of ice lodges itself into your spine and your knees turn weak. With your heart pounding in your chest, an irrational fear makes itself the master of your mind. Almost without thought, you open the door to your library, and run away, leaving that demonic bird sitting above you, perched high above your chamber door. \n\n\nBack in the hallway, you notice that the dance of dust and shadow continues once more. An icy cold has appeared, chilling you to the bone. As you carefully step into the darkness, strength returning to your knees, yet your heart still pounding in your chest, you notice small puffs of mist erupting from the carpet. You're scared, you don't want to admit it, but you're scared. That winged demon that haunts you is still somewhere behind you, you can feel it. \n\n\nYet while you worry about the shadows behind you, a soul-shattering wail erupts from below you. A female voice, filled with grief and despair. In front of you, the staircase beckons that leads to the hallway downstairs, the dark hallways downstairs, the hallway where that wail just originated. However, while weighing your choices, you'd rather explore what's going on downstairs, than return to that beast in the library. ", "action_results": [{"action": "Continue...", "result": "Crouching down until you're knees are almost touching the floor, you creep towards the top of the stairs. Peeking down, the cavernous hallway seems dark and desolate save for a narrow streak of moonlight shining through the windows above the front door. Two doors, besides the front door, give access to two more chambers on the ground floor: the living room and the smoke room. And it is of this room, the smoke room, that the door remains open just a little bit, and just at the moment that you are peeking down into the hallway, a small piece of white fabric disappears through it.\n\n\nThough your heart is pounding in your chest and you knees are shaking visibly, you decide to brave your fears and descend the staircase. As soon as you put weight on the top step the staircase creaks and cracks, loud enough to shake your resolve and wake all the demons in hell itself. However, you decide to brave onwards. Step by step, creak by creak, you more or less succeed in descending the staircase safely.\n\n\nAs your feet finally touch the stone tiles on the hallway's floor you let out a quick sigh of relief. As you survey your surroundings you wonder why you ever continued to live in a mansion that just screams 'HAUNTED'. An old chandelier, made suitable for electric lighting long ago, softly sways from the ceiling, its lights darkened. The faces of your ancestors stare blankly at you from their respective stately portraits which overlook the staircase you just descended. The grey moonlight which shines through the few windows around the grand, wooden, doors gives them an even more dead like pallor.\n\n\nThe uneasy silence which envelops your home has not yet lifted, and yet you could swear that you hear floorboards cracking in the smoke room. This is, of course, a preposterous thought. You are all alone in this house, and have been for many months now. Who else could be wandering these halls? To still the beating of your heart, you think to yourself: 'Tis probably some rodent wandering in these darkened halls, sheltering from an animal or looking for food. P...'\n\n\nBut before you finish your thoughts a cold winds blows through the crack in the doorway. Suddenly shivers run down your spine and you can feel your knees start to tremble once more. While fear starts to fill your mind once more, you decide to...", "action_results": [{"action": "Investigate the smoke room.", "result": "As you fully open the door to the smoke room, a cold wind greets you. In the corner of your eyes, you can see the frayed, grey curtains in front of the windows slightly sway in the wind. The ancient window frames are cracked, and no match for the bleak winter's air. \n\n\nSlightly shivering, you look around you. The smoke room is just like you left it, though a substantial layer of dust has since accumulated. Two cracked, dried-out leather chairs stand in front of the cold fireplace. A small table is set between them, cigars that were probably quite excellent at some point are lying in a box on it. Faded portraits of idyllic hunting and pastoral scenes line the walls, and a small book case is standing in one corner of the room, holding some dusty book for light reading. To be honest, the room isn't that very large for a mansion such as yours. \n\n\nAfter looking around for some time and reassuring yourself that nothing out of the ordinary is residing in the room, you turn to leave. However, your eyes then fall on a small picture on the mantle of the fireplace, quite small, and so caked in dust that you can hardly see the subject at this distance. Your attention piqued, you pick up the picture, and carefully remove the layer of dust. \n\n\nIt turns out to be a photograph of a young woman. The woman you recognise from your dream earlier, the woman you recognise as Lenore. Lenore, the love of your live, the angel of your existence, the centre of your universe. You almost forgot you had this picture of her. Compared to the large, stately portrait, hanging in your library upstairs, this is a very intimate picture. Lenore, smiling at the camera, still much younger than when you last saw her. You can actually remember taking this picture, during a long, warm summer so many years ago. \n\n\nA tear disturbs some of the dust on the picture frame. Sighing a deep, heavy, emotion-laden sigh, you put it back. Though you turn around, you could swear that you can still see Lenore in front of you. Though no longer so very young, you look at the picture of Lenore as you last saw her. Clad in a pure, white dress, she stands in front of you. Her eyes, looking far beyond you, gaze pitifully forward, her countenance undecipherable, looking sad and angry, pitying and harsh, pallid and vivid. \n\n\nYou almost speak to her. As she appears before you, you cannot but imagine she is really here. Confused and hopeful, sad and joyous, despairing and pleading, you try to speak. But a blink of an eye later, the image is gone. ''Tis only the desire of my heart, my most sacred wish, but nothing  more.' \n\n\nSaddened by your mind's deception, you exit the smoke room.", "action_results": [{"action": "Continue...", "result": "Back in the hallway, you look around you. The pale light of the Winter's moon is partially obstructed by clouds, and in its shifting light, your empty house seems grim and ghastly. The portraits on the walls, those of your forefathers, appear to look at you with dead eyes, following your every move. Somewhere in the distance, you can hear the creaking and groaning of your ancient house. \n\n\nYou still can't shake that shiver from your spine, as if a sliver of ice has lodged itself inside it. Trying to expel the ghostly image of Lenore from your mind, you notice the hairs on your arms start to stand upright. This is wrong, this is so very, very wrong. You fear that you might be slowly going insane. The events of the evening so far have left you certainly not unshaken. \n\n\nSomewhere behind the staircase, a mouse patters off, the thread of its small paws echoing in the empty space. You jump, quite highly. Starting to feel slightly light-headed, you take a few, deep breaths. You swear you can practically hear your nerves shattering if you listen closely enough. Why is this happening to you? \n\n\nTAP TAP TAP\n\n\nYou must have been mistaken. You wish, you wish fiercely that you were mistaken. That infernal tapping, that dreadful noise that has tormented you this evening has returned. As its echo resonates throughout your mind, your gaze turns towards the closed library door at the top of your staircase. Though seemingly left untouched, you know that behind it is the beast, the demon that has been mocking you this entire evening. \n\n\nOr (you almost don't dare to wish it) might it be Lenore, trying to grab your attention? Surely she couldn't, surely you didn't just see her, or what remains of her. Surely, it is the delusion of your mind that is leading you to wish, to vehemently wish, such impossible thoughts. Then again, are you willing to risk finding out? \n\n\nWhile you are contemplating moving back to your library, you hear the sound of creaking floorboards in the living room. 'Tis probably the settling of your ancient house, or the soft patter of the mouse you heard earlier. But then again, you heard a similar sound in the smoke room just moments earlier. \n\n\nThen again, why should you stay here, in this house of sadness and pain? You remember that you are standing inside the hallway, and that the front door is just behind you. Why should you stay here, tormented by the demons in your mind, if you can escape them quite easily? Surely, if you come back tomorrow, peace and quiet will have returned?\n\n\nAs you stand in the dimly illuminated hallway, you feel your fingers twitch slightly. You can't take much more of the night's horrors, you are afraid. It is just too much. With a pounding heart, and shaking legs, you make your decision about where to go next. ", "action_results": [{"action": "Run Away", "result": "With a loud 'Thump', you pull the front door shut behind you. Your heart pounding in your chest, the adrenaline ringing in your ears, you try to get away as quickly as possible. Without looking back, you make your way through the snowy wasteland that was once your driveway. In your head, the name of Lenore keeps echoing back and forth, back and forth, back and forth. You don't know where your headed, you don't know how long you will stay on the run, but you do know that you're never setting a foot in your house again.\n\n\n----\n\n\nThe white walls of your room are spinning around you. A soft, high-pitched laughter escapes from your mouth. You feel woozy, unable to focus clearly on your surroundings. Through the fogginess of your brain, you faintly register your arms being held in an uncomfortable position, but you cannot move them. The ground feels weird, soft, almost squishy. A strange, metallic taste is in your mouth. \n\n\nIn the distance, you can hear someone muttering a word: 'Lenore'. Never stopping, always repeating that single word: 'Lenore, Lenore, Lenore, Lenore, Lenore', as if it were a mantra to an unseen goddess. With a shock, you recognise the voice as your own. \n\n\nSomewhere besides you, you hear a door open. Your vision stabilises briefly enough to see a man, dressed as a doctor, enter. You feel your mouth opening, not by your own accord, and notice some small objects being forced down your throat. The metallic taste appears stronger. Though your vision stabilises. Stabilises, and softly fades to black. Before you know it, you fall asleep on the soft, squishy floor. In your dreams, you are once more visited by Lenore. ", "action_results": []}, {"action": "Investigate the Library", "result": "A cold wind blows towards you as you open the library door. Though the embers in the hearth have long since died down, the pale light of the Winter's moon is enough to look around. The chamber looks empty and desolate in the bleak light, your tome lying undisturbed where you left it. Yet you immediately notice that something is wrong, the light, for one shouldn't be shining. Wooden shutters, though worn with age, are supposed to keep the night's darkness out, yet now lie broken on the floor amidst a field of splintered glass. Winter's icy breath blows freely within the ancient room. \n\n\nLooking around, your gaze falls upon the portrait of Lenore, hanging on your library wall. In the strange moonlight, she looks as if she is following you with her eyes, a sad, wane smile upon her lips. Lenore, has she been haunting you tonight? You are not sure, but her spirit, or at least her memories have kept you up this night. You might actually be going insane, but you also kind of want to be able to see her again. \n\n\n'Nevermore.'\n\n\nA voice behind you calls out in response to your thoughts, that dreadful voice that beckoned you here, creaking with malice. You turn around, expecting an attack by your mysterious tormentor, yet the hallway behind you look grim and desolate. Then a single, feather, black as the darkest night, flutters down from above. As look up, up towards the pallid bust of Pallas high above your chamber door, you see a shadow perching there. A raven, a seemingly normal raven, is perched above the placid bust of Pallas. Yet while you look at him, he stares back with a gaze containing a bottomless abyss. \n\n\nPrickles run up your spine, and icy tendrils grasp at your mind's defences. You are tired, so very, very tired after this evening. And now, gazing into that black abyss, that demon's soul, you feel a wave of desperation overcome you. Lenore, the light of your life, your eternal love, has never felt so very far away. Not even when you buried her, not even when you thought you saw her earlier, have you felt such a profound sense of loss, and hopelessness. \n\n\nCAW CAW CAW \n\n\nThe raven, not a flutter, never flitting, utters that dreadful sound that has haunted you tonight. As if its laughing at you, laughing at your loss, laughing at your powerlessness to overcome it. The malicious shadow of death that is haunting you. \n\n\n'Heartless demon!' You cry out, 'Tormentor from the nightly shore! Have you no mercy for a poor man, mourning the mem'ry of his late Lenore? Take your break from out my chest, and take your form from off my door! Leave me here in peace this evening, let me forget my sweet Lenore.'\n\n\nQuoth the raven 'Nevermore'. \n\n\nTears well up in your eyes, and your knees give way beneath you. The image of Lenore, once shining and radiant, has now turned into a mockery, a shadow of her former self. That rare and radiant, saintly-clasped maiden that you once loved, whose portrait still adorns your chamber wall, shall visit you nevermore. Her memory, haunting you like a shadow of despair. \n\n\nCAW CAW CAW \n\n\nThe raven's cry sounds one last time, mocking you, laughing at your misery. That grim and beastly devil sitting above your chamber door. Snowflakes start to whirl around you, brought in by Winter's breath, through the gaping hole in your window. In the pale moonlight, the raven seems but a shadow against the pallid bust above your door. Yet you know that he is watching you, observing you, peering deep inside your soul. \n\n\nYou meet its gaze once more, its piercing, dead gaze, but cannot find any remorse in it. Silently it watches, waiting tirelessly. For what, only the heavens know. Yet in that cold darkness, in those remorseless eyes, you see that whatever your actions, whatever you do in your life, whatever the cold, lonely future has in stall for you, this demon, this beast, this devil from the nightly realm, shall leave you never- nevermore.", "action_results": []}, {"action": "Investigate the Living Room", "result": "As you enter the living room, you do not see anything out of the ordinary. The sitting corner around the fireplace, the dining table, the china cabinets, all are in their right places, though thoroughly caked with dust. Yet something does not feel right. Though the wind is howling outside, and snowflakes are clouding the windows, you do not feel cold. The Winter wind, though creeping through the cracks in the window frame, instead feels light a warm summer's breeze. \n\n\nPiano music starts playing softly, as if coming from a great distance. The old piano in the corner, however, has been untouched for months, and looks even worse. Slowly, the music is strengthening, coming into focus more and more clearly. It's a ragtime melody, stirring memories of a day so long ago. \n\n\nThen, suddenly, the snow in front of the windows starts clearing, vanishing in front of the bright sun. Your living room changes, shaking of its layers of dust and neglect, shining brightly in the sultry Spring heat. You can see flowers start blooming in a vase on the dining table, where flowers have not grown for quite some time, cobwebs vanish from the bookcases as if never there, and in the corner, besides one of the large windows, a woman is playing the piano, with a man standing behind her. \n\n\nThough unfamiliar at first, you recognise the couple with a shock. The man, standing proudly, his hands on the woman's shoulders, listening to the beautiful music, you recognise as yourself. Albeit a younger version of you, unshaken by a long, dreadful sorrow. The woman, entranced by the music, swaying softly on the tune of her own making, you recognise as Lenore. A smile graces her fair and radiant face. Tears start to well up in your eyes at the sight of this unexpectedly peaceful scene. Illuminated by the Spring sun through the large window, the couple almost looks otherworldly, an intimate scene depicting heavenly love between a man and a woman, a scene fit for an altar piece. \n\n\nThen clouds shift in front of the sun. The music dies. The man calls out in surprise, and you can see yourself stooping down, holding a lifeless Lenore in your hands. Her eyes are open, her chest is still softly swelling at the rhythm of her breathing, yet she is not conscious. Tears roll down your face, both of your own and that of your ghostly apparition. The man, you, is shouting now, calling for help, pleading for someone to come. Behind you, you hear a door open. Hurried footsteps come nearer. \n\n\nCAW CAW CAW \n\n\nThe scene fades away into nothingness, and you're left looking at your old, neglected piano. Silence once more fills the room, broken by the periodic howling of the wind outside. A shadow flies past the snow-clouded window. In the middle of the cold, lonely room, you start crying as the memory of that sweet Spring day slowly fades away. ", "action_results": [{"action": "Continue...", "result": "Back into the hallway stepping, wiping the tears from your face, you hear the sound of a breaking glass, and the fluttering of feathers, coming from your library upstairs. That beast, that demon who has been your tormentor this entire evening, is surely there. Yet despite your fear, even despite your curiosity, you feel compelled to go upstairs. Past the portraits of your pale and pallid ancestors, you tread steadily on the ancient oaken steps. \n\n\nYet once you are upstairs, you do not know for sure if you should enter the library at all. Driven by memory, by the recollection of the events all those months ago, you know deep down inside that the library is not where this history ends. Instead, you imagine a light, shining softly, yet steadily behind the door of one of the bedrooms, Lenore's bedroom, the one that you visited not long ago. The one where you saw her, when she was still here. \n\n\n'Nevermore.'\n\n\nThe voice startles you, clear as water, yet creaking like ice. Appearing out of nowhere, it sounded like it was addressing you. Yet, as you look around you, all you can see is the eternal dance of dust and shadows, here in the darkness of the hallway. You gaze wanders back to the closed doors of your library behind you. A cold wind blows through the cracks, chilling your very being. \n\n\nA sliver of ice lodges itself in your spine as you contemplate your actions. In front of you, Lenore's bedroom looms, dark and forbidding like the rest of your house, yet a feeling deep inside of your heart urges you to go there; however, behind you, your library lies, your sacred sanctum where you have spent most of the past few months, now probably defiled by that infernal winged demon. Doubt besets you once more, but eventually, you decide to go to...\n\n\n ", "action_results": [null, {"action": "the bedroom.", "result": "Softly, almost solemnly, you open the door to Lenore's bedroom. Though you expected it to be dark and desolate, like the rest of the house, you find it just as in your memories. Those you'd rather not relive. Lit by the roaring fire in the fireplace, you look at an intimate setting. A young woman, drowning in a sea of pillows and blankets, lies palely in a bed, beads of sweat moisten her brow. Her hand, shaking, pallid, clutches that of your younger you. With a soft voice, somewhere between silence and a whisper, she addresses you: 'Promise me this, promise me you won't forget. I love you... I love you.' \n\n\nThe younger you starts to sob more intensely. His hand is resting in front of his face, sparing Lenore the sight of his tears. Shaky, laced with utter despair, your voice is almost lost in the noise of the fire behind you: 'I... I promise Lenore. How could I ever forget you. I promise with all my heart. Please... Please, I beg you, please don't leave me here.'\n\n\nA soft smile appears on the face of Lenore. Despite her increasingly laboured breathing, she replies you with a kind, warm voice: 'I don't think that is for either you or me to decide at this point anymore. I'm afraid you'll have to let me go now.'\n\n\nShe falls silent, but a heart-wrenching wail escapes from your ghostly apparition, still clutching the pale, lifeless hand of Lenore. Tears stain the wooden floor of the bedroom. \n\n\nThe fire dies, the room darkens, and your younger self disappears. Lenore, however, stays behind. With steady movements, she steps out of bed, and walks towards you. Though the room is dark, and the Winter's moon is clouded by snow, you can still see her clearly, illuminated by a soft, yet pallid light that seems to emanate from her. The strain of sickness has disappeared from her features, and she looks as beautiful as she was during her life, yet a ghostly pallor seems to dwell beneath her beauty. A soft smile lies on her lips as the touches your cheek with her soft, warm hand. \n\n\n'My love, why are you still in mourning? So long a time has passed, the seasons have shifted, Spring has gone, and I with it. Is this really how you want to remember me? As the pale ghost, the shadow of death that haunts you wherever you roam? I am at peace, and I have been for quite a while now, yet you are still troubled.'\n\n\nYou start to cry. Desperately, you cling to Lenore's hand. 'How can I ever get over you? You are the light of my life. Death has cheated us, time has cheated us. You were still so very young, so very full of vigour and life. How can I ever get over burying you?'\n\n\n'Because I ask you to. We were still so very, very young, you still are, but we are not to decide when our time comes. I would have wanted nothing more dearly than more time with you, but it was not our fate. Yet why should my death mean the end of your life? Do you really want to spend the rest of your time in your library, separating yourself from the rest of the world, desperately trying to forget me? Cursing the Fates for tearing us apart? My dearest, it is time to let go. Time will move on, seasons will move, and Spring will come once more. Go, be happy, live your life. In time, we will see each other again.'\n\n\n'Lenore...'", "action_results": []}]}]}]}]}, {"action": "Enter the living room", "result": "As you enter the living room, you do not see anything out of the ordinary. The sitting corner around the fireplace, the dining table, the china cabinets, all are in their right places, though thoroughly caked with dust. Yet something does not feel right. Though the wind is howling outside, and snowflakes are clouding the windows, you do not feel cold. The Winter wind, creeping through the cracks in the large window frames, chills you to the core. \n\n\nOutside, the snowflakes slowly start to cake the large windows. Once providing you with a view of your beautiful gardens, they now look out over a deserted and desolate landscape, fog and snow hiding everything from your eyes in the pale moonlight. While you are looking outside, you feel a tingle creeping up your spine, as if the shadows are watching you. Slowly, softly, you start to hear voices behind you. Slowly strengthening, they appear as if they are shouting. \n\n\nThoroughly scared, you turn around. The living room has changed. Still dark, illuminated only by the pale moonlight and some sparse candles, it has shaken off its age. The atmosphere has changed as well, no longer freezing cold, but sultry, like a cool Spring evening. \n\n\nIn front of you, two people have appeared, ghastly pale, and shimmering with an otherworldly light. A young man and woman, locked in a heavy argument. You recognise the woman as Lenore, the light of your life, your eternal love, yet her face is clouded by tears. The young man, surprisingly, you recognise as yourself, yet a younger version of you, not yet weighed down by devastating sadness and loss. Your face is twisted into a mask of wrath. \n\n\n'Don't you dare lie to me, you cuccolding harlot!' You hear yourself scream. 'Tell me who that man was, tell me what he was doing here, in our house!'. \n\n\nTearfully, choking on the words, Lenore replies the younger you: 'I told you already, he is an old acquaintance of mine. Please, my love, come back to your senses. You know how much I love you, you know...'\n\n\n'Hold your tongue, lying serpent, don't lead me on with your lies any longer. You cannot deceive me, I know what happened here.'\n\n\nSobbing harder and harder, Lenore can barely answer you; 'I swear... I swear my love. Y... You know me, you know I would never... never hurt you like this. Please, I beg you, you have to believe me.' \n\n\nLenore desperately throws herself at the younger you, yet you push her away. Lenore flies backwards, and bangs her head against the dining table, a small splatter of blood appearing beneath her head. However, she has not lost consciousness, and tearfully, hiding her face in her hands, runs out of the room. You hear yourself shouting out in anger and despair, and see yourself sitting down at the table, sighing heavily.\n\n\nCAW CAW CAW \n\n\nThe scene fades away into nothingness, and you're left looking at your old, neglected piano. Silence once more fills the room, broken by the periodic howling of the wind outside. A shadow flies past the snow-clouded window. In the middle of the cold, lonely room, you feel a dark shadow grip at your heart at the memory of that wretched day. The room grows darker as heavy clouds move in front of the moon. \n\n\nCAW CAW CAW\n\n\nThat dreadful noise sounds once more, and you feel your nerves shattering. An illogical fear clouds your mind, and you run for the nearest door. ", "action_results": [{"action": "Continue...", "result": "With your heart pounding in your chest, you pull the door closed behind you. Slowly, you slide down the door, knees trembling, until you firmly sitting on the ground, with your arms around your knees. You look around, and notice that in your frightened haste, you ran into the kitchen. Though it isn't very large, at least not for a mansion like yours, it still holds a few cupboards and cabinets, a couple of stoves and some sinks. An arrangement of kitchen knives adorns one of the walls, and trapdoors in the floor give access to the cold storage rooms below. Everything is as dusty and mouldy as the rest of the house. Yet the funny thing is, you cannot remember when the last time was you prepared food here, or even ate at all. \n\n\nCAW CAW CAW\n\n\nIn the living room, you can hear that dreadful sound that drove you here in the first place. Yet now, while resounding within your ears, it also changes your surroundings. Dust and mould vanish in front of your eyes, and the smell of food assaults your nostrils, making your mouth water slightly. You stand up to examine your surroundings, yet the first thing you notice is a familiar shape standing in front of one of the stoves. \n\n\nIn your hand, you spot a vial, filled with a clear liquid. Stirring into a pot with unknown contents, you slowly and deliberately empty the vial until there is not a single drop left. All the while, you look around you suspiciously, as if anticipating someone, or something, walking in on you. You put the vial back into the inner pocket of your jacket, just as you, the real you, hear a door behind you open. \n\n\nWith a straight face, not a trace of surprise on it, the younger you addresses someone behind you: 'Ah, Alfred, I was wondering where you were. I see dinner is ready then? Excellent. As you might have noticed, the uhm... precarious situation between me and Lenore has not exactly improved, so she'll probably be eating in her quarters again.' A look of concern passes across the younger you's face. 'And please, Alfred, could you tell her I love her? Could you tell her I am begging her to come back to me.'\n\n\nCAW CAW CAW\n\n\nWith a shock, you realise the kitchen has changed back to how it was, dusty and mouldy, and decidedly abandoned. However, in the corner of your eye, you can see a shadow shifting past the ceiling. A rain of feathers, each single one of them as black as the darkest night, rains down from above. Wings flutter above you, but within the darkness of the kitchen, you cannot spot the source. \n\n\nThen, a window in the kitchen's corner shatters, giving the Winter's gale free leave to thunder into the room. You see the knives on the walls start to rattle. From the ceiling, a raven drops down into your field of vision, as dark as the abyss, and looking at you with a gaze containing the depths of Tartarus. \n\n\nTendrils of ice grasp at your mind, and the weakness in your knees starts to return. With your heart pounding in your throat, you cannot but stare at this winged shadow. Suddenly, it flies towards you. Its hypnotic spell broken, you feel control over your limbs returning to you. As quick as you can, you open the kitchen's door and run back to the living room. The raven, however, continues to pursue you with amazing speed, and you run through the room until you are back in the hallway, pulling the door closed behind you, and holding it closed with all your might.", "action_results": [{"action": "Continue...", "result": "Only when your knuckles start to turn white, and the cool, brass doorknob is warm and slippery from your sweaty hands, you dare to let go. The hallway looks as desolate as when you last set foot in it, the portraits of your ancestors still staring at you with icy intent.\n\n\nBehind you, in the living room, you can hear the sound of breaking glass, and, moments later, you hear the same sound upstairs, in your library. That beast, that demon who has been your tormentor this entire evening, is surely there. Yet despite your fear, even despite your curiosity, you feel compelled to go upstairs. An icy grip envelops your heart, and practically drives you to move up the stairs, and enter your library. \n\n\nYet, a shimmer of defiance is still present within the foggy depths of your mind. A rational fear, a fear of everything inside your house, everything you've encountered this evening. Though the staircase looms in front of you, you are aware of the large, oaken front door behind you. Why should you stay in this house of sadness and fear? Why would you give in to the demons that are tormenting you, while an option of freedom is so close within your reach? \n\n\nThe icy grip of fear still firmly holding your heart, your knees trembling at the thought of even setting one more step, you finally make a decision to... ", "action_results": [null, {"action": "go to the library.", "result": "You rest your trembling hand on the doorknob of the library for a moment. Doubting if you should continue down this path, yet curiosity, and an irrational desire to go to your library, make you open the door nonetheless. \n\n\nA cold wind blows towards you when you do so. From the corners of your eyes, you can see the shattered windows and their splintered shutters lying aimlessly, broken on the library floor. At the other end of the room, you can see the portrait of Lenore, glaring sadly at you. However, in the centre of your library, standing near the cold remains of the embers in your hearth, stands Lenore herself. Illuminated by a soft, yet pallid light that seems to emanate from her, she looks as beautiful as she was in her life, yet a ghostly pallor seems to dwell beneath her beauty. A scowl lies upon her tear stained face. \n\n\nAt the sight of your lost love, you stand frozen within the darkness of the library. You try to speak, but you can't seem to open your mouth. Lenore steps towards you, and lays a single, pale finger upon your lips. Scornfully, she speaks to you: 'Shhh, be silent, my love. You do not yet need to speak. Not after what you did.'\n\n\n'Lenore!' You exclaim, regaining the movement over your body, wresting Lenore's hand from your mouth. 'Lenore, please forgive me. I was a fool, I know. I know I mistreated you, but please, I beg you, forgive me.'\n\n\nLenore laughs, a hollow, dreadful laugh that echoes across the library. 'Forgive you? You're begging me? How could I ever forgive you for what you've done? You poisoned me! You killed me, because your own jealousy got the better of you. How could I ever forgive you? I dedicated my life to you! You were my everything, my eternal love. And you betrayed me, even as you accused me of doing the same. How did it feel, when you lowered my cold, lifeless body into the ground? Did you finally see the truth?'\n\n\nTears roll down your face, and with a trembling voice, you answer the spirit of your lost love: 'I did. God knows I did. I know I was wrong to suspect you of cheating, I know I was wrong to treat you like I did. When I... When I buried you, I was overcome with guilt, with grief, with loss. These past months, you were the only thing on my mind. Your loss haunts me wherever I go. I am forever sorry that I have betrayed you.'\n\n\nA scornful, wrathful look passes over the ghastly pale face of Lenore. 'Mark my words, you lowly worm. I will never, never forgive you. You can plea, you can beg all you want, but I will never stop haunting you. Wherever you go, no matter how far you run, my shadow will be hunting you. I will never let you forget your guilt.'\n\n\nAnd with those words, Lenore disappears forevermore. You are left alone in your library, amidst the snowflakes whirling around you, and the pale light of the Winter's moon slowly returning from behind the clouds. You fall to the floor in despair, tears dropping down on the hardwood floor. Through the haze of tears and despair, you once more look around at your forsaken library. ", "action_results": [{"action": "Continue...", "result": "Your library lies forsaken in the pale light of the winter's moon. The hearth's fire died, your tome cracked and spineless on the frozen floor. Soft snowflakes dance around the pallid bust of Pallas high above your chamber door. You take one last look at the painting of Lenore. Your dear, sad, lost Lenore. You wonder how long it will remain here. \n\n\nTreading softly on the broken glass, you grip the shattered shutters, the broken bones of your dying house. Winter grips your throat with his icy fingers. As far as you can look, the landscape is covered, softened by a blanket of white snow. Apart from the howling of the wind, only silence dwells in the deserted landscape. \n\n\nBeneath your bare feet, the splintered wood scratches and claws at your pale flesh. The broken bones leave splinters in your palms, a parting gift. You let go. Weightless, you take one last look into the dark abyss. In the distance, a shadow glides over the horizon. Pale snow floats weightless beside you, guiding your way. Its thick blanket growing larger, approaching rapidly from within the darkness. Through the fog within your mind, Lenore appears below you, beckoning you, tempting, calling. Lenore. The name echoes for an eternity, before the silence sets in once more.", "action_results": []}]}]}]}]}]}]}]}]}, {"action": "Scared, yet inquisitive, you approach the energetic door.", "result": "With every step you take the rattling gets louder, yet carefully, step by step, you shuffle to the door. Small clouds of dust erupt from the carpet with every carefully placed step, leaving behind a fleeting echo of your path through this endless void. A floorboard creeks as you walk across it, its thundering sound resonating off the windowless walls, mingling together with the ghastly rattling.\n\n\nFinally, with your heart pounding in your chest, you reach the door. Even up close you can't see what's moving the knob, or what's tapping the door. Filled with fear and bursting with anxiety you extend your trembling hand towards the door. The closer you get, the louder the noise gets. But then, just as your clammy skin touches the cool brass, the noises stop altogether and a deadly silence falls over the shadowy hallway.\n\n\nYou once more feel an ominous tingling at your neck, as if the shadows themselves are massing behind you, waiting for an opportunity to strike, and... You don't want to finish that thought. However, you can't help feeling that whatever's behind that door, you won't like it. Alone in the dark, you try to decide if you'd better...", "action_results": [null, {"action": "or brave your fears and enter the chamber.", "result": "Taking a deep breath, you open the door. Tendrils of dust shine palely in the light of the full moon. A cold wave flows out of the room.\n\n\nAs your gaze wanders across the room you see old furniture: a bed, a dressing table, some chairs and a small table, all cracked and worn with age, hidden poorly beneath an ancient layer of dust. Something about the sight of these old objects in the pale moonlight chills your spine, but what's most of all noticeable is the silence. No tapping, nor rapping fills the air, and the house, who's ceaseless creaking and cracking has accompanied you for whole your life, has fallen silent, as if in a deep sleep.\n\n\nSuddenly the air grows denser, as if perfumed by an unseen censor and before your mind's eye the room transforms, shaking of the years of neglect as if they were just a coat, ready to be taken off. Bright sunlight fills the room, bathing it in a golden glow. A woman sits at the dressing table, coming her hair with a bone comb. She's startled when she notices you standing in the doorway and with a teasing smile she speaks to you: 'What are you doing here, you know I don't want you to see me like this, I haven't even powdered my face yet.'\n\n\nYou sit down on the corner of the soft bed, the woman's warmth still radiating softly from within the thick sheets. Smiling back at her, you say: 'Ah Lenore, you know I'll always love you, even if you're hideous looking, like you are right now.'\n\n\nWith played indignation Lenore jumps up from the dressing table and throws herself at you. Laughing, she pushes you further unto the bed and starts hitting you with a pillow. 'So I'm hideous, am I? Well, look at you, you know pillow feathers don't suit you.'You can't control your laughing while this lovely woman is hitting you with a soft, white pillow.\n\n\nCAW CAW CAW\n\n\nYour dream is cut short by the cry of a bird, and a cold wind sweeps trough the room, driving away your memories of a warm summer's day and bringing you back into the bleak December.", "action_results": [{"action": "Continue...", "result": "A chilling wind passes through the room, stirring dust and snow alike and blinding you with it's icy tendrils. Then you notice a window pane has cracked, opening the room to the elements. The grey, ripped curtains around it billow and wave as if they're the sails of some ghostly ship. As you approach the window to inspect the damage, that sound, that ghastly, gut-wrenching sound that awoke you from your memories, sounds once more.\n\n\nCAW CAW CAW\n\n\nSuddenly other window panes start cracking one by one as the cawing continues. A shiver runs up your spine and your ear drums feel as if they are about to burst because of this dreadful noise. You feel madness and desperation bubbling up in your brain as this noise continues to torment you for an eternity.\n\n\nBut then, like snow before the summer sun, the sound disappears, leaving the room in an eery silence. As you slowly regain your senses, you notice you are kneeling down on the ground. You have no idea when or how you got in that position and when you stand up, you notice a sharp pain in your knee, as if you've recently fallen. However, as your heart slowly regains it's normal speed, a shadow flies past the window, too fast for you to register any tangible about its shape.\n\n\nCAW CAW CAW\n\n\nThe windows shatters completely and the icy winter winds storm into the room with an almost feral ferocity, screaming and shrieking as they drag the various ornaments in the room along with them. This sudden assault of snow and wind is too much for you to manage and you flee towards the door. You manage to grab hold of the doorknob, just as a snuff box hits you in the back of the head. Yet though your head is throbbing, you manage to turn the icy doorknob and escape through the door.\n\n\nCAW CAW CAW\n\n\nAs you close the door, that ominous sound is heard once more. However, this time it sounds as if it's mocking you, as if it knows your dark secrets, and exposes you for the coward that you are.", "action_results": [{"action": "Continue with a pounding heart...", "result": "You are once more standing in the hallway, panting and gasping heavily. Those sights, those sounds you encountered in that dreadful room have chilled you to the bone. The cold you are feeling now, however, does not solely originate from those experiences.\n\n\nThe hallway, that dark and dreadful abyss has visibly changed. The dance of dust and shadows continues once more as a chilling wind blows through the ancient house. Small puffs of mist erupt from the frozen carpet as you carefully step into the darkness.\n\n\nYou suddenly step into a pool of water that is emerging in the carpet. Feeling your balance shift you grasp at the wall, trying to regain your composition. How you wish you wouldn't have. As soon as your hand touches the flaking wallpaper a shriek pierces the house, a soul-shattering female voice, sending a chilling wind through the empty corridor.\n\n\nYour spirit sinks into the darkest depths as you run through the hallway, both body and mind thoroughly chilled. As you reach the door of the library, a soul-piercing wail shakes the walls and floors of the sleeping house. Gathering your last ounces of bravery, you creep towards the landing. But as you reach the top of the stairs, a wail erupts once more below you, sadder and louder than before. Trembling from your head to your toes, you decide to...", "action_results": [{"action": "retreat to the library.", "result": "With your heart pounding in your chest, you pull the doors of the library closed behind you. That ghastly noise, those ghostly images have taken their toll of your mind. You are scared, you don't want to admit it, but you are scared. Your knees are trembling, your heart pounds inside your chest. Icy tendrils of fear try to worm themselves even further into your mind. \n\n\nWell, not only in the philosophical sense. As you manage to regain your composure a bit, you look around you. The library is cold, the embers in the hearth having died down. As snowflakes lazily drift past your eyes, you direct your gaze at the shutters in front of your windows, that are supposed to keep the dark winter outside. \n\n\nAnd there, on the floor, in front of the hollow framework that was once your window. You see the shattered remains of your shutters, lying broken in a pile of wood and glass. You sigh, having at least found an explanation for the chills running up your spine. 'Ah, as even the titans of old slowly withered with age, so too this house must once fall apart. I only wish it chose a better season to do so...'\n\n\nAnd so you get up to clear away the remains of your dying house. But when you look closer at the wooden library floor, you notice something else, drifting in the snowy winter gale: a single feather, as black as the darkest night. \n\n\nCAW CAW CAW \n\n\nYour heart misses a beat at that ominous sound. You feel your spine tingling, writhing beneath your skin, as if the cold, winter's air has penetrated your very being. The flutter of wings sound above you, shifting rapidly from corner to corner within the shadows of the ceiling's darkness. As you gaze around you, you feel a further shift in the library's atmosphere. The large bookcases, guardians of ancient wisdom, now loom towering over your feeble self. The purple curtains by your windows, now silken sadly, uncertainly rustling in the icy breeze, fill your soul with an illogical terror, the likes you've never felt before. Above the mantle, the portrait of your love, ever soothing your restless soul, now stares at you with icy eyes, never breaking their attention. \n\n\nCAW CAW CAW\n\n\nThat sound. That ominous, dreadful, mind-shattering sound that has been tormenting you, has returned. Even while covering your hands with your ears you cannot bar its dreadful echoes from your mind. Feeling the tendrils of madness tugging at the fringes of your soul, you despair. Why has this demon come to torment you? Is beast or devil flying around, lurking, luring you to the black abyss? \n\n\nCAW CAW CAW\n\n\nThere it is again, clawing at your mind. Within the iron cage of your mind's despair, you barely register yourself falling to the floor. As the fog of madness starts to cloud your vision, you catch the last fleeting sensations of your surroundings. The hardwood floor beneath your knees. Icy snowflakes now turning your hair white. The tome your were reading now lying broken, spineless beside you. And high above you, the portrait of Lenore. \n\n\n...\n\n\nLenore? \n\n\nFrom within the ruins of your mind, a light glimmers. That name, Lenore, wakes something within you. A longing. A deep, insationable longing, fringed with sadness and desolation. Gathering the broken remnants of your mind, you focus on that image. That ghostly, sad, and shining image of your long abandoned love. Feeling a faint shadow of strength returning to your mind, you turn to your surroundings once more. Your library, your broken sanctuary, now defiled by that dreadful shade. In the corner of your eye, you see the painting of Lenore, smiling sadly, yet looking harshly upon you in the cold, winter's light. \n\n\nCAW CAW CAW \n\n\nThis time your were expecting it, this time your were prepared. And when that dreadful sound assaults your senses once more, you feel...", "action_results": [{"action": "a cold, soul-shattering despair entering your very being.", "result": "You were prepared for it, you truly were. Or at least you thought you were. Yet you now find yourself face-down on the ground, crying bitter-cold tears. The embers in the hearth, the dancing shadows on the floor, all fade away as the cold winter's night creeps into your fallen sanctuary. As swiftly as it appeared, a shadow flew through the shattered window, leaving the ancient house for evermore behind it. \n\n\nNot that you really noticed it, that is. No, you have retreated back into the deepest recesses of your mind, the fog of insanity clouding your vision, creating a maze of your own emotions. You cannot find your way out, you do not know where you are. In that dark, lonely despair, your only companion is yourself, and your own thoughts. Though you could swear you heard distant, taunting laughter every once in a while. A bird, shrieking its mocking song in the distance. \n\n\nHow long you have been here, you do not know, nor how long you'll stay. You are outside of time. Past, present, perhaps your future, all shoot past your mind's eye, yet never of your own volition. Only once, in that deep, dark pit of despair, have you seen a glimmer of hope. Once, you saw a woman in white, a fleeting glimpse of a life that could have been, that should have been. Yet you fear that, in this dark forsaken place, even she will visit never- nevermore. ", "action_results": []}, {"action": "a shining defiance, the likes you've never felt before.", "result": "'Come on then, wretch!' You answer, 'Bird, or beast, or restless devil! Come forth from your wretched darkness, and show your countenance to your prey!'\n\n\nCAW CAW CAW \n\n\nIcy tendrils grasp at your mind's defences, yet you continue on unfaltering. 'Show yourself you graceless demon! Come on forth, your prey is here! Why do you cower in the shadows, is the light too much to bear? Ceaselessly you have tormented, cast your shadow upon my soul. Yet I shall give you no more token, leave your shadows, I implore!'\n\n\n'Nevermore.'\n\n\nFrom the shadows a voice rung out, clear as water, yet creaking like ice. A rain of feathers, black like the darkest abyss, falls down from the darkness above you. Slowly, swiftly, you hear something shifting above you, until suddenly, a shadow emerges on the placid bust of Pallas high above your chamber door. A raven, black as night, looming on its elevated perch, gazing ominously into your very soul. A raven, a seemingly common raven, which yet stares into you with a soul-shattering intensity. \n\n\nFeeling your mind briefly falter under your visitor's gaze, you address it. 'There you are, you baseless heathen. Perched above my chamber door. Can you tell me what your name is on this night's Plutonian shore?' \n\n\nOnce more, that voice rung clearly, yet certain enmity it bore. With his piercing gaze unbroken, still above my chamber door, that ebon beast answered clearly, one simple word: 'Nevermore'. \n\n\nAgain, that singular word. Though still firmly unsettled, you cannot but feel intrigued by this winged messenger. Slightly amused, very much frightened, you address the bird once more: 'Tell me, oh saintly raven, of the region whence you came. Tell me of your master, who gifted such a singular name. How did you ever learn this, did you witness great a pain? Tell me of the grief which shall hold no more name.'\n\n\n'Nevermore.'\n\n\nHis eyes not shifting, nor his gaze relenting, perching placidly on the pallid bust of Pallas high above my chamber door, this beast, this demon answered only with that word, that singular word, that never- nevermore. A familiar feeling of dread overcomes you as you continue to stare into the black abyss of his gaze. Yet, that shining image of Lenore is still present in the back of your mind. \n\n\n'Beast or devil, work of evil! Vile demon you might be! Tell me if you know of one no longer here with me. Tell me if the saints and angels have the one that I adore. Tell me of the one I lost, my radiant Lenore.'\n\n\nQuoth the raven 'Nevermore'. \n\n\nStaring into the unblinking eyes of that shadowy prophet, you feel the last of your courage leaving your body. The shining image of Lenore slowly fading from your mind. Suddenly, in the blackness of the raven's eyes, you see the shimmer of a reflection, of the maiden you adore. Yet now, instead of hope, instead of defiance, it fills you with an overwhelming feeling of... ", "action_results": [null, {"action": "Guilt.", "result": "Seeing her, seeing Lenore like that. Seeing her reflection fringed by the dark abyss of the raven's eyes, brings back memories you so desperately tried to suppress. Unable to draw your gaze away from the raven's eyes, you feel yourself falling into their darkness. \n\n\nLenore.\n\n\nLenore.\n\n\n'Lenore!' You do not know where you are. The last thing you remember, the last thing burned into your mind's eye is the darkness of the raven's eyes. Yet you know you have not fallen down, at least not physically. \n\n\nBefore your mind's eye, a scene unfolds, one so vaguely familiar to you that you know you've experienced it before, yet one which you cannot place, nor remember correctly. You find yourself in a kitchen, looking at yourself, or at least a slightly younger version of you, not yet aged by deep sorrow, in a heated discussion with the one you immediately recognise as Lenore. You see yourself assuming a threatening stance, muscles tense as if preparing for a physical assault.\n\n\nYet you cannot see what happens as a fog obscures your vision, a fog so dense it blocks all senses, muffling every last detail. But you are not frightened. In fact, you feel relieved, as if inviting it into your mind, for you know how these events unfold. \n\n\nCAW CAW CAW \n\n\nThe fog lifts, and you once more gaze upon yourself in the kitchen. Lenore, however, has gone. In your hand, you spot a vial, filled with a clear liquid. Stirring into a pot with unknown contents, you slowly and deliberately empty the vial until there is not a single drop left. As your younger you finishes whatever he is preparing, you try to scream with all of your might. Try to prevent yourself from serving that meal, yet you know you cannot change what happens. \n\n\nCAW CAW CAW\n\n\nThe scenery changes once more, and you find yourself back in the bedroom from your earlier dream. A pale woman drowning in a sea of pillows, being comforted by an unknown man. However, this time you can see his face, it's you, the younger you. 'I promise my dear, I promise. I... I will never forget you.' A tear rolls down your face, both that of your ghostly image, and your own. \n\n\nThe memories, those blasted, long-repressed memories come rushing into your mind. The unreconcilable truth, your darkest secret. Your blame in your lover's death. All confront you in the naked light of your own mind's eye. You feel shattered, broken, torn apart by the gravity of your actions. A deep, dark pit in your innermost sanctum,that had been closed for many, many months, bursts open with renewed strength. \n\n\nCAW CAW CAW", "action_results": [{"action": "Continue...", "result": "You give up. You only realise it now, but you have already given up so very long ago. Glancing around you once more, you notice the raven has finally left. Softly shaking your head, as if to clear the cobwebs inside it, you wonder if he was even ever there. Your library lies forsaken in the pale light of the winter's moon. The hearth's fire died, your tome cracked and spineless on the frozen floor. Soft snowflakes dance around the pallid bust of Pallas high above your chamber door. You take one last look at the painting of Lenore. Your dear, sweet, lost Lenore. You wonder how long it will remain here. \n\n\nTreading softly on the broken glass, you grip the shattered shutters, the broken bones of your dying house. Winter grips your throat with his icy fingers. As far as you can look, the landscape is covered, softened by a blanket of white snow. Apart from the howling of the wind, only silence dwells in the deserted landscape. \n\n\nBeneath your bare feet, the splintered wood scratches and claws at your pale flesh. The broken bones leave splinters in your palms, a parting gift. You let go. Weightless, you take one last look into the dark abyss. In the distance, a shadow glides over the horizon. Pale snow floats weightless beside you, guiding your way. Its thick blanket growing larger, approaching rapidly from within the darkness. Through the fog within your mind, Lenore appears below you, beckoning you, tempting, calling. Lenore. The name echoes for an eternity, before the silence sets in once more.", "action_results": []}]}]}]}, null]}]}]}]}]}]}, {"action": "go back to sleep.", "result": "You shrug you shoulders in weary disregard: 'Tis probably the creaking and groaning of the house around me. That it is, and nothing more.' With the rapping softly fading, and the tapping soon receding you once more feel yourself falling, floating, into swift dreams' embrace.\n\n\nThe shadows on the floor, formless floating around the dying embers in the hearth, take on the forms of shades long since departed from this ancient house. In front of your mind's eye you find yourself in a bedroom, dimly illuminated by a roaring fire. Even though the wind is howling behind wooden shutters, you don't feel cold. Wandering around in the room, various items fleet past your eyes, too fast to focus completely, but slow enough to catch a glimpse: a dressing table, a snuff box, a bone comb, a fan, peacock feathers on a lady's hat, all fly past your mind's eye. Then, finally, your eye rests on an unexpected, intimate scene. \n\n\nIn a corner of the room, drowning in a sea of pillows and blankets, lies a woman in her bed. Her pale skin and hollow eyes give her the appearance of one already dead. She feebly raises her hand towards a man sitting next to her. However, as he falls just outside the circle of light, cast by the now slowly dying fire, you are unable to make out his features. \n\n\n'Promise me. Please promise me you won't forget. Promise me you'll CAW. Promise CAW. P... CAW'\n\n\nThe scene before your eyes swiftly changes. The fire dies and the figures fade into darkness. The howling wind now turning even more violent as it beats and batters the cracking wooden shutters. \n\n\nCAW CAW CAW   CAW CAW CAW   CAW CAW CAW\n\n\nThe tempest slowly but surely begins to rage indoors as well. From within the growing darkness an icy cold grabs hold of you. You scream, but you still feel yourself getting frozen in place, icy tendrils enveloping your faltering heart. Then, with a thundering crack, the shutters in front of the window give way. ", "action_results": [{"action": "With a jolt you break free from dream's cruel embrace...", "result": "Wildly flailing and heavily breathing, you find yourself upright in your chair. Quickly blinking, as to expel the image still lurking on your mind's eye, you manage to recompose yourself. And then you notice it: the dry, bone-chilling cold that haunted you in your dream. As snowflakes lazily drift past your eyes, you direct your gaze at the shutters in front of your windows, that are supposed to keep the dark winter outside. \n\n\nAnd there, on the floor, in front of the hollow framework that was once your window. You see the shattered remains of your shutters, lying broken in a pile of wood and glass. Sighing with relief you realise that that probably was the reason why your dreams turned sour. 'Ah, as even the titans of old slowly withered with age, so too this house must once fall apart. I only wish it chose a better season to do so...'\n\n\nAnd so you get up to clear away the remains of your dying house. But when you look closer at the wooden library floor, you notice something else, drifting in the snowy winter gale: a single feather, as black as the darkest night. \n\n\nCAW CAW CAW \n\n\nYour heart misses a beat at that ominous sound. You feel your spine tingling, writhing beneath your skin, as if the cold, winter's air has penetrated your very being. The flutter of wings sound above you, shifting rapidly from corner to corner within the shadows of the ceiling's darkness. As you gaze around you, you feel a further shift in the library's atmosphere. The large bookcases, guardians of ancient wisdom, now loom towering over your feeble self. The purple curtains by your windows, now silken sadly, uncertainly rustling in the icy breeze, fill your soul with an illogical terror, the likes you've never felt before. Above the mantle, the portrait of your love, ever soothing your restless soul, now stares at you with icy eyes, never breaking their attention. \n\n\nCAW CAW CAW\n\n\nThat sound. That ominous, dreadful, mind-shattering sound that has been tormenting you, has returned. Even while covering your hands with your ears you cannot bar its dreadful echoes from your mind. Feeling the tendrils of madness tugging at the fringes of your soul, you despair. Why has this demon come to torment you? Is beast or devil flying around, lurking, luring you to the black abyss? \n\n\nCAW CAW CAW\n\n\nThere it is again, clawing at your mind. Within the iron cage of your mind's despair, you barely register yourself falling to the floor. As the fog of madness starts to cloud your vision, you catch the last fleeting sensations of your surroundings. The hardwood floor beneath your knees. Icy snowflakes now turning your hair white. The tome your were reading now lying broken, spineless beside you. And high above you, the portrait of Lenore. \n\n\n...\n\n\nLenore? \n\n\nFrom within the ruins of your mind, a light glimmers. That name, Lenore, wakes something within you. A longing. A deep, insationable longing, fringed with sadness and desolation. Gathering the broken remnants of your mind, you focus on that image. That ghostly, sad, and shining image of your long abandoned love. Feeling a faint shadow of strength returning to your mind, you turn to your surroundings once more. Your library, your broken sanctuary, now defiled by that dreadful shade. In the corner of your eye, you see the painting of Lenore, smiling sadly, yet looking harshly upon you in the cold, winter's light. \n\n\nCAW CAW CAW \n\n\nThis time your were expecting it, this time your were prepared. And when that dreadful sound assaults your senses once more, you feel...", "action_results": [null, {"action": "a shining defiance, the likes you've never felt before.", "result": "'Come on then, wretch!' You answer, 'Bird, or beast, or restless devil! Come forth from your wretched darkness, and show your countenance to your prey!'\n\n\nCAW CAW CAW \n\n\nIcy tendrils grasp at your mind's defences, yet you continue on unfaltering. 'Show yourself you graceless demon! Come on forth, your prey is here! Why do you cower in the shadows, is the light too much to bear? Ceaselessly you have tormented, cast your shadow upon my soul. Yet I shall give you no more token, leave your shadows, I implore!'\n\n\n'Nevermore.'\n\n\nFrom the shadows a voice rung out, clear as water, yet creaking like ice. A rain of feathers, black like the darkest abyss, falls down from the darkness above you. Slowly, swiftly, you hear something shifting above you, until suddenly, a shadow emerges on the placid bust of Pallas high above your chamber door. A raven, black as night, looming on its elevated perch, gazing ominously into your very soul. A raven, a seemingly common raven, which yet stares into you with a soul-shattering intensity. \n\n\nFeeling your mind briefly falter under your visitor's gaze, you address it. 'There you are, you baseless heathen. Perched above my chamber door. Can you tell me what your name is on this night's Plutonian shore?' \n\n\nOnce more, that voice rung clearly, yet certain enmity it bore. With his piercing gaze unbroken, still above my chamber door, that ebon beast answered clearly, one simple word: 'Nevermore'. \n\n\nAgain, that singular word. Though still firmly unsettled, you cannot but feel intrigued by this winged messenger. Slightly amused, very much frightened, you address the bird once more: 'Tell me, oh saintly raven, of the region whence you came. Tell me of your master, who gifted such a singular name. How did you ever learn this, did you witness great a pain? Tell me of the grief which shall hold no more name.'\n\n\n'Nevermore.'\n\n\nHis eyes not shifting, nor his gaze relenting, perching placidly on the pallid bust of Pallas high above my chamber door, this beast, this demon answered only with that word, that singular word, that never- nevermore. A familiar feeling of dread overcomes you as you continue to stare into the black abyss of his gaze. Yet, that shining image of Lenore is still present in the back of your mind. \n\n\n'Beast or devil, work of evil! Vile demon you might be! Tell me if you know of one no longer here with me. Tell me if the saints and angels have the one that I adore. Tell me of the one I lost, my radiant Lenore.'\n\n\nQuoth the raven 'Nevermore'. \n\n\nStaring into the unblinking eyes of that shadowy prophet, you feel the last of your courage leaving your body. The shining image of Lenore slowly fading from your mind. Suddenly, in the blackness of the raven's eyes, you see the shimmer of a reflection, of the maiden you adore. Yet now, instead of hope, instead of defiance, it fills you with an overwhelming feeling of... \n\n\n \n\n ", "action_results": [null, null, null]}]}]}]}