{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=7094", "context": "", "first_story_block": "It was a normal Saturday afternoon in Boston, Mass. you got up from your couch to grab a diet coke. You also heated up a leftover Hot dog from the fridge on your way to getting a diet coke. While you are waiting for the hot dog to finish heating up. you get a call. You pick it up, and hear a annoying voice. \"Listen we need alot of help\". \"We need you\" \"Were Drafting you into the army\". Your shocked. But you have to do what you need to do to save the U.S. Meet me by the Shooting Gallery\" He said. \"See you tomorrow \". He says \"Bye\". That night you got 3 hours of sleep thinking about what could happen in your future life.", "action_results": [{"action": "Choose your Gun", "result": "A long drive to the Shooting Gallery is getting you really nervous.But you gear up to start shooting in the army. you get there 5 minutes later. When you got there you saw a set of different guns. There is a Assault rifle, and a Heavy Machine Gun, a Semi-Automatic Rifle, a Shotgun, a Sniper rifle, and finally a Submachine Gun. which one to take. Since you are right now at the New Man in the army.\n\n\n                                              ", "action_results": [{"action": "Assault Rifle", "result": "As you Pick up the Rifle, you almost drop it, because you get so nervous. There is a big Target for Newcomers. It is 4 feet by 5 feet. You are trembling, and are not sure how long you can hold your balance for .The target looks like1 foot, by 2 feet. You should wait, and shoot, but your not sure how long you can hold it for. Your boss is getting very impatient with how long your taking.", "action_results": [{"action": "Wait, then shoot the target", "result": "It  took to long, and you give up on that gun, maybe you just not made for that gun.\n\n\n\n                                                            ", "action_results": [{"action": "A Heavy Machine Gun", "result": "The large body you have can't even hold the Heavy Machine Gun. It is huge, and heavy. But it shoots so strong. You see a 4 feet by 5 feet target. Will you shoot it,remember it's your first time shooting,a nd you don't know where to shoot it, you can put the gun's end side up at your throat, and shoot the target, or you can Put it by your Stomach. Where will be better to shoot it. you think of.\n\n\n\n\n                              ", "action_results": [{"action": "Shoot it by the Throat", "result": "BINGO, you got a perfect shot right on target. \"Nice aiming.\" Your boss tells you, I like where you positioned your gun, good job. This is your new gun for starters.\" \"Now next week I'm going to need you in Iraq, we need your help\". You gulp as he continues talking, \"and we will need you for the most important part. The shooting.\"", "action_results": [null, {"action": "During The week", "result": "It's two days before the trip to Iraq. Your packing up and you find a picture of your grandfather in WWI, and you pack that up to remember him with while your in the war. you look forward to the war. But as you are packing it up you get a knock on your door. So you answer it. It's your best friend Kevin. He's been watching you shoot, I'm very proud of how you hold the Heavy Machine Gun,  and shoot it. good luck in the war he wishes you. You say goodbye. The next two days went really quickly, and as you woke up on 5.:30 on Saturday, you got up for your big day.\n\n\n\n ", "action_results": [{"action": "Meeting the other Army Members", "result": "After a long 45 minute drive. You felt the Jitters of starting your fist day in the army. As soon as you car pulled up to the Lot where everyone was meeting. your Boss introduced you to everyone. Here is the man who can hold the Assault Rifle. You hand-shock everyone on the army, and you went on the plane one by one. The pilot took off, and you had a few minutes to chat. So you did.\n\n\n\n ", "action_results": [{"action": "During the chat", "result": "One of the top Army men came up to you on the plane ride through the West Coast of the U.S.A., he though you were a punk, and challenged you a Fist fight. If you win this fight, you can earn 5 EXP points. Will you accept the mans challenge or decline it?", "action_results": [{"action": "Accept it", "result": "\"So Your a newbie, and you want to mess with me.\" This older Army Man said, and he came charging at you. It's easy you think, and you think of two quick choices. 1. You can move and let him go flying, or 2. Trip Him.", "action_results": [{"action": "Move, and let him go flying", "result": "\"ARGH\" He says as he comes charging, as he does you move, and he tries to turn around, but sadly enough he slips, and his 265 Pounds of Weight falls, he is hurt,and you showed hi who is boss, 5 EXP points.\n\n\n\n\n\n  ", "action_results": [{"action": "The end of the Trip", "result": " \nYou get to Iraq, and you walk out onto the land. Silently you whisper to your other Army Friend. 'This is crap.\" You have a long talk and stupidly you got lost in the middle of Iraq. 'Wow\" you say as it's just you, and your new friend Mike. You arm yourself with whatever weapon you chose, and so does Mike. From a distance you hear a scream, and you run to where you can hear the scream to see a women in her 20's dead. She is from Iraq. So you don't really understand why she was shot. Then two Iraq men come up to you with plenty of guns, and they point it at you. Put your guns down they scream in English. So you hear what they say. But maybe you'll act like you will put it down.\n\n\n\n\n ", "action_results": [{"action": "Act like it", "result": "It always works best when you Act like it. You are putting it down slowly. So will you suddenly Shoot, or wait then shoot a couple of seconds late.", "action_results": [null]}, {"action": "Do it", "result": "They try to shoot you, but suprisingly their guns were out of ammo, Now is your chance. time to shoot! They plead to let them go, they say they won't hurt you.", "action_results": [null, {"action": "Let them go.", "result": "That was worthless Mike says to you as you walk away. so you begin your journey,after a 15 minute look you find him. While your talking to him a group of 3 Terrorists matched your amount of army men, they told you shoot if you dare, but you will regret it. It would be smart to do what you think is best, so do what you think is best.", "action_results": [{"action": "Shoot them", "result": "Two of them got shot, but one of the smarter ones escaped as you pulled the trigger. He ran, and hid somewhere. Probably somewhere behind a old gun store, if he is there you have to be careful. VERY CAREFUL! Where will you look for the man that's hiding", "action_results": [{"action": "Behind the gunstore", "result": "There he is.You scream as you spot him. Mike, and the Leader now reveled as Mark Gety came with there guns You have all three up to his face. Just finish it up by shooting him. Thank you, have a nice day.", "action_results": [null]}, {"action": "In a hole", "result": "A Quick look for you finds nothing as you still need to find where he is.", "action_results": [null]}, {"action": "Behind a very big Rock", "result": "Maybe he was hiding there. That was your thought as you nervously looked. Wow you were surprised when you saw that he wasn't there. Where else could he hide you thought in Fustration. Hmmm......", "action_results": [null]}]}, {"action": "Don't shoot", "result": " \nThey laugh, and grab you, and they threaten to kill you if you don't tell them where the Army Men are getting all the weapons to kill the Iraq's are? How they get so strong? They said if you don't give them a half-Ass Answer, they will kill you. You,and Mike Don't even want to answer.Because Remember you still have a gun. Will you use it, or answer the Question?", "action_results": [null, {"action": "Answer the Stupid Question", "result": "I will tell you that they eat veggies, that is how they get so smart to do that stuff. The Iraq's are so stupid that they believe what you say. They let you go. But you don't want to go without getting revenge .It's your choice either let them watch you walk away. Or Shoot them. It's your choice Mike said to you.", "action_results": [null, {"action": "Let them watch you", "result": "As you start walking. You see they have there eyes on you. When you don't expect it you get hurt. Shot with a bullet in the Leg. Your leg starts bleeding. But you are worried about your future. The Leader who is nameless to you starts running ahead of you,and Mike for some help. He told you you need to deal with the pain, at the same time he said that Mike got shot in the Left Leg. You have the choice to either Run with and deal with the pain. Or you can stay right there.", "action_results": [{"action": "Deal with the Pain", "result": "You limp and get out of the area of where they were. After a 7 minute limp, The Leader Now reveled as Mark Jety tells you to hold on, he soon came back and brought you in the Hospital run by the Army Members. They help you recover, and after a 1/2 hour. Your better. As soon as you came out you saw Mike also feeling better. Well now that your better time to get to the Real War Area", "action_results": [{"action": "Get Into The Real War Area", "result": "Now comes the real hard part. As you head to the main battle area, about 75 Army Men are resting. After a long talk with them they seem to enjoy talking to you. But it's back to work, and as you put your weapon on you  the Men tell you to follow them. They give you a pair of Bonachuras to look through, and you see a Iraq man making a special kind of gun. Your other fellow Army Men told you to go first,and shoot since they were tired from working for 4 1/2 hours hard too. Will you listen to what they said or do something else you want to do.", "action_results": [{"action": "Listen to them", "result": "So since you are a nice person. You run forward, and point the gun at them when you aren't noctiable. But you are very far away. Will you move forward a foot to get a better shot or just shoot from a distance.", "action_results": [null, {"action": "Shoot from a far distance", "result": "You missed and your shot was heard everywhere. Twenty Other people came over, and saw you alone. They showed a gun and pulled the trigger. You closed your eyes as the bullet came. Your life was over. Or was it.... The Army Man that asked you to help him out, who was Mike in a different Costume has took the shot, at that same second There were gunshots everywhere so you ran out of the area while you got the chance.", "action_results": [{"action": "In another spot", "result": "Your final mission starts here .Your Leader. Mark Gaty tells you, You must find the Man that is In charge of the Guns. He is in one of the following places. The Gunstore, the Drug Store, the Two small Houses, or a Hole.", "action_results": [{"action": "The gunstore", "result": "Hello you kept screaming, until you saw a Litlle blue cloth. Looking over at the Other side of the Store you saw him. He was making guns, and he had alrready made 2, and showed them in your face. Use all your guns if you have more then one. If not then just use one gun.", "action_results": [null]}, {"action": "The Drug Store", "result": "As you check the area. You don't find anything except for a AK-47 Gun. This could be helpful for your final battle.", "action_results": [null, null]}, {"action": "Two Small Houses", "result": "Looking around two small houses you found nothing. Only a broken piece of wood. What good would that do? so you move on.", "action_results": [null]}, {"action": "A Hole", "result": "What could be in a hole, nothing. So you have to look somewhere else now.", "action_results": [null]}]}]}]}, {"action": "do your own thing", "result": "Of course you tell them that your not doing it. BUT your not sure what to do. Your standing there thinking about what to do. What will you do?", "action_results": [{"action": "Walk away, and shoot someone else", "result": "After Walking Away for 20 minutes. There calling your name , but your ignoring. Well you run into a Iraq Man, he tells you get away or die. So You will listen or Die. He says. You have the choice to listen or not.", "action_results": [{"action": "Don't bother Listening", "result": "He says you may kill him and you thought that was weird, but what the heck. Why not eliminate all the Iraq's in the world.", "action_results": [{"action": "Use the Gun", "result": "That's enough. Is all you have to say. As you head back toward the Army Area, and you rejoin the Army Men in a group. they tell oyu now you must listen to them or that is it.", "action_results": [null]}]}, {"action": "Listen", "result": "He doesn't say anything, and you Show Him the gun. You may use it he says.", "action_results": [null]}]}, {"action": "Just stand there", "result": "It doesn't last long as they pull you over to tell you to listen, now you have no choice. You have to listen to what they say.", "action_results": [null]}]}]}]}, {"action": "Stay in the same area", "result": "You started to get shot twice, three times, then a fourth. You should have tried to run with the pain Is Mike's last  words as he runs away with the hurt leg.", "action_results": []}]}]}]}]}]}]}]}, {"action": "Just Trip him.", "result": "OH shit he says as you trip him. His 265 Pounds of Weight falls, and he looks like he hurt his Back. Well you won, and you've won 5 EXP points.\n \n\n\n\n     ", "action_results": [null]}]}, {"action": "Decline it", "result": "That is the punk you are\" he kept repeating as he walked away. You didn't show him who was boss.\n\n\n\n\n   150 EXP Points to Stage 2", "action_results": [{"action": "The end of the trip", "result": "You get to Iraq, and you walk out onto the land. Silently you whisper to your other Army Friend. 'This is crap.\" You have a long talk and stupidly you got lost in the middle of Iraq. 'Wow\" you say as it's just you, and your new friend Mike. You arm yourself with whatever weapon you chose, and so does Mike. From a distance you hear a scream, and you run to where you can hear the scream to see a women in her 20's dead. She is from Iraq. So you don't really understand why she was shot. Then two Iraq men come up to you with plenty of guns, and they point it at you. Put your guns down they scream in English. So you hear what they say. But maybe you'll act like you will put it down.\n\n150 EXP Points to Stage 2", "action_results": [null, null]}]}]}]}]}]}, {"action": "Shoot it by the stomach", "result": " \nThe shot hits the floor, and you feel really crappy, but remember you still have other guns. So there has to be one gun that fit's your style.", "action_results": [null, {"action": "A Semi-Automatic Rifle", "result": " \nA big heavy gun. That what your thinking as you pick up the gun. Your able to manage the gun, but for how long? will you shoot now or wait to hit your target, take your time and shoot? It's all up to you.\n\n\n\n                                                ", "action_results": [{"action": "Shoot right away", "result": "You manage it, it worked. you hit right in the middle of the target. But you get very nervous as you hear your boss say. Next Week you will have to complete my missions I give you in Iraq.\n\n\n\n\n\n                                                               ", "action_results": [null, {"action": "During The Week", "result": " \nIt's two days before the trip to Iraq. Your packing up and you find a picture of your grandfather in WWI, and you pack that up to remember him with while your in the war. you look forward to the war. But as you are packing it up you get a knock on your door. So you answer it. It's your best friend Kevin. He's been watching you shoot, I'm very proud of how you hold that Semi-Automatic Rifle,  and shoot it. good luck in the war he wishes you. You say goodbye. The next two days went really quickly, and as you woke up on 5.:30 on Saturday, you got up for your big day.\n\n\n                                                                      ", "action_results": [null]}]}, {"action": "Take your time to shoot", "result": "The gun can't be held too much by a newbie. So you drop it, and decide to try out a new one.", "action_results": [null, null, {"action": "A Shotgun", "result": "The Shotgun was very easy for you to hold. What will you do to shoot?\n\n\n\n\n\n                                              ", "action_results": [{"action": "Shoot right then and there", "result": "The shot was right on target. That became your new gun as you loved the way it shot bullets. But you didn't love what your boss told you saying that you will have to complete missions in Iraq. That got you really nervous. He told you to meet with him Next Week.", "action_results": [null, {"action": "During the Week", "result": "It's two days before the trip to Iraq. Your packing up and you find a picture of your grandfather in WWI, and you pack that up to remember him with while your in the war. you look forward to the war. But as you are packing it up you get a knock on your door. So you answer it. It's your best friend Kevin. He's been watching you shoot, I'm very proud of how you hold the ShotGun,  and shoot it. good luck in the war he wishes you. You say goodbye. The next two days went really quickly, and as you woke up on 5.:30 on Saturday, you got up for your big day.\n\n\n\n\n                                                                 ", "action_results": [{"action": "Meeting The Other Army Members", "result": "After a long 45 minute drive. You felt the Jitters of starting your fist day in the army. As soon as you car pulled up to the Lot where everyone was meeting. your Boss introduced you to everyone. Here is the man who can hold the Assault Rifle. You hand-shock everyone on the army, and you went on the plane one by one. The pilot took off, and you had a few minutes to chat. So you did.", "action_results": [null]}]}]}, {"action": "Shoot really high on the target.", "result": " \nEven though you can easily shoot the target. You want to shoot fancy and you miss. SHOW OFF. But you still have alot of confidence in what you can choose.\n\n\n\n\n                                                 ", "action_results": [null, null, null, {"action": "A Sniper Rifle", "result": "The Sniper Rifle, you remember from a long time ago that when your grandfather was in WW I, He used this same gun. So maybe it's in your blood to use this gun. You picked it up, and wow. Your shocked. The gun is almost perfect for you. you have no problem holding it,  and you think that this could be your gun. just one shot on target, And you follow your fathers footsteps. how will you shoot the gun?\n\n\n\n                                                        ", "action_results": [{"action": "Shoot it in Anger", "result": "You shoot it thinking about your grandfather that died 2 months previous to this at 93. You don't pay attention, and you nearly break the window, you just missed hitting it. I guess this gun isn't your kind of gun.", "action_results": [null, null, null, null, {"action": "A Submachine Gun", "result": "After looking through guns, you pick out one of the heaviest guns, the Submachine Gun. You can barely pick it up, and feel you can only make one shot. so make it your best shot!\n\n\n\n\n\n                                                                     ", "action_results": [{"action": "Make the shot right now", "result": "You make it just as the gun forces you to put it down. The shot didn't hit the middle, but still you hit the target none the less. After you hit the target, your boss told you that your going to have to complete missions for him in Itraq, your stomach turns, and you Head starts spinning as you worry about your life. He tells you to meet with him next week.\n\n\n\n                                                                        ", "action_results": [null, {"action": "During the Week", "result": "It's two days before the trip to Iraq. Your packing up and you find a picture of your grandfather in WWI, and you pack that up to remember him with while your in the war. you look forward to the war. But as you are packing it up you get a knock on your door. So you answer it. It's your best friend Kevin. He's been watching you shoot, I'm very proud of how you hold the Submachine Gun, and shoot it. good luck in the war he wishes you. You say goodbye. The next two days went really quickly, and as you woke up on 5.:30 on Saturday, you got up for your big day.\n\n\n\n\n                                                                        ", "action_results": [{"action": "Meeting The Other Army Members", "result": " \nAfter a long 45 minute drive. You felt the Jitters of starting your fist day in the army. As soon as you car pulled up to the Lot where everyone was meeting. your Boss introduced you to everyone. Here is the man who can hold the Assault Rifle. You hand-shock everyone on the army, and you went on the plane one by one. The pilot took off, and you had a few minutes to chat. So you did.\n\n\n ", "action_results": [null]}]}]}, {"action": "Double the shot to Double your chances", "result": "You Hurry up, and shoot two bullets, then you put the gun down. you watch as both the shots miss by 1/2 of an inch. you get pissed, but you must move on.\n\n\n\n\n                                                                         ", "action_results": [null, null, null, null, null]}]}]}, {"action": "Shoot it with passion", "result": "Well, this gun is officially helping you follow your fathers footsteps. Your boss makes you forget about that by telling you about doing missions in Iraq next week. Now your feeling down, and upset.\n\n\n\n\n\n                                                                    ", "action_results": [null, {"action": "During The Week", "result": "It's two days before the trip to Iraq. Your packing up and you find a picture of your grandfather in WWI, and you pack that up to remember him with while your in the war. you look forward to the war. But as you are packing it up you get a knock on your door. So you answer it. It's your best friend Kevin. He's been watching you shoot, I'm very proud of how you hold the Sniper Rifle, and shoot it. good luck in the war he wishes you. You say goodbye. The next two days went really quickly, and as you woke up on 5.:30 on Saturday, you got up for your big day.\n\n\n\n-", "action_results": [{"action": "Meeting The Other Army Members", "result": "After a long 45 minute drive. You felt the Jitters of starting your fist day in the army. As soon as you car pulled up to the Lot where everyone was meeting. your Boss introduced you to everyone. Here is the man who can hold the Assault Rifle. You hand-shock everyone on the army, and you went on the plane one by one. The pilot took off, and you had a few minutes to chat. So you did.\n\n\n  150 EXP Points to Stage 2", "action_results": [null]}]}]}]}, null]}]}, null, null]}]}, null, null, null]}]}, null, null, null, null]}, {"action": "Put the Gun down, and try another one", "result": " \nWithout even trying you put the gun down, and ask for another one.\n\n\n\n                                                        ", "action_results": [null, null, null, null, null]}, {"action": "Just shoot out of random", "result": "The shot was at the edge of the target. But it hit it, and that gun could possibly become the next gun that you use in the army. Next week you start your missions the boss said. He continues to say stuff as you gulp. Your nervous, but you must get over it.He tels you, you will have missions in Iraq.\n\n\n\n\n                                                  ", "action_results": [null, {"action": "During the Week", "result": "It's two days before the trip to Iraq. Your packing up and you find a picture of your grandfather in WWI, and you pack that up to remember him with while your in the war. you look forward to the war. But as you are packing it up you get a knock on your door. So you answer it. It's your best friend Kevin. He's been watching you shoot. \"I'm very proud of how you hold that Assault Rifle,  and shoot it\". \"good luck in the war\", he wishes you. You say goodbye. The next two days went really quickly, and as you woke up on 5.:30 on Saturday, you got up for your big day.\n\n\n\n\n                                                                                 ", "action_results": [null]}]}]}, null, null, null, null, null]}]}