{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=24743", "context": "", "first_story_block": " \"Amanda!\" you yell from the kitchen. \"I swear, if you don't turn the telly down, I will KILL YOU!\"\n\n\n The blaring from the living room drowns out her response, which drives you mad. You tap your foot impatiently. I will wait five seconds before I go in there, you tell yourself.\n\n\n One.....Two.....Three.....Four.....\n\n\n \"'Manda! I'm coming in there!\" You say furiously as you storm from the kitchen. The living room's lights are dimmed, so the glare from the telly makes you blink. Amanda is curled up on the couch, her eyes glued on the screen. Her red hair is a mess, and she is dressed in rumpled up pajamas.\n\n\n \"Amanda,\" you say as you grab the remote. \"You really need to stop this! Your head is going to explode from the sound.\"\n\n\n \"Shut it, Jess!\" Amanda shushes you. \"Turn it up, this is really important!\" You roll your eyes and listen to your roommate.\n\n\n The reporter is just finishing up a story. \"...and the residents of Greenwich should be more cautious. The number of robberies and break-ins have increased over the last two weeks. So, make sure to lock your doors when you leave to house.\"\n\n\n \"So?\" you say as you turn it off. \"It's just some robberies. Nothing unusual.\"\n\n\n \"But he said it was happening in Greenwich! That's here, in case you forgot!\" Amanda says as she gets up from the couch. She stretches, and walks with you to the front door. \"We have the same chance of getting robbed as anyone else here!\"\n\n\n \"'Manda,\" you turn around, exasperated. \"Who in creation would want to break into the flat of two twenty-year old women that can barely pay the rent? It's not like we have anything of value here.\"\n\n\n You grab your purse from the table by the door. Glancing into the mirror, you check to see that your hair is still in its place, and your mascara hasn't smudged. Pleased, you turn to Amanda.\n\n\n \"We have a telly, a microwave, a DVD player, and some jewelry upstairs, Jess!\" Her green eyes flash with fear. Amanda is always worried that someone would break into the flat that you share and steal everything you have.\n\n\n \"Oh, for God's sake. Listen to me. No one is going to rob us!\" You unlock the door. \"Right, I'm going out.\"\n\n\n \"Make sure you get some more apples. We're nearly out,\" Amanda reminds you.\n\n\n \"Yeah, don't worry. I'll remember.\" You walk into the hallway. \"Lock the door behind me!\"\n\n\n Your best friend lets out a retort as you close the door in her face. Time to go to town.", "action_results": [{"action": "Going Shopping", "result": " You walk down the street, carrying a bag of groceries. The car is just down the street. Thank God. Once again, you made the mistake to wear heels to the shop.\n\n\n Trying to shift your grip on the bag, you stop for just a moment. The bag is really heavy, since you decided to buy a few more things that you saw. You get a good grip just as a man runs straight into you.\n\n\n \"Oh, God!\" You moan as your bag falls to the concrete sidewalk at your feet. Something broke inside of it; you could hear the smashing sound. \"Thanks a lot! There's my week's pay, gone!\"\n\n\n You look up at the man who ran into you. \"Sorry! I am so sorry!\"\n\n\n He is in a tweed jacket, a striped shirt, and a bow tie. You can't see his face, since he is bending over the bag on the ground. You get down on your knees next to him. Sighing, you say, \"It's alright. Not your fault, anyway. I should have seen you coming.\"\n\n\n The man looks up at you, finally showing his face. All you think is, Blimey, he has a big chin. His eyes quickly scan you, sizing you up. \"What's your name?\" he asks.\n\n\n \"Jess. Jess Rowell.\" you say calmly as you pick up some apples. \"And, you are...?\"\n\n\n \"The Doctor,\" he says as he puts the now broken mug into the bag.\n\n\n \"Doctor who?\" you ask him.\n\n\n \"Just the Doctor.\" Finished, he stands up. You pick up your bag and get up.\n\n\n \"The Doctor?\" you muse. \"Well, Doctor, let me ask you this. Why were you running so fast?\"\n\n\n \"It's quicker than walking. Now, I really have to go. It's important.\" he explains. And, just like that, he's gone. You can see his head in the crowd before that disappears as well.\n\n\n You walk towards the car. Might as well go home.", "action_results": [{"action": "Previous Page", "result": " \"Amanda!\" you yell from the kitchen. \"I swear, if you don't turn the telly down, I will KILL YOU!\"\n\n\n The blaring from the living room drowns out her response, which drives you mad. You tap your foot impatiently. I will wait five seconds before I go in there, you tell yourself.\n\n\n One.....Two.....Three.....Four.....\n\n\n \"'Manda! I'm coming in there!\" You say furiously as you storm from the kitchen. The living room's lights are dimmed, so the glare from the telly makes you blink. Amanda is curled up on the couch, her eyes glued on the screen. Her red hair is a mess, and she is dressed in rumpled up pajamas.\n\n\n \"Amanda,\" you say as you grab the remote. \"You really need to stop this! Your head is going to explode from the sound.\"\n\n\n \"Shut it, Jess!\" Amanda shushes you. \"Turn it up, this is really important!\" You roll your eyes and listen to your roommate.\n\n\n The reporter is just finishing up a story. \"...and the residents of Greenwich should be more cautious. The number of robberies and break-ins have increased over the last two weeks. So, make sure to lock your doors when you leave to house.\"\n\n\n \"So?\" you say as you turn it off. \"It's just some robberies. Nothing unusual.\"\n\n\n \"But he said it was happening in Greenwich! That's here, in case you forgot!\" Amanda says as she gets up from the couch. She stretches, and walks with you to the front door. \"We have the same chance of getting robbed as anyone else here!\"\n\n\n \"'Manda,\" you turn around, exasperated. \"Who in creation would want to break into the flat of two twenty-year old women that can barely pay the rent? It's not like we have anything of value here.\"\n\n\n You grab your purse from the table by the door. Glancing into the mirror, you check to see that your hair is still in its place, and your mascara hasn't smudged. Pleased, you turn to Amanda.\n\n\n \"We have a telly, a microwave, a DVD player, and some jewelry upstairs, Jess!\" Her green eyes flash with fear. Amanda is always worried that someone would break into the flat that you share and steal everything you have.\n\n\n \"Oh, for God's sake. Listen to me. No one is going to rob us!\" You unlock the door. \"Right, I'm going out.\"\n\n\n \"Make sure you get some more apples. We're nearly out,\" Amanda reminds you.\n\n\n \"Yeah, don't worry. I'll remember.\" You walk into the hallway. \"Lock the door behind me!\"\n\n\n Your best friend lets out a retort as you close the door in her face. Time to go to town.", "action_results": [null, null, null, null, {"action": "Game Info", "result": " In this story, you play as the twenty-year old Jessica Rowell\n(See picture). This is mainly a Fanfiction rather than a CYOA, so, sorry to all those who wanted that.\n\n\n These events are all created by me, but all characters, creatures, names, and places metioned here from the Doctor Who universe are owned by BBC. I give full credit and rights to them, even though Moffat sometimes doesn't deserve it.\n\n\n I hope that you enjoy the story!", "action_results": [null]}]}]}]}