{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=4720", "context": "", "first_story_block": "On Saturday, December 17th, 2005, I proposed to Katrina, my girlfriend of five years.\n\nThis storygame is based off of my actual proposal to Katrina. I've tried to keep thisas close to how it happened / was planned as possible. Since this is a choose-your-story, you will probably have a slightly different experience, but all paths will lead to the same place, since it was planned that way.\n\nYou will be reading this story from the perspective of Katrina.", "action_results": [{"action": "OK, I've got it!", "result": "It's Thursday night, a little after 9:00PM, and you just returned home from a twelve-hour workday. But it's all good -- this is the start of a long weekend --  your Birthday weekend -- and you've got five days before you have to return to the daily grind.\n\nYou see that Alex's friends are over, feasting on Chinese food, and have ordered your favorite dish: General Tso's Chicken. You chow down while they finish up judging some $100 make-a-game contest for their website. They wrap things up after an hour or so, leaving just you, Alex, and a quiet house.\n\nYou're a bit tired, but are a bit anxious about tomorrow. It's your birthday, and you're dying to know what Alex got for you. He's been talking about it for a few weeks and seems to have been having some shady dealings with some strange people. You have a good idea of what it is (an artifact of some sort) but really want to know what it is ...", "action_results": [{"action": "\"Alex, can you give me my gift tonite?\"", "result": "You ask Alex if he can give you the gift tonite, but he denies, insisting it will have to wait.", "action_results": [{"action": "\"Pleeeaaassee ... I'm sooo curious ....\"", "result": "You beg and plead, but Alex still insists that you wait tomorrow. Phooey.", "action_results": [{"action": "Oh well, off to bed", "result": "After such a long work day, it's great to finally get to bed. You fall asleep without any problems and sleep in for a long time. A verrrry long time. A verrrrrryyyyy looooong time.", "action_results": [{"action": "Twelve Noon", "result": "You wake up and do the morning thing, rushing a bit because you're just dying to know what Alex got for you for your birthday. Alex tells you to sit down at the kitchen table and close your eyes. He runs off and retreives your gift, placing it down right in front of you.\n\n\"Happy Birthday, Katrina\" he says.", "action_results": [{"action": "Open Your Eyes", "result": "You open your eyes and see a medium-sized Shabti statuette enclosed in a glass case. The artifact is 7.5\" long and is in pristine, museum-quality condition. Compared to the small (1cm) sized bead from last year's gift, this thing is huge -- and in great condition.  How could Alex have gotten this?\n\n\nYou also see a piece of paper under the case ...", "action_results": [{"action": "What's The Paper Say?", "result": "Wow, it's the accompanying Certificate of Authenticity. It says that the piece is an Anubis Shabti and is from the  Twelfth Dynasty (Approx 1908 BCE). It was discovered by Miriam Lichtum in 1967. That's pretty neat!\n\n\nYou absolutely love the gift. Being a huge fan of Egyptian things -- especially artifacts -- this is more than you could ever want for your birthday! You are a bit curious how Alex was able to obtain such a nice piece, though ...", "action_results": [{"action": "Ask Alex how he got this", "result": "Alex explains ...\n\nStrange thing, really. I called the Cleveland Museum of Art to see if they knew a reputable artifact dealer and they refered me to the Egyptian Antiquities Society in Chicago. I gave them a call and they kinda laughed at me, saying they really only work in the tens-of-thousands of dollars.\n\nA few weeks later, this one guy from the Society, Dr. Evans, called me back and said that he found something that would fit my profile perfectly. Since these artifacts cannot be shipped, he brought it to Cleveland from Chicago.", "action_results": [{"action": "Interesting ...", "result": "The rest of your Birthday isn't too eventful. You do the normal birthday stuff: go to your family's house for cake, go out to dinner, and relaxed for the rest of the night.\n\nThroughout the day, you can't stop thinking of how cool the artifact is. It does seem a bit creepy -- after all, this was buried with some guy almost four thousand years ago. But it is so neat to own such an amazing piece of history.", "action_results": [{"action": "The Next Day ...", "result": "The rest of the weekend was fun and relaxing, but nothing to write an adventure game about. You did find a few hours of free time while Alex was busy at work. During those few hours, you ...", "action_results": [{"action": "... watched some television", "result": "It's amazing how much time flies while you're watching TV. It's not like you really find anything new, but it's always entertaining. Before you know it, it's Sunday night, and time for bed.\n\nAs you and Alex get ready for bed, Alex complains that two of the fish died.", "action_results": [{"action": "Monday", "result": "Monday was a pretty relaxing day: sleeping in, shopping, and just hanging out. Nothing notable happened, although as you get ready for bed, Alex mentioned that some more fish died.", "action_results": [{"action": "On to Tuesday ...", "result": "Another day of rest and relaxaction. Might as well, it's been a long year -- you've been going to classes at night after work for the past five years, so it feels really great to finally have a break and nothing to worry about.\n\n ", "action_results": [{"action": "Off to work tomorrow ...", "result": "Yicch -- nothing like going back to work after a small vacation. But it's all good, it's a short week and was a normal day. No staying late required. Woo!\n\nAfter work, you and Alex stop and do a little bit of shopping. You arrive home and notice that the cat must have completely gone insane. All of the statues and trinkets on the shelf that the the Artifact sat on were knocked over. Some books and magazines were on the floor, fallen from another shelf. It's almost as if a small earthquake happened.\n\nYou're not quite sure how she could have possibly gotten up on the shelf to knock all those artifacts and trinkets over. It also is a little weird that the door on the glass case was open. Oh well, those are cats for ya.", "action_results": [{"action": "On to Thursday ...", "result": "Another uneventful day at work. After getting home and eating dinner and watching TV, you get ready for bed. You fall asleep and are a ....", "action_results": [{"action": "... light sleeper", "result": "As you're sound asleep, you are jarred awake by a loud noise ....\n\nSLAM!\n\nAlex awakes too, and you are both completely dazed. You look across the room and see that the door is closed. it must have slammed shut. This wasn't the first time you've been awoken in the night by a slammed-shut door. In the summer, when all the windows are open, a bit of wind will cause the doors to slam shut.\n\nBut of course, it is the middle of the winter, and no windows are open ...", "action_results": [{"action": "That's weird ... back to sleep", "result": "Finally it's Friday! After a long day of work, you decide to just stay home and watch a movie tonight. You have a big day tomorrow: shopping with your friend and a girls-night-out for your Sister's birthday. Plus, Alex has to go to work early tomorrow morning; he's been complaining about that for weeks.\n\n\n You end up watching Sahara, an action movie about Treasure Hunters and Africa. It was a pretty fun movie.", "action_results": [{"action": "Off to bed ...", "result": "The alarm goes of bright and early at 7:00AM and Alex jumps out of bed, rushing to get to work. He was supposed to be there at 7:00 .... whoops!", "action_results": [{"action": "Back to sleep ...", "result": "After falling back to sleep, you're rudely awaken by the telephone ...\n\nRING! RING! RING!      RING! RING! RING!\n\nWho on earth could be calling at 8:30 in the morning on a saturday? Probably a telemarketer ...", "action_results": [{"action": "Pick up the phone", "result": "It's Alex.\n\nSorry to wake you hun, but Dan* just called. His harddrive crashed last night and needs another one for his MP3s so he can do his DJ gig. It's in Akron tonite, so he needs to stop by and pick it up around 10:30AM or so.\n\nYou're not too happy about this. You actually sayed up till about 3:00 AM watching another movie, so you need some serious sleep!\n\n* or, as some know him, march5th00", "action_results": [{"action": "No way, I'm too tired", "result": "You tell Alex that you're too tired ...\n\nHe reallllly needs the drive. He has no music and needs to try to retreive it from his hard drive ...", "action_results": [{"action": "Can't he buy a hard drive?", "result": "You ask if he could go to Best Buy and pick up a hard drive. They sell them for fairly cheap, afterall.\n\nHe is completely over the limit on his credit card. Besides, why spend $100 when I have one I'm not even using. He'll only stop in and out.", "action_results": [null, {"action": "Argghh .. fine", "result": "You agree to let Dan come over and pick up the drive. He won't be over for another two hours, so you go back to sleep ...", "action_results": [{"action": "Zzzzzzzz", "result": "It's 9:45 and the phone keeps ringing again. You pick it up and it's Dan ...\n\nKatrina! You awake? I'm on my way, I'll be over in five minutes!", "action_results": [{"action": "What? I didn't even wake up yet!", "result": "Dan stops by twenty minutes later. It was nice of him giving you extra time to wake up, but it probably would have been useful if he told you he'd be over later.\n\nHe strolls in and says hello. As you stand there, still half asleep, he says \"don't mind me, I just have to run up and get the drive.\" He rushes upstairs to the office, grabs the harddrive, and comes back down.\n\n\"Mmmm ....\" he says, \"you know what would reaaalllllyyy hit the spot right now?\"\n\n\"Some sleep\" you remark.\n\n\"No,\" Dan replies, \"some of that Blueberry Muffin coffee.\"", "action_results": [{"action": "\"You want me to make you coffee? You're kidding, right?\"", "result": "You're shocked that Dan would have the nerve to ask for some coffee. You politely tell him that you're pretty tired and would just prefer to go back to bed.\n\n\"Ok, haha,\" Dan says, \"fair enough. I'll let you get back to sleep. Thanks for the hard drive!\"\n\nHe heads out and you can finally get back to sleep ... well ... that is, if some one wasn't pounding at the door. It's Dan again.", "action_results": [{"action": "What does he want?", "result": "You open the door and Dan says \"Sorry! I just realized I grabbed the wrong Hard drive. Alex specifically said do not take his 160 gig!\" He's also has a package from Fedex.\n\n\"By the way,\" he says,\" this was at the door step.\" He runs upstairs to get the correct hard drive.", "action_results": [{"action": "Package? For me?", "result": "You take the package from Dan.\n\n(NOTE: Below is an \"Item\". Click on the item and it will be added to your Inventory below. You can then click on the item in your inventory to read a description of it)", "action_results": [null]}]}]}, {"action": "Shake your head and put on some coffee", "result": "What nerve! Not only does Dan come over early on a Saturday morning, but he wants you to make him coffee? As you put on the coffee, he says he has to go outside to have a quick smoke.\n\nA few minutes later he comes in, carrying a FedEx package. \"Found this on the door step\" he says.", "action_results": [null]}]}, null]}]}]}, null]}, null, null]}, {"action": "Ignore the phone", "result": "You let the answering machine pick up the phone and once again there is peace in the house. No loud phone ... or ....\n\nRING! RING! RING!      RING! RING! RING!\n\nArgh! Why won't they let you sleep?!?!", "action_results": [null, null]}]}]}]}]}, {"action": "... heavy sleeper", "result": "As you snooze, you're awaken by a girl-like shriek:\n\nEeeaaaahhh!\n\nIt was Alex, and he's fallen down on the floor. You jump up and ask what is wrong. He says that he swear he saw someone standing in the office, by your new artifact.\n\nHe gets back up and takes another look -- nothing. \"Heh,\" he says nervously, \"amazing what you see when you're half asleep.\"", "action_results": [null]}, null]}]}]}]}]}, {"action": "... surfed the net", "result": "It's amazing how much time flies while you're surfing the net. It's not like you really find anything new, but it's always entertaining. Before you know it, it's Sunday night, and time for bed.\n\nAs you and Alex get ready for bed, Alex complains that two of the fish died.", "action_results": [null]}, {"action": "... researched the artifact", "result": "You grab the artifact and fire up google.\n\n\nWhat do you want to know?", "action_results": [{"action": "What is a Shabti?", "result": "Shabti or Ushabti (Egyptian language) is a funerary figurine which served as a dead man's deputy in order to do labor for him, mostly agricultural, in the afterlife. They existed between the Twenty-first dynasty of Egypt and the end of the First Intermediate Period.", "action_results": [null]}, {"action": "Why is Anubis depicted in the corner?", "result": "You find the following information about Anubis. However, you cannot find any examples of him being depicted on Shabti statues. That's a bit odd ...\n\nOriginally, in the Ogdoad system, he was god of the underworld, and his name is frequently thought to have reflected this, meaning something like putrefaction. He was said to have a wife, Anput, who was really just his female aspect, her name being his with an additional feminine suffix (the t), who was depicted exactly the same (though feminine). His father was originally said to be Ra, as he was the creator god, and thus his mother was said to be Hesat, Ra's wife, who later was identified as Hathor (who her identity was remarkably similar to). As lord of the underworld, Anubis was identified as the father of Kebechet, the goddess of the purification of bodily organs due to be placed in canopic jars, during mummification.\n\nAs ruler over the dead, he was given titles such as He who is set upon his mountain, in reference to his sitting atop desert cliffs to guard multiple necropolis, and Chontamenti (also spelt Khentimentiu, and Khentamenti), meaning Lord of the Westerners, in reference to Egyptian belief that the entrance to the underworld was towards the west, since that was the direction in which the sun set. As ruler, he was also said to have been victorious over the dark forces (described as nine bows), which also, naturally, lurk in the underworld, gaining him the title Jackal ruler of the bows.\n\nAs king of the underworld, he was also considered to be the one who weighed the heart of the dead against the feather of Maàt (the concept of truth), gaining him the title He who counts the hearts. One of the reasons that the ancient Egyptians took such care to preserve their dead with sweet-smelling herbs was that it became believed Anubis would check each person with his keen canine nose. Only if they smelled pure would he allow them to enter the Kingdom of the Dead.", "action_results": [null]}, {"action": "What's with the headdress?", "result": "You can't really find anything of note about this figure's headdress. From what you remember, you don't normally see a statue with a headdress but no beard, especially from this time period.", "action_results": [null]}, {"action": "What does the inscription mean?", "result": "The inscription is very difficult to make out, and you can't translate it at all. Normally, spell 472 from the sixth chapter of the Book of the Dead is inscribed in full on Shabtis:\n\nIllumine the Osiris NN, whose word is truth. Hail, Shabti. If the Osiris NN be decreed to do any of the work which is to be done in the Khert-Neter, let everything which standeth in the way be removed from him - whether it be to plough the fields, or to fill the channels with water, or to carry sand from (the East to the West). 'Here am I', you shall say, 'I shall do it.'\n\nThe only word you can make out in the inscription is Burden.", "action_results": [null]}, {"action": "Enough Research ...", "result": "How time flies when you're researching. Before you know it, it's Sunday night, and time for bed.\n\nAs you and Alex get ready for bed, Alex complains that two of the fish died.", "action_results": [null]}]}]}]}]}, null]}]}]}]}]}, null]}, null]}]}