{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=36791", "context": "", "first_story_block": "Childhood\n\n\nA fist thuds into your face, knocking you to the ground. Gruzub stands over you, laughing.\n\n\n\"Mazkil! You are as weak as a Shepard!\" He laughs, as you leap to you feet.", "action_results": [{"action": "Punch him", "result": "You swing your fist, but Gruzub quickly ducks and elbows you in the stomach, knocking the wind from your lungs. He gets two more punches in before you manage to roll away and get back into a fighting stance. As you prepare to charge him, you hear a deep voice.\n\n\n\"CHILDREN! Your mother struggles to soothe the little one while your brother hunts sheep. This is no time for playing. There is work to be done! Inside!\" Your father bellows.", "action_results": [{"action": "Go inside", "result": "You quickly hurry inside, followed by your twin brother. You live in a small village of small huts. Luckily enough, you father is Chieftain Magrash, which entitles you to sleep in the Chieftain's Hut, the largest hut. As you enter, you see your father sitting in a rough woolen tunic, sharpening his greatsword. In front of him is his heavy steel plate armor, as well as several trophies from his battles.\n\n\n\"Mazkil, Gruzub, you fight too much. Mama is trying to put Dagden to sleep.\"\n\n\n\"Yes, papa.\" You both reply.\n\n\n\"Who won the fight?\" He asks.\n\n\n\"I did!\" You both say, before glaring at each other.\n\n\n\"You don't know? Perhaps you're not fighting enough. Gruzub, go down to the river and fetch water for the stew. Mazkil, sharpen my sword. I need light the hearth.\"\n\n\nYou go over to the sword, and begin to sharpen it against the whet stone, while looking over your father's trophies: An Elven Dagger, a Shrunken head, a battered golden shield, a shattered battleaxe, a studded mace, a series of Tribal Necklaces and a Dragon Skull.\n\n\n\"Papa?\"\n\n\n\"Yes?\"\n\n\n\"Can you tell me about your trophies?\" You ask.\n\n\n\"I've told you many times about my trophies.\"\n\n\n\"Tell me again.\"\n\n\nPapa chuckles, a harsh sound you've come to love.\n\n\n\"Which would you like to know about?\"", "action_results": [{"action": "Elven Dagger (Elves)", "result": "\"Ah, the dagger. One of my favorite. The Elves are a race of \"beautiful\" and \"perfect\" creatures who don't know a battleaxe from a wood-axe. Death to them all. They're stupid in things like how to start a fire and how to hunt, yet seem to love philosophy and reading. Death should take them. Still, they're fast with a blade and good with a bow, which I found out while hunting a party of them that came into my territory. That knife nearly went into my throat before I impaled the little bastard wielding it.\"", "action_results": [null]}, {"action": "Shrunken Head (Necromancer's Army)", "result": "\"Ah, that! I took that off a large bastard with a sword twice as large as you.That damn Necromancer, I can't remember his name, rose Zombies Ghouls, Skeletons, Wights, Death Knights, Specters, Ghosts and who knows what else in his quest for power. He led a small group of Death Knights up here to add some Ork Zombies to his collection. He ran faster than a deer when he saw what a true Orc can do! Ha!\"", "action_results": [null]}, {"action": "Battered Golden Shield (Empire of Man)", "result": "\"The Shield? The Shield... Ah, yes! The shield! I took it off some fancy knight who drank too much and fought too little. Let me tell you about men, little one, there's a lot of them, but they're weak, stupid and cowardly. They break easily. They're the biggest threat to our little old home, but they're too busy fighting the elves to come fuck with my tribe.\"", "action_results": [null]}, {"action": "Shattered Battleaxe (Dwarves)", "result": "\"Ah, this one! I fought the dwarves when I was young, back when my name was Youngblood like you. I earned the name Magrash Shatteraxe that day! The Dwarves are small bastards and the sight of one will make you chuckle, but I love 'em! The Gods made them jesters to amuse, and the Dwarves became angry, stubborn, heavy-drinkers who can wield an axe! They hide in their tunnels and mine too much, but I respect them anyway.\"", "action_results": [null]}, {"action": "Studded Mace (Rebel Orcs)", "result": "\"Ah... the mace. Boy, some Orcs stick to their tribe. Some wander as mercenaries, or sign up as soldiers. Some become Rebels, raiders targeting every humans, elves, dwarves and anyone else that gets in their way. They're mad, stubborn, bloodthirsty fools. I took that weapon off on of them trying to convince Old Klaim to join up. I also took a few of his teeth, but I don't have those anymore.\"", "action_results": [null]}, {"action": "Tribal Necklaces (Tribal Orks)", "result": "\"The tribal necklaces? Boy, show some respect! Those are the Chieftain's necklaces, that show who's the boss of this tribe! Us Orcs have always been a hot-headed folk. Lots of fighting, drinking, eating, fucking and some more fighting when you're finished. We stick to the tribes, each led by the great Chieftain. It's a good life, boy.\"", "action_results": [null]}, {"action": "Ask about the Dragon Skull (Dragons)", "result": "\"Ah, the skull. Dragons are fearsome creatures. They come in many colors, all with powerful skills. They speak Dragontongue, and many speak our language. Some are intelligent, while some are incredibly feral and wild from years of isolation. Their flames tend to be tinted the same color as their scales, with an afinity for hoarding treasure and waging war and destruction. They're solitary creatures, Dragons. If you ever slay one, Gorgok will look upon you with joy.\"", "action_results": [null]}, {"action": "Stop asking about Trophies", "result": "\"I'm finished, Papa!\"\n\n\nPapa picks up the blade, and licks the edge.\n\n\n\"Yes... Sharp enough to shed dragon blood. Well done, Mazkil. Now, go fetch gather fruit.\"", "action_results": [{"action": "Four years later...", "result": "\"You've been on this planet fourteen years, and you haven't learned a thing, boys, unless you've seen me and Dendar take out a boar!\"\n\n\nYou walk with Gruzub, your older brother Bagig and his friend Dendar, out in the woods. You have a small iron knife at your belt and a bow clutched in your hands. So far in your short life, you've only subsided on deer, goat and chicken, but after today you'll be able to feast on the boar you've helped kill.\n\n\n\"On your first hunt, it's tradition to eat a deer's dropping to gain it's scent.\" Dendar remarks. \"Everybody knows that.\"\n\n\nDendar and Bagig pause, dropping to one knee, pointing to some small droppings.\n\n\n\"Go on, Gruzub, Mazkill. Dig in.\"", "action_results": [{"action": "Eat the droppings", "result": "You drop to your knees, close your eyes, and quickly swallow a small piece of dropping. Bagig pats you on the head, and nods to Gruzub. Gruzub does the same, and with that, Dendar bursts out laughing.\n\n\n\"You two are idiots!\" Mazkil and Gruzub Youngblood, eating deer droppings.\"\n\n\nThey chuckle as your face reddens. You open your mouth to yell at them, but then freeze. You spot a beautiful deer just at the edge of a small creek out of sight. You grab your brother, and point to it.\n\n\n\"Ah, well spotted, Mazkil Shiteater. Let's catch it, Dendar.\"\n\n\n\"We can't get distracted. We came here to hunt boar.\"\n\n\n\"We'll catch the deer and the boar!\" Bagig cries, charging off after the deer. \n\n\nThe Deer bursts off running, with Bagig and Dendar quickly following.\n\n\n\"Stay there!\" Bagig yells at you as he leaves.", "action_results": [{"action": "Stay there", "result": "You stand patiently with Gruzub, who looks at you.\n\n\n\"Just so you know, Oraal is mine.\" He says quietly.\n\n\nYou ponder this for a second. Oraal is a fat, lazy girl who's the daughter of a swordsmaker.\n\n\n\"Oraal? Has her father promised you a fine blade if you crawl between her legs?\" You giggle.\n\n\n\"Hey! She has proclaimed her...!\" He begins, before his eyes widen.", "action_results": [{"action": "Ask what's wrong", "result": "You open your mouth to speak, but you're hit in the back and sent flying through the air. You hit the ground, your head knocking against a tree root and drawing blood. You shakily stand, drawing your knife, as you're faced with a large boar preparing to charge again.\n\n\n\"Watch out!\" Gruzub yells, running to help, but it's clear he's far too slow.\n\n\nThe Boar charges at you, it's tusks looking deadly sharp at they near you...", "action_results": [{"action": "Roll to the side", "result": "You roll to the side, narrowly dodging a goring from the beast's tusks. As it runs past, you leap forward with your knife, cutting through thick fur and drawing a fair amount of blood. It squeals, before running forward and turning around once more for another charge. ", "action_results": [{"action": "Dodge again", "result": "As the boar charges, you try to roll to the side, but it's prepared this time. You yell as it's tusks slash your side, causing a massive wound.", "action_results": [{"action": "Continue", "result": "Gruzub charges over and stabs the boar in the side with his dagger, giving you ample time to leap up. You charge at the boar, stabbing it repeatedly in the neck. It squeals, but it's easily killed before it can resist. It falls dead at your feat.", "action_results": [{"action": "Rejoice, for the enemy is vanquished!", "result": "You rest your foot on the boar's tusks, laughing.\n\n\n\"Ha! I've slain the boar!\"\n\n\n\"Hey!\" Gruzub yells. \"I helped.\"\n\n\nDendar and Bagig burst trough the trees, a deer straddled between them.\n\n\n\"We caught the deer. I bet...\" They pause, noticing the boar. \"Cursed Reaper, is that a boar?\"\n\n\nYou nod proudly.\n\n\n\"Death's Head, Mazkil, you've impressed me. No longer will you be called Mazkil Youngblood, now you'll be Mazkil Boarsbane!\" Bagig laughs.\n\n\nYou smile proudly, knowing you will feast on boar meat tonight.", "action_results": [{"action": "One year later...", "result": "\"Mazkil Boarsbane! Gruzub Fastfoot! Let's go.\" Papa yells.\n\n\nYou quickly follow your father out of your small home and onto the small dirt road that interconnects the village.\n\n\n\"Boys, you've done well. I was so proud when I saw you best Harkor Clawfist in a fight, I got you a present.\"\n\n\nYou smile fondly. Harkor had insulted your brother Bagig and Dendar. They had only been recently killed by a Death Knight from the remnants of the Necromancer's Army, and you made sure that Harkor suffered for his insult. By the time you and Gruzub were finished, his face was half-caved in.\n\n\nYour father hands you each a small amount of gold coins.\n\n\n\"Dendar Arroweye is heading down to Riverton today. He's taking the cart to pick up some goods to help us get through the winter. Take the cart, go enjoy yourself.\"\n\n\nYou thank him, and eagerly count your coins. 25 Gold Coins, all shining proudly at you.\n\n\n\"Go now, boys. Enjoy yourselves.\"", "action_results": [{"action": "Head down to Riverton", "result": "After a long ride to Riverton with Dendar who mostly insults you and Gruzub, you eventually arrive at the small town. You eyes immediately find multiple ways to spend your precious coins. There's a brothel in the poorer section of town, a large shop full of delicious foods you wish to sample, a small gambling ring and a tavern.", "action_results": [{"action": "Leave Riverton", "result": "Once you've spent your gold coins, you make your way back to Dendar's cart. Unfortunately, you find yourself in the poorer part of town, clearly having taken a wrong turn. As you make your way through a side street, a voice cries out.\n\n\n\"Hello! A little lost, are we?\" A voice cries.\n\n\nYou turn, and are faced with a trio of men holding knives.\n\n\n\"Fuck off.\" You grunt angrily.\n\n\n\"'Fuck off', he says. What an angry orc.\" \n\n\nA voice from behind you says.\n\n\nYou turn, to see two more men wielding knives. \n\n\n\"Listen, sir. Give us your coins, and we'll see you find your way to where you're going.\"", "action_results": [{"action": "Charge the men", "result": "You run forward, swinging your blade. You slash the throat of one of the men and he topples backwards. The second man cuts your shoulder deeply, and you grab his head and smash it repeatedly against a wall, crushing it into a pulp. You feel another knife slash your back and you yell, twisting around to jab another man through the eye and kill him. The two remaining men seem nervous, but one runs forward in a burst of courage. He dives forward, sticking his knife through your arm, causing you to drop your knife. With your other hand you grab him, and push your thumb through his eye as he screams, before stomping on his head until he's a smear on the floor. By then, the final man had left, running as fast as he could.", "action_results": [{"action": "Collapse", "result": "You fall to the ground with a thud, and lose consciousness. When you wake up, you're in the back of Dendar's cart, with Gruzub next to you.\n\n\n\"What happened?\"\n\n\n\"You killed a lot of people, collapsed, and I dragged you here.\"\n\n\n\"Ah. I'm still alive, then. Good.\"\n\n\n\"We'll get you medical help when we get back to the village.\"\n\n\n\"Good.\" You grunt.\n\n\n\"Well done with the thieves, Mazkil. You've proven yourself a true Orc.\"", "action_results": [{"action": "One year later...", "result": "Orc Tribal Customs are simple. The Chieftain's sons fight, and the winner takes over for him when the Chieftain is killed or reaches forty. Papa has just hit forty, so something you've been preparing for all your life. You sit next to Gruzub in front of the Shrine of Gorgok, the Warrior God, praying silently.\n\n\n\"I'll try not to kill you, you know.\" Gruzub says quietly.\n\n\n\"I'll try not to kill you.\" You reply.\n\n\n\"Papa killed his brother.\" Gruzub notes. \"Death is quiet likely for one of us.\"\n\n\n\"Grandpapa didn't kill his brother.\" You add.\n\n\n\"Fair point. Whatever it comes down to, I love you. You are my brother, and I would be proud to be killed by you.\"\n\n\n\"Well, I'm great and mighty. Everyone I kill should be proud of it.\" You chuckle.\n\n\n\"I take it back, I'm killing you, you prick.\"\n\n\nYou both laugh, as Papa arrives. He quietly removes his tribal beads, and drapes them around the Shrine.\n\n\n\"Ah. My neck feels bare.\" He sighs. \"Boys, tomorrow is going to be the most important day of your life. One of you will become the victor and chieftain, the other will fall and may die. I just want you to both know I feel nothing but pride towards you.\"\n\n\nYou struggle not to tear up, and by the way Gruzub is tensing, you know he's also struggling.\n\n\n\"I've always treated you as my father treated me, stern but loving. Whatever you become, be it Chieftain, Warrior, Mercenary or even a whining baker, you will be the greatest at it there's ever been.\"\n\n\nYour father nods, and lays his great sword in front of the Shrine.\n\n\n\"It's late. Go, sleep, rest up.\"\n\n\nYou nod, and stand and begin heading to the hut. As you walk, Gruzub begins to chuckle.\n\n\n\"What?\" You ask.\n\n\n\"Do you remember the time when we were boys when we tried to make a glider out of chicken feathers?\"\n\n\nYou laugh.\n\n\n\"And we were standing on top of the mountain, with you about to jump.\" You add.\n\n\nGruzub nods, smiling.\n\n\n\"And you yanked me back when you realized chickens can't fly.\" Gruzub smiles.\n\n\n\"Ha! You would've died! Remember when we caught our first boar?\" You smile.\n\n\n\"Yeah. I ate so much boar that night I almost puked.\"\n\n\n\"That was the mead, Gruzub.\"\n\n\n\"I miss those days.\"Gruzub nods.\n\n\nYou arrive at the hut, and you grab Gruzub in a hug.\n\n\n\"Good luck tommorow.\" You say.\n\n\n\"Good luck.\"\n\n\nYou both go to bed, scared and nervous about tomorrow.", "action_results": [{"action": "The next day...", "result": "You stand, fully armored in plated steel, next to Gruzub and the Shrine of Gorgok. Priest Jinser stands by the shrine, holding two short swords.\n\n\n\"Gorgok! Watch over this fight and please bless these warriors. Watch over this fight and see that the greatest Chieftain is chosen!\" The Priest wails.\n\n\nHe holds the two swords out, and you grab one. Gruzub grabs the other.\n\n\n\"Let the fight commence! First to render the other unable to stand wins!\"\n\n\nYou take up a fighting stance, as does Gruzub. You slowly move forward, before you both swing your blades. Sparks fly as they collide, and the battle commences. You land the first blow, smacking into Gruzub's chest as he stumbles backwards. He draws blood first, slashing open a small bit of unprotected arm. It's obvious that you're the far superior fighter, with Gruzub struggling to avoid your attacks. Then, the Fates pluck your string.", "action_results": [{"action": "Pluck", "result": "An eagle, far above you, drops a small turtle from a great height, hoping it's shell will shatter on the ground. The turtle smacks into your head, knocking you backwords. Gruzub takes advantage of your confusion, stepping forward and thrusting his blade. The blade enters you chest, Gruzub carefully avoiding your organs but thrusting deep enough to cause you to scream. When he withdraws, blood spurts out, and you struggle to stand.\n\n\n\"The Fates seem to dislike Mazkil.\" The Priest notes loudly, though you barely listen.\n\n\nGruzub continues to attack, and you barely manage to defend yourself. Eventually, he kicks your leg and you fall backwards. This leaves your throat exposed, for Gruzub to easily slash your throat and make sure you fall and never get up.", "action_results": [{"action": "Try to regain a fighting stance", "result": "To your surprise, Gruzub hesitates, before taking up fighting stance again, allowing you to gain a defensive position to defend your open throat and stop your demise. Your energy waning, you decide to take one final effort to defeat Gruzub. He swings his sword at your legs, attempting to floor you, but you block the shot and head butt him. He falls backwards, and you swing your blade, smacking into his head. His helmet flies into the air, leaving his head and neck unguarded. You know you don't have enough energy to continue fighting. ", "action_results": [{"action": "Behead Gruzub", "result": "You swing your blade down with a roar. You sword connects with his neck, and his head falls to the ground. You drop to your knees, looking at your dead brother. You barely comprehend the Priest grabbing your hand and holding it up, loudly proclaiming you the victor. Papa walks over, draping the Tribal Chieftain beads and necklaces around your neck. Mama walks out and gently kisses your head, before closing Gruzub's eyes on his decapitated head. The Priest has the body taken away to be burned to ensure it makes it to the afterlife. You struggle not to weep for your brother, while Papa kneels down to talk to you. \n\n\n\"You are Chieftain now, Mazkil. Chieftain Mazkil Redblade, leader of the Red Blades. You will lead the tribe to greatness. Tonight, we celebrate. We celebrate your ascension to chieftain, we celebrate the great fight, we celebrate your brother's journey to the Afterlife. He fought so well I'm sure Gorgok himself is Gruzub's cup-bearer.\" \n\n\nYou nod. The path you're going down is set. Gone are dreams of becoming a mercenary or a raider. Now, you are a Chieftain.", "action_results": [{"action": "Continue", "result": "The Path of the Chieftain\n\n\nYou sit on the small wooden Chief's Throne in the Main Hall. Tribal Necklaces and Beads are around your neck, feeling a lot heavier than they are thanks to the guilt and grief from Gruzub's death. Papa has vacated his role as chief completely and given all his responsibilities to you, taking Mama and leaving to a small farm up the mountain, leaving you in charge. Still, he's left you with two lieutenants and advisors, Elder Doct and Thraka Flameborn.\n\n\nElder Doct is an aging Orc, the oldest in your village. She is a traditionalist, who had fond memories of the old days when warriors fought duels for honor and farms were farmed by hand with hoes rather than with mules and donkeys. She values older values like honor, isolationism and keeping the village moral and traditional.\n\n\nThraka Flameborn is the polar opposite of Doct. He is one of the few Orc Mages, specialized in pyromatics and flame-based magics. He is a very modern and progressive orc, who wants for the industrialization and modernization of the village as well as a better relationships with the outside world.\n\n\nThe pair enter the Main Hall, and begin approaching you. Elder Doct is in ancient, dusty armor from his days as a warrior, and has a face like a wrinkled, rotting prune, while Thraka Flameborn is a younger, smaller Orc who looks like a child playing dress up with his father's red Mage Robes.\n\n\nHuh. Perhaps you are still bitter and angry at the world because of your brother's death.\n\n\n\"Congratulations at you ascension to Chieftain, Chieftain Mazkil.\" Elder Doct says happily.\n\n\n\"My brother just died.\"\n\n\n\"Oh... Yes, sorry, Chieftain.\" Doct apologizes.\n\n\n\"What's the issue?\" You ask.\n\n\n\"Raiders have been spotted at the Eastern Woods, by Jagik Longstride. She says they've been camped there for at least three days, raiding surrounding farms and market caravans.\" Thraka says.\n\n\n\"What am I to do, then?\" You ask.\n\n\n\"You should grab your sword and lead our warriors to wipe them out.\" Elder Doct says.\n\n\nYou grab your father's long sword, or your long sword now. It's a massive steel blade, the blade inscribed with Orc Runes. It's been handed down your family for four generations, when your great grandfather shattered his family sword on an Elven Shield.\n\n\n\"Where are the men?\"\n\n\n\"Down at the armoury.\" Thraka adds.", "action_results": [{"action": "Head to the armory", "result": "You sling the sword over you shoulder, and begin marching towards the armory. The Orcs are all standing around, wearing plate armor and chainmail, wielding swords, axes and maces. They respond to your arrival with eagerness and bloodthirstiness.\n\n\n\"Ah! The Chieftain's here! Time for battle!\" One of them says gleefully.\n\n\nBecause of your age, you know you quickly need to take charge and show your dominence.\n\n\n\"Alright men! We had killing to do! On my lead!\" You shout.\n\n\nYou begin marching towards the Eastern Woods, followed by the the Orcs. With that, you begin leading your War Party towards bloodshed.", "action_results": [{"action": "Two Hours Later...", "result": "You spot smoke just in the distance, where the raiders are presumably camped.\n\n\n\"Orcs!\" You loudly whisper. \"To arms! We'll wipe out the fiends to the last man.\"\n\n\nYou move forward slowly, further through the woods. You arrive at the edge of a small glade. There is a large opening where there's several dozen tents. A group of around thirty Orcs wearing chainmail armor and wielding axes, short swords and maces. You give a few hushed orders to various Orcs to target the various flanks to make sure not a single raider survives. Then, you raise your sword.\n\n\n\"CHARGE!\" You roar, sprinting forward.\n\n\nThe Raiders are quickly taken by surprise, grabbing any nearby weapons and raising them in defense. You swing your sword, which bites into one of their necks and beheads him in one clean sweep. You kick a second to the floor with one swift kick to the head, knocking him to the floor. You raise your sword and stab downwards, going through the raider's stomach. Within a few seconds, the fighting is over. The raiders have been quickly wiped out to the last orc, leaving none alive.\n\n\n\"This was quicker than I had hoped.\" One of the Orcs remarks.\n\n\n\"Orders, Chieftain?\" Another asks, turning to you.\n\n\n\"Burn the tents, the bodies and take anything worth taking.\" You reply.\n\n\n\"Yes, Chieftain Mazkil.\"\n\n\nYour men quickly begin removing armor, weapons and jewelry from the dead Orcs, and wrapping their corpses in tents. Once this is finished with all the corpses, they set the wrapped corpses alight, which quickly begin burning. You sniff the air, and smell the delicious smell of sizzling flesh.\n\n\n\"Chieftain! I counted the amount of beds versus corpses. Twenty dead raiders, but there's over eighty beds.\"\n\n\n\"There's more! We believe there's at least sixty more raiders off on a mission at the moment. Orders, Chieftain?\"\n\n\nOne of the Orcs, one of the very few archers you've brought, Kanim Darkwit, steps forward. \n\n\n\"Sir. The Raiders will be hungry and tired. They'll be here soon. We can lay an ambush. There's a good vantage point in one of the trees...\"\n\n\n\"Coward! Where's your honor, boy?\" Another Orc, Jakku Bearsbane, roars. \"We're not abandoning all honor and reason in favor of hiding like does! We find the raiders, and wipe them out to the last man.\"", "action_results": [{"action": "Return to the village", "result": "\"Curse the Gods, I'm not wasting my time out here in a freezing, empty forest waiting for what could be days, weeks even, for the raiders to return, all while subsiding on nuts and berries like a fucking chipmunk. We head back to the village for a warm meal and a large drink.\"\n\n\n\"Yes, Chieftain.\" The Orcs all bark back.\n\n\nYou wipe the blood off your longsword on the wet grass, and turn to begin the long walk home.", "action_results": [{"action": "Head back to the village", "result": "The next day, you walk along the street, Thraka and Doct off managing your work for a while. You survey your village. Children are brawling in the streets, the elders are drinking and the adults are working. Everything's good. You think to yourself. You notice a young Orc woman who's name you haven't learnt, and feel a pang in your heart as you notice how beautiful she is. You feel a pang in another place, but that's neither here nor there. You realize that one of, and perhaps the best, duty of the Chieftain is to have a heir to the throne and get married. You'll try find someone soon enough. Not today, though. You continue strolling around the village, before you notice at the edge of town, a trail of caravans approaching. You raise an eyebrow, as there are no scheduled caravans set to arrive over the next few days. You walk up, and to your surprise, notice the caravaneers are not the Orcs you're used to seeing. They're all men. Usually there's a few men mixed in with the Orcs that run the caravans. You walk over to the caravan.\n\n\n\"Hey! Who are you, then?\" You ask loudly.\n\n\nThe Humans on board are wearing red cloth with gold Eagle symbols embroidered on them.\n\n\n\"Greetings! I am Giorgio Lates. I am a merchant from the Kingdom of Mankind.\"\n\n\n\"I recognize the sigil. What do you want?\"\n\n\n\"I am a merchant, kind sir. Orcs are famous for their steelwork, and I had the pleasure of working with some Orc Mercenaries. They're blades, axes and maces are unrivaled, except for Elvish blades, which are as easy to find as an honest merchant. Which, you so happen to have found.\" Giorgio says, winking.\n\n\n\"You wish to buy blades?\"\n\n\n\"Buy? Not exactly. I doubt you have much use for my gold. I wish to swap, to barter, to trade.\"\n\n\n\"For what?\"\n\n\n\"We have much to trade. Food, Drink, Steel, Iron, Wool, Jewelry, Gold, Silver and much, much more. We wish to open up a trade route between here and the Empire.\" Giorgio grins.\n\n\nYou frown. Traders are prone to take advantage of humble villages like yours. The Village is also dedicated to crops, farm work and general self-sufficiency. To increase your smithing and weapons production, you'd need to sacrifice your self-sufficiency. Still, it could increase your village's profit and the standard of living.", "action_results": [{"action": "Agree to trade with the Kingdom of Man", "result": "\"Yes. Yes... I like this plan. I will expand the blacksmith's, and begin producing weapons for the Kingdom of Man.\"\n\n\n\"Ah! Fantastic, Sir!\" Giorgio replies happily. \"I promise, you won't regret this. I'll increase the amount of caravans coming up here, and have the first few stuffed with a little... gift, a show of appreciation. I've you've never had Elk, or Trout, or Lamb, you'll enjoy the caravans.\"\n\n\n\"It'll take us some time to begin producing weapons, but once we're started we'll be able to produce quite a bit.\"\n\n\n\"Ah, good, good.\" Giorgio grins.\n\n\nYou negotiate the smaller details and offer the merchants each a bed and mead, but they politely refuse to head back down the mountain. Despite Giorgio's friendliness, it's quite obvious most of the other merchants and guards were unnerved by being so deep in Orc territory. Still, you think this trade deal with greatly benefit the Red Blades.", "action_results": [{"action": "Three Days Later...", "result": "You sit on your throne in the Main Hall, in the midst of a feast to celebrate the death of Chieftain Dadic, your Great-Great-Great-Grandfather, who was brutally stabbed to death by Elven Assassins. Despite being unarmed, surprised and quite old, he put up a grand fight. Twenty Elves entered this very great hall to assassinate him, three went out. Thraka and Dokt stand on either side of you. For once, they both agree on what you should do, although Thraka's much more brutally honest.\n\n\n\"Find a girl to fuck.\" He says.\n\n\n\"What Thraka Flameborn means is...\"\n\n\n\"To get your dick inside a girl.\" Thraka laughs, to Dokt's embarrassment and frustration. \n\n\n\"Chieftain, every Chieftain needs one to share their soul with. You need a mate.\" Dokt says.\n\n\nYou survey the room. You spot a young Orc girl dancing in the crowd. She's small and cute, and you briefly make eye contact. She gives you a flirty wink. A pretty girl would do good to help you survive the cold winter nights.\n\n\nMaking use of the drink and food is a tall warrior. Her head is cut short and she has a large, impressive blade on her side. A warrior is someone you could relate to and respect as a mate.\n\n\nOne the opposite side (both of the room and orientation), a youngish Orc stands quietly, a leatherbound book in his hands. He looks intelligent, but also has soft features and a nice smile, which he quickly flashes at you.\n\n\nFinally, there's a massive beat of an Orc holding a blade that could cleave horses in half with one blow leans against a wall. You recognize him as Ironsoul, a fantastic warrior notorious for spending large amounts of time in brothels in the company of Orcs who choose to have an adventurous life working in the brothel rather than on the battlefield.", "action_results": [{"action": "Talk to the dancing Orc", "result": "You walk over to the dancing orc, and smile.\n\n\n\"Hello.\"\n\n\n\"Hi.\" She replies cheerfully.\n\n\n\"I am Chieftain Mazkil.\"\n\n\nShe giggles.\n\n\n\"Obviously. I make sure I know the name of the Chieftain.\"\n\n\n\"Ah. Good.\" You reply, awkwardly.\n\n\nYou realize while you're very skilled and courageous in the art of warfare, you suck at flirting. Thankfully, she's better and very interested.\n\n\n\"I am Sarunt. So, do you want to get a drink, Mazkil?\"\n\n\nYou nod eagerly, and head over to the drink stand.", "action_results": [{"action": "Continue spending time with Sarunt", "result": "You spend the next few hours talking with your newfound mate. Sarunt is quite intelligent and flirty, almost your exact opposite. You'll make sure that your relationship continues and develops into what could be a prosperous marriage.", "action_results": [{"action": "Four Weeks Later...", "result": "You sit on your throne, resting your head on your blade as Thraka Flameborn and Elder Dokt tell you about the village's state of affairs.\n\n\n\"There's been a change in the management of the College of Alexandria. They've begun to accept Orc students.\" Thraka says to you. \n\n\n\"Well, this is very good for racial relations, but what do the Red Blades care?\" \n\n\n\"There are many more profitable jobs that can be found if you work in the College. We could greatly improve their lives.\"\n\n\n\"These jobs would take these people away from profiting the Red Blades, cost massive amounts of money, and mots likely they wouldn't receive these jobs for being Orcs. These students wouldn't be able to get the jobs, and they wouldn't be taught how to farm or fight, so when they came back here without jobs, they couldn't work here.\"\n\n\n\"The Elder exaggerates greatly. There's plenty of work ot be found, especially with Orcs. Learning at the College of Alexandria would mean that our children would have better lives.\"\n\n\nYou briefly consider the thought. Perhaps the Young Orcs would have better lives in and after the College, but it would definitely take away from the tribe's size, and perhaps the Orcs would be left untrained in manual labor or the ability to find actual work after discrimination stops them from finding educated work.", "action_results": [{"action": "Send young Orcs to the College", "result": "You decide to send these young Orcs to the College. You want them to have a better life than you and your ancestors have had, and make sure the Orcs aren't left out in the education world.", "action_results": [{"action": "Five Weeks Later...", "result": "You sit on the Throne, looking over hunting cycles. Gemin's Point is good hunting ground, but it could lead to fighting between the Dead Bone Tribe, who also uses the area. You could send hunters there, not send hunters there, or the third and by far the greatest option, fall on your own sword and end the painful trial worse than any other Orc has endured of doing crop rotations or hunting areas.\n\n\nYou hear yells outside, and the doors to the town hall is kicked open. A group of six Orcs appear, dragging a brutally beaten man with them.\n\n\n\"Chieftain! We have found a man in our territory, the goat fucker.\" One of the Orcs yells, tossing the man in front of you. \"He's been hunting our deer and boar for weeks, it seems.\"\n\n\n\"Explain yourself, human, before I release my warriors to tear you apart.\"\n\n\n\"Sir, please.\" He says, begging. \"I'm from the village of Eckleglade. It was destroyed by an Elvish Assault Party, and we were forced to flee. Many of us headed to the hills and mountains, to hide from Elvish attacks, and formed small camps up there. I was only trying to hunt to feed my family.\"\n\n\n\"Sir, orders?\" One of the Orcs asks you. \"Shall I take his head?\"", "action_results": [{"action": "Have the Trespasser executed", "result": "\"Hmmm... Where are the camps, trespasser?\"\n\n\n\"Sir, if I tell you...\"\n\n\n\"Don't preside to know who I am or what I'll do, trespasser.\"\n\n\n\"They're at the Morinspeck Mines, sir.\"\n\n\n\"Good.\"\n\n\nYou stand, and swing your blade. The Man doesn't have time to blink before his head falls to the ground, rolling onto the floor. You turn to your men.\n\n\n\"Send warriors up to Morinspeck Miens. Force them out, and kill anyone who resists or refuses to go.\"\n\n\n\"Yes, Chieftain.\" They say cheerily, running off to find armor and weapons.\n\n\n\"Well, that takes care of that problem.\" You think, kicking the head aside.", "action_results": [{"action": "Five Weeks Later...", "result": "\"Chieftain! Chieftain!\"\n\n\n\"Yes?\" You ask.\n\n\nYou're met with a young Orc, a cousin of yours, who reminds you of Gruzub. You feel a twang of guilt, before deciding that in honor of Gruzub, you're going to kill this Orc if he brings up something like the placement of the new well or whether to build the new stable of stone or wood.\n\n\n\"There's a disaster up at the Kes Nests.\"\n\n\n\"Disaster? That's a strong word.\"\n\n\n\"It's accurate. A group of Zombies have engaged a Red Dragon perched on the mountain.\"\n\n\n\"If Death and Destruction met on a Road.\" You quote, remembering one of the few books you read as a child.\n\n\n\"What?\" The Orc grunts.\n\n\n\"The Poem, where the Grim Reaper meets the Mother of Dragons on a road. They debate their roles, with the Grim Reaper saying how his job is necessary ot prevent overpopulation, while the Mother of Dragons says that she prevents empires from wiping out all... What the fuck am I doing? I'm not explaining a children's poem to you.\"\n\n\n\"Sorry Chieftain. The Warriors are suggesting you lead a party up there.\"\n\n\n\"To do what?\"\n\n\nThe Orc shrugs.", "action_results": [{"action": "Lead an army up to the Kes Nests", "result": "\"Assemble the warriors.\" You say. \"Get me a group of sixty warriors who are hungry for blood.\"\n\n\nYou have the group assembled, and quickly begin making your way up the mountain. About halfway up, you begin to regret it.\n\n\n\"It's cold, my feet hurt and I'm fucking tired.\" You grunt as you trudge up the mountain.\n\n\n\"Damn right, Mazkil.\" Urug Eaglebow says.\n\n\nYou look further up the mountain, and hear the howls and rasps of the dead as well as the roars and screeches of the dragon. There's few dragons up here, so you presume this Red Dragon fighting is Mont Pre'Igni Rubrum, a near unpronounceable name, or the Volcano of Gargarum. The Undead are no doubt deserters from the Necromancer's Army. You reach the top of mountain, at the edge of a crater. At the center, a large group of two dozen undead soldiers armed with spears and swords are attempting to kill the dragon. It seems the undead are very unmatched. ", "action_results": [{"action": "Fight both the Dragon and the Undead", "result": "You charge forward, your blade swinging.\n\n\n\"Go! Send the dead back to their graves and the dragon to Gorgok's Trophy Room!\"\n\n\nYou behead one of the undead, its rotting skull flying through the air. You feel a blade slash your back, before a jet of flame sets you alight, melting your skull.", "action_results": [{"action": "Death", "result": "You let out a pitiful scream as your life is taken from you.", "action_results": []}]}, {"action": "Attack the Undead", "result": "\"Send the dead back to their graves!\" You roar, charging into battle. \n\n\nYou swing your blade, beheading a rotting head and sending it through the air. You stab another through the heart, killing him instantly. You headbutt another, with such strength that the spine breaks and the zombie collapses on the ground. The undead are so unmatched that they're wiped out within seconds. You turn, to the snarling face of a dragon. It's voice, a low growl, shakes your very core.\n\n\n\"Orcs... Why have you come to my home?\"\n\n\n\"I... I came to help.\" You say nervously. \"I wanted to make sure this fight doesn't move into my territory.\"\n\n\n\"A wise move, mortal. Your assistance was unnecessary, but polite. Please, let me give you a gift.\"\n\n\nThe Dragon turns and stomps away into a cave. A few minutes later, it comes back. It opens its mouth, letting golden coins and gems fall out. Not a massive amount, but enough to fund the building of a new well and to get new bows for the hunters.\n\n\n\"Thank you, mighty dragon.\" You say.\n\n\n\"Of course.\"\n\n\nYou bow, and begin trudging down the mountain. ", "action_results": [{"action": "One Month Later...", "result": "You walk up a mountain, trudging through the harsh snow. You're cold despite being wrapped in furs and leathers, and you really need to piss, but you know that if you tried, your dick would freeze off. You lost three farmers and a dozen goats to a Frost Troll wandering down from the mountain in the cold, icy winter that's just started. You're taking a five war parties of twenty warriors each to wipe out any trolls up in the mountains. You lead the main war party of the best warriors who wish to target the cave system most likely to hold sheltering trolls. Wind and snow begins to block your view. You know you need to find shelter soon.", "action_results": [{"action": "Hunker down in the cold", "result": "You drop down, putting up whatever tents you have. You crawl inside, wrapping furs and leathers around you.  You hope the storm clears up soon. Within an hour and a half, the cold is so brutal that you lose all feeling. The snow's bad you have no idea where you're going. After four hours of waiting, you feel a sudden sensation of warmth. You begin unstrapping your armor to cool down. You're hot and tired. A quick nap in the snow would be nice...", "action_results": []}, {"action": "Move to the nearest Cave system to escape the cold", "result": "You quickly speed up, heading towards a cave. You manage to find it within ten minutes, managing to take shelter. You rush inside, heading quickly deeper into the cave. You eventually find a point where you're sheltered for the most part from the freezing winds and snow. You feel warm air behind you, and you turn. A massive bear stands in front of you. It swings its paw, smacking you into a wall, leaving massive scratches across your chest plate. The bear is quickly beheaded by the warriors, stabbed repeatedly through the body. It's fur is quickly removed and the Orcs wrap it around themselves.", "action_results": [{"action": "Search the cave for the Trolls", "result": "You stand, brushing snow and some blood off your chest plate, and begin heading down one of the tunnels. The Orcs light torches, brightening up the tunnel walls. You raise your longsword, watching the walls. Shadows dance, but you see no trolls. Eventually, you come to an opening, where it opens into a massive chamber. Inside are four massive humanoid figures wrapped in bear furs. \n\n\n\"Trolls!\" You loudly whisper. \n\n\nThe Trolls are eating several dead goats which have been brutally town apart. You slowly approach, your sword raised. When you get close enough, you swing. Your blade swings, slashing through the ankles of one of them. You stab the falling troll through the side, slicing open its organs. You pull out your blade and block a swing of a stone cudgel from a troll. The Orcs quickly attack, stabbing through the legs and groin of them, killing them quickly. The Trolls collapse on the ground, where they're hacked apart by the Orcs.\n\n\n\"Good job, Orcs. Somebody start a fire. We'll take shelter from the cold, here.\"", "action_results": [{"action": "Three Months Later...", "result": "The Red Blades have survived another winter. Once again, Thraka Flameborn and Elder Dokt stand to give you an endless stream of tasks to sort out. The main three are the Farok Mines, the problem of excess warriors and the growing worship of Ka.\n\n\n\"Chieftain! We have unearthed a massive iron and coal mine down the mountain, the Farok Mines. It was used by men to supply the war machine, but was abandoned because it was left undefended and abandoned by man. Still, you have excess Orc Workers who could head down to the mines to work, with only a small amount of the profits taken being given to the Kingdom of Man in payment for using the mine. It would mean working for the Kingdom of Man, but could prove very profitable for the village.\" Thraka says.\n\n\n\"We still have mines up the mountain, Orc mines. We don't need to come crawling to the Kingdom of Man in order for a pittance of iron and coal. They'll be able to make more profit in the Orc Mines.\" Elder Dokt says.", "action_results": [{"action": "Send Workers to work in the Farok Mines", "result": "You decide that sending the workers to work in the Farok Mines is the best idea. These Workers make a small profit, but this strengthens your relationship with the industrialization complex and the Kingdom of Man.", "action_results": [{"action": "Continue", "result": "The next issue is the issue of excess warriors. The Red Blades are producing excess warriors, all young, bloodthirsty warriors who wish to fight. You can send them to fight with the Raiders, the Orcs who fight against the Kingdom of Man's expansion into Orc territory and their taking advantage of Orc Tribes and Villages. You could also send them to work as Mercenaries for the Kingdom of Man in the Man-Elf War.", "action_results": [{"action": "Send them to work as Raiders", "result": "You send your excess warriors to join the raiders. They'll fight for Orc honor and to defend the Orcs from exploitation and expansion by the Kingdom of Man.", "action_results": [{"action": "Continue", "result": "The next and final issue is the spread of a new religion. The worship of Ka, a monotheistic Creator God, has grown popular among young Orcs for reasons you're not sure. This is leading people away from the worship of the many Gods, especially Gorgok.", "action_results": [{"action": "Ban the religion of Ka", "result": "You ban the religion of Ka quickly. Its spread is stopped, and although some villagers worship him in private, most abandon him in favor of Gorgok and many.", "action_results": [{"action": "One Month Later...", "result": "You walk through the village, watching the villagers. You're tired of fighting and making decisions, so you're heading home. You reach the large chieftain's hut.", "action_results": [{"action": "Go inside", "result": "You walk inside, and are met by a small, thin figure in a dress that is far too fancy for an Orc.\n\n\n\"Ah! Mazkil! You're home.\"\n\n\n\"Sarunt! Good to see you!\"\n\n\nYou pull him into an embrace, almost crushing the figure.\n\n\n\"So? How goes work? Did you sort out the crop rotations for spring...\"\n\n\n\"If you mention crop rotations I kill you.\"\n\n\nSarunt laughs.\n\n\n\"OK then. What about the Kingdom of Man?\"\n\n\n\"What about them?\"\n\n\n\"Do we fear invasion?\"\n\n\n\"Perhaps.\"\n\n\n\"Well, enough sad news. I have some news of my own.\"\n\n\n\"Go on.\"\n\n\nYou raise an eyebrow, beckoning for her to continue.\n\n\n\"Mazkil, I'm pregnant.\"\n\n\nA rush of emotions hits you immediately. Confusion, annoyance, fear, joy, exhileration, and many more. You realize she's staring at you, so you pick to express the emotion that won't make her start crying.\n\n\n\"That's fantastic!\" You say. \"This is great! Have you visited the Shaman?\"\n\n\n\"Yes, Mazkil.\"\n\n\n\"What do they think, boy or girl?\"\n\n\n\"The Shamans don't know shit, Mazkil. They just guess and get it right half the time.\"\n\n\n\"Ah, well this is...\"\n\n\nYou hear screams outside. Fuck. You grab your blade, and raise it.", "action_results": [{"action": "Head outside to investigate.", "result": "You walk outside, and are met with an Orc child lying on the road, his face bloodied. A large Orc stands above him, who spits.\n\n\n\"Pickpockets. I fucking hate them.\" He mutters loudly.\n\n\n\"Who the fuck are you and why shouldn't I kill you?\"\n\n\n\"I am Grung Deatheater. I am part of the honor guard for Chieftain Pike.\"\n\n\n\"Chieftain Pike? Why the fuck is...?\"\n\n\n\"Chieftain, we have a visitor. Or visitors, I should say.\" A voice cries.\n\n\n\"Yes? Who is it?\" You ask, turning to Elder Dokt.\n\n\nThe old man brushes dust off his armor, and struggles to stay standing under the weight of it. Perhaps you should suggest he replace his heavy armor with some nice silk robes.\n\n\n\"Chieftain Pike of the Vengeful Wolves is here, with Chieftain Sozin of the Burning Rage and Chieftain Gorgutz of the Evil Suns.\"\n\n\nYou look back at the massive honor guard member. and shrug and head quickly back to the Main Hall. A group of twenty Orcs, with three massive figures at the front, are waiting for you.\n\n\n\"Ah! Chieftain Mazkil! We're preparing a war party to launch a raid on the Kingdom of Man's army stationed at Rubgard. They recently launched a raid against three nearby Orc Villages to take any weapons of war. They're castrating our people. We need to wipe them out to the last man. End their stranglehold on our people. We would like you and your warriors to join us.\"\n\n\n\"Sir, this is the perfect chance to fight and fend off the brutal grasp of the Kingdom of Man and free our people.\" Elder Dokt says, with more bloodlust than you'd expect from the ageing man.\n\n\nYou wonder if you should enter the war that's about to begin on the side of the Orcs. Perhaps you've already integrated into the Kingdom of Man far too much to allow yourself to attack them. Perhaps it's best you don't attack.", "action_results": [{"action": "Don't join the Orcs in rising up against the Empire of Mankind", "result": "A week later, a regiment of soldiers for the Kingdom of Man arrive, led by a large man in plate armor with a red cloak with a golden dragon on it. He enters the Main Hall, bowing as he approaches your throne.\n\n\n\"Greetings, Chieftain Mazkil. I am Sir Ignate. I was chosen by our Royal King Alexander to thank you for your refusal to attack the Kingdom's towns, cities and men. I am happy to offer you a proposal, that if you give troops and support to the Kingdom's counter-attack to wipe out the aggressors. If you accept this proposal you shall be taken on as a vassal for the Kingdom and receive our full financial and military support to allow for your expansion into aggressor territory. Will you accept our proposal, Chieftain Mazkil?\"", "action_results": [{"action": "Join the Kingdom of Mankind in repelling the Orcs", "result": "The March of Progress\n\n\n\"Yes. Yes, I will join the Kingdom of Man in their fight against the aggressors.\"\n\n\n\"Good. Fantastic, even. I'll bring this message to King Alexander. I'll make sure you''re rewarded for this, Sir. I promise you, this will help your people. Our first military action is to lead an attack on the village of the main aggressor, the Vengeful Wolves. I assume you'll help us wipe out the Vengeful Wolves' miitaryforces?\"\n\n\n\"Yes, of course.\"\n\n\n\"Good, I look forward to fighting with you on the battlefield.\"", "action_results": [{"action": "The next night...", "result": "Your stand at the edge of the Vengeful Wolves' Village, next to Sir Ignate.\n\n\n\"Storm the camp. Don't kill children at any cost, nor the non-combatants.\" You say loudly to your allies. \"Sir Ignate, what's the plan for the village when the fighting has finished? Long term, I mean.\"\n\n\n\"The village and its surrounding territory will become a conquered territory for the Kingdom. We'll have a small fort built here to maintain control, but otherwise we'll try to make sure the transition of power is as smooth as possible.\"\n\n\nYou nod.\n\n\n\"Alright. Everyone ready?\"\n\n\n\"Yes, Chieftain.\" The chorus of voices come back from your Orc, while the Men exclude the chieftain part of the reply.\n\n\n\"Alright. Let's do this. CHARGE!\" You roar.\n\n\nYou begin moving as fast as you can, your longsword raised. The Warriors of the Vengeful Wolves are clearly unprepared, having spent the previous night drinking and feasting to celebrate their recent victories in the spate of ambushes and assaults of the Kingdom. Still, Orcs are Orcs, and Orcs are always ready to fight. There's a rush of Orcs, some missing armor or only fighting with daggers or even fists, from the buildings. You swing your blade, catching one in the head and tearing his helmet off. You stab, going straight through the throat. You headbutt another Orc, sending him sprawling to the ground, where you quickly hack him apart. You thrust your blade, going though the belly of one of the Orcs. You swing, hack, slash, stab, thrust, parry block and behead for a good few minutes. The Orcs are aggressive fighters, which only means they're prone to more mistakes and leaving themselves more open to blows. You and your forces and allies use this to your advantage, quickly wiping out the militant population there. After the fighting has ceased, the Men begin searching from house to house for any soldiers to capture and weapons to be confiscated, as well as presumably anything to be looted. You see a bloodstained Sir Ignate walking among the carnage, laughing.\n\n\n\"Well done, Chieftain Mazkil. You warriors preformed admirably. We'll have this war finished in no time and I'll be able to head back to the Elves. I'm sure they miss me, and they definitely miss my blade.\" He laughs.\n\n\nYou nod, barely listening. You feel a pang of guilt for killing your fellow Orcs, not even in self defense.\n\n\n\"We have a few fights left, Chieftain Mazkil. After that, you can settle down to your village. Then, we'll be finished our work together.\"", "action_results": [{"action": "Continue", "result": "Over the next few weeks, the Orc Aggressors begin raiding and striking against the Kingdom's Forces. As Orcs, your forces are used to counter these raids and ambushes, with mixed success. Eventually, one of your scouts succeeds.\n\n\n\"Chieftain! I've found where the main Orc force is staying.\" He says proudly.\n\n\n\"Where?\" \n\n\n\"The Fields of Gorgok.\"\n\n\n\"The Fields of Gorgok? Ha! A fitting place for our final battle to take place. Send a message to Sir Ignates. We're going to war.\"", "action_results": [{"action": "Wage War!", "result": "You march forward accompanied by a massive force of Men and Orcs. The Royal Army, Red Blades Tribe, River-born Tribe, Dusk Hunters Tribe and various Orc, Human, Dark Elf and Dwarven Mercenaries heading forward to wage war. You have the main force of footmen accompanied by your best warriors and the Knights from the Kingdom of Mankind. There are also large groups of archers and a calvary of horse units, moving forward towards the enemy. After a few hours of marching, you see them. Hundreds of massive tents dot the field. You hear their lookouts blow their horns, waking the Orcs in time to prepare for the upcoming assault. Their will be no surprise assault today, you know. You raise your longsword. The blade is freshly sharpened.\n\n\n\"Charge!\" You roar, in unison with Sir Ignate and several other leaders of the army.\n\n\nYou rush forward, moving forward with immense speed. The force of military wrath that you and leading storms forward as the Orcs appear, weapons drawn and enshrined in their armor. You charge into them, an unstoppable force smashing into an unmovable object.\n\n\n\"DIE!\" You roar, swinging your blade.\n\n\nYou swing your sword, hacking off a limb that goes flying. You knee another figure and smash your hilt repeatedly into his face until it's nothing but pulp. You swing again, cutting open an Orc's stomach after it breaks through the chain mail armor. You swing again, opening a massive gash in the side of an Orc's face. You parry a strike and block another, before charging into battle with ferocity. You elbow an Orc in the face, smashing open bone and gristle with the force of your strike. You block an axe swing and remove the arm of the Orc holding the axe. You swing again, hacking off a leg and dropping an orc to one knee, allowing you to behead the Orc. You hack and swing, roaring with anger.\n\n\n\"Chieftain! Orders?\" One of your Orcs screams.\n\n\nTime to take command.", "action_results": [{"action": "Attempt to regroup and target the Chieftains", "result": "You blow a bone horn, and the Red Blades regroup around you.\n\n\n\"Target the Chieftains!\" You roar, charging forward.\n\n\nYou sprint forward, dodging spears and arrows. Eventually, you find the Chieftains, clustered together defending against an advance of enemies approaching. You roar as you and the Red Blades strike. You find the leader of this entire army, Chieftain Pike. Chieftain Pike roars, swinging his blade at you. You block the blow, ducking under another swing. You get in under Pike's reach, and headbutt him, before leaning in. You bite his throat, tearing it out. Blood flows from him as he groans, falling backwards. You roar, turning and stabbing the next chieftain through the throat. You swing again, beheading another Chieftain. Within a few seconds, the entire group of Chieftains are dead. You pick up Chieftain Pike's horn, and blow it. A loud noise erupts from the horn, and you begin to roar.\n\n\n\"Orcs! Your Chieftains are dead! Flee now or be wiped out!\"\n\n\nThe Orcs begin to panic, turning and rushing off. They drop weapons and armor in favor of the much needed speed to flee the area. The Orcs armies are routed and quickly leave. The few that remain are quickly struck down by the soldiers.\n\n\n\"Victory!\" You roar.", "action_results": [{"action": "The enemy is vanquished!", "result": "You stand on the field of battle, the bodies of Orcs and Men all around you. You wipe sweat from your brow. Sir Ignates rides up on horseback.\n\n\n\"We've done it!\" Sir Ignates laughs. \"This land is all now King Alexander's! No one can oppose him! Hail the King! Don't worry, Mazkil. I'll make sure you're rewarded. Your village will benefit from this, I swear that to you.\"\n\n\nYou look upon the corpses of your former allies, a feeling of betrayal in your mouth that you haven't tasted since Gruzub's death. You spit and shake your head. No, you did the right thing. You fought to give your tribe a future. You have succeeded.", "action_results": [{"action": "Five Years Later...", "result": "The Village has grown in the past ten years. Sir Ignates and King Alexander kept their word. The village is three times as large, although it has quite a large human population. It's the capital of the massive territory of Orc land, and is the Centre for a massive trade empire. The Red Blades have taken massive amounts of power, being essential components of the Kingdom of Man. The village is prosperous. You've done some great work for the Empire. You're now Lord Mazkil, Sir Mazkil, Chieftain Mazkil and Mazkil the Light-Bringer in response to the massive round of innovation you've brought about. That makes you laugh. You've only been on this Earth twenty five years, and look at all you've done. The World is good. You've heard rumors of a Necromancer rising and Orc rebellions that could occur, but those are small annoyances. Hell, you're glad for them, for it'll keep you busy. You sit on your throne, and the door is pushed open by a small figure cradling two tiny figures.\n\n\n\"Sarunt!\" You cry.\n\n\nSarunt, your wife, carries two small children towards you; A five year old human and a three year old Orc.\n\n\n\"Mazkil! Gruzub and Durzul miss you.\"\n\n\nYou smile as you pick up your children. You look out through the open Main Hall and smile. You've saved the Red Blades and made your own future. The World is in your hands.", "action_results": []}]}]}, {"action": "Regroup and charge the enemy", "result": "You quickly regroup, blowing a bone horn to bring the Red Blades together.\n\n\n\"Come on! There is blood to be spilt! Ha!\"\n\n\nYou break into a charge, moving quickly forward. You swing your sword, sending a head through the air. After about a minute, you've pushed your way past the Orc lines and got yourself surrounded. You take an arrow to the shoulder and fall backwards, before you take a spear through the throat.", "action_results": [null]}, {"action": "Pull back and allow the Kingdom of Man to do the brunt of the fighting", "result": "You blow a bone horn, and the Red Blades retreat. You pull back from the fighting, allowing the soldiers to move forward. You do some light support work, defending flanks and archers, which allows your forces to conquer over the Orcs. The Orc Tribes are slowly beaten back through a battle of attrition. Eventually, the Soldiers of the Kingdom of Man have begun to cease their aggression in their attacking. The Orcs are clearly beaten and bruised, unable to fight on for much longer.", "action_results": [{"action": "Charge!", "result": "\"Charge! Strike them down!\" You scream, charging forward.\n\n\nYou rush forward. You swing your blade, and your forces crash into the Orcs. The Orcs begin to break away, dropping weapons and swords to retreat from the battle. Some stay behind, but you make very short work of them. You roar as you swing your blade, slicing through flesh and shattering armor to wipe out all those who are left. \n\n\n\"Victory!\" You roar.", "action_results": [null]}]}]}]}]}]}, {"action": "Don't join the Kingdom of Mankind in repelling the Orcs", "result": "You decide against joining the Kingdom of Mankind. You don't wish to take up sides in this war. This proves to be one of your worse ideas, as both Orcs and Men have no issues raiding your village for supplies whenever they wish. Battles spill into your territory and any hunters or gatherers you send out are struck down by both sides. Your tribe begins to fall apart. Your men begin to flee, either signing up on either side of the war to take up arms against their enemies, becoming mercenaries or simply fleeing to escape the territory. This leads to the death of the Red Blades. You've failed as Chieftain.", "action_results": []}]}]}]}]}]}, {"action": "Don't ban the religion of Ka", "result": "You decide against banning the religion of Ka. The religion spreads slightly throughout the village, but fails to gain a significant foot hole among the Red Blades.", "action_results": [null]}]}]}, {"action": "Send them to work as Mercenaries", "result": "You send your excess warriors to fight as Mercenaries, fighting against the Elvish Kingdom for the Kingdom of Man, sending their profits home to the Red Blades.", "action_results": [null]}]}]}, {"action": "Don't send Workers to work in the Farok Mines", "result": "You decide to send your workers to the Orc Mines instead of the Farok Mines. They make more profit than they would've in the Farok Mines, strengthening and improving the village and Red Blades as a whole.", "action_results": [null]}]}]}]}, {"action": "Begin the long trek back to the village", "result": "You turn around, and begin trekking back to the village. Within a half hour, the cold is so brutal that you lose all feeling. The snow's bad you have no idea where you're going. After two hours of walking, you feel a sudden sensation of warmth. You begin unstrapping your armor to cool down. You're hot and tired. A quick nap in the snow would be nice...", "action_results": []}]}]}, {"action": "Attack the Dragon", "result": "\"I want the Dragon's head in Gorgok's treasure room!\" You roar.\n\n\nYou charge forward, towards the dragon, ducking under a jet of flames. You stab forward, and with Gorgok's aim, your sword slides in between a missing scale and stabs the dragon through the side. You pull out your blade and slice, making a small cut in the leathery wing. You wing your blade, knocking into the neck of the Dragon. With the combined army of Orcs and Undead behind you begin to slay the dragon. It's fire incinerates three zombies, and several weapons begin thrusting at the dragon's softer belly and face, cutting gouges and wounds. The dragon only lasts a few minutes of fighting, only killing three Orcs before its killed instantly, killing the beast. It's head thumps against the cold stone floor.\n\n\n\"Ha! Have the dragon's skull taken and dragged down back to the village. I want it put above my throne.\"\n\n\nYou turn to talk to the undead, but they've already began trudging further up the mountain. You wonder why they're leaving, but decide not to bother them. The dead have enough issues to be bothered by the living.", "action_results": [null]}]}, {"action": "Do nothing", "result": "\"I'm not going to deal with that, Orc. I want you to go, and I genuinely mean this, fuck your mother and stop bothering me.\"\n\n\nThe young orc runs off. Perhaps you were too mean to him. He reminds you of Gruzub, who you loved to degrade, insult and bully. You miss him so much. You sigh. Time to find a drink. Then, many, many more drinks.", "action_results": [null]}]}]}, {"action": "Have the Trespasser exiled", "result": "\"Hmmm... Where are the camps, trespasser?\"\n\n\n\"Sir, if I tell you...\"\n\n\n\"Don't preside to know who I am or what I'll do, trespasser.\"\n\n\n\"They're at the Morinspeck Mines, sir.\"\n\n\n\"Good. Go back there, and tell them to leave. I'll send warriors up there in a week. Anyone left there will be wiped out to the last man.\"\n\n\n\"Yes, sir.\"\n\n\n\"Go. If you're found in my land again, I'll make you beg I had killed you here.\"\n\n\n\"Yes, sir.\" He nods, standing and quickly running out of the room.\"\n\n\nYou watch him as he runs off. Well, that takes care of that issue.", "action_results": [null]}, {"action": "Leave the Trespasser go", "result": "\"Hmmm... Where are the camps, trespasser?\"\n\n\n\"Sir, if I tell you...\"\n\n\n\"Don't preside to know who I am or what I'll do, trespasser.\"\n\n\n\"They're at the Morinspeck Mines, sir.\"\n\n\n\"Good. Head back to your camps. I'm not going to harm a man for trying to feed his family.\"\n\n\n\"Thank you! Thank you, sir!\" The Man says, cupping his hands in praise.\n\n\n\"I'm confused why you're still here.\" You say, and the man jumps to his feet and quickly runs off, out of the Great Hall.", "action_results": [null]}, {"action": "Welcome the Trespasser to join the village", "result": "\"Hmmm... Where are the camps, trespasser?\"\n\n\n\"Sir, if I tell you...\"\n\n\n\"Don't preside to know who I am or what I'll do, trespasser.\"\n\n\n\"They're at the Morinspeck Mines, sir.\"\n\n\n\"Good. Well, I'll give you a choice, trespasser. You leave my lands with the threat of death if you return, or you join the Red Blade Tribe as a Free Worker with no blood or legal connections to the tribe.\"\n\n\n\"Sir?\"\n\n\n\"We have hunting grounds and farmlands that go unused. If you wish to work, I'll give you the chance to do so.\"\n\n\n\"Yes, sir! Thank you, sir!\"\n\n\nOver the next few days, the refugees from Morinspeck Mine arrive, and are given jobs so they can get food, water and beds in the village.", "action_results": [{"action": "Two Weeks Later...", "result": "Due to your choice in accepting the refugees from Morinspeck Mine, there are more refugees arriving. Most are humans from destroyed or attacked villages looking for a safe place to work, though a few are Wood or Dark Elves who do not wish to partake in the war. They're all requesting to take up work as Hunters, Farmers or Craftsmen in your village.", "action_results": [{"action": "Allow them to join", "result": "You welcome these refugees into your village, both for ethical and economic reasons. This allows your village to expand as your population experiences a boom.", "action_results": [null]}, {"action": "Don't allow them to join", "result": "You decide enough is enough. You're not a safe haven for every coward and weakling who cowers from war.", "action_results": [null]}]}]}]}]}, {"action": "Don't send young Orcs to the College", "result": "You decide against sending away the Orcs. They wouldn't be able to learn important skills such as farming, fighting, hunting and cooking, only to be left with skills in money-handling or Magics that don't help them in their life.", "action_results": [null]}]}]}]}, {"action": "Talk to the feasting Orc", "result": "You walk over to the feasting Orc and sit next to her.\n\n\n\"Hello. Are you enjoying the food?\"\n\n\nThe Orc raises an eyebrow, decides you're not joking, and nods.\n\n\n\"Yes, Chieftain.\"\n\n\n\"I don't recognize you. What's your name?\"\n\n\n\"Dag. Dag Unbroken.\"\n\n\n\"Unbroken? How do you get a title like that?\"\n\n\n\"I've broken every bone inside my body besides my right shin.\"\n\n\n\"Fuck me.\" You say, obviously impressed.\n\n\n\"I'm not opposed to the idea.\" Dag says.\n\n\nAt that moment, you realize picking up warriors is a lot easier than you thought.", "action_results": [{"action": "Continue spending time with Dag", "result": "You spend the next few hours talking with your newfound mate. Dag is strong, though, aggressive and violent, which reminds you of a more \"you\" you. You'll make sure that your relationship continues and develops into what could be a prosperous marriage.", "action_results": [null]}]}, {"action": "Talk to the reading Orc", "result": "\"I like him.\" You say, pointing to the reading Orc.\n\n\n\"What, Sarunt? He's a male, he can't bear your children.\" Dokt says, annoyed.\n\n\n\"Many Chieftains were adopted. Dadic, for fuck's sake.\"\n\n\nDokt rolls his eyes, but nods. You stand from the throne, and walk down to Sarunt.\n\n\nYou walk over to the reading Orc, and smile.\n\n\n\"Hello.\"\n\n\n\"Hello.\" He replies, looking up from his book.\n\n\n\"I am Chieftain Mazkil.\"\n\n\nHe chuckles.\n\n\n\"I might spend far too much time in a book, but I still know enough to know who the Chieftain is.\"\n\n\n\"Ah. Good.\" You reply, awkwardly.\n\n\nYou realize while you're very skilled and courageous in the art of warfare, you suck at flirting. Thankfully, he's better and very interested.\n\n\n\"So, do you want to get a drink, Mazkil?\"\n\n\nYou nod eagerly, and head over to the drink stand.", "action_results": [null]}, {"action": "Talk to Ironsoul", "result": "\"I like him.\" You say, pointing to Ironsoul.\n\n\n\"What, Ironsoul? He's a male, he can't bear your children.\" Dokt says, annoyed.\n\n\n\"Many Chieftains were adopted. Dadic, for fuck's sake.\"\n\n\nDokt rolls his eyes, but nods. You stand from the throne, and walk down to Ironsoul.\n\n\n\"Hello. Ironsoul, is it?\" You ask.\n\n\n\"Dag. Dag Ironsoul. It's Dag to you, 'less I gotta call you Chieftain, Mazkil.\"\n\n\n\"How are you, Dag?\" You ask.\n\n\nSomehow, despite your ability to show courage in any fight, you abilities to get chicks aren't particularly good. Thankfully, Dag's just as crude.\n\n\n\"Do you want something, Mazkil?\"\n\n\n\"I was just asking about you as a person. We don't get to talk much.\"\n\n\nDag raises an eyebrow.\n\n\n\"Are you trying to fuck me?\" He asks indignantly. \"Because I won't refuse a piece of ass, but I'm not going to whine about my day like a Man's wife.\"\n\n\nYou smile.\n\n\n\"That simplifies things.\"", "action_results": [null]}]}]}, {"action": "Don't agree to trade with the Kingdom of Man", "result": "\"No. I will not sell the honor and heart of this village to some merchants only to be ripped off later.\"\n\n\nThe Merchant's face falls and he immediately turns ratty.\n\n\n\"Fine. Let this village become an abandoned ghost town in the hills that your children will be dying to get out off. Let's go!\"\n\n\nThe Merchant Caravans begins to turn around and leave. You know that you've saved your little town from being steam rolled by the massive trade machine of the Kingdom of Man.", "action_results": [null]}]}]}, {"action": "Lay an ambush", "result": "\"Darkwit. Your plan is good. Jakku, I'm not leading my men into a charge when we have the perfect trap right here.\"\n\n\n\"Yes, Chieftain.\" Jakku nods.\n\n\nYou have Darkwit hide in a vantage point in the trees, the bodies stacked into defensive walls to block enemy escape once they've entered the killzone. You have warriors hide at various points to be able to charge the killzone once the raiders have arrived. You patiently wait, hidden in bushes and undergrowth. One hour passes quickly, the second takes long, but after two and a half hours, the raiders are here. They march, three Caravans in tow, no doubt from a recent raid. They break into a jog when they sight the camp, heading straight into the killzone while confused and unprepared.\n\n\n\"STRIKE!\" You roar.\n\n\nYou break into a run, swinging your blade. The Raiders are surrounded, and they're simply unprepared to face you. You swing your blade downwards, hacking off an arm, and headbutt a raider before running him through with your sword. You dodge an axe swing and cleave the Orc in half. You launch yourself into the fray, and hack a raider to death. The Raiders are beginning to turn and run now, but you slice the back of the legs of one of them and stab them through the chest, breaking through their armor and into the soft flesh beneath. The rest manage to make it past the junk walls you've set up and head off to find safety. \n\n\n\"Chieftain! We are victorious!\" Darkwit laughs happily.\n\n\n\"Losses? Kills?\" You ask.\n\n\nOne of the scouts quickly begins tallying the dead, and turns to you.\n\n\n\"Sir! We lost six men. They lost forty nine.\"\n\n\nDarkwit grins.\n\n\n\"Yes! I told you my plan would work. We almost wiped them out and lost very few.\"\n\n\n\"Yes. Have the scouts find our dead and bring them back to the village for the funeral pyre. Orcs, let's head home.\"", "action_results": [null]}, {"action": "Search out and lead a charge against the Raiders", "result": "\"Darkwit, go, take who you need and scout ahead for the raiders. Jakku, make sure the men are ready. We''re going to charge the raiders and wipe them out to the last orc.\"\n\n\n\"Yes, Chieftain.\" Jakku barks, before running away.\n\n\nThe Orcs quickly regroup as the scouts sprint off in search of the raiders. You wait with your allies for two hours, before one of the scouts breaks through the treeline.\n\n\n\"Chieftain! They're coming! They were about an hours march away last I saw, but at the pace they were moving they're only half an hour away.\"\n\n\n\"Good. Let's move. Orcs! Get ready to fight. In fifteen minutes, our swords'll be deep in Raider blood.\"\n\n\nThe Orcs all bark responses in the affirmative, and you begin moving forward towards the raiders. It seems the scout under-exaggerated the raiders speed, because it takes twenty minute to finally meet the raiders. A massive group of Orcs, with three Merchant Caravans in tow, no doubt from a recent raid. \n\n\n\"Orcs! Now is the time to spill blood! CHARGE!\" You scream.\n\n\nYou raise your sword, charging forward with your Orcs. The Raiders aren't prepared to fight, but they're still armed from their previous raid and they're still Orcs. You swing your blade downwards, hacking off an arm, and headbutt a raider before running him through with your sword. You dodge an axe swing and cleave the Orc in half. A Warhammer smacks you in the chest, launching you backwards. Your head bangs against a tree, and you stand and charge forward again. You launch yourself into the fray, and hack a raider to death. The Raiders are beginning to turn and run now, but you slice the back of the legs of one of them and stab them through the chest, breaking through their armor and into the soft flesh beneath.\n\n\n\"Chieftain! We are victorious!\" Jakku roars happily.\n\n\n\"Losses? Kills?\" You ask.\n\n\nOne of the scouts quickly begins tallying the dead, and turns to you.\n\n\n\"Sir! We lost thirteen men. They lost thirty seven.\"\n\n\nJakku roars victoriously.\n\n\n\"Yes! I told you we didn't need cowards tactics. We wiped them out and sent the rest running.\"\n\n\n\"Yes. Have the scouts find our dead and bring them back to the village for the funeral pyre. Orcs, let's head home.\"", "action_results": [null]}]}]}]}]}, {"action": "Let him regain his fighting stance", "result": "He quickly regains his fighting stance, raising his weapon. The fight only lasts another minute, with you barely blocking the next few of his attacks. Eventually, he sweeps your legs and he falls to the ground. Gruzub raises his sword and swings it, smashing into your chest. You attempt to rise to Gruzub's surprise, so he quickly kicks you in the head, and you fall into unconsciousness...", "action_results": [{"action": "Awaken", "result": "You awaken in the Shaman's hut. You wounds are bandaged and you're covered in various ointments, creams and bandages meant to speed up healing. You groan, and get out of the bed. The Shaman walks over to you, checking your temperature.\n\n\n\"You shouldn't be walking around.\" The Shaman says.\n\n\n\"Fuck you.\" You grunt.e way.\"\n\n\n\"I couldn't kill you. You deserve a much longer, slower death at the hand of someone not as strong and good-lucking as me.\"\n\n\n\"Fuck you, Gruzub.\" You laugh.\n\n\nYou grab the softest woolen tunic you can find and put it on. You walk outside, and wince at the bright son. You spot Gruzub, wearing freshly acquired beads and necklaces to indicate that he is the new chief. He grins when he sees you.\n\n\n\"Mazkil!\" He rushes over to you, and hugs you. \n\n\nYou wince as his hug tightens, but manage to show no pain.\n\n\n\"How's your new promotion?\" You ask.\n\n\n\"It's boring. Papa always made being a Chieftain out to be fighting, fucking, eating and drinking. I've just been given the job of organizing crop rotations.\"\n\n\nYou laugh, and pat him on the back.\n\n\n\"Sorry to hear. Thanks for not killing me, by th\n\n\n\"Seriously, you should've won that fight.\"\n\n\n\"Maybe.\" You shrug. \"Tell me somebody at least shot that goddamn eagle.\"\n\n\n\"It left before anyone could. And I was talking about when I lost my helmet.\"\n\n\n\"I considered it, but decided that I'd prefer to let you organize the... what did you call it? Crop rotations?\"\n\n\n\"Yeah.\"\n\n\nYou stand in silence for a few minutes, staring at the rising sun.\n\n\n\"What do you plan to do, Mazkil? Will you stay here and help the tribe?\"\n\n\n\"No, the tribe is your place. I want to travel. The Kingdom of Man are desperate for new soldiers to help them fight the Elves.\"\n\n\n\"Hmmm... When are you leaving?\"\n\n\n\"Soon. Very soon. I don't want to have to go through the whole goodbye deal with the tribe.\"\n\n\n\"I understand.\"\n\n\nOnce again, you brother pulls you in for a hug.\n\n\n\"I'll miss you.\"", "action_results": [{"action": "Three Days Later...", "result": "You walk on the road, the village behind you. Your sword is one your back with a bag of some food, water and goods.\n\n\nThe Kingdom of Man is recruiting soldiers for the Royal Army. They're planning to attack the Elves again, and want as many men as they can. You could receive good pay, free weapons and equipment and possibly make a name for yourself there. You've always hated the Elves, anyway.\n\n\nTime to become a Soldier.", "action_results": [{"action": "Join the Royal Army", "result": "The Path of the Soldier\n\n\nIt takes three days to find the nearest Royal Army Fort, a large stone castle surrounded by a village and a large series of tents where the men stationed here are staying. When you arrive and say you wish to join up, you’re given a new steel sword, a large shield, some polished plate armor with the symbol of the king on the chest plate and a small starter’s wage. You’re told as an orc, they assume you’ve already trained in warfare; a racist, yet accurate assumption, so you’ll need no new training. You’re given a bed in Beast Regiment, which you’re told is the only regiment that can afford to take extra men.  You quickly realize this is bullshit, as Beast Regiment is the only regiment to hold Orcs.  You recognize Black Horn, Gold Tusk, Dead Eye, Iron Flame, God Killer, Hardclaw and Bearfoot Orcs all there,sitting around a hearth in a small stone barracks. One of the larger orcs, who wears a shiny helm with the Gold Dragon, the symbol of the King, on it.\n\n\n“Greetings, recruit. I am Captain Darruk. Name and tribe.”\n\n\n“Mazkil Boarsbane, Red Blade.”\n\n\n“Ah, the Red Blades are still alive, are they? Had a Red Blade a couple years back, who managed to behead a dragon. He just ran up, jabbed it in the eye a few times and took a swing. Darkin Dragaonskull. Hell of a sooldier. Perhaps you’ll be as good if you do what I say and don’t cause any fights, but make sure to end any we get in.”\n\n\n“Sure thing, sir.” You struggle with the sir part, but you assume it’ll get easy over time.\n\n\n“Sir? Ha, you’re already using sir. I think you’ll impress me, Mazkil.”\n\n\nYou notice a massive Orc that towers over the rest of you, his armor covered with what you assume are kill notches. You make sure to keep an eye on him. You find your bed, and collapse on it. It only takes a few minutes before you're allowed to fall into a dull, dreamless sleep.", "action_results": [{"action": "Two Weeks Later...", "result": "You march through Elf territory with a little over 50 other Orcs, marching through a hilly area with some trees. You've been sent with Karn Deathreaper, the massive orc with the notched armor, to investigate a small Elf War Party. You've yet to experience any real combat, with your previous time here simply being maneuvering into flanking positions to force the enemy to retreat and moving forward. Still, the sun is particularly red, so you there'll be a battle today with Gorgok watching.\n\n\n\"Orcs! Halt!\" Karn screams, and you stop moving.\n\n\nKarn Deathreaper truly earned his name. The amount of enemies he's slain is among the hundreds if not thousands. He's a fearsome creature, and you can't wait to see him do battle.\n\n\n\"The sun wishes us good luck. We'll do well in the battle.\" One of the Orcs near you says happily.\n\n\n\"Cease your superstitions, Nagrak. We might not even fight today.\" Another replies.\n\n\n\"One can hope.\" Nagrak eagerly replies.\n\n\nIn the blink of an eye, a dozen Orcs are dead. You see six Elves standing on top of the hills, light golden armor and long blond hair holding bows.", "action_results": [{"action": "Raise your shield in defense", "result": "You raise your shield, and three arrows thuds into it.\n\n\n\"Orcs! Regroup, and keep those shields up!\" Karn screams.\n\n\nYou huddle together, and as a group begin rushing uphill rapidly towards the Elves. The Elves fire a few more arrows at you both, but quickly turn heel and run. You reach the summit of the hill and watch as the Elves disappear into a small woods down the hill.\n\n\n\"Come on, Orcs! We follow them and make sure the worms can feast on Elf Flesh tonight!\" Karn yells.", "action_results": [{"action": "Follow Karn into the woods", "result": "Karn lets out a war cry and breaks into a full sprint towards the woods. You follow, your shield covering your chest and your sword raised. As you burst through the trees and run through the undergrowth, you hear a yell.\n\n\n\"Fire!\"\n\n\nArrows fire down from the trees. After ten seconds which you spend huddled together with your allies, arrows thudding into your shield, half of your group is dead. Then, Elves Warriors with short swords heavier armor than the archers, though still a lot lighter than yours, coming to wipe out the unprepared, cowering Orcs that remain.", "action_results": [{"action": "Act defensively to protect yourself", "result": "You bring up your shield and raise your sword. The warriors quickly take advantage of the situation, attacking the unprepared Orcs attempting to take shelter from the arrows. One of them goes towards you, and swings. You block his sword with your shield and repeatedly jab him through the stomach, the third stab penetrating his armor and going through his stomach, which after a few more stabs kill him.By the time the Orcs manage to fend off the Elven Warriors, they're barely a dozen men, including Khan. The Elves outnumber you, but only slightly, and they clearly either don't like their odds, or figure they've killed enough of your allies today. The warriors quickly turn and go sprinting off into the woods.", "action_results": [{"action": "Follow the Warriors", "result": "You quickly follow the warriors, breaking into a sprint. You refuse to let them escape. After a few minutes, the warriors pause and turn. You realize none of the other Orcs have followed and you're on your own. You raise your sword to fight, but the warriors charge. You swing your sword and manage to decapitate one, before receiving over a dozen stabs to the chest.", "action_results": [null]}, {"action": "Attack the Archers in the trees", "result": "You roar, running forward and jumping in the air. You grab an archer perched on one of the branches who screams, flinging her to the ground. You quickly end her miserable existence, thrusting your sword through her neck. You see another archer leap from the trees in order to escape, but slash his legs, causing him to fall to the ground. You stand above him and stab downward, stabbing him through the chest, killing him. An archer leaps onto you with a hunting knife and slices you across the back of the neck in a failed attempt to murder you. You fling him off your back and to the ground and slice open his stomach. You look up, to see the rest of the archers sprinting incredibly fast away from the battle.\n\n\n\"Don't bother chasing. You can't catch an Elf. They've ran their entire lives, the cowards.\" Karn says. \"Come on men. Let's get back to camp.\"\n\n\n ", "action_results": [{"action": "One Day Later...", "result": "You sit at the camp, at the edge with a campfire, a pig roasting on a spit. You wait eagerly for your meal, before Captain Darruk arrives.\n\n\n\"Mazkil, come with me for a moment.\"\n\n\nYou struggle not to snarl in annoyance, knowing you'll miss the best cuts of pork, but nod and follow Darruk anyway. You follow him out of ear range of the camp, before he starts speaking.\n\n\n\"You were with Karn on the mission yesterday, correct?\"\n\n\n\"Yes, sir.\"\n\n\n\"We lost a massive amount of men for a mission that important. I need to know: Was it Karn's fault as a leader?\"", "action_results": [{"action": "\"Yes.\"", "result": "\"Ah. I thought so. The other men's testimony said as much. Thank you. Now go, eat.\"\n\n\nYou nod, and quickly return to eat. You have to punch one of the smaller Orcs, but you manage to grab a large, juicy piece of meat and eagerly chew into it.", "action_results": [{"action": "One Week Later...", "result": "You stand around a massive map, showing the Glenin Plains. Captain Durrak begins explaining the situation.\n\n\n\"Captain Rhian is leading the Royal Calvary forward to engage the Elvish Calvary at multiple locations. We're positioned here to launch attacks on the calvary as the rearguard crosses Jacob's Bridge and the small unnamed brick bridge here. I'll lead the main patrol on Jacob's Bridge. Karn, lead a force of your chosen orcs.\"\n\n\n\"Yes, sir.\"\n\n\nKarn chooses two dozen Orcs, to your surprise he hasn't chosen you, for reason's you don't know. You then follow Captain Durrak as you head towards Jacob's Bridge. Thankfully, the Elvish Calvary haven't arrived, so you take up positions.\n\n\n\"Alright, stay low, and don't attack until I say so. Got it?\"\n\n\n\"Yes, sir.\" You all reply in unison. \n\n\nThe Bridge is a large wooden bridge over a massive muddy creek. You take position at the edge of the bridge so you can storm on and wipe out the calvary's rearguard. A large group of Elves aboard beautiful white horses begin galloping past. They gallop past for a good thirty seconds, before there's a small break in the amount of horses galloping past. \n\n\n\"Now! Take them all out!\" Captain Durrak roars.\n\n\nYou leap out of the muddy river bank and onto the bridge. The small Elvish Calvary's Rearguard, meant to defend their flanks and make sure they have the option to retreat, is only about three dozen Calvary units, and you have as many Orcs with you. You see the the lead of the rearguard, a golden armored Elvish Warrior, is on a horse which rears up in terror. ", "action_results": [{"action": "Charge forward to target the leader", "result": "You sprint forward with your sword raised, roaring. You slash the horse's chest open, and the horse whinnies in terror. The leader falls from the horse, and you quickly stand over him, raising your blade. Suddenly, a spear flies through your chest, tossed by one of the Calvary Units. You groan as the spear embeds itself in you.", "action_results": [null]}, {"action": "Stick with the group and raise your shield", "result": "You stick with the group, deflecting spears off your shield. You move forward, stabbing your blade forward as your shield stays raised to deflect any blows. You stab a Elf Rider through the thigh and he screams, falling off the horse, where you stomp repeatedly on his face. You swing your blade again, slashing a horse's chest and causing it to rear up in terror. The Elf falls off and hits the ground, allowing for an Orc to stand over it and stab it through the chest. The melee only lasts a few seconds, as the Calvary Units are desperately massacred as they're clearly surprised and unprepared for fighting, struggling to find their weapons and prepare to fight. Several Orcs armed with crossbows contribute to the massacre.\n\n\n\"Alright. Losses?\" Captain Durrak asks, as you survery the battlefield.\n\n\n\"Twelve Orcs fallen. Three wounded.\"\n\n\n\"Two. I can still fight.\" One of the Orcs grunts, pulling a spear from her side.\n\n\n\"Alright, begin stacking the horse carcasses into a barricade.\"\n\n\nYou grab one of the dead horses, and begins dragging it into place, placing it on top of another dead horse. After a few minutes, you take position on the bridge. You hear screams from the main battle, as you watch the calvary battle take place in the form of jousts and sword-fights from horseback. You grab a spear from one of the dead Calvary Units, smiling.\n\n\n\"This could be useful. Sir, if we use the Elvish Spears, we could assist in the battle.\" You point out to Captain Durrak.\n\n\n\"This would be risky. We need to stay here to defend the bridge.\" Captain Durrak says.", "action_results": [{"action": "Offer to go ahead alone", "result": "\"I'll go ahead and assist our men. Alone.\"\n\n\n\"Ha! You're a mad man, Mazkil. If you want to play with the horses, go straight ahead.\"\n\n\nYou creep forward quickly, your new spear raised. The battle is going brutally. You move quickly, first going towards a Elf jousting with a human knight, with the knight heavily injured and bleeding from a stab wound in the side. You stab your weapon while the Elf is distracted by the knight, killing the Elf with a quick impalement through the side. You take your spear out, and move forward to the next target, an Elf engaged in sword fighting. You keep low to avoid being seen, and quickly jab the elf through the neck and pull him off the horse and withdraw your spear again. You repeat this, using your spear and stealth to repeatedly stab the various elf riders and Calvary Units to allow for your own calvary to beat back the Elves. Your contribution is minor, but as your own forces are already winning, the few Elves who survive quickly head to the bridges, where they're presumably wiped out. You wipe Elf and Horse blood off your face, and begin wandering towards the bridge. You arrive to find dozens of dead Elves and horses, with Captain Darruk laughing victoriously.\n\n\n\"Mazkil, you're alive. This is good. The Elves have been wiped out.\"\n\n\n\"I took out as many as I could, sir. I did my part.\"\n\n\n\"Good. Now, we have work to be done. With the advance of our calvary, we can finally begin to invade and launch attacks on the Elvish Villages.\" Captain Darruk says. \"The Elvish empire is crumbling, boys. Take what you want off the dead, kill the wounded, and we'll head back to the Fort and find something to drink.\"", "action_results": [{"action": "One Week Later...", "result": "You walk along the woods with a small group. Twenty Orcs, thirty Men and a dozen War Hounds. You're led by Captain Darruk, who stands proudly at the lead.\n\n\n\"Recent Elves have attacked our forces, and taken heavy losses. We believe they've retreated to the village of Abhaile to resupply and have their wounded taken care of. I want this threat dealt with.\"\n\n\nYou gently pat one of the war-hounds on the head, amused by the cheerful dog. Suddenly, the war-hounds burst forward, barking.\n\n\n\"Here we are. Orcs! No looting, killing or anything of the sort! Once the village's secure, we stay here for the night.\"\n\n\n\"Yes, sir.\" You all respond.\n\n\nYou march forward past the trees, and see the village. It's a large village, with many homes, all wooden and natural looking, reminding you of several rich men's summer homes you passed on the march to Elf Territory. Many of the civilians notice, and begin to yell and hurry inside.\n\n\n\"HOLD IT! This village is under control of King Alexander and the Royal Army!\" Captain Darruk barks. \"Search house to house! Confiscate any weapons. Kill any soldiers or those trying to resist.\"\n\n\nYou nod, and quickly hurry towards the houses. Inside the first you enter is a small girl holding desperately to a stuffed toy, with her mother standing defensively in front of her, a dagger clutched in her hands.\n\n\n\"Stay out!\" She cries.\n\n\nYou look at her briefly, before ignoring her. You quickly search the upper floor and confiscate a bow, some arrows and three hunting knives, before returning downstairs. The house is empty except for the mother and daughter.\n\n\n\"Give me the blade.\" You ask.\n\n\n\"Get out of my house!\" She shrieks, and you wince.", "action_results": [{"action": "Kill her", "result": "You swing your blade, slashing her chest. She falls backwards, hitting the floor with a thud as the daughter screams. You grab her knife, and look to the daughter. You feel a brief wave of pity, but quickly suppress it.", "action_results": [{"action": "Move onto the next house", "result": "You walk into the next house. A young Elf, as young as you, stands behind the door holding it closed. You smash the door open and he rolls to his knee, his bow readied with an arrow notch.\n\n\n\"Drop the bow.\" You say, raising your shield.\n\n\nHe fires, and you easily knock the arrow aside. One quick swipe, and his head is lying on the floor. You search the bottom floors, finding nothing, but upstairs you find another barricaded room. Using your impressive strength, you smash open the door with brute force. Four Elf Warriors are in the room, covered in bandages and with visible wounds. You quickly slash your sword killing one, kicking another in the head and stomping on his throat repeatedly, crushing it. You stab another one through the chest to kill him, and stab the final one through the eye. As his body hits the ground, you notice a backroom. You open it, to find a small stack of Elvish Jewelry. Golden bracelets studded with golden gems, eloquently designed necklaces and a golden ring with a large ruby. Your orders are to leave all valuable items to be taken at a later time by Captain Darruk to be used to buy supplies and food, but... shiny.", "action_results": [{"action": "Take the valuables", "result": "You smile as you sweep the valuables into your satchel. You've fought for the Royal Army for tiny wages, you deserve these valuables. Time for the next house, you still have an important job to do.", "action_results": [{"action": "Search the next house", "result": "You walk into the next house, to find an Orc already in there. A beheaded elf lies across the floor, a pool of blood spreading across the floor. The Orc, a short but tough man you recognize as Kannish. He's holding a half undressed Elven Woman, forcing her against the wall.\n\n\n\"Shut up!\" He roars, before noticing you. \"Mazkil? I'm busy here, my friend. There's another one upstairs if you want a go. Otherwise, you should probably get out there while the looting's good.\"\n\n\nYou look at the woman, tears streaming down her face, and wonder what to do.", "action_results": [{"action": "Stop Kannish", "result": "\"Kannish! Release her!\"\n\n\nKannish stops smiling, and snarls.\n\n\n\"What, have you fallen in love, Mazkil? Fuck off, or this shit gets bloody.\"", "action_results": [{"action": "Leave the building", "result": "You walk outside, and continue searching door to door, although you wince as you hear her cries for help behind you.", "action_results": [{"action": "Search the next house", "result": "You walk outside, and as you go to the next house, you hear a scream.\n\n\nYou turn to see a large house has erupted into flames that are quickly growing. Captain Darruk sprints over, followed by you.\n\n\n\"What's going on?\" Captain Darruk asks.\n\n\n\"We were putting the civilians in this house when they resisted, so we torched the place.\" One of the Orcs explains.\n\n\nYou see civilians; men, women and children rushing out of the building as it rapidly erupts into flames. You hear crying coming from the top floor, a high pitched noise that could only come from an infant.\n\n\n\"Captain! There's a baby in there!\"\n\n\n\"There's nothing we could do. The flames would kill anyone who tries to enter.\"\n\n\nYou watch the building, flames licking the sky. You see a small gap in the flames that someone could easily use to get inside.", "action_results": [{"action": "Attempt to save the baby", "result": "You charge into the building despite the protests of your team-mates. You dive into a flaming inferno, the heat causing you to sweat profusely and groan in pain. You look around, but smoke obscures your view. You begin to cough and splutter, dropping low. You reach around looking for the stairs. You manage to find it, and begin to clamber up the staircase, following the cries and screams of the babies. The flames begin to sear and burn your flesh as you wince in pain, groaning loudly. You reach the top of the staircase, looking around desperately for the baby. You find a small cradle covered in ash and embers, which you brush off and pick up a bundled up, ugly and loud creature you recognize as a baby. You pick it up, and look for a way out. By now, the room's full of smokes and the fire's spread everywhere. You go to leave, but a roof beam collapses down and smacks you in the back and you fall to the knees as the flames begin to sear your flesh. You scream, and roll out of the way, curling around the baby to protect it. You find your way through the smoke and flames while doing your best to protect the infant. You charge through the door and find your way outside, and fall onto the cool grass. Your flesh is burned and scorched, and you struggle to stay conscious. An Elf picks the baby up and says something, presumably thanks.", "action_results": [{"action": "Fall unconscious", "result": "You awaken a few hours later, lying on a bed. You're heavily bandaged, lying next to several dozen sleeping Orcs and Men. Captain Darruk had the Medic take care of you, it seems, and you've been dumped to heal next to the sleeping soldiers. You assume you'll be taken back to the nearest fort to be taken care of until you've healed up enough to head out to war again. \n\n\nYou lie in the silence, trying to fall back to sleep. Then, you hear a window shatter. You look around, and struggle to get up. Thankfully, the Medic's left your knife on you. You look around, before a fist smashes into the side of your head, knocking you backwards. You try to scream, before you feel the cold steel of a blade on your throat. You look up, to see a short Elven sword being held by a tall elf.\n\n\n\"Say your prayers, Orc.\" He says.\n\n\nYou grab at his throat, but he quickly deflects your hand. As he goes to slice open your throat, you see a hand stop him. You notice another Elf stop him.\n\n\n\"Wait. Don't.\"\n\n\n\"Why shouldn't I?\"\n\n\n\"He helped us earlier. He saved Gwendilyn's child.\"\n\n\nThe Elf with the sword shrugs.\n\n\n\"Fine.\"\n\n\nYou look around. The room's filled with a group of Elves, all armed for war. It appears you're the first to awaken. With the serious burns covering your body, you'd struggle to do anything physical. You could still warn your team-mates, though.", "action_results": [{"action": "Scream for help", "result": "\"We're...!\" You begin to yell.\n\n\nThe flat of the blade smashes into your face, knocking you unconscious.", "action_results": [{"action": "Awaken", "result": "You scream as you awaken and are hit with a fresh wave of pain. You look around. You're surrounded by slaughtered Orcs and Men, many killed in their sleep, but it's clear some awoke in time to resist. You attempt to stand, before collapsing on the floor. The pain is all-consuming, and you consider allowing death to overtake you and end your struggle to survive.", "action_results": [{"action": "Search the surrounding area", "result": "You look around for something to help you out of this predicament, and you find a small bottle of a blue liquid. ", "action_results": [{"action": "Drink it", "result": "You down the drink, and shiver as the pain begins to cease. You notice not only is your pain ending, but all your feelings are. Shortly after, your body begins to enter paralysis. You wince and shiver as you chest begins to slow, ending your breathing. You struggle to continue breathing, but you only manage a few more painful seconds of existence before you pitiful existence ends.", "action_results": []}, {"action": "Don't drink it", "result": "You decide not to drink it. You know that you need to get moving soon, to escape before nightfall, but hold on to the fact their still might be something useful nearby.", "action_results": [{"action": "Drag yourself outside", "result": "You drag yourself outside. The village is packed with dead Orcs, Men and War Dogs, interspersed with the golden armored Elves who your allies managed to strike down. You continue dragging yourself forward, passing the dead. Vultures land around you and begin pecking at the corpses. One lands in front of you and pecking at your face.", "action_results": [{"action": "Grab the Vulture", "result": "You grab the Vulture, tearing the vulture's head off its neck and tossing it aside. You begin dragging yourself forward once more.", "action_results": [{"action": "Four Hours Later...", "result": "You move your hands forward and find something to drag yourself another few inches forward. Thankfully, the leaves grant you some shade from the hot sun, but the pain's beginning to become unbearable. Then, as if the Gods have all agreed to fuck up your life, you hear wolves. \n\n\n\"Fuck you!\" You scream, as three wolves begin prowling towards you.", "action_results": [{"action": "Fling your knife at one", "result": "You throw your knife, impaling one of the wolves' in the head, killing it instantly. It falls backwards, and you feel pride briefly, before another one of the wolves leaps at you, landing on your chest. It bites down on your chest, tearing through flesh at you let out a scream.", "action_results": [null]}, {"action": "Try defend yourself with your blade", "result": "You swing your blade, slashing open one of their eyes. You stab again, killing the wolf, but get your knife lodged in it's head. Another one leaps forward, and bites your arm.", "action_results": [null]}]}]}, null]}, {"action": "Continue searching", "result": "After another few minutes of searching, you find a small silver flask with a red cross on the front strapped to a medic's belt, which you recognize as a healing potion, and eagerly drink down. As you feel the warm liquid go down your throat, it warms your soul and ends, or at least lessens your pain. Your energy renewed and strength revitalized, you begin dragging yourself yourself out of the building and off in search of help.", "action_results": [null]}]}]}, null, {"action": "Embrace the sweet release of death", "result": "You stop fighting, and allow the sweet painlessness of death to release you from the constant pain.", "action_results": []}]}]}, {"action": "Stay silent", "result": "You stay silent, and the Elves quickly make their way through the room, slaughtering all those across the room, slicing open their throats and stabbing them through the hearts. Eventually, everyone in the room lies dead across the floor. The Elf who had held his blade to your throat takes a final look at you, before leaving you alone in an empty room. After a few minutes, pain begins to sear from your burns as your medicine wears off, and you lie their, struggling to stay conscious through the pain, which you eventually fail at doing.", "action_results": [null]}]}]}, {"action": "Do nothing", "result": "You stand, watching the building burn with a few uneasy soldiers and sobbing civilians being kept from entering the building for fear of their brutal death.`Thankfully, the baby's cries only last another few minutes as smoke spreads throughout the house. Once it ceases, Captain Darruk nods.\n\n\n\"Alright, everyone. Back to work. Continue searching.\"\n\n\nYou search the next few houses, but the populace is either dead or cowering, allowing for you to find a few small weapons stockpiles. Eventually, you finish up and find an empty house to sleep in. Captain Darruk assigns a few Orcs on guard, but thankfully you're not one of them.", "action_results": [{"action": "Rest", "result": "You awaken a few hours later, lying in a bed. You've woken up again.\n\n\nYou lie in the silence, trying to fall back to sleep. Then, you hear a window shatter. You look around, and struggle to get up. You draw your knife slowly. You look around, before a fist smashes into the side of your head, knocking you backwards. You try to scream, before you feel the cold steel of a blade on your throat. You look up, to see a short Elven sword being held by a tall elf.\n\n\n\"Say your prayers, Orc.\" He says.", "action_results": [{"action": "Lunge at him", "result": "You lunge forward, grabbing his wrist and flinging the sword away. You grab his head and bring your knife up, repeatedly stabbing him through the eye. Another Elf runs forward and slashes your chest open, and you smash his head across the room, and fling him repeatedly against a wall unless his body's shattered. You slash another Elf's throat open, before the Elves surround you. You roar as every single Elf begins slashing at you. Blood begins down to streak down your chest as thousands of cuts and slashes open all over your body. You only last a few seconds of brutal pain before you collapse on the floor.", "action_results": [null]}, {"action": "Beg for mercy", "result": "\"Please. I won't say a word, just...\" You begin.\n\n\nThe Elf sneers in disgust, and swings his blade. He slashes a deep wound in your stomach, and you scream. The Elf slashes at you repeatedly, opening endless red lines of blood and pain across your chest. After over a dozen cuts, you collapse into unconsciousness.", "action_results": [null]}]}]}]}]}, {"action": "Continue trying to stop Kannish", "result": "\"I'll tear off your head and give it to the crows, Kannish! Let her go!\"\n\n\nKannish lets go of the girl, who quickly turns and scurries off. Kannish draws his blade.\n\n\n\"Are you willing to die for that bitch? Die just so she can spread her legs to some Elven cunt who killed our friends?\"\n\n\n\"Drop the weapon, Kannish!\"\n\n\nKannish clumsily lunges at you, rage in his eyes.", "action_results": [{"action": "Behead him", "result": "You swing your blade, killing Kannish. You drag his head outside to Captain Darruk, who growls at the sight.\n\n\n\"Who did this? Elves?\"\n\n\n\"I did. Sir.\" You add.\n\n\nCaptain Darruk's eyes narrow.\n\n\n\"Why?\"\n\n\n\"He refused to follow orders. I found him trying to have his way with one of the elves.\"\n\n\nCaptain Darruk's eyes widen in surprise.\n\n\n\"Mazkill, I don't have time to deal with this. Karn and I are returning to the Fort. We need to be gone by nightfall. We don't have time to deal with you killing our men.\"\n\n\n\"He was doing shitty things, sir.\"\n\n\n\"This is war, shitty things happen.\"\n\n\n\"Our jobs are to minimize the amount of shitty things happening.\"\n\n\nDarruk opens his mouth to say something, before you hear a scream. You turn to see a large house has erupted into flames that are quickly growing. Captain Darruk sprints over, followed by you.\n\n\n\"What's going on?\" Captain Darruk asks.\n\n\n\"We were putting the civilians in this house when they resisted, so we torched the place.\" One of the Orcs explains.\n\n\nYou see civilians; men, women and children rushing out of the building as it rapidly erupts into flames. You hear crying coming from the top floor, a high pitched noise that could only come from an infant.\n\n\n\"Captain! There's a baby in there!\"\n\n\n\"There's nothing we could do. The flames would kill anyone who tries to enter.\"\n\n\nYou watch the building, flames licking the sky. You see a small gap in the flames that someone could easily use to get inside.", "action_results": [null, null]}, {"action": "Dodge him", "result": "You dodge him, and he smashes past, managing to slash your arm open. He rises up again, ready to strike.", "action_results": [null, {"action": "Dodge him", "result": "For a second time, you dodge out of the way. For the second time, he slashes a cut, this time across your chest.", "action_results": [null, {"action": "Dodge again", "result": "This time you're ready for him. As he charges. you swing your blade and the flat knocks into his ankle, sending him tumbling. You stomp on his head multiple times, and begin dragging him out of the hut and drop him in front of Captain Darruk.\n\n\n\"What's this?\"\n\n\n\"I caught this soldier trying to have his way with a young Elven girl. I stopped him.\"\n\n\n\"Mazkill, I don't have time to deal with this. Karn and I are returning to the Fort. We need to be gone by nightfall. We don't have time to deal with you fighting our own men.\"\n\n\nYou hear a scream. You turn to see a large house has erupted into flames that are quickly growing. Captain Darruk sprints over, followed by you.\n\n\n\"What's going on?\" Captain Darruk asks.\n\n\n\"We were putting the civilians in this house when they resisted, so we torched the place.\" One of the Orcs explains.\n\n\nYou see civilians; men, women and children rushing out of the building as it rapidly erupts into flames. You hear crying coming from the top floor, a high pitched noise that could only come from an infant.\n\n\n\"Captain! There's a baby in there!\"\n\n\n\"There's nothing we could do. The flames would kill anyone who tries to enter.\"\n\n\nYou watch the building, flames licking the sky. You see a small gap in the flames that someone could easily use to get inside.", "action_results": [null, null]}]}]}]}]}, null]}]}, {"action": "Leave the valuables", "result": "You leave the valuables. You're a soldier with a mission, not a thief.", "action_results": [null]}]}]}, {"action": "Force her to give you the knife", "result": "You move forward, knocking her back with a punch. She cries out and you grab her wrist, twisting it. She drops the knife, which you catch.\n\n\n\"Here's some advice. Don't fuck with an Orc. You're lucky you're not dead.\" You growl.", "action_results": [null]}, {"action": "Try reason with her", "result": "\"Listen: You have no power here. I could very easily kill you, and my allies would storm in here and kill you and your daughter if I was harmed. Give me the knife and you life.\"\n\n\nShe looks terrified, but she hands over the knife. You grab it, and nod.\n\n\n\"Good choice.\"", "action_results": [null]}]}]}, {"action": "Defend the Bridge", "result": "You stay behind, waiting patiently at the bridge. Eventually, a large group of Elves on horseback begin riding towards the bridge.\n\n\n\"Alright, boys, hold the bridge.\"\n\n\nThe horses approach, and you aim your spear. You aim carefully, and as soon as the calvary units arrive you attack. You stand on top of a horse, jabbing with a spear, aiming at the riders. You stab them with your spear, hitting hearts, faces and throats to take them down. Many of the riders manage to leap over the barricade and escape to freedom, though the majority of them easily taken down. \n\n\n\"Good. Now, we have work to be done. With the advance of our calvary, we can finally begin to invade and launch attacks on the Elvish Villages.\" Captain Darruk says. \"The Elvish empire is crumblings, boys. Take what you want off the dead, kill the wounded, and we'll head back to the Fort and find something to drink.\"", "action_results": [null]}]}]}]}, {"action": "\"No.\"", "result": "\"Really? The other men I talked to seemed to think it was. Anyway, thank you. Please, go eat.\"\n\n\nYou nod, and quickly return to eat. You have to punch one of the smaller Orcs, but you manage to grab a large, juicy piece of meat and eagerly chew into it.", "action_results": [null]}]}]}, {"action": "Gather your men and flee", "result": "\"Come on! We're getting out of here!\" You yell.\n\n\nYou allies quickly follow as you turn and sprint out of the trees. Shortly afterwards you break free, and to your relief none of the Elves have followed.\n\n\n\"We need to get back to camp.\" Karn grunts.\n\n\nKarn's covered in bright red Elf blood mixed in with the darker Ork blood from those around him. You realize that Karn is a fantastic fighter, but should never be given a position of power again. He led your squad straight into an ambush.", "action_results": [null]}]}, {"action": "Act offensively to fend off the warriors and protect the group", "result": "You charge forward, slamming into one of the warriors. You raise your sword and slam it down through her gut, killing her. You grab an Elf about to stab an undefended orc by his hair and yank him back, slitting his throat. The Elves notice your aggressive tactics and five of them crowd around you. You feel a brief sense of fear. They jab and slice at you, opening up your shoulder with several jabs knocking into your chest and smacking the plate armor, causing you to grunt painfully. Then, Karn arrives.\n\n\n\"DIE!\" He screams.\n\n\nHe flings at throwing axe with such strength it beheads one of the elves and embeds itself in the shoulder of another elf, who drops and screams. Karn then barrels into a third Elf and begins stabbing her through the chest, leaving you with two elves to fight. You block one of their sword thrusts and parry the other's, before kicking one into a tree. You jab the other in the neck, twisting your sword to have a spurt of blood hit you in the face. The other goes to stand back up, but you kick him in the head and slash his throat.\n\n\n\"Come on, Orcs! We fight and we kill today!\"\n\n\nThe Orcs are now prepared to fight, with their formations taken up and their weapons ready. The Elven Warriors quickly begin to retreat.\n\n\n\"Now, Orcs! Target the Archers the foolish warriors left behind!\"", "action_results": [null]}]}, {"action": "Stop Karn from charging into what might be a trap", "result": "You let out a shout.\n\n\n\"Wait!\"\n\n\nKarn turns and snarls.\n\n\n\"What?\"\n\n\n\"We shouldn't go in there. It's another Elf ambush for sure. We need to wait for reinforcements.\"\n\n\n\"Reinforcements? Is your Mama bringing fresh milk and honey? We fight and strike a blow against the Elves. You either charge with us or die.\"", "action_results": [null, {"action": "Refuse to follow Karn into the woods", "result": "\"No, I'm not going to charge to my death.\"\n\n\n\"Then you'll stand to it.\" Karn yells.\n\n\nKarn swings his warhammer, knocking your legs away. You fall in the mud, and he swings again, his blow smashing your skull in.", "action_results": [null]}]}]}, {"action": "Quickly alert and direct your own Archers to the Elves", "result": "You turn to your archers, but it's clear the Elves targeted them first. Most are dead, and the few remaining drop to their knees and begin firing, but the elves are uphill, naturally better archers and have the wind in their favor. It's clear the elves have carefully chosen this ambush site.\n\n\nYou feel an arrow thud into your chest. It shatters on your plate armor, but the force is enough to break a few ribs and you groan loudly. You raise your shield, and another arrow thuds into it.\n\n\n\"Orcs! Regroup, and keep those shields up!\" Karn screams.\n\n\nYou huddle together, and as a group begin rushing uphill rapidly towards the Elves. The Elves fire a few more arrows at you both, but quickly turn heel and run. You reach the summit of the hill and watch as the Elves disappear into a small woods down the hill.\n\n\n\"Come on, Orcs! We follow them and make sure the worms can feast on Elf Flesh tonight!\" Karn yells.", "action_results": [null, null]}]}]}]}]}]}]}]}]}]}]}]}, {"action": "Tell them you have no gold", "result": "\"I have no coins on me.\"\n\n\n\"Really, sir? Larn, go see if our new friend's lying.\"\n\n\nOne of the men walks forward, and begins searching you.", "action_results": [{"action": "Grab the man", "result": "You grab the man, drawing your blade and driving you knife into his chest repeatedly, tossing his body aside. The men begin charging towards you, three on one side of the street, one on the other.", "action_results": [{"action": "Charge the single man", "result": "The single man is quick and manages to jab you in the side, his cold iron causing you to groan in pain. You swing your blade, slashing the man's throat, and toss him at the trio. You rush onto the main street, but the trio don't follow. You check your wound, but it's not deep. You wander through the street, until eventually you come across Dendar's Cart. You climb on the back, and lie there, as Dendar arrives with a caged chicken.\n\n\n\"Ah! Mazkil, how are you? Ah, you're bleeding.\"\n\n\n\"Someone tried to rob me.\"\n\n\n\"Well, I hope you made sure they'll never try again.\"\n\n\nYou nod, and Dendar chuckles.\n\n\n\"Well done. You're a true orc.\"", "action_results": [null]}, {"action": "Charge the trio", "result": "You run forward, leaping through the air as you slam into one of the three, stabbing him through the neck. The others grab you and a knife is painfully brought across your throat, before your limp body is released.", "action_results": [null]}]}, {"action": "Let him", "result": "You stand there, as one of the men walks over and begins patting on your pockets. As the few coins you have left jingle, the man quickly draws a knife and stabs you through the back, right through the heart. You yell in pain, collapsing.", "action_results": [null]}]}, {"action": "Yell at the men", "result": "\"FUCK OFF, HUMANS! GO SUCKLE ON YOUR MOTHER'S TITS!\" You roar.\n\n\n\"Oi, Sir! Quiet down. Wouldn't want the Guards to...\"\n\n\n\"FUCK YOU, YOU TWO-BIT THIEVING CUNTS!\"\n\n\n\"Shit, Larn, shut him up.\"\n\n\nYou hear a whistling noise, and you turn to investigate. Two throwing knives plunge into your chest. You gasp, and struggle to stay standing before a third enters your heart.", "action_results": [null]}, {"action": "Hand over your few coins", "result": "You quickly take out your remaining coins and hand them to one of the thieves. He flashes a grin, and puts his hand around your shoulder.\n\n\n\"Thank you, sir. Pleasure doing business.\"\n\n\nHe leads you out of the ally and points in the direction of the Dengar's cart. You walk along to it, and climb aboard the back. Dengar appears, holding a caged chicken.\n\n\n\"How was your time in Riverton?\"\n\n\nYou shrug, disgusted in yourself for handing over the money. You're no true orc.", "action_results": [null]}]}, {"action": "Visit the Brothel", "result": "You arrive at a large building and take a deep breath, breathing in perfumes of foreign fruits and sweet incense. An elderly woman walks out, and smiles at you.\n\n\n\"Ah, a patron. How may I help you, Sir?\"\n\n\n\"I'd imagine it's the same reason everyone comes here.\" You reply snidely.\n\n\n\"Ah, of course. I'm sorry, you look like Gruft, the debt collector. I assumed you were a brother of his filling in.\"\n\n\nShe leads you into a back room, where you take a seat on an old dirty bed. She leaves, before arriving back with three women. One of them is a middle-aged, chubby, unattractive woman in a plain dress. She smiles at you.\n\n\n\"I am Helga. She says.\n\n\nThe second woman is a younger, plain faced woman with a nice bosom and bum, which quickly draw your attention.\n\n\n\"I am Liz.\" She says, smiling at you sweetly.\n\n\nThe final girl is a short, small, pale blond girl. Her features are sharp and angular, and you recognize her as an elf.\n\n\n\"I am Starflower.\" She says.\n\n\n\"The prices are simple.\" The Matron says. \"Helga is five coins, Liz is ten, Starflower is fifteen.\"", "action_results": [{"action": "Pay for Helga", "result": "You pay for Helga, and all others but her leave. You quickly undress, and for the next hour, allow your animal urges to take over. You quickly fuck her, trying to focus on the feeling rather than her less than appealing appearance. Afterwards, you clean up and quickly make your way back to the street, a happier orc.", "action_results": [null]}, {"action": "Pay for Liz", "result": "You pay for Liz, and everyone but her leave. You quickly undress, and take advantage of the ample business advantages that the Gods have given her. Her bosom and ass provide great entertainment as your animal instincts take over. You greatly enjoy the next hour, eventually finishing, cleaning up and leaving the brothel with a smile on your face.", "action_results": [null]}, {"action": "Pay for Starflower", "result": "You pay for Starflower, and all others live. You quickly undress, and allow your animal instincts to take over. Over the next hour you make sure to enjoy every inch of the young elf's body, and learn she's very, very skilled at her job. After an hour you finish, clean yourself up and leave, happier than you've ever been.", "action_results": [null]}]}, {"action": "Visit the Shop", "result": "You go into the shop, and buy a lamb steak, a shiny purple fruit, boiled sheep's brain and a pouch of milk. You quickly eat these delicious fruits, particularly enjoying the sheep's brain and milk. As you finish, you smile to yourself, your stomach full.\n\n\nTime to find something else to do.", "action_results": [null]}, {"action": "Visit the Gambling Ring", "result": "You go inside the gambling ring, where a large half-orc stands, leaning against the doorway.\n\n\n\"Good evening, kind patron.\" He says in a dull, bored voice. \"Would you care to see a fight? Five coins, make a bet.\"\n\n\n\"What's the fight?\" You ask, eagerly.\n\n\n\"A Dragon Youngling, can barely spit fire, vs a trio of wolves we managed to catch. It's a good fight.\"", "action_results": [{"action": "Bet on the Wolves", "result": "You place a five coin bet on the wolves, and enter the gambling ring. You find a spot looking in on the ring, watching a small red dragon, snarling at the crowd. Three trapdoors open, with three wolves entering. The wolves begin howling as the dragon snarls. The Dragon lets out a short first of fire, alighting one of the wolves who begins leaping and rolling around in pain. The other two wolves jump, with the dragon lunging forward and biting into the second wolf's neck and tearing into the flesh and fur, before dropping the bleeding wolf. The third wolf lands on the dragon and begins biting and tearing at the dragon's wing. The Dragon screeches, leaping around and flinging the wolf off the ring. The dragon snarls and leaps forward, tearing the wolf's head off and flinging it out of the ring. It lands next to you, but a small child grabs it first and holds it in the air with a laugh.\n\n\nYou leave, five coins poorer.", "action_results": [null]}, {"action": "Bet on the Dragon Youngling", "result": "You place a five coin bet on the dragon youngling, and enter the gambling ring. You find a spot looking in on the ring, watching a small red dragon, snarling at the crowd. Three trapdoors open, with three wolves entering. The wolves begin howling as the dragon snarls. The Dragon lets out a short first of fire, alighting one of the wolves who begins leaping and rolling around in pain. The other two wolves jump, with the dragon lunging forward and biting into the second wolf's neck and tearing into the flesh and fur, before dropping the bleeding wolf. The third wolf lands on the dragon and begins biting and tearing at the dragon's wing. The Dragon screeches, leaping around and flinging the wolf off the ring. The dragon snarls and leaps forward, tearing the wolf's head off and flinging it out of the ring. It lands next to you, but a small child grabs it first and holds it in the air with a laugh.\n\n\nYou leave, five coins richer.", "action_results": [null]}]}, {"action": "Visit the Tavern", "result": "You walk into the Tavern, and drop five gold coins on the counter.\n\n\n\"Barkeep. Get me a mug of your finest ale. No, get me however many mugs of my cheapest ale this can get.\"\n\n\nYou're slid over several mugs of ale, which you begin drinking with glee. As you do, an old man sits down next to you wearing the Kingdom of Man's military uniform. \n\n\n\"Good day, sir. Ah, an orc. A fierce beast, at that one.\"\n\n\n\"I am not a beast. I am a warrior.\" You grunt, annoyed.\n\n\n\"Ah, of course, of course my good friend. I was just making conversation.\"\n\n\nYou look over at him, noting a black, jagged blade at his side that you recognize as Demonic Obsidian. \n\n\n\"That's a nice blade. Where's it from?\" You ask.\n\n\n\"Ah, now that's a story. I'll tell it to you for a bottle of Elvish Wine, only five coins. A man needs to drink.\" He winks at you.", "action_results": [{"action": "Pay for the man's wine", "result": "You pay for the man's drink, and he gleefully accepts.\n\n\n\"Thank you. Hell, your kind are far better than most around here. I was a soldier in the King's Royal Army. I was sent to fight the Necromancer's Army, at only a young age. Not the current Necromancer, mind you, the boy's father, the first Necromancer. I was sent to a small graveyard, where a local friendly giant had been buried. One of the Necromancer's Disciples had taken a group of zombies and ghouls down to raise the giant as a soldier in their army, so I was sent to kill them with my regiment. The dead were everywhere, and I sunk my sword into a zombie and lost it. There I was, unarmed and surrounded by the dead, when I saw this figure in a black cloak. I tackled him, grabbed his sword, this very weapon, and stabbed him to death. With that, the zombies lost their leader and we regrouped and repelled the dead. I wielded this very sword when we stormed Reaper's Castle and killed that blasted necromancer. Anyhow, that's my story. I'm glad someone heard it, and gladder my lips aren't as parched.\"\n\n\nYou nod and quickly finish your drink.", "action_results": [null]}, {"action": "Refuse", "result": "\"No thanks.\"\n\n\nThe Soldier nods in understanding, and you continue drinking. After a few minutes, a man knocks into you, spilling your drink.\n\n\n\"Oi!\" You yell, standing up and turning.\n\n\nIn front of you is a large man with a thick black beard, who looks at you.\n\n\n\"What?\"\n\n\n\"You spilled my drink!\" You roar at him.\n\n\n\"Ha! My little daughter could've held a drink with more grip than that! It's not my fault!\"", "action_results": [{"action": "Punch the Man", "result": "You smash your fist into the man's head, knocking him backwards. The man stumbles backwards, and you leap in, punching him twice more.", "action_results": [{"action": "Continue punching", "result": "You continue punching, and although the man gets two hits in and you, smashing your nose, his body eventually goes limp as he falls to the ground.", "action_results": [null, {"action": "Stomp the man to death", "result": "You begin stomping on the man, breaking bones and splattering blood around. A man tries to pull you off but you shove him off. You hear a yell as the man's skull is caved in, and as you turn to leave a blade enters your stomach. You look up to see a Town Guard, his sword deep into your stomach.", "action_results": [null]}]}, {"action": "Leave the Tavern", "result": "You turn to leave as the man stands again. As you walk, the man draws a sword and yells. You turn to confront him, but he stabs you through the chest, straight through the heart.", "action_results": [null]}]}, null]}]}]}]}]}]}]}, {"action": "Have Gruzub distract it", "result": "\"Gruzub! Distract the beast!\"\n\n\n\"Distract it?\" Gruzub asks quizically, before picking up a stone and chucking it at the boar.\n\n\nThe boar squeals and turns to gore Gruzub.\n\n\n\"I did it! Ah, I did it!\" He yells, diving out of the way.\n\n\nYou charge forward, stabbing the boar repeatedly in the side. It's intestines begin falling out, and it collapses, dead.", "action_results": [null]}]}, null, null]}]}, null]}, null]}]}]}]}]}