{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=7480", "context": "", "first_story_block": "You wake up in your cabin in the woods. You sit up and scratch some fleas that have infested your body. You also realize its still daylight. You hate waking up early.\n\nYou lope into the bathroom and look in the mirror where you see a canine face covered in gray fur, you remember a time when your fur was completely brown.\n\n“You’re getting old Wolf” you say to yourself like you always do while trying to look on the bright side that at least you don’t have the mange. You think you’d just put a silver bullet in your head if you ever started to go bald.\n\nAfter eating some left over mutton in the fridge and some Gummy Blobs (for the sugar “pick me up”) you ponder how you’re going to pay this month’s rent on your cabin. You call your agent Erik and see if that little pissant has found any work for you. Hopefully it’s an actual job and not just a guest speaker spot at a comic convention.\n\n“Erik! It’s me Wolf! Pick up the fucking phone! I know you’re there!” you say when you get the answering machine.\n\n“Erik! Get on the phone NOW, or I’m gonna go over there and shove a pipe organ up your ass!”\n\nThat got his attention.\n\n“Wolf, I’m sorry, but I fear I’m in a deep depression.”\n“What else is new? Look I need some work, got anything? I don’t even care if it’s straight to video. I just need some of the green stuff!”\n“Sadly, I don’t think I do, but then I haven’t really checked…I’m so depressed. I’ve been wondering if I made the right decisions in my life…and now it’s too late for me to do anything about it, because I’m old…”\n“Join the fucking club Erik! Look do you…”\n“But my art, my music, that is my love and its failing me again. My latest opera isn’t doing well. I wonder if I chose the wrong thing to love and pursue. Just like I did with Christine. Oh Christine WHY couldn’t you have loved me? I loved you…”\n\nWonderful, he’s in full blown tortured artist mode. He can go on like this forever. You can either give up, or persist in getting something out of him.", "action_results": [{"action": "Persist", "result": "“Oh boo fucking hoo, your latest Opera hasn’t been doing too well lately. At least people are paying to see the goddamn thing! As bad of a composer, and musician you are, you oughta be glad anyone’s even paying to see the goddamn thing! People don’t want to see anything with me in it! And at least you’ve got another job to fall back on LIKE BEING AN AGENT THAT’S SUPPOSED TO BE GETTING ME A FUCKING JOB!” you snarl.\n\nThere’s some dead air briefly and then Erik begins talking again.\n\n“You’re right. I shouldn’t be complaining about my problems to you. You of course know all about torment. A war that wages within you, a beast that…”\n“Erik I’ve got no time and I’m in no mood to hear how we’re supposed to be kindred spirits, you just better tell me you found something for me and it better not be another guest speaker spot at a comic convention!”\n“Well let’s see…I dunno. Werewolves aren’t popular anymore you know…there might be something…here it is! It’s called Wolf Pack.”\n“Pack? That implies more than one wolf on the set there Erik. Well I suppose I can share the spotlight with some others. As long as I’m in charge of course.” You say.\n“Er…well according to this, you’d be the old cranky grandpa wolf that makes a bunch of rude remarks.”\n“What?! What kind of stupid shit is that?”\n“Yeah that’s the stuff.” Erik replies not catching on.\n“I mean what the hell kind of movie is this?”\n“Its uh…let’s see…oh here. It’s a horror comedy about a werewolf family and how they\nadjust to human society. Looks like you’ll be playing with a lot of young pups as you’d call them.”\n“WHAT?! NO! What the fuck Erik? I’m a fucking monster not something to be fucking laughed at! And they already did a movie like that a long time ago and it sucked!”\n“Well that’s all I got. Maybe you could talk to the director to make changes since they also wrote it. I’m sure you and her are familiar with each other. You had an affair with her for quite some time.”\n“Uh, you wanna narrow that list down Erik?”\n“It’s Mary. You know, the one who used to be married to Frankie, until your affair broke up both of your marriages?”\n\nErik’s new information didn’t exactly make you any more enthusiastic to want to take the job.", "action_results": [{"action": "Take the job anyway", "result": "“Alright I’ll take the job, just tell me where its at.” You say.\n\nAfter Erik gives you the information, you ride your Harley to the studio.\n\nWhen you arrive on the set, you see a bunch of snot nosed wolflings hanging around trying to look “tough”. Some of them are in human form, but you can smell them for who they truly are though. These cubs today, you swear they would’ve never lasted back in the old days. All flash and nothing to back it up. (Though you don’t mind looking at the young females that are there) That’s why they hang out in packs. You never did that even when you were young. You were always a lone wolf.\n\n“Hey who’s the fossil?” one of them asks.\n“Hey Grandpa, the remake of Old Yellow is next door!”\n\nThis causes a howl of laughter from all of them, until you confront the one who said it. Probably the leader no doubt. Not even in wolf form. Pathetic.\n\n“I’m going to give you time to transform into a more adequate fighting form before I neuter you.” You calmly explain.\n“You? You’re like 300 years old! I could take…”\n\nCan’t say you didn’t give him a chance.\n\nYou immediately pounce on him, knocking him down while clamping your jaws on his face and digging your fangs in.\n\n“HOLY SHIT DUDE!” one of them shouts.\n“Oh my god he’s killing him!” a female screams.\n“Get him off of him, get him off of him!”\n\nWhile them all attempt to pull you off of their leader you hear a familiar voice that gets your attention.\n\n“Well, I see Erik passed my script over to you, good. I’m also glad to see you’re still as anti-social as usual Wolf.” Mary says as you finally get off of your misguided heckler and approach her. She still looks the same, though she looks a lot better now that she got rid of that hair style she used to have and dyed it blonde.\n“Just re-establishing the proper hierarchy, nothing more.”\n“Hmm, always the Alpha Male, that was what I always loved about you. So primal. Maybe later I can dress in a little red cloak and we can reenact a fairy tale.”\n“Some fairy tale, as I remember you loved a lot of beings.”\n“Hey I can’t help who I am. I was created this way.”\n“Just like Frankie eh?”\n“Don’t you compare me to that sicko! Yes we are controlled by our genetics to a certain degree, but as you damn well know I rose above them! I made my own identity. I’m a successful director and writer now, so what if I have a healthy sexual appetite? There’s nothing wrong with that, I’m sure you’d agree given all the beings you had your way with before, after and DURING your marriage!”\n“Look never mind all that. I got a real problem with this film.” You say side stepping her correct accusation.\n“What’s wrong with it?”\n“What’s wrong with it? Are you kidding me? It sucks! It makes a mockery of werewolves! You even named one of them fucking Benji!”\n“Well comedy is popular now. Plus children like monsters just as long as they aren’t too scary, so I was hoping to make it a family film.”\n“ARRGH! I don’t DO family films! This is insulting and demeaning!”\n“How? Come on Wolf. In most horror movies you’ve made you always got killed in the end by a human, how was that any less demeaning?”\n“Because at least I was portrayed as feared monster that killed a bunch of people! I can play ball with the humans and their idealistic notion of good always having to overcome evil and all that…but THIS! This makes me into a fucking joke! I can’t even believe you of all people wrote this…no wait I can. You fucking undead don’t have any consideration for anyone, but yourselves.”\n“You know I’m technically not even undead, I’m created from several dead bodies. I’m more of a golem.” Mary attempts to correct you.\n“Who gives a shit, you’re still basically a walking corpse, and your flesh is dead. You’re Undead in my book.”\n“You know for someone who hasn’t been able to find a job in months and is basically just rotting away in his little cabin, you’d think that you’d be a little more appreciative. I wrote this with you in mind you hairy bigoted asshole!”\n\nYou don’t know whether to take that as an insult or as an attempt for her to try to make amends for the past.", "action_results": [{"action": "Take it as an insult", "result": "“So you had me in mind eh? Well that proves it. You think I’m a joke because that’s how you wrote the character.”\n“What? No! I just…”\n“I see your time with that bloodsucker was well spent. Learning how to exploit and leech right? Look maybe you can pull this shit with those puppies over there, but I ain’t fucking one! I don’t need the money that badly. I’ll go fucking live my twilight years in the forest and DIE there as nature probably intended. I don’t need this shit.”\n\nAs you turn to leave, Mary shouts at you.\n\n“Yeah, that’s right go on leave Mr. Lone Wolf! You’ll fucking die alone, you stubborn bastard! I tried to help you! Erik tried to help you and you don’t appreciate any of it! That’s why none of your children speak to you and…”\n\nYou run back over to her and slam her into the wall. You stare at her face to face as she struggles to get free. She’s strong, but you manage to keep her pinned. She really pissed you off and you were already pissed off to begin with.\n\n“Fuck you, and fuck Erik! You two don’t know shit about me, never did. I’m through with the pair of you! In fact I think I’ll be taking something with me since you’re so worried about me being alone…”\n\nYou release Mary and go over to the wolflings who look a little worried that you’re going to cause harm to them. Many of them cast their eyes downward.\n\n“Hey, you want to be REALLY tough? You want to really raise some hell? Come with me. If you want to stay under the thumb of this patchwork dead bitch and be exploited and mocked, stay here.\n\nYour statement alone convinces all of them. They all follow you, even the one you made an example of. Mary attempts to call everyone back, but it’s useless, you’ve taken control of the pack and they’ll do what you want now.\n\nAnd right now you want to get into a fight. You think about all the people and creatures that wronged you in some way and only two of them keep coming to mind consistently.\n\nOne is that fucking Dr. Victor Frankenstein. If it wasn’t for him, Frankie and Mary wouldn’t have been created in the first place which also means you wouldn’t have gotten yourself into trouble all those years ago. You wouldn’t have had to put up with his “children” taking jobs away from you. Not to mention he sued you once.\n\nBut the one who you REALLY despise, is that bisexual bloodsucker. Fucking Dracula or Vlad, or whatever the hell he’s calling himself these days. The disgust you have for him and the reasons are too numerous to list here.", "action_results": [{"action": "Go kick Victor's ass", "result": "Your recent dealings with Mary, have made you think about all the shit you’ve had to put up with from that no talent dickhead. No human has ever given you such trouble. You know he’s still alive. (Mad scientists always find ways of prolonging their lives somehow) That won’t be true for long though, if you get your way. You killed him once before. This time you’re going to make sure he stays that way.\n\nHe’s probably got whatever crappy inventions and experiments protecting his castle and from what you know, Frankie’s still living with his “Dad” as well.\n\nYou don’t give a fuck, you’ll kill him too. You figure you’ll be doing the world a favor as well as getting some satisfaction. Besides, you’ve got to show these wolflings what being a werewolf is all about.\n\n“All right you cubs! We’re going to go raise some fucking hell. We’re going to Frankenstein’s Castle. We’re going to rip the place apart brick by brick, and I’M going to rip Victor apart limb from limb.”\n“Erm…Castle Frankenstien? Isn’t that where Frankie lives?” one of the wolflings asks.\n“I heard he’s really powerful, didn’t he fight Dracula and win?”\n‘I dunno if we should mess with him.”\n\nYou can’t believe your ears! These snot nosed pups know nothing of their heritage! Back in the old days they would’ve been killed and eaten for such cowardice!\n\n“Goddammit are you Wolves or fucking Chihuahuas? Frankie’s a fucking pussy! I personally kicked his ass before and I’ll do it again all by myself if I have too! Now are you going to run with me and be a fucking Wolf or are you going to go back home with your tails tucked between your legs?”\n\nAfter looking at each other for awhile they all agree to go with you.\n\n“Good! Now I want all of you to transform into your wolf form too! I’m traveling with fellow wolves not humans!”\n\nJust before one of the females begins to transform, you stop her. She’s dressed in a short leather skirt and a tight white t-shirt that’s tied in the center and has long flowing brown hair. You can smell that she’s in heat. You hate to coin a pun, but she literally is one hot l’il bitch.\n\n“Erm, not you. You stay in your human form; I kind of like the whole teenage slut look you got going on. In fact you come here right now; you’ll be traveling on my bike with me.” You say.\n\nAs she slides in behind you and holds on, you ask her one more question.\n\n“So what’s your name?”\n“Ginger. What’s your name, you never did tell us.”\n“Wolf. Just Wolf baby. Remember it. You’ll be screaming it later.”\n\nDamn you’re so fucking cool, you think as you start up your Harley and ride ahead of the pack.\n\n(You’d probably be even cooler if these pups weren’t all riding those Japanese “crotch rocket” bikes, but that’ll have to be another lesson for another day)\n\nAfter a couple of days of riding, and a few “pit stops” with Ginger, you all eventually reach Castle Frankenstein. You park your bikes at the gate, and size the place up, which now looks a lot different. It looks like a damn Nazi fortress now, there’s guard towers and everything. It seems Victor has been keeping himself very busy in recent years.\n\nAs it begins to rain, a familiar voice calls to you from one of the towers.\n\n“Its you. Vic always knew you’d return one day. I never believed him though. I guess I owe him fifty bucks.”\n\nYou look up and see Igor, he looks different too. He has a lot of clumsy cybernetic implants, one of them being some sort of gun in place of an arm. More of Vic’s “handy work” no doubt. He’s still got that damn hump on his back though.\n\n“Igor? You still alive? I thought your ungrateful master would’ve just let you die of old age and get himself another assistant. I see he did a real good job of improving you though. Tell me, how’s it feel to be the real brains, never getting the credit and continuing to be a doormat?”\n“I’m happy with my lot in life. How’s it feel to be broke ass overgrown dog who’s trying to relive his lost youth?” Igor retorts back.\n“Don’t know yet. I’ll tell you before I shove that metal arm up your ass.”\n\nWell looks like the fight’s starting here.", "action_results": [{"action": "Attempt to climb over the gate before Igor can get off a shot", "result": "In your prime you would’ve been able to scale the gate, climb the tower and rip Igor’s head off all without getting hit.\n\nUnfortunately you aren’t in your prime anymore. Igor’s having trouble aiming his awkward arm-gun, but with as many bullets as it pumps out he doesn’t need to be completely accurate. While you’re attempting to climb over the gate he hits you several times.\n\nNaturally those bullets are silver.\n\nYou crash to the wet ground with a loud CLANK! sound, as the rest of the pack go running away with their tails between their legs.", "action_results": []}, {"action": "Duck for cover!", "result": "You tell everyone to get the hell out of Igor’s range and take cover. Fortunately Igor’s gun-arm isn’t the best design and he’s having problems aiming and standing still due to the recoil, so you all manage to hide behind some nearby rocks\n\nStill, there’s no way you’re going to be able to scale the front gate with Igor on that damn tower.\n\n“See I knew this was a bad idea!” one of the wolflings says.\n“How are we supposed to get past that? I’m pretty sure he’s firing silver bullets at us.”\n“Oh I KNOW he is. Hence the reason why I told everyone to get out of the way. Okay so we’re not going through the front gate, the castle’s a big place right? Igor’s only guarding the front. I say we split up and scale the walls on the sides and around the back. We’ll meet up inside the castle.”\n“Yeah, but won’t there be other defenses?”\n“Probably. So you better be fucking prepared! This ain’t no damn game. You cubs think you’re really tough when in fact you’ve probably never had a real challenge. This is it. Don’t think about backing out now. This is where we truly test the idea of survival of the fittest. Damn, my blood is starting to feel that rush! Don’t you all feel it? I haven’t felt this way since they sent a group of ten “werewolf assassins” to put me down. Shit. They never tried that again! Ha ha ha ha ha!”\n\nWhile you’re reveling in gruesome nostalgia, your pack is looking at you like you’ve completely lost it. And they’re probably right. However, your speech seems to have stirred something in them.\n\n“The crazy old fossil’s right! I remember having to hear about similar stuff my grandfather used to talk about all the damn time. I never really paid any attention to it before. Now I think I understand. We need to prove our skills to truly be proud to call ourselves werewolves!” one of them states.\n“Now that’s the attitude I’m talking about!”\n\nYou all huddle in the rain and make a howling noise in unison to the moon and proceed with your plan. You all split up into a couple of groups and begin to scale the side and back walls, which really isn’t all that difficult. You know Igor’s probably ran off to warn Vic though. All you can think is, he better have something better than just Igor and Frankie defending him.\n\nAs you prowl around in the courtyard, you hear moaning and the clomping of several footsteps. You and your group turn to see some of Vic’s defenses.\n\n“Zombies? Are you fucking kidding me Vic? I thought you’d at least have some robots or something!” you say to yourself. Though upon a second look, you see that the horde of corpses aren’t actually zombies. Zombies are complete corpses brought back to life. These things look more like Frankie, except designed even worse. A lot of them have arms and legs in odd places. Some have a couple of heads or extra limbs. Most aren’t even stitched together neatly, there are just giant rivets and spikes sticking out, holding them together. These are probably some of his “failed” experiments.\n\nDoesn’t matter, they’re close enough to be Undead for you.", "action_results": [{"action": "Fight them", "result": "Damn straight! That’s what you’re here for!\n\nYou take out the nearest pile of shit with ease and your pack follows suit. They’re a little tougher than you thought, but limbs are flying everywhere. Needless to say you’re really enjoying yourself, and you can see your pack is too. (Well the ones that haven’t gotten themselves killed)\n\nYou attack one large experiment with four arms, it catches a few heavy hits on you, before you rip them off. It’s relentless and begins smashing its head (Which contains a lot of jagged metal bits) into you, knocking you down. As you shake it off, Ginger (Who’s now in wolf form) and a couple of other wolflings comes to your aid and finish off the large abomination.\n\n“Godammit! I had that! Don’t EVER come to help me! I can handle myself!” you snarl angrily.\n“We were just helping…” Ginger says casting her eyes downward and lowering her ears.\n\n“…yeah…well…just don’t let it happen again…” you say understanding they weren’t really trying to embarrass you. “Come on, we’re done here, let’s get in the castle.”\n\nYou meet up with the ones remaining in your pack at the front door of the castle. You put all your muscle into it and rip the doors of their hinges. When you step inside, you narrowly dodge a laser beam of some sort.\n\n“He’s got the whole place trapped, be careful where you…”\n\nA wolfling steps on some floor stone that releases yet another beam trap, reducing him to ashes.\n\n“Step.” You say completing the sentence. That’s when you hear a loud speaker.\n\n“Wolf! Igor informed me you had arrived with some friends! I’m actually glad you’re here I get to test out my new experiment on you! Assuming you survive long enough to get to me of course!”\n\nAt this point he does his typical Mad Scientist laugh. If he thinks you’re going to waste your time in his castle of death traps he’s sadly mistaken. He seems to have forgotten you have an excellent sense of smell and tracking in general.\n\nOf course the smell of dead bodies seems to be emanating everywhere. You try to sniff out a human scent, but you aren’t getting anything solid. The dead body smell is too overpowering. You’re catching a couple of different ones though. One of them is a very faint sweet smell. The other is a burning type smell.", "action_results": [{"action": "Follow the burning smell", "result": "Knowing that Vic works with electricity a lot, you figure he’s in that direction. You and the wolflings that are still with you follow, carefully avoiding traps. You travel further to higher levels of the castle where the burning smell is getting stronger. You KNOW you’re getting closer to him. You can feel it. You just hope his “experiment” is as great as he claims. It would suck if there wasn’t a real battle to fight after all this.\n\nYou burst into the room with strong burning smell and see big globes of energy, conduits, generators and a big ass corpse with cybernetic implants lying on the table. It’s Frankie with some modifications and absorbing more electricity than lightning rod.\n\nYou half expect to see Victor somewhere, but all you hear is the loudspeaker disturbing your ears again.\n\n“You see Wolf! You see! While you’ve been wasting away in that shitty cabin, I’ve been preparing for my son’s come back! You stole his woman! You ended his career! You didn’t just damage him physically, you damaged his mind! Scarred him emotionally! It’s taken me YEARS to undo the damage!”\n“Damaged his mind? He was a psychopathic serial pedophile made of corpses! What the fuck kind of damage could I have done? And Mary never liked him anyway!”\n“She could’ve learned! He could’ve too! They just needed more time! But YOU! You prevented all that! You and your dog dick!”\n“For fuck’s sake, I wasn’t the only one fucking her!”\n“Yes, but you’re the one who did it the longest and destroyed my poor boy’s career! You’re going to pay! Ha ha ha ha! He’s up! HE’S ALIVE! HE’S ALIVE! HE’S ALIVE! Frankie look who we have here! And old friend, why don’t you go and give him a big hug?”\n\nVictor goes into his mad scientist laugh yet again, as Frankie “2.0” gets up from the table. He opens his eyes and looks directly at you.\n\n“FRANKIE BEAT YOUR HEAD IN NOW.” He says with a booming voice.\n\nStill as verbal and articulate as ever.", "action_results": [{"action": "Have the pack surround Frankie", "result": "You order everyone to surround Frankie to try to keep him off guard. Frankie watches as the wolfling encircle him, but he’s still slowly moving towards you.\n\nHe charges! A couple of the wolfling dive for his legs in an effort to stop him, but he’s like a juggernaut and keeps charging. Fortunately you’re still nimble and get out of his way as he smashes through the wall. The wolflings that dived for his legs, follow up and begin attack him with tooth and claw. It’s not having that great of an effect though, he’s got metal plating on that dead flesh now. Frankie kills the pair of them by smashing their heads together until there is nothing left except mush.\n\n“Everyone grab a weapon! Don’t fight him head on!” you bark at the survivors while attempting to find something. You find a large metal pole, though you’re reluctant to take it, with all the electricity in the damn room.\n\n“It’s useless! You’ll never defeat my boy Frankie!” Victor says.\n\nFrankie begins to approach you again.", "action_results": [{"action": "Throw the pole at him", "result": "Just as Frankie charges you again, you throw the pole as hard as you can at him like a spear. Bullseye! Literally. The pole slams into his left eye and straight through his head. It still doesn’t slow him down though and you just barely get out his way.\n\nFrankie stops his attack for a moment and attempts to remove the pole, but you and another wolfling don’t miss the opportunity. The pole is quite long and you grab it from the front, while the other grabs it from the back and you both run clockwise around Frankie. All the titanium plating in the world isn’t going to protect him from massive head trauma.\n\n“RARRRRGH! BRAIN!” Frankie yells as half of his head comes apart. As he attempts to keep his brains from falling out, and that’s when the rest of the pack begins to beat his head in even more with various blunt objects. He’s still putting up a fight though.\n\n“NO! STOP! FRANKIE! MY SON!” you hear Victor scream over the loudspeaker.\n\nVictor’s voice sounds like its very close. You see another door in the lab, and you’ve got a really good feeling that he’s behind it.\n\nYou leave the wolflings to finish off Frankie, and run to open the door.\n\nAnd there he is, Victor Frankenstein…\n\nOr what’s left of him at least, he’s just a brain in a jar, hooked up to various machines now.\n\n“Wow, Vic. I always knew you were a terrible mad scientist, but I would’ve thought you’d be able to at least create a robot body for yourself, or a youth elixir or something!”\n“Shut up Wolf! You haven’t won! I’ve still got…”\n“What? What’ve you got? Nothing! Unless you’re a giant space brain from Venus or some shit, you can’t do anything to me. And you ain’t, so…”\n”Wait! Wolf! Can’t we talk about this?”\n“Oh like you wanted to talk to me, when you fed me drugged meat?”\n“Oh yeah…you’re not still mad about that are you? I mean you did kill me for it…”\n”Yeah, and I should’ve stuck around to make sure you stayed dead. Well no mistakes this time.”\n\nYou take Victor’s brain out of the jar.\n\n“NOOOOOOOO……” are the last words to come out of the loud speakers before you step back into the lab where Frankie is flailing wildly at the wolflings who are carefully standing out of harms way as they continue to make quick strikes as him. He’s badly damaged and blind. Not deaf though. You call over to Frankie who turns around when he recognizes your voice.\n\n“Hey Frankie, your Dad wants to talk to you, he’s got a lot on his mind.” You say and then throw Victor’s brain into what remains of Frankie’s face. The brain splatters into bloody pieces, while you follow up with a quick and vicious attack.\n\nYou sink your fangs deep into Frankie’s shoulder until it hits the bone, where upon you rip off the arm at the socket. The rest of the pack follows your lead and help you rip Frankie apart, until he’s reduced to the pieces that made him up in the first place.\n\n“Damn, I think I broke a tooth on that fucking metal plating.” You say breathing heavily.\n“We won Wolf! You were right! This was fun! I felt the primal instinct and everything!” one of the wolflings exclaims.\n“Yeah and right now all of you are going to be feeling silver burning through your bodies.” Igor says standing in the lab door exit, pointing that infernal arm weapon at you all.", "action_results": [{"action": "Rush him", "result": "You take one look at your pack and nod at them. You all make a howl in unison. Igor realizes he’s in deep shit.\n\n“No wait you dumb ass dogs! I got a fucking weapon here! Stop!”\n\nYou all charge at him and Igor opens fire, he can’t stop you all before you overwhelm him. Unfortunately he does get some… including you. You eviscerate Igor as the silver begins to take its toll on your system. He dies coughing up blood, apologizing for not being able to defend Victor in his death throws.\n\n“I’m sorry Victor…I’m sorry my brother…gurgle…”\n\nThe rest of the pack attempts to carry you out, but you refuse their help and stagger to the outside of the castle where you finally collapse on the ground. It seems so comfortable you figure you’ll just rest for awhile. You’re not surprised to see Mary standing over you.\n\n“I take it you killed my whole family.” She says unemotionally.\n“Yeah, even Igor. Never knew he was Vic’s brother. That explains a lot.”\n“Why? Why’d you do it? What was the point?! You could’ve just done my movie and still been alive! Or even if you didn’t want anything to do with me, you could’ve just went back to your cabin instead! You could’ve been alive!”\n“You’ll never understand Mary. You don’t get old. I did and I wasn’t meant to. I outlived my place in this world. No point in going on. Just had to get in one last monster fight and damn it felt good.”\nMary shakes her head, you think she might even shed a tear if she was capable.\n“Go on now Mary, there’s nothing for you here. Don’t morn your family. You were always better than the rest of them anyway. Don’t morn me either, I don’t want it. Go. The pack is coming.”\n\nMary gives you one last look and runs off before the rest of the pack arrives. When they do they begin howling loudly.\n\n“Goddammit shut the fuck up! I’m trying to die with a little peace and quiet here!” you snarl.\n“You have to lead us! You can’t die!” one wolfling says\n“The hell I can’t! Look I showed you what it means to truly be a Wolf tonight. It’s up to you to do something with it.”\n\nGinger kneels down and tries to sit you up hoping that you’re not really dying. She’s very upset.\n\n“You can’t die! I want you with me…I…”\n“Stop Ginger. Don’t say it. Don’t give yourself anymore unnecessary pain, especially when I don’t deserve it. It’s just as well as I die now, I probably would’ve only broken your heart later. Just remember me how I was in the short time you knew me and every time you look at your litter.”\n\nYou touch her stomach.\n\n“How do you know? I mean it’s too early, we can’t be sure if…” Ginger exclaims.\n“Please. I’m the Alpha Wolf. I never fucking miss. I got kids everywhere. None of them ever listened to me or talk to me, but I got ‘em.”\n“What do you want me to tell our litter about you?”\n“Whatever you want, you’ll be the one raising them and I’ll be too dead to do anything about it… just teach them what I taught all of you here tonight…hopefully they’ll listen. Damn willful pups…mmm…getting sleepy…one more thing…”\n“What’s that Wolf?”\n“Burn my damn body, I don’t want some fucker trying to bring me back to life! I hate the Undead!”\n\nYou close your eyes and feel the darkness envelop you.\n\nAfter a brief period of howling, the remaining pack members take your body and burn it just like you asked, then they all part ways, each to pursue their own destinies in their own way just like you did. A few months later, Ginger does indeed give birth to a new litter and teaches them about you and how you lived. (This is tempered by some common sense on her part though).\n\nAt last, a legacy worthy of an Alpha Wolf.", "action_results": []}, {"action": "Stall for time", "result": "You briefly entertain the idea of rushing Igor, he wouldn’t be able to get all of you, but you’re not ready to risk death at the hands of some deformed assistant after you already killed Victor and Frankie. You need to buy some time.\n\n“Alright Igor, just calm down. It’s over Vic and Frankie are dead. You don’t have to get pushed around by either one anymore and you got this whole castle as inheritance! I just did you a favor.”\n“A favor? A favor? You killed my younger brother you ASSHOLE!”\n\nYou quickly put two and two together.\n\n“Vic? Victor was your brother? Your younger brother?”\n“He damn well better have been, after all the abuse I took from him! You know what it’s like being abused by your younger brother on a daily basis for YEARS?”\n“Not really, I killed all my brothers soon after we were born. I wasn’t sharing. Survival of the fittest and all.” You say dryly.\n“Really? Well I envy you. I wish I had that option. But nooo. Mom liked Vic best. Vic was handsome. Vic wasn’t deformed, Vic this. Vic that! Look after Vic, Igor. Make sure he doesn’t get into trouble Igor. He’s your younger brother and you have to protect him Igor. I was the first born! Why didn’t Igor get any love?! I was the smart one!”\n“Yes you were. I mean if it hadn’t been for you Vic wouldn’t have even created Frankie.” You say.\n“Damn straight! I was the one who kept his ass alive! I’m the one that corrected all his idiot ideas when it came to updating Frankie! I’m not stupid like everyone says! I’m smart! And I demand respect! And I never fucking got it! I just got a fucking whip to the hump!”\n\nAt this point Igor is ranting so much about hating his brother and his self-pity, he’s not aiming his weapon at you any longer. You take advantage of the situation and rush at him, he’s not quick enough to react and you knock him to the ground before eviscerating him. Oddly after all that ranting, he dies gurgling an apology.\n\n“I’m sorry Vic…I tried…gurgle…”\n\nYou shake your head at Igor’s misguided loyalty, while the Pack surrounds you.\n\n“We won! You rule Wolf! What now?” one of them asks.\n“Dunno, didn’t expect to survive really…so did you get all this on camera Mary?” you ask out loud, startling the wolflings.\n\nMary comes out of hiding, with a camcorder.\n\n“How did you know I was here?” she asks\n“Please, I don’t forget a scent, especially one that I know quite intimately. So let me guess. You’re going to exploit this footage for financial gain right?”\n“Well yeah. When you left the studio I followed you a bit and found out you were heading here. At first I wanted to protect and help my family so I got here before you.”\n“What changed your mind?”\n“I realized what a bunch of miscreants and fuck ups they all were! What was I supposed to do? Be like Igor and stay loyal to a bunch of reprobates that wouldn’t appreciate it anyway? It’s not like they’re REALLY my family. So I just decided to film the epic battle since you ruined my original movie by taking this lot with you.”\n“I take it you didn’t care who won though.”\n“Not really, but if it makes you feel warm and squishy inside I suppose I was rooting for you more. You were the underdog after all…hey! That’s a great title for the movie!” Mary exclaims.\n\nThe Wolflings get a little restless about all this.\n“Hey shouldn’t we do something, I mean she’s part of this fucked up family, and she’s trying to exploit us!”\n“Ah see now this is another lesson I can teach you guys. You don’t need to be an asshole all the time, especially when there’s some benefit for not doing so. A lesson I probably should’ve obeyed more when I was your age. Mary’s little movie is made purely for exploitation, but its GOOD exploitation. It’ll show everyone who we are and that we’re NOT to be fucked with! This isn’t some shitty family movie. This is raw footage of werewolves doing what they do best, kicking ass! We couldn’t ask for better publicity. AND I assume we’ll be getting some money for this right Mary?”\n\nMary looks a little reluctant, but she realizes she has to give you something.\n“Right Wolf.”\n“That’s what I thought. Now the battle is good and all, but you’ll need to pad it out more, I say you start doing interviews with us. We can make this into a documentary! If you need more footage, we can always go bust up a bar…”\n\nAnd so it happens, Mary releases “Underdogs: The Inner Mind of the Wolf” in a bunch of pansy art theatres at first where it’s critically acclaimed. Later it gets released it regular theatres where most people like it mainly due to the brutal violence and your “colorful” interviews. You even win an award.\n\nThe movie makes Werewolves “cool” again and you’re never out of work anymore, which is a good thing since Ginger gave birth to a litter of cubs which YOU have to pay to support! You come home every day to the little nippers biting your ankles for your attention.\n\nStill, life is good and you once again have achieved the fame and fear you deserve.", "action_results": []}]}, {"action": "Stand firm and wait for him to charge", "result": "You hold the pole like a medieval pike waiting to skewer Frankie when he comes charging at you. It’s like throwing rocks at a tank.\n\nThe pole certainly impales Frankie, but it barely slows him down, he continues his rush even as the pole breaks off into him and he slams his heavy body into you hard. You go flying into the wall and collapse on to the floor. Frankie follows up with stomping your head into mush. Werewolves do have regenerative powers, but you won’t be regenerating this severe damage since your brains have leaked out of your head.", "action_results": []}]}, {"action": "Fight him head on", "result": "Um…no.\n\nEven in your prime you would’ve had problems taking on Frankie in his current updated state. At your age it’s just unthinkable.\n\nYou attempt to bite his neck in an effort to tear his head off, but he crushes his strong metallic arms around you squeezing with all his might. Your pack attempts to help, but Frankie is too focused on his revenge. Even when you tear out his eyes, he continues to squash your internal organs until he finally breaks your back and throws you blindly into one of those electric generators.\n\nYour limp corpse fries for a little while, but unlike Frankie, it doesn’t bring you back to life.", "action_results": []}]}, {"action": "Follow the sweet smell", "result": "Even though you’re sure that the burning smell is probably where Vic is at, the sweet smell is so out of place here, you’re compelled to follow it. You tell the wolflings to follow the burning smell while you investigate the other one. They look a little unsure of being without you leading them, but they follow your instructions. Carefully avoiding traps, you travel further to different parts of the castle where the sweet smell starts getting so strong it’s almost sickening, until you finally get to a closed door.\n\nYou open the door to an elegant bedroom. The smell pervades the entire area. Someone soaked this place in perfume and there you see Mary standing there in a see-through nightgown. You’re genuinely surprised to see her here.\n\n“I knew you wouldn’t be able to resist. I knew you’d follow this scent. it’s the very perfume I used to wear when we had our affair.”\n“Mary? What the hell are you doing here and why the hell did you douse the room in the shit?”\n“I know you don’t like the dead smell, I don’t like it either. I makes me remember that I’m not alive…I never was.”\n“Yeah, well this smell isn’t too pleasant either. Whew!”\n“You know out the many, many…many lovers I had, you know you’re the only one that made me feel alive? Like a real woman, instead of collection of parts as you’ve pointed out so accurately so many times.”\n\nMary begins to get closer to you.\n\n“Look Mary I ain’t got time for this reminiscing bullshit, I’m on a mission of kicking ass right now and you’d do well to stay out of my way. Why are you here anyway?” you ask again.\n“I figured after you left the studio, you’d be in a wicked mood. I thought you’d probably just take your pack and smash up a bar or something. I followed you for a bit and found out you were planning on coming here. Look. I understand that my family has wronged you in many ways. My dad has, Frankie has, and I know I have, but I can’t let you kill them. I know they’re all fucked up and even I don’t like them, but they’re still my family such as they are. Wolf you already got your revenge a long time ago. I mean you beat the hell out of Frankie and ended his career and I heard tales about how you even killed my Dad once before he created either of us. What’s this all going to prove? My dad isn’t any match for you now. He’s barely alive. Frankie has been just lying on a slab for years. Dad took him apart in an effort to fix him. That’s the only experiment he’s talking about and he’s nowhere completed. Dad spends all his time with the insane idea of revitalizing Frankie for a come back. I tell him that it isn’t going to happen, but he continues anyway. There’s no battle here Wolf. Just a lot of empty dreams and delusions.”\n\nAt this point she takes your paw and brushes her other hand against your fur.\n\n“Please Wolf, just let my family live. If you have any lingering feelings for me that I know you once did, just call off your attack.”", "action_results": [{"action": "Call off the attack", "result": "Mary’s plea for you to spare her family has gotten to you. Maybe she’s right. Maybe you did do a lot of damage to them already. Maybe you were just trying to relive your own youth.\n\nMaybe you’re a complete fucking idiot.\n\nAs soon as you embrace Mary, you feel multiple shots to the back and extreme pain. You collapse to the floor, as Mary stands back from you angrily shouting.\n\n“Igor, you humped backed fucker! Those bullets went through him and hit me! Asshole!”\n“Hey, I can’t control the damn power of this thing. So is he dead?”\n“Not quite.”\n\nMary heftily kicks you over as you struggle to breathe.\n\n“Poor Wolf. You of all people forgot the cardinal rule. Blood is always thicker and you abandoned your own kind over silly nostalgic feelings for me. I am touched though. I shall always remember you as your pelt covers my body as a new coat. Time to put this doggie down Igor.”\n“I’m on it.”\n\nIgor raises his weapon once more and blasts your head off in a hail of silver.", "action_results": []}, {"action": "Continue the attack", "result": "For a moment you almost believed her. For a moment she almost displayed real emotions and feelings.\n\nFor a moment you almost were a complete idiot, except you remember the old prejudice that you’ve never forgotten:\n\n“No matter how much the Undead try to mimic feelings, they have none.”\n\nYou hear a click of a wall opening up. You see a metal arm point out and run out of the room, pushing Mary in the way. Igor opens fire and Mary takes king’s ransom in silver to her body, toppling her over with a heavy thud. She’s not dead, but she’ll need some new parts and a major stitch job.\n\n“Igor, you fucking idiot!” she yells from the floor attempting to get up. “Go help Dad! Wolf’s probably on his way there!”\n\nIf Mary knew you were coming back, she probably wouldn’t have dismissed Igor so quickly. She manages to stand up just as you stand in the doorway…with a torch.\n\n“You know what I like about these old castles? They always have torches and candles lighting the corridors.” You say.\n“Even in my present condition, you won’t get close enough to use that thing!” Mary says with defiance.\n“Save your feeble threats, but I don’t need to get close, you doused your room with perfume in your overly elaborate and dramatic attempt to trick me. Bye bye baby.”\n\nMary’s eyes widen as you dump the torch on the floor which lights up the room spectacularly. Mary attempts to get out of flames, but all the silver in her body makes her too heavy and she falls over again.\n\n“Hmm, maybe the undead do have emotions. She certainly looked scared and sounds like she’s in pain.” You say as you leave to catch up with the rest of the pack.\n\nYou don’t get far when you see the wolflings running towards you. Many of them are wounded, some badly.\n\n“What’s going on?” you ask, stopping one of them.\n“It’s too damn big! It’s unstoppable! We really tried! Honest!”\n“What?!”\n“Frankie! He’s been heavily modified. He doesn’t look at all like he did the old pictures I’ve ever seen of him!”\n\nNo sooner have you been informed when you hear that damn loud speaker again, the remaining wolflings run past you.\n\n“You see Wolf! You see! While you’ve been wasting away in that shitty cabin, I’ve been preparing for my son’s come back! You stole his woman! You ended his career! You didn’t just damage him physically, you damaged his mind! Scarred him emotionally! It’s taken me YEARS to undo the damage!”\n“Damaged his mind? He was a psychopathic serial pedophile made of corpses! What the fuck kind of damage could I have done? And Mary never liked him anyway!” you retort.\n“She could’ve learned! He could’ve too! They just needed more time! But YOU! You prevented all that! You and your dog dick!”\n“For fuck’s sake I wasn’t the only one fucking her!”\n“Yes, but you’re the one who did it the longest and destroyed my poor boy’s career! You’re going to pay! Frankie look who we have here! And old friend, why don’t you go and give him a big hug?”\n\nVictor goes into his mad scientist laugh yet again, and Frankie “2.0” comes lumbering down the hallway, he’s definitely got that cybernetic look now.\n\n“FRANKIE BEAT YOUR HEAD IN.” He says with a booming voice.\n\nStill as verbal and articulate as ever.", "action_results": [{"action": "Grab a torch and burn him", "result": "The problem with this tactic, is you’ve neglected to remember that Frankie has been vastly updated whereas Mary wasn.’t. Titanium plating doesn’t burn very well, as you find this out the hard way when you grab a nearby torch and shove it into Frankie’s body. It doesn’t do any notable damage. Frankie does some notable damage to you though.\n\nHe grabs your arm, breaking it in several places, and then takes the torch and sets YOU on fire, by shoving the flaming torch right through your body.\n\nFur seems to burn very well.", "action_results": []}, {"action": "Retreat", "result": "You jump out of Frankie’s way as he smashes into the wall behind you. You make your way quickly down the stairs, where you here Frankie getting back up and following you down them like a freight train.\nYou’re still a good ways from the bottom, but you see Igor appear at the bottom. You can’t stop or Frankie will slam into you and probably kill you by breaking every bone in your body and tearing you apart. You can keep going and attempt to jump towards Igor hoping you’ll land on him before he can fire accurately or you could jump over the banister and get out of the way altogether. The only problem with this is you’re still pretty high up. You wouldn’t die from such a fall, but you could break something if you land wrong and you certainly don’t want that disadvantage.", "action_results": [{"action": "Jump over the banister", "result": "You jump over the banister. Frankie goes flying past you unable to stop himself. You hear gunfire and some sounds of bullets plinking off of metal and burying themselves into flesh.\n\n“OH SHIT!” you hear Igor shout. This term is followed by your own, when you see that you were a lot higher than you thought. You go crashing through a solid wooden dining table. It hurts...A LOT.\n\nYou don’t get up right away and you half expect Frankie or Igor to come and finish you off, but fortunately that doesn’t happen. You painfully rise and prepare yourself for the final battle, which doesn’t occur.\n\nYou go over to the bottom of the stairs and see the wolflings taking advantage of Frankie’s weakened prone state and getting revenge for the beating he gave them all earlier. As for Igor he’s lying under Frankie crushed and dying. He’s bleeding from his ears, mouth, nose and eyes.\n\n“(Gurgle) (sputter) I’m sorry…Vic…Sorry brother…(Gurgle)” he says before dying.\n“Well I guess that explains his loyalty.” You say to yourself.\n\n“Hey Wolf you want to get in on this?” A wolfling says ripping a hand off of Frankie.\n“Nah, you’ve earned this. I’m just going to go back upstairs and finish off Victor.”\n“Need any of us to come up with you?”\n“No, you just make sure you do a good job of killing Frankie there.”\n\nYou head back up stairs and head to the lab that Frankie came bursting out of, it’s empty, but there’s another door in the room and you’ve got the impression that a certain doctor is behind it.\n\nYou open the door to a small room with a bunch of big computers hooked up to a brain in a jar…\n\n“Dr. Frankenstein I presume?” you say. “Wow Vic, I would’ve thought you would’ve at least made a clone body or something.”\n“Frankie! Igor! Get in here! NOW!”\n‘They’re dead just like you’ll be soon and should’ve been before.”\n“Erm…Wolf! Hold on! Come on, I can’t do anything to you! This isn’t fair! Hold on how about…”\n“How about you shut up and die?” you say and take Victor’s brain out of the jar.\n\n“NOOOOOO….” Is the last thing that comes out of the loud speakers as you crush the brain under your foot.\n\nIts over. You won, and you fucking hurt like hell. You stagger back downstairs where you find Frankie completely in pieces. The wolflings look at you expectantly.\n\n“Did you kill him?’\n“Yeah, and it was hardly worth the effort.” You reply.\n“What are we going to do now?” another asks.\n“Well I don’t know about you, but I’m going back home to rest.”\n“But aren’t you taking us to raise hell somewhere else?”\n“Maybe some other day. Look I’m not here to lead you around by the paw. If you want to raise hell you can certainly do it without me. I showed you the way of the wolf tonight, it’s up to you to do something with it. Just remember you’re fucking werewolves, live up to the name.”\n\nYou get back on your Harley and head home. Hopefully you taught the new generation something so tonight wasn’t a complete bust. You didn’t really get to have the epic battle you were looking for, but you survived and in the end that’s what it’s all about.", "action_results": []}, {"action": "Jump towards Igor", "result": "What happens next is so quick it’s amazing you survive it.\n\nYou leap up in the air in an effort to land on Igor before he fires. Frankie is still charging behind you, but that changes when you leap up into the air, because he ends up being underneath you when gains more momentum.\n\nMeanwhile Igor is attempting to lift that heavy arm weapon of his to accurately shoot you. The weight and the recoil makes it difficult and he’s not very accurate and begins firing everywhere randomly in your AND Frankie’s direction.\n\nYou’re still airborn heading towards Igor and now Frankie as well who’s somehow gotten in front of you due to him being unable to stop himself at this point. This is fortunate since this causes Frankie to block most of the randomly fired bullets with his body. You still take a couple in the leg though.\n\n“OH SHIT! Igor yells as Frankie slams into him and the floor at terrific speed. You don’t fair much better since you crash into the back of Frankie which is pretty hard due to the metal plating. It hurts like hell and you crawl off as quickly as possible while Frankie attempts to recover. Igor isn’t recovering as quickly; he’s bleeding from every orifice and whatever cybernetic parts he had can go to the scrap yard.\n\nYou’re in great pain and you got some silver bullets in your leg, but you need to act.", "action_results": [{"action": "Finish off Igor", "result": "You’ll never be able to fight Frankie in this condition and in his updated status, you get an idea.\n\nYou go over to Igor who pathetically attempts to point his weapon at you. You easily grab his arm weapon and begin to pull the thing out its weakened socket. Blood spurts all over you and Igor finally dies from the loss of it.\n\n“I’m sorry Vic…my brother… (gurgle)” he sputters.\n“Hm, that explains his loyalty I guess.” You say to yourself.\n\nFrankie’s is attempting to recover from his own wounds, but you’re not going to give him a chance to do it. You point Igor’s arm at Frankie and manipulate the tendons inside.\n\nThe gun fires and you blast half of Frankie’s head off with a rain of silver bullets. The recoil causes you to fall to the ground and the heat from it burns the fur on your hands.\n\n“Holy shit that was fucking cool.” You say impressed.\n\nFrankie’s not dead yet though, he tries to get back up, so you just take the weapon and club him in what remains of his head with it until he stays down for good. You then tear him apart to make sure. You stand over Frankie’s body parts panting heavily. You can’t even give a victory howl. You’re too tired. The rest of the pack comes in, somewhat surprised to see you alive.\n\n“You’re alive!”\n“Of course I’m alive! No thanks to you! Where the hell were you assholes?”\n“Um…well we didn’t know if we should help since you got mad when we did it last time…”\n\nYou can’t even argue with them, you’re too tired to do even that. You only have the strength to do one more thing…\n\nYou head upstairs by yourself, back to the lab Frankie came bursting out of, its empty, but there’s another door in the room and you’ve got the impression that a certain doctor is behind it.\n\nYou open the door to a small room with a bunch of big computers hooked up to a brain in a jar…\n\n“Vic, you really are a shitty Mad Scientist, you couldn’t even come up with a better way to prolong your life.”\n“Frankie! Igor! Get in here! NOW!”\n‘They’re dead just like you’ll be soon and should’ve been before.”\n“Erm…Wolf! Hold on! Come on, I can’t do anything to you! Hasn’t there been enough killing for one day!?\n“Not yet.” you say and take Victor’s brain out of the jar.\n\n“NOOOOOO….” Is the last thing that comes out of the loud speakers as you crush the brain under your foot.\n“NOW there’s been enough killing for one day.” You say.\n\nIts over. You won, and you fucking hurt like hell. You stagger back downstairs. Where the wolflings look at you expectantly.\n\n“Did you kill him?’\n“Yeah, and it was hardly worth the effort.” You reply.\n“What are we going to do now?” another asks.\n“Well I don’t know about you, but I’m going back home to rest.”\n“But aren’t you taking us to raise hell somewhere else? We want to do more werewolf stuff!”\n“Raise hell? You fuckers made ME do all the damn work! I killed every single member of this fucked up family all by my damn self! As far as I’m concerned I’M the only werewolf here! The rest of you are fucking lapdogs at best! I’m not leading any of you anywhere until you go prove otherwise…no fuck that. I don’t want to see ANY of you again! Well except Ginger. You know where I live baby. When you don’t want to hang around with these neutered pups, come see me.”\n\nUnsurprisingly Ginger comes with you immediately.\n\nYou and Ginger get back on your Harley and head home. You’re now convinced that you’re the last of a dying breed. Today’s youth are fucking spoiled. Still, you got to prove that you’re still the baddest ass Alpha Wolf this world is ever going to see, and it’ll be a long time before the world sees an Alpha Wolf like you again.\n\nThat is until Ginger has a litter of cubs…", "action_results": []}, {"action": "Finish off Frankie", "result": "You limp over to Frankie while he’s recovering and land a few well placed strikes, even ripping off some of the back plating. It’s no good though; Frankie’s still got a lot of fight in him. He turns around, grabs you by the throat and begins to squeeze the shit out of it, raising you off the ground. Igor who’s dying makes one last effort to avenge his last blunder.\n\n“For my brother Vic!” he yells and fires his weapon at you one last time. He can’t miss at this range and your death is instantaneous.", "action_results": []}]}]}]}]}]}, {"action": "Out run them and get into the castle", "result": "You don’t have time to fight some half ass experiments, the wolflings can handle that. You’re after a bigger prize. You leave the pack behind and run to the front door of the castle where upon you rip it off the hinges.\n\nYou’re in such a hurry to kill Victor; you don’t proceed cautiously enough and forget that he’s probably trapped the place. You step on a floor panel and a laser beam suddenly shoots out, incinerating you into ash.", "action_results": []}]}, {"action": "Memories (Igor)", "result": "The Assistant: Igor\n\nYou’ve never really had much contact with Igor, other than knowing he’s Victor’s assistant. For awhile you thought he and Vic had something ELSE going on, (Much like Vlad and Renfield) but that’s not the case. Igor’s just a loyal henchman.\n\nYou always wondered why he is though. Despite general public perception, he’s not stupid. In fact, he’s been the one that’s given Vic most of his “successful” experiment ideas. Vic wouldn’t even be around if it hadn’t been for Igor. Vic doesn’t seem to appreciate any of his help though and doesn’t treat him very well. He treats his experiments better than he treats Igor. You can only guess Igor is a masochist, or has some severe self-esteem problems.\n\nProbably both.", "action_results": [null]}]}, {"action": "Go kick Vlad's ass", "result": "Its long over due and its time. You need to go fucking kill that bloodsucker or die trying. You need to prove that you are and always will be the baddest of the monsters. You also need to prove to these wolflings that they need to be proud of their fucking heritage and not play second fiddle to some overgrown leeches.\n\n“All right you cubs! We’re going to go raise some fucking hell. We’re going to Dracula’s Castle. We’re going to rip the place apart brick by brick, and every fucking bloodsucker in the goddamned place and I’M going to rip Fagula apart limb from limb, drive a stake in his heart, cut his head off and then shove his dick in his mouth!”\n\nThe Wolflings look very apprehensive about your suggestion, in fact they outright refuse.\n\n“You’re a fucking crazy old coot; if you think we’re gonna follow you to Dracula’s Castle! Fuck that, he’s got an army of bloodsuckers and ghouls and who knows what the hell else! We can’t win that Wolf! Can’t we just bust up a bar or something?” one of them exclaims\n\nYou can’t believe your ears! These snot nosed pups know nothing of their heritage! Back in the old days they would’ve been killed and eaten for such cowardice!\n\n“Goddammit are you Wolves or fucking Chihuahuas? Vampires have been taking OUR rightful place in the monster hierarchy for centuries! We need to set the fucking record straight on this shit! Now are you going to run with me and be a fucking Wolf or are you going to go back home with your tails tucked between your legs?”\n\nAfter looking at each other for awhile they all begin to leave and head back to the studio.\n\n“Oh fuckin’ fine then, play werewolf in a movie, but I can see I’m the only fuckin’ REAL Werewolf here, the rest of you are just goddamn overgrown dingos! Fuck this, I don’t give a shit, I’ll kill Dracula my own goddamned self. I don’t need anybody’s help!”\n\nYou get on your Harley and ride. You only make a few stops on your way; you’re completely driven to have your final showdown with Vlad. Finally after a few days of riding you reach Dracula’s Castle. The place looks exactly the same. You get off your bike and scale the high iron gate. As you jump down into the courtyard you half expect yourself to be overwhelmed by vampires, or even ghouls, but nothing happens. This is weird, there aren’t even any guards patrolling or even at the door. In fact it sounds like a party is going on inside. You hear lots of laughter and music. Suddenly someone comes outside and sees you. It’s some Vampire chick.\n\n“Ohhh, a Werewolf! Wow, I didn’t know any of you types were invited to the party; I thought Drac hated you guys. Well what’re you doing standing outside? Come on in the party’s just starting!” she says waving you in.\n\nA bit of a different approach than you were preparing for, but you enter. You entrance to the ballroom is immediately a big event. You’re the only Werewolf there. Everyone else is either a Vampire, a ghoul, or even a human “servant”. Everyone is staring at you, some with wonder and interest, most with hatred, a few in awe. Most probably haven’t encountered a Werewolf like you before. The staring would probably continue if another slightly out of place being didn’t come shuffling up to you to talk you in a friendly manner causing the bloodsuckers to go back to partying. It’s Im-Ho-Tep. You’re surprised to see him here.\n\n“Wolf?! YOU got an invitation to this thing? I can’t believe it! What the hell did you and Dracula kiss and make up?” he remarks with his scratchy sounding voice.\n“Not in this life time Teppy. What’re you doing here?”\n”Me? Oh you know Vlad, he’s always gotta put on a show. Likes to play up the whole royalty thing to the other bloodsuckers, so he always invites me to these things to prove he’s got connections or something since I was a Prince. I always keep telling him, it’s a meaningless title since the Egyptian Empire fell thousands of years ago, but he insists on flying me out here, making a big fuss and everything so what the hell, it’s not like I got anything better to do plus I get a kick out of watching the bloodsuckers get drunk and make idiots out of themselves, well that and I like to look at some of these Vamp chicks. Heh, guess that makes me a voyeur, but again what the hell, its one of the few pleasures I get in this world anymore. But enough about this dirty old man, what brings you here if you weren’t invited? Just randomly crashing the party?”\n“Sort of…I didn’t even know there was one…I’m here to kill Fagula.” You whisper quietly.\n\nTep’s eyes widen a bit under his bandages. He isn’t entirely surprised (At his age barely anything surprises him anymore) but he was caught a little off guard by your statement.\n\n“Wow Wolf…I can tell you’re really not joking about this. All I can say is… what took you so long? I thought this day would come long before now. Lost some bets because of it, oh well easy come easy go. Well you know your secret’s safe with me, though I suppose it won’t be a secret for too much longer! You’re still the craziest sonofabitch I know, but then you always did know how to liven up a party! Ha ha! Ol’ Vlad will probably be making his grand entrance soon, so just wait awhile. He threw this party for some kind of special announcement he has to make. I still got a bet with Erik that you would win if you and Drac ever got into a battle to the death. I’ll be hoping to collect that bet from Erik. Good luck!” Tep then shuffles off back to where he sitting.\n\nErik bet against you? Fucking little depressed shit! You’re going to have a little talk with him after all this.\n\nYou put your back against the wall, watching everyone while waiting for Dracula to arrive. An hour passes and you’re fucking sick of waiting, you don’t feel like waiting for him to make “an entrance”. You’re here to commit major mayhem on him, not listen to anything he has to say. While you’re surveying the place, you see a disheveled man peek out from a corner across the room and then slink back. That was Renfield, you’d know Fagula’s sycophantic bitch boy anywhere.", "action_results": [{"action": "Wait a little longer", "result": "You figure he really can’t be that long now, and decide to wait. Soon you see Renfield come back, he tells everyone to quiet down on orders of his master.\n\n“Excuse me everyone, I know you’re all anxious to hear what my master has to say, but I have been informed that he will not step into this room until a certain infestation has been taken care of first. Namely THAT ONE OVER THERE!”\n\nSuddenly all the Vampires, Ghouls and Human servants look at you and advance! You’re beyond out numbered. You put up a good fight for someone in your position, but ultimately you are scratched, bitten and sucked dry. And not in the good way either. You are then skinned where your pelt is hung up over Drac’s fireplace, where he always brags about how he defeated you single handedly.", "action_results": []}, null, null, null]}, null, null]}, null]}, null, null, null]}]}