{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=2280", "context": "", "first_story_block": "Welcome and thanks for playing Cryptode!\nThere are many things that you need to watch out for and need to know before the game begins.\n\nTime -\nLife -\nOther -\n\nThese three things control how the game is played. If you waste time during the game, and your time counter reaches 0, you will lose the game. Life is like health, if it reaches 0, you will lose the game. Many other things control the flow of the game, such as # of bullets, luck score, and more, keep these things in mind while you are playing the game.", "action_results": [{"action": "Start", "result": "You are a relic hunter who has just returned from a search in Egypt. You have brought back with you a few items, including a book. You are reading the book, feeling pretty bored, when you come to a page entitled,\n\"Cryptode\" It says,\n\n\n'A square of three dimensions\nis locketh before thee,\nUnlock it and thee shall be rich,\nOne mistake and thee shan't live again'\n\n\nYou know the Cryptode is a lost object that needs to be opened by a code. You have decided to try to crack the code. BUT FIRST, you need to see someone.", "action_results": [null, {"action": "Information and Equipment", "result": "You have gone to see your old friend and famous relic hunter, Smith. You ask him for more information on Cryptode. He tells you that the first part of the code supposedly lies somewhere in the Sistine Chapel but people have searched there before and never found anything. You ask him for a gun and other equipment to help you on your journey. He gives you a 9mm Heckler and Koch Pistol with 9 bullets already loaded.", "action_results": [null, {"action": "The Airport", "result": "You enter the airport with confidence. You have decided to mail the pistol to yourself right before you board the plane.\nYou locate the baggage check and step into the line for your airline. You wait for 30 long and boring minutes and when you are finally next for the baggage check.\n\nYou locate the baggage check and step into the line for your airline. You wait for 30 long and boring minutes and when you are finally next for the baggage check.\nThe man at the check finishes with the man who was in front of you and is about to call you over when a major power surge erupts throughout the airport! Yellow, bright sparks fly from computer monitors, TV screens, electrical outlets, and all plugged in electronic devices.\n\nYou hear screams from many of the women and children mouths. For a few minutes you are outside on a pitch-black night. When the back up flood lights turn on, you see a tall man in a black suit run towards a podium used for airport contests. He shouts out to everyone, \"We are currently unaware of what has caused the surge but we are investigating. Due to the power surge, all computers and databases have been 'fried' and therefore all airline departure information is lost. We are very sorry for the inconvenience and yes, we have notified the authorities. We should have airline information in the next ten hours at the least. We advise you to stay within the airport...\"", "action_results": [{"action": "My Options", "result": "You realize you may not have too much time. Before you left, Smith said something about other people searching for the Cryptode as well.\nYou do have a few options:", "action_results": [{"action": "Take a Taxi (+$100)", "result": "You step outside and flag down a taxi. You get inside and ask him to drive you to the nearest airport. He says that it will cost you $100 when you arrive there. You have: $200.", "action_results": [{"action": "Let's Go!", "result": "You tell him to go! After about 30 seconds, you are pissed off by the slow rate at which he is driving. You tell him to hurry but he keeps his slow speed constant.", "action_results": [{"action": "Continue like this", "result": "The taxi driver asks for $100, by clicking the link below $100 will be deducted from your wallet.", "action_results": [{"action": "$100", "result": "You pay $100.\n\nYou can give a tip to the taxi cab driver.\n\nYou have $100.", "action_results": [{"action": "$5 Tip", "result": "You hand him some extra money and step out of the taxi. Almost immediatly, the car takes off for the next toll.", "action_results": [{"action": "The Airport", "result": "You arrive at the airport and wait about an hour. You walk up to a flight attendent...", "action_results": [{"action": "On the Plane", "result": "You give her the ticket and walk through a door that leads into the plane. You get on the plane and find your seat.\nIf you do not see a link for a flight, it means you have run out of time and must end the game, going back will do nothing.", "action_results": [{"action": "During the Flight", "result": "You have been given +5 time, which most must be used on this plane. There are many things that can be done and are worthwhile. Once you have used up enough time, the plane will land.", "action_results": [{"action": "Eat", "result": "You wait till the food comes and you start to eat. You gain a little life.", "action_results": [null]}, {"action": "Washroom", "result": "You decide to go to the washroom, in the long line in the middle of the aisles, you meet a man who is very friendly and he gives you some medication, he says he works for the medicine company and he is giving out free trials. This medication will allow you to gain some life during some stages of the game.", "action_results": [null]}, {"action": "Rest", "result": "You decide to take a nap and wake up a bit later. By taking a nap, you gain some life.", "action_results": [null]}, {"action": "Play cards with the people next to you", "result": "You decide to play cards with the people sitting next to you. You play poker and win some money and in doing so, some luck.", "action_results": [null]}, {"action": "Talk to the flight attendant", "result": "You end up talking to the flight attendant. She tells you that she knows Smith (person you got the pistol from) and he told her about the quest. He wanted to make sure you got some more items.\nA magazine of 7 bullets and a key. The bullets will be recorded in a variable.\nYou have 16 bullets.", "action_results": [null, null]}, {"action": "Talk to the girl in front of you", "result": "You talk to the girl in front of you. You gain nothing from this option.", "action_results": [null]}]}]}]}]}, null, {"action": "No Tip!", "result": "You decide not to give him a tip. He realizes this and wants you out of the cab immediatly. Right after you close the door and your feet are on the ground, the taxi driver floors the gas pedal. You have to move quickly before he clips you.\n\n\"Louzy cab driver!\" you yell.", "action_results": [null]}]}]}, {"action": "Pull out some money and influence him to go faster", "result": "How much do you want to bribe with?\n\nYou have: $200", "action_results": [{"action": "$5", "result": "He speeds up and you make it to the airport in good time.", "action_results": [null]}, null, null, null]}]}, null]}, {"action": "Take a Transit Bus ($2)", "result": "You walk outside and find a transit stop. You wait for a long while contemplating on whether or not this was the best choice. Just as you change your mind, the bus appears from around a corner and slows down to a stop in front of\nyou.", "action_results": [{"action": "On the Bus ($2)", "result": "You switch a few buses along the way but eventually you reach the airport.", "action_results": [null]}, null]}, {"action": "Wait for another plane ($0)", "result": "You decide taking a nap on the bench will pass the time. You immediatly fall aspleep as you grab a complimentary pillow and rest it under your head. 5 hours later you wake up and find out you missed your flight. It will be another 3 hours before the next flight but the airport will not charge you for another ticket.", "action_results": [null]}]}]}]}]}]}