{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=56753", "context": "", "first_story_block": "You wake up, but meh.  Who really cares? \n\n\nYou walk out of your chamber, the giant stone echoes with the sounds of your footsteps.  As you exit the hall you gaze upon the worthless denizens of your humble abode. \n\n\nThey all wander around, asking you your opinions of things, but do you care?  Meh, not really.  Another sound catches your ears.  And from out of some random chamber comes a short girl with orange hair. \n\n\n\"Ah, my cherry pie,\" you say as you kiss her on the forehead.\n\n\n\"Hey, you slept in pretty late!\" She says.\n\n\n\"Meh.\"\n\n\n\"I'm going to go to Cystia today?  Want to join me?\" she asks.\n\n\n\"Meh.\"\n\n\n\"Meh?\" she asks.\n\n\n\"Might stay in Discordina today.\"\n\n\n\"Why?\"\n\n\n\"Eh, don't feel like it.\"\n\n\nAs you continue on, you see more and more people and things you do not care about at all.  Eventually, you make your way down the hall to one of your favorite rooms.\n\n\nThe whirring and clanking of machinery and other things is like music to your ears.  But that's not all.  Ahead, someone covered in scales stands in front of a large machine.  Large and with plenty of metal tubes, each with green liquid running through them.  It is through this invention, and with the help of this green magical essence, you can alter reality itself.  It's called the Deviner, the greatest invention to ever exist.\n\n\nYou step forward to plug yourself in, the large needle like object about to prick through your forehead.  But as you do so, you don't feel the rush of the running green liquid.  In fact all you hear is an odd clunking and churning sound. \n\n\nNothing happens, and you frown. \n\n\n\"Damn it!\" The scaly dragon man says, \"I think something is busted.\"\n\n\nYou rip the needle out and let it dangle where it sits.  The machinery itself seems to have broken down, collapsed and laying defunct.  The dragon man starts gathering pieces of what machinery he can.  Before you can do anything, he stops you.\n\n\n\"I'll work in this stuff, you should go to Cystia and find some of those magic crystals.\"\n\n\n\"Why?\" you ask.\n\n\n\"Not only did the machinery break, it seems the magic crystal over charged, and sent a surge of magic throughout the liquid.  So it broke down the weaker parts of the Deviner.\"\n\n\nYou sigh, one of the few things you gave a shit about. \n\n\nYou walk down the worthless halls, pass all the worthless people, and finally reach one of the worthless carriages.  It seems several of them have taken off anyway.\n\n\nAs you sit down, you slump into the comfy seat you had installed in the carriage.  The worthless guy driving it flicks the reigns, causing the worthless horses to go forward.\n\n\n ", "action_results": [{"action": "Destination", "result": "You finally arrive to the bustling land known as Cystia!  As you drive through the wild lands, you see several guards in armor patrolling along the roads. \n\n\nThese stone roads must be new.  Ahead you see three of the guards chasing some furry creature, landing several arrows in its back as it finally goes down.  The guards stand in the middle of the road, one steps forward and raises a hand.  The carriage grinds to a halt.\n\n\nYou look the window as a guard briskly approaches.\n\n\n\"The roads are dangerous, you shouldn't be traveling alone.\"\n\n\n\"Meh,\" you shrug your shoulders.\n\n\nThe guard sighs, his tired eyes looking blank for a few moments.\n\n\n\"The beast folk roam these lands,\" he says, \"at least allow a couple of our guards to travel with you.\"\n\n\nYou shrug your shoulders, and the guard orders two of his underlings to join you in the carriage.\n\n\nThe ride is uneventful, although there are a few minor sights to see along the way. ", "action_results": [{"action": "Town", "result": "It is about noon by the time the carriage reaches the gates of the civilized lands of Cystia.  A few shouts from the guards over the walls, and the heavy wood and iron gates creak open.  The carriage pulls up to a wooden…shack, where a couple of dirty peasants come out to take care of the horses. \n\n\nYou step out of the carriage, and take a look around.  Hopefully some crystals should be somewhere in Cystia…if not you're going to have to make a hike to a very powerful magic users place.  Not that you can get in there, but you'd have to try.\n\n\nYou have to try and figure something out, otherwise you'll never be able to use the Diviner again!\n\n\nYou go to look around that all this portion of Cystia has to offer.  Now where could those magic crystals be?", "action_results": [{"action": "Lair", "result": "A feeling of intense dread fills you up, making you feel not so warm inside.  You're last trip to this place was….interesting.  After getting painfully banished you decided to ignore the place and just continue on business as usual. \n\n\nBut you NEED to get these crystals, otherwise what will become of your place in Discorina?\n\n\nIt takes hours, but eventually you make your way past the main city, and through the dirt road.  Ahead, the large and dark castle looms over head.  The ashy clouds spewing a host of rain and lightning strikes viciously at the ground.  The stone walls surrounding the castle appear foreboding, several small watchtowers dot the wall.\n\n\nDark spires stretching upward, the metal spikes on top of them catching some of the lightning bolts.  As you near the wall, you swear you hear something turning and whirring from deep within the castle, amidst the sound of the storm.\n\n\nShivering and trembling you jog over to the castle, hoping you can get what you're looking for, and maybe a place to warm up.\n\n\nThe large wooden gate appears to be shut, you didn't expect it to just be wide open though.  You grab the rope on the side and pull it with all of your might.  The large bell connected to it rings out its horrid tune.\n\n\nAs you stand, soaked and cold, the door slowly opens but just a bit.  Taking a step forward you squint at the opening.\n\n\n\"Who's there?\" a voice says, \"Ford?  Is that you?\"\n\n\n\"Yep,\" you say.\n\n\n\"Ha, you know you're not allowed here.\"\n\n\n\"I'm just here for some magic crystals…nothing else,\" you say.\n\n\n\"I think that would be going against the rules…remember what happened last time you were here?\"\n\n\n\"Can you at least let me in from the cold, please,\" you say, \"wouldn't it be nice?\"\n\n\nThe door opens more, and the source of the voice steps out.  A tall man, hair shaved and clean shaven, he smiles.  But there is something else to that smile, it's not exactly coming from a place of hospitality.\n\n\n\"Sure,\" he chuckles, \"this should be interesting.\"\n\n\n\"Thanks,\" you say as you walk past him.\n\n\nYou enter the tunnel that eventually leads to the door…which you find to be open.  Walking in like you own the place, you take a look around.  The large keep appears empty…as far as you can tell.\n\n\nThe winds of the storm buffets against the castle, it almost obscures the sound of your soft steps as you traverse across the large keep. \n\n\nWandering down the halls, you stop suddenly as you hear something. \n\n\n\"REEEEEEEEEEEEEEEEE!\"\n\n\nShrugging your shoulders you continue, must have just been your imagination.\n\n\nThe halls twist and wind, and you feel as lost as ever.  How did you ever navigate this place in the short time you had spent here?\n\n\nThat darn Sorceress must be around here somewhere, she must have some magic crystals.  But where could she be?", "action_results": [{"action": "Spire", "result": "You start with the most obvious place, the spire that she lives in.  As you pass a few rooms, you hear a strange sound coming from one of them…meh. You continue on, not caring about what is very likely one of the many strange noises you will be hearing tonight.\n\n\nAfter going up several sets of stairs, you come to one that narrows and….spirals as you go up it.  After several minutes you find yourself at the top, amidst a huge library.  You walk through the place, eerily quiet.\n\n\n\"Ax…Ax!\" you shout.\n\n\nNothing.  Eventually you find a bed, a desk, and some table meant to magic things or whatever it is she does.  Having no interest in anything that could be stashed in here, you continue on your way.\n\n\nWhere else could you look?", "action_results": [null]}, {"action": "Garden", "result": "You go to the interior garden, flowing with life, plants, some animals, the place is huge.  You look around, and as you call out don't see anyone.  Guess you'll have to look elsewhere.", "action_results": [null]}, {"action": "Kitchen", "result": "Ah, that’s right, it must be dinner time!  After spending several more long and grueling minutes trying to remember your way around the place, you pass through some of the halls until you find the kitchens. \n\n\nAnd what a smell that greets you!  Someone is cooking up some good shit!\n\n\nAs you enter the large dinner hall, the near empty place seems somewhat startling.  As you get closer to the trio, you see one woman holding several chickens in her arms and softly whispering to them. \n\n\n\"Who are you?\" you ask.\n\n\n\"It's simple…I'm Sabley,\" she says before going back to the most precious chickens.\n\n\nThe second person you see is some girl with little snakes for hair, and her eyes….by God her eyes…you stare with horror into the empty void that was her eye sockets, as you do so a little beetle crawls out of one of them, takes a shit on her eyebrow, and goes back inside.", "action_results": [{"action": "Stare into the Void", "result": "As you stare into the gaping chasms, you think you see something flickering within, it is a quick flash of red…then it is gone.  As you keep staring the darkness seems to seep out of them and take over your vision.  You tremble and shutter and fall to the floor…\n\n\nTime...time loops...", "action_results": [null]}, {"action": "Ask where Axiom is", "result": "\"Where is Axiom?\" you ask.\n\n\nMisjudging the sound, the blind freak turns towards the empty wall. \n\n\n\"Last I saw, she went down to the dungeon,\" she says patting the chair next to her, \"don't worry, you'll find her soon enough.\"\n\n\n\"Thanks,\" you say.\n\n\nShe turns to you.\n\n\n\"I wasn't talking to you,\" she says turning back to the chair once again, \"some people, no respect for private conversations.\"\n\n\nShe shakes her head in disgust and begins going into detailed instructions of where the dungeon could be.\n\n\n\"Well, our friend Corgi could take you there,\" Sabley says, \"he knows where the dungeon is, don't you Corgi?\"\n\n\nYou hadn't really paid attention to, or noticed the third person in the trio.  By your feet sits a little dog, its short fur pasted and matted with…you don't really want to know what.  The dogs tongue perpetually hangs out from the side of its mouth, and as it stares at you, its left eye seems shift to the left.  Its pupil almost hides within its eye socket.\n\n\n\"Oh, I think he is trying to point towards the door.\"\n\n\nYou look in the direction of the eye to see the door you came from.\n\n\n\"He wants you to show him where the dungeon is, can you do that?\" Sabley asks.\n\n\n\"Daaaargh!\" Corgi shouts and vigorously shakes his head up and down.\n\n\nIn a moment he briskly walks over to the door, his little feet making padding sounds.  You have no choice but to follow it at this point.\n\n\nThe dog sits by the door and waits for you to catch up before continuing.", "action_results": [{"action": "Dungeon", "result": "After some time, the dog sits in front of a large stair case.  He sits and faces you, his left eye rolling into the back of his head, presumably to point at the stairs right behind him.  As you walk down the stairs you almost don't notice the dog following right behind you.\n\n\nYou finally reach the long and dark corridors.  As you walk past multiple cells, you see a demented looking furry man sitting in a cage with a giant lizard.  They roll a ball back and forth, the furry man just repeats \"Jibble\" over and over again, drool coming out the side of his mouth.\n\n\nWith shivers going down your spine, you continue on, not wanting to know what sick degeneracy this will turn into.  Along the way, you hear a giant Uuuuurp! and peer into the cell it came from.\n\n\nMaterializing from the shadows is a large, ugly….Ogre!  The good natured being waves and smiles at you.\n\n\n\"Didn't expect to see you here!\" he says.\n\n\nNot caring you shrug your shoulders and continue on, the Ogre cares even less and goes back to scratching his ass or whatever it is ogres do. \n\n\nEventually you find your way to a break in the wall, bricks lay on the ground, and moss grows along the walls of the cave that gives way.\n\n\n\"Dar!\" Corgi shouts and his eye points to the cave.", "action_results": [{"action": "Cave", "result": "You enter the dark cave, and after a few minutes of feeling around curse yourself for not thinking to grab a torch from the wall.  Eventually though, a light emanates from up ahead.  Surely she is hanging out over here.\n\n\nThe torchlight almost blinds you as you step out.  The cave expands out to a huge cave system, filled with thousands of glowing plants and mushrooms of various sorts.  About halfway across is what appears to be a river running out to the ocean.  A small dock sits empty, as a lonely lamp on a post shines bright.\n\n\nA small campfire burns, with several log benches surrounding it.  Two figures sit around it, small green glowing things in their hands.  You nonchalantly walk up to the campfire, the dog goes and crawls into some makeshift dog house not too far away.\n\n\nSitting on each side of the fire are Malk and Steve.  The first wearing a pink tutu, and a regular fur shirt above that, he sees you eyeing the tutu.\n\n\n\"What?\" Malk says, \"it's a joke.\"\n\n\n\"Whatever you say,\" you say, \"have either of you seen Axiom?\"\n\n\n\"Just missed her, I'm afraid,\" Steve says, \"hey, do you want to sit with us for a while?\"\n\n\nYou start to shrug your shoulders.\n\n\n\"You should warm up,\" Steve says, \"you look soaked.\"\n\n\nYou decide to sit and humor them for a while, besides, the fire is quite warm.  Steve points to the small dock.\n\n\n\"Axiom took that boat not two hours ago,\" Steve says, \"no idea why she would in a storm like this.\"\n\n\nYou look to the empty dock once again, before looking down to the dark abyss that is the cave system.\n\n\n\"These caves extend much further out than any of us would have imagined,\" Steve says, \"what lies in the depths is any ones guess.\"\n\n\n\"As long as she didn’t go too far into them,\" you say, \"although she would probably know them  better than anyone else.\"\n\n\n\"No, she went to the ocean,\" Steve says, \"although she does traverse the caves often enough.\"\n\n\n\"Eh, she'll be fine,\" Malk says, \"hey Ford, want to try one of these?\"\n\n\nMalk extends his hand, revealing a glowing green mushroom, and a dark red plant in his palm.\n\n\n\"These will have you up in the clouds for days, man,\" Malk says, \"shit's good.\"\n\n\n\"What exactly is it?\" you ask.\n\n\n\"Some kind of mushrooms,\" he says.", "action_results": [{"action": "Don't Eat the Mushrooms", "result": "\"Eh, no I'm good,\" you say.\n\n\n\"What? Why not, man?\" Malks asks.\n\n\n\"I just don't trust any old thing-\"\n\n\n\"Bah, whatever.\" Malk says as he jams the mushroom in his mouth, and seems to take too much pleasure in chewing it up and swallowing it…especially the swallowing.\n\n\nHis eyes roll up into the back of his head a moment and then he grins as they roll back into place.  His glazed eyes have a faraway look, and drool starts to drip from his mouth.  Glancing back, you notice Steve seems to have ingested the mysterious mushrooms as well, he stares at the ceiling.\n\n\n\"Whuuuuh,\" Steve says, \"look at you, you sexy thing.\"", "action_results": [{"action": "Continue", "result": "You decide it would be best to wait around for a while, no use in going out and getting lost.  As you wait, Steve and Malk seem to have ingested more of the mushrooms. \n\n\nMalk stands up and starts twirling like a pretty ballerina, and Steve starts dancing some king of Irish jig.  In their minds they probably look like professional dancers…to you they look like a couple of idiots sloppily flailing around. \n\n\nMalk grabs your hands and starts trying to dance with you…..fuck it!  You join in and spin him around right before dipping him, and throwing him in the air and catching him.\n\n\nHe brings his lips close to yours, and you turn away in time to get a big, wet, sloppy smooch on the cheek.  Cringing you drop him and step away.\n\n\n\"Too far?\" Malk grins as he snorts something else and starts hopping around like a frog.\n\n\nYou see Steve take out some paper and begin to furiously scribble on it.\n\n\nYou turn and scratch your head, wondering what exactly you have gotten yourself into.  Malk hops up and tries to do the same jig he saw Steve do earlier, but only more horrible and sloppy.\n\n\nMalk belts out a song as he dances, at one point almost falling into the fire, but you catch him and pull him away.  He doesn't even realize and continues what he is doing.\n\n\nHe kneels down and picks up the red plant.\n\n\n\"I've never tried this one before…\" Malk looks at Steve, \"let's try it boy-o.\"\n\n\nSteve looks up, already having several large books filled up with his writing.  That was fast.\n\n\n\"Indeed, my friend, indeed we shall,\" Steve stands up and takes a plant, \"hmm, not sure if we should…\"\n\n\n\"Bah! Nonsense!\" Malk says, \"man, I could really go for some pie right now.\"\n\n\n\"Ughh,\" Steve's face coils up into disgust.\n\n\n\"I absolutely hate pie,\" Steve says.\n\n\n\"Eh, you can help me make it then,\" Malk says.\n\n\nSteve shrugs as he and Malk begin to crush up parts of the red plant, and rolling it up in some leaves.  After lighting it up using the camp fire, they smoke the crap out of that thing.  They're eyes becoming red as smoke fills the immediate area.\n\n\nAfter some time you start to feel a bit woozy…too much smoke around you.  As you sit, Malk giggles and points at you.  Steve laughs his ass off and almost falls out of the log bench.\n\n\n\"Man, I hate pie,\" Steve says, \"but I sure could use some.\"\n\n\n\"Haha fuck, fuck, fuck fuck!\" Malk screams, \"I have a great fucking idea!\"\n\n\nBefore anyone can say anything, Malk leaps up and grabs you by the collar.  His eyes start to glow red like the red plant, and so do Steve's eyes. Both giggling they drag you up the cave, even while you kick and protest.\n\n\n\"Man, this will be so funny,\" Malk says, \"hah…fuck…best joke ever…\"\n\n\nYou open your mouth to try to speak, but Malk turns and vomits up some green, glowing liquid, it fills your mouth and you sputter and choke. \n\n\n\"Ergh! Fuck!\" you scream.", "action_results": [{"action": "Baked and Baking", "result": "The two high motherfuckers throw you onto the table in the kitchen.\n\n\n\"Wha-what are you guys doi-\" you say.\n\n\n\"Shut the fuck up! It's okay,\" Malk says as he strokes your hair, \"it'll be fun, you'll love it!\"\n\n\nA sound grabs your attention, and you turn your head.  A man with two sharp horns and pinkish red skin, enters.\n\n\n\"Karstark! Er- Lord Karstark!\" Malk says, \"you're just in time, want to help?\"\n\n\n\"Sure…suuuure,\" Karstark grins and laughs evilly as he rubs his hands together, \"what are we doing?\"\n\n\n\"You'll find out,\" Steve snaps and shakes his head, and he and Malk each glance at each other and shake their heads at Karstarks foolishness, a thing only known to them.\n\n\nAs you turn to look at Malk, you scream as an axe blade buries into your face.  Another whack and your eye pops out of your head, miraculously you're still able to see Steve preparing a little silver tray.\n\n\nKarstark steps forward and before you know it, he is sawing your arm off, and drinking the blood of your severed arm.\n\n\nYou cough and sputter blood as you start to fall off the table, and Malk hoists you up back onto it with surprising strength.  He scolds Kar for drinking your blood, and your vision goes dark as they continue to hack you up….", "action_results": [{"action": "Wake Up", "result": "In the inner recesses of your consciousness, you feel an extreme heat burning up your body.  You try to scream but can't just yet.  You feel something moving though, must be your mouth.\n\n\nA grating sound grinds against your ears, and you cringe as a gloved hand grabs you and pulls you from the searing heat.  You suck in a fresh gasp of air, and the two faces above you gasp and place you on the table.\n\n\nA third one comes into view as they all stare at you in horror…you recognize these faces…you're sure of it.  As you are placed, more like thrown on the table.  You feel a jolt of something course through you…and you remember.\n\n\nYou remember fleeting bits of pain as these high as mother fuckers chopped you up. \n\n\n\"What did we do?\" Steve asks.\n\n\nThe trio looks at each other, Karstark, being a demon, just laughs.  Malk and Steve pick you up and hurriedly make their way to the sewage grates.\n\n\n\"Sorry man,\" Malk says, \"we're not sure what else to do.\"\n\n\n\"Wait!\" Steve says.\n\n\nBut it's too late, you've been dropped in the drain and swirl in the stream of nasty, shitty, sewage water…", "action_results": [{"action": "Swirls and Shit", "result": "Pain…true pain…something stabs at the edge of your consciousness.  No wait…\n\n\nYour eyes snap open, your shit and filth covered body reverberating as something slams into it…again and again.  As the feces float out of your vision, you are accosted by the horrible sight of one of the beast people!\n\n\nIt's little fuzzy pole jamming in and out of one of the many openings in your body.  Your mouth gapes wide and excretes a foul, smelly, green liquid, covering the Rat Man!  It screams as the acidic taste burns its flesh, and it hops into the squishy log filled waters in an attempt to wash off the liquid…bad idea. \n\n\nIt screams from the pain of all the horrible bodily fluids and excrements entering its open wounds.  And unable to handle the pain, it goes under and opens its mouth, swallowing as much as it can in a strange act of self mercy killing.\n\n\nYou groan in pain, and realize you can't…but wait.  A tentacle slowly emerges from your body slowly snaking on the stone walkway.  Green glowing liquid seeps off of it and the tentacle crawls…but it twitches as well.\n\n\nAfter some straining and braining, you eventually learn you can control it! The rat-man cum and magic ooze must have somehow combined to give you these extraordinary powers!\n\n\nYour silver tray scrapes across the stone walkway as you grow another tentacle to pull yourself across…uggh, so damn slow.\n\n\nSome squeaks meet your ears, and you look over, to see several rat-men approaching, armed with rusty swords and spears.  One of them, the apparent leader watches you intently, his paw on resting on the sword sheathed at his side.\n\n\nTwo of the rats approach, one armed with a little club, and another with a spear.  The one with the spear pokes at you a bit, and you see one further back licking their lips.  The leader calls out to the rats in their language, and the one who was poking at you shrugs and seems to dismiss him.  These rats are bothering you, and pose a great threat…but you get an idea.  A way to get more power…", "action_results": [{"action": "Eat One", "result": "You lash your tentacles forth, one yanking the spear from the rat, and the other coiling around his neck and pulling him closer to you.  As you try to eat him, he squeaks in fear and plants his paws on either side of you, pushing away with all his might. \n\n\nAs he manages to pull away a bit, the other rat leaps forward, slamming the iron end of his mace down onto you.  The cherries and human flesh inside of you splats on the stone, as everything feels fuzzy.  A few of your teeth fall out, and the last thing you see is the rat raising the mace against you for the last time….", "action_results": []}, {"action": "Spit Acid Goop", "result": "Your eyes widen as does your mouth, as the acidic vomit leaves your face, the rat yelp in surprise.  Their flesh sizzles as the spear wielders leg burns to the bone, and he falls to the ground.  The other rat holds his face and writhes out in agony before falling still.  You lunge forward your tentacles, grabbing the surviving rat-man of the two and drag him closer.  You munch and chew on him as you fit the whole rat-man in your mouth.\n\n\nYou feel a burst of energy coursing through you, and the silver tray falls out from under you as you gain mass and power.  Smirking evilly you lash out your tentacles once again, growing more as you do so.\n\n\nYou strike one in the face, sending him against the stone wall, his skull cracking against it.  He slumps down in a pitiful heap.  The next one you wrap a tentacle around his ankle and force him into the shitty waters about a foot below him, sending another tentacle down to keep him under.\n\n\nThe leader of the rat-men and his last two appear at a loss as to what to do.  You leap forward, jamming a couple tentacles down one of their throats, and coiling around his wrist to stop him from reaching for his sword.\n\n\nThe leader hops back as you shoot a tentacle around his other friends neck.  Your mouth opens wide, and you gargle some of the green acid before shooting it at the trio.  With surprising speed the leader chops through the one tentacle around one of his friends neck with his rusty sword.  They spin as he tackles him into the fece filled water just in time to avoid the acid!\n\n\nUnfortunately there was nothing he could for the other rat-man, fortunately for you.  You finish him off, and proceed to consume the corpses.  You watch as the rat-man leader and his only surviving friend stare in horror as they let the current carry them somewhere safe.\n\n\nYou're not worried about them, you have what you need. ", "action_results": [{"action": "Growth and Revenge", "result": "Now that you have grown in power as well as size, it is time to exact your revenge!  Your three potential targets won't be too easy at all.  The first, and perhaps the easiest to get to might be Karstark.  While you will have to worry about his entourage of demons, they don't seem like too much of a threat.  You will have to travel a fair way to the demon infested shit areas of Cystia, but shit, with your appearance they will probably think you are one of them.\n\n\nThe next possible target is Steve.  He shouldn't be too hard to find, especially if you start looking now, before he sails off somewhere again.  Shit, you might even be able to get him and Malk in one fell swoop.  The only thing about him is that he is a tenacious bastard, he will not go too easily.  You've seen his alcohol fueled duels against some of the beast people and other members of the land. \n\n\nThen there is Malk, who will likely be most on his guard.  You'll have to try and catch him when he is high or drunk, as he won't have too good coordination like Steve.  The issue with him is that if he channels his berserker rage you're probably fucked.  Might have to sneak up on him when it comes time to get your revenge on him.\n\n\nYou sincerely hope none of the other villains get in your way, which is always a possibility.  You will just have to cross that bridge when you get there.\n\n\nSeems like Karstark will may be the easiest, so you'll start with him.", "action_results": [{"action": "Karstark", "result": "Well, you'll have to go with the weakest link first.  Besides, he was the only one completely sober when they chopped you up and baked you into a pie.  That bastard.  Being the large sack of pie that you are, you roll your way out of the sewers, careful to evade any of the large groups of rat people looking for you.  You do travel by the sewers though, and the going is easier when you get out of rat territory.\n\n\nYou come across all manner of freaks and beasts in the sewer systems, which span for miles and miles.  A few times you even get someone to guide your toward Lord Karstark's little territory. \n\n\nYour current guide, some Nuub named Lord Shark points up to a ladder.  Apparently these two Lords have been feuding for a while now, so of course he would be happy to help you! \n\n\nYou're about to make your way up when he holds up a hand.\n\n\n\"Hey, so this ladder should lead right into the middle of his camp, in a not so open place of course,\" Lord Shark says, \"but if you go a little more up that way, there should be a pipe that leads somewhere else in his camp.\"\n\n\nShark looks around before continuing.\n\n\n\"I can't say for sure where it goes but it couldn't hurt to check it out.\"\n\n\n\"Thanks,\" you say, \"I appreciate the assistance.\"", "action_results": [{"action": "ladder", "result": "You climb up the ladder, open the hatch, and find yourself smack in the middle of Karstark's camp just as you expected.  You look around, several demons are just milling about.  While demons should be inherently scary, they don't seem like anything a human pie couldn't handle. ", "action_results": [{"action": "Stealth", "result": "You decide to play this as quietly as a pie that needs to roll and slither about can.  Somehow, you manage to make it across the fort ruins, evading drunken \"patrols\" and such.  Rolling past all the tents, you eventually find who you're looking for. \n\n\nSitting on an outhouse potty…without the outhouse, is Lord Karstark.  His nose buried in some a story by one, who goes by the name of queenlatifa04, with the lowest rated book, presumably about to be turned into toilet paper.\n\n\nYou send your tentacle forth, stabbing through the shitty (or soon to be shitty paper) and the tentacle slams right through his chest.  Karstark's mouth gapes and quivers.\n\n\n\"Y-y-you….I remember you…\" Karstark says.\n\n\n\"I would assume so, you just turned me into a pie,\" you say.\n\n\n\"That was…months ago…\" Karstark says before is head droops down and shpfoooooooouuuutt his legs jerk upwards as his bowels empty.\n\n\nYou remove your bloody tentacle, admiring the sharp end on this one.  You didn't even know you could do that, must have been instinct.  Well, that was surprisingly easy.\n\n\nYou slither off and evade the camp guards once again, making your way back to the sewers.", "action_results": [null]}, null]}, null]}]}]}]}]}]}]}]}, null]}]}]}]}]}, null]}]}]}