{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=53186", "context": "", "first_story_block": "", "action_results": [{"action": "Start Story", "result": "You were no stranger to Gotham. Early in your career as the Question your journalist job occasionally took you to the city of the damned, and you were sure to go out on nightly excursions to fight crime. What can you say? Old habits.\n\n\nOnce you had a run in with the Dark Knight, though vigilantes don't operate in Gotham without doing so. Helped him take down Killer Croc, though he berated you. Called you hot-headed. Childish. Said you were only in it for the thrills. Being the young hotshot you were, you mouthed off at him, then parted ways.\n\n\nBut you digress. What brought you to Gotham wasn't your job this time, it was a woman. The Huntress. Word on the street has it that she's in a bit of a bind concerning multiple murders seemingly committed by her. All the victims were reporters calling her a madwoman, a loose cannon, criticizing her. The one time you met her you didn't get the impression that she was the type to kill people for saying bad things about her; only criminals. Then again that one time you met her she nearly put an arrow right between your eyes.\n\n\nEither way, you're going to give her some help, clear her name... And maybe tell her about the fact that you have a little crush on her. She'd probably laugh in your face, but you're going to try. Hey, maybe helping her out will get you somewhere with that.\n\n\n... And now you realize you've been mulling over what's happened and why you're here while staring at her apartment window. It wasn't hard to uncover her identity, Batman had deduced who she was a long time ago and kept it in his database. Once you broke into Nightwing's apartment and did a little digging into his computer (he should really consider changing his password to something other than his girlfriend's name), things were smooth sailing. She was Helena Bertinelli. Sole survivor of the Bertinelli family, once Gotham's top crime family before her entire family, save her, were wiped out in a series of hits. From what you can gather it influenced her to become the Huntress.\n\n\nSince then she's lived a normal life, away from her criminal roots, working as a teacher at Gotham Academy. None would suspect a mild-mannered middle school teacher in a bum apartment to be one of the deadliest vigilantes in Gotham City. It's the perfect facade.\n\n\nIt's too early for her to head out as Huntress, no doubt she's still home. You hope she doesn't mind an unexpected visitor.", "action_results": [{"action": "Continue", "result": "The fire escape proves to be a useful thing. Slowly, you open her window, slipping in and shutting it quietly. You shove your hands into your pockets as you look around, pictures of various achievements in her life decorate the walls. Her graduating high school, then college, the latest a class photo from last year... Then you notice one picture that stands out. A picture of a man and a woman with a young girl and boy.\n\n\nYou look closer at it. The girl and boy smile brightly at the camera, their brown eyes both full of life. The man and the woman smile as well, but they look... Strained. The woman's smile is forced. The man's grip on the woman's shoulder is too tight. This is a picture of Huntress with her family. Very clearly, her parents' marriage wasn't a happy one.\n\n\nBehind you comes the click of a loaded crossbow.\n\n\n\"Who the hell ar- oh you've got to be kidding me...\" You recognize her voice.\n\n\n\"Huntress. Good to see you,\" you say, turning around to face her. She's just dressed in a tank top and shorts, and her skin is damp, evidence she just got out of the shower. You gulp slightly, imperceptibly.\n\n\n\"Can't say the feeling's mutual,\" she replies, a scowl distorting her face, \"what do you want?\"\n\n\n\"Heard you were having trouble. Framed for multiple murders,\" you say, walking into her living room and plopping down on the couch. Propping one leg up on top of the other, you open up your arms as if to show yourself off, \"I'm here to help.\"\n\n\n\"As if,\" she chuckles, \"I don't need your help.\"\n\n\n\"You don't have many friends left in town. None, if I hear correctly. Except for me. Try as you might to clear your name on your own, without help it'll all fall apart. That's where I come in. With my investigative talents and your combat training, we'll be able to clear your name in no time.\"\n\n\nShe opens her mouth to protest, then sighs. \"... Whatever. Let's get to work. I've got two leads.\" As she heads into the next room, she gestures for you to follow. You do.\n\n\nThe room seems to be her bedroom. You're confused for a moment, until she presses a button hidden behind a layer of clothes in her closet, at which point a hidden room opens up. It's no Batcave or Fortress of Solitude, but it's what it needs to be: spare costume in one corner, monitoring station in another, punching bag in the third, and weapon rack in the last. To top it off, a table is set dead center, piles of notes on it.\n\n\nShe grabs two folders crammed with papers and hands them to you.\n\n\nYou read them over. All the papers inside are notebook papers, yanked out and on them sloppily written cryptic statements on her theories. One folder contains notes on the Penguin. She had put the villain away recently, no doubt he would want to frame her now that he's escaped once more. You look at her for her reasoning. \"Penguin's a maniac. Anyone puts him away, he tries paying them back tenfold.\" Good point.\n\n\nThe other folder contains notes on Gotham crime lord Santo Cassamento. This one seems a bit harder to pinpoint. You look up from the folder to her. She shrugs, \"I've made an enemy out of the mob as Huntress, and as myself Cassamento holds a grudge against me for whatever reason. If he found out I was Huntress, he'd want to frame me, have me arrested and my identity revealed to the public. I'd be mince meat.\"\n\n\nShe's smarter than you give her credit.\n\n\n\"So what lead do we follow up on?\" you ask.\n\n\n\"Your choice. Both sound likely to me.\"\n\n\nTime to choose.", "action_results": [{"action": "Follow the Penguin lead", "result": "The Iceberg Lounge. It didn't make sense how it still got business despite the fact that it's been public knowledge for years that it's owned by a well-known supervillain and many of his illegal activities run through it. Perhaps it was just best not to question these things.\n\n\nHuntress looks down at the building, kneeling next to you. \"So how do we play this, Q?\"\n\n\nNow that's a good question.", "action_results": [{"action": "\"We play it quiet.\"", "result": "\"We play it quiet,\" you reply, \"keep to the shadows. Knock out enemies if we have to, but otherwise, just avoid them at all costs.\"\n\n\nHuntress mulls this over, then nods. \"Alright. Sounds good.\" She's about to grapple across the street to the Lounge when she realizes you don't have a grappling gun. Wordlessly, she tosses you a spare. \"Keep it. I'm sure it'll look good on you,\" she laughs, before firing and being pulled to the Lounge. You pause, then follow shortly after.", "action_results": [{"action": "The Lounge", "result": "The three story arctic themed building was just as big on the inside as it was out. The club was currently closed down for 'renovations', though you knew better; Penguin had just escaped from prison, and he was more than likely getting back into the swing of things. This meant most under his payroll would be here while he heard how his operations were going. It would be packed, which meant the stealthy approach was definitely the smarter choice.\n\n\nPicking the lock on the back door, you and Huntress slip in, sticking close to the shadows. The path up to Cobblepot's office is straightforward, but there's two goons up ahead, blocking your forward path. What do you do?", "action_results": [{"action": "Use my grappling hook to reach the rafters above them, advising Huntress to do the same.", "result": "Wordlessly, you pull out your grappling hook, pointing out the rafters to Huntress. She looks at them, then nods. The two of you ascend to the rafters, continuing your way to Penguin's office and leaving the unsuspecting goons down below.\n\n\n\"Good thinking, Q,\" Huntress says once you're out of earshot of the thugs.\n\n\n\"All in a day's work,\" you reply, scratching the back of your head sheepishly.\n\n\n\"The humble type?\" She opens the door, shooting you a grin.\n\n\n\"Hurm,\" you hum, following after her.", "action_results": [{"action": "The Penguin's Office", "result": "As you slip into the large office and look around, you almost let out an impressed whistle. Say what you will about the deformed supervillain, he has some taste when it comes to decoration.\n\n\nHuntress strides forward to Penguin's desk, the villain sitting in his chair which has its back to you. \"Penguin,\" Huntress says, aiming her crossbow at the chair. \"Turn around.\"\n\n\nThe chair slowly swivels around, Penguin's beady eyes staring at the two of you as his face twists into a sneer.\n\n\n\"Hm. Huntress. And... Some faceless guy in a Dick Tracy outfit.\"\n\n\nOuch.\n\n\n\"What is it you want?\"\n\n\n\"Answers,\" you say, stepping up to the desk as well. \"Are you involved with the murders Huntress has been framed for?\"\n\n\n\"I'll have you know,\" Penguin begins, \"that I don't have the slightest idea as to what you're talking about.\"\n\n\n\"Cut the shit, Cobblepot,\" Huntress growls, aiming her crossbow right in between Penguin's eyes, \"what do you know?\"\n\n\nPenguin lets loose a chilling chuckle, \"You do realize that if I cared to do so, I could call in one of my men and he could apprehend you? Or maybe I could call the police and say how I'm being attacked by a psychotic vigilante? And on the off chance you still decide to shoot me, you should realize my PR department could turn the public against you and tear you to shreds.\"\n\n\nHuntress's grip on the crossbow falters slightly, but she keeps it aimed at him. \"Just tell me what you know, Cobblepot.\"\n\n\n\"Threats will do you no good.\"\n\n\n\"Tell the truth, Penguin. Or I'm going to step in,\" you threaten, looming over him menacingly. He looks up at you, shuddering almost imperceptibly.\n\n\n\"I am telling the truth. I don't know anything about those frames. Now would you get out of my office? I have work to do.\" Smug as he sounds, he's not bullshitting you. At least that's what your gut is telling you.\n\n\nHuntress prepares to let loose a bolt, but you stop her by placing a hand on her shoulder. You feel her tense up slightly. \"Huntress. Relax. He's telling the truth. I can tell.\"\n\n\nHer finger tightens slightly...\n\n\nThen she lowers the crossbow.\n\n\n\"Fine. We're done here.\" She approaches Penguin, bringing her crossbow down hard on his face and knocking him out. The two of you head out the window.", "action_results": [{"action": "Continue", "result": "A few blocks away from the Iceberg Lounge, you and Huntress stop for a chat. \"Hrm. For a second there, I thought you were going to kill him,\" you joke, hoping to ease the tension.\n\n\nShe looks offended, \"What, are you believing the rumors now?\"\n\n\nYou shake your head, \"Just seems like he pissed you off. You really thought he was the guy who framed you?\"\n\n\nHuntress pauses, then sighs herself. \"Yeah...\"\n\n\nYou place a comforting hand on her shoulder. \"Don't worry. We still have to check out Cassamento, I'm sure he's the one.\"\n\n\nShe looks to where your eyes should be, smiling. \"... Thanks for the help, Q.\"\n\n\n\"Don't mention it. Us outcasts have to stick together,\" you joke, eliciting a laugh from her. Playfully, she slugs your shoulder.\n\n\n\"Alright, comedian. We have to go see Cassamento.\"", "action_results": [{"action": "Continue", "result": "Santo Cassamento lived life grandly. Just outside of Gotham he owned a mansion, not too far from Wayne Manor, where he had practically an army of butlers, maids, chefs, the works. Not surprising, considering his line of work.\n\n\nAs you approach the crime lord's mansion, you can tell Huntress feels sickened by being anywhere near it. The two of you sneak past guards set up, you couldn't take them even if you wanted to, they had guns, and you didn't. Sure, Huntress had her crossbow, but in the time it took her to reload it she'd already be riddled with lead. Instead, you stick to the bushes and shadows, until you get to a second story study. There's Cassamento, lounging around reading Oedipus Rex.\n\n\nHuntress glares at him. \"Let me go in alone,\" she hisses. \"I'll handle this.\"", "action_results": [{"action": "\"Alright.\"", "result": "You nod slowly. \"Alright,\" you say, and she looks at you in surprise and... Disappointment?\n\n\n\"... Okay. I'll go.\" With those words, Huntress opens the window and steps in, closing it behind her. You can't hear her conversation with Cassamento, though you watch to ensure she doesn't do anything rash. For a while they just talk, Huntress clearly angry. Cassamento seems calm, smug. Like he's got her under his thumb.\n\n\nHuntress leaves the room scowling not long after she entered, you double check to make sure Cassamento is still alive, and sure enough he is, back to reading his book. \"What were you talking about?\"\n\n\n\"I'll tell you about it in a bit. Let's just get out of here, I feel like I'm gonna throw up.\"\n\n\nYou nod in agreement, and the two of you head back to the city.", "action_results": [{"action": "Continue", "result": "The night ends with you and Huntress returning to the latter's apartment, no where else to go. You're out of leads. This isn't good.\n\n\n\"There's something we're missing, Q,\" Huntress says, pacing back and forth through he living room as she fiddles with the string of her unloaded crossbow, \"I can just tell.\"\n\n\n\"Hrm. Maybe. We should look over the evidence again, may- hold on,\" you cut yourself off, noticing something outside through the window.\n\n\n\"What is it?\" Huntress asks, looking out the window as well.\n\n\n\"A man. He's watching the apartment,\" you reply, staring down at him. Yes, he's definitely watching the apartment. \"I'll take care of this.\" With those words, you head out of the apartment and make your way to the roof. Utilizing your grappling hook, you head to the building across the street, and into the alley where the man resides.", "action_results": [{"action": "Continue", "result": "This guy doesn't know what the hell he's doing. He's trying to make himself hard to spot, but he sticks out like a sore thumb; any passerby who saw a guy trying not be seen at the mouth of an alley wouldn't exactly think he's a law-abiding citizen. Whatever the case, he's watching Huntress's apartment, and you want to find out why.\n\n\n\"Excuse me,\" you say, approaching him. He turns around, and his face twists into bug-eyed horror when he sees you. \"You wouldn't know where I could get a trim and a shave?\" You slam his head into the brick wall, him slumping down but still conscious.\n\n\nThe poor sap is petrified. \"Y-your face! What h-happened to your f-f-face!?\"\n\n\n\"Overdosed on acne cream.\" You yank him up by his collar, glaring at him with non-existent eyes. \"Why are you watching Helena Bertinelli's apartment?\"\n\n\n\"W-who?\"\n\n\nYou drop him, then grab his left pinkie finger and yank it down.\n\n\n*CRA-CACK*\n\n\nHe screams in sheer agony. \"I ask again: why are you watching Helena Bertinelli's apartment?\"\n\n\n\"I-I was hired to watch her! I'm a private investigator!\"\n\n\n\"Hired by who?\"\n\n\n\"I dunno man, just some gu-\"\n\n\nYou grab his ring finger. His story quickly changes.\n\n\n\"I-it was a man named Panessa! Tomaso Panessa!\"\n\n\nThat name. It's familiar.\n\n\n\"Thanks for the information.\" You kick him in the face, heading back into the apartment.", "action_results": [{"action": "Continue", "result": "You return to the apartment, Huntress there waiting for you. \"So? Who was he?\"\n\n\n\"Private eye, hired to keep a watch on you. He gave me a name. Tomaso Panessa.\" At this, Huntress's eyes widen. \"You know him?\"\n\n\n\"... He's my uncle.\"\n\n\n\"Uncle? Why would your uncle want to spy on you?\"\n\n\n\"I don't know. But I'm going to find out why.\"\n\n\n\"Correction: we're going to find out why.\"\n\n\n-----\n\n\nThat's how you found yourself at a banquet two days later. Luckily, Huntress', or rather, Helena's cousin and Tomaso's son, Nino Panessa, was getting married. She didn't plan on attending, but this new development changed those plans. The wedding was being held outside the Panessa Manor by Tomaso, so it would be the perfect chance to snoop around inside while everyone was busy.\n\n\nHelena brought you along as her plus one. Although hesitant to reveal your identity to her, you agreed to come along out of costume. The two of you sit at a table off to the side, you scanning the guests behind mirrored shades. Everyone here has ties to organized crime. You feel out of place, not only because of your obvious disgust for criminals, but also because of the fact that you're the only person who isn't Italian. Your ginger characteristics have caused a few stares to be cast at your table, judging both yourself and Helena.\n\n\n\"I'll go check the house out, you stay here to avoid rousing any suspicion,\" you whisper to her, standing up.\n\n\n\"Be careful, Q,\" Helena replies, and watches you go.\n\n\nIt was easy enough to slip into the mansion through the kitchen entrance, left open for the servers to come in and out. You'll have to be quiet, you can't just rush in, not for this. You slip into the manor proper.\n\n\nIt's bigger than anything you've ever seen, beating out even Mayor Fermin's mansion back in Hub City (well, before it got burnt down, that is). There must be a million rooms in the place. But you know that the place you're looking for: Tomaso's study on the third floor where he keeps his computer, and by extension all of his information regarding his activities. The only problem is Huntress didn't tell you where it was beyond the third floor. It'll be a guessing game from there.\n\n\nYou reach the third floor using the servants' stairwell without any interruptions. There's no one here, at least there shouldn't be. Now you just have to find out which door the study is behind. Thankfully, there are only three.", "action_results": [{"action": "Check the first door, to your left.", "result": "When you enter you find a bedroom, king-sized bed with velvet sheets in the center. There's a large painting on the wall of a man and a woman: Tomaso and his wife. This room should be theirs. Either way, it's not the study. Nothing for you here.", "action_results": [{"action": "Go back to the hallway.", "result": "As you leave the room, you see a man in a black suit and tie wearing shades. You see a gun at his side. A guard.\n\n\nHe spots you and pulls out his gun, shouts at you to stay where you are. You don't listen. You run forward, zigzagging around so he can't get a clear shot. He doesn't try, instead dropping the gun and pulling out a knife when you get close.", "action_results": [{"action": "Punch at his throat.", "result": "You try to punch at his throat, but he's faster than you, dodging and slashing your arm. Hissing, you clutch at your wound, and he takes the pause to plunge his knife right into your chest. It all goes black as he twists the blade.\n\n\nYou're Dead!", "action_results": [null, {"action": "Reset Game", "result": "", "action_results": [null]}]}, {"action": "Sweep his legs out from under him.", "result": "You duck when you get close to him, sweeping his legs out from under him. He drops the knife and it goes skidding down the hall, but before you can knock him out he jumps back up and leaps away from you, taking a fighting stance. Likewise, you get up and take a fighting stance.\n\n\nHe throws a punch.", "action_results": [{"action": "Duck forward, throw an uppercut.", "result": "You duck out of the way of the punch, sending your fist right into his chin, knocking him off his feet. You send a palm right into his nose, breaking it and sending him into unconsciousness.\n\n\nShaking your head, you enter the closest door, the one on the right.", "action_results": [{"action": "Continue", "result": "You enter the room. It's the study. Tomaso's laptop is there on a desk right in the middle, not even shut. Silly man.\n\n\nYou take a seat and dive into his database. There are reports for each month for the last eight years, presumably since he got the laptop. There's also a folder labeled 'Huntress'. You open it up, and read the latest document...\n\n\nYour eyes widen at what you find.\n\n\nThe bastard figured out that Huntress and Helena were one and the same, and hired a PI to spy on her to see if she heads out as Huntress so he could know a good opportunity to frame her once more. He's behind it all.\n\n\nShaking your head, you close the windows and head out of the room.", "action_results": [{"action": "Continue", "result": "You head back to your table and tell Helena that you'll fill her in when the two of you leave. Nino and his bride say their vows, then kiss at the altar. The dances start.\n\n\nYou consider asking Helena to dance.", "action_results": [{"action": "Down the rest of your wine- it's liquid courage -and ask.", "result": "\"Do you want to dance?\" you ask after a moment, and she looks at you in surprise. You cringe inwardly as soon as you ask the question, sure she's going to say no.\n\n\nShe smiles at you. \"Of course. Hope you can keep up.\" Stunned, you follow her.\n\n\n\"Just warning you, I'm not too sure how to dance,\" you say calmly. Inside though, you're terrified, your head running through all the worst case scenarios. Helena merely laughs.\n\n\n\"Here, I'll show you,\" she grabs your hands, places one in hers and raises it up to your shoulders then places the other on the small of her back. Her other hand goes to your back. \"Now we just kind of sway around and spin slowly,\" she demonstrates, you following her lead.\n\n\nIt's the best time you've had in years.\n\n\nAfter you're done, the two of you leave the wedding with the crowd.", "action_results": [{"action": "Back At The Apartment", "result": "The two of you arrive back at the apartment. The sun sets, casting Gotham in an ominous orange glow; promising that this night, like every other night, will not be a pleasant one. You sit Helena down to explain what you found. When you're finished, she looks shocked.\n\n\n\"How could Tomaso find out that I'm Huntress? It's impossible.\"\n\n\n\"At a guess,\" you begin, \"you had a run-in with him and he managed to recognize you through your voice, your eyes, or something similar. Have you had a run-in with him?\"\n\n\n\"... I did, a year ago. Fuck, I can't believe it... And he's behind the murders too?\"\n\n\nYou just nod.\n\n\n\"But why?\"\n\n\n\"That, I don't know. We'll have to interrogate him.\"\n\n\nHelena just shakes her head, \"I dunno, Q, I-\"\n\n\n\"Vic,\" you say.\n\n\n\"Huh?\" she asks, looking confused.\n\n\n\"My name is Vic.\"\n\n\n\"... Okay, but I dunno, Vic. I... Just want to process this. Mind if I stay in tonight?\"\n\n\nYou nod your head, \"Sure thing...\"", "action_results": [{"action": "\"... I'll just patrol around town.\"", "result": "The night is cold, and you tighten your coat around yourself. Looks like even Hell freezes over in the wintertime. Behind you, you hear the swish of a cape. You turn around.\n\n\nThe Dark Knight himself stands before you. \"Question,\" he begins, \"what are you doing in Gotham?\"\n\n\n\"Batman,\" you begin, sarcasm dripping in your tone, \"Yes, I'm doing fine, how are you?\"\n\n\n\"What are you doing in Gotham?\" Batman repeats, glaring at you.\n\n\n\"Helping out Huntress,\" you reply, sticking your hands in your pockets, \"since you won't.\"\n\n\n\"She's a maniac, Question,\" Batman states as though it were fact, \"she can't be trusted.\"\n\n\n\"She can. I know she can. She's not the type to just kill civilians for badmouthing her, contrary to your beliefs.\"\n\n\n\"Look past your attraction to her. You'll see that she's not what you think she is.\"\n\n\n\"I am looking past it. You're just not looking past what she did when Gotham was a hot zone all those years ago. Desperate times call for desperate measures, Batman. She did what she had to.\"\n\n\n\"Just like you did, when you killed that man during your time in South America?\"\n\n\n\"... No. That was just a matter of wanting to kill.\"\n\n\n\"You see yourself in her, don't you?\"\n\n\nYou stay quiet.\n\n\n\"She can't be saved, Sage. Just leave all this behind.\"\n\n\nYou try to formulate a response, and by the time you do, he's already gone.\n\n\nYou head back to Helena's apartment and call it a night.", "action_results": [{"action": "The Next Night", "result": "You and Huntress stand on a building, her a good few feet away from you looking down at the laundromat across the street. Tomaso Panessa used the laundromat as a front for his hijacking operations, and was holding a meeting with his top guys in that department for his monthly reports.\n\n\n\"Ready to kick some ass, Q?\" she asks, grinning at you.\n\n\n\"Ready as I'll ever be,\" you reply. The two of you grapple over to the building, entering through the back door to avoid rousing any suspicion.\n\n\nThere's a guy in the hallway leading to the meeting room, presumably to guard it. You use your grappling hook to take his shotgun away while Huntress runs up to him and delivers a cross punch right to the jaw. He's out for the count after that.\n\n\nThe two of you open the door.", "action_results": [{"action": "Continue", "result": "When you enter the room you smell death; the stench of rotting corpses having already gone through rigor mortis. You look and see Tomaso Panessa and his men dead. Huntress clicks her tongue in disgust at the sight. Sticking out of Panessa's chest is a crossbow bolt, identical to the ones she uses.\n\n\n\"... It wasn't him, was it?\" she asks.\n\n\n\"... No. It can't be. He wouldn't kill himself just to spite you.\"\n\n\n\"So what do we do now, Q?\"\n\n\n\"... We find out who did it. C'mon.\" With your words, the two of you head off into the night.", "action_results": [{"action": "Continue", "result": "You dispatch a hitman with the swing of a baseball bat to his head, the wooden piece of sports equipment breaking in half off of his thick skull.\n\n\nHuntress tosses you a piece of pipe to replace your bat, and you catch it, voicing your thanks before you face off with another hitman. He's a big, burly guy; he's so large it seems like this piece of pipe will barely do anything to him.\n\n\nThe behemoth grins down at you, cracking his knuckles.", "action_results": [{"action": "Crotch shot!", "result": "You swing forward, the pipe going in an upward arc before ending in between his legs. Grinning slightly when you see pain make itself known on his face, it takes all of your willpower to keep yourself from laughing when he falls to his knees and fondles his manhood. \"Batter,\" you swing the pipe into his face, \"up!\"\n\n\nHe goes down, but it takes a few more hits before he's unconscious. Even then, you throw in another hit or two, just in case.\n\n\nAnother hitman tries to ambush you from the back!", "action_results": [{"action": "Twist around quickly and throw your pipe at him!", "result": "You twist around quickly and throw your pipe, but he dodges! You barely have time to think that his reflexes are inhuman before he slices your throat wide open with a katana, blood spurting from your neck as you fall to the ground. The life leaves your body, and the last thing you hear before it goes black is Huntress screaming your name.\n\n\nYou're Dead!", "action_results": [null, null]}, {"action": "Wait until he's up close, then hit him with your pipe!", "result": "As soon as you hear his footsteps right on top of you, you twist around, swinging your pipe right into his arm as he attempts to pull a katana out from a sheath at his side. You hear a nasty crack as the arm breaks, before swinging the pipe into his side. He falls to the ground, and you give his head a quick stomp to make sure that he stays that way.\n\n\nHuntress finishes up with her batch. You toss the pipe and head out, getting the hell out of this warehouse before more goons show up.", "action_results": [{"action": "Continue", "result": "It's been a week. A week of fighting every night.\n\n\nNino Panessa rose to the role of Don of the Panessa family following his father's death. His first order of business: releasing a bounty of 500,000 dollars to the person who brings him Huntress's head. Since then, you've had to fight off innumerous hitmen during your nightly escapades to uncover the person framing Huntress. Just now was one of those times.\n\n\nThe two of you make your way back to her apartment.\n\n\n\"What was that, third time tonight?\" Huntress asks as she removes her mask.\n\n\n\"Just about,\" you reply, releasing the adhesive gas and removing your mask. \"Those guys though, they were better than the schnooks they've been sending after you in the last week. They're upping their game.\"\n\n\n\"Doesn't mean we can't take them.\" She begins to head into the bathroom. \"I'm gonna take a shower, see you in a bit, Q.\"\n\n\nYou nod in reply, taking a seat on the couch.", "action_results": [{"action": "Continue", "result": "As she showers, you think about how things have been going between the two of you.\n\n\nIt's all going alright. The two of you are friends, and while you wish it could be more than that, you're happy for what you have. Hopefully when this is all over you'll be close enough to confess your feelings and for her to accept.\n\n\nHuntress steps out of the bathroom a few minutes after you finish up your bit of self reflection. She grins when she sees you. \"C'mon, Vic. Let's get to work.\" Nodding, you stand up and follow after her.", "action_results": [{"action": "Continue", "result": "The two of you enter her secret room through her bedroom, like you have so many times over the course of the week. With Tomaso Panessa dead, you're not sure exactly who is behind the murders, or if it's even connected to the mob at all. Yourself and Huntress have been tracking leads, however, and with the information you uncovered tonight it's time to make your move.\n\n\n\"Alright Vic,\" she says, leaning against the wall, \"We found out that Cassamento is taking over some of Panessa's operations now that Tomaso's dead. This can't be a coincidence,\" she approaches the table.\n\n\n\"Right. It all leads back to Cassamento. We have to find out what he knows. He might've been the guy behind it after all, leading us on a cat and mouse chase,\" you reply.\n\n\n\"Exactly. So how do you want to do this?\"", "action_results": [{"action": "\"We raid his mansion.\"", "result": "The next night finds you raiding Cassamento's manor.\n\n\nHuntress will take one path through the front; you'll take the back, through the hedge maze and into the manor proper. The two of you will meet up at Cassamento's study after you've taken out all the guards in your path.\n\n\nGuards patrol the hedge maze, presumably so they can make sure no one is trying to sneak through it, like you currently are. You've got to take out every one of the rat bastards. Better get started, eh?\n\n\nHow do you want to play this?", "action_results": [{"action": "Use the firecrackers I brought along; lure them to me, then take them out.", "result": "Pulling out the bundle of firecrackers and your zippo, you light the fuse, tossing them just ahead of you and shrinking into the hedges to hide. The firecrackers go off; you hear curses, exclamations of surprise, all throughout the maze. Then marching footsteps. Showtime.\n\n\nWhen they all converge on your position, you leap out, slamming your fist into one's face and breaking his nose. He falls to the ground, and as he does so you grab his assault rifle, swinging it around into another's head and knocking him into the hedges. You pull out your grappling gun and aim at another, firing; your impromptu harpoon gun doesn't kill him, but it pierces his body armor, and you pull him forward and slam the butt of the rifle into his face.\n\n\nThere's more coming. You crack your neck, sighing. This is gonna be loud and nasty.", "action_results": [{"action": "Continue", "result": "8 minutes later...\n\n\nYou finish breaking the poor son of a bitch's arm, ramming an elbow into his face and sending him into blissful unconsciousness. That's gonna hurt when he wakes up in the morning. Covered in the blood of your opponents, you continue on to the manor, confident all the bastards on your side are taken care of.\n\n\nThe manor is just like how you remember it: large, foreboding. As you approach, you can tell this is the end of your quest. Cassamento is behind it all. Call it intuition.\n\n\nYou slip in through the backdoor.", "action_results": [{"action": "Continue", "result": "The backdoor of the mansion leads into the dining room. Hands in your trench coat pockets, you continue to walk, keeping an eye out for any danger. And it is danger you find, in the form of a guard patrolling the hallway leading to the stairwell. He only has a baton on him, no pistol from what you see. Just down and dirty brawling with him, it seems.\n\n\nAlternatively, you can avoid him entirely.", "action_results": [{"action": "Take him out.", "result": "Your loafers clack upon the floor as you run up to him, and he turns around to meet a punch to the face. He stumbles, pulling out his baton and swinging it at you.", "action_results": [{"action": "Leap out of the way.", "result": "You jump back, avoiding the baton narrowly and delivering a kick to his left leg. It breaks, and he falls to the ground, clutching at it and screaming at the top of his lungs. Feeling pity for him (though mostly to avoid his screaming alerting any nearby guards), you grab his baton and knock him out.\n\n\nYou drop the baton and continue onward.", "action_results": [{"action": "Upstairs", "result": "You head upstairs, eventually reaching Cassamento's study. But he isn't there. But what you do find is an atom bomb.\n\n\nCassamento. You old son of a bitch.\n\n\nIt's a laptop, almost identical to Tomaso Panessa's. Except this one has a password on it. You begin to hack in, eventually discovering that the password is Nino.\n\n\nThe laptop you found wasn't Tomaso's. It was a fake.\n\n\nIn this you find the exact same documents, nix the one detailing Tomaso's hiring of the PI to spy on Huntress. It all falls into place. Cassamento hired the PI, gave him Tomaso's name so you'd go after him. Replaced the laptop in the study with a double. This was all part of a master plan of his to topple Huntress. But why? Why go through all the trouble just for her?\n\n\nYou dig deeper.\n\n\nDeep within the files of the computer, you found a photograph of a man and a woman, no doubt about to engage in, er, 'physical activities'. It was probably a photo taken by the FBI during investigations into Cassamento that he managed to get a hold of. You recognize the man as Cassamento, though much, much younger. The woman you also recognize, but you don't remember from where...\n\n\nThen it hits you. The photograph in Huntress's apartment. The woman. Her mother.\n\n\nCassamento was seeing Huntress's mother.\n\n\n.... And you thought the last bit of information was a bombshell.\n\n\nThen you hear a scream from the lower levels of the mansion, it's faint but it still sends a chill up your spine. Dear God, he has her. Huntress. Helena. Your Helena.\n\n\nYou take off in a sprint to the basement.", "action_results": [{"action": "Continue", "result": "The lower level of Cassamento's mansion reeks of blood and the strong smell of industrial grade acid. This is where people are taken to to die. Hopefully Helena is alright. You can only pray at this moment.\n\n\nThere are too many guards and too little nooks to hide in to do this quietly. All you can do is head in fast and loud.\n\n\nThere is your first guard right there.", "action_results": [{"action": "Snap his neck; now isn't the time to take chances.", "result": "His back is too you, and you creep him up to him slowly, like a leopard ambushing its prey. Quickly you rise up to him and break his neck, a quiet snap not leaving the vicinity. He drops to the floor. You take his gun.\n\n\nFrom there it's cold, bloody slaughter. You've got to kill every motherfucker you come across. You are death incarnate, and you've come to claim their souls. Oh, sure, you keep a few alive; but only for a few moments, and in the first three cases it's because they wouldn't tell you where Cassamento is. The fourth one, though, he knows. He tells you. And then you leave his corpse slumped against a wall.", "action_results": [{"action": "Continue", "result": "You kick in the door, seeing Cassamento standing over a console and Helena dangling over an acid pool from a rope. For a moment you think of secret agents movies and the ridiculous traps the villains use to dispatch the hero, but this thinking is cut off as you dodge bullets. There's only one guard here.\n\n\nYou aim your rifle and fire, the contents of his head splattering across the concrete ground. Cassamento backs away slowly from you as you approach, eyes wide with fear. You relish in it. He's right to be afraid of you.\n\n\nYou fire once, twice, three times into his chest, and he falls over, dead as a doornail. Operating the crane, you move Helena out of the way of the pit and lower her to the platform with the console. She's passed out, no doubt from fear. You pick her up and carry her out of the mansion.", "action_results": [{"action": "The End", "result": "A Week Later...\n\n\nYou find yourself on the express train out of Gotham, eyes cold and mouth quirked into an unnerving smile. She rejected you. Said that you were changed. You weren't her Q anymore. That night when you brought her back to her apartment, having gathered the evidence to put Cassamento away, she looked you in the eyes and said that what she saw was different. And she didn't like it.\n\n\nWhatever. The dumb bitch just didn't know what she's missing out on. You're so much better now, free from your ridiculous attraction to her. What a hypocrite, rejecting you for being a killer when she's no better.\n\n\nThat's why you just so happened to forget to send the evidence into the police; and instead sent the information about her identity to all the major crime families in Gotham. It didn't take too long for the news to get out about a local school teacher brutally shot and killed in her home. Helena Bertinelli. Your Helena. If you can't have her, no one else deserves to have her.\n\n\nYour mind has snapped. You'll never recover.\n\n\nBAD END", "action_results": []}]}]}, {"action": "Knock him out; I don't kill anymore, even in these circumstances.", "result": "No. Never again, you told yourself. Not after South America.\n\n\nHis back is to you, which makes it easy to creep up on him. You rise up behind him and apply a chokehold. He struggles for a moment, but before long he's out. You drop his unconscious body and continue on.\n\n\nFrom there it's down and dirty brawling. Choking them out when they've got their back to you. Taking away guns and beating them something fierce when they don't. You interrogate a few, trying to get Cassamento's location; the first three don't talk, but the last one squeals. Not long after you find your way to the room.\n\n\nIt's all or nothing, now.", "action_results": [{"action": "Continue", "result": "When you enter the room quietly, closing the door behind you with a soft click, the first thing you see is Cassamento standing on a platform with a console. He looks at Helena, who dangles over a pool of acid by a rope. There's a guard not too far away, but he's not going to be trouble; a chokehold puts him out for the count.\n\n\n\"Cassamento,\" you say, heading up the stairs to the platform, \"It's over. Let her go.\"\n\n\n\"Hmph. I thought you'd be dead by now, you faceless freak,\" Cassamento spits, \"But no matter. Now you get a front row seat to Huntress' death.\" He flips a switch on the button, and the rope snaps. Huntress begins to fall.", "action_results": [{"action": "Try to wrangle her in with your grappling hook.", "result": "The hook wraps around her. But you don't manage more than that as she falls into the pool of acid. The bright green liquid turns red with blood.\n\n\nCassamento laughs.\n\n\nSoon you have him on the floor choking on his own teeth.\n\n\nBy the time you're done with him his head looks more like a squashed cantaloupe than anything that's alive.", "action_results": [{"action": "The End", "result": "A Month Later...\n\n\nYou find yourself perched upon a rooftop in Hub City, dead eyes staring blankly at the streets below and hands clenching and unclenching every so often.\n\n\nShe's dead. You can't believe it. It seems as though the world has lost color.\n\n\nYou've barely eaten in the last month. Food has lost taste. Your weight loss has been dramatic.\n\n\nShe's dead.\n\n\nCassamento paid for what he did. But you can't take any consolation in that.\n\n\nShe's dead.\n\n\nIn the distance a scream pierces the quiet of the night. You find a man holding a woman at gunpoint, forcing her to remove her clothing.\n\n\nHe's dead.\n\n\nYou continue your endless pursuit for justice, kept going by the thought of her.\n\n\nBAD END", "action_results": []}]}, {"action": "Use your grappling hook to swing to the other side of the room, grabbing her before she hits the acid.", "result": "Thinking fast, you pull out your grappling hook and fire, the hook fitting snugly onto a rafter. You don't give yourself time to see if it's holding on tight, however, and instead swing into the path of the falling Huntress. You grab her and pull her back to the platform, to safety.\n\n\nHelena grunts slightly as she gets up. \"Q. Thanks for the help.\" She looks at Cassamento. He backs away slowly.\n\n\nWordlessly, she pulls out her crossbow and aims at him.", "action_results": [{"action": "Stop her. She doesn't need to go down this path.", "result": "\"Huntress,\" you say, \"Don't.\"\n\n\n\"Why, Q? Give me one good reason why I shouldn't kill him right here, right now?\" Huntress spits, crossbow still leveled at Cassamento's head.\n\n\n\"Killing one's enemies only lead to self destruction. Look at the path you were on. The reason no one trusted you was because of the fact that you killed. Eventually, you'll wind up alone, or dead. Is that really what you want?\"\n\n\nShe squeezes the trigger slightly...\n\n\nAnd lowers the crossbow. \"No... That's not what I want at all.\"\n\n\nYou sigh in relief. She takes a pair of handcuffs out of her utility belt, cuffing Cassamento to the railing. \"Let me gather up evidence, then we can head back to your apartment.\"\n\n\nThe two of you begin to walk away...", "action_results": [{"action": "Continue", "result": "... But Huntress stops, and turns to the bound Cassamento. Her brown eyes meet his not dissimilar ones, staring into them. \"... Why?\" she begins, \"Why did you do all this? What was there for you to gain?\"\n\n\n\"Besides the obvious?\" Cassamento replies, chuckling bitterly. \"I would've gained satisfaction.\"\n\n\n\"I doubt you hate me that much just for interfering with your business.\"\n\n\n\"You've no idea how much I utterly despise you,\" he glares at her. It's enough to make even you shudder.\n\n\n\"Just tell me why,\" she says, aiming her crossbow at his head, \"or I will kill you.\"\n\n\n\"Put that weapon down, Helena Rosa,\" Cassamento begins, \"before you accidentally kill your father.\"\n\n\nThat gives the photo you found context.\n\n\n\"... Liar. You're not my father.\"\n\n\n\"Oh, but I am.\" He reaches his uncuffed hand into his back pocket, pulling out his wallet. After a moment of struggling he pulls out a photo, of himself and Huntress's mother. The two are obviously about to engage in sexual activity, Cassamento's hands fondling her breasts and her head craned to lay kisses along his neck. Huntress's eyes widen at the photograph. \"Take a look at this, Helena.\"\n\n\n\"... W-wh... What's happening in that photo?\"\n\n\n\"What do you think? We were about to conceive you.\"\n\n\nHuntress takes a moment to compose herself, then lets out a breath. \"Even... Even if you are my father, that doesn't explain why you want me dead.\"\n\n\n\"Because I hate you. I hate that you're alive while she is dead.\"\n\n\n\"There was nothing you could do,\" Huntress interjects, \"the man shot her, not m-\"\n\n\n\"Nonetheless, if it weren't for you, she'd be alive. If it weren't for you, that damn hitman wouldn't have misinterpreted my instructions...\"\n\n\n\"What?\"\n\n\n\"I hired the hit on your family. I told the man to spare the sister. I meant Tomaso's sister, your mother. He must have thought I meant you.\" He shakes his head, then stares at Huntress. \"I had to avenge her.\"\n\n\nBefore you can react she's aiming the crossbow at Cassamento again, and it's only at your touch that she falters before dropping it. Instead, she opts to kick him in the face, knocking him out.\n\n\n\"Let's get the hell out of here,\" Huntress says. You nod, leaving the manor.", "action_results": [{"action": "Continue", "result": "You leave the manor with Huntress, dropping off a flash drive full of evidence from Cassamento's files from his own computer (nix the information on Huntress' identity). Soon enough, her name is cleared for those crimes.\n\n\nThe next day, you tell Huntress, or rather Helena, that you're going to be heading back to Hub City before the week's out. She nods after a moment, then asks you: \"Why did you do all this? Why'd you risk your neck to help me out?\"\n\n\nThis is the moment of truth...\n\n\n\"Because I... Like you.\" You turn away, sure that you're going to face rejection.\n\n\nHer eyes widen in surprise.\n\n\n\"Q... I'm... I'm sorry, but I don't feel that way about you.\" This is what you were expecting. Rejection. \"Can we just be friends?\"\n\n\n\"Of course,\" you reply, smiling. \"I'd like nothing better.\"", "action_results": [{"action": "The End", "result": "A Week Later...\n\n\nAs the train makes its way to Hub City, you smile, content with your time spent in Gotham. Sure, you didn't get Huntress to dramatically declare her love for you, but really it all worked out in the end. And, now that you think about it, both of you are better off this way. Friends. Friends works.\n\n\nYou take a look out the window, and see the Hub City skyline drawing closer. All you can think is how this was a hell of an adventure, and there are sure to be more on the way.\n\n\nThere ain't no rest for the wicked, after all.\n\n\nTHE END", "action_results": []}]}]}]}, {"action": "Don't. He's got what's coming to him.", "result": "You don't even lift a finger. Not a minute later and the two of you leave, a crossbow bolt between Cassamento's eyes.\n\n\nYou say nothing as you head back to her apartment.", "action_results": [{"action": "The End", "result": "A Week Later...\n\n\nYou find yourself taking the train from Gotham back to Hub City, sighing in sadness. You couldn't save her from herself, either in spite of or because of the fact you tried. No longer do you feel attracted to her, now you just pity her. But she's dug her own grave.\n\n\nStill, you helped her out a bit with the evidence. Made sure to submit it all to the GCPD, without any information regarding Huntress' identity of course. That's the only help you'll offer her anymore. It's a damn shame.\n\n\nThe Hub City skyline approaches. You're home.\n\n\nTHE END", "action_results": []}]}]}]}]}]}]}]}, {"action": "Disarm him.", "result": "You get a good hold on his baton, though you fail to yank it out of his grasp; instead, he punches you right in the face, you falling back from the force of it. He beats on you with his baton, until you're out cold. The last thing you hear before consciousness fades is him talking on a walkie talkie, about how he got 'another one'.\n\n\nYou wake up hovering over a pool of acid.\n\n\nThis is just stereotypical. Breaking stereotypes, however, Cassamento doesn't reveal his master plan or anything and give you a chance to escape while he goes off on a filibuster. No, he just wishes you a good death, before he lowers you and a still unconscious Huntress into the pool.\n\n\nYour last thoughts are of her and how you wish things had went differently than this.\n\n\nYou're Dead!", "action_results": [null, null]}]}, {"action": "Wait until he passes by, then head up the stairs.", "result": "You wait patiently for the guard to pass by. He continues his patrol, leaving the hallway, and you slip up the stairs to find Cassamento.", "action_results": [null]}]}]}]}, {"action": "Be quiet about it; sneak through the hedge maze and knock them out, one by one.", "result": "You've got to play this quiet. Leading them all to you would just be suicide. Sticking to the shadows, you begin to dispatch the guards. Here's your first one.\n\n\nYou leap out of the hedges and tackle him, covering his mouth. \"Let me ask you a question,\" you hiss, \"Do you know how easy it is to break bones when you're used to doing it? Here, let me show you.\" With those words you grab a finger and yank. It snaps like a toothpick. His screams are muffled by your hands.\n\n\n\"Good night,\" you deliver a hard punch to his face, blood spewing out of his broken nose as his eyes roll back into his head. You continue on. This is gonna take a while to get them all one by one.", "action_results": [{"action": "Continue", "result": "12 minutes later...\n\n\nYou finish up knocking out the last one before he can scream. He continues to squirm even as you beat his nose in, but before long he's out, just like everyone else. You stand up and head to the mansion, confident all the bastards on your side are taken care of.\n\n\nThe manor is just like how you remember it: large, foreboding. As you approach, you can tell this is the end of your quest. Cassamento is behind it all. Call it intuition.\n\n\nYou slip in through the backdoor.", "action_results": [null]}]}]}, {"action": "\"We sneak in to talk to him like last time.\"", "result": "The next night finds you raiding Cassamento's manor.\n\n\nHuntress will take one path through the front; you'll take the back, through the hedge maze and into the manor proper. The two of you will meet up at Cassamento's study after you've snuck past all the guards in your path.\n\n\nGuards patrol the hedge maze, presumably so they can make sure no one is trying to sneak through it, like you currently are. You've got to be quiet, alerting them will just mean bad things.", "action_results": [{"action": "Dart quickly away from guards when you see them, tread quietly otherwise.", "result": "This works well for a bit; that is, until you actually come across a guard. You accidentally step on a twig when darting away from one, he hears you and quickly turns around, finding you frozen like a deer in headlights. A quick burst from his rifle sends you into unending blackness.\n\n\nYou're Dead!", "action_results": [null, null]}, {"action": "Be slow and careful. Mindful of your surroundings.", "result": "You tread through the hedge maze quietly, avoiding guards by hiding behind the hedges when you see them and being slow and careful otherwise. Before long, you find yourself in front of the mansion's backdoor, unscathed and with the guards none the wiser of your presence.", "action_results": [null]}]}]}]}]}]}]}, {"action": "Hit him under the jaw with the pipe!", "result": "You swing the pipe in an upward arc, it ending in right under his jaw. Though his head snaps back, he looks back down, shaking it slightly before his grin intensifies. He grabs you by the neck with a hand that's damn near the size of your head.\n\n\nHe begins to squeeze, you dropping the pipe as you begin to clutch at your neck, trying to free yourself from his grasp for air, air, sweet sweet air-\n\n\nHuntress hits him with a bolt to the shoulder from behind, and he shouts in pain, letting go of you. Catching your breath quickly, you jump up and slap your hands on both of his ears as hard as you can. He clutches at the sides of his head in agony, before you sweep his legs out from under him and knock him out with a few quick hits using the pipe.\n\n\nAnother hitman tries to ambush you from the back!", "action_results": [null, null]}]}]}]}]}, {"action": "\"... Mind if I crash on the couch again?\"", "result": "She nods, \"Not a problem. Good night.\" She heads into her room, and you spread out on the couch. You're out like a light in a few minutes.", "action_results": [null]}]}]}, {"action": "Don't ask.", "result": "The two of you just sit at your table and watch the people dancing. Helena looks a bit disappointed as she watches, but you're not too sure why. Eventually, it all wraps up, and the two of you leave the wedding.", "action_results": [null]}]}]}]}, {"action": "Try to catch his fist and break his arm.", "result": "You try to catch his arm, but it was a feint; he strikes out at you with the other arm, knocking you off your feet. He picks his gun up off the floor, aims at your head, and fires.", "action_results": [null, null]}]}]}]}, null, {"action": "Check the third door, at the end of the hall.", "result": "You enter the door at the end of the hall, and find yourself in a bathroom. It's huge, for whatever reason, with a large bathtub, a walk in shower, a toilet fit for a king and- is that a Jacuzzi? Damn, you almost want to hop into it... Shaking your head, you leave before temptation gets the best of you.", "action_results": [null]}]}]}]}]}, {"action": "\"No.\"", "result": "You shake your head. \"No. I'll come with you,\" you say, and she looks surprised and... Pleased?\n\n\n\"Alright. Come on.\" She opens the window and slides into the mansion, you following not long after.\n\n\nCassamento looks up as he sees the two of you enter.\n\n\nHe gives a smoldering smile when he sees Huntress. \"Huntress,\" he says, before frowning upon seeing you. \"... And a faceless Humphrey Bogart impersonator.\"\n\n\nOuch.\n\n\n\"What are you doing here?\"\n\n\n\"You know damn well why I'm here, Cassamento,\" Huntress spits, cold glare penetrating the older man as she takes aim. \"The murders. You're framing me.\"\n\n\nCassamento quirked an eyebrow, \"I promise you, I know nothing about that.\"\n\n\n\"I wouldn't bullshit her, Cassamento,\" you comment, \"that crossbow has a hair-trigger.\"\n\n\n\"Hm. I would believe so, what with all those people she's killed.\" Cassamento smirked, looking like the cat who caught the canary.\n\n\n\"It was you. I can tell,\" snarled Huntress.\n\n\n\"Ha. Don't be so foolish. Say what you will about my activities, I'm a man of my word, and I speak the truth when I say I have nothing to do with the murders.\"\n\n\nHuntress looks shocked, but after a moment just sighs. You've done some reading into Cassamento himself, and he's right; he's not one to lie about his intentions. And looking at him now, smug as he is, you can tell that he's telling the truth. That or the man is a master manipulator and this is an elaborate scheme.\n\n\n\"... I'll be back.\" Huntress says coldly, before heading out the window. You cast one last look at Cassamento, who simply sits back down and continues reading as if nothing happened.\n\n\nYou leave through the window, heading back to the city with Huntress.", "action_results": [null]}]}]}]}]}, {"action": "We can take them out, they're just goons.", "result": "Huntress looks surprised when you charge forward, tackling a goon to the ground and beginning to beat him to a bloody pulp. The other goon is shocked as well, backing away in a start, and Huntress uses the opportunity to take him out by swinging right into his head. However, when she does so, the thug lets out a loud scream of pain. Soon, you hear footsteps converging on your position.\n\n\n\"Oh, great going, Q!\" Huntress shouts, readying her fists and goons surround you.\n\n\n\"It was your fault, you took him out!\" you reply, sending a cross punch into a thug's face.\n\n\n\"Because you had to charge in like Galahad!\" she retorts, kicking a goon in the nads.\n\n\nYour conversation is cut off as you both jump right into the fray.", "action_results": [{"action": "The Penguin's Office", "result": "As you slip into the large office and look around, you almost let out an impressed whistle. Say what you will about the deformed supervillain, he has some taste when it comes to decoration.\n\n\nHuntress strides forward to Penguin's desk, the villain sitting in his chair which has its back to you. \"Penguin,\" Huntress says, aiming her crossbow at the chair. \"Turn around.\"\n\n\nThe chair slowly swivels around, Penguin's beady eyes staring at the two of you as his face twists into a sneer.\n\n\n\"Hm. Huntress. And... Some faceless guy in a Dick Tracy outfit.\"\n\n\nOuch.\n\n\n\"What is it you want?\"\n\n\n\"Answers,\" you say, stepping up to the desk as well. \"Are you involved with the murders Huntress has been framed for?\"\n\n\n\"I'll have you know,\" Penguin begins, \"that I don't have the slightest idea as to what you're talking about.\"\n\n\n\"Cut the shit, Cobblepot,\" Huntress growls, aiming her crossbow right in between Penguin's eyes, \"what do you know?\"\n\n\nPenguin lets loose a chilling chuckle, \"You do realize that if I cared to do so, I could call in one of my men and he could apprehend you? Or maybe I could call the police and say how I'm being attacked by a psychotic vigilante? And on the off chance you still decide to shoot me, you should realize my PR department could turn the public against you and tear you to shreds.\"\n\n\nHuntress's grip on the crossbow falters slightly, but she keeps it aimed at him. \"Just tell me what you know, Cobblepot.\"\n\n\n\"Threats will do you no good.\"\n\n\n\"Tell the truth, Penguin. Or I'm going to step in,\" you threaten, looming over him menacingly. He looks up at you, shuddering almost imperceptibly.\n\n\n\"I am telling the truth. I don't know anything about those frames. Now would you get out of my office? I have work to do.\"\n\n\nHuntress prepares to let loose a bolt, but you stop her by placing a hand on her shoulder. You feel her tense up slightly. \"Huntress. Relax. He's telling the truth. I can tell.\"\n\n\nHer finger tightens slightly...\n\n\nShe lets the bolt fly, right into Penguin's shoulder. He lets out a hiss of pain, glaring at Huntress. \"You... Bitch. Looks like I'll have to sic my lawyers on you after all.\"\n\n\n\"Have fun, lardass.\" She spits at him, then heads out through the window. You follow not far behind, a worried expression on your face.", "action_results": [{"action": "Continue", "result": "A few blocks away from the Iceberg Lounge, you and Huntress stop for a chat. \"What the hell were you thinking?\" you hiss.\n\n\n\"Just double checking,\" she mutters bitterly, \"I had to make sure he wasn't holding out on us. He would have squealed if he knew anything.\"\n\n\n\"That's why everyone thinks you committed those murders,\" you snap, \"because you're insane!\"\n\n\n\"Pot and kettle, Q.\" Huntress replies, glaring at you.\n\n\nWith a sigh, you just shake your head. \"... Look, we still have to see Cassamento. Let's go.\"\n\n\nThe raven-haired woman just shakes her head, grappling away. You follow her to Cassamento's.", "action_results": [null]}]}]}]}]}, {"action": "\"Fast and loud.\"", "result": "\"Fast and loud,\" you reply, \"we go in, kick ass, and take names.\"\n\n\nHuntress looks skeptical, \"Um... Okay.\" She's about to grapple across the street to the Lounge when she realizes you don't have a grappling gun. Wordlessly, she tosses you a spare. \"Keep it,\" she says, before firing and being pulled to the Lounge. You follow shortly after.", "action_results": [{"action": "The Lounge", "result": "The three story arctic themed building was just as big on the inside as it was out. The club was currently closed down for 'renovations', though you knew better; Penguin had just escaped from prison, and he was more than likely getting back into the swing of things. This meant most under his payroll would be here while he heard how his operations were going. It would be packed, which meant the head on approach was definitely not the best idea. Oh well, you've been in worse spots.\n\n\nThe two of you bust into the front door, already half a dozen criminals in the entrance. Three go for Huntress, while the remainders go for you. At your feet is a socket wrench.", "action_results": [{"action": "My mitts will do just fine.", "result": "Rushing into the fray, you swing a wild haymaker at one of the thugs, managing to hit him. However, the other two attack from both sides, one with a batand the other... With a knife. You try to disarm the one wielding the knife, but he cuts your hands, and soon enough the two have you on the floor, bat guy bashing your head in and knife guy stabbing you in the abdomen. With such a brutal beatdown, you're dead in seconds, the last thing you hear being Huntress screaming your name.\n\n\nYou Died!", "action_results": [null, null]}, {"action": "Put the wrench to use.", "result": "Quickly, you run forward and pick up the wrench, bringing it up into one's face and sending him out for the count. The other two begin to attack, one with a bat and the other... With a knife. Thinking fast, you knock the switchblade out of his hand before he can put it to use, bringing the wrench down hard on his nose.\n\n\n\"ACK!\" you shout as the other swings his bat and hits you in the back, knocking you to the ground.", "action_results": [{"action": "Trip him up.", "result": "With swiftness that would put the Flash to shame, you wrap your legs around his left leg, yanking them to the right. Sure enough, he falls over, giving you time to crawl to him and knock him out with your wrench. \"Christ...\" you pant, breathless.\n\n\nAs you get up, you hear Huntress finish up with her batch. \"I told you we shouldn't have gone through the front!\"\n\n\n\"No you didn't!\" you reply.\n\n\n\"... Well I thought it!\"\n\n\n\"Oh, and I'm supposed to read your mind?\"\n\n\n\"Yes!\" she snaps.\n\n\nExasperated, you begin to retort, but don't have time to as more goons swarm into the lobby. The two of you share a look, then nod.", "action_results": [null]}, {"action": "Get back up.", "result": "You try to smoothly recover, jumping back up to your feet, but he swings his bat right into your face and sends you right back onto your ass. He continues to wail on you, smashing your head in, and long after he's finished the job. In the distance, you swear you hear Huntress scream your name, but soon all sound fades.\n\n\nYou Died!", "action_results": [null, null]}]}]}]}]}, null]}]}]}