{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=53134", "context": "", "first_story_block": "Year 378 of the Second Era\n\n\nYou were really starting to get tired of the color green. The forests were green, the grass was green, even your damn Realm's emblem was green. It made already boring guard duty even worse. You would pace back and forth staring at the dreadfully large expanse of forest ahead of you, but nothing would ever happen. You might see the occasional kobold walk along the edge of the forest, but they never did anything. They just watched and waited. If you weren't on a fifty foot high wall you might actually be worried, but, as it happens, you were. There was no kobold in all of the Lost Realm that could scale these walls, and even if there was it, and its disgusting green skin would get peppered with arrows before it had the chance to. Yes, this was simply the easiest most boring place to guard in all of the Realm of Men. \n\n\nIt was because of this fact that your lieutenant was thoroughly confused when you requested to be transferred here. You were his most reliable soldier, and you knew that. You used his fondness of you to get him to give you this transfer. He'd asked why, and you'd simply replied that you needed time to get over what happened to Liliana. Your wife. She was assumed dead by everyone. The night of your wedding you and her were cornered in an alley by thugs. You were beaten to a pulp, and she was taken, in more than one sense of the word, right before your eyes. Her parting words to you before you blacked out from the pain were, \"I'm lost!\" \n\n\nI'm lost. \n\n\nYou take off your wedding ring and examine it. It's a beautiful piece. Solid gold encrusted with an emerald gem. It is the only green you find yourself being able to stand, and only then because it was from Liliana. Guard duty wasn't paying you enough for you to be able to get rings for the both of you, so instead you blew all of your money on her ring. That one was polished iron inlaid with golden patterns, and it wasn't much, but it represented more than money. Liliana accepted your proposal, and when she found out you hadn't gotten yourself a ring she gave you her mother's ring. It was a little too girly for you, but the smile on her face turned you into an emotional sob, so you accepted. She was taken that same night. Presumed dead, and with you chosen as her closest 'relative' it was up to you to bury her coffin. You did so quickly. Many people, including your lieutenant, suggested you take things slower, but you were adamant.\n\n\nYou didn't tell them why you were in such a hurry, and even if you did, you doubt they would've believed you. You were the closest person to Liliana and consequently the only one whom she would trust with her secrets. \n\n\nI'm lost.\n\n\nThose words could only mean one thing. They were a confirmation to a question you asked her years ago, when the two of you first met... ", "action_results": [{"action": "Memory: Meeting Liliana", "result": "Year 366 of the Second Era\n\n\nAt the age of ten, you were average. Your height, weight, disposition, and, well, pretty much everything about you was average. Never the last one chosen for capture the emblem, but never the first one either. Your life then was a monotonous slog: Go to your rundown academy, try to do well in your academic work, fail, and return home only to have your drunkard of a father beat you. You didn't realize how miserable your life was until the fateful day when Liliana joined your class at school. \n\n\nLike the rest of the girls in the class, she wore a dress. Unlike the rest of the girls in the class, her dress was obviously of fine make. The embroidery on her dress had no faults. No drops of blood from clumsy mothers who pricked themselves on their needle. No lazy patches sewn in to cover up holes. No, her dress was flawless. Her hair was onyx black, and fell down in waves around her face. Her glittering blue eyes were filled with anticipation, and maybe a little fear. She clearly wasn't used to being in these kinds of situations, and she kept glancing around as if someone else was going to introduce her to the other classmates. \n\n\nYour teacher, a hag of a woman, prompted her to introduce herself. \"Go ahead and introduce yourself to the class, dear.\"\n\n\nShe widened her eyes in surprise, but followed the teacher's command. \"My name is Liliana, I'm ten years of age, and..,\" she looked to the teacher for instruction. She had an accent, and one that you'd never heard before at that. Not northern, or even like those from the eastern realm. No, this was decidedly different from any other accent you'd heard before.\n\n\n\"Go on,\" the teacher prompted again.\n\n\n\"I don't know what else to say,\" Liliana responded.\n\n\nThe teacher frowned disappointedly. \"Surely you have more things to tell us about yourself than your name?\" When Liliana didn't respond, the teacher spoke again. \"Where are you from? Or, what do you like to do in your spare time? Tell us things like that.\" \n\n\nLiliana hesitated once more.\n\n\n\"Come now. We don't judge people here,\" the hag patted her comfortingly on the shoulder, but failed to notice the snickering in the back. \n\n\nLiliana, it seemed, found her words comforting, and finally started to open up. \"I was born in Arboribus. My father is the king there, and it's an amazing place. There are trees larger than castles there! Oh, and I like to go stag riding with my father if he has the ti-\" \n\n\nThe teacher interrupted. \"Excuse me. Where?\" The teacher sounded somewhat confused, but definitely disappointed. The snickering in the back increased, but Liliana still hadn't noticed. \n\n\n\"Arboribus,\" she said this clearly, and with an expression of incredulity fixed upon her face. The teacher simply stared at her blankly, until Liliana continued. \"You know, in The Lost Realm...\"  \n\n\nThe boys in the back, try as they might, couldn't contain themselves any longer. They busted out into raucous laughter that spread to the rest of the students that were typically thought of as nice. Everyone gave into the laughter, and even the teacher hag was chuckling.\n\n\nYou were on the edge of laughter as well, but something kept you there. Stories of The Lost Realm, and rumors of a ancient city of humans therein. Your mother, before she died of disease, would tell you fairy tales of the ancient land, and how it used to be as prosperous as the Realm of Men is now. You'd always harbored the secret thought, hope, that the stories were true, and here was a person who claimed to hail from that very place. This, and the expression on Liliana's face, caused you to hesitate.  Her expression was that of someone hurt , and a genuine expression at that. \n\n\nYou held the laughter off, and waited for everyone else to do the same. They eventually quieted down, but only after tears started streaming down Liliana's face. Silence took the place of laughter, and all joy was replaced with the sad sound of sobbing. \n\n\nThe old hag had the decency to attempt to comfort her by giving her a hug, but Liliana jerked away. Apparently she didn't like the idea of hugging the old hag. Especially since she'd promised no ridicule would come, but then turned around and gloried in it herself. \n\n\n\"It's true!\" Liliana yelled after she managed to control her sobbing. \"I'm not a liar! And, and ,and...\" She starts crying again, but instead of staying in the classroom for everyone to see, she ran through the door and out of the classroom. \n\n\nThe silence continued for a moment longer, before you made your first life changing decision. You got up from your designated chair and followed after Liliana. \n\n\nYou were no expert at dealing with girls. Let alone crying ones, and you weren't the most...", "action_results": [{"action": "...charismatic...", "result": "Year 366 of the Second Era\n\n\n...charismatic of people, but you were smart enough to know that, when crying, a girl needs a comforting shoulder. Not a questioning voice. \n\n\nYou follow the sound of sobbing through the worn wooden hallways of the school, and outside, until you find the source of the crying. Liliana sits on the steps to the main door of the school. Her well crafted dress is ruffled in places and her body constantly shifts under the pressure of her tears. Her hair comes down in waves around her head, effectively cutting off any view of her face. \n\n\nShe doesn't notice you there at first, but when the main door closes behind you she jumps and turns towards you. Tears and snot cover her face with her eyes both sad and angry at the same time, and for a moment you find yourself regretting coming here. That moment passes, and the impulse you followed earlier propels you toward her. \n\n\n\"Are you going to laugh at me again?\"\n\n\nHer voice reflects what she is feeling. Sadness, despair, anger, and, you think, a bit of hope color her voice. You decide to concentrate on her hopefulness. \n\n\n\"I didn't laugh.\" \n\n\n\"Everyone laughed. I saw.\" \n\n\nClearly she hadn't been paying attention to you when in the classroom. \"Not me.\" \n\n\nYou sit down on the same step as her, and she glares at you. Silence ensues, and you turn away and gaze out in front of you. You want to ask her about the Realm of the Lost, but the question dies in your throat. Wouldn't it be at least a little insensitive to ask her prying questions now? \n\n\nYour question is answered when you hear her start to sob again. This time it's less intense, but it's still crying all the same. Maybe it's the memory of her excited face when she was in front of the classroom, or maybe you just didn't like the sound of crying. Whatever the reason, you decide to wrap your arm around her shoulders in a half hug. Liliana turns to stone beneath your touch, and you think she'll pull away, but she doesn't. She stays still, but continues her crying. You feel absurdly awkward in this position, but she doesn't seem to mind. She even leans into your hug after a while.\n\n\nIn between holding her and listening to her crying, you find yourself staring at her wondering how in all the realms this girl was from the Lost Realm. You might be tainted by the knowledge of fairytales, but you were still aware that the Lost Realm was crawling with kobold and others of that ilk. It was a very dangerous place. At the end of the first era was when the Lost Realm was supposedly at the height of its power, but that ended when a dragon led a massive host of kobold and wyverns and sacked the entirety of the realm. Well, that's how the stories went. So how then, could a delicate being such as this come from such a dangerous place?\n\n\nThen a brilliant idea came over you. There was a story your mother once told you. One about the faerie, a race of beings native to the Lost Realm. When they were in the Lost Realm they were humanoid creatures of a similar height humans, but with pointed ears and a slender build. In the story, a faerie wandered over the border of the Realm of Men and the Realm of the Lost,  (Before the border walls were constructed) but the faerie were tied to their own realm. Whenever they left, they became as humans. This particular faerie panicked when they realized they left their home for another realm, and immediately tried to go back, but every time he tried to re-enter his homeland, he would get lost, turned around. He could never find his way back. Once the faerie willingly left the Realm of the Lost, they weren't allowed back. He was left in the Realm of Men to fend for himself, but he desired that no their faerie would feel like he did. Alone, confused and afraid. So the faerie came up with a code. If he thought there was another faerie, he would ask them a simple question. \n\n\nYou ask that question now. \"Are you lost?\"\n\n\nLiliana immediately pulls from you and stares at you in disbelief. She suddenly wipes all of the tears from her face with her sleeve before asking you a question. \"Will you help me fit in here?\" \n\n\nKinda shocked that your plan worked you only nod in response. \n\n\nA hint of a smile breaches her face. \"What's your name?\" \n\n\nYou briefly wonder what you've gotten yourself into, but you answer regardless. \"My name is...\"", "action_results": [{"action": "End of Memory", "result": "Year 378 of the Second Era\n\n\nYou pull yourself from the memory. That was happening way too often since Liliana was captured. And she was captured. There was no doubt in your mind about that. Captured by people who obviously knew what they were doing. Otherwise they wouldn't be able to make it through the forests of the Lost Realm without being captured, killed, or raped by horny kobold. That means there's a way to make it through that forest. You just have to find it. \n\n\nThat was the reason you spent your time here on the wall watching, waiting, planning your route through that kobold infested place. Of course you could just leave on your own and hope for the best, but th- \n\n\nYour thoughts are interrupted when the roar of some beast sounds throughout the air. You jerk your head immediately towards the sound. It came from somewhere over the tops of the trees, and still must've been miles out. Every guard on the wall peels their eyes to the forest, and it isn't long before one of your fellow guardsmen spots something. \n\n\n\"There! Above the forest!\" The guard sounds quite panicked.\n\n\nYou look where he indicated and spot several grey blots in the distance. They look like birds at first, but as they get closer you can tell they're much larger and have several more rows of teeth than a bird. \n\n\n\"Wyverns.\" The guard right beside you breathes out. \n\n\nYou turn back to look at the beasts. They're still a few miles out, but you can hear the beat of their leathery wings drawing closer every second. The guards in your platoon stand on the wall in stunned silence. Nothing happens here, ever. Why now of all times? \n\n\nYour lieutenant, an older fellow named Byron, calls everyone to order. \"This is what we're here for men! This is why...\" \n\n\nByron's voice fades into the depths of your mind. It is replaced by a different voice. One that's mocking, provoking. The memory of your first fight calls back to you.", "action_results": [{"action": "Remember", "result": "Year 368 of the Second Era\n\n\n\"Are you listening bitch?\" \n\n\nA hand is shoved into your back and you're sent tumbling to the ground. Grass presses against your face, and you even feel some dirt in your mouth. That was fine. You didn't care very much. These guys could push you around all they wanted. They'd never be able to beat you as bad as your father did. \n\n\n\"Stop it, Daniel!\" Liliana's voice sounds from behind you. Apparently she didn't like Daniel pushing you. \n\n\nYou slowly pick yourself up and off of the ground as Daniel replies. \"What? You didn't like me pushing your bitch around?\" That remark is followed by some laughter. \n\n\n\"He hasn't done anything to you.\" Liliana replies readily. \"Leave and go hit your mom if you're looking for a bitch to hit. Don't touch him.\" There's a moment of silence before you hear a smack. That sound reverberates around the academy yard, and for a moment you think Liliana finally slapped the guy like she said she'd been wanting to do, but when you turn around you find it's the complete opposite. Liliana is on the grass now, clutching her face. You see tears start to come to her eyes, but she doesn't sob. Not anymore.\n\n\nYou've never been the most violent person. Your mother instilled that into you, so you let others push you around. You didn't give a damn either way, but when you see Liliana on the ground you don't hesitate. \n\n\nYou lunge forward and shove Daniel hard in the chest, and you do it hard enough to send him flying to the ground as well, but unlike you and Liliana he gets back up to his feet quickly. His reaction is also quick. He immediately rushes toward you and raises his fist back. You can tell a punch is coming.\n\n\nYou've grown in the past couple years, and are easily one of the tallest guys in class. Aside from Daniel, that is. You might not be taller than Daniel, but you'd bet your mother's corpse (Muse bless her soul) that you can take more hits than he can. That being said, you don't particularly fancy getting punched if you can avoid it. ", "action_results": [{"action": "Let him hit you", "result": "Year 368 of the Second Era\n\n\nDespite what others think of him, Daniel is weak. And you're going to prove just that.\n\n\nHis punch comes directly into your right cheek. It has a hell of a lot of power. Certainly more than you anticipated, but you don't allow yourself to stumble. Your head snaps back as it hits, and there's a lot of pain, but you ignore it. Instead you revel in the shock displayed upon Daniel's face. He's thoroughly surprised, and you doubt someone has ever lasted past the first punch against him. Let alone be barely affected by it. \n\n\nYou look him dead in the eyes and smile just before returning his punch with one of your own. He doesn't get away in time, and is hammered by your punch. He stumbles backward, and you take a step forward and shove him to the ground once more. There's no time for him to react as you pounce on top of him and lay punch after punch into his face. His 'friends' don't rise to stop you, and the courtyard is silent save for the sound of your fist pounding his face. \n\n\nAfter several more punches you feel a hand on your shoulder. You nearly jerk away from it, but, despite your frenzied mind, you are able to recognize that it is a distinctly feminine hand. Liliana, you think and stop punching. Daniel doesn't stop his groaning as you rise to your feet to face her. \n\n\nThere's less baby fat on her face now than when you first saw her, and is beginning to be quite the knockout. Her eyes are still slightly red and the right side of her face is still red, but she isn't crying any more. \n\n\n\"Enough,\" she whispers to you. \n\n\nYou only nod in response. You start to walk away from the scene when you realize that you'd gathered quite the crowd. You think about saying something, but instead you reach for Liliana's hand and glare at everyone in the crowd. Your look says it all. \n\n\nYou leave the scene with Liliana in tow.", "action_results": [{"action": "Return from the memory", "result": "Year 378 of the Second Era\n\n\nThe memory fades away, and Byron's voice returns. \"I need one person to light the signal light over by the watchtower. Everyone in division two stay here and support us with arrows. Everyone in division one follow me!\" \n\n\nThe wyverns are still racing to the wall, and a fight seems inevitable.\n\n\nByron leads the way as he and division one head down to the ground to support the rest of the group. Everyone else stays and prepares their bows. \n\n\nYou were assigned to division two upon your transfer here, and so your orders are abundantly clear. ", "action_results": [{"action": "Stay with division two", "result": "Year 378 of the Second Era\n\n\nThe signal fire will get lit by someone else, so you don't need to worry about that. After that your decision becomes even easier. You aren't a fool. Leaving the safety of the wall when it's under attack, and of your own volition at that, would be utter foolishness. You stay right where you are and string your bow with the rest of division two. \n\n\nThe distinctive sounds of the wyverns approaching doesn't change, but as you wait for them to draw near, you hear another set of noises. Several sets of hooves pound against the ground just beyond the edge of the forest, and before too long you see the culprits of the noise bursting through the edge of the wood. Five horses, mounted by at least one person apiece, ride from out of the forest. They ride at a very fast speed, and the horses themselves seem to be running more from fear rather than their rider's instructions. A few moments after they come out of the woods almost twenty giant lizards come out of the forest. The beasts are generally green, but many, if not, all, have blue or purple scales scattered across their hide. Three kobold ride atop each of the lizards. \n\n\nIf your division wasn't silent before, then they certainly are now. The math is easy. There are around sixty kobold, and that is discounting the wyverns and their riders still on their way. You briefly wonder what in the four realms this group of less than ten individuals did to anger this many kobold, but the thought is dashed from your mind as the kobold come into range. \n\n\nYou aren't the best shot out there, but you are far from the worst, and today is a good day for you. Nearly every one of your arrows finds its mark, and many an enemy dies at your hand. You continue this up until the very moment division one clashes with the kobold host. After that you slow down, and pick your shots. You don't want to accidentally hit a fellow guard after all. \n\n\nYou're so focused on the battle below you that you nearly miss it when the wyverns make their first approach. The beasts, although much larger than the giant lizards, only carry two kobold apiece. The wyverns themselves are a leathery grey color with razor sharp teeth, and hind legs that could tear guards apart. there are only five, but you have trouble thinking about how you and division two are supposed to bring down one of these monstrosities. Let alone five. \n\n\nThe fear in division two is palpable as you and your fellow guardsmen switch your attention from the kobold below to the wyverns above. Almost as if they could sense the fear in your comrades, three of the wyverns barrel past the battle below and head straight towards the portion of the wall your division is centered on. \n\n\nSpecifically, and unluckily so, one of the wyverns seem to be coming straight toward you. You find yourself in the midst of a decision that could cost you your life, and you only have a second to act.", "action_results": [{"action": "Dodge to the side", "result": "Year 378 of the Second Era\n\n\nYou act on impulse and throw yourself to the side as the wyvern makes its pass, but you don't throw yourself nearly far enough away to avoid its claws. While it doesn't manage to grab you and fling you off the wall, its claws do manage to carve your stomach to pieces. If that wasn't enough, the sheer momentum of the beast flying at you at breakneck speed and hitting you is enough to send you flying off the wall. \n\n\nYour body can't even keep itself together as you plummet to your death.", "action_results": []}, {"action": "Duck behind the ramparts", "result": "Year 378 of the Second Era\n\n\nYou know you won't have enough time to get entirely out of the range of the wyvern's claws. It's better to duck and hope for the best than to definitely die. \n\n\nYou follow this thought and duck behind the ramparts. The wyvern makes its pass, and perhaps from sheer luck, you pass between its hind legs. Stones from the ramparts on either side of you crumble and fall away, but you remain fairly unscathed. \n\n\nYou thought you were going to die for sure, and, after finding out you managed to scrape by, you stand up in a fit of pure relief. You celebrate too early, however, for a kobold archer from the battle below takes the opportunity and releases an arrow at you. The arrow pierces through your jugular, and you bleed out in mere moments.", "action_results": []}]}, {"action": "Go light the signal fire", "result": "Year 378 of the Second Era\n\n\nWhen you first transferred here, Byron was telling you about all of the duties that you might have here as a wall guard. One of these duties, should the need arise, was to light the signal fire. Byron didn't expound upon the why, and said only that it was an important duty. You didn't find out until later that this was the signal fire for the Griffin Knights. The Griffin Knights, or at least the patrol of them that stood at the ready in case the walls were attacked. \n\n\nYou assume most guards forget this fact. Otherwise they'd simply be fools. Griffin knights were among the best warriors in all of the Realm of Men, and that was when they weren't atop their chosen steed. With their griffins these knights surpassed all other units in their usefulness in battle. \n\n\nThat was the way to win this battle. Not through grit, and a hell of a lot of grit. No, in order to win, to live to see Liliana again, the Griffin Knights needed to be here. The wyverns would tear apart everyone otherwise. \n\n\nYou run along the ramparts to the signal fire. It's quite the distance from where the battle is taking place, and you start to hear the sound of swords clashing and wyverns roaring as you make your way. Upon arriving, you find straw and oil ready to be used in case of an emergency. You waste no time in starting the fire. Before long you tend the fire to maximum intensity, or at least as intense as you can get it on such short notice. \n\n\nHaving finished your job, you gaze back in the direction of the battle. Five wyverns patrol the skies with each occasionally taking dives at the top of the wall where division two was stationed. You feel a pang of guilt that you should've stayed there to help, but you dismiss it. If the Griffin Knights come to support you in the battle, then your efforts will have been well worth it. \n\n\nThat being said, there isn't much of an excuse for you now. ", "action_results": [{"action": "Return to the battle", "result": "Year 378 of the Second Era\n\n\nYou start a light jog to the wyvern infested ramparts, but you stop before you get there and string your bow. What is the point in throwing yourself into the middle of danger for nothing? Chances are that you would die a gruesome death for no reason other than your eagerness for battle. An inexperienced fool's death. \n\n\nWith your bow stringed and the wyverns attention away from you, you start taking shots at the beasts. You aim your first few shots at the wyverns themselves, but when they bounce harmlessly off of their scaly hides, you shift your focus. There are two kobold atop each of the five wyverns present, and while they are certainly dwarfed by the sheer size of the wyverns they are riding, you don't let that distract you. Each of the kobold atop the wyvern has a critical purpose. The one in the front is to steer and control the mount while the one in the back holds a bow in its hands. It's job is to fire at anyone attempting to kill the former type of kobold. Such as you. \n\n\nThe wyvern you'd been concentrating on turns its attention toward you, as does the kobold archer atop it, but it never gets a chance to loose its arrow at you. Instead your own arrow pierces its chest sending it tumbling from its mount and into the open air. Unfortunately, the other kobold still sits atop the wyvern, and after your display of accuracy, you've become a prime target. That wyvern and its rider come flying toward you, which is bad, but away from the battle, which is good. You take the last opportunity you'll get and loose one more arrow at the other kobold. Your aim is off on this, so your arrow only ends up bouncing off of the wyvern's body. You start to draw another arrow, but as you do, the wyvern takes on a burst of speed and is on you before you know it. Your life flashes before your eyes, and an image of Liliana's beautiful face plants itself at the forefront of your mind. You simply don't have enough time to react to the wyvern's speed, and you just close your eyes in acceptance. \n\n\nThen you feel a large claw grab your waist. Its touch is surprising gentle. Nothing of what you would expect of a wyvern, and you keep waiting for it to hurl you from its grip, but that doesn't happen. Hesitantly, you open your eyes to find yourself suspended in the air, and not in the grasp of a wyvern. Rather, you find yourself in the grip of a griffin. The relief you feel is instantaneous, but that is quickly replaced by terror. You quickly reach your hands and grip onto the cold claws of the griffin. \n\n\nYou take stock of the situation. Including the griffin carrying you, there are at least seven Griffin Knights combating the wyverns in the air. It's  an amazing scene, and your breath catches. Griffins are much smaller than the wyverns, but this makes them significantly faster, so the wyverns seeme clumsy by comparison. The griffin knights themselves wear gleaming silver armor and cast a perfect picture of the word 'knight.' On the ground, the fight continues. The kobold outnumber division one, by nearly two to one, and that is discounting the giant lizards they brought with them to the battle. You start wondering why so many kobold came to mount an attack on the wall, but are soon distracted from that with what happens next.\n\n\nYou feel a sudden change in direction as the griffin carrying you heads back to the walls. You realize that it, and the rider, must want to drop you back off at the wall before returning to the melee. You are quite okay with this, but then a scene just below you unfolds in the span of a moment. \n\n\nA wyvern, with just the rider left to guide it, chases a griffin just below you. For that moment it seems the entire world slows down in order for you to see and understand what's happening. The wyvern is gaining, and it opens its mouth in anticipation for the coming chomp on the griffin's lower half. It isn't some beast's wild hope that it'll manage to bite the griffin either. No, you can very clearly see that this wyvern will be able to catch the griffin. Thus leading to both the griffin's and its rider's death. \n\n\nIn this same moment, an utterly absurd idea crosses your mind. The griffin holding you wasn't trying to keep you prisoner. It was merely keeping you from falling, and you think you could pry yourself open from its grip if you really tried. If you did, then you should land just as the wyvern's saddle passes beneath you. Your weight might even be enough to cause the wyvern to lose the edge its gained on the griffin. You left your bow back on the ramparts when the griffin saved you from the wyvern, but you do still have your standard short sword strapped to your waist. If you did go through with such a ridiculous plan, you could maybe even take out the rider and wyvern. \n\n\nMaybe.", "action_results": [{"action": "Follow that plan", "result": "Year 378 of the Second Era\n\n\nThis won't be the first time you've done something crazy, though it is likely the one with the most at stake. \n\n\nYou pry yourself from the claws of the griffin and fall into the open air. Your plan...", "action_results": [{"action": "Fails!", "result": "Year 378 of the Second Era\n\n\nYour timing was horribly off. You jump much too early and find yourself face to face with the open mouth of a wyvern. It must think you're the griffin, for as soon as you even near its mouth it snaps its mouth shut on top of you. Your midsection is torn to pieces, and you die instantly. \n\n\nAt least you can die well knowing that you saved that Griffin Knight.", "action_results": []}]}, {"action": "Let yourself be brought back to the ramparts", "result": "Year 378 of the Second Era\n\n\nSure you've done crazy things in the past, but this is no time to try and accomplish the utterly insane. Especially when the chances of success are so very low. Better to live and keep your chance of saving Liliana alive rather than to throw it away on the unlikely chance that you'll be able to save some random nobody.\n\n\nDespite this fact, you still wince when you see the wyvern's mouth snap down on the griffins hindquarters. The scene turns into a bloody mess, and you can't help but look away as the griffin (or at least what's left of it) and its rider plummet down to the battle below. \n\n\nYou feel a pang of guilt, but you push it away by telling yourself you couldn't have done anything anyway. Yet, somewhere in the back of your mind, you don't believe this. \n\n\nNot too long after that you are dropped off on the ramparts you were originally guarding. Much is different. Several chunks of the wall are missing, and many soldiers lie dead on the ramparts. The wall you once guarded no longer carries that symbol of boredom and ease in your mind. It is readily replaced with the memory of blood spilt, and comrades dying. \n\n\nOver half of division two is either dead or incapacitated. Division on was doing better, but the griffin that was killed only moments before plummeted right into their line. That turned out to be the turning point in the kobold's favor, and now division one is slowly being pushed back against the wall. The griffins are locked in a very deadly battle with the rest of the wyverns, and don't seem at all in a position to help the human forces on the ground. \n\n\nYou aren't sure what you could do to help in this situation, for it looks like your defeat is inevitable. The griffins won't be able to kill the wyverns fast enough to help division one avoid getting slaughtered, which division one is mere minutes away from. This leaves you with a few honorable choices and one dishonorable choice. ", "action_results": [{"action": "Join division one on the ground", "result": "Year 378 of the Second Era\n\n\nYou're no griffin knight. You can't contend with wyverns on an equal level, and firing a few arrows won't make any difference in the fight on the ground. No, if you're going to win this fight, then you need to go right into the thick of it. If you can manage to help division stay alive for even five minutes longer, then the chances of the griffin knights helping out are significantly higher. \n\n\nYou still have your sword strapped to your waist, and you don't usually carry a shield on you for guard duty, so you pick one up from the dead and strap it to your back. Following this you jog to the closest tower and go down the stairwell. Inside the tower it is eerily quiet compared to the roars and clangs of battle outside, and the sound of your steel boots hitting the stone stairs reverberates throughout. Moments later, you come to the bottom of the stairs. A large iron gate-like door greets you. It is quite the durable piece, and nothing less than a battering ram would be able to break through it. Or perhaps a wyvern flying at breakneck speed... You push that foreboding thought from your head and walk through the iron doors. \n\n\nWhat greets you outside is a scene of bloodshed and death. Division one has been pushed back nearly all the way to the walls, but their line still holds. Currently the division is organized in a semi-circle formation with the flat of the circle pressed against the wall. Everywhere else is a place for fighting, and nearly every soldier fights for their lives. There is one soldier, however, that does not fight, You see him sitting against the wall with the shaft of a crude arrow of kobold make protruding from his stomach. It's Byron, and it looks like he's lost a lot of blood. \n\n\nAlmost instinctively, you approach him. As you near, a spurt of blood comes out of his mouth and splatter against your chest-piece. \"Lieutenant Byron?\" You ask this fairly loudly, but he doesn't respond, so you repeat it. \"Lieutenant Byron?\"\n\n\nThis time he turns his pain and regret filled eyes toward you. He focuses on you and reaches his arm up and grips your forearm in his. A sign of comradery and trust. \"I know not who you are, nor from where you came, but I need you now soldier. We are losing. My men die at every turn, and the kobold do not let up. Even still, there is hope. If we can keep the line, then they,\" he looks up to the sky, \"will save us.\"\n\n\nHe coughs up some more blood, but his grip on your arm stays strong. \"Your name escapes me soldier, and I feel bad for laying this burden upon you, but someone must keep these soldier together. Will you do this for me brother? See to it that some of these men survive this battle.\" \n\n\nWith this last request his grip loosens and falls limp at his side. His breaths cease, and you're left in the presence of a dead man. Numbly, you stand back up and gaze at the fight. You knew you needed to help in this battle in the first place, but speaking with Byron has strengthened your resolve. The only thing left to decide is where you will help.", "action_results": [{"action": "Help the left flank", "result": "Year 378 of the Second Era\n\n\nYou aren't Byron. You won't be able to lead these men better than him, or lead them at all. You're just another soldier, so what does it matter where you go? So you head to the flank closest to you. The left one. \n\n\nThe fighting over here doesn't seem nearly as intense as the fighting near the middle. You pull out your sword and shield, and immediately get to work. Most of the people fighting are beginning to get tired, so the addition of a fresh, well equipped soldier vastly improves the line. So much, in fact, that it seems that the entirety of the left flank almost molds around your fighting. Which strikes you as odd, because of the way you're fighting. You don't rush in and throw yourself at the enemy in a fit of battlefield rage, or anything of that sort. No, you're calm in the heat of battle. You have a focused determination, and because of this you don't make any brash moves. Your goal is to stay alive while keeping everyone else alive as well. Defense is the best offense, and it happens to make the fight last a hell of a lot longer. Maybe this will buy enough time for the griffin knights to take care of the wyverns.\n\n\nWith this thought in mind, you fight. Not for glory, nor for yourself. You fight for Liliana, and the chance to see her alive and well again. \n\n\n\"Retreat!\" The sound of a despairing voice breaks you out of your focus, and a kobold nearly guts you because of it, but you quickly block the flimsy attack and return it with one of your own. It dies before you, and you have a sacred moment of rest before another kobold comes to fill its spot in the line. It gives you time to think about what the guy meant by retreating. Your line was doing so well, and retreating now would be suicide. The kobold would have a field day with chasing down and killing everyone on the ground. It was a cowardly, foolish mistake. Hopefully no one would listen to the fool's order, but, to your chagrin, they do. Soldiers from your left and right start disappearing, and, soon enough,  there is no longer even the semblance of a line. You're quickly surrounded by kobold, and while you make a valiant effort to stay alive, it isn't enough.", "action_results": []}, {"action": "Help the right flank", "result": "Year 378 of the Second Era\n\n\nYou aren't Byron. You won't be able to lead these men better than him, or lead them at all. You're just another soldier, but you do think it matters where you go. You happen to be right handed, so you'll likely fight better in the right flank. With this hope in mind, you go over to your destination.\n\n\nThe fighting over here doesn't seem nearly as intense as the fighting near the center. You pull out your sword and shield, and immediately get to work. Most of the people fighting are beginning to get tired, so the addition of a fresh, well equipped soldier vastly improves the line. So much, in fact, that it seems that the entirety of the right flank almost molds around your fighting. Which strikes you as odd specifically because of the way you're fighting. You don't rush in and throw yourself at the enemy in a fit of battlefield rage, or anything of that sort. No, you're calm in the heat of battle. You have a focused determination, and because of this you don't make any brash moves. Your goal is to stay alive while keeping everyone else alive as well. Defense is the best offense, and it happens to make the fight last a hell of a lot longer. Maybe this will buy enough time for the griffin knights to take care of the wyverns.\n\n\nWith this thought in mind, you fight. Not for glory, nor for yourself. You fight for Liliana, and the chance to see her alive and well again. \n\n\n\"Retreat!\" The sound of a despairing voice breaks you out of your focus, and a kobold nearly guts you because of it, but you quickly block the flimsy attack and return it with one of your own. It dies before you, and you have a sacred moment of rest before another kobold comes to fill its spot in the line. It gives you time to think about what the guy meant by retreating. Your line was doing so well, and retreating now would be suicide. The kobold would have a field day with chasing down and killing everyone on the ground. It was a cowardly, foolish mistake.\n\n\nHopefully no one would listen to the fool's order, but, to your chagrin, they do. Soldiers from your left and right start disappearing, and, soon enough,  there is no longer even the semblance of a line. You're quickly surrounded by kobold, and while you make a valiant effort to stay alive, it isn't enough.", "action_results": []}]}, {"action": "Stay here and support division one with arrows", "result": "Year 378 of the Second Era\n\n\nThe Griffin knights are living legends. They don't need your 'support,' and they definitely don't need you shooting stray arrows and accidentally hitting one of them. Division one, however, does need your help, but leaving the wall at this point would be foolish. You'd likely be an easy target for a kobold archer in the back. Instead you decide that your best option is to stay on the ramparts and pick your shots. \n\n\nThus, you act. You find a bow lying beside a dead body, along with a few arrows, and immediately set to work. You focus on the easy targets, the ones away from the forefront of the battle. Those, and the kobold archers. You loose arrow after arrow into the enemy force, and bring many a kobold down, but it simply isn't enough. Your contribution isn't enough to turn the tide of battle at all, but, unfortunately for you, it is enough to garner the attention of the kobold archers. You manage to keep from being hit for quite a while, but eventually a kobold gets a lucky shot and you fall dead onto the ramparts with an arrow lodged in your throat.", "action_results": []}, {"action": "Stay here and support the griffin knights with arrows", "result": "Year 378 of the Second Era\n\n\nYou aren't going to flatter yourself. You firing a few arrows into the kobold horde below won't change anything, except perhaps where you die. Fighting on the forefront of the battle won't change anything either, and will almost definitely lead to your gruesome death. No, you aren't that powerful of an individual. \n\n\nThere is only one thing left. If you can manage to hit even just one of your shots on one of the kobold riders, then you could very well change the course of this battle. Killing a few kobold on the ground won't make that much of a difference, but if you can manage to help take down the wyverns, then the griffin knights will be free to help division one on the ground. At this point, victory relies on those knights. You only hope that you can help expedite that process.\n\n\nYou find a bow lying among the dead on the ramparts, along with a few arrows. The only thing left to decide is what you will aim at.  ", "action_results": [{"action": "Aim at the kobold riders", "result": "Year 378 of the Second Era\n\n\nWyverns are beasts of terrible power, and their hides, while not as thick as dragon hide, will easily block your arrows. Better to aim at the riders, and have the wyverns panic with their riders dead. This would make the wyverns much easier to kill.\n\n\nIn theory.\n\n\nThe situation casts you into a state of wonderment. You never would have though that you'd be in a battle this large, let alone one with aerial combat, and you don't want it all to end here. You take your first arrow, notch it, and pull it back. You wouldn't get many decent shots here, and when the opportunity arises, you don't want to miss it, so you wait. The kobold riders ride low in their saddles, for some among their numbers (including the one you killed) have felt the sting of mankind's arrows. This makes finding a decent shot all the more difficult, but you're patient. After all, you only need one good shot to turn the tide in this battle.\n\n\nYou're left waiting for nearly a full minute before such an opportunity arises, and what the opportunity it is. One of the griffin riders, having been separated from the rest, rides past the wall only several feet away from you. A wyvern and its pair of riders give chase, and their passing by the wall gives you the perfect chance. You take aim at the kobold rider steering the beast, and release. \n\n\nThe Muses must have seen it fit to bless you this day, for your arrow strikes true. it hits the kobold rider and it goes flying from the saddle. You're about to leap with joy when an arrow pierces you through the chest, and you immediately fall to the ramparts wounded. It isn't a shot that kills you immediately, but blood is pouring out of your chest at an alarming rate, so you know you're about to die. \n\n\nYou only wish you could've seen Liliana one last time.", "action_results": []}, {"action": "Aim at the wyverns", "result": "Year 378 of the Second Era\n\n\nWyverns are beasts bred for killing and war. You don't think they'll simply abandon this instinct just because their riders die. No, if you're going to attempt to help the griffin knights, then the best way to do so is to take out a wyvern. Even if you only manage to take out one of them, it would help a significant amount. \n\n\nYou cast your thoughts back to your youth. Your mother would tell you stories of the beasts in the Lost Realm, and of the heroes whom bested those beasts. You're sure you remember something about a wyvern being vulnerable in its underbelly? Or maybe it was its wings? You can't remember for sure, but you don't have any other ideas. ", "action_results": [{"action": "Aim for the stomach", "result": "Year 378 of the Second Era\n\n\n Maybe you're certain that wyverns are weak in the stomach, or maybe it's just a wild guess. Whatever the reason, you decide to try hitting the wyverns' stomach. \n\n\nSweat forms on your brow as you notch an arrow and take aim. You raise your bow at the wyvern closest to you, whom is being chased by a pair of griffin knights, and loose your arrow. Your aim is true, but the arrow merely glances off the strong hide. Apparently your hunch was wrong. The stomach is not a weak point for a wyvern. This fact, however, doesn't keep you from trying.\n\n\nYou enter a state of pure focus. Arrow after arrow is loosed from your bow, and when you run out of arrows you search for more. You will kill one of these blasted beasts even if it takes every arrow in this realm, this wyvern will fall. Fortunately for you, you don't have to wait too long before one of your arrows finds a weak point in the wyverns scales. The wyvern roars in pain, and for a moment you think you've succeeded, but the wyvern keeps flying. \n\n\nThere is one thing that changes, however, and that is that the wyvern now targets you. Apparently it didn't appreciate your lucky shot. The griffin knights are not quick enough to save you this time, and you end up learning how sharp a wyvern's teeth are firsthand.", "action_results": []}, {"action": "Aim for the wings", "result": "Year 378 of the Second Era\n\n\nYou can't remember for certain if their wings are vulnerable, but you doubt the stomach is, as you can think of no viable reason for it to be. The wings, on the other hand, if damaged enough can cause a wyvern to lose its flight abilities.  \n\n\nSweat forms on your brow as you notch an arrow and take aim. You raise your bow at the wyvern closest to you, whom is being chased by a pair of griffin knights, and loose your arrow. Your aim is true, but the arrow is merely gusted away by the draft the flapping its wings create. Apparently your hunch was wrong. The wings are not a weak point for a wyvern. This fact, however, doesn't keep you from trying.\n\n\nYou enter a state of pure focus. Arrow after arrow is loosed from your bow, and when you run out of arrows you search for more. You will kill one of these blasted beasts even if it takes every arrow in this realm, this wyvern will fall. Fortunately for you, you don't have to wait too long before you time your arrow just right. You let your arrow go just before the wyvern flaps his wings, and it sails true piercing the softer scales of the wing. The wyvern roars in pain, and for a moment you think you've succeeded, but you only hit one arrow, and that wyvern's wings are quite large.\n\n\nThere is one thing that changes, however, and that is that the wyvern now targets you. Apparently it didn't appreciate your lucky shot. The griffin knights are not quick enough to save you this time, and you end up learning how sharp a wyvern's teeth are firsthand.", "action_results": []}]}]}, {"action": "Abandon them", "result": "Year 378 of the Second Era\n\n\nThere isn't anything left for you here but death. And you cannot die. Your goal is to save your beloved. Liliana. You don't have time to be caught up in border battles where death is a likely possibility. Your life is not your own anymore, for if you die, then Liliana will as well. \n\n\nWith most of division two destroyed and with what's left of division one, there is no one to see you leave. You jog along the ramparts, and away from the battle. You pass the signal fire you lit and head to the next watchtower over. They keep food and water storage in the towers, and if you were to have any hope of deserting and living then you would need supplies. You move quickly, and gather food, water, flint and steel, extra arrows, a shield and everything else you could possibly need. After gathering it all, you head to the very bottom of the stairwell and tower. A large iron gate-like door greets you. It is quite the durable piece, and nothing less than a battering ram would be able to break through it. Or perhaps a wyvern flying at breakneck speed... You push that foreboding thought from your head and walk through the iron doors. \n\n\nA slight breeze pushes against your face. You're far enough from the battle that you can only barely hear the roar of the wyverns fighting. you take a breath and look at your next destination. The green of the forest is all that will greet your eyes for an indeterminate amount of time in the future. This is the only way to go. The penalty for desertion is death, so there is no way you are going to stay here. Your only option is to move forward in your search for Liliana. \n\n\nYou take a deep breath, ready yourself mentally, then enter into the Lost Realm. You don't get very far in there, however, before you run into kobold reinforcements. They number over ten, and you are no god though you do manage to take a few out before succumbing to multiple stab wounds.", "action_results": []}]}]}]}, {"action": "Abandon the fight", "result": "Year 378 of the Second Era\n\n\nYou didn't come here for a fight. This was supposed to be the easiest place to guard in all the realm. No wyverns or kobold were supposed to come here, and certainly not in the numbers that actually threaten your wall occupation. Your goal is to save your beloved. Liliana. You don't have time to be caught up in border battles where you might die. Your life is not your own anymore, for if you die, then Liliana will as well. \n\n\nYou pretend to be lighting the signal fire, but when you are out of sight of the other soldiers you find one of the many towers and make your way down it. They keep food and water storage in the towers, and if you were to have any hope of deserting and living then you would need supplies. You move quickly, and gather anything that you might need: Food, water, flint and steel, extra arrows, a shield. Everything you could possibly need. After gathering it all, you head to the very bottom of the stairwell and tower. A large iron gate-like door greets you. It is quite the durable piece, and nothing less than a battering ram would be able to break through it. Or perhaps a wyvern flying at breakneck speed... You push that foreboding thought from your head and walk through the iron doors. \n\n\nA slight breeze pushes against your face. You're far enough from the battle that you can only barely hear the roar of the wyverns fighting. you take a breath and look at your next destination. The green of the forest is all that will greet your eyes for an indeterminate amount of time in the future. This was the only way to go. The penalty for desertion is death, so there was no way you were going to stay there. Your only option was to move forward in your search for Liliana. \n\n\nYou take a deep breath, ready yourself mentally, then enter into the Lost Realm. You don't get very far in there, however, before you run into kobold reinforcements. They number over ten, and you are no god though you do manage to take a few out before succumbing to multiple stab wounds.", "action_results": []}]}]}, {"action": "Use his strength against him", "result": "Year 368 of the Second Era\n\n\nDespite what others think of him, Daniel is weak. And you're going to prove just that.\n\n\nHis punch comes directly at your right cheek. It has a hell of a lot of power. Certainly more than you anticipated, but you don't allow yourself to hesitate. He might be powerful, but he was predictable. You dodge his punch by stepping in towards him, and then follow up his punch with one of your own. It hits right below his sternum, and he starts to keel over. You act on instinct now. You grip the top of his head and bring your knee up into his face, and there's a distinct crunch noise. You then push him slightly away from you. \n\n\n He stumbles backward, and you take a step forward and shove him to the ground once more. There's no time for him to react as you pounce on top of him and lay punch after punch into his face. His 'friends' don't rise to stop you, and the courtyard is silent save for the sound of your fist pounding his face. \n\n\nAfter several more punches you feel a hand on your shoulder. You nearly jerk away from it, but, despite your frenzied mind, you are able to recognize that it is a distinctly feminine hand. Liliana, you think and stop punching. Daniel doesn't stop his groaning as you rise to your feet to face her. \n\n\nThere's less baby fat on her face now than when you first saw her, and is beginning to be quite the knockout. Her eyes are still slightly red and the right side of her face is still red, but she isn't crying any more. \n\n\n\"Enough,\" she whispers to you. \n\n\nYou only nod in response. You start to walk away from the scene when you realize that you'd gathered quite the crowd. You think about saying something, but instead you reach for Liliana's hand and glare at everyone in the crowd. Your look says it all.\n\n\nYou leave with Liliana in tow.", "action_results": [null]}]}, {"action": "Push the memory back", "result": "Year 378 of the Second Era\n\n\nThis isn't the time for idle thoughts. No, you need to focus on the situation at hand. \n\n\nThe memory fades away, and Byron's voice returns. \"This is why we guard this wall! No wyverns, kobold, or other filth will cross this wall! Gather your weap-\" Byron is interrupted by another voice. \n\n\n\"Help! There are kobold chasing us on the ground. The rest of my party is coming with the kobold hot on their tail.\" The voice comes from all the way at the bottom of the wall. You can barely make out what he's saying, but someone does and repeats it to Byron, who then continues speaking.\n\n\n\"I need one person to light the signal light over by the watchtower. Everyone in division two stay here and support us with arrows. Everyone in division one follow me!\" \n\n\nByron leads the way as he and division one head down to the ground to support the rest of the group. Everyone else stays and prepares their bows. \n\n\nYou were assigned to division two upon your transfer here, and so your orders are abundantly clear. ", "action_results": [null, null, null]}]}]}, {"action": "...intelligent...", "result": "Year 366 of the Second Era\n\n\n...intelligent of people, but you were outgoing enough to provide a suitable person for her to talk to.\n\n\nYou follow the sound of sobbing through the worn wooden hallways of the school, and outside, until you find the source of the crying. Liliana sits on the steps to the main door of the school. Her well crafted dress is ruffled in places and her body constantly shifts under the pressure of her tears. Her hair comes down in waves around her head, effectively cutting off any view of her face. \n\n\nShe doesn't notice you there at first, but when the main door closes behind you she jumps and turns towards you. Tears and snot cover her face with her eyes both sad and angry at the same time, and for a moment you find yourself regretting coming here. That moment passes, and the impulse you followed earlier propels you toward her. \n\n\n\"Are you going to laugh at me again?\"\n\n\nHer voice reflects what she is feeling. Sadness, despair, anger, and, you think, a bit of hope color her voice. You decide to concentrate on her hopefulness. \n\n\n\"I didn't laugh.\" \n\n\n\"Everyone laughed. I saw.\" \n\n\nClearly she hadn't been paying attention to you when in the classroom. \"Not me.\" \n\n\nYou sit down on the same step as her, and she glares at you. Silence ensues, and you turn away and gaze out in front of you. You want to ask her about the Realm of the Lost, but the question dies in your throat. Wouldn't it be at least a little insensitive to ask her prying questions now? \n\n\nYour question is answered when you hear her start to sob again. This time it's less intense, but it's still crying all the same. Maybe it's the memory of her excited face when she was in front of the classroom, or maybe you just didn't like the sound of crying. Whatever the reason, you decide to wrap your arm around her shoulders in a half hug. Liliana turns to stone beneath your touch, and you think she'll pull away, but she doesn't. She stays still, but continues her crying. You feel absurdly awkward in this position, but she doesn't seem to mind. She even leans into your hug after a while.\n\n\nIn between holding her and listening to her crying, you find yourself staring at her wondering how in all the realms this girl was from the Lost Realm. You might be tainted by the knowledge of fairytales, but you were still aware that the Lost Realm was crawling with kobold and others of that ilk,. It was a very dangerous place. At the end of the first era was when the Lost Realm was supposedly at the height of its power, but that ended when a dragon led a massive host of kobold and wyverns and sacked the entirety of the realm. Well, that's how the stories went. So how then, could a delicate being such as this come from such a dangerous place?\n\n\nThen a brilliant idea came over you. There was a story your mother once told you. One about the faerie, a race of beings native to the Lost Realm. When they were in the Lost Realm they were humanoid creatures of a similar height humans, but with pointed ears and a slender build. In the story, a faerie wandered over the border of the Realm of Men and the Realm of the Lost,  (Before the border walls were constructed) but the faerie were tied to their own realm. Whenever they left, they became as humans. This particular faerie panicked when they realized they left their home for another realm, and immediately tried to go back, but every time he tried to re-enter his homeland, he would get lost, turned around. He could never find his way back. Once the faerie willingly left the Realm of the Lost, they weren't allowed back. He was left in the Realm of Men to fend for himself, but he desired that no their faerie would feel like he did. Alone, confused and afraid. So the faerie came up with a code. If he thought there was another faerie, he would ask them a simple question. \n\n\nYou ask that question now. \"Are you lost?\"\n\n\nLiliana immediately pulls from you and stares at you in disbelief. She suddenly wipes all of the tears from her face with her sleeve before asking you a question. \"Will you help me fit in here?\" \n\n\nKinda shocked that your plan worked you only nod in response. \n\n\nA hint of a smile breaches her face. \"What's your name?\" \n\n\nYou briefly wonder what you've gotten yourself into, but you answer regardless. \"My name is...\"", "action_results": [null]}]}]}