{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=8098", "context": "", "first_story_block": "WARNING! (The fake one)\n\nThis story contains mature subject matter concerning teens and is meant to help said age group “experience” a problem they may encounter in their life and show the consequences of their actions if they handle it in the wrong way. There will be separate sections for boys and girls for as we all know, both genders experience different struggles during their precious formative years.\n\nIf you are a pre-pubescent, you should NOT be reading this story, you should be in bed. Such mature subject matter is not for your tender young eyes.\n\nIf you are an adult and you are a parent, perhaps you should “experience” this story with your teen, for they may still have further questions about the subject matter. Questions that you should provide answer for, because if you do not they may learn the wrong answers from their peers, the streets, minorities or even (gasp) the evil dirty internet!\n\nIf you are an adult and NOT a parent, get the fuck out of here. You probably just want to “play” the girl path and choose all the slutty choices, you fucking pervert.\n\nIt is the hope that this story may somehow help teens better deal with the problems found in this story in real life. And remember if you do turn out to be gay (boys) or sexually loose (girls) it doesn’t make you a bad person. It just means you’re going to die of AIDS and burn in hell.\n\nNow what gender are you?", "action_results": [{"action": "Male", "result": "You are a typical male teen…well maybe not entirely typical. In your current state you aren’t very popular in school. Sometimes you feel left out of things, particularly social gatherings involving girls. Maybe being popular would makes things easier and make you happier, but then you also wonder if you even belong here, as you have a hard time relating to people sometimes.\n\nWell, what are YOU going to do about it?", "action_results": [{"action": "Attempt to make friends because you NEED to be accepted by your peers", "result": "You aren’t anybody unless you’re popular! Okay well it’s not entirely a bad thing to be social; it’s perfectly natural to want to go along with the rest of the sheep. Though what KIND of sheep you’re going to be going along with might make a big difference in your life.\n\nYou must choose, but choose wisely because this is ALL going on your permanent record.", "action_results": [{"action": "Join a sports team! Jocks get all the girls!", "result": "Sure sports, that’s always a good way to conform and it does attract the ladies usually. A lot better than joining the chess club would anyway.\n\nYou’re unsure of what to pick, so you go by the old chestnut and pick football…\n\nAfter laughing his ass off the coach actually gives you a chance at training, as it turns out, you aren’t completely inept, but you don’t really have ability that makes you stand out. You’ll probably get cut and then you’ll be back where you started and you don’t want that.\n\nWhile you’re sitting in the locker room wondering what the hell you’re going to do, one of your team mates approaches you.\n\n“Hey, I saw you out there, you looked pretty good.”\n\nImmediately you go on the defensive.\n\n“Hey, hey! I ain’t into that gay shit!” you exclaim protectively grabbing your dick and backing your ass against the wall.\n“What? Oh. Ha ha! No! No, I was just saying you probably got what it takes to make the team, but you just need that extra edge. I mean who has time to waste doing all that training right? I’d rather be spending my free time fucking the sluts and partying, y’know what I’m sayin’? That’s why I take this!”\n\nYour teammate shows you a needle.\n\n“Is that…”\n“Yep, steroids! Combine it with these pain killers…” He shows you a bag of pills. “And you got what Legends are made of!”\n“Um…aren’t those like illegal?”\n“Fuck yeah! But what are you some fucking choir boy? You wanna get on the team and fuck all those pretty cheerleader bitches you better start taking this shit. What’s the big deal? All the pros use them!”", "action_results": [{"action": "Take the drugs: it's the breakfast of Champions!", "result": "Hey if the pros use them, then it MUST be good! You take the needle and pills for later use.\n\nBefore the next try outs you shoot up and feel a surge of energy! You feel like you could lift a thousand pounds! Due to you breaking another member’s leg in training, the coach doesn’t hesitate to allow you on the team. As the weeks go by, you start pumping a lot of iron and have muscles like you never had before and certainly a lot more confidence. Your awkwardness with girls has ended and after a few winning games your popularity has grown. You are now a “somebody”.\n\nHey steroid freak, don’t celebrate just yet, now you get to see how much you fuck up!\n\nYou’re continual abuse of steroids has increased your aggression to an unnatural degree, at one point you get angry at someone in one your classmates and smash his face into a bloody fucking pulp. It takes the teacher and a couple of your classmates to keep you from killing the poor sonofabitch. Fortunately for you, since you’re so “necessary” to win the next game, you get off with just suspension from school for three days. During this time you attend a party (Your parents don’t dare try to stop you) where you hook up with some chick.\n\nYou and her start making out and then once again you start getting aggressive, she tells you to stop which only makes you angrier so you bitch slap her to the floor and start ripping her clothes off. While you attempt rape, you come across a big problem which is that the steroids have shrunk your balls and made you impotent. Now you’re even MORE pissed, so you just start beating the poor girl and blaming her for your own problems eventually breaking her neck. You aren’t done yet though, as you’re insistent on still trying to get your limp dick hard even after her body has expelled all its fluids from the “death release”. At this point some other people from the party enter the room and see this grisly sight.\n\nWhen they all shout “HOLY SHIT!” you instinctively realize you need to get the fuck out of here, so you jump out the window and land wrong twisting your ankle badly, but you pop some painkillers and start running.\n\nYou don’t get far when a cop car attempts to stop you, but when the cops get out you charge into the first one and break both of his arms before he can even draw his gun, the second cop shoots you twice, but you don’t even feel it and you grab him by the throat and rip out his larynx, then you flip the car over crushing the other cop lying on the ground in pain with broken arms.\n\nMore cops come and seeing what you’ve done they don’t take any chances and just blaze away at you with shotguns blowing big chunks of meat out of you finally putting an end to your ‘roid rage as well as your life. Fortunately you didn’t really feel anything since you were still flying on painkillers at the time.\n\nThe moral of the story?\n\nDon’t do steroids they make your nuts shrink and cause impotence. And let’s be honest, it doesn’t matter how many cops you can kill with your bare hands, you just aren’t a man if you’re unable to rape a woman, shrinky dink!\n\nAnd now you know!", "action_results": []}, {"action": "No! I'll make the team on my own! Determination is all I need!", "result": "Drugs are for losers! You saw that movie, about that guy, who had a lot of heart or something! And you saw that other movie about that other guy, who had a lot of heart or something! In fact you’ve seen A LOT of movies about “that guy, who had a lot of heart or something” you can’t remember any of their names, but if they can all do it, you certainly can!\n\nYou turn down the drugs and start training a lot harder and trying to focus on the prize. You get that fuckin’ eye of the goddamn tiger! Yeah! Ain’t nothing going to stop you! You’re gonna get on the team, become popular, and date the head cheerleader because if there’s anything you’ve learned from movies it’s that NOTHING can triumph over the human spirit!\n\nThough the better thing to have learned would’ve been that real life ain’t a fucking movie!\n\nThe next time you go to tryouts you’re so fucking cocksure that you end up not protecting yourself as much as you sure and when you get hit hard by one of your team mates you get SERIOUSLY injured.\n\nLike really bad.\n\nNo, seriously, you get really fucked up…A LOT.\n\nIn fact you’re a damn vegetable.\n\nOf course you don’t stay that way for long, as your parents aren’t religious and as such don’t feel your life is worth anything to them anymore so they authorize the doctors to pull the plug. Its kindest thing they’ve ever done for you.\n\nThe moral of the story?\n\nDon’t try out for a team that you have no business trying out for in some inane quest to be popular. All the “heart” in the world doesn’t mean shit when you got a 400 pound asshole slamming into you with the power of a small bull elephant and your own body frame is more like that of a half starved pigmy marmoset!\n\nNow the chess club? Yeah, maybe that’s not gonna get you the head cheerleader, but you probably could’ve at least gotten to third base with the asthmatic girl who drools when you kiss her!\n\nAnd now you know!", "action_results": []}]}, {"action": "Join a band! Musicians get all the girls!", "result": "Well you don’t seem to have any other talent of any kind so being a musician might be the way to go.\n\nYou decide joining band in school is out though. You need to join a REAL band, if you want to be popular. You know there’s a group of guys that THINK they’re musicians, so lacking any better ideas you head to the garage where they play horribly in their spare time.\n\n“Hey guys, I heard you need a fourth member for your band.” You shout over the noise they’re causing. The bald headed one with the sunglasses and guitar addresses you.\n\n“What? Naw man, we’ve just decided to be a three piece and I’ll be singing all the songs. It’s a lot easier to keep track of that way.” He says as he drinks a can of beer.\n“Is that beer?” you ask.\n“Huh? Yeah, you ain’t never seen one before or something?”\n“Don’t your parents care?”\n“Shit no! Zack’s Mom is fuckin’ cool! She let’s us practice here and drink all the beer we like!” a rather hyper bass player exclaims.\n“Yeah, and she’s like fuckin’ hot too! I’d seriously fuck the shit outta her!” the drummer adds.\n“Hey fuck you Jake, I told you to stop talkin’ about my Mom!”\n\n“Come on gimme a chance, I really want to be in the band!” you whine.\n“Shit, this guy sounds like that stupid bitch a month ago that blew all of us when we told her that in order to see if she could sing well, she needed to exercise her throat and tongue.” The bass play says.\n“Yeah, well we all know you’re a secret fag Ed, but we won’t be doing THAT. (Sigh) Ah fuck it, I don’t really like singing anyway, here’s our latest song lyrics let’s see what you can do.”\n\nYou’ve been given a chance to join something bigger than yourself! This is the biggest thing that’s ever occurred to you in your whole insignificant life!\n\nNow you just have to figure out a way to NOT fuck it up, which may be difficult since now you’re all nervous to the point of being paralyzed. Good thing this isn’t sex, knowing you, you probably would’ve fucking fainted when the girl unfastened her bra.", "action_results": [{"action": "Start singing", "result": "You go up to the mic and meekly start trying to “sing” over the deafening noise. It’s clear you aren’t loud enough and Zack and the others start shouting at you as they continue to play.\n\n“SING INTO THE MOTHERFUCKER MAN!”\n“YEAH, DON’T BE A GODDAMN PUSSY!”\n\nThis unique form of encouragement doesn’t make you sing any better. In fact you’re just pathetic all the way around considering that you can’t even do better than a bunch of losers who can’t play worth a shit in the first place. Finally Zack stops and begins to berate you in a more hostile manner.\n\n“Get the fuck outta here! You ain’t cool and you ain’t no musician ya fuckin’ dick!” he says pushing you.\n“Yeah well you aren’t either!” you imaginatively retort.\n\nAt this point Zack pushes you harder in the bass player’s amp where a bunch of half drunk beer cans were sitting on top of.\n\n“My beer!” he shouts as you knock all of it over and land on the floor where the deadly combination of wetness and electricity mix and electrocutes you in a spectacular fashion.\n\nThe band naturally just looks on in awe while you fry to death.\n\n“Damn, that would’ve been cool if we were playing at a party!”\n“Yeah, but now my amp is fucking trashed! Shit!”\n“Well, just save your money for a new amp instead of using it to pay for fifteen minutes with Zack’s mom.”\n“Goddamn it I told you to stop talking about my mom!”\n\nThe moral of the story?\n\nIf you aren’t “cool” to begin with, joining a rock band isn’t going to suddenly transform you to be cool. Fumbling around trying to be something you aren’t just gets you killed in freak accidents. If you’re a lame ass unhip square then excel at that. Sure you’ll live a boring humdrum life filled with equally boring people who think the “email joke of the day” is the most hilarious thing ever, but at least when you eventually blow your brains out it will be AFTER you went on a killing spree from the tedious existence, rather than the over done rock n’ roll suicide!\n\nAnd now you know!", "action_results": []}, {"action": "Drink a beer to give yourself \"confidence\"", "result": "Well if your mom’s any indication beer makes you do a whole bunch of shit you wouldn’t normally do, hell its main reason why you were even born.\n\nYou grab a beer and drink it.\n\n“Hey motherfucker, you ain’t part of the band yet! You can’t just be grabbing the damn beer like that! You better know how to wail on that fuckin’ mic!” Zack warns.\n\nOddly even after only one beer you feel somewhat less nervous. You have no problem now screaming obscenities and nonsensical words into the microphone at the top of your lungs. After a few more songs (and a few more beers) you even start making up some words yourself and some minor theatrics. Zack and the rest are pleased with your display.\n\n“Yeah, you might work out. We’re playing at a party this weekend, do some crazier shit and I think we’ll rock the fuckin’ house!”\n“Will there be (hic!) beer?”\n“Duh, of course it’s a party.”\n“Cool.”\n\nYou stumble home in a buzzed state. You’d probably get in trouble, but your own parents are currently fucking their brains out while on the sauce themselves so you manage to sneak in and avoid any lecture. For the rest of the week you become more and more acquainted with the joys of alcohol, A LOT. As it turns out, you’re one of those people that can drink and drink and not pass out right away. Guess you have Mom and Dad’s genes to thank for that. They finally came through for you.\n\nWhen you arrive to sing at the party, you immediately let the rest of the band members set up the equipment while you just drink in the meantime. By the time it’s ready to go on you’re already three sheets to the wind, and puke all over the place, but gosh darn it, that’s just part of the act! ALL the rock stars do it! At last you’re finally cool!\n\nRock stars tend to do a lot of drugs too; while at the party someone offers you a ton of unknown pills which you greedily swallow. Could be dangerous considering you don’t know what they are, you took a bunch of them AND you’ve been drinking…\n\nLater in your now drugged up and drunken state you meet some skank. In fact she’s the school skank that everyone’s fucked in one way or another (Well except YOU of course) she was impressed by how you managed to vomit in tune with the “music”, in fact she’s so impressed by you, she takes you upstairs and fucks you eight ways from Sunday. Mind you this could also be dangerous considering you didn’t use any protection and this girl probably has a snatch as sanitary as an inbred hillbilly’s outhouse in the summer during a heat wave whose owner has chronic explosive diarrhea.\n\nAfter your encounter with “Miss Friendly” you decide in your drunken state that you should probably go home, because it would be the responsible thing to do. (Nevermind the fact that you were supposed to do another set which you’ve completely forgotten about) So you get in your parent’s car that you “borrowed” and begin to drive home…\n\nOkay you DO realize how dangerous that is right?\n\nNo of course not, you’re an indestructible “rock star”.\n\nAnyway, you end up driving in the wrong direction and eventually drive into buttfuck farm country getting yourself totally lost. Speaking of buttfucking, you barely stop in time to notice a cow is in your way, at which point you get out of the car and…uh…for some odd reason, fucking that skank wasn’t enough for you…\n\nThe next day a farmer finds you passed out next to his poor defiled cow with your pants around your ankles and your dick covered in cow shit and jizz. After beating the hell out of you he takes you to the authorities.\n\nTo cut a long story shorter. You never live down the shame of fucking a cow in the ass and become the laughing stock of the town. You also get put in a mental institution where you become even more depressed when a perverse orderly molests you every night. Eventually you put yourself out of your misery by drinking bleach kept in the janitor’s closet.\n\nThe moral of the story?\n\nYeah, the rock life style is filled with alcoholism, drug abuse and irresponsible sex practices, but nobody tells you that it can lead to fucking a cow in the ass and cleaning product suicides.\n\nNot so “cool” now is it, cow fucker?\n\nAnd now you know!", "action_results": []}]}, {"action": "Join a gang! Gangstas get all the girls!", "result": "Yep, nothing cooler than being in a gang. Sellin drugs, bustin’ caps, smackin’ the hoes…\n\nNo wait; you’re a goddamn suburbanite, meaning the gangs in your “hood” are made up of a bunch of wannabe wiggers that learned everything about the “gangsta” lifestyle by watching rap videos. At best you’ll probably just be smoking pot, drinking beer and talkin’ a lot of shit. Still, it’s cooler than what you’re doing now.\n\nYou aren’t sure of how to go about this though. You know there are “gang members” in your school that you could approach, but maybe you’d have an easier time joining a gang where the people don’t actually know you.", "action_results": [{"action": "Join the gang in your school", "result": "You approach the leader of your school’s gang (Kaspa Killa and Da Ghosts) and tell him you want to join.\n\n“Whatchu mean you want to join? This ain’t no place fo’ wack ass perpatrators! Just straight up hustlas! Know what I’m sayin mothafucka?” Kaspa says getting in your face.\n“Yeah, yeah, I hear ya, but I really want to show I’m down.” You retort trying not to show weakness.\n“Oh really? Aight, we’ll see. Meet us at my house after school and we’ll see if you’re really down or not.”\n\nAfter school, you head over to Kaspa’s house where he and the rest of the Ghosts are waiting for you in his backyard. They don’t look friendly either, in fact they look like they’re going to do you bodily harm.\n\n“Aight bitch, let’s see if you can take a beat down!” Kaspa says as he advances on you with the rest.\n\nHey this is how it’s done. In order to join a gang you get beat in to show your fuckin’ heart. No time to punk out now. Time to take your beating and prove you’re down.\n\nKaspa takes the first swing at you and clocks you in the jaw causing you to fall to the ground. You spit out some blood and attempt to get up only to feel kicks to your side, stomach, and head. Any attempt to fight back is met with an increase in kicks and punches.\n\nYou think it’ll all be over soon, and you’re right in more ways than one…\n\nOne of the Ghosts gets so overzealous that he drops a very large rock on your head cracking it open. You’re barely in a state of consciousness as you begin to lose blood at a more rapid rate.\n\n“Holy shit dude! What’d you do that for?!”\n“I got carried away!”\n“Oh fuck I think you killed him!”\n“I did? Oh no! Oh shit! No! I don’t wanna go to jail!”\n“Hey I didn’t have any part of this! YOU did it!”\n“Shut up all of you! Nah, he’s still alive, but he’s probably gonna die…let’s throw him in the woods where nobody can find him and nobody say SHIT about this to anyone!” Kaspa orders.\n\nThe Ghosts take your now unconscious body and shove it in one of their cars and drive you to the woods. After finding a secluded spot they dump it and haul ass out of there. You never wake up and after a day, you die of your internal (and external) head trauma.\n\nAnd even worse you’re eaten by a wandering hungry bear that has been down his luck in finding suitable nourishment, so your body isn’t even found which would’ve lead to an investigation.\n\nThe Ghosts however gain a little more confidence in their gang status since they have now officially killed someone.\n\nThe moral the story?\n\nGetting beat up to join some stupid ass gang is one of the more idiotic concepts of the “lifestyle”. And it really doesn’t prove shit anymore considering you’re most likely going to be shooting at someone anyway. You were a damn fucktard for going along with it.\n\nIf you have to indulge in gang activity, don’t get beat in, offer to bust a cap in someone’s ass. It serves the same purpose as showing that you’re “down” and you don’t get your head kicked into mush in the process.\n\nAnd now you know!", "action_results": []}, {"action": "Join a different gang", "result": "You don’t think the guys in your school will accept you since they already now how lame you are, so you decide to join a different gang. You know of a bunch of mean looking guys who all hang out with each other a few miles from your house in a more remote area. You never really paid attention to what they’re all about, but they seem like they’re a gang, so you decide to check ‘em out.\n\nYou head over to the area where you see a bunch of vans and bikes parked outside a run down looking house. You hear partying going on and music, then as you get closer you hear the sound of a shotgun being racked.\n\n“Alright, just turn around boy. Slowly.”\n“Holy shit mister! I don’t want no trouble” you say turning around to see a fat man in overalls.\n“Yeah? Well you just might be in a whole mess of it. Whatchu doin’ here sneakin’ around on private property? You a jew?”\n“Uh, no…I just, well I passed by here once or twice before and I noticed you guys. And I was looking if I could join your gang.”\n“Join our gang? Ha ha! Shit boy! We ain’t no gang!”\n“Um, you’re not?”\n“Hell naw! Only niggers and spics have gangs! We’re an organization dedicated to the purity of the white race!”\n“Oh.”\n“Hey, your blood’s pure isn’t it? I mean you ain’t got some mud race mixed with you do ya? You ain’t no faggot are ya?”\n“Um no, and no.”\n“Well hell, come on in and meet the rest of the folks! As long as you’re white yer all right!”\n\nNot really sure of how to act, you go along with the big guy holding the shotgun. You meet lots of people, most of which have shaved heads and swastikas tattoos. There are a few women there, but everyone is definitely a white supremacist.\n\nOddly they’re also all friendly with you. In fact you think this is the only time you’ve ever been treated okay by a large group of people. One of them tells you that he thinks you just feel alienated because as a white person you’ve been fed evil Jewish propaganda to feel ashamed of yourself, but they say when the revolution comes, good white people will be able to take the country back like God intended.\n\nAgain, you’re not sure what to make of all this, but you’re so glad for acceptance that you agree to listen to more Nazi philosophy.\n\nA few months go by you’re pretty much a believer, as the head of the local American Nazi Party chapter Daniel Count manages to weave half truths, misinformation and outright lies into your willing little head which is now twisted completely into believing things like Hitler being the true messiah for the white race.\n\nYou end up getting expelled from school when you openly say that the Holocaust didn’t happen and that the Jew is using the black man as muscle to keep the white man down. Naturally your parents, as fucked up as they are, don’t approve of this sort of behavior and try to put you into therapy, but you call them race traitors and run away from home to your new skinhead buddies who embrace you with open arms where you have a great time with all of them.\n\nFinally you’ve found a place that accepts you.\n\nUnfortunately for you, this skinhead hangout has been under FBI watch for months and one day they have enough evidence to finally bust the lot of them for owning and trading illegal weapons mostly of military ordinance. You happen to be there when the shit goes down.\n\nThe FBI storm the compound which results in a violent shootout. You join in to help your fellows, but are shot in the back by an undercover FBI agent before you even get a chance to kill any of the evil Zionists.\n\nWell they might've \"Saved Hitler's Brain\" but nothing is saving your dead ass.\n\nThe moral of the story?\n\nYou joined a bunch of fuckin’ Nazis, ya dumb shit; what the fuck did you think was going to happen?\n\nEven if you’re not into the whole liberal PC shit, you should’ve remembered at least one thing…\n\nBeing a racist typically limits your pussy seeking options down to only white women (and usually only ugly white women at that) and as a hetero male, you want to ALWAYS leave those options as open as possible, not limit them.\n\nAnyway, the Nazis LOST the goddamn war, meaning you basically sided with losers; hence you were a loser, and got yourself killed ya racist fucktard!\n\nWhere’s your Hitler now? Nyaah!\n\nAnd now you know!", "action_results": []}]}, {"action": "Join a gaming group! Geeks get all the girls...um no wait...", "result": "Well at least you’re embracing the fact that you’re an uncool geek, it’s good to be true to yourself!\n\nOf course you realize you won’t be anymore popular than you are right now, in fact you’ll possibly be even LESS popular, but again at least you’ll be with liked minded folks such as yourself. Also, your chances of ever getting to even TOUCH a girl have probably decreased dramatically, but still at least you’ll have a hobby to keep yourself occupied on those dateless nights you’ll be in store for.\n\nHowever all gaming groups aren’t created equal, are you actually going to be playing games with other people in person, OR are you just going retreat into the internet world and join an online game?", "action_results": [{"action": "Well, I SHOULD have some sort of human contact...", "result": "You already have tons of D&D books and shit, time to actually put all that knowledge into practice.\n\nOn your lunch break at school you head over to the table where you see a bunch of sickly pale people playing with some figures. Unsurprisingly, there are lots of empty seats around this little group of social rejects. When you approach they look in your direction nervously like a bunch of ferrets getting ready to flee from a giant predator.\n\n“Uh hey guys, can I play?” you ask.\n\nAt first they look suspicious, but then they seem so overjoyed that somebody new is actually speaking to them that they excitedly tell you to pull up a chair. The “head geek” tells you his name is Richard and starts speaking about how you should come over to his house where you can get your character properly started, after which you and the rest can start a whole new campaign!\n\nAt last, you’ve found your niche!\n\nLater that day after school, you head over to Richard’s house excited about the fact that you actually have people to hang out with now. When you get to his house, he answers the door in a red robe; the others you met at school appear behind him dressed the same way.\n\n“Welcome, new acolyte are you ready to take a journey to the next dimension?” he asks.\n“Um, sure I guess. Why are you all dressed like that?”\n“Because, in order to embark on our new adventure we must BECOME our characters and you will too, here take this robe and feel the power it will surely give you!”\n\nYou take the red robe and put it on, but you don’t feel any different. You didn’t realize that this group was into live action role playing, but still you’re up for it. At least you’re no longer by yourself. Richard then motions you inside where upon you see his whole house is decked out in occult shit and candles lit everywhere which raises some questions.\n\n“Wow, your parents let you set up the house like this?”\n“My Mom allows me to, because she is…THE HIGH PRIESTESS OF THE RED MOON! NOW BASK IN HER GLORY AND MAKE NO NOISE UNLESS SHE COMMANDS IT!”\n\nSuddenly a woman dressed in a tight skimpy leather outfit comes down the stairs, she holds large staff in her hand. She brushes her long black hair aside and addresses you all.\n\n“I see that you all are prepared for tonight’s adventure. Good, because it will be one you won’t forget…don’t think I will go easy on you because you’re my son Richard!”\n“Of course not M…I mean High Priestess!”\n“Yes…that is the proper way to address me…mmmm.”\n\nRichard’s Mom begins to passionately kiss him on the lips, which is really freaking you out at this point, but you don’t know what to make of all it exactly, maybe its all just part of the game and you want to be a team player so you don’t say anything. Just then she notices you.\n\n“Ah you are the NEW disciple, Richard told me about.”\n\nSuddenly Richard’s Mom grabs your balls and squeezes causing you to almost yell in pain, before she puts her other hand over your mouth.\n\n“Don’t you dare scream! Don’t you DARE make a sound before your High Priestess unless I tell you to! Those are the rules! I demand silence from you, if you are to receive my gift and blessing…”\n\nAgain you comply as Richard’s Mom ceases squeezes your balls and begins stroking them instead along with your cock until it gets hard, then she gets on her knees and lifts your robe up to finish you off properly.\n\nYou can’t believe what’s going on; you never thought joining a gaming group would lead to you getting blown by a sexy MILF, granted this whole set up is really fucking weird, but at this point you don’t care! When you cum in her mouth you unleash a moan of ecstasy.\n\nWay to go dipshit, you just broke the rules.\n\nRichard’s Mom suddenly gets off her knees and spits your seamen right into your eyes, blinding you and then she kicks you to the floor.\n\n“I TOLD YOU SILENCE! You broke the rules and now your character must pay the ultimate price!”\n\nWhile you attempt to wipe your eyes, you are grabbed by Richard and the rest of the group. You attempt to struggle, but they seem to be stronger than you thought and after a couple of hits to the head by Richard’s Mom’s staff, you’re even less likely to fight back.\n\nSoon you are taken into a dark room with an altar where your are placed on top of, and Richard’s Mom makes a few nonsensical chants before plunging a dagger into your chest and sacrifices you to the Red Moon gods.\n\nAfterwards, they all have an orgy in your blood and gain one level. You on the other hand are dead, and will be unable to start a new character.\n\nThe moral of the story?\n\nFor fuck’s sake, sure you were desperate for friends, but it doesn’t matter how damn starved for socialization you are, when you see a bunch of fuckers dressed in robes looking like B-movie Satanists and one of them is making out with his own goddamn Mom, GET THE FUCK OUT OF THERE NOW. You should’ve gotten out of there as soon as you realized they were LARPers. Only fucking weird ass people get into that shit anyway.\n\nEither that or follow the fucking rules next time.\n\nAnd now you know!", "action_results": []}, {"action": "Uh...maybe I should practice my social skills online, before I move on to real people...", "result": "Still being socially inept, you decide to join one of the many online gaming groups. You figure if you fuck up in making friends, you can just change your name and pose as someone new. Ah yes the joys of animosity on the internet!\n\nFirst you go out and buy the most popular online game right now to install it on your computer and within just a few minutes you’re in a whole new virtual world! You create a basic character and set off eager to make online friends who you can play with at any time!\n\nAfter taking you elf character D’annt Felspy through the starting town, you find out that folks aren’t too friendly with you at all. You keep getting the taunts of “U STOOPID NOOB” and “U SUXXOR LOL!” It’s all very disheartening.\n\nHowever all is not lost, eventually you find some people that invite you into their clan called the “New Adventuring Mighty Brave Leaders Alliance” which you find to be an odd name, but they seem very friendly towards you so you agree to join. They say they like to recruit young newbies like yourself because they all know what its like to be persecuted for simply being who they are.\n\nAt last you think you’ve found some friends here and as luck would have it many of the members of the New Adventuring Mighty Brave Leaders Alliance seem to be chicks, and many of them seem to be flirtatious with you! You might be a big loser with the ladies in real life, but online you’re cat nip! You’re already getting two chicks, one named Jamie and another called Kelly asking you to send a picture of yourself to them, but you don’t have a scanner, so you say you’ll have to do that later.\n\nIn the meantime you also want to play the game a bit more, which is cool in itself. Thanks to your lack of a real social life you have tons of time to play the game and you begin to level your elf up very quickly. Pretty soon your character is very powerful in fact one of the MOST powerful and you’re getting a lot of respect not just from your clan, but from other players as well. When you reach level fifty, Kelly says she wants to have “teh syber secks” with you. Of course being the horny virgin you are, you jump at the chance. Your characters go into you own private castle that you acquired when you defeated the blue assed giant dragon of vomitious destruction and you proceed to type misspelled swear words to each other while masturbating with your free hand. You and Kelly do this a lot. She says she really wants to meet you in person soon. You never thought that this could ever happen. You’re popular, you’ve got friends, you’ve got power and you’ve got a girlfriend. Yeah, it’s the virtual world, but you’ll take it because you are GOD here!\n\nSadly the big crash comes to end it all, literally.\n\nWhile playing the game one day, a freak power surge fries your computer while you’re in the middle of playing! After panicking a bit, you manage to get your computer working and rebooted again. You hastily go online to check your character to see what equipment you lost since it was awhile since you saved, but unfortunately you didn’t just lose your equipment you lost your entire character. Your elf is GONE. You are devastated by this loss. Your fellow clan members sympathize with you, and say they still like you and will accept you no matter what new character you play. Kelly says she still wants to meet you in person so that she can better help you through your loss, but none of it comforts you. You identified so much with your character that you actually began to believe you WERE him and now he’s dead and you feel like you should be too.\n\nWith this last morbid thought in your mind you end up hanging yourself over your loss.\n\nOr as they say on teh internet:\n\nGAME OVER BITCH! LOL!\n\nThe moral of the story?\n\nGET OFF THE FUCKING INTERNET AND STOP TAKING SHIT ON IT SO FUCKING SERIOUSLY! It’s the goddamn virtual world for fuck’s sake.\n\nAnd by the way, you were “virtually fucking” a fat forty year old pedophile, not some hot chick. Shit, 90% of the “chicks” online are really guys anyway. That’s another lesson you probably should’ve learned, you cyber fag.\n\nAnd now you know!", "action_results": []}]}]}, {"action": "Mope about it, but don't actually do anything because that might take some effort", "result": "Oh you’re so complex and nobody understands you. Or more likely nobody even cares.\n\nIn any case you become withdrawn and start dressing in black constantly. You stay in your room a lot with the shades drawn and the lights low and don’t move too much.\n\nOnce a day your mother dusts you and leaves some food and drink by your bed.\nOnce a week your father takes your pulse to make sure you’re actually still alive.\n\nIn school you’re a little more active, (Well you DO still have to walk to class) but not much. You’re about as popular as you were before, but now you have the added bonus of being known as that “creepy guy”. Folks sometimes whisper things about you, most of them quite amusing to people other than yourself. Oddly you aren’t physically bullied, but that might be due to you being known as the creepy guy. (Because we ALL know the creepy guy is the one most likely to come to school and massacre everyone)", "action_results": [{"action": "Play up your new image because now you finally have some attention!", "result": "Ah ha, so you weren’t really depressed after all, you were just looking for attention! Way to be a manipulative little bastard. Still, whatever works right?\n\nIn playing up to your new image you begin to say really creepy shit….\n\nYou go up to a group of jocks and ask them if they ever worry about someone putting poison in their water bottles.\nYou tell a teacher you couldn’t complete your assignment on time because you’ve been having ongoing wet dreams about your Mom.\nYou go up to a group of girls and tell them that their hair smells so pretty and how you would like to cut off some of it to hang from your bedroom ceiling.\n\nAnd similar macabre stuff. You of course think all of this is incredibly funny and think yourself as being incredibly clever for coming up with this “amazing” plan for attention.\n\nYou completely succeed in your endeavor and have increased your infamy tenfold. Of course now you aren’t just the “creepy guy” you’re now the “scary ticking time bomb” People are genuinely getting afraid of you, of course there’s ALWAYS that element that thinks it’s “cool”.\n\nAs a result you start attracting like minded individuals… well not quite. Mainly because the difference between you and them is that you’re just faking for the most part, while these miscreants are genuinely fucked up in the head. Still they’re the closest thing you have to friends so you hang out with them.\n\nAll of you tend to hang out and talk about all the people you don’t like and all the minor slights you’ve perceived (Real or imagined) A lot of them start talking about how they wish they could “punish” all their “enemies”. Soon these talks begin to increase as you all play more violent video games, listen to heavy metal music and watch horror movies; all which are undoubtedly pushing you all in a more aggressive nature. Then one of your new trench coat buddies, Anthony, finally gets the motivation. He mentions how his Dad has a bunch of rifles and pistols. He then mentions how you ALL should start planning to carry out your revenge by next month.\n\nWhat started out as a cry for attention for you has developed into something else entirely. Part of you does flirt with this idea though. You mean there are a lot of people you don’t really like at school…", "action_results": [{"action": "Go ahead with the plan", "result": "Yeah! You’re going to teach all those assholes a lesson! You know how much they all talk about you behind your back! Well that’s going to stop soon! Forever!\n\nYou and your crew of outcast sociopaths begin your plan. You map out the entire school and where the exit points are, the best time of day to start, the most populated areas, etc.\n\nThe DAY soon arrives and you go over to Anthony’s house instead of going to school that morning. The gang’s all there ready to creative major mayhem, and you’re ready to join them. As you take the sub-machine gun, you’re wondering where Anthony’s parents are.\n\n“They’re lying upstairs in bed with their heads blown off, where do you think?” he remarks.\n\nYou all pile into the car with enough weaponry and ammo to take out a small army and drive to the school. You ain’t going out like those Columbine losers. You got shit more planned out than they did. You definitely have plans to escape afterwards. You can live on the run, and when you get to Mexico, you’ll be home free!\n\nOf course all your “grand plans” go to shit when you actually get there. Not that you really had things as organized like you delusionally believed anyway.\n\nFirst of all, one your buddies is so hot on killing people, he starts blasting folks as soon as he gets out of the car, meaning he ruins your advantage and now you have to go around trying to chase people down to kill them. Most of the people you REALLY wanted to kill escape and you have to settle for innocents…well nobody’s innocent in your deranged eyes, but they didn’t actually do anything to you, so some of the joy is lost.\n\nSecond of all, your other buddy who thought he was a bomb expert must’ve read the instructions wrong on the “Freedom Fighters against Zionism” website he was studying. The moment he attempts to light up one of these home made bombs he blows up his fucking arm and half of his face. He doesn’t even have time to scream out in pain before his half fried body hits the ground in a bloody mess. Still it was pretty cool though!\n\nFinally it’s just you and Anthony mowing down some of the Special Ed kids since they were too idiotic to escape in time and just panicked by running around in a circle. By this time the police have arrived and killed all your other friends, and you end up killing Anthony since you figure anyone who would kill retards is not to be trusted.\n\nYou briefly entertain the idea of killing yourself, since it’s a pretty hopeless situation you’re in. But you remember a scene from a movie where the guy shot it out with the cops and took out a shitload of them before he died and how cool that was, so you decide to do that instead.\n\nThe moment you come out of the school, a SWAT member snipes you in the head from a nearby building.\n\nThe moral of the story?\n\nYeah, being creepy and talking like a psychopath can be fun, but when you start believing your own hype you’re just being a fucktard. Seriously, what were you going to gain from killing a bunch of worthless jocks and cheerleaders? Life on the run? Being a gay porno star in Mexico to help support yourself? Yeah right, you can’t even sleep without a nightlight on! You couldn’t even do the mass killing right anyway, since you missed most of your primary targets. They’ll all go on with their lives and probably make money from the ordeal due to exploiting public sympathies and you’ll be worm food.\n\nBut you REALLY showed them all didn’t you?\n\nAnd now you know!", "action_results": []}, {"action": "Rat them out to the principal", "result": "Fuck this! You’re just faking this shit; you don’t really have the balls to actually kill anyone!\n\nYou decide to play along with your friends and claim that you’re with the plan, but rat on them out to the principal later.\n\nSadly things don’t really go as planned for you double crossing ass! The stupid ass clueless principal doesn’t entirely buy your story and thinks you’re just trying to play some sort of sick joke, in fact he thinks YOU’RE the problem and punishes you by calling up your parents and telling them he’s sending you home and that they need to put you in counseling and how they’re lucky that he’s not pressing criminal charges.\n\nYou get the riot act from your parents, who don’t want to hear your shit either. They make you get rid of all your black clothing, video games, horror movies, and the like. You spend the next week having to listen to some hippy dippy psychologist who keeps saying you’re in denial about your feelings.\n\nThe biggest fuck up about this is everyone eventually found out about this in school. Your trench coat buddies were not amused that you nearly ruined their plan, so the “day of their revenge” they make a quick trip to your house first…\n\nYour Dad was blasted on his way to his car and then Mom met the same fate when she went out to check the noise. You’re shot several times in the limbs after you were pulled out from hiding under your bed. Your former friends laugh at you as you beg for your pathetic life before they land the killing shot.\n\nThe moral of the story?\n\nDon’t be a fucking rat. Seriously, nobody respects a goddamn rat and look what it got you: dead. Seriously you were the fucktard that insisted on acting like a psychopath for attention, so you only had yourself to blame when you attracted people like that. If you really wanted to avoid trouble you could’ve just played along and then on the “day of revenge” you could’ve disappeared and hid out somewhere until it was all over. Your trench coat buddies would’ve probably thought you just wussed out (Which they’d be right) and they’d go shoot up the school anyway.\n\nPeople still would’ve died and you wouldn’t have gotten killed. A win-win situation really.\n\nAnd now you know!", "action_results": []}]}, {"action": "Sink into deep depression because nobody still \"gets\" you", "result": "You sink further into depression, you’re just SOOOOO tormented and misunderstood. Or more likely you’re a little drama queen that’s…\n\nHey, maybe THAT’S your problem! YOU KNOW what we’re talking about!\n\nYou snap out of your self-pity for a minute and think really hard of WHY you don’t fit in with everyone else, perhaps if you figure it out then maybe that can be the first steps to getting better.", "action_results": [{"action": "Well, I guess I do have some weird feelings...", "result": "You remember when you were little of how you liked to dress up in Mommy’s clothing and how you always thought her make up was pretty. You remember your Dad severely beating you after you said you wanted a Barbie doll. Oh why didn’t he just let you be who you were? You’ve had to deny yourself of your true feeling all this time. Oh it’s just so sad…\n\nTHAT’S why you’re so depressed! THAT’S why you don’t feel like you fit in! THAT’S why you longingly look at all the rest of guys in the shower room wishing that you were the bar of soap they use…\n\nBut first things first! You’ve just come to accept the fact that you’re gay. Now the really hard part begins. Are you going to proudly come out in pink colored hot pants and announce it to everyone or are you going to hide in the closet like a scared little Nancy boy?", "action_results": [{"action": "I'm coming out and reaching for that rainbow baby!", "result": "You’re going to do it; you refuse to live in the closet! You prance out of your room, skip downstairs and reveal to your parents…\n\n“I’m gay and I’m proud of it! And I don’t care what you guys think!”\n\nYour parents take awhile to acknowledge your revelation.\n\n“Gay huh? You’d think you’d have a better sense of fashion.” You Mom says sipping her coffee as she points to your drab clothing.\n“…what? I was confused! I was depressed! I was struggling with who I was!” you dramatically whine.\n“Should’ve just asked me, I could’ve told you that you were gay. Can’t say I didn’t see this one coming.” You Dad remarks not looking up from his book.\n\nYou’re almost disappointed that they aren’t making a big deal out of this.\n\n“Don’t you guys care?!”\n“Why should we? We’ve accepted the fact that we failed as parents a long time ago. This just confirms it. Personally I’m just glad you’re not moping anymore. That was getting to be really boring. If you’re going to be a pillow biter though I suggest you keep it a secret at school. They may not be as understanding of your decadent lifestyle as we are.” Your Mom says.\n“Speaking of decadence, are we still going that party tonight?” you Dad asks your Mom.\n“Yes, and remember to bring your own leash this time. Last time you caught that rash on your neck from using someone else’s.”\n\nWhile your parents relive one of their swinger parties you dejectedly go back to your room. You feel like someone’s let all the air out of your tires because you really hoping for some attention of any kind. You’re depressed all over again, except now it’s even worse because you’re gay too!", "action_results": [{"action": "Carry on with your alternative yet sinful lifestyle", "result": "Hey to hell with your parents! If they don’t love you, then you’ll find it else where! You’re a gay guy after all, finding love shouldn’t be that much of a problem. All you have to do is find another one of your kind and say “Blow me” and nine times out of ten your wish will come true! You’re gonna live it up from now on and honey is it gonna be FABULOUS!\n\nYou end up going back to school with a completely different look and attitude. People immediately notice it and you like the fact that they notice it! You’re a stereotypical flamer and if you were any gayer, Richard Simmons eating a hotdog in a Turkish prison would look straight by comparison.\n\nYou get called names every now and then, but since you end up being on such good terms with most of the popular females, the regular homophobic jock types don’t give you too bad of a time seeing as they don’t want to look too “insensitive” to their cheerleader girlfriends.\n\nThe rest of your social life improves as well since you now frequent raves a lot in the city, while taking massive amounts of XTC and indulging in LOTS of unprotected gay sex. You’re very popular inside and outside of school and at last you feel loved! Well at least temporarily. Deep down you still aren’t very happy, but of course your solution to this is to go get more love to fill up that eternal void which will never be filled.\n\nUnsurprisingly all this “love” leads you catch herpes on your mouth, gonorrhea on your dick and AIDS in your ass, you silly faggot!\n\nUltimately, people find out and abandon you like the plague carrier you are, and you eventually die a horrible lingering death.\n\nThe moral of the story?\n\nDon’t be gay, it really isn’t as cool as actors makes it look like on TV or if you MUST be gay, choose a life partner and don’t go sucking and fucking every guy you see.\n\nAnd now you know!", "action_results": []}, {"action": "Suppress your gayness and go back to being miserable", "result": "Realizing that you’re a big loser regardless of your sexual preference, you decide to suppress your gayness, since at least you won’t result in you getting beat up by the jocks on a regular basis.\n\nIn an effort to suppress who you are, you begin to over compensate and start acting like a first class macho asshole. Which would be fine, if you actually could back it up, but since deep down inside you’re really a big girl, you don’t pull it off very well. All you succeed in doing is getting beat up a lot guys who don’t like you constantly hitting their girlfriends which you aren’t even attracted to. You also end up getting beat up by the girls you’re hitting on. In fact you probably would’ve taken FEWER beatings if you’d accepted being gay!\n\nEventually, you actually manage to get one girl to fall for your poseur hetero act. Of course it’s the most pathetic one in the entire school. She’s 300 pounds, has coke bottle glasses, severe acne, braces and breathes when she talks. However, she’s all yours in your futile quest to deny your gayness.\n\nThen comes that “special night” when she’s willing to give it up for you. (Which unsurprisingly doesn’t take long) When she takes off her clothes you are completely unable to get an erection…though to be fair, even if you were straight you probably still wouldn’t be able to get it up for this massive monstrosity that should’ve been killed at birth. She attempts to blow you in an effort to get you started, but all she succeeds in doing is drawing blood due to her badly made braces.\n\nHaving had enough of this charade you push the disgusting creature off of you, put your bloody dick in your pants, and run back home, vowing that you’d rather take it up the ass than go through something like that again.\n\nAs it turns out, you get your wish, but not in the way that you might prefer…\n\nYour “girlfriend” was VERY hurt by your departure, as she thought yours was a true love that would last forever not some faggot travesty. Her demeanor changes to that of a psycho vindictive cunt, who accuses you of trying to rape her. She claims she managed to stop you, by biting you in the dick, forcing you to run away.\n\nYou protest your innocence and claim that you’re really gay, but nobody’s buying it because you were known to be sexually harassing all the girls in school, and several witnesses can attest to this. Nobody believes you and you end up going to jail where YOU get ass raped for real almost every other day by the Aryan brotherhood who make you their personal pass around prison bitch.\n\nYour torment of having an asshole the size of Texas comes to an end when you get a little mouthy with one of the Aryans who’s in no mood for your bullshit and shanks your bitch ass.\n\nThe moral of the story?\n\nDenying who you really are is a bad thing and never results in a good outcome. Be proud of who you are. Even if you’re gay, you can still live a fairly good life. You might burn in hell afterwards, but at least your time on Earth can be salvageable!\n\nAnd now you know!", "action_results": []}]}, {"action": "Hell no! My Dad would kick my limp wristed ass!", "result": "While you’ve fully accepted the fact that you’re pickle puffer, you decide it would be best if you kept this secret from not just your parents, but from everyone in general. Keeping a low profile is now more vital than ever, so you proceed with your life as usual, but a little happier, now that you’ve come to grips with who you are.\n\nHowever, you still have all those throbbing gay URGES that aren’t going to let themselves be hidden for long…\n\nA little time goes by you manage to fine tune your new gay abilities, most notably your gaydar. Surprisingly you pick up on more people than you would’ve thought, but you still have to play it safe and pick someone who isn’t going to be in denial or worse, your gaydar is off and you hit on someone who tries to kill you.\n\nEventually you manage to pick out some guy who fancies himself as an artist. He picks up on your gay vibes as well, and you two sneak off together every now and then to have a gay old time.\n\nEverything is going without any problems until he wants to come out of the fucking closet and express your forbidden love to everyone, while you want to not only stay in the closet, but also hide under the pile of dirty moth eaten clothing in there as well. You attempt to reason with him, but he throws a hissy fit and is determined to go through with his plan with or without you.\n\nBut you can’t do it, because deep down you’re secretly ashamed of who you are!\n\nYour boyfriend is also ashamed, ashamed of you that is. He immediately breaks up with you, scolding you that you both have a “duty” to the gay community to make a stand when you can and that if you can’t do that then he doesn’t see a future for the both of you.\n\nYou’d probably go home and cry like a bitch, but you’re more worried that your ex is going to “out” you. To his credit, he doesn’t, but unfortunately his “stand” doesn’t do him any good.\n\nYou see him mercilessly taunted and beaten by other guys on a practically daily basis. Sometime during these times, he sees you standing there doing nothing, you can tell in his eyes that he’s looking for you to help, but you just can’t you’re too much of a coward. Eventually he’s killed by a couple of rednecks and left in a ditch somewhere. There’s no sympathy or anything over his death, you don’t even attend his funeral for your continued fear of being outed which you still have which has only increased by your ex’s murder.\n\nThe guilt begins to consume you on top of the fear and you just can’t take it anymore. Is this what your life is going to be like? Forever sneaking around trying to cover up your sinful sexual preference? Oh sure you could eventually move away to a more gay friendly place, but you just can’t wait that long and you feel trapped…can’t breath!\n\n“AAAAARGH! I’M GAY AND I CAN’T LIVE LIKE THIS! ARRRRRGH!” you stand up and scream in the middle of class before you run and jump to your death out the window.\n\nSurprisingly your death has somewhat of an effect on the people. Oh not anything forward thinking like displaying open mindedness that could’ve prevented two deaths, but more along the lines that the students who were in your class when you killed yourself get a week off for seeing something so traumatic. Most of them go get drunk and party, but nobody’s mourning the death of some suicidal faggot.\n\nAt your barely attended funeral, your Dad doesn’t even cry out “I love my gay son!” In fact he’s asleep the whole time.\n\nThe moral of the story?\n\nPerhaps if you’d stood by your life partner, you wouldn’t have died a self-loathing coward and betrayer. That’s how Judas died you know. Oh sure MAYBE you would’ve gotten killed by the rednecks too, but at least you would’ve been taking a fucking stand. Hell, maybe you wouldn’t have gotten killed. Maybe you might’ve been able to fight them off and from that victory, other gays in the closet would’ve come out and been proud of who they were too! Then you could’ve had parade with rainbows and even a same sex prom!\n\nBut of course you’ll never know that because you didn’t stand up for yourself and died a cowardly little bitch!\n\nAnd now you know!", "action_results": []}]}, {"action": "What's the point? It's all so fucking futile anyway...", "result": "Oh geez you really are hopeless aren’t you?\n\nYou sink even further into depression. You REALLY don’t do anything anymore. Your grades drop, people don’t want to be anywhere near you in any way due to the fact that you give off such an aura of bleakness that other people get miserable just being near you. Well that, and the fact that your hygiene habits have become that of a third world street beggar dying of leprosy. Your parents at this point are getting fed up with the moping act and don’t help matters any by screaming at your practically comatose body 24/7.\n\n“UGH! It smells like shit from a dead dog’s ass up in this motherfucker!” your Mom exclaims holding her nose.\n“Goddamnit boy, get your ASS up! This shit’s getting’ old! Boy! I told you…ah fuck it, I’m not gonna even waste my time beating you, you’re a disappointment anyway! Go ahead and rot for all I care. Just leave the damn door closed.” Your Dad says before both of your parents leave in disgust.\n\nThey don’t love you. Nobody does. You wish you could escape. Maybe they’d ALL be sorry once you’re gone…", "action_results": [{"action": "Escape... temporarily", "result": "You’re too chicken shit to actually commit suicide so you decide you need to escape from your sorry existence in a more “chemical” way, namely drugs.\n\nUnfortunately you’re such a damn loser that you’re completely clueless to who’s selling the shit in school, or even your suburb. Unless you want to go down to DA HOOD, even you know that where ALL the drugs come from. Of course there are other options like household inhalants.\n\nIt’s a big wide world out there just waiting for you to find something to get fucked up on!", "action_results": [{"action": "Go buy some drugs in Da Hood", "result": "Surprisingly you manage to snap out of your perpetual funk, in order to buy drugs. Maybe they ARE the answer!\n\nYour parents are so surprised to see you leave your room, let alone the house that they don’t even question where you’re going, they’re just happy you’re going. It gives your Mom some time to fumigate your room and your Dad to fuck her doggy style on your bed.\n\nAnyway, you make your way down to Da Hood. You know you’ve arrived when you see an increase in urban blight and a bunch of black people giving you dirty looks. Speaking of which you’re still fucking clueless to where you’re supposed to get some drugs so you just ask a group of black people hanging around a basketball court. They’re all bigger than you and definitely meaner and tougher.\n\n“Drugs? Whachu’ talkin’ ‘bout white mothafucka? You some fuckin’ narc or sum shit?”\n“No, I just…”\n“He gotta be workin’ fo’ the five-O! This cracka mothafucka would have ta be crazy walkin’ down here by hisself!”\n“No, I got money for drugs! See?” you stupidly say pulling out your allowance money.\n\nThe instant you do this, the homeboys’ eyes light up and then you’re bum rushed. You first see a fist with tons of bling on it smashing into your face and then you’re looking up at several shoes frog stomp it into mush as another pair of hands goes through your pockets. Finally one of them throws a basketball at your bloody head and calls you a dumb ass white boy as you lie on the court and then they make their good escape to use your money to spend on chicken and malt liquor.\n\nYou fall unconscious and bleed to death during the night, because nobody’s going to call an ambulance for the likes of you and even if they did, it wouldn’t get there in time to save you anyway, because as we all know 911 is a fuckin’ joke. Your body is soon moved to rot in an alley when people want to play basketball again.\n\nA few days later when the cops make their once a month rounds in Da Hood to collect their extortion money, one of them finds your body and calls it in. You’re buried and forgotten without fanfare.\n\nThe moral of the story?\n\nDon’t go down to Da Hood if you’re a clueless white boy. If you wanted to buy drugs in a “poor area” you could’ve easily went to a trailer park. There are lots of nice white people there.\n\nOh and you probably shouldn’t do drugs either. Maybe.\n\nAnd now you know!", "action_results": []}, {"action": "Find something in the house", "result": "You’re still not motivated enough to leave your room, but you are motivated enough to go over to your unfinished Dungeons and Dragons diorama and sniff your modeling glue.\n\nYou undo the cap, shove the tube up your nose and inhale deeply! Whooo! What a rush!\nYou immediately start to hallucinate, and forget about all your so called problems. In fact you pretty much forget how to act altogether…\n\nYou suddenly think that you’re a magical elf who must slay the evil dragon with your mighty sword! To get better prepared for this, you strip off all your clothing and run out of your room holding your uh…”sword”.\n\nAs you go running around your house like this, you encounter a bellowing ogre!\n\n“Boy, what the fuck do you think yer doin’ running around bare ass naked?!” it yells.\n“What’s going…what the fuck?” its wife says after coming into the room.\n\nThe ogre charges at you, but you manage to dodge the attack causing him to smack his head against a table when he trips. The ogre’s wife attempts to hold you down, but in the ensuing scuffle you manage to stab her once in the mouth with your sword and then run away, while she’s recoiling from your attack. Just in time too, because the ogre is recovering.\n\n“YOU SICK FUCK, I’M KICKING YOUR ASS!” it yells.\n\nYou run back to your hideout and barricade the door, which the ogre attempts to knock down. You see no escape until you realize the window! You can use your spell of flight!\n\nYou quickly cast your spell and then open the window. Just as the Ogre breaks down the door, you make your escape to freedom!\n\nA few hours later the coroner comes by to scoop your body off the sidewalk. On the plus side, you won’t have to go through the progressively worse brain damage you would’ve undoubtedly suffered by continuing to sniff glue and other such products.\n\nThe moral of this story?\n\nSniffing inhalants might be a nice cheap high, but you can do some seriously crazy shit while under their influences. Don’t be a lazy ass. If you want to go get fucked up for cheap just raid your Dad’s liquor cabinet or get an older stranger to buy you some beer.\n\nAnd now you know!", "action_results": []}]}, {"action": "Escape... permanently", "result": "So you’ve decided to end it all.\n\nThere’s just no place in this world for you and you can’t cope with it. Only your death will make a difference. You want to get it right though, so for once in your life you’re going to be motivated to plan something out.\n\nYou continue to lay practically comatose in your room like you usually do, until your parents leave the house at night to go out swinging with the next door neighbors. They’ve long since not cared about leaving you by yourself since they figure all you’re going to do is lie in your room anyway.\n\nBut not this time.\n\nYou go to your parent’s bedroom where your Dad “hides” his fully loaded Desert Eagle. You’ve never fired it before, because your Dad didn’t think you were man enough to handle it. Well you’re man enough tonight and he’ll see that!\n\nThey’ll ALL see that!\n\nYou’ve seen enough movies where somebody kills themselves, so you do likewise and shove the gun in your mouth, pointing the barrel straight up\n\nBANG!\n\nYou successfully blow your brains out all over the wall and your body slumps lifelessly on your parent’s bed.\n\nHold on there Corky, that ain’t the end of this tale just yet…\n\nYour parent’s came home and found your dead body after a really wild night of swinging; it was a real downer for them. Your Mom got a little upset, but your Dad just muttered something about you ruining the bed and his gun.\n\nYour death didn’t really make an impact at school mainly because you weren’t anybody to begin with. There’s a brief announcement over the intercom from the principal saying that if anyone is “traumatized” by your death that they may take some time off of school and counselors will be available. Naturally several opportunists want to take advantage of the situation, but when they find out that they’d have to attend your funeral, they decide it would just be easier to just cut class the old fashioned way.\n\nEventually only your parents and few distant family members attended your funeral and that was it.\n\nA year later your Mom had a new baby to take care of and you were practically forgotten about altogether.\n\nThe moral of the story?\n\nDon’t fucking commit suicide, because nobody’s really going to miss you after you’re gone and even if they do, it’s only temporary. Shit, you didn’t even have any REAL problems except the ones you created in your own sad little head. Did you have a serious terminal disease? Did you lose your dick in a horrible lawnmower accident? NO! So you weren’t popular, big fucking deal, life sucks, you deal with it! High school is only four Goddamn years anyway for fuck’s sake, be a fucking man and tough it out!\n\nBesides suicide is a sin, so if you had hopes of having “peace” in the afterlife, think again, you’re going to be burning in hell right next to the Faggots and Muslims. Well either that or you’ll just rot in ground.\n\nStill means one thing, you died a big loser.\n\nAnd now you know!", "action_results": []}]}]}]}]}, {"action": "Female", "result": "You are a typical female teen…well maybe not entirely typical. In your current state you aren’t very popular in school. Sometimes you feel left out of things, particularly social gatherings, and boys don’t seem to notice you at all. Maybe being popular would makes things easier and make you happier, but then you also wonder if you even belong here, as you have a hard time relating to people sometimes.\n\nWell, what are YOU going to do about it?", "action_results": [null, {"action": "Mope about it, but don't actually do anything because that might take some effort", "result": "Oh you’re so complex and nobody understands you. Or more likely nobody even cares.\n\nIn any case you become withdrawn and start dressing in black constantly. You stay in your room a lot with the shades drawn and the lights low and don’t move much unless you feel the futile urge to continue to eat or go to the bathroom.\n\nIn school you’re somewhat more active (Well you DO have to walk to class) about as popular as you were before, but now you have the added bonus of being known as that “gloomy chick”. Folks sometimes whisper things about you, most of them quite amusing to people other than yourself.\n\nAll of this continues to make you feel like an outcast and only makes you feel more depressed since nobody “gets you”. You hate them! And your parents aren’t any help at all. They’re totally involved with themselves. You hate them! You hate them all!\n\nThis sort of thinking of course causes you to seek an escape for your depression, an outlet, comfort, something to make you feel better, which is probably the most motivated you’ve been in a while.", "action_results": [{"action": "Find comfort in a hobby", "result": "You realize that you’re all alone in this shitty cesspit of a world and you can’t rely on anyone else to make you happy, so you take a page from your self-centered parent’s book and decide to focus on yourself to make yourself happy.\n\nYou attempt to write dark poetry, but you suck at it. You can’t even rhyme right.\nYou attempt to play dark music, but you suck at it. You’re completely tone deaf.\nYou attempt to paint dark pictures, but you suck at it. You have no talent whatsoever.\n\nHaving failed in your hobby attempts, you begin to cry a lot wishing you were never born since you’re a great big loser. You feel so much pain and just wish you could make yourself feel better somehow.", "action_results": [{"action": "Eat, food is always there...", "result": "Sure food is always there. It never judges, it just is. And really, who have you got to be thin for anyway? Nobody. Might as well enjoy your pie.\n\nYou begin to eat at an accelerated rate, which also means your weight increases at an accelerated rate. You feel a little more satisfied at least in the short term. As it turns out though, you’re finally getting that attention from schoolmates like you originally wanted, unfortunately its now to taunt you and your girth. No longer are you the “gloomy chick” you’re now that “fat bitch who smells like cheese all the time”.\n\nOf course these taunts only make you depressed again, so you eat more, so you get fatter, so you get more taunts, which…\n\nWell as you can see this is vicious downward spiral.\n\nAt one point you are victim of a particularly cruel practical joke where some cheerleaders play keep away with your box of King Dongs. As you helplessly attempt to grab the box which is being thrown around, you get winded a lot. They’re too quick for you to grab the box from them.\n\n“Come on! Stop being so mean to me! I’m hungry!” you whine.\n“Hah! You should be thanking us fat ass, all this running will make you lose some weight, why I dare say you’ll be down to a size 98 after this! Ha ha ha!”\n\nThis statement was the last straw, you cease sobbing and you begin to get angry and you charge the anorexic cheerleading bitch who said that, like a mad hippo. She thinks you’re just going to attempt to grab the box of King Dongs so she throws them to one of her friends, but she goes into shock when you continue to smash into her small frame and don’t stop until you slam her into the wall. You succeed in crushing her rib cage and pelvis. She crumples to the ground coughing up blood and gasping for air, but you deprive her of that by sitting on her face and not getting your immense ass off her until she stops moving.\n\nHer friends are horrified by what they’ve just witnessed, and they run to go get help as you laugh in a Hutt like fashion. You just wish you had your King Dongs to celebrate. In fact you’re still hungry, and having completely lost it at this point, you begin to eat this skinny ass cheerleader.\n\nWhen the school security guards arrive they immediately see you hovering over the half eaten cheerleader like a wild animal devouring a fresh kill.\n\n“Holy shit!” one of them shouts.\n“Freeze and don’t move!” the other says pulling out his gun.\n\nYou turn around with blood all over you and a carnivorous gleam in your eye. You don’t even see danger anymore, you just see MEAT! You scream at the top of your lungs and charge the security guards. They open fire and manage to put you down before you’re able to kill again, but it took eighteen rounds to do it.\n\n“(Whew) Goddamn. We need to put a sign on this school that says no fat chicks.”\n\nThe moral of the story?\n\nEating to “cure” your depression is not a goddamn solution. You just become a big bloated sack of disgusting fat that can’t walk two steps without nearly dying of a heart attack and everyone makes fun of. So unless you’re prepared for that, have some goddamn willpower for fuck’s sake.\n\nAnd now you know!", "action_results": []}, {"action": "Maybe you could cut the pain out of yourself...", "result": "Something in your twisted little delusional mind snaps and you feel the urge to cut into yourself with a sharp instrument! What a great idea!\n\nYou go to the bathroom and grab a razor blade. You admire its shiny gleam in the florescent bathroom lighting. You sit on the toilet and slowly run your index finger across the razor until you begin to draw blood.\n\nYou feel the sting and see the blood run down your finger, but it somehow makes you feel good again. And you want to feel even better so you takes the razor again and cut into your leg just around the meaty part of your thigh. Ohhh yes, you feel so much better…\n\nYou return to school and are okay for a long time, until some asshole start harassing you in one of your classes and saying how ugly you are. You immediately run into the bathroom to cry and feel lousy about yourself. However, you now know how to make yourself feel better. You open your purse and pull out your razor again. You cut deep into the palm of your hand.\n\nThe pain makes everything better again, the blood dripping and washing down the drain is soothing. In fact you’re so much in a state of euphoria you didn’t even notice the girl in one of the stalls forcing herself to puke her guts out. After flushing the toilet and composing herself, she noticing what you are doing.\n\n“Eww, what a stupid thing to do. Fucking weirdo.” She says and leaves.\n\nYou don’t care what she says because now you’ve found a way to get rid of all the pain in your life and if this is what it takes, then so be it. At least you aren’t doing drugs, or drinking right?\n\nTime passes and you continue like this using razors, knives and even pins, but eventually you start to not feel very well. In fact you wake up one day and you can’t move your mouth. Cutting yourself with less than sterile instruments have finally given you lockjaw. You begin to panic and feel dizzy. You don’t know what else to do so you start to cut yourself again to make you feel better since it’s always worked before. However in your current dizzy/panicky state you end up cutting into a major artery and bright red blood begins to spurt out. You’d cry out for help, but you’ve got lockjaw.\n\nUltimately you fall to the floor on the bathroom floor and bleed to death.\n\nThe moral of the story?\n\nUh yeah. Cutting yourself to feel better is one of the stupider things you could’ve been doing. Seriously, what the fuck were you thinking? Out of drugs, alcohol, sex or even food, you could’ve abused to “escape pain”, you thought the best thing to go do was jamming a fucking sharp ass razor into your skin until you bled all over the place?\n\nPhysical pain is never a good thing, unless it’s some sort of S&M sex, but that’s a different story and different moral.\n\nAnd if you’re going to insist on cutting yourself, at least have the minor intelligence to keep the goddamn razor sterilized!\n\nAnd now you know!", "action_results": []}]}, {"action": "Seek attention from others", "result": "Seeking attention isn’t quite as easy as it may seem, if it was you wouldn’t be in the situation you are in now. Of course you can’t do this at school anymore in the “normal way” because you’re regarded as a big loser there which means your only hope of getting any attention there is to just start sleeping with a bunch of guys. You know of other skanky girls that do it and they seem to be alright…kinda. And it’s better than being a social misfit.\n\nOf course if you’re intent on keeping your purity, you could do what all the other losers do and hang out on the internet and seek attention there. The fact that you’re a girl will really work in your favor, regardless of what you actually look like!\n\nThen again maybe this all this attention seeking/depression/and overall fucked upness stems from the fact that you don’t get enough attention from your parents since they barely pay any mind to you. Maybe you shouldn’t do the typical teenage cry for help just to get their attention and instead directly confront them.", "action_results": [{"action": "When in doubt, put out!", "result": "So you’ve decided to go down the route of so many others before you. You’ve also decided to go down on everyone period.\n\nYour first time is a bit awkward since you’re unsure of how to go about being a slut, so you just go up to some non-descript guy and say “Hey you wanna fuck?”\n\nAt first he’s really surprised, but then he realizes he’s not dreaming so you and he go off into one of the empty classrooms and he’s finished within like two minutes. You’re more than a little disappointed.\n\n“Um, so are you like my girlfriend now or something?” the guy asks, to which you just pull up your panties, fix your dress and leave.\n\nYou go through a similar thing with three more guys that day, and they all vary in ability, but you at least get some pleasure out this. Hell, you don’t know why you didn’t do this in the first place.\n\nThe next day everyone’s heard about your escapades and while all the guys are certainly hanging after you now, you’re very surprised when some girls pull you aside in the bathroom. It’s the other school skanks. Ashley, their leader addresses you.\n\n“Hey! What the hell do you think you’re doing? You can’t just be giving it up like that and encroaching on OUR territory! Prepare for a serious beat down bitch!”\n\nNot wishing to fight, you attempt to talk your way out of it. You notice a lot of them wear some very colorful jewelry so you comment on that.\n\n“Hey, uh those are some very pretty earrings you got.”\n“What these purple polka dot ones? Got them after I blew six guys within five minutes! And this green striped bracelet? Got that for taking two dicks in the ass at the same fucking time! This jewelry ain’t just for fuckin’ show, it’s to represent! You betta recognize!”\n“Wow, I wish I had some.”\n“Ohh? So you want to join us? Maybe something can be worked out then. But I question whether you can REALLY hack it. I mean if you join us, you gotta be willingly to do shit, that you might not have ever thought about doing before, and fucking some little dicks in an empty classroom ain’t gonna cut it. You gotta be ready to do some really freaky shit.”\n“Well, I’m ready!” you say confidently.\n“Okay, we’ll see. Meet me at my house and we’ll have an initiation, and I’d save your energy for tonight. You’ll need it.”\n\nYou take Ashley’s advice and keep your legs closed today much to the chagrin of all the guys who were hoping for a quick fuck. When you get over to Ashley’s house you’re met by her, her posse and a bunch of guys. They all look much older than high school boys, probably college.\n\n“So is this one Ashley? The one that wants to be a wild party girl?” one of the guys\n“Yeah, that’s her.”\n“Yeah, I think we can show her a good time…” another one says as he grabs your ass.\n“Uh, you guys aren’t going to hurt me are you?” you say getting nervous.\n“Is this chick for real? Ha ha ha ha!”\n“Hey! You wanna be down or what bitch?” Ashley says getting in your face.\n“Okay, okay, but I just don’t wanna get raped.”\n“For fuck’s sake, Ashley, I don’t need a rape accusation from yet ANOTHER under age girl who changes her goddamn mind at the last minute! You realize how pissed off my Dad was at me after he spent all the money on high priced lawyers? Fuck this, I’m leaving. I can fuck some half drunk college girl for a lot less trouble.” One of them says and walks off.\n“Well, I’m still game!” the one still rubbing your ass says.\n\nAfter some debate and whining, you finally agree to take the four remaining guys, but only if some of the girls are there with you. One of the girls agrees since she needs to do a few extra things to pick up her spiraled turquoise necklace accomplishment. The six of you go into Ashley’s pool house and begin to get down to business. As it turns out, the guys aren’t all that rough like you thought they might be, in fact they’re downright boring. Its YOU who has to insist on different positions. Eventually after you’ve been fucked in all three holes and have cum all over your face, you also dyke it out the other girl, which gives the guys an extra bonus show and you an extra piece of jewelry!\n\nAt last you’re part of something, and “popular”. You feel so fulfilled, but of course this is only temporary. You always feel empty. Even when you got your plaid toe ring for engaging in…well it’s too long to list here, but even after you did that you still felt empty. So naturally you continue to seek attention by fucking countless strangers and not so strangers.\n\nThen comes the day when you don’t feel so empty, you realize after all this hedonistic immoral behavior that you’ve come down with a couple of venereal diseases and you’re pregnant on top of all of it. You’re more upset about being pregnant though since it’ll really put a cramp in your fucking time. You’re almost about to bite the bullet and go to your parent’s about it who never notice anything unless you address it, but Ashley tells you that she can take care of it.\n\n“Shit, we take care of our own. We can do an abortion easy, we’ve done it before; my dad’s a doctor so he’s got all kinds of medical books around. I can get you some penicillin for that gonorrhea on your lip too.”\n\nYou somewhat breathe a sigh of relief even if you are a little nervous. She tells you to meet her after school and she’ll take care of it.\n\nAfter school, you head over to Ashley’s where she shouts and tells you to come into the pool house. When you enter, you’re suddenly punched very hard in the stomach where you fall to the floor. The other girls proceed to kick the shit out of your stomach until its pretty much a given that they’ve destroyed whatever life was forming in there as you miscarry all over the floor as well as coughing up blood.\n\n“Oh shit! We should’ve done the coat hanger thing instead!’ Ashley shouts.\n“Oh Daddy why couldn’t you have just loved me?” you whimper before you die of blood loss and internal bleeding.\n\nThe moral of the story?\n\nDon’t be a goddamn fuck slut, nobody respects them and they always wind up in a bad situation. You traded away your dignity just for a few minutes of pleasure and attention and look what it got you, dead. And a dead whore isn’t mourned, since there’s always another right around the corner. (Or on the corner)\n\nBesides don’t you know that whores are often the number one target of serial killers? So even if the diseases, drug abuse and back alley abortions didn’t get you, Mr. Snuff certainly would have.\n\nAnd now you know!", "action_results": []}, {"action": "Hang out on the internet", "result": "Ah yes, the internet. Is there nothing it can’t solve?\n\nYou decide the best way to make friends and get attention is to make a MySpace profile. You put all your vital information on there and the best picture you can find of yourself on there.\n\nCongratulations you’ve just done “stupid things you can to do on the internet” number one. Way to be a cliché.\n\nYour next step is to start chatting with all the people that have suddenly made friends with you and begin giving more personal information about yourself while they all say how they have the same problems you do. At last you’ve found people you can relate to, and some of them are cute teenage boys! You can’t believe they’re all interested in you. In fact a lot of them want to know where you live so they can meet you in person. You comply; in fact you agree to met one guy calling himself Kittylover. He says he uses that name because he likes young…cats and obviously any guy into cats is a sensitive soul. Fortunately he lives only a few miles away from your town!\n\nAnd that would be “stupid things you can do on the internet” number two. At this point is it really even necessary to continue? You know this isn’t going to end well.\n\nBut anyway you invite Kittylover over while your parents are away at one of their swinger’s parties. When he comes over naturally he doesn’t look anything like his picture, but then again you didn’t use the worst picture of yourself either, so you give him the benefit of the doubt and let him in...\n\nAnyway, you and Jacob (as you find out his real name is) talk briefly before he tells you he just got his driver’s license and his parents didn’t want him driving here by himself, so they’re outside waiting in the car and he was hoping they could meet your parents as well, but you say they aren’t here.\n\n“Oh? Well can they just meet you then?”\n\nYou agree and then Jacob invites his parents in…\n\nSo anyway, you get to know Jacob’s parent’s a little better and they find that you are a fine young lady that’s good enough to go with their son. They go on about how worried they were at first that you might be some sicko, or something.\n\nAs all four of you talk, this has turned out better than you could’ve imagined, you’ve gained a new boyfriend who seems to like you a lot AND his parents like you. Sure you live a bit far from each other, but you can work that out.\n\nSuddenly your parents come home, you didn’t think they’d be back so soon, but this will be great, they can meet Jacob’s parents and…\n\n“THAT’S THE MAN WHO MOLESTED ME BACK IN BIBLE CAMP!” Jacob’s father screams in horror.\n“Huh? What? Who are you?” your Dad stutters.\n\nWhile Jacob’s father screams and cries about the sexual abuse your Dad did to him when they apparently were at Bible Camp together in the past, your Dad protests his innocence. Well actually he doesn’t, he says…\n\n“Hey, I was just trying some stuff out. I found out I liked girls better. And we were like ten years old! Shit, it was years ago and I haven’t thought about it since, get over it already.”\n“YOU SONOFABITCH!” Jacob’s father yells and tackles your Dad.\n\nWhile your dad’s wrestle on the ground, your Mom runs upstairs. Jacob’s mom just stands there screaming. You attempt to calm everyone down, but fail.\n\n“You and your family ARE a bunch of sickos!” Jacob cries and pulls away from you when you try to reason with him.\n\nSoon your mom comes down with the gun and starts yelling and unfortunately you get in the way of your Mom attempting to defend her man and catch a bullet in the head.\n\nThe moral of the story?\n\nPretty simple one actually… DON’T FUCKING MEET PEOPLE YOU MET OVER THE GODDAMN INTERNET!\n\nNothing ever good comes of it. Told you it wasn’t going to end well.\n\nAnd now you know!", "action_results": []}, {"action": "Confront your parents", "result": "Well this is a bit out of the ordinary, but it’s your choice.\n\nYou storm into your parent’s bedroom and boldly proclaim:\n\n“You guys NEVER pay any attention to me! All you care about is yourselves! Well I’m sick of it!”\n“Gah, keep it down, my head is still hurting from all the vodka I drank and coke I snorted last night. Shit.” Your dad says nursing his head. You notice that your Mom isn’t around.\n“Uh, where’s Mom?”\n“Hell, if I know, probably lying in the middle of someone’s backyard with someone’s dick in her mouth. When we get to the party, we don’t exactly stay together. The whole point of swinging is to fuck other people you know. Ah my head.”\n“Why do you guys swing anyway, do you realize how embarrassing that is to me?”\n“Agh, stop bitching at me. Shit, you sound like your mother! (Sigh) Look, I know it’s fucked up, but that’s how we do, alright? It’s what keeps our marriage together.”\n“Well if you’re so unhappy why don’t you two get divorced?”\n“Because your mother thinks she’ll burn in hell if she gets divorced…yet she doesn’t seem to have a problem with getting fucked by three strangers in one night, go figure. As for me, well I’m just plain stupid, because somewhere within me, I still desire your mother and besides she ain’t getting half of shit! I’ll kill all of us before I allow that to happen. So we swing. It’s not perfect, but it works for us...still we probably should pay more attention to you, so today’s your lucky day, I’ll spend all the time you want with you.”\n“Um, you will?”\n“Yeah, I ain't got shit else to do today except nurse this hang over, so what’s on your mind and keep your voice low.”\n\nYou didn’t exactly picture this event happening this way, but at this point you’re grateful for the attention, so you tell your Dad about all the things going on in your life, which really isn’t much since you don’t have one. However, it does make you happier and when he actually responds back, you’re absolutely overjoyed. Eventually your Mom gets home and you and your Dad cease talking for the day, he does mention how you weren’t as boring as he thought you’d be and wouldn’t mind spending more quality time with you in the future. You’re very happy.\n\nTime passes and you talk with your Dad a lot more regularly. You still don’t have any friends at school, but you don’t care you got your Dad to talk to and confide in. He buys you anything you want and you spend a lot of time together talking about a wide variety of things. One day he even passes on going to one of the swinger parties and tells your Mom she can go by herself since he promised to help you with your homework.\n\nThen just as you are completing it he asks you a serious question.\n\n“How come you’re always stuck in the books? Why don’t you date?”\n“Uh…I dunno. The boys don’t like me at school. I don’t think I’m pretty enough to date anyway.”\n“Nonsense. You’re very pretty! Hell, you look like your mother when she was young and not a complete fucking whoring bitch.”\n“You think so?”\n“Hey, I know so.” He says stroking your hair and smiling.\n“Thanks Dad.”\n\nYou then give him a big hug for his compliment. You hold each other tightly, and then you look into each other’s eyes…\n\n(Oh this is just SO fucking wrong)\n\nHe kisses you passionately on the lips, and you don’t resist. You’ve never felt this kind of closeness to anyone before so you embrace it, because it feels so right to you. He loves you in a way that nobody else ever could. Before you know it you’re going down on him and looking up for his approval as you work the shaft and tasting the very dick that once took part in creating you.\n\nBut before he explodes you want to FEEL him inside you which he’s eager to do. After all he likes giving you what you want. You feel that big cock inside your tight unspoiled pussy and the pain doesn’t even bother you, you feel so safe right now and you’ve never felt that before. You’ve never felt needed and wanted like he needs and wants you right now.\n\n“Oh god, shit yeah, UGH! Just like your mother…” he moans as he releases his seed into you.\n\nYou and he then cuddle and fall asleep in each others arms.\n\n\nWow, you realize you just got deflowered by your Dad right? Let’s see the exact repercussions of that shall we?\n\nYou and your Dad carry on this forbidden love affair for a few months until your Mom catches on. She might’ve caught on a lot sooner had she not been drunk half the time. Still even she knew exactly what was going on the day she saw your Dad fucking you on all fours while he slapped your ass taking the catch phrase “Who’s yo’ Daddy?” to a whole new level.\n\nWell as fucked up as your Mom is, even she’s not putting up with this twisted shit. In fact she sees you as a threat attempting to take her place as a younger version of herself (Which isn’t completely inaccurate) she raises all holy hell and decides that this would be a “forgivable” excuse for getting divorced, not to mention having your Dad thrown in jail. You aren’t allowed to see him at all, which fills you with sorrow. You’ve been separated from your love.\n\nWhile all this turmoil is going on, you have to live with your Mom, who is a complete bitch to you when she’s home at all and to make matters worse you’re pregnant! You can’t go to school at all now, the kids there all find out you were fucking your dad and pregnant with his child so you have to be home schooled, which basically means you’re teaching yourself. Your Mom insists that you should get an abortion, but you refuse since this will now be the only link to the man you ever loved. You’re going to raise and love this baby just like it will love you back. And you’ll definitely be a better mother.\n\nEventually nine months pass and you’re in the hospital giving birth. The pain is great, almost unbearable, but oddly short. The labor doesn’t take that long, but its far from uneventful…\n\n“Oh…my god…”\n“Holy ugly shit! I think I’m gonna be sick!”\n“The horror…the horror…”\n“What!?! What is it? What’s wrong with my baby?!” you scream.\n“Well ARRGH! MY HAND!!”\n\nThe doctor suddenly reels back from you and clutches his gloved hand, or more accurately half of it, as part of it has been bitten off. Blood is spurting everywhere as the other nurses and doctors rush to help him and that’s when you finally see your off spring crawl from your womb and on to your chest\n\nIt’s an abominable horror. It isn’t thankful for its life. Quite the contrary, it hates life and in particular the one that brought it into this world. You scream out but before anyone can help you, the abomination crawls quickly towards your face and rips out your throat with its teeth. It then escapes into the hospital ventilation shaft and eventually into the sewers where it grows larger and still stalks them to this day.\n\nThe moral of the story?\n\nUh yeah, while a positive loving father figure should play a part in a young girl’s life, it probably shouldn’t be taken to that level. Remember, incest is everyone’s problem when murderous mutant babies are born.\n\nTo sum up, never ever fuck your family members, unless you use protection. Then I guess its okay.\n\nErm, maybe not. Just stick to oral.\n\nAnd now you know!", "action_results": []}]}]}]}]}