{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=52961", "context": "", "first_story_block": "I don't know what it is with me and zombie games, I just love them. A while back, I wrote a story called No Man's Land. It did a lot better than I expected, prompting me to try again. So here it is: Ultraoverlord Strikes Again, Zombie Style.\n\n\nA NOTE ABOUT THE GAME:\n\n\nThe structure of this story is kind of a new one I'm experimenting with. There is only one 'win' scenario, the rest are deaths. Now, given that, there a few different ways to get there. Different choices can get you there in different states of health, with different supplies, and different people. I made this with as much replayability as possible, and there are references to characters in each storyline sprinkled throughout other storylines. See if you can find them all! ", "action_results": [{"action": "Start", "result": "You watch as the coffee slowly filters out of the machine, and into your mug. After it's finished, you pick it up and take a sip. Perfect.\n\n\nLife in the apartment isn't easy. You and your wife don't have enough money for a house yet, and you don't have any kids, so an apartment seemed like the best choice. You have a few commodities; a microwave, a TV, and a coffee maker. You do your own dishes and drive to the laundromat to wash clothes, but you're still content.\n\n\nYou sit on your beater couch and drink more coffee. Your wife isn't even awake yet. You wake up an hour before her every morning. The quiet is nice. It gives you time to think. You think about what you'll have to do today. Today is Sunday, chore day. You're pretty sure it's your turn to wash the dishes. You put your mug down and get up. Better to get the dishes done now than put it off.\n\n\nJust before you start the disposal, a sharp beeping noise startles you. It came from the TV, but nobody turned it on. You peek into the living room, and see the TV screen. It has flashing images and warnings on it. There's a national security threat. Worried, you turn up the TV's volume and listen in. Your wife, woken up by the beeping, slowly wanders in.\n\n\n\"What's going on?\" she sleepily asks. Before you can answer, a robotic voice blasts through the speakers.\n\n\n\"ATTENTION U.S. CITIZENS. AN ACT OF TERRORISM HAS RESULTED IN A DEADLY INFECTION IN THE FOLLOWING STATES: TEXAS, TENNESSEE, OKLAHOMA, KANSAS...\" the list goes on. You don't hear California, your state. You're still safe, for now. You and your wife watch as the TV cuts to live news footage. A woman stands in a demilitarized zone, with heavy fencing, and military personnel everywhere. The newslady announces that unaffected states have set up border guards to prevent the spread of disease. Forces from other parts of the world are also rushing in, with Mexican and Canadian soldiers struggling to keep the infection inside the U.S.\n\n\nThe TV then cuts to a live shot of sick people. They aren't slow, or drowsy, like when you have the flu. No, they're the exact opposite. They're ravenous. They stumble around a a speedwalk pace, and they look dead. Bloods soaks their clothes. Their eyes are glazed over. Suddenly, a deer bounds into view. You watch in horror as the infected surround and kill the deer. The footage immediately cuts away.\n\n\nYou wife begins to panic. You try to console her, reminding her that the whole world is fighting to keep the monsters at bay, and that you two will be just fine. Sacramento is a long ways away from California's border. Perfectly safe. Perfectly safe. You're perfectly safe.\n\n\nSuddenly, the TV makes an announcement: \"ALL MALES OVER THE AGE OF 18 ARE REQUIRED TO LOCATE THE NEAREST OUTPOST AND CONTRIBUTE TO HOLDING THE LINE.\"\n\n\n ", "action_results": [{"action": "Go to the border", "result": "Panic sets in for you. You're supposed to stay, to help your wife, to be safe. You can't accept this. But you have to. \n\n\nYou pack everything you can think of: Clothes, food, water, towels, a book. Everything you have room for. You don't own any guns, and the knives in the kitchen seem useless against these predators. Even after loading up, your backpack still feels light.\n\n\nYou say goodbye to your wife, once, twice, three times, and it still hurts to leave. It feels unreal, like a dream, riding the elevator down, hailing a cab, and telling the driver to take you to your own funeral.\n\n\nThe trip takes about three hours. There are a lot of males over the age of 18 in California. When you get out of your cab, you are greeted by a steely man wearing a full set of bulletbroof armor. He orders you to follow him, and shows you to a barrack.\n\n\n\"This is your new home for the time being,\" he says in a gruff voice. The room is full of hammocks. Each one has a table and a storage unit next to it. You select the cleanest-looking one and put your stuff down. \"How long is the time being?\" you ask. The man looks at you. \"Until this all blows over.\"\n\n\nThe next thing you know, you are kneeling in front of a human-shaped target, with an assault rifle in your hands. \n\n\n\"The first rule of operating a weapon is to never have your finger on the trigger unless the barrel is aimed at your target,\" the instructor says. All these military people look so similar, you could swear this was the same guy who showed you to your hammock.\n\n\nAfter you're shown the proper way to fire the monster in your hands, you are ordered to take a shot. You aim directly for the target's chest, and open fire.\n\n\nYou are successful only in breaking the cardboard hand off the target. Your shoulder aches from the recoil. \"Don't get discouraged, you'll get the hang of it.\" the man doesn't really seem to care about you in particular. You pause to look down the row of trainees. They are all just random people with expressions of fear or pain on their faces. As you look at their weapons, you conclude there must somehow be a gun shortage. Three of the trainees are using BB guns.\n\n\nAfter three rigorous days of training, you're almost dead. Your shoulder is in immense pain. You want desperately to call your wife, but any and all electronic devices were confiscated, 'for security reasons.' You hate this. You just want to be back home. You just want things to go back to how they were...\n\n\nYou are suddenly called up, along with all the other recruits, to grab your guns and march to the battlefield.", "action_results": [{"action": "The Battlefield", "result": "You are down on one knee, behind a metal wall. There is a hole, just big enough for you to see and shoot out of in front of you. Ahead is a grassy field. The trees were cleared in anticipation of the dead. All to your left and right, a line of hardened soldiers mixed with scared civilians stands ready to fire, as soon as the signal is given. Your heart is pounding in your chest.\n\n\nSuddenly, the line of trees is broken by a small pack of the dead. Before you can react, a machine gun takes out the whole horde. After that, it's a steady stream. The infected march through the trees, only to get shot down once in full view. All around you, gunshots ring, commands are yelled, and the groans of the dead get louder and louder. \n\n\nYou succeed in taking down a few zombies. Most of the time, as soon as you set your sights on one, someone else kills it. You try to calm your nerves and pretend it's just a game or something. Point and shoot. Simple as that.\n\n\nAfter about an hour, the undead conga line shows no signs of stopping. The commander is just about to give the order to pause and reload when his walkie-talkie begins to crackle. He answers, and proceeds to shout to his colleagues that a large section of the blockade down south just broke. Hundreds are already dead and the zombies have made it to civilian territory. Instantly, your mind flashes to your wife. You can't let her die.\n\n\nYou pull away from your post and address the commander. \"I have to go,\" you say.\n\n\n\"Absolutely not,\" the man responds.\n\n\n\"Please,\" you beg. \"My wife, I have to-\" the man cuts you off. \"Teams have already been sent out to round up women and children. They're being taken up to Washington. It's more safe there. Don't worry about your wife,\" he says. You catch a tone of uncertainty in his voice. Suddenly, another soldier shouts. You look over the wall and see that you won't make it. The zombies and advancing faster than they're being taken down. You look back at the soldier. He can see it too.\n\n\n\"RETREAT! RETREAT!\" you hear as you run for your life. Behind you, you can hear screaming. You drop your gun, it's only weighing you down, and you aren't very good at using it anyway. Retreat, you hear as you run up to the gates. Retreat, you hear as you hastily get in an abandoned car. Retreat, you hear over the deafening sound of the metal walls collapsing.", "action_results": [{"action": "retreat...", "result": "You speed away from the military zone. The terrain slowly morphs back into city. But it's all empty. Nobody is around, and it seems like the power grid is gone. But that doesn't matter. If everyone's gone, that means the military evacuated them, and that means your wife is safe. Now you just need to worry about you. As you drive on, you see a sign declaring that you have 80 miles until you reach Sacramento. That's no problem. You have a head start on the dead, and a car.\n\n\nJust as you pass under a bridge, you hear a loud pop noise. Just as you feared, your tire popped on shards of glass. You look around. Actually, this whole road is covered with an even layer of glass shards. Thank goodness you're wearing shoes.\n\n\nThe car is useless now, as all four tires are popped. You couldn't even push it forward, because the traffic up ahead is deadly. The streets are full of abandoned cars, some with their lights on, some with doors still open. You don't know how long you have before the dead catch up with you. You look around and hastily make a choice.", "action_results": [{"action": "Get food", "result": "Food is always the top priority. If you're going to survive, you'll need food. Period. You look around. Nothing is in the immediate vicinity, so you'll have to do some exploring. You head toward the traffic jam up ahead.\n\n\nAs you weave your way through the cars, you notice something odd. A lot of the windows are smashed, and there's blood on the inside and outside of most of the cars. The military wouldn't do something like that. A thought crosses your mind: You left a while after hearing that a southern wall fell. The zed could have already been here, which means you're already too late.\n\n\nYou pick up the pace, dodging cars and debris. As you pass an SUV, a zombie pops out of one of the windows and swipes at you. They were definitely here. You break into a run past all the cars.\n\n\nAfter finding clear roads again, you spot a road sign. It advertises hotels and shops, and tells where they are. You see a supermarket that's very close. You set off to find it, and hope that it wasn't picked clean.\n\n\nAfter navigating the roads, you see the supermarket. Unfortunately, a fair amount of zombies surround it. You watch to see if there's any way to slip through, but the zombies all wander aimlessly and block the entrances. Besides, even if you got in, you wouldn't be able to get out.\n\n\nJust as you are about to give up, a boy, no older than sixteen, goes running into the market. He must have been watching, just like you. But unlike you, he found a way in. He dodges the zombies and makes it to the doors without ever touching one of them. A minute goes by, and the boy comes up onto the roof with a bag of food in his hand.\n\n\nYou and the boy realize at the same time that getting out won't be so easy. There's nothing to jump on top of, and the zombies were drawn by the noise. They've surrounded the building, and are starting to climb the dumpsters and cars onto the roof.", "action_results": [{"action": "Help the boy", "result": "You decide that the boy is worth saving. If he can run like that, he'll be useful to you as a partner. The only question is, how do you go about saving him?\n\n\nYou know they're distracted by noise, so you start there. You see a truck on the opposite side of the road. It could work. You run over and see if the truck is operational. To your surprise, it's in almost perfect condition. However, when you try the door, you find out it's locked. You look back at the store. The boy is running out of time. In a moment of panic, you slam the car window with your elbow. This shatters the window and sets off the car alarm.\n\n\nThe boy is as startled as you are. As for the zombies, you delayed them. About half the group splits away from the store and targets you. You realize this is a big mistake. You didn't stop the zombies on the roof, and now you have a sizable herd following you. You turn to run an abandon the boy, when you see that he made it. The small lapse in attention for the zombies let the boy jump off the roof. He hits the ground and sprints off into the trees. Instinctively, you follow him.", "action_results": [{"action": "follow him", "result": "You can barely maneuver around the horde. You manage to escape and follow the boy. He's definitely a better runner than you, but you can keep him in your sights. He doesn't go far before entering a large storage warehouse from the back door. You know the boy saw you, so you continue forward.\n\n\nWhen you reach the warehouse, you peek through one of the industrial windows. To your surprise, there are three people in the warehouse. The boy, a girl roughly his age, and another woman, presumably their mother. You watch as the boy unpacks the food bag. He was able to fit a surprising amount of food into the bag. The girl picks it up and adds it to a large pile of canned goods in the corner. The three begin to talk, and then the boy turns and looks directly at you.\n\n\nYou panic and duck. They probably think you're a creep now, or worse. Your best bet is to get away from the warehouse. You get down on all fours, and make it a few feet before you hear the boy behind you.\n\n\n\"What are you doing?\" he demands. You turn around. The boy has a Glock pointed right at your forehead. As soon as you turn, the boy's expression changes. \"Oh. You're the guy the broke that truck window, aren't you? You want a reward or something?\"", "action_results": [{"action": "yes", "result": "Getting a reward is reasonable for saving this boy's life. \"Yes,\" you say. The boy rolls his eyes. \"Great,\" he says. \"Come inside.\"\n\n\nThe boy leads you inside. The woman stands defensively between you and the girl. \"Mikey, who is this?\" the woman says. Mikey doesn't reply. He walks over to the food supply, picks up a can of peaches, and throws it, more at you than to you. You catch the can and examine it.\n\n\n\"Where are you from?\" the girl asks, before her mother shushes her. You answer anyway. \"I'm from Sacramento. I was out fighting for the border, but it collapsed. Now I'm here. I don't have any supplies, or a home, and I don't know if my wife is alive.\"\n\n\nThe woman seems genuinely sorry for you, but Mikey isn't convinced. \"Thanks for the sob story,\" he says. \"Now leave.\"\n\n\nThe mother shoots him a scolding look, before addressing you again. \"Feel free to stay here a few nights. You can have some of our food, providing you're willing to help out.\"\n\n\nThat sounds like more than a fair deal to you. You accept, then sit down against one of the walls. \"Oh,\" the woman suddenly says. \"How rude of me. I should introduce myself. I'm Barbara, and this is Megan,\" the woman motions to the girl, \"and this is-\" Mikey cuts off his mother. \"I'm Mikey.\"\n\n\n\"Well, what should I do?\" you ask. \"Oh, we're just waiting around right now. The sun will set soon, and Mikey just brought more food, so we'll be fine. Feel free to get a book, or something to entertain yourself. Mikey, will you roll our guest an air mattress?\" Barbara says. Mikey shoots a dirty look to his mom, then you, before dragging an air mattress out from one of the units and dropping it on the ground.", "action_results": [{"action": "Settle in", "result": "You read a book from the pile, then pace around the warehouse, examining everything. The warehouse is big enough for 1000 people to stand shoulder to shoulder in it. There are a few storage units within the warehouse that the family is using for backup. You note that the only gun in the warehouse is in Mikey's possession. Each family member seems to have a sort of 'cubby' for personal stuff.\n\n\nHours pass, and nighttime is upon you. You watch out the window. A few lone zombies wander across the roads. The warehouse is actually quite hidden by trees, so you feel safer. \"Okay,\" Barbara says.\"Bedtime. We'll need our strength for tomorrow.\" \n\n\nYou start to go over to your air mattress. \"Oh, not you,\" she says. \"I just mean the kids. They need all the energy they can get. As soon as they sun goes down, so do they!\"\n\n\nBarbara pulls a Sudoku book from the pile and starts to entertain herself. You sit on your air mattress and decide what to do. ", "action_results": [{"action": "talk to Barbara", "result": "You go sit next to Barbara and watch her play a Sudoku game for a few minutes. \"How did you end up here?\" you finally ask.\n\n\nBarbara explains that her husband was also drafted, so she took her kids to somewhere safe. When they happened upon the warehouse, it was abandoned and empty, but also out of the way of the dead. The perfect base. \"I'm sorry your first impression with the kids wasn't that great. Megan can be shy, and Mikey gets worked up easily, but they'll warm up to you. Say, did you see my husband? His name is David, he has brown, curly hair, and he wears a necklace with him all the time.\"\n\n\nYou try to picture him in your head, but you can't. \"Nope, didn't see him.\" Barbara seems disappointed. \"But I'm sure he's fine,\" you say, a little too quickly. \"Most of the civilians and soldiers were evacuated when the walls fell.\"\n\n\n ", "action_results": [{"action": "go to sleep", "result": "After fully inflating the air mattress, you decide to get some sleep. As you lay there, you think about the day. So much happened. Last night, you were in some military barrack hammock with ten other strangers, and now you're in a warehouse on an air mattress. You make one last promise to yourself before nodding off: you will find your wife.", "action_results": [{"action": "In the Morning", "result": "When you wake up, everyone else is already up. Megan is setting up a breakfast of canned fruit, Barbara is rolling up the air mattresses, and Mikey is nowhere to be found. \n\n\nYou sit up and do your best to fix your hair with your hands. You probably smell terrible, but whatever. Megan puts a plate of dried cranberries and an apple in your lap. You thank her, and eat quickly. You haven't eaten since yesterday afternoon, back at the barracks. After breakfast, you stand up and decide what to do with the day.", "action_results": [{"action": "Supply Run", "result": "The warehouse has very little in the way of weaponry. If you're going to survive, you'll need weapons. You tell Barbara that you're going on a run, and leave the warehouse. You take a backpack with some meager supplies.\n\n\nThe zombies have mostly cleared out. That works to your benefit, since you have only your fists for protection. You don't know this area very well, so you head in a random direction, remembering street names as you pass them.\n\n\nEventually, you come upon a tank in the middle of the road. The hatch is still open, and blood is splattered on the side. You climb inside. After searching the tank, you come up with a walkie-talkie and a water bottle. You try the walkie-talkie, and every channel is silent on the other end. You decide to leave it in the tank so you know where it is if you need it.\n\n\nAs for the tank itself, you've never seen the inside of one before, so you don't know if it's operational or not. You decide to not touch anything, and exit the tank.\n\n\nYou are disappointed at the lack of supplies in the tank. Shouldn't there be some rocket launcher, or at least a flare gun? You are very disappointed. So disappointed, in fact, that you almost miss the man running from a horde of the dead out of the corner of your eye.\n\n\nYou turn to look - it seems like you've found the owner of the tank. The man is clearly a soldier, he is dressed in all camo, and has a large, scary-looking gun over his shoulder. Closer inspection reveals that the gun has no clip, and therefore no ammo. The man swears and looks back at the herd, causing him to trip over a fire hydrant.\n\n\nYou feel like you should help, but you don't want to get in this man's way, and besides, what could you do? You're defenseless. You watch as the man pulls out a knife and starts to hack away at the group of zombies. Unfortunately, he quickly falls. You've never seen them infect someone, and it's not a pretty sight. The man's screams soon die down. After another few minutes, the horde wanders away from the man.\n\n\nAfter they're a safe distance away, you inspect the corpse. Bite wounds cover the man's arms and torso. You don't know how long you have until he turns, so you move quickly. You take the gun off of him and check his pockets. He definitely was out of ammo. You also get his knife out of his hand. It's a durable, large knife, one that should have a holster or some sort of container. If it did, the man doesn't have it.\n\n\nYou come back to the warehouse with your finds. It's not a lot, but it's something. When you ge there, Mikey is also back. He succeeded in getting more food. You set the gun off to the side, and pocket the knife for yourself. Barbara notes your findings, and puts the gun in a storage unit. \"So the kids don't get at it,\" she explains.", "action_results": [{"action": "Dinner", "result": "Dinner consists of canned meat and bread. The four of you eat in silence. Today was certainly a productive day. You sit and think about the next day.\n\n\nThe silence is broken by someone pounding on the back door of the warehouse. You sit up. Everyone glances around nervously. Finally, Mikey gets up and looks through the window.\n\n\n\"It's just a zombie, I got...\" Mikey trails off. You get up and look through the window.\n\n\nA hundred. No, a thousand. The streets are filled with zed. A small pack have found their way to the warehouse. \"We can't risk killing them,\" you say. \"Opening the door would be a bad idea. We need to hide, and be quiet.\"\n\n\nMegan hurriedly blows out the candles you used for light. You hide behind a storage locker, while everyone finds a quiet place. The inside of the warehouse is silent. From the outside, you can hear moaning and pounding. The small pack is attracting more zombies.\n\n\n\"This isn't going to work,\" Mikey says. \"We need a better plan.\" You hurriedly think of a way out of this. \"We need to distract them,\" you say. \"Is there a way onto the roof?\"", "action_results": [{"action": "The Roof", "result": "You climb up onto the roof using a ladder, and taking out the skylight. The roof is curved, so keeping your balance is a struggle. You look out into the sea of the dead. It doesn't look as big from here, but it's still too many. There's no chance of distracting them. Unless, somehow, you could sneak through them.\n\n\nYou climb back down the ladder. \"There's no way through that,\" you say. \"We're surrounded.\" Mikey walks over to the door. \"I bet I could get through,\" he says. You open your mouth to stop him, but Barbara beats you to it. \"Absolutely not. You won't be able to run through that, no matter how fast you think you are.\"\n\n\nPanic begins to set in. The walls feel much closer than they are. The groans get louder. There really is no way out of this.\n\n\nSuddenly, gunshots rip through the air. You watch through the window as the horde of zed quickly hit the ground like dominoes. In a matter of seconds, the road is clear. You rush outside to see who, or what, killed the zombies.\n\n\nParked on the road is a large passenger bus and a big rig. Several men armed with various types of guns are set out the bus windows. They killed all the zombies. The door to the big rig opens, and a man steps out. He wears a bright orange vest over a bomber jacket, and wields a machine gun in his hands.\n\n\n\"Hi, folks,\" he begins with a creepy smile.", "action_results": [{"action": "attack him", "result": "Without hesitation, you tackle the man. The machine gun flies from his hands. As soon as you hit the ground, three bullets from three different guns hit you in the side. You topple over in pain, and the man gets up. \n\n\n\"Well, that wasn't very wise, now was it?\" he taunts, before kicking you in the face. The pain in your nose makes you see flashes of light that aren't there. You lay on the ground, motionless, while the man laughs. Eventually, you finally bleed out.", "action_results": [{"action": "Reset Game", "result": "I don't know what it is with me and zombie games, I just love them. A while back, I wrote a story called No Man's Land. It did a lot better than I expected, prompting me to try again. So here it is: Ultraoverlord Strikes Again, Zombie Style.\n\n\nA NOTE ABOUT THE GAME:\n\n\nThe structure of this story is kind of a new one I'm experimenting with. There is only one 'win' scenario, the rest are deaths. Now, given that, there a few different ways to get there. Different choices can get you there in different states of health, with different supplies, and different people. I made this with as much replayability as possible, and there are references to characters in each storyline sprinkled throughout other storylines. See if you can find them all! ", "action_results": [null]}]}, {"action": "Let him continue", "result": "\"Well, it seems to me that your lives were just in some very serious danger,\" the man continues. \"Luckily, me and my people were just driving by. We just saved you from certain death. No need to thank us. All I ask is just a little something in return,\" the man says in a cutesy voice. \"You wouldn't want to upset me, now, would you?\"", "action_results": [{"action": "Offer gun", "result": "You go back inside and get the gun out of the storage unit. You take it outside and offer it to the man. He rips it out of your hands. \"Wow,\" he says after examining it. \"One damn gun, and it doesn't even have ammunition?\" he looks at you, faking confusion. \"You're gonna have to give us a little more than this.\"\n\n\n\"We don't have anything else,\" Mikey says behind you. You turn around to shush him, but the man stops you. \"I don't believe that. In fact, I can see something right now that you could give us.\" The man points to the warehouse. \"Me and the boys have been on the road for a long while, and we could really use a rest. Now, how about you fix us some dinner, yeah?\"", "action_results": [{"action": "refuse", "result": "\"No,\" you say. \"It's already more than we can afford to give you the gun, so I'm not going to allow that.\" You watch the man's expression. He lets out a small laugh, and looks at the ground. Then he suddenly grabs you by the shirt collar and leans in so close you can smell the cigarettes on his breath. \"I think,\" he whispers, \"that you may want to reconsider that.\"", "action_results": [{"action": "Reconsider", "result": "Reluctantly, you step aside and show the man the door. He smiles at you, and steps inside. Slowly, his men file out of the bus and follow him.\n\n\nInside, the man turns and looks around. He lets out a small whistle. \"This is quite the place you have here, isn't it?\" he says. \"Now, make with the dinner.\"\n\n\nYou and Megan hastily prepare canned vegetable soup for your guests, while Mikey and Barbara make them chairs to sit on. When you are done, you give each man a bowl of vegetable soup and a small cup of water.\n\n\n\"What's the matter?\" the man says. \"You didn't make any for yourselves. Won't you dine with us?\" \n\n\n\"There's no more. You're already eating half of our food,\" you say. The man raises his hands. \"Forgive me for more rudeness. Here, you can have mine.\" He slides he bowl of soup over to you, and throws the spoon at you. \"Please, sit.\"\n\n\nEveryone eats dinner in silence. Barbara sits with her kids off to the side. None of the men make eye contact with you, except for the leader, who smiles at you. Finally, the bowls are empty. Megan hurriedly collects them and throws them away.\n\n\n\"Wow. Now, I don't believe for a second that the gun you gave us is the only gun you have. There's gotta be more, right? So are you going to give it to me, or will I have to take it?\" You notice Mikey grabbing at his gun, holstered on his belt.\n\n\n\"Yeah. That boy has a gun,\" you say. Mikey gives you a look full of hate. \"Well,\" the man says. He gets up and walks over to Mikey. He puts his hand out. \"Give it to me.\"\n\n\nMikey dumps the gun into the man's hand. \"Thanks,\" he says. \"I really do appreciate it.\"\n\n\nBack outside, the man addresses you once more. \"That was a wonderful gesture, yes it was. Now, I think you've got quite the setup here,\" the man motions to the warehouse, the road, and the trees. \"In fact, I love it so much, that I think we just might have to come back someday.\" The man's smile disappears. \"You'll still be here, right?\"\n\n\n\"Y-yes,\" you say, and curse yourself for stuttering. The man pats you on the shoulder, a little too hard. \"Great. See you soon.\" With that, the man gets back into the big rig, spits onto the ground, and drives off.\n\n\n ", "action_results": [{"action": "What now?", "result": "The four of you sit on the ground in the warehouse. Mikey finally speaks. \"What are we gonna do about this?\" \n\n\n\"We can't do anything,\" you say. \"They already left.\" \n\n\n\"I'm talking about next time. He said he's coming back. Let's be ready for him.\" \n\n\n\"Actually,\" Barbara interrupts, \"I think the best thing to do now is leave. He can't find us again, if we go deeper into the city. The big truck won't be easy to drive in the city streets. They're full of bodies and abandoned cars.\" It seems like the decision is left up to you: stay and fight, or find a new home.", "action_results": [{"action": "Find a new home", "result": "\"We should leave,\" you say. \"We don't have numbers or weapons on our side.\" Everyone seems to agree, even though they don't like it. Since it's getting dark, you decide to leave in the morning. You lay down on your air mattress and try to get some sleep.\n\n\nIn the morning, you begin packing. You are about halfway through the food when you realize that you don't have a vehicle. There's no way the four of you can carry all the food and water, plus the extra. You'll need to go look for something.\n\n\nIt's not as easy as finding any car. You need one that can seat four people, plus all the supplies. As you walk down the road, you see a billboard for a used car dealership. Perfect.\n\n\nAfter a while, you spot the car dealership. The entire area is clear of zed, which means the trip back will be easy. You start your trip over to the dealership when you see something written in marker on a store window:\n\n\nGOT GUNS?\n\nWE GIVE FOOD, JEWELRY, AMMUNITION, GASOLINE\n\n\n\n\n \n\n ", "action_results": [{"action": "You don't have anything you want to trade right now", "result": "You walk past the ad. You just don't have anything you're willing to give up, not yet. You make your way over to the dealership.\n\n\nMost of the cars are gone, but you expected that. You do have three choices: A pickup truck, a minivan with a trailer attached to it, and a convertible. The choice is quite obvious for your needs.\n\n\nLuckily, the minivan door is unlocked, and the keys are on the dashboard. You check the fuel gauge - you have a full tank. You thank your lucky stars and drive the minivan and the trailer back to the warehouse.", "action_results": [{"action": "Take off", "result": "When you get back, the others have already gathered everything up. You load the group's belongings into the trailer, and then everyone gets into the minivan. Megan seems sad to leave the warehouse. Barbara doesn't seem too emotionally attached to it. Mikey's expression is difficult to read.\n\n\nYou head up the road, looking for a place to go. Cars and debris block most roads, so your options are limited. All you need is a shelter big enough to support the group of four, and hidden well enough that you won't have to deal with Big Rig, or anyone else.\n\n\nFinally, you decide to pull away from the major city roads and go out into the countryside. There, you find a nature center. It's perfect for the group. It's big, secluded, and even has a natural river running next to it, a potential water source.\n\n\nThe group unpacks and begins to get comfortable in their new home. This seems like an upgrade from the warehouse. The are two floors, and a lot of easily accessible windows.", "action_results": [{"action": "What now?", "result": "The most obvious thing to do is explore the new terrain. If there's some sort of supply cache or other survivors nearby, you need to know about it. \"Nobody goes alone this time,\" you say. \"I'll be going. Mikey, we can use you, too. Barbara, Megan, do you want to come?\"\n\n\nMegan slowly nods, and paces over to you. \"I'll hold down the fort while y'all are gone,\" she says. You nod, and start setting up a pack. You bring a flashlight, clothes, water and food. Megan brings along a poetry book, and Mikey is traveling light.\n\n\nOnce outside, you get a good look at your surroundings. A dirt road connects you back to civilization. Then there's the woods beyond the nature center. You are deciding the best course of action, when Mikey speaks up. \"I'll go into the woods alone, and look for stuff. You and Megan go that way.\" Before you have a chance to respond, Mikey is off.", "action_results": [{"action": "Into The City", "result": "Megan follows you along the dirt road, until you see buildings again. Most of them are useless, like hair salons, and the ones that could be potentially useful, like gas stations, have been looted. You are about to turn back when you see a gun store up ahead.\n\n\nYou and Megan race over to it, as if it will disappear if you aren't fast enough. The store has a small group of zed inside, and the front window was smashed with a cinder block, but you can see guns hung up on the walls. \"We need to get in there,\" you whisper to Megan. She nods.\n\n\nBoth of you split up to find a good makeshift weapon. A board, a hammer, a pipe - anything will work. The nearest building to you is a flower shop. The front window is smashed, just like the gun shop. Why would someone bother to break into a flower shop? It's the least of your worries, because you get a large glass shard out of it. You wrap your shirt sleeve around it for better grip and come back to the gun shop.\n\n\nMegan returns with a long, flat wooden board a few moments later. \"Ok, you go in, grab as many guns as you can, and get out. Okay?\" you say. Megan nods. You position yourself in front of the broken window and whistle. The zombies all notice you at once, and start to fumble out the window. Once there's enough clearance, Megan darts into the store.\n\n\nThe first zombie you kill is a huge jolt. You stab the glass shard into its skull, and it hits the ground dead. You're proud of yourself, but there are many more after that one. So you go again. You thrust the glass shard into a head, and then pull it out. This time, however, the shard breaks. Your hand is left bleeding, and you have no other weapons. Luckily, as if on queue, Megan comes running out of the building with three guns over her shoulder, and another few in her hands. Without having to say it, both of you flee in the direction of home.\n\n\nYou slow to a walk after you've put enough distance between you and the dead-heads. \"That was impressive. You're just as fast as your brother,\" you comment. Megan gives a fleeting smile. Suddenly, she points out something. \"Look over here.\"\n\n\nYou stand in front of a concrete wall with the U.S. military seal hastily painted on with spray paint. Below that is a short message:\n\n\nHOPE IS LOST FOR THE REST OF YOU. THE DEAD NEVER SLEEP, AND NEITHER CAN YOU. WASHINGTON IS THE ONLY SALVATION. COME TO WASHINGTON OR DIE. LE\n\n\nIt seems like the writer was going to say something like \"Let\" or \"leave\", but they were interrupted while writing the message. Still, this is big. You estimate you're in the middle of California. If you head north, up through the rest of the state, then through Oregon, you'll arrive at Washington. You look at Megan. She looks back with a flicker of hope in her eyes.", "action_results": [{"action": "Get home", "result": "Barbara and Mikey are dumbfounded at the news. Everyone's thinking the same thing right now. Yes, the temptation of safety is strong, but traveling through a whole state and a half to get there? Unthinkable.\n\n\n\"It doesn't matter,\" you say. \"Every second we spend here is a second we could be moving forward. We should leave now.\" Barbara shakes her head. \"I think we should leave tomorrow. We'll need the rest, and we can scavenge for more food and things like that.\"\n\n\n\"It's not worth it,\" you say. \"We have a gun. We have a minivan with gas in it. We can make it. Besides, there's no time to scavenge. It'll be dark soon.\"", "action_results": [{"action": "Stay, and leave in the morning", "result": "\"Okay, we'll stay. But tomorrow, we leave. First thing in the morning.\" Everyone nods their heads in agreement. You have a bad feeling about this. \n\n\nAfter everyone is settled down and laying on their air mattresses, you slip out the front door. Outside, it's still rather free of zombies. You sit down on the road and look around. You think about your wife, and Washington, and everything that's happened. So much changed in just two days.\n\n\nSuddenly, you hear leaves crunching behind you. You turn around, thinking it's a zombie, but it's not. It's a soldier. He has frizzy, unkempt black hair, and still wears his uniform. \"Mind if I have a seat?\"\n\n\nYou feel oddly safe around him. He hasn't shown any signs of aggression, and to your knowledge, he has no weapons. He does, however, have a duffel bag. \"I been watchin' you, with that group.\" \"Watching me?\" you say in surprise. \n\n\n\"Yeah, watching you. The way you raided that gun store. I'm gonna be straight with you; these folks are slowin' ya down. I'm headed to Washington, just like you are. I believe you're more capable to get there if you travel lighter.\"\n\n\n\"Where are you going with this?\" you ask. \"I'm askin' you to ditch these people and come to Washington. You have family there, correct?\" You nod. \"'Kay, then. Why waste time? You have no connection to these people. You don't even know their last names.\"\n\n\n\"How do I know I can trust you?\" you ask. The man's expression doesn't change. \"I guess you don't. But that's a decision I'm gonna leave to you.\" Both of you sit in silence on the road for a few minutes. Then, the soldier gets up and opens his duffel bag. He takes out a can of spray paint, and walks over in the direction of the unfinished message.", "action_results": [{"action": "Stay with the current group", "result": "\"Sorry,\" you say. \"But I already made a commitment to these people. Hopefully I'll see you in Washington.\" The man smiles over his shoulder. \"Okay,\" he says. \"Your funeral.\" He goes back to pick up his duffel bag, and leaves. You get up and go back inside the nature center. You lay down on your air mattress, and ponder if you made the right choice.", "action_results": [{"action": "Leave for Washington", "result": "After everything is packed up, you do one last check to make sure you didn't forget anything. You find a few water bottles in a vending machine, but nothing else. You say goodbye to your makeshift home, and get in the driver's seat of the minivan.\n\n\nOn the road, you follow roads that you know to head north. You try to stay and back roads, just in case you run into anything. You're determined to make it to Washington.\n\n\nWhile driving, Barbara thinks to open up the glove box. The group is rewarded with a U.S. map and another bottle of water. You set the map up on the dashboard so you can see it while driving. You decide to follow I-5 north, which should take you right up to Washington.\n\n\nYour trip is cut short after a few miles when you come to a blockade in the road. A chain fence was haphazardly set up in the middle of the road. A handmade sign hanging from it reads: FOLLOWERS' TERRITORY. TRESPASSERS WILL BE LOOTED AND FED TO THE DEAD.\n\n\n ", "action_results": [{"action": "Head through the fence", "result": "You refuse to let some stupid sign deter you. Who are the 'Followers' anyway? You don't care. You and Mikey get out, and move the chain link fencing.\n\n\nAfter that, it seems like smooth sailing. You do start to notice, however, that the place seems less quality here. Graffiti covers the area, and certain buildings are just gone.\n\n\nSuddenly, you see something off to the side of the road. There are three men standing off in a secluded alley. One of them is tied to a pole. The other two are mercilessly beating him with pieces of metal.", "action_results": [{"action": "Intervene", "result": "You get out and take a gun with you. \"Hey,\" you say. The two attackers look over at you. The man tied to the pole can barely move his head. \"What's going on here?\"\n\n\n\"This fine gentleman over here,\" one of the men points to the beaten victim, \"has broken our golden rule. That rule is NO TRESPASSING. And it seems to me that you are also breaking that rule. So I think a punishment for you is in order as well!\"", "action_results": [{"action": "See what else he has to say", "result": "\"Rico, what do you think this man deserves?\" one of the men says, addressing the other. \"I think a proper beating is in order,\" Rico responds. Before you can step out of the way, he steps forward and hits you with the metal bar in his hand, knocking you to the ground. The two proceed to hit and kick you until you're numb. Eventually, about halfway through, you realize you're not going to make it out of this alive. You wish you had taken the detour.", "action_results": []}, {"action": "shoot them both", "result": "You won't let the man continue. You draw your gun and shoot both men down. They were at close range, but it still took a few shots. Once they're dead, you go up to the victim. His face is swollen, and his nose is bleeding. He flinches, expecting you to attack him too.", "action_results": [{"action": "kill the hostage", "result": "You have no interest in dealing with another group member. You put the man out of his misery, and get back in the car.", "action_results": [{"action": "Keep driving", "result": "You begin to get a bad feeling about the place. The empty buildings and atmosphere feel a lot more sinister now than they did a second ago. Your instincts kick in, and you try to drive away.\n\n\nYou quickly find that the roads have been blocked off by debris. They're herding you in a certain direction. You can't get out of the car, either, as you start to see other people watching you out of buildings and behind trash cans. In a last ditch effort to get away, you throw the minivan in reverse.\n\n\nAs you try to back out, you see something: a large truck blocks the way out. They've sealed the road behind you. A man holding a golf club comes out of a nearby building and starts running toward the minivan. In total panic, you speed down the road, away from the truck.\n\n\nBarbara is gripping her armrests in fear. You would be, but both your hands are on the steering wheel. You drive down the road, exactly where they want you to. You can hear the truck following closely behind you. Suddenly, you drive into a dead end. The way forward is blocked. The truck pulls to a stop behind you, trapping you.\n\n\nYou have no choice but to get out of the car. A mob of people has gathered around your vehicle. Your group follows suit, and gets out of the car.\n\n\n\"Okay, let's not waste time. Give us your stuff, and your car, and we'll escort you to your new home,\" barks a large, bald man. The crowd of angry people with their guns pointed at you reminds you that you'll have to speak carefully.", "action_results": [{"action": "Offer a deal", "result": "\"We can work this out,\" you say. The man lowers his gun. \"I'm listening.\"", "action_results": [{"action": "Offer a group member", "result": "You look back at your group. \"I'll give you a person, from my group. They can work for you, or whatever you want.\" The man seems to strongly consider it. You regret making the offer, but it's too late now. You look back one more time. Barbara gives you a look of total disgust.\n\n\nFinally, the man nods. \"Yes, I think that just may work. Reginald, clear the road outta here,\" he says to another. He turns, and looks over your group. \"I want the girl.\"\n\n\nBarbara starts crying immediately. Megan has a look of fear on her face, and Mikey shows nothing but resentment. Two people break from the crowd and grab Megan. They pull her away and out of sight. \"Okay,\" he says. \"That's it. Take the little track over there, it'll take you right out of here.\" The man turns to walk away. \"Pleasure doing business with you,\" he adds.\n\n\nBarbara and Mikey get in the minivan without you, and drive off. Mikey flips you off from the backseat. You admittedly feel terrible. As the crowd parts, you feel terrible for your choice. But you can't go back now. You follow the minivan on foot, until you're out of the slums.", "action_results": [{"action": "....", "result": "You aren't sure how to feel as you pace up the road, vaguely in the direction of Washington. You feel remorse for your decision, and wish you could take it back. Giving up Megan was a stupid choice. She cared about you, and you would gladly hand her over for your own protection. There's no more time to dwell, though. That affair took up the whole day. It'll be dark soon.\n\n\nyou continue up the road, in search of a place to spend the night. About an hour after the sun goes down, you spot something. It looks like a military outpost.\n\n\nIt ends up being exactly that. Judging by the footprints and blood, this place didn't last too long. It's only been a few days, and people are dying fast. Not even the military can seemingly stand up to the ever-growing threat of death. You open the door to the trailer and look inside.\n\n\nYou are rewarded with another gun, this one a Stag-15. It has a half-empty magazine. Other than that, you find nothing in the trailer. It's as good a place as any to sleep, and it has a pullout couch/bed.\n\n\nYou are awoken in the morning by growling. You sit up quickly and look out the window next to the door.\n\n\nZombies. And several of them. They have wandered up and down the street, surrounding you on one side. If you could get out the door, and past the horde, you could outrun them and head north again.", "action_results": [{"action": "shoot them", "result": "You load up the gun and kick the door open. The closest group of zed growl, and stomp over to you. You kneel for better balance, and do your best to aim. When you pull the trigger, you are surprisingly accurate. By the time you're out of bullets, you've cleared just enough of a path out. You slip by the trailer and move up the street at a steady jog, away from the zombies.\n\n\nAfter you've slowed to a walk, you notice another building coming up. It looks kind of like a factory building. It has several floors, is made of brick. Three smokestacks jut out of the building's roof. it seems worthwhile to check out, so you run up to it. You are disappointed to learn that the entrance is surrounded by fencing.\n\n\n ", "action_results": [{"action": "move on", "result": "Picking at the fence isn't worth it. Besides, why waste time here? Your goal of getting to Washington is still the highest priority. You leave the warehouse alone and continue on your way.", "action_results": [{"action": "What's new?", "result": "You continue to walk down the road as before, this time with a gun slung over your shoulder. You spot a sign telling you that you're still on I-5, on a crash course with Washington. \n\n\nThe sun beats down on you as you realize you are quite thirsty. Hungry, too. The way ahead looks bare. Bare except for a road sign. It tells you that if you continue ahead, you'll reach a small town. Next to the town's name, written with blood, is a small message: COME ONE, COME ALL\n\n\nIf you turn to the right, you'll arrive at a rest stop. There won't be food or water, but there will be a gas station (probably empty), and a pharmacy.", "action_results": [{"action": "Check the rest stop", "result": "You make the decision to see if there's anything worth taking at the rest stop. It's a short walk, and if there's any water, you'll gladly take it.\n\n\nJust as you suspected, the gas station has been looted of everything. The cash register, the food, even the toilet paper is all gone. Someone beat you to the punch. Oh, well. You go to check the pharmacy. That has been looted too, but not all the way. A few bottles have been left behind, scattered among the shelves. You take a bottle of painkillers and a roll of bandages. Nothing else really seems useful.\n\n\n ", "action_results": [{"action": "Head to the town", "result": "The collar of your shirt is soaked with sweat by the time you spot the town. It's relatively small, and a wall of cars and metal scrap surrounds it. A front gate set on hinges to swing open is right in the middle of the road. Above it sits a guard tower.\n\n\nYou are spotted well before you get to the door. You are ordered to get on your knees and place any weapons you have on the ground. You place your gun on the road in clear view of the tower and comply. The gate swings open, and a small group comes to meet you.\n\n\nThe group consists of a clean-shaven man, a small boy, and a woman holding a clipboard. \"Hello. My name is Rose. Welcome to Fort Z.\"\n\n\nAfter the group makes sure you aren't going to hurt anyone, you get your gun back and are welcomed into the community. You are surprised at how fast it went up. It's only been a few days, but the walls are up, and the community is thriving (for now). There is no shortage of people, and homes and buildings have been turned into sleeping quarters, storage, and everything else you can think of. \"Well,\" begins Rose. \"It seems like you've come a long way, would you like something?\"", "action_results": [{"action": "What are the rules around here?", "result": "\"Well, there aren't many rules around here, because no one seems to be causing any trouble. Just don't hurt anyone or steal anything and you should be fine,\" says Rose. \"Also, don't do anything stupid,\" adds the clean-shaven man.", "action_results": [{"action": "Who are these people?", "result": "\"Oh, jeez,\" Rose begins. \"I couldn't hope to remember everyone's name. But, this is Callaghan,\" Rose says of the clean-shaven man. He reaches out to shake your hand. \"It's a pleasure to meet you,\" he says. \"Then there's Max,\" Rose pats the little boy on the head. The boy is hiding behind his mother's legs. \"We're kind of like the government around here. Other than that, you can make friends as you wish.\"", "action_results": [null, {"action": "I'd like some food and water, please", "result": "\"I need some water,\" you say. Rose nods, and motions for you to follow her. She leads you over to a house with the garage open. It's full of boxes, marked as WATER, FOOD, and MISC. She opens a box, grabs, a water bottle and some cans, and says, \"I'll get our chef to fix you something. In the meantime, why don't you look around?\" \n\n\nYou step out and survey the area. It seems like a neighborhood, where everyone knows each other. People talk, and laugh, and there's no fear or worry. You kind of like it here... but you know you can't stay. Washington remains your goal.\n\n\nWhen Rose comes back with a plate of heated meat and some water, you sit down and eat. As you eat, you tell her of your plans to go to Washington. She seems surprised. \"Are people still holding on? We thought we were the last community to survive! This is big! I'll call a meeting. I'm sure some of us will be happy to go with you!\"\n\n\nWithin minutes, you are standing on top of a makeshift stage. Rose stands at a podium next to you. The people of the community have gathered around the stage in a circle. When Rose makes the announcement that there's a possibility of safety in Washington, a ripple of murmurs washes through the crowd. \"Our guest wants to know if anyone will accompany him on his journey to Washington!\" You aren't sure at first, but yes. Having a larger group would help you last longer.\n\n\nAs it turns out, people are hesitant to leave. A lot of people feel safe and happy in the community, even though the offer of the ultimate government protection is very tempting. A small group of people, including Callaghan, step forward to accompany you.\n\n\n\"Okay,\"says Rose. \"You're going to be leaving with some of our best workers and closest friends, but, for some reason, I trust you. I think you'll make it. If you do, promise you'll come back and rescue us? I want to see some huge helicopters, or a tank, come right up to our doors and take us away, okay?\" she jokes. You are taken aback at how trusting she is in you.\n\n\nRose agrees to let you off with enough food and water to sustain your group for a month. Beyond that, it'll be your job to feed your group. \"The other thing,\" Rose says, \"is the cars. We have a relatively small selection, for scavenging. You can take whichever one you like to drive, but if you choose a better car, it'll leave us without it. Just keep the people you're leaving behind as you choose, okay?\" Rose asks. You see no issue with that. These people are basically escorting you to Washington, so their comfort is a big priority. With that, Rose leads you over to a separate area where the vehicles are kept.", "action_results": [{"action": "Choose the recreational cars (hold more gas, break down easy, won't protect as much from bullets or the dead)", "result": "You choose the weakest car. It's not like you're driving some piece of crap held together by duct tape. It's fully functional and full of gas, so it works for you. \n\n\nYou are given three cars, all of the same quality, for your group. Everyone loads the supplies into the trunks, and Rose asks another lady to open the rear doors, to point you in the direction of Washington. You thank Rose one last time, and drive up to the doors. You buckle your seat belt, and prepare for a long road trip.", "action_results": [{"action": "The first night", "result": "The first day of driving is uneventful. You actually make it a long way. At this rate, you'll be out of California in no time, and one step further to safety. As the sun sets, you decide to stop for the night.\n\n\nYour party unpacks some food, and you use a matchbook to light a small fire. You don't have any sleeping bags, so you'll have to find somewhere on the ground. As you eat, you survey your party.\n\n\nCallaghan you already know a lot about. He was a leader at Fort-Z, and he is well-dressed. He has a gun and a hunting knife on his belt, and eats a can of beans with a spoon.\n\n\nDaisy seems like a happy person. She smiles at her group members as she eats. She is dressed in a tie-dye T-shirt and jeans, with no weapons. She has long blond hair that's dyed gold at the tips.\n\n\nGale is kind of a mystery to you. He rode in your car, and didn't say a word the whole ride. He has a large axe that he carries with him at all times, and is dressed in dirty, bloody clothes.\n\n\nSanders is a soldier flashing his uniform proudly. He doesn't have a gun, but he does have a nasty scar going from his chin to his forehead on the left side of his face.\n\n\nFrank is also a soldier, but he seems more...stable than Sanders. He still has his gun, a sniper rifle. He is also wearing his uniform.\n\n\nChip is a teenager who seems to be carefree and distracted. He eats by dumping the contents of the can into his mouth, rather than with a spoon. He wears a backwards baseball cap and a hoodie.\n\n\nLisa used to be on the team that kept track of supplies and rations at the city. She has a handgun on her belt, and doesn't seem too interested in eating.\n\n\nScarlet has bright red hair, which is hard not to notice. You can't tell if it's dyed or not. She has a knife almost double the size of Callaghan's, so big that it weighs down her belt. She also isn't eating.\n\n\nMarley you know a lot about, because he rode with you and talked a lot. He keeps up conversations with several group members, even getting Sanders to crack a smile every so often. He told you in the car that he used to be the ambassador for Fort-Z, and had lots of friends before the outbreak.\n\n\nGrim is rather quiet, dressed in mostly dark colors, and busies himself by stacking empty food cans on top of each other. He has oddly precise accuracy, to the point that even when the can tower looks like it's about to fall, it doesn't.\n\n\nAfter dinner, guard shifts are set up to make sure the group isn't attacked. You volunteer to go first, along with a partner, for half the night. At midnight, you will sleep, and two others will take your place. Who do you want to accompany you?\n\n\n \n\n ", "action_results": [{"action": "Sanders", "result": "Sanders strikes you as a capable person, and he's a volunteer for the first shift. \n\n\nAs the rest of the group tries to get comfortable, you and Sanders sit against the cars, and try to get comfortable yourself. it's a good four hours before you'll get any sleep, and you still have to drive tomorrow.\n\n\nSanders is the first to break the silence. \"Nice night, isn't it?\" He speaks with the same rough voice you imagined him having. You nod. \"I like the quiet. It means no danger, and I don't particularly want more from the dead-heads anytime soon. I've had my fill.\" You wonder if Sanders was a border guard.\n\n\n\"Did something happen?\" you ask. Sanders nods slowly. \"Yeah. Yeah, it was, uh, we were on, on border patrol in the south, where...\"\n\n\n\"Where the first wall fell,\" you finish. Sanders nods again. \"I'll never forget it. The wall itself killed half the squad, and the biters..\" Sanders shakes his head, and continues. \"I think I was the only one to get out. After that, I radioed in for new orders, but they never came through. My commanding officer was dead, along with people I've worked with for years. I don't know what I'm doing anymore. I stumbled upon the city while I was driving, and decided that if I couldn't protect California, I would at least protect a small piece of it. And now, knowing that I might actually save them...\" Sanders trails off.\n\n\n\"So you're good with guns?\" you ask. Sanders snaps out of his stupor almost immediately. \"Oh, hell yes. I've worked with all kinds of guns.\" \"What happened to yours?\" you ask. \"Didn't you have some sort of defense at Fort-Z?\"\n\n\nSanders is avoiding the question. Instead, he changes the topic. \"Do you have any family?\" You nod. \"My wife, I think the military got her before the dead did, and I like to think she's safe in Washington. That's part of the reason I'm going in the first place,\" you say. \"That's real sweet. I never had a chance to marry, I enlisted in the army two years after college. I thought a degree in architecture would get me far. It didn't.\" Sanders even smiles at that.\n\n\nAfter your talk, it gets quiet again. for the next three and a half hours, you and Sanders sit in silence, watching for threats that never come. Before you know it, the moon is high in the sky. \"Well,\" says Sanders, \"I suppose I'll wake the next shifts up. Good night.\"\n\n\n ", "action_results": [{"action": "go to sleep", "result": "When you wake up, your back is stiff from laying on the ground. You look at your party. You are one of the first to wake up. Daisy is already selecting breakfast options for the group. Gale is sharpening his axe on a rock.\n\n\n\"Hi,\" Daisy says as you go over to join her. \"What's for breakfast?\" you ask. Daisy sets out the most  breakfast-y things she could find. Cans of oatmeal and dried fruit, yum. You help her scoop portions into paper bowls.\n\n\nSlowly, everyone else wakes up. You pass out breakfast and pull out the map. If you continue at your current rate with no interruptions, you'll be at the California-Oregon state border in two days. As you scan the map, Callaghan comes up next to you. \"How are we doing?\" he asks. You point out road markers and locations you'll need to hit to stay on the right track. He nods. \"Guess I'm driving now, huh?\"\n\n\nEveryone loads back into the cars after breakfast, and you set off down the road.\n\n\n ", "action_results": [{"action": "Continue", "result": "As you drive along the road, Chip points something out on the side of the road. \"Look, it's a Burger King.\"\n\n\nNormally, you wouldn't stop either, but there's something written on the side of the building. You pull to a stop. \"What are you doing?\" shouts Callaghan from his car. You point to the mysterious writing. He understands, and gets out.\n\n\nYour group goes to see what the writing is. \"I seen one of these,\" says Sanders. \"We put these all, up and down California.\" It's another spray paint message, telling survivors to head to Washington. \"I saw one of these, too,\" you say. \"Its what started me down the road to Washington.\"\n\n\n\"Yeah,\" says Frank. \"When I was out with my squad, we were ordered to do one of these once every couple blocks or so, to spread the word.\" Your group is just about to get back in their cars, when you hear a scream from inside the Burger King.\n\n\nYou rush to the doors and look in. Chip got into the restaurant, and is hiding behind the counter from a pack of four zombies. They're grabbing at him from across the counter. \"Chip!\" you yell. This attracts the attention of one of the zombies in the group. Callaghan comes up behind you and kills it. You rush forward and grab a knife off one of the tables. You use it to kill the remaining zombies. Afterwards, Chip pops back up from behind the counter.\n\n\n\"Why would you do such a stupid thing?\" Sanders demands when the group is back outside. \"I- I just wanted to see if there were any burgers or anything left,\" Chip says sheepishly. Sanders gets right into his face and gives him a long, cold stare. You can tell things are going to get violent, so you break it up and tell everyone to get back in the cars. \n\n\n ", "action_results": [{"action": "Continue", "result": "The sun is long gone by the time you find a good place to stop. It's so dark that without your headlights, it's pitch black outside. You get out, but leave your headlights on so there's a place to sit. The other cars do the same.\n\n\nDinner is canned vegetables. As your group eats, they talk about the day. You are halfway through your can of corn when you hear a loud blast. You turn to the direction of the noise, a large red firework illuminating the sky. You can hear the groans of zombies going toward the light and loud noise.\n\n\n\"Should we chase it?\" asks Marley. \"I think so,\" you say. \"It might be a good cha-\" Sanders cuts you off. \"Actually, that's a definite yes. Get your stuff and run!\"\n\n\nYou turn around. Sanders is pointing to a large herd of the undead coming toward you. They were drawn close by the explosion, and heard your voices. You and Callaghan turn off the headlights of the cars while the rest of the group loads the supplies into the cars. You hope the zombies will pass over it and not wreck your stuff too much.\n\n\nYour group runs in the direction of the first firework. You try to yell out for everyone to stick together, but your words are silenced by more fireworks.\n\n\nWhen your group arrives at the scene of the fireworks, you see that's it's a school. You also see that the zombies from the surrounding area are closing in on you. Going here was a bad idea. But you panicked, and now you're in trouble. The safest place is inside the school. \"Everyone get into the school!\"\n\n\nYou open the front doors and get everyone inside before closing them and blocking them off with tables and chairs. Just as everyone is calming down, gunfire rips through the air and hits the doors. From there, you don't know what anything is. You're just running.\n\n\n ", "action_results": [{"action": "Run some more", "result": "You run down an empty hallway at top speed. Footsteps and gunfire echo throughout the school. Are they following you? Who knows, all you can think is to get somewhere safe. At some point, it occurs to you that you just abandoned your group.\n\n\nWhen you get to a classroom, you look behind you. Grim and Scarlet followed you. You usher them inside the room and shut the door.\n\n\nEventually, all goes quiet. You make eye contact with Grim and Scarlet. Grim is scared out of his wits, and Scarlet is on edge, with her knife. You open the classroom door.\n\n\nThe three of you slowly move down the hallway, searching for movement. Eventually, you find it. Sanders and Frank are hiding behind a set of lockers. \"How are we going to get out of this?\" you ask.\n\n\n\"We need to leave,\" Frank says, \"after we find the rest of the crew. We have five here, that means...\"\n\n\n...six are missing,\" you finish.", "action_results": [{"action": "Split up", "result": "You agree to split into groups of two. Sanders is more than fine on his own. You and Scarlet go down the first grade hallway while Frank takes Marley to the lunchroom.\n\n\nHalfway down the hall, Scarlet stops. \"Do you hear that?\" she says. You stay quiet. You can hear sounds of struggling in one of the classrooms. Scarlet nods. Both of you creep over to the classroom. You can hear Callaghan's voice. \"Get off me!\"\n\n\nScarlet bursts in, with you following. A man in a black hood is holding Callaghan against a wall and pointing a gun at him. \"Hey!\" Scarlet yells. She goes over to pull the man off Callaghan. You run over to help, but the man is waving his gun in your direction. \"Stay back!\" he yells. \"Stay back, or I'll kill him!\"\n\n\nWithout hesitating, you run over and grab the man's arm. You force his hand up and he shoots the ceiling. You throw your fist in his face, knocking him away. Callaghan pulls ou this knife and kills the man.\n\n\n\"Thank you,\" Callaghan says. \"You saved my life.\"\n\n\nSuddenly, more gunshots echo from the lunchroom.\n\n\n ", "action_results": [{"action": "Tragedy", "result": "You run over to the lunchroom. The rest of the group is there. The bodies of three attackers are on the ground, plus one more...\n\n\nMarley. Marley is dead. Frank stares in disbelief, and Daisy looks like she's about to cry. The whole situation seems surreal.", "action_results": [{"action": "....", "result": "There's no time to even mourn. The sound of shattering windows fills the air as the undead force their way into the school. You look hurriedly around the cafeteria; not everyone is here. You have to find a safe way out, and fast, not to mention locating 2 missing people.", "action_results": [{"action": "Make a run for the front doors", "result": "About half the group follows you down the corridor you entered the school through. You only hope the way is still clear. When you arrive at the doors, it looks like the zombies have all funneled to the windows, leaving you a chance to escape.\n\n\n ", "action_results": [{"action": "Go back for the others", "result": "You come to your senses. \"I can't leave anyone behind,\" you whisper, and turn back. The hallway is still clear.\n\n\nYou practically fly through the hallways, screaming the names of your crew. A few quiet answers come to you from the far side of the school. You follow them as best you can, but soon become lost in the corridors. Your vision goes fuzzy as you look for a sign of survivors.\n\n\nSuddenly, Lisa comes barreling down the hallway. \"Lisa!\" you yell. She sees you, and motions for you to follow her. You do, and end up at a side door. Gale is there, killing a few zombies that get too close. Grim is holding up the door, calling for everyone to get out. After making sure everyone is alive and safe, you vacate the building.", "action_results": [{"action": ".....", "result": "You lay on the grass, waiting for the  adrenaline rush to fade. It looks like everyone made it out alive. Well, not everyone...\n\n\n\"Marley's gone,\" says Daisy. You didn't know him well, but you're still sad to know he's gone. \"He was always a happy guy,\" says Callaghan. \"So that's what we've gotta do. We have to keep going, for him.\"\n\n\nEventually, as the sun is rising, you find your supplies. The zombies mostly brushed past you cars, although you do notice that one of the side mirrors was knocked off. \n\n\nYour party eats, then gets back in the cars. You take a deep breath, and pray that the rest of the trip won't be anywhere near as eventful as last night.", "action_results": [{"action": "Continue", "result": "From sunup, after the school incident, all three cars are silent. Nobody is blamed for what happened, but you still feel like it was your fault.\n\n\nAt about noon, you come to a stop in the middle of the road. You car stops working. The other cars make it a few more feet before they roll to a stop. The strange thing is, you still have fuel in the car.\n\n\n\"The engine's dead,\" announces Frank as he looks at the cars. Smoke rises from the engine as it tries to run, despite needing numerous replacements. \"Well,\" says Sanders, \"isn't this just perfect?\"\n\n\n\"Looks like we're going for another trip,\" says Gale.\n\n\n \n\n ", "action_results": [{"action": "Dog fights", "result": "Sanders and Frank accompany you to look for supplies to fix your cars. You decide to stick to the road, as that way you'll know how to get back. After walking for a little while, you spot something on the side of the road.\n\n\nIt's a chest, locked with a padlock. You pick it up and examine it. \"Careful,\" warns Sanders. \"Could be somethin' undesirable in there.\" On the bottom of the box, it says: if found return to stan\n\n\n\"We need to find Stan,\" you say. \"Why would we want to return the box to this guy, exactly?\" asks Sanders. \"First of all, you just got done saying it's too dangerous to keep,\" you say. \"Secondly, he might be able to help. It's as good a chance as walking down the road.\" \"What's your plan for finding him?\" asks Frank. You smile. \"Walking down the road.\"\n\n\nSomehow, you knew you'd find him. And you were right. You come upon a gas station, with the words come and get it written in marker across the windows. You knock on the front door. A man comes up and calls out, \"Hello.\"\n\n\n\"Are you Stan?\"\n\n\n\"Last I checked, yeah.\"\n\n\n\"We have your box.\"\n\n\nStan rushes up to the door and snatches the box out of your hands. \"Did you open it?\" he demands. You shake your head. Stan wanders back into the gas station. \"You're welcome,\" Sanders mutters.\n\n\n\"Actually, we were hoping you could help us out,\" you say. Stan stops and turns around. \"What could I possibly do?\" \n\n\nYou explain your need of car parts. Stan lights up. \"Yes, I can help you!\" You sigh happily, and go to show him where your cars are. He stops you. \"But why should I?\" \n\n\nSanders looks ready to punch this guy's lights out, but you stop him. \"Please, we need to get somewhere, and we returned your supplies. Help us out.\" Stan nods. \"One condition,\" he says, \"Leave the gas station now.\"\n\n\nThe three of you step out of the building. Stan goes up and closes the gas station door. He proceeds to block it off with some shelves. \"What are you doing?\" you ask. Stan responds by smiling, and pulling a silver whistle out of his pocket. A dog whistle, to be exact. He blows into it. You look and Sanders and Frank in confusion.\n\n\nSuddenly, a large dog comes racing into view. You barely have time to react before it tackles you. With Frank's help, you force it off yourself. You glance over at Stan. He's ordering you to kill it.\n\n\nSanders picks up a chunk of cement from one of the gas pumps and throws it at the dog. Although it's a direct hit, the dog seems unhurt. You and Frank scramble to look for weapons. \n\n\nYou go around to the back of the station, and are rewarded with a sharp pole. it looks like part of a ladder that snapped. The edge is sharp like a spear. Perfect. You come around to the front. Frank is still gone, and Sanders is weaving through the pumps to escape the dog. The next time it comes near you, you jab the pole right through the dog.\n\n\nNo effect.\n\n\nIn fact, the dog snaps at you and growls. It takes a few moments for you to register that it's a zombie dog, and you're in serious danger of actually dying.  The dog is ready to pounce on you when Frank comes running over. Clutched in his hand is a glass bottle. He smashes it over the dog's head, stunning it. You finish the job by striking the dog with the spear. \n\n\nAfter the monster is dead, you pound on the door to the gas station. Stan comes over with a box in hand. He briefly opens the door to toss the box out, then slams it shut. \"What's this, challenge number two?\" demands Sanders. You open the box. \"Nope.\" It's full of engine parts.\n\n\nYou make it back, and do a decent job of repairing the engine. You turn the key, and sure enough, the car hums to life. ", "action_results": [{"action": "Keep driving", "result": "You estimate it's about 1:00 in the morning when you first see it up ahead. The California-Oregon border. It's looks more like a Fort Knox than another state. The road is blocked by bales of barbed wire. A group of guys holding large guns block the way.\n\n\nYou stop your car and get out with your hands in the air. The frontmost man comes up to you. \"Can I help you?\" You nod. \"I'd like to cross here, if that's okay.\" Some of the men laugh. The one in front of you turns around and looks at his colleagues, then turns back to you. \"Yeah. Sorry friend, but that ain't happening. The only way you're getting over this outpost is in a body bag, to our cemetery. We have a special one for people like you.\"\n\n\nSanders storms up to the man and gets right in his face. \"Listen here you little good-for-nothing wuss. Either you're going to move that barbed wire for us, or I'm going to move your skull into your stomach with my fists.\" The man simply laughs, and pushes Sanders away. That tips him over the edge. Sanders slaps the man across the face. The man is in shock for a second, and turns back to Sanders. \"Okay, is that the way things are gonna go? Y'all shoulda turned around...\"\n\n\nYou brace yourself for bullets, or fists, or whatever these guys are going to do, but they don't attack. The men point their guns at you and tell you to keep still. \"Here's what going to happen now. You guys think you can walk right over us. You aren't the first. We learned how to deal with you people. You're gonna be working for us for a little while. Maybe if you're good, we'll let you go, okay?\"", "action_results": [{"action": "What does that mean?", "result": "You and your group are taken out of your vehicles. \"Don't you worry, we'll take good care of these puppies,\" the man taunts while sitting in the driver's seat of your car. You are led across the border, and into a building. You see a lot of tents and makeshift buildings set up around. The area from Oregon to the border is owned by a large group of people. you wonder what you've gotten yourself into.\n\n\nmembers of your group split off. First it's all of you, then half, then four, three, and you arrive at a bedroom with only Grim for company. You are forced into the bedroom. \"Get some sleep,\" orders the guard. \"You'll need it for tomorrow. Oh, and if this door opens at any point before I open it, I'll kill you both, and the rest of your group.\"\n\n\nYou are in a small, damp room. Mold covers the walls thick as carpet. There are bunk beds in the corner, each bed with a bag on it. As for decoration, there is one banner advertising a 'New World Order.'  Grim takes the top bunk, leaving you with the bottom one and a bag labeled 1297. It has three more sets of clothes, a bottle (also with 1297 on it) and some instant food (just add water). You sit on the bunk and try to get some shut-eye.", "action_results": [{"action": "Shut eye", "result": "In the morning, you are ordered to get up. You change your clothes, and are given a bowl of dry cereal for breakfast. The guard checks you and Grim for weapons, and swipes a knife that Grim had in his pocket. After that, you are led outside.\n\n\nYou and Grim are split once more. You are paired up with another woman, one you've never seen before. She looks frail. A guard comes up to you, gives a trowel to you and gardening supplies to the woman. \"You two will plant for us. You,\" the guard sticks his finger in your face, \"will dig a baseball-sized hole in the ground. You,\" the guard pokes the woman's forehead, \"will drop a single tomato seed into the hole. After that, bury it. After that, water it, nurture it, yadda yadda... in a few days you should see some tomatoes growing on the vines. And these better be the biggest, ripest, tastiest damn tomatoes I've ever eaten, or else.\" How are you supposed to control the tomato size?\n\n\nAs you perform your back-breaking duties, you get a look around. As far as you can see, other people are working. This seems to be the gardening section, as everyone else is doing the exact same redundant task as you, but with different plants. A few feet to your left, you hear the same guard explaining to two frightened men that they had better grow some long, delicious carrots, or else...\n\n\nThere are no fences keeping you in, only the watchful eye of patrolmen. There are a lot of them, enough that there's never a chance to make a run for it. As you scan the other workers, you spot Callaghan.\n\n\n\"Callaghan!\" you say in a hushed whisper. He looks around before spotting you. He waves. You both get up ti go talk to each other, but a guard steps between you. \"Oh, most certainly not. You are from different blocks, and different factions. Besides, no communication between slaves- uh, workers. No talking for the workers. Get back to planting. I'm hungry.\" Callaghan shoots you a questioning look as you go back to your post and keep planting.", "action_results": [{"action": "Dinner", "result": "As the sun sits low in the sky, you wonder how long you've been doing this. Years? Months? Weeks? You can't believe it was only a few hours. You are marched into a different building, along with hundreds of other workers,\n\n\nThe inside of the building reminds you of a prison block. There are several tables lined up with seats, and walkways above for the guards. The guards carefully watch as the workers take their seats. Not daring to sit next to one of your group members, you take a seat between two random people.\n\n\n\"In case you haven't noticed, we have some new arrivals,\" bellows one of the guards. \"So I'm going to explain how things work around here. Breakfast is free. You get that no matter what. The quality of your dinner is based on the quality of your work. Build us a house? Five-course meal. Sit there and twiddle your thumbs? You'll go to bed hungry.\"\n\n\nYou worked monotonously, but consistently. A tray is given to you containing two rolls, mashed potatoes, and cheesy beef. A cup of milk is handed to you. The guard smiles, and leans in close. \"You've got the right idea, striker. Hard work earns you respect. You may even get out of here early. Now, your little friend over there, he might not understand so well.\" You look over to where the soldier points. \n\n\nSanders.\n\n\nHis face is bruised, and he isn't given a dinner tray. He sits defeated and silent, with his shoulders slumped. You've never seen him so weak. Disturbed, you eat quickly and in silence.\n\n\nAfter dinner, you are herded back into your bedroom. Grim comes in a minute later. Based on his complexion and full stomach, you guess he worked hard, too.", "action_results": [{"action": "Tomorrow is another day...", "result": "Today is the start of a new day. After a meager breakfast, you go out to start another work day. On your way, a guard stops you. \"Hi,\" he starts. \"I'd like to apologize for the harshness of my colleague the other day. It seems he had a small lapse in judgement.\" You are confused, but you act like you know what he's talking about. You nod as well.\n\n\n\"While you are not allowed to talk to workers of other sections and factions,\" the guard points to Callaghan, \"you are more than welcome to talk to members of your section.\" You are even more confused now. Whatever. The guard steps aside to allow you to go to your workspace. What will you do on this fine working day?", "action_results": [{"action": "Do your job", "result": "You can't possibly go hungry. You decide to buckle down and get your job done.\n\n\nHours pass. Your hands and knees are grimy and achy, but you have an impressive row of baby tomatoes, just waiting to grow. They'd better grow, or else you'll probably die.", "action_results": [{"action": "Dinner", "result": "\"Hmm...\" says the guard in front of you. \"Well, I'm impressed. Your work ethic is improving. Full rations for this man.\" And sure enough, you get another full plate. You eat slowly as the other workers watch in envy.\n\n\nIn your bedroom, Grim calls you up to his bunk. \"Look at this,\" he whispers. He has a small piece of metal in his hand. \"I found it while I was digging. I think if I build up enough scraps, we could make something...\"\n\n\n\"Like a weapon?\" you say, excited. \"Maybe,\" answers Grim. \"Or, even better, something to escape with. But, I'll need your help. Look for things, collect things. Bring them back. I'll hide them in my pillowcase. We'll need a lot more than this paper clip.\"", "action_results": [{"action": "Day 2", "result": "The next morning is the same. A bowl of oats, then you go outside to work. ", "action_results": [{"action": "Talk to some other inmates", "result": "You decide to make conversation with some of the other workers. You approach a group of workers that don't seem interested in planting blueberries. \"What are you guys doing?\" you ask.\n\n\n\"Great, another helping hand,\" one of the workers says. She comes up to you and lowers her voice. \"We're leaving here soon. We've been collecting gardening tools, and food. We're going to revolt, and run away.\" \n\n\n\"Who's 'we'?\" you ask. The worker opens her arms to everyone working. \"As many people as we'll take. It's happening tomorrow.\" \n\n\n\"Quick question,\" you say. \"How long have you been here? This place can't have been up long.\" The worker ponders the question. \"I was captured a week ago. Anyway, tomorrow, okay. Try to get your hands on a weapon. After that, just take out as many guards as you can. There are definitely more workers than guards.\" She looks over at you. \"You in?\"", "action_results": [{"action": "No thanks", "result": "\"Sorry, but I can't risk it. I've got people here,\" you say. \"The guards will kill them, and I can't let that happen.\" The woman frowns. \"Then we won't have enough people for the revolt.\" You think about what Grim told you. \"Maybe there's another way out. One that doesn't involve violence.\" The woman looks at you in confusion. \"You mean, like, a jailbreak?\"\n\n\n\"Yeah, a jailbreak. Anyway, I need to plant tomatoes. See you around. Well, actually, maybe not.\"", "action_results": [{"action": "Plant tomatoes", "result": "No use going hungry. You sit down and mentally prepare yourself for a long, grueling day. Scoop, plant, bury, water. Scoop, plant, bury, water. Scoop, plant, bury, water. Scoop, plant, bury, water. Scoop, plant, bury, water....\n\n\nAfter the day is done, you go inside for dinner.", "action_results": [{"action": "Dinner", "result": "When you arrive at your seat for dinner, a heaping plate of food awaits you. The guard who served you stands up on the table and claps his hands. 'Attention, everyone. I would like to congratulate worker number 1297 for his dedication to our cause. Please, a round of applause for him.\"\n\n\nThe room is silent. Workers give you strange looks. \"CLAP, YOU MAGGOTS!\" yells the guard. Automatically, polite applause fills the room. you make eye contact with Sanders. We're getting out of here, you mouth to him. It's just a cover. He nods, and goes back to eating. Looks like he finally got the memo.\n\n\nBack in the bedroom, Grim is already asleep. You lay down, and try to close your eyes.", "action_results": [{"action": "Another day...", "result": "When you wake up, you are expecting the disgusting bowl of oatmeal. And sure enough, you get the same bowl of cold, runny oatmeal. Afterwards, you are forced outside once more.", "action_results": [{"action": "Search for parts for Grim", "result": "Rather than working, you decide to harvest more for Grim. After awhile, you're able to collect a few small bits of metal. By dinnertime, you're almost proud of your work.\n\n\n ", "action_results": [{"action": "Dinner, again", "result": "You're so tired and bored and hungry and sick, and just...done with this place. You can't wait to leave, if you ever do. You slump through dinner, and then march over to your bedroom. Grim seems to notice how neglected you're acting, and tries to give you some words of encouragement. It's a nice gesture, but it doesn't help. Tomorrow is another day.", "action_results": [null]}]}, {"action": "tend to your tomatoes", "result": "With nothing else to do, you submissively tend to the tomato plants. The guards seem happy with your work, and don't notice that you're not talking.", "action_results": [null]}]}]}]}, {"action": "look for parts for Grim", "result": "You think back to Grim's words. You need to get more bits and pieces to build a lockpick, or something like that. You go to work.\n\n\nYou find a loose wire near one of the buildings, and pull it out. This gives you a semi-decent rope. On your way to hide it, you spot a quarter on the ground. Not much, but it's something. After you hide them, you try to think of something to get you out of the bedroom you're stuck in. The door isn't an option; it would notify the guards. You have no windows, no vents, nothing to crawl through. You'd have to chip a hole in the wall. You decide to smuggle your trowel in. As the day ends, you realize you did zero work by the guards' standards. And that means no food.", "action_results": [{"action": "Dinner", "result": "When you take your seat, the guard that usually gives you your food comes up to you empty-handed. \"You, my friend, were a useless slug today. Useless slugs don't need to eat, so I'm sure you'll be fine.\" You go to bed more hungry than ever. Breakfast seems like an eternity away.", "action_results": [null]}]}]}, {"action": "Yes!", "result": "You happily accept. The woman seems excited. \"Okay, we have a weapon stash nearby. Find anything we can use, and bury it there,\" the woman shows you a mound of dirt near the latrines. \"Got it.\"", "action_results": [{"action": "Dig for a weapon", "result": "You decide that looking with your trowel is a reasonable option. It'll make it seem like you're working. you get to your station, and start digging small, nondescript holes.\n\n\nHours pass. You're just about to give up when something shiny catches your eye. You quickly unearth it. It's a shard of metal, sharp enough that it draws blood from your fingers just by holding it. As you examine it, you hear a guard come up behind you. You quickly stuff the shard into your pocket. \"Wow,\" says the guard as he looks at your holes. \"Someone was hard at work today. You can expect a full belly tonight.\"\n\n\nYou stash the shard in the pile just before dinner.", "action_results": [{"action": "Dinner", "result": "You arrive in the eating area and sit at your table. The guard who serves you comes up with a clipboard. \"You know the rules.\" You are confused.\n\n\nSuddenly, a group of guards pull you off your seat and drag you into an interrogation room. The woman you collected weapons for is there, too.\n\n\n\"So, what do you think ought to be done with violent troublemakers like you?\" The guard asks. \"I think you should let us go, and stop imprisoning people for no reason,\" answers the woman. \"Yeah, I was afraid you'd say that. We're border guards. We have to do this, to ensure no terrorists get anywhere near Washington. It's a pretty good deal. But, you two just don't get it. So, I've selected punishments special for both of you.\"\n\n\nYou are taken outside. The woman is taken elsewhere, probably to her doom. When you see the punishment, you freeze. Frank is tied to a wooden beam in the ground. The guard takes out a stick, and beats Frank until he's bloody everywhere. He's barely even conscious. \"This is what has to happen,\" says the guard, \"to show you just how serious we are.\" You watch as Frank is untied and dragged off, probably to his doom as well. You are sent to bed without dinner. \n\n\n \n\nNow you're definitely getting out of here.\n\n\n ", "action_results": [null]}]}, {"action": "Wait for a good time to raid the toolshed", "result": "You decide to sit against the wall and wait for the guards watching the toolshed to move. While you stand, several guards comment on your lack of work. You'll go hungry tonight, but not in vain. Eventually, during a shift change, you're able to slip into the toolshed and swipe some razor blades. You stuff them in your pockets and close the toolshed door just as two guards come up to you. \"Shouldn't you be working?\"\n\n\nOne of the guard hits you, causing a single razor blade to fall out of your pocket, and onto the ground. Frantically, you try to cover it with your shoe. \"Hey, what's this?\" The guard has noticed. You contemplate whether to run for it, but the guard simply says, \"Gotta be careful with these. You really should be working, though.\" Thank goodness the guard didn't notice that you dropped it. He thought it was just there.\n\n\nYou stash the razor blades on the way to dinner.", "action_results": [null]}]}]}, null, null]}]}]}, {"action": "look for Grim", "result": "You decide to look for Grim. The guard did say everyone in your section. You walk up and down the area, searching for Grim's face. You don't find it. That's odd. Since he slept in your block, along with all the other workers, why isn't he here?", "action_results": [null, {"action": "Talk to the old woman you work with", "result": "You decide to get some info from the woman you work with. You'll work slower, but that's okay.\n\n\n\"I was taken in a day after the dead got into Oregon,\" the woman says as you work. \"They rounded us up, and told us we weren't free spirits anymore...\"\n\n\n\"Yes, but do you know of a way out?\" you coax. The woman's face goes dark. \"There's no way out. Please don't try. If they catch you trying to leave, death is the best outcome. More likely, they'll starve you, or beat you, or feed you to the zombies...\" she trails off. It seems as though this happened to someone close to her.", "action_results": [{"action": "Dinner", "result": "\"Hmmm....\" says the guard as he stands in front of you. \"You did a decent job, but decent doesn't cut it. Your rations will be cut in half.\" And indeed they are. You hungrily eat the little food you are given.\n\n\nIn your bedroom, Grim calls you up to his bunk. \"Look at this,\" he whispers. He has a small piece of metal in his hand. \"I found it while I was digging. I think if I build up enough scraps, we could make something...\"\n\n\n\"Like a weapon?\" you say, excited. \"Maybe,\" answers Grim. \"Or, even better, something to escape with. But, I'll need your help. Look for things, collect things. Bring them back. I'll hide them in my pillowcase. We'll need a lot more than this paper clip.\"", "action_results": [null]}]}]}, null]}]}]}]}]}]}]}]}]}, {"action": "Take the chance and leave", "result": "You can't waste a chance like this. You force the doors open, and get as many people out as you can. \"We need to seal these doors,\" says Scarlet. You search the surrounding area for something to do that with. Your eyes settle on a lone car in the parking lot.\n\n\nYou turn off the parking brake, and roll the car towards the doors. Just as you are about to block them off, Chip comes running up to the doors with a whole horde of the dead in tow. \"Let me out!\" he shouts. Scarlet hurriedly opens the doors enough for him to slip out. You slam the car into the doors, stopping them from being opened.", "action_results": [null]}]}, {"action": "Wait for your people", "result": "\"We should wait in the cafeteria for everyone else. They'll get here soon,\" you say. \"Are you insane?\" says Sanders. \"We need to run for our lives!\"\n\n\nYou wait another few minutes in the cafeteria as the rest of the group tries to find a way out. The groaning and footsteps only get louder. Finally, you see hordes marching up to the cafeteria doors. \"We waited too long,\" says Callaghan. \n\n\nCallaghan, Frank, and Scarlet charge out to meet the hordes, to fight them off. You hastily remove a grate from the wall of the cafeteria. It's the only way out. When it finally comes loose, you climb in as fast as you can. The screams of your teammates echo behind you. Just as you think you are safe, a dead hand pulls you back out of the grate. The zombies swarm your dead body.\n\n\nHow ironic that it happened in the lunchroom.", "action_results": []}, {"action": "Climb through the vents", "result": "You look around the lunchroom for a way out. You spot a large ventilation grate against the wall. \"Help me tear this out,\" you say. \n\n\nAfter the grate is loose, you crawl in, followed by your group. It's a mad fumble in the dark for escape. At any moment, you could make a wrong move and plummet to your death. After some time, you reach a split.", "action_results": [{"action": "Right", "result": "As you crawl at top speed towards freedom, you realize too late that you made a wrong turn. You slip down the shaft, into a pool of something. The fall wasn't enough to kill you, but your legs are pinned under your own weight. You can't move. You try your best to get comfortable. After all, it's going to be awhile.", "action_results": []}, {"action": "Left", "result": "You climb blindly through the vent shaft, feeling around for something to hold onto. Eventually, you come to another stop.", "action_results": [{"action": "Left", "result": "you frantically crawl forward, and the light of the moon cuts through an outside grate. You made it. You shift around so your feet are forward, and kick the grate out. You crawl to freedom with your people right behind you. ", "action_results": [null]}, null]}]}]}]}]}, {"action": "Stick together", "result": "You agree to stick together. \"I think they're using the lunchroom as their base of operations,\" Sanders says. \"That's all I could see before I ran off.\"\n\n\nThe group stays as close as they can get. Everyone is intently watching for any sign of movement. When you arrive at the lunchroom, you can see three people in there.\n\n\n\"Marley,\" Scarlet whispers. You look into the window...Marley is being held down at gunpoint. You have to do something.\n\n\nWithout warning, Sanders crawls over to the doors. He pulls a gun off of one of the storage boxes (you don't know how he spotted it) and bursts in. With no other choice, you follow him.\n\n\nFrank and Sanders hold the position of fire with the attackers. Scarlet comes up from behind with her knife.\n\n\n\"Let him go,\" says Sanders. \"Now, before I make you.\" The bandits show no sign of movement. \"Please,\" you say. \"We're going somewhere, and the guy you're holding there has someone he needs to see. Please, please let him go.\" You hope that appealing to their emotional side will convince them to let Marley go. And it seems like it's working. The man lets go of Marley and he stands up.\n\n\nOne of the bandits fires a bullet into Marley's head, killing him.\n\n\nYou are in shock, staring at Marley's body. You vaguely notice Sanders firing at the bandits, Frank possibly taking a hit. By the time you realize you were an easy target, the threat is already gone. More of your group members come into the lunchroom with their weapons raised, only to lower them when they see Marley.", "action_results": [null]}]}]}]}]}]}, {"action": "Grim", "result": "You are surprised that Grim is volunteering, given his quiet nature. You select him, and everyone else goes to find a place to sleep.\n\n\nYou and Grim sit against the cars and watch the road for threats. Grim seems disconnected and deep in thought, until he suddenly sits up and points down the road. \"See that?\"\n\n\nYou look in the direction he's pointing. There's nothing there. \"What are you pointing at?\"\n\n\n\"There's a zombie over there.\"\n\n\n\"How can you see that? Are you sure it's not a tree or something?\"\n\n\n\"No, it's definitely a zombie. He's stumbling over toward that house. Oh, he got his foot stuck on something. Okay, now he's free.\"\n\n\nSuddenly, Grim looks over at you. \"Sorry,\" he says. \"Was I bothering you?\" You are surprised. \"No, of course not.\"\n\n\n\"I was always like this. I can see things no one else can. I'm also really good at reading people. Talking, not so much.\" After that, it's quiet. Grim fidgets around nervously. You think of something encouraging to say. \"That's pretty cool,\" is all you can come up with. It still makes Grim smile.\n\n\nYou decide to get more acquainted with him by asking more questions. \"How did you end up back at that town?\"\n\n\n\"Hm? Oh, I've lived there my whole life. Nobody from our town really listened to the drafting rules. Nobody in California really did, otherwise this place would probably be all girls.\"\n\n\nYou feel dumb for leaving your wife and going to the wall. You could've stayed back? That would have been your first choice easy. This knowledge propels you to get to Washington even more.\n\n\nThe rest of your shift is spent in silence. When the moon is high in the sky, you and Grim wake up the next two watchguards.\n\n\n ", "action_results": [null]}, {"action": "Lisa", "result": "You pick Lisa to accompany you for the night. It's good to get to know the people you'll be working with.\n\n\nAs everyone else finds a place to sleep, you and Lisa sit against the cars to guard the supplies. You notice she frequently takes out her handgun, takes out the ammo and takes apart the gun, only to put it back together and put it away, and then take it back. You decide to start conversation.\n\n\n\"You nervous?\" you ask. Lisa gives you a look that's hard to read. \"No.\"\n\n\n\"Then why do you keep taking apart your gun?\"\n\n\n\"I don't know, okay? I'm just fidgety.\"\n\n\nYou decide to try again. \"Rose told me that you used to keep track of inventory, and that you were quite happy at Fort-Z. Why did you want to come to Washington?\"\n\n\nLisa actually seems to be considering the question. \"I'm just trying to help, I guess. I won't be any good back home. I like order. Routine. When the downfall happened, it was all I could do to find something to occupy my time.\" You nod.\n\n\nYou open your mouth to say something, but Lisa keeps going. \"I used to be an accountant. Everyone else was so scared, so worried when they heard the news that the world was ending. To me, it was just more work. A different kind of work, but still work. Now, instead of making money and feeding yourself, you're staying alive.\"\n\n\nThe rest of the night is quiet, with no incident. When the moon is halfway through its cycle, you wake up the next two guards.\n\n\n ", "action_results": [null]}]}]}, {"action": "Choose the average vehicles (hold decent gas, stronger protection from zombies, but weak to bullets/humans)", "result": "Your choose the fairly strong cars. They'll be decent on gas, and protect your group from attacks. \n\n\nYou are given three cars, all of the same quality, for your group. Everyone loads the supplies into the trunks, and Rose asks another lady to open the rear doors, to point you in the direction of Washington. You thank Rose one last time, and drive up to the doors. You buckle your seat belt, and prepare for a long road trip.", "action_results": [null]}, {"action": "Choose the heavy-duty vehicles (hold little gas, very bullet and zombie resistant, almost never break down)", "result": "You pick the strongest cars. You aren't too concerned about gas, and protection takes top priority.\n\n\nYou are given three cars, all of the same quality, for your group. Everyone loads the supplies into the trunks, and Rose asks another lady to open the rear doors, to point you in the direction of Washington. You thank Rose one last time, and drive up to the doors. You buckle your seat belt, and prepare for a long road trip.", "action_results": [null]}]}]}]}, null]}]}, null]}]}, {"action": "break in", "result": "You use the butt of your gun to hit the fence poles repeatedly. Eventually, the pole gives way, and part of the fence falls away. You step in, and into the factory.\n\n\nAs soon as you step inside, you see a woman picking through a pile of debris. She looks up at you as you enter.\n\n\n\"Oh. Hi,\" she says. She seems rather uninterested in you. \"What are you looking for?\" you ask. \"Parts,\" she replies. \"Parts for an engine. More specifically,\" she pulls a piece of notebook paper out of her pocket and reads it, \"...a fan belt.\"\n\n\nYou nod. \"Okay.\"\n\n\n\"My name's Clarice, by the way,\" she says out of nowhere. You are caught slightly off guard, but introduce yourself anyway. Suddenly, Clarice pulls a large black thing out of the wreckage. \"Found it,\" she says triumphantly. She heads out of a side door. \"By the way,\" she adds, \"Don't bother following me.\"", "action_results": [null]}]}, {"action": "search the trailer for another weapon", "result": "Not wanting to waste bullets, you scrounge around the trailer for something sharp. Eventually, you find a piece of plastic that looks like it used to be part of a canteen. Nonetheless, it's sharp.\n\n\nYou open the trailer door and slice away, just like with the glass shard. You're able to clear a small opening for you to charge through, and you make it away from the horde at a running speed.\n\n\nAfter you've slowed to a walk, you notice another building coming up. It looks kind of like a factory building. It has several floors, is made of brick. Three smokestacks jut out of the building's roof. it seems worthwhile to check out, so you run up to it. You are disappointed to learn that the entrance is surrounded by fencing.", "action_results": [null, null]}]}]}, {"action": "Offer half your supplies", "result": "\"Half our supplies,\" you offer. \"Please, just let us pass. We need to get somewhere, quickly.\" You search for any sign of anything behind the man's eyes. You find nothing. \"Sorry,\" he says. \"But unless you have a better offer than our current demands, this won't turn out well for you.\"", "action_results": [null, {"action": "Um...", "result": "\"I don't know what else we could give,\" you say. The man simply nods. \"Don't worry, I understand.\" He gives a cruel smile,  and snaps his fingers. One group of men starts to unload your trailer, while another grabs you and your group.", "action_results": [{"action": "Prisoners", "result": "A pair of arms lifts you up, and drags you over to one of the nearby buildings. As you cut through the crowd, they part just enough for you to pass. You struggle, but whoever's holding you has an iron grip. You realize there's no use struggling, because even if you get free, you're still surrounded. You relax and allow your captor to carry you into a dilapidated building.\n\n\nThe inside of the building is completely empty. It seems to have been some sort of apartment building, but it's almost unrecognizable now. You are taken down a set of stairs, and into the basement of the building. The basement is a hallway, with several doors lining the walls. Barbara and her kids are divided into the other rooms, and you are taken into a room of your own. The only thing in the room is a chair.\n\n\n\"Sit,\" orders the man who carried you in here. He's holding a shotgun, so you decide to comply. As soon as you sit down, your hands are seized and tied behind your back. \"Sorry that I have to do this,\" the man says as he loads the shotgun. You struggle, and manage to tip the chair over. Unfortunately, it stays intact.\n\n\n\"Please don't try to run, it just makes this harder and more awkward,\" the man says. He stands up. \"You have two choices at this point. One, I can kill you right now. Two, you can keep trying to fight, and struggle, and in the end, I'll still kill you. You wanna try to break free again?\"\n\n\nInstead of answering, you pull your hands against the back of the chair. Just as last time, it stays intact. \"Hey, I warned you,\" the man says. He fires the gun, and stains the ground with your blood.", "action_results": [null]}]}]}, {"action": "Offer your gas", "result": "\"Gas,\" you say. \"You can have it. Just leave us enough to get out. You can take the rest.\" The man doesn't even consider it. \"Look around you, stupid. Do you see a single functioning car?\" You look around. \"NO!\" the man yells. \"We don't have 'em 'cause we don't need 'em. If you don't start making me a good offer, I'm just gonna have to start taking without asking first.\"", "action_results": [null, null]}, null]}, {"action": "Give up your supplies", "result": "\"It's all in the trailer,\" you say, which is true. The man looks behind him, and snaps his fingers. \"Boys, unload the trailer.\" He turns back to you. \"Now that that's out of the way, I will be happy to escort you to your new home.\"", "action_results": [{"action": "Attack", "result": "You pretend to walk over to the minivan to surrender the keys. Everyone's eyes are on you. You open the door, and grab a gun out of its holster. No one can see you. You ponder who to shoot first. \"Well?\" the man taunts. \"Am I getting the keys or not?\" Decision made.\n\n\nYou thought you could be quick enough to shoot somebody. But you didn't even pull the trigger. Not once.", "action_results": []}, null]}]}]}, {"action": "leave the hostage", "result": "You can't take in a new member, and you also can't trust him. You leave him tied to the pole, get back in the car, and drive off.", "action_results": [null]}, {"action": "take the hostage with you", "result": "You can't leave the man out here like this. It's not safe. You untie the rope holding him to the pole. He gives you a look of pure gratitude. You have him hide in the trailer, and you take off.\n\n\n ", "action_results": [{"action": "Keep going", "result": "There's no time to waste. You gunshots echoed throughout the area, and you doubt those two were alone. With the man hiding in your trailer, you try to drive away.\n\n\nYou quickly find that the roads have been blocked off by debris. They're herding you in a certain direction. You can't get out of the car, either, as you start to see other people watching you out of buildings and behind trash cans. In a last ditch effort to get away, you throw the minivan in reverse.\n\n\nAs you try to back out, you see something: a large truck blocks the way out. They've sealed the road behind you. A man holding a golf club comes out of a nearby building and starts running toward the minivan. In total panic, you speed down the road, away from the truck.\n\n\nBarbara is gripping her armrests in fear. You would be, but both your hands are on the steering wheel. You drive down the road, exactly where they want you to. You can hear the truck following closely behind you. Suddenly, you drive into a dead end. The way forward is blocked. The truck pulls to a stop behind you, trapping you.\n\n\nYou have no choice but to get out of the car. A mob of people has gathered around your vehicle. Your group follows suit, but the former hostage stays in your trailer.\n\n\n\"Okay, let's not waste time. Give us our hostage, your stuff, and your car, and we'll escort you to your new home,\" barks a large, bald man. The crowd of angry people with their guns pointed at you reminds you that you'll have to speak carefully.", "action_results": [{"action": "Give up the hostage", "result": "Slowly, with your arms raised, you walk over to the trailer, and open the door. The hostage steps out with his arms raised. \"Wonderful,\" the man says. He grabs the hostage by the shirt collar and hands him over to another man, who drags him away. \"Anything else?\"", "action_results": [null, null]}, {"action": "more than food", "result": "You slowly walk over to the trailer to hand over the supplies. When you open the door, the hostage comes out with his arms raised. \"Well, look who it is,\" the man says. \"Thought you could sneak this one past us?\" Another person from the crowd takes him away. Then the man snaps his fingers. \"Boys, unload the trailer. I want to see what I got.\"\n\n\nAfter the men have searched through the trailer, the man turns to you. \"Now that we have your stuff, I will escort you to your new home.\"", "action_results": [null, null]}]}]}]}]}, {"action": "Keep driving", "result": "You watch over the scene. The attackers seem like hardened thieves. Getting in a confrontation wouldn't be wise. You slowly drive past the scene. As you do, the victim of the beatings gives you a long, cold stare in between blows to the face. ", "action_results": [null]}]}, {"action": "Try to find a way around", "result": "Heeding the warning of the sign, you decide to change direction. You look on the map and find an alternate route. You'll be able to loop around and rejoin I-5 after some time.\n\n\nAs you drive, you begin to notice something is very wrong. You expected to be out of range of whoever the 'Followers' are, but graffiti and roadblocks suggest otherwise. Zombies have been staked to the ground on the side of the road. garbage cans have been laid out to block the roads, and a few of them have fires going in them.\n\n\n\"We need to turn around,\" you say. Nobody objects, so you throw the car in reverse. You back into the grass, and turn around so that you can pick a different route. But, when you turn, you see a man walk out into the middle of the road. He has something in his hands, but you can't tell what it is. It looks like a bat, or an axe. Suddenly, you see a car driving up the road toward you.\n\n\nBy this time, you realize the mistake you made. You try to turn around to see if you can get out of the backroads, and away from these people. You end up knocking over some trash cans and putting dents in the car, but that's currently the least of your worries. You start to see that forks in the road have been blocked off completely. They're herding you in a certain direction. With the roadblocks, the zombies, and the car behind you, you have nowhere to go.\n\n\nYou have no choice but to follow the intended path for you. You eventually end up in a section of the road that's walled off completely. When you stop, the car behind you stops, blocking you in. A group of people approaches the car from behind roadblocks and trees. Every single one of them is armed with either a gun or a large melee weapon. One man, who is bald and wearing a blood-soaked apron, walks up to your car. He clutches a metal bar in his meaty fist.\n\n\n\"Knock, knock, knock,\" he says, hitting the top of your car with every word. \"Come on out, so we can see our kill.\" You freeze with fear. The man leans down into the window. \"Get out of the car,\" he says. You slowly open the door, and the man steps aside to let you out. When the four of you are out of the car, The man addresses all of you.\n\n\n\"So,\" he starts, \"Apparently you didn't pay attention to our little warning. This is our turf, and anyone who enters our turf, becomes our property. You four, and everything you have, is ours now. I'm gonna need the keys to your car, and then I'm gonna need you all to step aside, so I can escort you away.\"\n\n\nMikey is the first to act. He gets back in the car, and comes up a moment later with a gun. He points it at the bald man. \"Leave us alone,\" he says.\n\n\nThe man laughs. \"Silly boy. Young kids like you shouldn't play with guns,\" he says. He snaps his fingers, and a small group of men from the crowd steps forward. They rip the gun out of Mikey's hands, and pull him out of view.\n\n\n\"Hey,\" you say. \"Listen, I'm sorry we trespassed, but I don't want any trouble. Please, please, just let us pass. We don't want to bother or hurt anyone. We just have somewhere to be. Can't you-\"\n\n\nThe man cuts you off by hitting you in the head with his metal bar. \"Fool! Stop trying to plead your case! I told you how it's gonna be! We get your stuff, and you're gonna die!\"\n\n\n ", "action_results": [{"action": "Attack him", "result": "Without hesitation, you jump out at the man. You grab the bar and hold it against his neck, choking him. Behind you, you hear the others leap into action.\n\n\n\"I told you,\" you say, \"Just let us go. But you wouldn't listen. Now we have to-\"\n\n\nYou are suddenly pulled off of the man and stabbed in the side. You shriek in pain, and your attacker drops you onto the road. \"I tried to tell you,\" the man says. \"But you just wouldn't listen.\" The man brings the bar down onto your head, caving your skull in.", "action_results": [null]}, {"action": "Let him kill you", "result": "You stay silent, and get up off the road. The man has a wide, wicked grin on his face. As the others close in on the car, the man hits you again, sending you to your knees. Again, and you're on the ground. Again, and you're barely conscious.\n\n\n\"Signs are there for a reason,\" the bald man says as your vision swims. \"We gave you an honest, fair warning, but you just didn't listen.\" The man brings the bar down onto your temple, killing you.\n\n\n \n\n\"Not my fault you don't listen.\"\n\n\n ", "action_results": [null]}]}]}]}, {"action": "Follow The Stranger", "result": "Something about what the soldier said makes you think. Barbara can't operate a weapon, Mikey doesn't like you, and probably never will, and Megan is too shy for you to even be sure about her. You realize the soldier is right, and go to follow him.\n\n\nYou catch up with the soldier as he is finishing the spray-painted message on the wall.\n\n\nHOPE IS LOST FOR THE REST OF YOU. THE DEAD NEVER SLEEP, AND NEITHER CAN YOU. WASHINGTON IS THE ONLY SALVATION. COME TO WASHINGTON OR DIE. LEAVE NOW, AND BE A PART OF THE REBUILDING.\n\n\n\"What's the rebuilding?\" you ask. \"Oh,\" the soldier answers, \"It's a military plan that died out pretty quickly. Back before the zombies took control, we had a plan set up to rebuild and restructure the damaged areas. You know, help with businesses, relocate families.\" That makes sense. Nobody saw this outbreak coming, and it makes you feel better that the government is working to help you. You hope they were able to help your wife to safety. Along with everyone else of course, but mostly your wife.\n\n\n\"It's pretty dark out,\" says the soldier. \"We should head back.\" You are confused. \"Head back? To where?\" The soldier looks at you and raises his eyebrows. \"The camp. Follow me.\" The soldier leads you back past where Barbara and her kids are, and into the trees. \"By the way, my name's Conway,\" he says suddenly.\n\n\n \n\n ", "action_results": [{"action": "Camp", "result": "After a few minutes, you arrive at a small campsite. A single tent is set up in front of a living space. A fire pit, a log to sit on, what looks like a knife-sharpening station, among other things. \"Here we are,\" Conway says. \"Camp me.\"\n\n\n\"Are you alone?\" you ask, noting the single, one person tent. \"I am now,\" Conway answers. \"I was with one of the patrol groups, but we got split up in all the ruckus. There were a bunch of useless men anyway. Pretty sure I was the only one who could operate a rocket launcher.\" You think of the civilian volunteers back at the wall, and wonder if Conway was paired with such people.\n\n\n\"So you just ditched them?\" you ask as you sit down on the log. \"Wasn't my choice. We carried packs with necessary supplies for a few days in the event we were separated or trapped. Once I knew I was gone, I booked it outta there. Found this place, set up shop, and ditched my backpack. Kept the duffel bag for carrying big finds,\" Conway answers.\n\n\n\"Aren't you heading back to Washington?\" you ask. Conway  chews his lip for a moment before answering, \"No. Not yet.\" You decide to leave it there. You don't want to bring up a possible bad moment in the man's past, so you change the subject. \"Where are we sleeping?\" Conway snaps at of his thoughts. \"Oh yes! Um, you can take the tent. I have no problem sleeping on the ground. Won't be the first time.\"\n\n\nYou nod, and take note of Conway's supplies. He has quite a few guns, an impressive knife collection, and whatever he's hiding in the duffel bag. It's definitely full, but you aren't sure of what. There's also plenty of food around, but no water to be seen. You wonder if Conway hid it, or needs more.\n\n\nAs you look around, Conway says, \"You planning on sleeping anytime soon, or are you just gonna sit there and stare at my guns?\" You climb into the tent, and try to sleep on the inflatable pillow and thin blanket.", "action_results": [{"action": "Rise and Shine", "result": "When you wake up, Conway is already up. From the way he's acting, you wonder if he ever fell asleep. You see five empty cans scattered around the area, more than three servings of breakfast. You decide not to comment, and pick up a can of instant mashed potatoes.\n\n\n\"Alrighty,\" Conway says as you eat, \"Today, I'm thinkin' we go out and look for more supplies. Specifically, more ammo for him,\" Conway points to an especially large gun propped against a tree, \"...some more food, and, of course, any other survivors we can find.\" \n\n\n\"Wait, what?\" you ask. \"If you were looking for survivors to rescue, why didn't you get my whole group back at the nature center?\" Conway goes quiet, similar to yesterday when you asked if he was headed to Washington. He finally answers, \"I'm not rescuing people.\"\n\n\n\"Speaking of which,\" he says, \"We'd better get moving. Your people are gonna start wonderin' where you went, and they could also be a supply drain. Early bird gets the arm cannon! Let's get moving!\" Not wanting to challenge Conway, you hop up and follow him out of the woods, and onto another car-choked road.\n\n\nYou scan the area for points of interest. You don't see anything, but Conway does. He points out something a few streets over, that you can't see. You tell him there's nothing there, to which he insists there is. \"I can't tell what it is,\" he says, \"But it has our colors. Let's go grab it.\"\n\n\nAs Conway leads you through the cars over to the next street, a lone zombie comes out from behind one of the cars. \"Aw, shoot,\" Conway says, and pulls a large knife out of his belt loop. He goes over to kill the zombie, and stabs the knife through its forehead. The knife is so comically large, it goes through the zombie's head, and sticks out the back three inches. \"Well?\" he says.\n\n\nThe thing he saw was a camo backpack. You unzip it and find several ammo magazines you don't recognize. \"Yes!\" Conway shouts, and pulls one of the cartridges out of the backpack. \"Here's just what I was lookin' for!\" You see a few other things in the pack, including a hunting knife. You pocket it for yourself, and examine the rest of the pack. It's mostly military-type stuff.\n\n\nYou look up, and see a small pack of zed coming through the cars towards you. \"Uh oh,\" you say, and grab your knife. Conway turns towards them. \"Looks like that rotter brought some friends!\" You go to the right, and single off one zombie. While Conway goes to town on the others, you focus on the one in front of you. When it's close enough, you force the knife into its face. To your satisfaction, the zombie dies instantly. You pull the knife out and let it drop to the ground.\n\n\nConway looks at what you've done. \"Excellent! You're learning,\" he says. \"Anyway, this is one awesome find. You wanna go for more, or should we go back with our find?\"", "action_results": [{"action": "Search for more", "result": "\"Let's keep going,\" you say confidently. Conway smiles. \"That's the way. Where to?\" \n\n\nYou travel up the road, cautiously watching for more zombies. It doesn't look like there's much more out here. The cars are all empty, and there's a severe lack of convenient backpacks. You think about searching elsewhere. \"There a problem?\" Conway asks. \"You reconsiderin'?\" You shake your head. \"Maybe we should go to where there's more buildings, and potential for supplies,\" you say.\n\n\nThe city isn't much more fruitful. As you look at the empty streets, you see something painted on a wall. At first, it looks like another call to Washington, but the message is different:\n\n\nNO MORE\n\n\nSTRIVE FOR BETTER\n\n\nA NEW WORLD ORDER\n\n\n\"Conway,\" you say. \"What do you think this is?\" Conway reads the message, and laughs. \"What the hell? What kind of garbage is this? 'New World Order?' Sounds like some lunatic wants to take on the government. The whack job's probably dead by now. You ready to head back?\"\n\n\nYou're disappointed at your lack of finding anything, but at least you killed a few zombies with your new knife. You're feeling more comfortable with it. You and Conway walk back to his camp.", "action_results": [{"action": "Head back", "result": "Conway happily loads his new ammo into his gun back at the camp, while you unpack the backpack. A lot of ammo, a few more knives, an empty water bottle, and a gold bracelet. \"Huh,\" says Conway. \"That looks familiar. I think someone used to wear that around. Uh....oh come on...what was his....Lincoln! That was it! Yeah, he used to have that, but this ain't is backpack.\"\n\n\nYou eat a light lunch, and talk to Conway more about Washington. \"You ready to leave?\" you ask, anticipating a bad response. Conway seems to have come to terms with whatever was troubling him. \"Yes, I think we'll leave soon. The only obstacle is a good vehicle. I can drive just about anything, but I want somethin' durable, not just some car on the side of the road. I plan to drive through the wastelands in style, know what I mean?\" You nod. There are benefits to a more durable vehicle for sure. You make plans to search tomorrow, and leave as soon as you find what you're after.\n\n\n\"Now that that's settled,\" Conway says. \"You up for a little game?\"", "action_results": [{"action": "A what?", "result": "Conway fishes two more guns out of his duffel bag. \"Follow me.\"\n\n\nConway leads you to the top of a small hill, overlooking another trashed street. This one, however, is full of the dead. \"The rules are simple,\" says Conway. \"You shoot the zombies. I did this to pass time, I have no shortage of ammo. Now that there's two of us, I suppose we should set up some rules.\"\n\n\nYou agree on ten points per killed zombie. Twenty if you steal a kill from someone else. You lose five points if you don't kill a zombie first shot. Conway seems very invested in the game, but you just see it as target practice. \"Alright,\" he says. \"Three, two...\"\n\n\nYou kill a zombie on the very first shot, standing next to a jeep. The next kill is in the driver's seat of a station wagon. \"I think bonus points are in order for that one,\" says Conway. Before you know it, you're into the game, too. You don't kill every zombie on the first shot, but you're decent. Conway, of course, has double your points by the time you've used up all your rounds. \"Good game,\" he says. \"We should head back, I guess.\"", "action_results": [{"action": "A Calling", "result": "Your walk back is uneventful. You still aren't sure what the point of that excursion was, but it's nice to get your mind off impending doom for awhile. Plus, as Conway said, there's no shortage of bullets.\n\n\nYou arrive back at the campsite as night is falling. \"Well, time to hit the hay,\" says Conway. \"Are we leaving for Washington tomorrow?\" you say. It's not that you're getting impatient, but you don't see a reason (beyond Conway's personal reason) for staying back. Conway slowly nods. \"Yeah. Yeah, we'll leave soon.\"\n\n\n\"Soon?\" you ask. \"Or tomorrow?\" Conway doesn't answer this time. You begin to question whether joining him was a good idea, and consider ditching him if you need to. As you retire to your tent, you hear a crackling noise from Conway's duffel bag. Quickly, he fishes out the object. It's a walkie talkie.\n\n\nChzzz.....Zhhcccc..tzzz....Hello? Anytzzzz....anyone there? Conway, is chzzzzzzzzzz....\n\n\n\"Yes? Hello, yes! Yes, this is Conway Matthews, deployed with the fourth wave? Do you copy?\"\n\n\nTzhhhhhh.....Chzzzz...... getting really bad outthcccczzzz....going to leave soon.....wanted to check for any others....tchzz.......tchzzzare you? Come to the......thczzzzz.....\n\n\nConway fiddles with the receiver in an attempt to make the signal stronger. \"I'm losing connection! Where are we supposed to go?\"\n\n\nTchzzzzzz....................341...tchzzzstreet.....local museum.....\n\n\nConway looks up at you in slow recognition. \"The museum,\" you repeat. Conway nods. \"Let's go. Now.\"\n\n\nYou quickly collapse the tent, while Conway packs various weapons into his duffel bag. \"We aren't gonna have room for everything,\" he says. \"It's either the guns, or the food. I can fit some of both, but we need to make our choice quick.\"\n\n\nMeanwhile, the person on the other end of the walkie talkie gives out more advice. \n\n\nStreets are crowdetchcchhh........be careful.....the dead aren't gchhhhhhhhh.......hundreds of them...in the streets........come quick.....we need to leave soon...\n\n\nYou can make out gunshots in the background. You can hear the same gunshots echoing through the city. ", "action_results": [{"action": "Mostly guns", "result": "\"Pack more guns,\" you say. \"We'll need them for the dead.\" Conway nods. You disassemble a large gun with Conway's instruction. After the duffel bag is full of guns, you're ready to leave. \"Come on,\" he says. \"Through the backstreets.\"\n\n\nYou can immediately tell what the others were talking about. Where the streets used to be empty (of zombies, not of cars), there are now vast hordes. They aren't moving in any direction, or at all for that matter. They just bump into each other and walk in circles. You and Conway elect to stay off the roads, and slip between buildings.\n\n\nMeanwhile, Conway keeps a conversation going with the other soldier. Through garbled radio speech, you hear him tell you what's going on. The dead are mostly avoiding the museum, which is why that's their pick-up spot.\n\n\nYou're sneaking past a rogue group of zed when the radio suddenly emits a loud burst of static. The group slowly turns their heads, and they growl at a potential food source. \"Oh, please no,\" Conway whispers. The dead slowly hobble over to where you're advancing. You don't know whether to keep sneaking or lash out, but Conway makes that decision for you. Whipping out his knife, he takes the top half the the closest zombie's skull off with one sweep.\n\n\nYou draw your knife, and take care of a few of the others. After the horde is cleared, Conway switches off the walkie talkie. \"Not gonna go through that again.\"\n\n\nYou slowly progress through the city amongst the waves of walkers. Eventually, the museum is in sight. You're surprised to see an actual helicopter guarded by a handful of soldiers. Conway switches the walkie talkie back on.\n\n\n\"We can see you, over.\"\n\n\nTchhhhhh....okay, that's good......These hordes are getting worse....no way you're gonna make it through here.....we can provide covering fire......run for it......\n\n\nYou look at Conway, and nod. The soldiers reveal several guns, and start firing on the group of zombies. Taking the chance, you follow Conway through the gunfire. A few zombies attempt to follow you, but you're moving too fast for them. When you get past the hordes, the soldiers wave to you and open the helicopter doors. \"GET IN!\"\n\n\nYou climb into the helicopter after Conway, with a sea of rotting flesh at your heels. You slam the door shut, and hear the helicopter blades whir to life. \"Come on! Let's get this bird off the ground!\" shouts one of the soldiers. The helicopter slowly lifts off the ground, with a few zombies holding on for dear life to the bottom. They slip free once you're airborne.\n\n\n ", "action_results": [{"action": "Airborne", "result": "The sky view of the city is quite depressing. The streets are full of cars and zombies, buildings sit demolished and broken, and you can see a few places that you recognize from before all this. It hurts to see them invaded by corpses.\n\n\nIn the helicopter, you are accompanied by three men (not including Conway). Roger seems to be the only one ordering people around, so you assume he's in charge. Ozzy, the pilot of the helicopter, silently minds his own business. The third soldier, Matthias, isn't dressed in a soldier's uniform. What he's wearing could only be classified as a 'makeshift doctor's outfit'. You wonder if he was involved with helping injured civilians.\n\n\n\"Where exactly are we aiming to land?\" asks Conway. \"There's another outpost just a bit north, with more gas stores,\" answers Matthias. \"That is, assuming we'll be the first to arrive. Communication's been lost for awhile, so it's just kind of a mad rush for survival at this point.\" \n\n\n\"And we have the ultimate goal of getting back to Washington, correct?\" you ask. Roger nods. \"It kinda depends on what mindset you have. Some have the 'save as many as you can, carry out our original orders' mindset. I personally follow the 'let's stay alive' mindset. Provided we make it back to Washington on two legs, we should be fine.\"\n\n\nYou stare out the window some more, watching the rivers of death move through the city.", "action_results": [{"action": "The landing", "result": "You've always kind of wondered what riding in a helicopter would be like. Now you know: boring, with a slight touch of fear of heights.\n\n\nFinally, Ozzy makes a short announcement. \"We're nearing the landing spot.\" Thank goodness. Suddenly, something starts beeping on the control board. \"What's that?\" asks Roger.\n\n\n\"We don't have enough to make it there,\" Ozzy says, with slight fear in his voice. \"At this rate, we'll have to walk the last few miles to get to the gas stores, and then take them back on foo-\"\n\n\nOzzy is interrupted by several metallic noises, like someone is dumping marbles onto the helicopter. \"What in the..\" says Roger. You look out the window, and are shocked to see a group of people firing at the helicopter.\n\n\n\"Making an emergency landing,\" says Ozzy. \"Brace yourselves.\" Roger stares out the window in disbelief. \"Why the hell are they shooting at us?\"\n\n\nTo your surprise, the shooters break into a run and follow the helicopter on its course downward. \"We're going to meet them when we land,\" you say. Matthias and Roger are already arming themselves. \"Well then,\" says Roger. \"Let's meet 'em.\"\n\n\nWhen the helicopter plunks down, and the blades whir to a stop, the shooters are ready at the doors. A gravelly voice commands you to come out, unarmed.\n\n\n\"That'll be the day,\" says Roger. \"We aren't doing anything of the sort. Actually, you're the ones who should be running. I'll give you five seconds. Five...\"\n\n\nFive is plenty for them. The shooters open fire, damaging the helicopter's window and hull. The soldiers quickly return fire, but the battle's pretty one-sided. The shooters definitely have the numbers, and the better guns.\n\n\n\"What do you want from us?\" asks Roger. This is the first time you're getting a good look at the shooters. They look horrible, dressed in filthy clothing, with generally ugly faces. Not a single one is clean-shaven or looks like they've had a haircut even once. \n\n\n\"We want your 'copter,\" grunts one of the shooters. \"We can't allow that,\" says Roger. \"We're headed back to Washington. You should come, there are showers, and fresh food, and-\"\n\n\n\"NO!\" the shooter angrily kicks a rock. \"We want the helicopter! And food! And books! And all of it! And guns! And snakes! And cell phones!\"\n\n\nThe soldiers look at each other in disbelief. \"These people have lost it,\" whispers Conway. Should you give up what you can, or try to diffuse the situation?\n\n\n ", "action_results": [{"action": "Give up guns", "result": "\"Okay,\" you say. \"We have extra guns. You can have some of them.\" This seems to pacify the people. You quickly go back into the helicopter and get the duffel bag Conway brought along. You empty it of guns, and offer a good amount (but not too much) of them to the people.\n\n\nYou are kind of shocked when the man walks up to you and takes the first gun, a pistol, out of your hand...in his mouth. He then proceeds to take guns off of you one by one. When he has what he wants, he backs off.\n\n\n\"Ftill wuff hewicoffter,\" he says through the gun in his mouth. \"What?\" The man spits the pistol onto the ground. \"We still want the helicopter.\"\n\n\nMatthias shakes his head. \"This is ridiculous. We should leave.\" Roger shakes his head. \"We can't, they'll gun us down.\"\n\n\n\"Is there any way we can work around this?\" you call to the man. He thinks for a moment. \"Yes. If we can't have the helicopter, we want...follow us.\"\n\n\nThe man promptly turns around and motions for you to follow him.", "action_results": [{"action": "Refuse to follow", "result": "You stay where you are. The other soldiers do the same. When the man sees you standing still, he loses it.\n\n\nHe throws his hands up in the air, and makes sputtering noises. He then proceeds to do some sort of angry dance, flinging his limbs around. The whole time, he's talking in broken English.\n\n\nFinally, he realizes he's in the presence of other people. He turns to you, and points at your stomach, then to your face. \"Follow.\" He follows up the action by raising a gun.", "action_results": [{"action": "Follow", "result": "Reluctantly, you follow the man. Roger stops you. \"You sure this is the wisest choice?\"\n\n\nConway chimes in. \"Yeah, these guys seem a little...'on edge'.\" You nod. \"I know this is dumb, but they have the firepower, and outnumber us two to one. We don't have another option.\"\n\n\nSlowly, your group follows the strange folk over to an empty parking lot. A group of dumpsters have been arranged in a defensive wall. Corpses litter the area. You can see piles of trash from discarded food, as well as several empty cans and bottles. Dirty mattresses propped against the dumpsters presumably serve as beds.\n\n\n\"Welcome!\" yells the man. The few people that were waiting at the camp stand up. They stare emotionlessly into your eyes. \"Sit down,\" says the man, gesturing to a spot on the ground. \"Oh,\" you say, \"You want us to...join you?\"\n\n\nUncomfortable, you and your group sit amongst the filthy survivors. \"So, now that you're part of us, you have to pass initiation,\" says the man. You sit up. \"Hold up,\" says Roger. \"We aren't joining you. That was never up for arguing.\" The man sticks out a pouty lip, and walks over to where Roger sits. Roger rises, and meets the man. \n\n\n\"Yes,\" says the man. \"You will be joining us for dinner.\"\n\n\nSuddenly, Roger pulls a gun from his belt and shoots the man in the head, killing him. Horrified, the remaining members of the other group fish around for their guns, and begin to fire aimlessly. You group stands up defensively, and you realize you don't have a weapon of your own. As gunshots ring around you, you hide under a dumpster. The other group quickly loses track of your people. You stay hidden under the dumpster, while the garbage group searches out your people. You see a pair of feet coming over to your dumpster.\n\n\n ", "action_results": [{"action": "Run away", "result": "Without thinking, you climb out form under the dumpster on the opposite side of the unknown enemy. You crawl over to the next dumpster to climb over, when you hear an excited, \"Found one!\" behind you.\n\n\nA bullet rips through your midsection, causing you to yell in pain. You hear a triumphant laugh behind you, and your attacker grabs you by the feet. You are dragged into the middle of the parking lot. The man who brought you here stands over you with a gun.\n\n\n\"This is what happens to people who don't join us for dinner,\" he says, and shoots you in the kneecap, immobilizing you. You yell out again, and receive a shot in the side. Several more bullets go through you, until you're barely alive. As your vision fades, the man's laugh pounds in your eardrum.", "action_results": [null]}, {"action": "Stay Put", "result": "Despite your fear, you stay put. The pair of feet walks up to you, and you hear the top of the dumpster being opened. Then, it closes, and you hear a dissatisfied, \"Nobody over here.\"\n\n\nThe people struggle to find any of your group, you scattered pretty quickly. As you hide, you make eye contact with Ozzy, who's hidden under an adjacent dumpster. You see fear in his eyes. He's slowly pulling a small gun out of his pocket, and holding eye contact with you.\n\n\n\"Well, well, well. Come out when you're ready, hooligans,\" the man who led you here says. The other group sits down in the middle of the parking lot, and begins to eat. \n\n\nOzzy slowly makes his way out from under the dumpster, out of sight of the others. You do the same. You sit behind the dumpster and think over your next move.", "action_results": [{"action": "Stay behind the dumpster", "result": "You stay behind the dumpster, and out of sight. To reveal yourself now would be suicide.\n\n\nAfter waiting for a few minutes, you peek out from behind the dumpster. The other group shows no signs of moving soon. Ozzy has crawled past the dumpsters and in the direction of the helicopter. When he sees you, he waves for you to follow him. You get down on all fours and crawl after him, staying behind the dumpsters.\n\n\nWhen you get far enough away, you see that the others have already escaped. \"Took you long enough,\" says Roger. \"I wanted to make sure it was safe, you say. Roger shrugs.\n\n\n\"Okay,\" Ozzy whispers. \"Let's leave while the Garbage Pail Kids are still having dinner.\" You follow the others back to the helicopter.\n\n\n\"None of their gunfire hit anything too important. We'll make it back, but it won't look pretty,\" Ozzy declares. The others breathe a sigh of relief. \"What about the windows?\" Matthias asks. \"We just won't be able to go as far up in the air, and if we get shot at again, we're toast, but we should be fine,\" Ozzy answers.\n\n\nYou board the helicopter, and start to lift off. During the entire thing, you're afraid the other group will come running back, guns in hand. Fortunately, they never do.\n\n\n\"Okay, as previously stated,\" Ozzy says, \"We'll be a few miles short of our target. Don't get too comfortable.\"", "action_results": [{"action": "Gas", "result": "You're on edge the rest of the ride, but nothing else goes wrong.\n\n\n\"What do you reckon happened to those people?\" Roger asks. \"The apocalypse can have a serious effect on some people,\" says Matthias. \"They might've been homeless people, or mental patients, or something like that.\"\n\n\nFinally, Ozzy brings the helicopter to a stop on the ground. \"Here we are,\" he says. Everyone gets out of the helicopter, and starts the trek over to the fuel stores. \"Let's hope there's any left for us,\" mutters Roger.\n\n\nAlong the way, you notice the bodies of zed scattered around. All of them were victim to a gunshot in the head. \"Someone came through here,\" says Conway, \"And they were goin' for it.\" You hope that whoever this was, they weren't searching for fuel. \"Come on,\" says Matthias. \"If there's competition, we have to beat them to the outpost.\"\n\n\nIt doesn't really matter how fast you ran. When you arrive at the outpost, it's obvious nobody has been through here. The area is packed with the dead. \"You've gotta be kidding me,\" says Roger. The fuel stores are visible, but the whole outpost is surrounded by a chain-link fence. There are no visible gates or entry points, but a large hole in one side of the fence explains how the zombies got in. \n\n\n\"Should we run and gun 'em?\" asks Conway. \"That depends,\" you answer, \"...on how much firepower we have.\"\n\n\n\"If it comes down to it, we might have to find another way through this,\" says Roger.", "action_results": [{"action": "Create a distraction", "result": "\"We don't have the guns for this,\" you say.\n\n\n\"I have an idea,\" says Matthias. \"If we could make more holes in the fence, and lure the dead out of the way....we'd have no issue getting what we need.\" \n\n\nConway volunteers to make some noise and distract the hordes. The rest of you split up around the fence. You are given a large knife to cut the fence. \"Okay,\" says Roger. \"We're all clear, correct? Cut through the fence, and as soon as there's enough room for the dead to make it out, you back away. Once we're all clear, I give the whistle, and Conway does his thing.\"\n\n\nYou go to work hacking through the fence. A few zombies take notice, and push up against the fence. \"Stay back,\" you whisper. Clink. The first fence loop breaks open. One of the zombies forces a hand through the hole. You kill it, and keep going. Clink. Clink. Clink.\n\n\nSoon, you have a sizable hole. You step back to see if the zombies can fit. It's a struggle, but eventually one of them forces its way through the hole. You decide you're done, and back up.\n\n\nYou wait a few minutes for Conway, but the gunfire never comes. Roger looks around in bewilderment. \"What's going on? He should've-\"\n\n\nRoger is cut off by the fence collapsing. The pressure of all the corpses shoving up against it caused the supports to snap. The pile of zombies struggle to their feet, and give chase. \"Fall back!\" yells Roger, and the team scatters.\n\n\n ", "action_results": [{"action": "Run", "result": "You blindly scramble through the forest, not thinking enough to follow someone else or even pay attention to what direction you're running in. You point yourself towards the helicopter, since you assume that's where the others are going.\n\n\nYou can easily outrun the horde, that's no problem. Once you're far enough away, your biggest concern becomes finding the others. You scan the forest in search of familiar faces, but find none. In panic, you continue towards the helicopter. The horde of zed has made its way further out, and a few eager corpses have already made it pretty far out.\n\n\nYou hear yelling from a few yards away, and see Roger running in the direction of the helicopter. You run up to follow, and call his name. He looks around, spots you, and waves you over. \n\n\n\"Come on!\" he shouts. \"Back to the helicopter!\" A few moments later, you hear gunshots nearby. The others. \n\n\n\"Should we go back?\" you ask. Roger doesn't answer, he's dead set on making it back to the helicopter. You hesitate, before following him. The zombies have advanced further, and you doubt you'd be able to come back safely if you turned around now.\n\n\nAs you make your way to the helicopter, you see the garbage people, the ones that shot at the helicopter, approaching in the distance. They must have heard the gunfire and realized their prisoners got free.\n\n\n\"Well....crap. This is a problem,\" says Roger, his voice wavering. You look behind you; the zombies haven't caught up to you yet, but if you keep wasting time, they will. You might be able to make it back to the helicopter before interacting with the garbage people to get a gun or something.", "action_results": [{"action": "Look For Your Friends", "result": "You resolve not to let the others die, and turn around.\n\n\n\"What are you doing?\"\" yells Roger, but you pay no attention. You maneuver around the first few zombies, and back into the woods. You call out names while searching for movement among the trees.\n\n\n\"Matthias!\" you yell, scanning the broken fence. \"Conway? Ozzy?\" you don't see anything, except advancing hordes of the dead. Suddenly, gunfire erupts from a few yards away. You see Conway firing at a pack of zombies with the signal gun.\n\n\nConway spots you, and breaks into a run. He's pointing at something behind you, but you're so focused on him that you don't notice the zombie right behind you. You narrowly avoid the monster's jaws, and push it to the ground. By then, Conway has caught up to you. \n\n\n\"Come on,\" you say. \"To the helicopter.\" Both of you take off. On the way, you ask where Ozzy is. \n\n\n\"I think he made it out before I did. He should be at the helicopter right now,\" Conway answers. \"As for Matthias, I don't kn-\" \n\n\nConway suddenly stops as a bullet hits him squarely between the eyes. You freeze with fear, and turn to see the garbage people standing before you. The leader steps out.\n\n\n\"Thought you could run away, huh?\" he taunts, and pops another shell into his shotgun.\n\n\n \n\n\"Here's what we do to runaways around here.\"\n\n\n \n\nBang!", "action_results": [null]}, {"action": "Go for the helicopter, get a gun", "result": "You realize you aren't getting out of this alive without a weapon, and run for the helicopter. The garbage people start to fire back, but that doesn't go to smoothly. Roger follows you into the cockpit, safe from the garbage people.\n\n\nYou scrounge around, and are rewarded with a small handgun with a full clip. Looking at the approaching horde, you realize the garbage people may not even be your biggest threat at the moment.", "action_results": [{"action": "Fire at the dead", "result": "The advancing hordes of zombies are closer and more plentiful, you decide. Plus, the garbage people will have to fight them off as well. You get into a defensive stance with both hands on the gun, and open fire on the horde. The gun's clip has thirteen bullets in it; you manage to kill six zombies before running dry. \n\n\n\"Here,\" says Roger, tapping you on the shoulder. \"Found more of them.\" he gives you another fully loaded clip. \"We had a bag stashed under the seat,\" Roger explains. \"For emergency.\" You ditch the empty clip and reload, before taking another shot.\n\n\nYou bring down twelve walkers this time, and notice that the garbage people are firing at the dead, too. In a moment, they'll fall back, you can get your people, and leave. Except you can't. It slowly dawns on you that the helicopter's still dead on fuel.\n\n\nMeanwhile (and unbeknownst to you), the garbage people realize they're wasting bullets on the zombies, and go to take out the real threat- you. The leader approaches the cockpit, out of your view. He sneaks right up to the door and kills you, without you ever knowing.\n\n\n \n\nIf it's any consolation, none of your group made it out, either.", "action_results": [null]}, {"action": "Fire at the garbage people", "result": "At the moment, the garbage people pose more of a threat to you than anything, you decide. You turn so you can see them clearly.\n\n\nThe leader is approaching the helicopter, so you fire at him first. You were aiming at his chest, but the bullet goes through his arm. It still cripples him, so it's done it's job. The other garbage people quickly catch on, and start firing back.\n\n\nYour gun's clip has thirteen bullets in it; you manage to kill three garbage people before you run dry. For a moment you're worried that you just made things a lot worse, but Roger passes you another fully loaded clip.\n\n\n\"We keep them under the seats,\" he explains. \"For emergencies.\" You ditch the old clip, and keep firing. Luckily, the garbage people's guns are louder than yours, and your gunfire combined with the hordes of the dead cause them to eventually fall back.\n\n\n\"There's one problem solved,\" you say. \"Now we just need to get our group back.\"\n\n\n\"Actually, that problem is also solved,\" says Roger, pointing into the trees. Conway, Ozzy, and Matthias are running through the trees towards the helicopter. They're being followed by a massive horde. You open the doors as wide as they'll go in preparation.\n\n\nWhen the three make it back, you slam the door shut and hide. \"Hopefully, the gunfire from that other group will draw the horde,\" says Matthias. The group sits quietly in the helicopter for a while. Soon, it becomes clear you'll be spending a long time in the helicopter. The dead show no sign of going away, and the growls, while faint, are a bit too close for comfort.", "action_results": [{"action": "Prepare to spend the night in the helicopter", "result": "Thankfully, the seats of the helicopter are soft enough to lay on. As the sun sets, you lay down. The group agrees to taking two-hour shifts to watch for garbage people or zombies, and warn the others. You volunteer for a later spot, so you can get some rest.\n\n\nThe night drags on, safe but very boring. When you wake up for your shift, it's almost light outside. \n\n\n\"Hey!\" you say. \"Why didn't you guys wake me up?\"\n\n\n\"It was my fault,\" says Ozzy. \"I just took the whole night.\"\n\n\n\"You shouldn't have done that,\" exclaims Conway. \"You have to fly this helicopter!\"\n\n\n\"Uh, not any time soon,\" Ozzy says, gesturing out the window. It's true. The dead are meandering outside, not too interested in letting you get your fuel.\n\n\n\"Looks like some action needs to be taken,\" says Matthias. \"So, what's plan B?\"", "action_results": [{"action": "Keep waiting", "result": "You keep sitting in the helicopter, with the hopes that the dead will eventually leave. Your food situation is decent, and you're prepared to spend multiple days here if you need to. \n\n\n\"We're really doing this?\" asks Ozzy. It's not the best plan, but it saves bullets and effort.\n\n\n\"Yeah, we are,\" you answer. Outside, it doesn't seem like your plan is working. The zombies are basically stagnant, not even walking around. They just stand there, like a creepy flash mob. You pray for a gunshot, or a  plane, or some noise to draw them away.\n\n\nFinally, Conway gets restless. He gets up, and takes a flare gun from out of his duffel bag. \n\n\n\"Conway, what are you doing?\" asks Matthias. Conway doesn't answer, but goes for the helicopter door. The rest of the group moves to stop him.\n\n\n\"Get off!\" Conway yells. \"I'm not gonna sit and wait any longer! Y'all want a distraction? I'll give you one!\" Conway yanks open the door, attracting the attention of a few zed. Conway fires a flare over the field, and then slams the door shut. The good news is the flare lands on the opposite side of the field, and most of the horde clumps around it. The bad news is that the door slam attracted a few stragglers over to you. The group immediately jumps up and readies their weapons. \n\n\n\"I'm gonna open the door and let a few in,\" Matthias says, \"Then we kill 'em. Let a few in, kill 'em, let, kill, repeat until they're gone. Ready?\" The first few step forward, and are eliminated quickly. Nobody's using guns because the noise would damage hearing, so there's just as much of a threat posed by the others' knives as the zombies do.\n\n\nOnce the dead are clear, you're open to grab the fuel. You waste no time getting over to the tanks, where the area is now empty of the dead. \n\n\n\"Lucky us,\" Conway remarks as your team fills gas canisters up. You lug them back over to the helicopter, and begin to fill up the tank. Ozzy goes in to watch the fuel gauge, while Matthias keeps watch of the horde. Three painful and long trips later, the tank is full.\n\n\n\"Come on,\" Matthias says, \"They're getting restless. Load up!\" Everyone piles into the helicopter, and Ozzy starts the blades. The horde, noticing the new potential for food, turns over to you. By the time they get anywhere near you, you're up again. \n\n\n\"Take that, growlers!\" Ozzy shouts over the engine.", "action_results": [{"action": "Airborne (Again)", "result": "Once in the air, Roger addresses Conway.\n\n\n\"That little stunt, ripping open the helicopter door like that? Not gonna fly with me,\" Roger says. Conway stands up.\n\n\n\"Excuse me, but did anybody get so much as a scratch on them? My little 'stunt' got us to safety,\" Conway retorts.\n\n\n\"You're lucky that's the way things went. Next time, it might turn out different.\"\n\n\n\"Yeah,, if someone who didn't know what they were doing tried it! I've had several years of experience on the battlefield.\"\n\n\n\"CONWAY MATTHEWS, LET ME REMIND YOU THAT YOU ARE TAKING THAT TONE WITH FIRST SERGEANT ROGER MILLS! I WILL NOT ALLOW YOU TO ENDANGER THE LIVES OF MULTIPLE SOLDIERS AND A CIVILIAN! DESIST AT ONCE!\"\n\n\nBoth soldiers rise and stare each other coldly in the eyes.\n\n\n\"Guys? Right when we're flying over hordes of man-eating monsters is not the best time to get physical,\" Ozzy warns from the front.\n\n\n\"Sit down, and obey my word,\" Roger hisses. Conway begrudgingly takes a seat, and holds a stare with Roger. Matthias makes eye contact with you, and you see a slight twinge of fear in his eyes. He's been with Roger for a while, so if he's worried, you're worried. Roger finally sits down next to you, as far away from Conway as he can get.\n\n\n\"We won't make it to Washington,\" Ozzy suddenly says. This gets the attention of everyone immediately. \"We don't have the fuel. We'll get close, but we don't have enough, even with the extra fuel.\"\n\n\nEveryone looks around at each other. \n\n\n\"So we need to find another reserve,\" Roger says. Matthias pulls out a pocket map, and a pen. \"Where will we run out of fuel?\"\n\n\n\"I think about here,\" Roger says, pointing to a spot on the map. It's in Oregon, not far from the border. \"There aren't any fuel reserves there, far as I know,\" Roger continues.\n\n\n\"Any chance we could get the fuel from cars?\" you offer.\n\n\nRoger shakes his head. \"This thing won't take car fuel, of any kind,\" he says. \"Unless somebody just happens to have filled their tank with jet fuel.\" \n\n\n\"We'll figure something out,\" Matthias says. The subject is dropped. You just don't want to think about what will happen if you can't find any fuel.", "action_results": [{"action": "Continue", "result": "For the next few hours, the ride is uneventful Everyone is minding their own business, and the cabin is silent, except for the occasional noise from Ozzy, at the controls.\n\n\nBefore you know it, you're drifting off, and then it's a new day. You look out the window. The terrain has changed. You're no longer above a city of bodies, but empty roads, with only a few zombies lurking around. You're getting closer to Oregon, which means closer to the fuel issue. You don't want to think about when that time comes. Luckily, Roger takes your mind off it.\n\n\n\"Breakfast time,\" he says, fishing around for a backpack. The team searches out cans to make a meal out of, and that's when it becomes apparent that you're very low on food. Three cans left to split between five people, for another two days, and that's assuming the fuel thing goes smoothly, which you can guess it won't.\n\n\n\"We're gonna have to touch ground again,\" says Matthias. Nobody wants to admit it, but yes, you'll have to be at the same level as the dead once more. \"Lower us down,\" Matthias says to Ozzy. \"We need to run some errands.\"\n\n\nFood is definitely easier to come across than helicopter fuel, but you're still worried. There's been plenty of time for every store and market to be emptied of all its goods. When the helicopter sets down and the engine dies down, you scan for a sign of food. The only promise is a road sign telling you fast food places nearby, and there isn't much opportunity there.\n\n\n\"Bingo,\" Conway suddenly says. He's spotted a farmhouse through the trees. \"That's where we'll find what we're looking for.\" The group slowly goes to follow, but Roger stops.\n\n\n\"Wait. We need someone to stand at the helicopter and guard it,\" he says. \n\n\n\"I can do it,\" says Matthias. \"Unless, anyone else would rather take the spot.\"", "action_results": [{"action": "Volunteer to watch the helicopter while the others leave", "result": "\"I'll do it,\" you say. Matthias nods. The other soldiers go over a plan for the farmhouse, while you take a defensive position behind the helicopter door. You figure that it's extremely unlikely you'll see anybody, you still want to remain vigilant. You sit up straight and try your hardest to stay awake.\n\n\nThe others have been gone for a worryingly long amount of time, and you decide to go check on them. You get out of your seat, and go look at the farmhouse. From where you are, you can't see any fighting or danger, and you haven't heard any gunshots. You assume they're just doing a thorough search, and cross your fingers for some fresh bread.\n\n\nAs you turn to get back in the helicopter, you are met with a bow and arrow pointed at your face. Its user is a man with long blonde hair that covers his eyes. \n\n\n\"Water,\" he says, in a parched voice. \"Give it to me.\" Shaking, you slowly nod. You climb into the helicopter, and fumble around for the pack with the bottled water in it. You find the pack, but then you remember your gun.", "action_results": [{"action": "Shoot him", "result": "As quick as you can, you turn to shoot the attacker. Your bullet goes over his shoulder. He shouts, and releases an arrow into your chest. You cry out, and the man yanks the water pack from your hands.\n\n\n\"See ya,\" he says, and slams the helicopter door shut. He gives a little wave before leaving.\n\n\nYou struggle to get the arrow free from your skin. That arrow had a lot of power behind it, and you end up staining the seats of the helicopter with your blood, and doing all kinds of irreversible damage to your chest. When the soldiers come back, you're barely alive. Your final moments are of being shaken back and forth by Conway, who is trying to get you to sit up.", "action_results": [null]}, {"action": "Give him the water", "result": "Not wanting to risk conflict, you hand the bag over to the man. He takes it, and slings it over his shoulder.\n\n\n\"Thanks. Now get out,\" he commands. You oblige. \"I see your stuff,\" the man says from behind you, the arrow in his bow brushing against your back. \"I see those guns. You got any food back there? I'm hungry.\"\n\n\nYou can't think of anything to do, so you try to stall. \"Who are you?\"\n\n\n\"Name's Cedar. What's it to you?\"\n\n\n\"Why are you stealing from me?\" you ask, careful not to say 'us'. It's better if he thinks you're alone.\n\n\n\"I had people. They ditched me. Now I got nothing but this bow, and I need basic stuff to live. Food, Water. I'm gonna get it fro-\"\n\n\nCedar suddenly takes a bullet to the forehead, and slumps to the ground. Conway comes running up from the trees. \n\n\n\"Did he hurt you?\" Conway asks. You're surprised to see that he cares so much about you. You shake your head, and go to retrieve the water pack. Matthias and Ozzy have large cases of seed and preserved food in their hands.\n\n\n\"Okay, one more hurdle,\" Ozzy says. \"We get gas in Oregon, and we're home free.\"", "action_results": [{"action": "Continue", "result": "The trip continues, and you quickly lose track of time. It's daytime, so you know you shouldn't be sleeping, but you can't see where the sun is out the windows from where you are. Of course, time doesn't really hold much value anymore. You can't be late to Washington.\n\n\nRoger and Conway still refuse to speak to each other. Each just acts like the other isn't there. Whenever one speaks, the other is silent, and they make great effort to avoid eye contact. The others soldiers have caught wind of this, but nobody seems to be making an effort to help the situation. You decide to leave it alone for now.\n\n\n\"Good news! We're crossing the California-Oregon border.....now!\" Ozzy shouts from the cabin. The team rejoices, but you're just worried. The small pocket of fear in your gut grows. \"We don't have much fuel left. I'm probably going to touch down soon,\" he finishes.\n\n\nYou land on the outskirts of a small town. \"There weren't any fuel-holding outposts, as Roger said, but there is an outpost here, so it's a possibility that there will be fuel here, in one form or another,\" Ozzy declares. \"Who's guarding the helicopter this time?\"\n\n\nConway volunteers, most likely to get away from Roger. Nobody in the group objects, so you don't either. The less time those two spend together, the better. Conway takes a seat in the cabin, while the rest of the group sets out for the town.\n\n\n\"There's not much hope that this place is still inhabited,\" Roger says on the way. \"Except maybe by the dead. As long as we're careful, there shouldn't be much of an issue.\" Roger points out a large metal wall in the distance. It's made up of three metal fences, put one after the other. You can see a few places where the fence broke, and entire panels are missing.\n\n\nYou approach the outpost with caution, but stop when you realize the whole thing is empty. When you step into the compound through a hole in the fence, the ground is littered with zombies, all of them shot in the head.\n\n\n\"What?\" exclaims Matthias when he sees. \"How could this have happened? Unless...\"\n\n\n\"This wasn't the dead,\" Roger finishes. \"Somebody did this. Somebody took down this outpost. We had three tanks, and a heavy machine gun stationed at this outpost, and somebody wiped it clean.\" You stare in disbelief. If there's a threat that's stronger than the U.S. military's stores, that's all the more reason to get to Washington immediately.\n\n\nThe group splits up to search the most likely areas where fuel would be, if there was a landed helicopter or a truck containing jet fuel around. But, of course, the attackers didn't leave so much as a single can of food, much less a tank of jet fuel.\n\n\n\"We're gonna have to look elsewhere,\" Matthias declares.\n\n\n \n\n ", "action_results": [{"action": "elsewhere", "result": "\"The only other place I think can think of that would hold the fuel we need is an airport or something,\" Matthias says. \"And that wouldn't even work.\"\n\n\nYou try to think of places you've seen a helicopter. News helicopters? No, the probability of there still being fuel in them is too low. There are no more outposts nearby, so military aid is useless. The only thing left you can think of is recreational helicopters, but the thought of a 'posh' country club in a town this small is, once again, very unlikely.\n\n\n\"We don't have to take the helicopter, do we?\" you suggest. \"We could leave it here, and take something easier to transport, like a bus or a car.\" The team seems to consider the thought.\n\n\n\"Helicopter fuel is only going to get harder and harder to find,\" Matthias points out. Finally, Roger agrees.\n\n\nYou find several cars abandoned on the side of the road, and take the two in the best condition for your group. Having two cars is better for your group because it's less cramped, and you can sit Roger and Conway in opposite vehicles. You siphon the gas from the remaining cars, and drive back.\n\n\nConway is less than pleased with the group's decision. \"We need the helicopter!\" he insists. \"We skip over so much crap that way!\"\n\n\nRoger, for the first time since the incident, faces Conway sternly. \"We're taking the cars,\" he says.", "action_results": [{"action": "Continue", "result": "Moving everything from the helicopter to the cars is not an easy task. It takes up most of what's left of the day, and your shoulder is aching when you're done. After the helicopter is empty, everyone splits into the cars. Roger puts a 'Come to Washington or Die' message on the helicopter door. \"Just in case,\" he explains.\n\n\nOregon is surprisingly zombie-free, after what you saw in California. The streets are empty. Not full of dead corpses or defeated zombies, but completely empty. It's strange. \n\n\n\"Odd that there are no walkers here,\" Ozzy says, echoing your thoughts. \"Think there's a reason for it?\"\n\n\n\"Maybe we cleared them all out,\" Roger suggests. \"It would make sense for the guards to want to keep the dead as far from sanctuary as possible.\" You decide it's still out of the ordinary for there to be absolutely no zombies around.\n\n\n\"Maybe it's because there's no food?\" you suggest. \"I mean, we've known them to follow noises and the smell of food, so maybe Oregon ran out.\" The team seems to be thinking over this possibility, when all your theories are disproven.\n\n\n\"Holy hell,\" Roger whispers. You're looking out over the city of Portland, Oregon- or, more accurately, what's left of it. Every single zombie that was missing from Oregon as packed tightly into the streets of Portland. They have no room to move, and a chorus of hungry growls emanates over the city.\n\n\n\"No way we're getting through that,\" says Roger. \"We should've kept the helicopter.\" \n\n\nYour team gets out of the car. Conway and Matthias get out of the other car. You group up and look out over the maze of rotting flesh that stands between you and salvation.\n\n\n\"Think we could sneak through it?\" suggests Matthias. \"If we cover ourselves in zombie goop, we might be able to pass by.\"\n\n\n\"I say we go in guns ablaze,\" Conway says.\n\n\n\"Are you insane?\" Roger shoots back. \"Do I need to remind you of the warning I gave you before? You want to fire a gun in that?\" Roger points to the zombie-filled streets. \"If you sneeze hard enough, you'll be dead. Firing a single shot would be simultaneously slitting all of our throats.\"\n\n\nConway doesn't respond, but you can tell he isn't going to heed Roger's words. \"Let's go with Matthias' plan, then.\"\n\n\nEasier said than done. Extracting one zombie from the masses proves to be scary and difficult. But, Ozzy manages to pull it off. He comes back with a bloody corpse slung over his shoulder. \"Let's cut this sucker open,\" he says, \"...and have a bath.\"\n\n\nThe fumes are dizzying. Days of rotting organs and waste come billowing out of the cadaver. What's worse is that you're tossing those very guts over your shoulder, on your back, and on your front. After a few minutes, you'd pass for some pretty smelly zombies. You really wish you hadn't ditched the helicopter.\n\n\nYou approach the city slowly, your group forming a tight pack. To get separated would mean death. You slowly walk through the crowd, scared to even brush past a zombie. One by one, the dead look at you, decide you aren't good to eat, and stumble off in another direction. More often than you'd like, a zombie is idly standing in your way, meaning you have to try to slip past it with as little contact as possible.\n\n\nEventually, you realize you're passing through the city center. You notice a lot of uniformed soldiers among the gobs of zombies. But, the plan is working. You can tell you're going ot make it. Not a single zombie even bothers to look at you anymore. You're just another mindless walker. Everything seems to be going on course- until Conway spots a tank in the middle of the road, and starts to go for it.\n\n\n\"No!\" Roger hisses as quietly as he can. A few nearby zombies stare curiously at him for a moment. \"Conway, stop! You are ruining the plan! Get back here!\" But, of course, Conway isn't listening.\n\n\n\"The plan doesn't matter anymore,\" Conway whispers back. \"If I get control of that tank, we could clear out a path. There'd be no trouble.\" He grows closer and closer to the tank, with his teammates behind him, begging him to stop and turn around. Finally, he reaches the tank, and struggles to open the hatch at the top.\n\n\nYou notice Roger pulling his silencer gun out of his belt. \"No,\" you say, stopping him. \"He isn't worth the bullet, or the attention it'll draw.\"\n\n\n\"You sure about that?\" Roger asks back. \n\n\nYou're too late to do anything, anyway. Conway rips open the hatch to reveal a zombie that was waiting inside. Surprised, he takes a step back, and slips off the tank. He lets out a bloodcurdling scream as he cradles a bite on his arm. The scream causes the idle moaning of the zombies to stop. Slowly, unanimously, the zombies all turn their heads towards a screaming Conway, and the rest of your group. They seem to have caught on to the fact that you aren't zombies.\n\n\nAs the space closes in around you, and your innards are divided up between six different sets of hands, you kind of wish you had let Roger shoot Conway.\n\n\n \n\n ", "action_results": [null]}]}]}]}]}, {"action": "Go with the group to raid the farmhouse", "result": "You let Matthias take over guard duty. Whatever you can do to speed things up, you will. Roger brings the rest of the group closer to the farmhouse.\n\n\n\"There's a strong possibility that someone's still alive in there, and they're surrounded by tall grass. Here's what we'll do. We split up, and approach the house from all sides. If you see someone in the window, fire at them. If you here gunshots from someone else, rush the house. The first person to get in the house needs to clear the ground floor, and we'll move from there. Clear?\"\n\n\nEveryone nods, and the plan commences. You get set on a straight path to the front door of the farmhouse, while the others spread out. The entire walk over, you listen intently for gunshots, or any sign of disturbance. It never comes, and suddenly you're at the front door. Remembering your instructions, you draw your gun and search the ground floor.\n\n\nAs it turns out, the house is abandoned. Searching the place top to bottom yields no humans. The fate of the owner is revealed when you check the basement: a lone corpse, hanging from a noose.\n\n\n\"He had such a good setup,\" comments Roger. \"Wonder why he did it.\" But, of course, there's no time to wonder. Everyone spreads out to search the house again, this time for food. You continue in the basement. \n\n\nThe basement is actually quite empty, making you wonder if someone else cleaned the place out first. Just as you are about to give up, you see a message scrawled on a drywall. It looks like it could have been written with blood.\n\n\nTHEY TOOK EVERYTHING. I'M SORRY. IT'S NOT WORTH IT ANYMORE. THE WORLD IS ENDING, AND NOBODY WILL BE SAVED. BETTER TO DIE WITH DIGNITY THAN BE TORN APART BY THE ROTTERS.\n\n\nYou disagree, but respect the man's choice, and leave the basement. When you come back up, you see that the others were luckier.\n\n\nOn your way back, you look over the findings: several small wooden crates packed with cans, and some nonperishables. Not bad, and it's more than you'll need for five for a day.\n\n\n\"Any trouble?\" Roger asks Matthias as you load the food up. \"Yes, actually,\" Matthias responds. \"One guy. But, he wasn't a problem. I'm fine.\"", "action_results": [null]}]}]}]}, {"action": "Get armed, and go outside to get the fuel", "result": "\"We shouldn't wait anymore,\" you say. \"Let's go out, and get the fuel.\" The others are hesitant, but Conway takes your side immediately. \n\n\n\"We know them,\" Conway says. \"We know how they act, how they think. They won't move anywhere until they have reason to, and that could be days. We don't have the capacity to sit and burn off our food, and then try to fly back. Let's go, and let's go now.\"\n\n\nAfter everyone has armed themselves, Conway opens the door. The first few zombies turn in your direction, but are quickly subdued by Roger. Roger's gun has a silencer, so he's the go-to shooter for the moment.\n\n\n\"The fuel is over there,\" Roger whispers, gesturing with his gun. \"If we stay tight to the tree line, we might be able to sneak past them.\" The team nods, and rushes to follow the orders. The dead seem to dislike the closed-in trees, and have gravitated over to the fields. By staying among the trees, you have no issues. Almost.\n\n\nAs you travel, one curious zombie notices you, and starts to stir. Roger hesitates, and decides not to shoot. \n\n\n\"Just keep going,\" he whispers. As you walk, the zombie steps in close.\n\n\n\"What the hell are you doing?\" demands Conway. \"Shoot it!\" \n\n\nRoger shakes his head. \"Not worth the bullet,\" he explains, but Conway won't hear it. He draws his gun, without a silencer, and points it at the zombie. You grab him.\n\n\n\"No! That's worse!\" you whisper-yell. \"You'll attract the whole field, and more!\" Conway, of course, doesn't listen. He fires, and the zombie drops to the ground. Behind it, several heads slowly turn towards you, and you hear a low growl.\n\n\n\"Run,\" Roger says, not bothering to whisper. The team breaks into a panic, with people struggling to get past each other. Without the cover of silence, a few start to shoot at the zombies. It almost seems like you'll be able to keep them at bay.\n\n\n\"Come on!\" Ozzy says. He leads the group in the direction of the fuel tanks. Unfortunately, a considerable portion of the zombies chose to stay back, and inhabit the empty lot. Now, you're sandwiched between two hordes, and you hear the familiar clicking of empty guns.\n\n\n\"I'm out,\" says Conway, furiously pumping the trigger. \n\n\n\"Same,\" Roger says in dismay. \"Thanks a million, Conway.\"\n\n\nThe dead close in, and you look for a way out, a weak spot, a break in the horde, anything. But you don't see it. You go to grab for your knife, but the horde is too close. A set of jaws rips into your neck from behind.", "action_results": [null]}]}]}]}]}]}]}]}, {"action": "Help Ozzy attack the group", "result": "You look at Ozzy, and point to the other group. He holds up his gun and nods. \n\n\nYou position yourself behind a dumpster, right next to the leader of the other group. You'll grab him and hold him hostage, so that the others will let you go. You wait until the right moment...\n\n\nThe man decides he needs to get up, and you strike. As soon as he's on his feet, he's on the ground again, with you holding him down. \"Nobody move!\" You yell.\n\n\nSadly, while your plan would have worked, Ozzy wasn't on the same page as you. He fires his gun in an attempt to hit the leader, but instead hits you in the chest, killing you.", "action_results": [null]}]}]}]}, null]}, {"action": "Try to talk to them", "result": "\"Hey,\" you say. \"Listen. We can't afford to give anything up. Is there a possibility that we could work around this?\"\n\n\nThe man holds up his finger, and draws something in the air. Then, he looks at you expectantly. When you don't know how to respond, the man becomes angry. He furiously draws some sort of picture in the air with his finger over and over again.\n\n\n\"What? What is it? What do you want?\" you ask. The man finally gets fed up with your incompetence. \"WAAATTTTEEERRR!!!!\"\n\n\n\"We can't spare, um, any water at the moment,\" you say, almost afraid that he'll flip his lid. Instead, the man gets quiet. \"Follow,\" he finally says, and begins to walk away.", "action_results": [null, null]}]}]}]}, {"action": "Mix of food and guns", "result": "\"Pack both,\" you say. 'We'll need some of both.\" Conway nods, and begins packing. You take half the food and half the guns, burying the rest so no one else can get to it. After the duffel bag is full, you move into the streets.\n\n\nYou can immediately tell what the others were talking about. Where the streets used to be empty (of zombies, not of cars), there are now vast hordes. They aren't moving in any direction, or at all for that matter. They just bump into each other and walk in circles. You and Conway elect to stay off the roads, and slip between buildings.\n\n\nMeanwhile, Conway keeps a conversation going with the other soldier. Through garbled radio speech, you hear him tell you what's going on. The dead are mostly avoiding the museum, which is why that's their pick-up spot.\n\n\nYou're sneaking past a rogue group of zed when the radio suddenly emits a loud burst of static. The group slowly turns their heads, and they growl at a potential food source. \"Oh, please no,\" Conway whispers. The dead slowly hobble over to where you're advancing. You don't know whether to keep sneaking or lash out, but Conway makes that decision for you. Whipping out his knife, he takes the top half the the closest zombie's skull off with one sweep.\n\n\nYou draw your knife, and take care of a few of the others. After the horde is cleared, Conway switches off the walkie talkie. \"Not gonna go through that again.\"\n\n\nYou slowly progress through the city amongst the waves of walkers. Eventually, the museum is in sight. You're surprised to see an actual helicopter guarded by a handful of soldiers. Conway switches the walkie talkie back on.\n\n\n\"We can see you, over.\"\n\n\nTchhhhhh....okay, that's good......These hordes are getting worse....no way you're gonna make it through here.....we can provide covering fire......run for it......\n\n\nYou look at Conway, and nod. The soldiers reveal several guns, and start firing on the group of zombies. Taking the chance, you follow Conway through the gunfire. A few zombies attempt to follow you, but you're moving too fast for them. When you get past the hordes, the soldiers wave to you and open the helicopter doors. \"GET IN!\"\n\n\nYou climb into the helicopter after Conway, with a sea of rotting flesh at your heels. You slam the door shut, and hear the helicopter blades whir to life. \"Come on! Let's get this bird off the ground!\" shouts one of the soldiers. The helicopter slowly lifts off the ground, with a few zombies holding on for dear life to the bottom. They slip free once you're airborne.", "action_results": [null]}, {"action": "Mostly food", "result": "\"Pack more food,\" you say. \"Food is more important than guns.\" Conway nods. You empty the food stash into the duffel bag. \"Come on,\" Conway says once the bag is full. \"Through the backstreets.\"\n\n\nYou can immediately tell what the others were talking about. Where the streets used to be empty (of zombies, not of cars), there are now vast hordes. They aren't moving in any direction, or at all for that matter. They just bump into each other and walk in circles. You and Conway elect to stay off the roads, and slip between buildings.\n\n\nMeanwhile, Conway keeps a conversation going with the other soldier. Through garbled radio speech, you hear him tell you what's going on. The dead are mostly avoiding the museum, which is why that's their pick-up spot.\n\n\nYou're sneaking past a rogue group of zed when the radio suddenly emits a loud burst of static. The group slowly turns their heads, and they growl at a potential food source. \"Oh, please no,\" Conway whispers. The dead slowly hobble over to where you're advancing. You don't know whether to keep sneaking or lash out, but Conway makes that decision for you. Whipping out his knife, he takes the top half the the closest zombie's skull off with one sweep.\n\n\nYou draw your knife, and take care of a few of the others. After the horde is cleared, Conway switches off the walkie talkie. \"Not gonna go through that again.\"\n\n\nYou slowly progress through the city amongst the waves of walkers. Eventually, the museum is in sight. You're surprised to see an actual helicopter guarded by a handful of soldiers. Conway switches the walkie talkie back on.\n\n\n\"We can see you, over.\"\n\n\nTchhhhhh....okay, that's good......These hordes are getting worse....no way you're gonna make it through here.....we can provide covering fire......run for it......\n\n\nYou look at Conway, and nod. The soldiers reveal several guns, and start firing on the group of zombies. Taking the chance, you follow Conway through the gunfire. A few zombies attempt to follow you, but you're moving too fast for them. When you get past the hordes, the soldiers wave to you and open the helicopter doors. \"GET IN!\"\n\n\nYou climb into the helicopter after Conway, with a sea of rotting flesh at your heels. You slam the door shut, and hear the helicopter blades whir to life. \"Come on! Let's get this bird off the ground!\" shouts one of the soldiers. The helicopter slowly lifts off the ground, with a few zombies holding on for dear life to the bottom. They slip free once you're airborne.", "action_results": [null]}]}]}]}]}, null]}]}]}]}, null]}]}]}]}]}]}, null]}]}]}, null]}, null]}]}]}]}, null]}]}]}, null, null]}]}, null]}]}, null]}, null, null]}]}]}]}]}