{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=1153", "context": "", "first_story_block": "A letter arrives in your mailbox and informs you that your Grandfather in dying. He would like to see you before he dies. You pack your things at once and get a good night sleep before the trip.\n\nThe next day, you are in your pick up truck and heading to your grandfather's house for the first time in many years. The last time you were there, you were only 6 years old. You would play hide and seek in his huge mansion and remember getting lost every time. You were never really close to him but...you can't help but think that he is leaving you something big.", "action_results": [{"action": "floor it!!! Vrrrrrrrrooooomm....", "result": "You are navigating and driving at the same time when you come to a fork in the road.\n\n\"That's funny.\" you think. \"The map shows no fork in the road here.\n\nOne road is dirt and seems to lead into a desert area...a wooden sign reads \"Goblin Valley 30 miles.\"\n\nThe other road is paved and seems to go on for miles and miles. A sign is posted that says \"Interstate 666 junction 100 miles.\"\n\nYou find Goblin Valley on the map but it is'nt anywhere near where you need to go and you can't even find Interstate 666.\n\nWell, you need to choose one...", "action_results": [{"action": "dirt road to Goblin Valley.", "result": "The landscape seems to change a bit as you drive for what seems like forever. The idiot light for \"LOW ON GAS\" flickers on and announces just that.\n\nYou look around and take in the beautiful mountainous range. Just as the sun slips behind the back drop a strange shadow is cast on some rock formations that surround either side of the road making them seem to move as you travel along. You flick on your headlamps and get ready for the night.\n\n\"Maybe this is Goblin Valley?\" you say to yourself.\n\nOff in the distance you make out a large sign. Soon it is in readable range.\n\nIt reads:\n\n JUNCTION 53 --5 MILES\n\n GOLD FLAKE --20 MILES\n\nEither way you look at it, you need gas. If there is no gas station at the junction, you just might be in trouble.\n\n ", "action_results": [{"action": "go on and pray for gas...", "result": "You drive for 5 miles and come to the junction. Even with the limited cast of the headlamps, you can still make out rock formations scattered across the valley. You notice a flashing light down a gravel road that diverts off the dirt road.\n\n\"Could this be a mini mart\"  you ask yourself. Not only are you in need of gas, you are very hungry.\n\nIt has been many years since you visited your uncle and don't remember being on such a deserted road.\n\nYour gas guage reads bone dry.\n\n ", "action_results": [{"action": "go check out the light.", "result": "Driving on the gravel seems to wake you out a lull that you seem to have been in. The rocks kick and ding against your truck making this road a bit louder to drive on. Every now and then you hit a pothole or have to go around one of those rock mounds you seem to be surrounded by.\n\nA very large hole on the right comes into view and you swing your steering wheel left coming into contact with a rock formation. You strike  the mound almost head on throwing you forward and the seat belt jerking you back but not before your head strikes the dashboard making your vision blur momentarily.\n\nA low, gutteral sound comes from somewhere close by... almost like a shriek.\n\nAll goes quiet...\n\nYour head begins to throb as you try to get out your truck. The door is wedged into the side of the what is left of the rock formation. You feel a cold substance dripping down your left arm.\n\n\"Oh, no...Am I bleeding?\" you think.\n\nSlipping to the passenger side you make your way out of the truck.\n\nYou stagger over to the front and find the headlamps are still working but the engine is now off. You notice a black substance spattered against the side of the truck. It looks like oil.\n\nThe last thing in the world you need now is no transportation.\n\nOff in the near distance is the flashing light still beckoning you to come hither.\n\nYou have no choice...well, you could go back to the main road and try hitchhiking with the first car that comes by...which might never happen.\n\n\"Hey, what about my cell phone...Yeah, I got triple A.\" you think.\n\n ", "action_results": [{"action": "check out the flashing light.", "result": "Reaching into the glove box of your truck, you grab your 6 D cell MAG flashlight.\n\n\"This could double as a weapon.\" you think to yourself as you start down the gravel road toward the light.\n\nTime goes by and you can make out a neon sign flickering on and off in the distance. It starts to get colder by the minute and your jacket doesn't quite keep you as warm as you want to be.\n\n\" This is truning out to be more than I bargained for.\" you say in a whisper.\n\nSuddenly a CRACK echoes in the distance and something whizzes by your face. You drop to the ground behind one of the rock formations. CRACK....CRACK....something imbeds itself deep into the formation you are hiding behind.\n\nIs someone shooting at me?\n\nCRACK...\n\nThe noise seems to be coming from a far distance but definitiely directed at you.\n\nWhat do you do...", "action_results": [{"action": "make a run for the neon sign.", "result": "Coming out of hiding, you make a dash for the neon sign. Your body warms up in no time as you run as fast as have ever run in your life. An occasional bullet whizzes by and kick up a little dirt but never seems to hit you.\n\nFlashing on and off reads \"Captain Trip's Diner\". You notice the small white building and another neon sign in the window advertizing a nice bowl of chili.\n\nYou focus on the sign knowing how hungry you are and how good that would taste but fail to notice the man you bowl right into.\n\nYou quickly get up and help the elderly man up you just knocked down.\n\n\"Hurry, inside...or ya might just get shot!\" the man says.\n\nBoth of you make your way into the diner.", "action_results": [{"action": "time for some chili.", "result": "The diner seems quaint and in decent shape for being out in the middle of nowhere. The old man steps behind the cashier counter and pulls out a double barrell shotgun from behind it and begins loading it.\n\nHis face is stern and weathered. It seems he has seen battle in his lifetime, you can't quite tell if it has been WW2 or Vietnam. The man screams out something you can't understand and a woman of about the same age appears from behind a set of doors.\n\nShe is morbidly obese and has a huge apron on with spurts of food and liquid stained from use.\n\n\"Get this man something to eat.\" the old man bellows and the woman dissapears behind the double doors. She returns with a large bowl of chili and some saltines. The food opens up your oifactory senses as she sets it at the table in front of you.\n\nDropping the flashlight  beside you on the seat you sit down and start to open the crackers. The chili smells great but what if you would prefer something else. Should you ask for a menu instead or enjoy their hospitality and chow down.\n\n\"Well eat up boy.\" states the old man. \"It's on the house.\"\n\nHe walks around the counter and begins looking out the glass doors of the diner. Looking for a shooter perhaps.\n\n\"Why was someone shooting at me?\" you ask.\n\n\"Eat now and questions later.\" says the man looking out into the moonlight.\n\nThe woman begins to go back to the kitchen but asks you if you like a soda before leaving.", "action_results": [{"action": "ask the woman for a menu", "result": "Slowly opening the menu, you find a small scrap of paper with something written in pencil. It reads:\n\nKIDNAPPED\n\nPLEASE HELP\n\nYou close the menu and look around. The woman is staring at you with a terrified look from behind the kitchen swing door. She disappears as the old man looks at you and then toward the kitchen doors.\n\n\"What the heck is going on?\" you think.\n\nIf this old man is holding an obese woman against her will, I've got to do something....right? ", "action_results": [{"action": "attack the old man with your mag light when he returns", "result": "Firmly grabbing the mag flashlight, you bring it up from behind the counter and swing it in the direction of the old man. The light lands flush with his right shoulder knocking him off his feet.\n\nSoon he is looking up at you with a confused expression. You grab his shotgun and point it down at him.\n\nThe woman returns and tosses you the keys to a vehicle. \"Let's roll...\" she says.\n\nYou follow her out the back of the cafe and slip into an old 70's dodge van. You notice the side of the van says \"Pinball Wizard\" and the seats are nice and soft. You slide in the drivers seat and the woman sits passenger. The van easily starts up and soon you are rolling down the road and out of Goblin Valley.\n\n\"Thank you so much.\" My name is Alice she explains. She goes on to explain her dilemma:\n\nApperently the old man was as crazy as they come and she was kidnapped by his whole family. She has been living with this family for months pratically running their cafe business. At night they would return to the families cabin in the Goblin hills and she would be chained to a bed where she would sleep.\n\nRecently, there has been a feud going on between the father and his sons as to who would own the cafe when the old man's father died. The two inbred sons of the old man were the ones shooting at you.\n\n\"I basically slaved in the kitchen and served all the food.\" \"I've tried and tried to get someone to help me but either they would get caught by one of the family members or they would refuse to help.\" Alice says.", "action_results": [{"action": "drive to Gold Flake.", "result": "Leaving Goblin Valley feels good and you open your window a little to get some fresh air. Soon the rumble of the van's smooth running engine puts you in a drowsy state.\n\nSuddenly, Alice screams and points a finger out toward the road ahead...\n\n \nQuickly looking out in front of you a little ways you see a man waving in the middle of the road. He seems to be yelling something but you can't make out what he is saying. You are going too fast to slow down. You honk and honk but he doesn't budge.\n\nWhat do you do?", "action_results": [{"action": "you try to swerve out of the way.", "result": "You quickly pull the steering wheel to the left trying to avoid hitting the man. The squeal of tires are heard as the van is thrown off it's wheels and your body is thrown through what was left of the windshield. You hit the ground with a hard THUD and skid into the dirt!!\n\nYou look up in time to see the van fly over you and come crashing down in front leaving bits and pieces of itself on the road as it goes into a frenzy of flips and rolls. The engine ignites and the whole van becomes engulfed in flames. It finally comes to a halt, upside down in a patch of weeds on the side of the road . The flames from the van light up the whole area.\n\nYou feel something wet on your face and realize it's blood...your blood. It seems to be gushing out of side of your head. Your hair becomes matted as you feel around for the source of the blood. You feel a sharp pain over your left  ear and realize the whole left side of your face is deeply cut and the ear is dangling from the side of your head.\n\nFeeling lightheaded, you attempt to stand up and reassess your situation. \"What about the kidnapped woman I was with?\" you think. \"I have got to see if she is alright.\"\n\nBarely able to walk, you make your way over to the burning wreckage. Holding on to the left side of your face, you look for anything that can help stop the bleeding. You find a beach towel laying on the side of the road next to the wreckage. Next to the towel is a human foot severed at the ankle. It could only be that of the kidnapped woman.\n\nSticking the towel on your face, you begin to scout around for the man who started this whole accident in the first place.", "action_results": [{"action": "where could he be...", "result": "Walking down the side of the road  you notice rows and rows of corn in the moonlight.\n\n\"When did I enter a cornfield?\" you think as you hold the towel firmly to the left side of your face. It seems you have stopped bleeding for the time being but you are in need of immediate hospital attention.\n\nYelling for anyone that might be within ear's distance, you stumble upon an old farm house.\n\n\"Where the hell am I?\" you think. \"I've only been walking for a few minutes.\"\n\nThe buzz of the street light next to the mailbox is loud but begins to flicker on and off. You notice an old sewage drain pipe sticking out of the ground a few feet further down the road.\n\nSuddenly, you feel something wet hit what is left of your left cheek. \"Am I still bleeding?\" you ask yourself as if waiting for someone to answer. Again...another drop on your head.\n\n\"It's raining.\"  you say out loud.\n\nSoon it begins to pour. You are starting to get wet.\n\nTry to find somewhere dry or die of pneumonia...\n\nWhat to do...", "action_results": [{"action": "try knocking on the door to the farmhouse.", "result": "The farmhouse shutters slam open and closed as the wind kicks up. You knock loudly on the door but no one answers.\n\nRain begins to come down and you find yourself stuck. You can stay on the porch or try the storm drain.", "action_results": [{"action": "stay on the porch and wait out the rain.", "result": "Standing on the porch, you look among the high stalks of corn in front of you. In the distance is a scarecrow swinging in the wind. It almost looks as if it's dancing.\n\nSuddenly, the door to the farmhouse opens and a little girl comes out dressed in a night gown. She seems to be in a trance, her eyes fixated on the dancing scarecrow. The girl walks down the porch steps and into the rows of corn. The pouring rain doesn't seem to phase her.\n\nMaybe this girl is a sleepwalker....", "action_results": [{"action": "try to get the girl out of the rain", "result": "You run out into the corn after the girl but soon are lost. You scream out for the girl and are suddenly met by the scarecrow. He stands above you on a long wooden pole. Large eye sockets in the burlap make for a face. He seems to be looking down on you.\n\nThe wind begins to die down and the rain stops. The little girl comes out from behind the rows of corn her eyes fixated on you now. Not a drop of rain has hit her as she is dry from head to toe.\n\nThe girl points to you and the scarecrow begins moving on it's own!!\n\n\"Bubba won't hurt you.\" states the girl.\n\nThe scarecrow bends over and picks a flower from a nearby bunch of dandelions. It slumbers over to the girl and outstretches his hand. The girl takes the flower and puts it in her hair.\n\nYou can't believe what your seeing. Soon, you and the scarecrow are walking deeper into the rows of corn. Out of sight....out of mind. You are content following the happy scarecrow...\n\nThe little girl steps back onto the porch and waves toward both of you.\n\nYou wave back.\n\nYou are never seen or heard from again.\n\n \n~THE END~\n\nYou got the \"dark night of the scarecrow\" ending.", "action_results": []}, {"action": "break into the farmhouse and wait out the storm.", "result": "The stone fireplace is already lit. Soon you are fast asleep in the warmth of the large recliner in front of the fire. The rain pours outside but you are warm and dry.\n\nYou don't notice the scarecrow now standing in the corner of the room. You don't notice him slowly motion toward you, sickle in hand...\n\nSLASH!!!\n\n \n~THE END~\n\nyou reached the \"dark night of the scarecrow\" ending.", "action_results": []}]}, {"action": "try the storm drain.", "result": "\"That famhouse looks a bit creepy.\" you think to yourself as you run for the drainpipe.\n\nThe mouth of the pipe is sticking out just above the weeds that surround the base of it. It looks big enough for your to crawl into.\n\nLooking down into the drain pipe is like trying to look around a cave without any light. It's pitch dark.\n\nJust then the street lamp goes out and suddenly you are surrounded by pitch blackness. You can only hear the rustling of the corn in the wind...and a voice coming from inside the pipe.\n\n\"Come on down....down here they all float....\n\nThere is nowhere to run since you can't even see your hand in front of your face....or a white gloved hand slowly rising out of the mouth of the drainpipe, grabbing onto your blood caked hair and pulling you down...down...down.", "action_results": [{"action": "did you find the flashlight from the van wreckage?", "result": "LIAR!!!!\n\nThere was no flashlight from the van wreckage.\n\n ", "action_results": [{"action": "Liars go to hell...", "result": "Blood begins to pour from your face again as the white gloved hand continues to pull you deeper into the bowels of the pipe.\n\nAppropropriate odors fill your senses and you begin to scream and puke at the same time. Maniacal laughter answers your screams and you lose consciousness.\n\nSplash!!\n\nYour body floats face down in a sea of sewage. Lightining from the world above momentarily illuminates your surroundings exposing a creature that resembles a giant spider...only much bigger. Next to the spider stands a circus clown laughing and pointing a finger at your lifeless body.. His other gloved hand covers his mouth exposing jagged teeth.\n\nI guess the clown was right...things DO float down  here...he he he.\n\n \nTHE END\n\n \nYou have reached the Stephen King's \"IT\" ending.", "action_results": []}]}, {"action": "if not...", "result": "You feel like your falling.  The mysterious hand releases your matted hair and you scream out in fear .\n\nAAAAAHHHHHHHH!!!!!!\n\nSplash!!\n\nYou find yourself at the bottom of the drainpipe and about 5 feet of what you could only think  of as sewage.  The water broke your fall as you try to make out what just happened. It is still pitch black but now you are soaked.\n\nSlowly coming to your feet, you feel a presence of someone else close by you. A cool breeze coming from your right chills you to the bone.\n\n\"Who's there!!\" you demand.\n\nWho pulled you down into this dark, stank, sewer. You could have sworn you heard a voice just before you were pulled down here.\n\nYou start to make your way toward the breeze, arms outstretched like a lost, blind person.\n\n\"I have got to get out of here.\" you think.\n\n \n ", "action_results": [{"action": "plug your nose and follow the breeze.", "result": "While following the breeze you begin to think of your Grandfather and his huge mansion you visited when you were a child.\n\n\"Could I have been wrong in hoping for lots of money after my he dies?\" you wonder.\n\n\"I wish I never left the house. \" \"I'll never see my Grandfather now.\" you think.\n\nA shutter of certain doom  fills your mind when you notice a light up ahead about 100 feet. It seems to  be bouncing around the air from side to side...almost hypnotically. \n\nA sense of happiness and comfort starts to creep into your mind and an overwhelming need to follow the bouncing light just up ahead.\n\nIt kind of reminds you of an angler fish drawing in on it's pray...", "action_results": [{"action": "follow the pretty, bright light.", "result": "\"There IS someone in here!!!\" screams the bouncing light.\n\n\"Hurry, get a stretcher!\" it says. \"QUICKLY!!\"\n\nStumbling out of the other end of the drain pipe you see the wrecked van on the side of the road. Two police vehicles, a fire truck, and the coroner's car are all surrounding the area. Puffs of smoke are all that come out of the once blazing van. Rain is still coming down hard and the rescue crews seem to be working fast.\n\nThe paramedic that spotted you stumbling around in the dark tunnel, turns off his flashlight and helps you onto a stretcher.Ttwo others begin wheeling you toward the paramedic van. You begin to feel lightheaded as they attach an oxygen mask to your face.\n\n\"Boy, his face got  chewed up pretty good.\" says one EMT to the other.\n\n\"Could he have been a survivor of this crash?\" asks the other EMT.\n\n\"I don't know but I guess he has alot of questions to answer.\" the other replies.\n\nThey both close the doors of the paramedic truck and motion for the driver to take off. As the van slowly pulls away from the crash site you can still see out of the back windows.\n\nA lightning flash momentarally reveals a figure of a clown standing at the exit of the drainpipe you just came out of. The clown is wearing a bright yellow suit and white gloves. His red hair is wet against his head and instead of a smile painted on his face, there is a evil grimace exposing rows of sharp, yellow teeth.\n\n \nTHE END\n\nYou reached the Stephen King \"IT\" ending.", "action_results": []}]}]}]}]}, null]}]}, {"action": "you just plow right through him.", "result": "Feeling you have no other choice, you hit the man head on going at least 90 mph. Nothing but his hand is visible as it flaps in the wind on top of  the mini-vans front hood. After about a minute of flapping, the hand disappears from view.\n\n\"We just murdered somebody.\" the woman says.\n\nAfter slowing down to normal highway speed, guilt seems to creep in and you both begin to wonder if the man is still alive.\n\n\"Should we go back?\" she asks.\n\n ", "action_results": [{"action": "let's go back...", "result": "You make a U-turn in the middle of the deserted road and make your way to where you struck the man. Your hands are shaking and you feel confused as to what just happened.\n\n\"Do you think he still might be alive?\" asks Alice looking as scared as you do.\n\nHer head darts around looking for any sign of the man.\n\n\"No way!!\" you reply.\n\nYou drive over the area twice and only find a piece of cardboard with some words written on it. Getting out, you retrieve the piece of cardboard and hold up against the headlight beams. You can make out the phrase: \"Thanks for the ride...\"\n\nYou get back in the van and drive on.\n\n\"Must have been a hitchhiker.\" you say to Alice \"We can report the accident when we get to a town.\"\n\nYou drive on.", "action_results": [{"action": "drive on...", "result": "\"It's strange that anybody would be out on this old dusty road in the middle of the night.\" you think as you start to pick up speed.\n\nSoon, Alice is asleep in the passenger seat. You turn on the radio hoping to pick up a news station but nothing but static crackles through the 6x9 speakers. You hit the \"CD\" button and AC/DC's \"Highway to Hell\" comes on.\n\n\"Nice...\" you think. \"This should keep me awake until we get to a town.\n\nThe music drowns out the thud you DON'T hear from in the back seats of the van.\n\nWhile jammin' to the tunes supplied by your newly aquired ride, you feel something cold against your throat. You look in the rearview mirror and almost scream.\n\nStaring back is the man you hit on the road. He is wearing a wool beanie on his head and an orange jacket (like the ones the road crews wear). He is not looking to healthy since you smacked him with your van. One of his eyes is missing and his face is spattered with blood. His left cheek looks crushed and his jaw snaps when he opens his mouth to say...Thanks for the ride!...before he plunges the knife into your throat.\n\n \n~THE END~\n\nYou got the \"Creepshow 2\" ending.", "action_results": []}]}, {"action": "don't look back...keep driving down the road", "result": "Soon you notice the sun coming up over the horizon. You welcome it with open arms as you turn down your vizor from the sun's morning rays. \n\nAlice is sound asleep as you turn on the radio. An evangelical preacher is the only thing on the AM station. He is set on sending your soul to hell if you don't repent...something like that. The FM channel sends out a faint sound of mariachi music.\n\nDeciding to hit the \"CD\" button, you quickly fill the van with what sounds like AC/DC's \"Highway to Hell.\" You crank it up to drown out Alice's snoring.\n\nYou wish you could be snoring right now.\n\nA sign comes into view. It reads: ENTERING THE TOWN OF GOLD FLAKE...and soon you find yourself in what looks like a old ghost town.\n\n ", "action_results": [{"action": "explore the town of Gold Flake", "result": "You park by a nearby tree next to the main road. Most of the what's left in this town seems to have been built in the 1800's. One building reads \"Saloon\" in bleached out black letters over a double doorway. The doors swinging to and fro in the wind.\n\nYou try to wake Alice up but she won't budge. \"She must be exhausted from the night's activities.\" The images of hitting that poor man rushes back into your memory.\n\nI have got to find someone that lives here...anybody.\n\nWalking down the main road, you spot another dilapidated old building that reads: Sheriff's office.\n\n ", "action_results": [{"action": "go see the sheriff", "result": "You walk all around the building and look in the dust filled windows. Not a sign of life. You doubt if anyone actually lives in this ghost town.\n\nTired and a bit confused you wonder what to do next. The only other building still fully standing is the saloon.", "action_results": [{"action": "go check out the saloon...you could use a drink.", "result": "You find the saloon a shambles.\n\n\"I'm not gonna find anything here.\" you think.\n\nThe piano that once played into the night is full of cobwebs and some of the keys are missing. Behind the counter you see a dusty jug of whiskey. It looks as if there might be a swig or two left in the bottle.\n\n\"Man I'm thisty...I could go for an energy drink about now but this sure looks good...\" you say out loud.", "action_results": [{"action": "take a swig or two", "result": "The liquid goes down your throat like fire but somehow quenches your thirst.\n\nYou continue to explore the saloon with the whiskey bottle in your hand...just in case.", "action_results": [{"action": "continue to explore", "result": "As you walk down the dusty hallway, you notice a staircase to a floor with doors down one side of the wall. This must be a hotel as well....ah....sleep sounds good right about now.\n\nSuddenly, a crash is heard and a man rushes out of one of the rooms. He is wearing a cowboy hat and a long dusty trenchcoat.\n\nThe man is stocky and tall and seems to be missing one major detail....his eyes.\n\nThe man looks down on you and points his hand at you sneering. Fire seems to fill the black holes for eye sockets. He jumps down from of the second floor railing and lands on his feet right in front of you.\n\nWhat will you do....? ", "action_results": [{"action": "Do you have the whiskey bottle? If yes...", "result": "The bottle shatters over the cowboy's face making him stagger backward. He attempts to regain his balance and is met by a swift kick in the stomach.\n\nThe man let's out a yell and falls on his back not moving. You slowly work your way toward his face unable to comprehend why this man has no eyes...just empty holes. Blood trickles down his face.\n\nYou notice a pronounced chin on the man and think he looks a little like John Travolta. \n\nLeaving the saloon, you are met by a swarm of angry bees. They begin buzzing around you. You soon feel very sleepy. You begin hearing a ticking noise inside your brain.\n\n\"A watch....\"", "action_results": [{"action": "if you have the pocket watch from outside the mini-mart...", "result": "Soon, you find yourself following the angry bees. They lead you out of town and into a nearby field where you see people yelling a someone that is on his back. They seem to be angry with the fallen man.\n\nYou run up to a nearby tree and take a closer look. Crouching behind the tree, you are  hidden behind some tall sage brush.\n\nThere is a black man on his back and tied to a fallen tree trunk. Most of the men and women surrounding him are wearing old 18th century clothes. One lady in a large bonet screams at the man calling him racial and vulgar words. Another man with a pitchfork steps on the black man's hand and motions for a large knife a child of of maybe...14 is holding.\n\nPulling your gun from the back of your pants you try to listen to what the people are saying. You cock it and wait .\n\nYou can't quite make out the victim's face but an overwhelming sadness fills your heart.\n\nAAAAHHHHHH!!!\n\nThe black man screams in horror and pain as the man with the large knife begins hacking off his right arm. Blood begins to run from his hand.\n\nA young woman next to the old lady in the large bonet begins to cry uncontrollably as the others laugh and chant out the words: Candyman...Candyman....Candyman...\n\nThe boy who once held the knife begins pouring a golden substance that you instantly notice as honey over the black man's body and the bees begin to buzz. The buzzing seems to be coming from your brain.\n\n\"Give me my bride!!!!\"\n\nThe sun is fully over the horizon now. You raise the gun to shoot....but who.\n\nYou could put the black man out of his misery...or...shoot at the crowd.\n\n ", "action_results": [{"action": "shoot at the victim", "result": "Your aim could have been better.\n\nThe bullet makes it's way into the large tree log where the black man is tied to. Bits of bark\n\nThe old woman screams and points in your direction. Soon the small crowd is heading in your direction looking angry and mean. They leave the man tied to the tree to die...covered in bees.\n\nYou look for somewhere to run but find nothing offers sanctuary. You try to shoot the gun but find it jammed. You toss it at the man with the pitchfork but he easily dodges away from it.\n\nThe buzzing in your brain becomes unbearable.\n\nSoon they are on you...\n\n \n~THE END~\n\n You have reached the \"Candyman\" ending.", "action_results": []}, null, null, {"action": "shoot at the crying young woman.", "result": "Your aim is true. The bullet enters the neck of the crying woman and she falls on top of the victim now covered in bees. She begins touching the man's face and shoulders and soon her head falls lifelessly on top of his. The mob is in awe of what just happened.\n\nSoon, the bees consume the mob and slowly both the woman and the man get to their feet. Hand in hand they motion toward you. The buzzing becomes louder as both the woman and man embrace, bees consuming their bodies.\n\n\"Thank you.\" the woman says. It seems to whispered into your heart. You feel a great joy and relief for the couple.\n\nHappiness overcomes you and you settle down next to the tree. Soon you drift to sleep in a deep relaxing slumber.\n\nYou awaken in your truck. It's parked in front of a sign on the side of a dusty old road. It reads: Goblin Valley 5 miles ahead. \n\n\"Wow, what a dream.\" you think as you fumble in your pockets for your keys. Instead you find an old pocketwatch. You open it and find the sketch of the two you saw in your dream. The happiness warms your heart as you find the keys in the ashtray of your truck. You head on to Goblin Valley and to see your uncle...\n\nIt's getting dark and you got to get moving.", "action_results": [null]}, null]}, {"action": "if you don't have the pocket watch...", "result": "The bees continue to buzz around you relentlessly. You decide to run out into the main road in hopes the bees won't follow.\n\nYou run out into the road and right into someone standing in front of the sheriff's building. You get knocked off your feet with the sun glaring down on you.\n\nWhen your eyes focus, you make out the sillohuette of a medium sized man wearing a cowboy hat looking down at you. He blocks the sun from your eyes and extends an arm out to help you back up.\n\n\"Man, I'm allergic to bees.\" you say with a chuckle.\n\nThe man helps you up to your feet and he offers you a seat inside the sheriff's building.\n\nThe man is wearing a light tan police uniform. He is about your height and weight but considerably older. He looks at you and smiles exposing a gap between his two front teeth. He turns and unlocks the door and motions you in.\n\nSoon you both are sitting and enjoying a couple of bottles of cold \"Crush\" orange sodas.\n\n\"What brings you here?\" he asks as he takes a long drink of his beverage.", "action_results": [{"action": "I was hitchhiking and was dropped off here...", "result": "The man smiles and offers you another frosty crush from his buzzing freezer.\n\nSoon he is on a CB radio and states he is escorting you to your grandfather's house since \"it's something to do.\" he states\n\nYou and the sherriff drink beverages and drive out of Gold Flake. You relate the crazy story of how you ended up here and he just laughs and drives on.\n\nSoon you are at your grandfather's house. He and long lost relatives are happy to see you and relates old memories of times past.\n\nYour grandfather leaves you the old mansion and you end up moving in.\n\nAll is well.\n\n~THE END~\n\nYou reached the \"quick and painless\" ending. No movie relation to this ending. Go back and try again.", "action_results": []}, null, null, {"action": "I'm enjoying this delicious beverage...duh!!", "result": "The sheriff looks at you with a frown, the gap teeth dissapear behind his lips. He begins to fiddle with his sherriff's badge on his uniform. He pauses and begins to smile again.\n\nThe room is very dusty and is split in half by a large desk. A book shelf runs across the back wall behind the desk and the sheriff and is filled with books...all caked with dust. You notice one is missing.\n\nthe sheriff offers you another drink before you even finish the first. You are so thirsty you accept. He disappears behind a half door with a little table top attached and goes over to a loudly buzziing refrigerator.\n\nAs he twists the caps off the bottles with a PSSSSSZZZ...he introduces you to a man standing behind you.\n\nYou swing around off the chair and are met by another man. This man is a little younger than the sheriff. He wears a black cloak and is missing his eyes. He reaches out and touches your chest with his fingers. \n\nYou feel a blast of cold penetrate your chest and you pass out... ", "action_results": [{"action": "where am I?", "result": "You slowly come into consciousness. Your eyes are blurry but you can make out objects moving around you. You smell an incense burn like old wood. Your eyes fixate on someone standing over you. This person is not human but part animal. He looks half goat.\n\n\"Have I been drugged?\" you think.\n\nLong, dark horns twist out of the man's skull and hook around behind his human ears. His nose and teeth are of a goat. He wears a red robe and begins molding something out of clay with his human hands.\n\nYou look around and see other cloaked figures dancing around you. You are the center of attention at this little get together. You try to move but are unable. Rough rope bind your arms and legs to what looks like a poorly made cross. You and the cross are hanging upside down.\n\nGROAAAN....\n\nA groan comes from next to you and you swing your neck around and see someone else in the same position you are in. This man looks much older than you are.\n\nThe goat man seems to notice you are fully awake now and begins a maniacal laugh.", "action_results": [{"action": "what the heck is going on...", "result": "The moaning man seems to be dying. He lays on his own wooden cross but wears a black cloak like those dancing around you. His eyes flicker open and you notice right away who this old man is. He is your grandfather!\n\nYou scream for someone to help him but no one moves a muscle. At closer view, you notice all those in black hoods have no eyes. The goat man comes into your peripheral view and you turn your head to see.\n\nThe goat man twists a wax figure over a strange bowl filled with a viscous, bubbly fluid. Screams seem to be eminating from the bowl. Large horns make up the lid and a pentagram is etched on the golden surface of the bowl.\n\n\"Thanks for coming my boy....aaahhh ha ha.....\" whispers your uncle to you.\n\n\"You are saving my life.\" he states as his eyes dissolve into black pits like the man you saw in the saloon.\n\nThe goat man drops the figure into the bowl and a burning consumes your body. You scream in horror as the others lift the crucifix on its end and into a small hole in the ground. \n\nYour last image you see is your uncle rising off of his crucifix. He looks a lot like you....wait...he is you now.\n\n~THE END~\n\nYou reached the \"Devil's Rain\" ending. ", "action_results": []}]}]}]}]}, {"action": "if not...", "result": "The cowboy with no eyes clenches your neck with a grip like a vice. You beat on his chest but to no avail. He will not let go.\n\nSoon...you black out.", "action_results": [null]}]}]}, null]}]}, null]}, null]}]}]}]}, {"action": "ask to use the restroom", "result": "You notice a narrow hallway just past the restroom on your right. It is very dark so you flick the switch next to an old wooden coat rack nailed to the wall.\n\nFlorescent lights flicker on revealing a large room at the end of the hall. The door to the room is propped open and you can see inside. Large boxes marked ammo are stacked 3 high. and a large gun rack sits against the far wall. There are 8 or 9 rifles in the rack.", "action_results": [{"action": "grab a gun", "result": "As soon as you enter the room, a loud shrieking noise fills the air. You whirl around to see what is making such a hideous noise.\n\nOn the walls are motion sensors that just detected movement... You. \n\nJust as you realize what has happened, the old man enters the room. His face looking a little worse for wear. You notice his eyes have changed from the yellow you saw earlier to a strange red that seems on the verge of being orange. His mouth opens exposing sharp, shark-like teeth.\n\n\"You little bastard.\" yells the old man over the shrieks of the motion sensors.\n\n\"I've saved you from the goblins and all you can do is snoop around back here.\"  \"You human's are so predictable.\"\n\nAs he speaks, you watch in awe as his body starts to contort and change in front of your eyes. His eyes begin to get bigger and rounder and gray hair sprouts all over his face and neck. The whole time he just stares at you in disgust.\n\nYou back away in horror as the man crouches down on all fours and his breathing starts to become more rapid. He shuts his eyes in pain and his skin seems to come alive, bubbling and turning a dark shade of green. Long grayish black hair sprouts from his head hanging down in front of his face.\n\nThe shrieks of the sensors seem to throb in your brain...\n\n ", "action_results": [{"action": "quick...grab a gun off the rack.", "result": "Keeping your eyes on the transformation before you, you reach back with your right arm and grab the first gun your hand touches. Swinging it forward you quickly bring the gun up to your cheek and aim it at the creature.\n\nBy now, the thing before you doesn't even resemble the old man you were sitting at the diner with. More like a creature you would battle back in the old days you used to play Dungeons and Dragons.\n\nThe green, hunched over creature before you launches itself directly in your direction with large claws instead of hands outstretched and aiming at your throat.\n\n ", "action_results": [{"action": "pull the trigger", "result": "You quickly pull the trigger and.........nothing. The trigger doesn't seem to budge.\n\nSuddenly you get knocked back by the creature's force running into the gun rack behind you. The gun rack falls back onto the floor and you on top of it. You try to roll off but the creature quickly throws it's weight on top of you causing you to yell out in pain.\n\nQuickly, the goblin swipes at your throat with it's talon like claws ripping open a large gash of flresh blood and flesh.\n\nYou stare up at the goblin as it licks it's claws of your blood with a black tongue.\n\nYour last thought is...\"Damn the safety button.\"\n\nTHE END\n\nYou reached the \"Gargoyles\" ending.", "action_results": []}, {"action": "knock him away with the rifle", "result": "Using the butt of the rifle, you swing it at the creature's face, connecting with it's nose. Black ooze spatters out of it's nostrils and onto the gun and wall behind you. It makes a low grunting noise and falls back into a near corner of the room.\n\nA look of painful surprise crosses it's face as it makes for the hallway and back into the diner.\n\nQuickly, you undo the safety switch on the rifle you just used for a bat, aim at the creature's backside, and pull the trigger.\n\nInstantly, the creature drops to the ground, the bullet penetrating his spine. Raising the gun toward the creature's head, you pop another one for good measure entering his skull. Black ooze begins to pour out of the wounds you made.\n\nJust when you are about to pull out your cell phone and take a couple of pics of your prize kill, the heavy set woman enters the room. You seem to have forgotten all about her and her awesome chili during the commotion.\n\n\"Thank you\" \"Thank you....\"\n\nYou stare at her as she approaches you with arms outstretched as if to give you a big hug.\n\nThank you....", "action_results": [{"action": "the least you could do is give her a hug...", "result": "You drop the gun unable to comprehend what is going on.\n\nThe woman that made the delicious chili runs over to give you a big hug. Tears roll down her cheeks as she repeats the words: Thank You...Thank You...Thank You...\n\nAs you embrace each other, 3 men with rifles enter the room. The woman backs away and looks suprised at the newly aquired company. All three men are in camoflauge and two are wearing cowboy hats. The other is wearing a cap that reads \"Truckers do it in convoys.\" \n\n\"Alice?\" asks one gunman.\n\n\"Toby!!!\" she cries and runs over and hugs all three men.\n\nSoon the men are shaking your hand in appreciation for killing what they call a \"Gargoyle.\"\n\nToby is Alice's husband and both are big rig truck drivers. Toby states that they recieved a shipment to drop off at this place...Captain Trips Diner.\n\n\"We thought it was a strange shipment for a diner since the haul was 2 dozen rifles an ammo.\" Alice says.\n\n\"While we were unloading it, the old man motions these ...winged creatures to attack us while he kidnaps my Alice.\" Toby continues.\n\n\"That was two days ago...we could'nt get close enough after the gargoyles ran us off in our truck. I called for Sheriff Reeves here to assist me.\"\n\n\"People been disapearring around here for years cause of these damn Gargoyles.\" states Sheriff Reeves. \" You killed the last of it's kind.\" \"We killed the rest of them up in a cave in the hills. This one was a master shape shifter. The only way you can tell is the eye color.\"\n\n\"We saw your truck back there....sorry about the shooting. \" \"We were aiming for the shape shifter.\" states Toby.\n\nSoon, you make your way with your new friends toward Toby and Alice's rig. They offer you a ride to the city your grandfather lives in.\n\n\"It's a little out of the way but it's the least we can do for saving my life.\" Alice says with a smile.\n\n\"I'll make you another bowel of my chili before we go.\"\n\nYou grin from ear to ear.\n\n \n~THE END~\n\nYou got  the \"Gargoyle\" ending and mastered this storyline. Good job. ", "action_results": []}, {"action": "put a bullet in her brain...", "result": "The kick of the rifle causes the bullet to enter the woman's neck just above her right clavacle spraying warm blood in your face.\n\nYour arms begin to fatigue and you drop the gun. Blood spurts from the large triple chins as she grasps at her throat as if to stop the bleeding.\n\nIt seems to take her forever to die as you watch her stumble around and scream not noticing the 2 gunman that were outside enter the room.\n\n\"NOOOOOO!\" cries a large framed man with a camoflauged hat and a burly blonde beard. The other man is skinny, red hair in a military haircut and wears a sherrif's badge on his uniform.\n\nThe bigger man runs over to the dying body of the chili lady and begin's consoling her.\n\n\"That was his sister.\" states the sheriff. \"\n\nThe sheriff slowly walks over to the creature at the end of the hall.\n\n\"This was the last of the goblin's and it had taken her hostage two nights ago to breed with her.\"\n\n\"We had a stand off these past few hours once we pinpointed her whereabouts.\" he says.\n\n\"I guess an autopsy will tell us if you murdered an innocent woman or did her a service.\" he continues.\n\n \"For right now I am taking you into custody.\"\n\n \nTHE END\n\nYou reached the \"Gargoyles\" ending.\n\n ", "action_results": []}]}]}]}, {"action": "hit the restroom", "result": "It feels so great to release your bowels after such a great meal... AAAAAAHHHHHHH.\n\n\"I need to get to one of those guns in the back room just in case whoever was shooting at me earlier makes there way past the old man and into the diner.\" you think.", "action_results": [null]}]}, {"action": "make a run for it.", "result": "Quick as you can, you slide out the booth and bust open the front door. The only thing you can think of is try to make it back to your truck.\n\nBam...Bam...\n\nAgain with the shooting... only this time a bullet finds you. A searing pain erupts as the bullet imbeds itself in your left leg. You stumble and fall to the ground.\n\nTwo more bullets soon make their way to your brain...\n\n \n~THE END~\n\nYou reached the \" Hills Have Eyes\" ending.", "action_results": []}]}, {"action": "eat the chili", "result": "You never had chili so good. The woman sits behind the counter watching you eat every spoonful.\n\n\"Was it good?\" she asks...almost giggling.\n\n\"Oh yeah.\" you respond with a huge BELCH!!!!\n\nYour stomach starts to rumble and you find yourself in need of the toilet.\n\nAs if reading your mind, the lady motions to a sign in the back corner or the room that reads:\n\nRESTROOMS\n\nYou mouth the words \"Thank You\" to her and dash for the restroom.", "action_results": [null]}, {"action": "demand an answer from the old man", "result": "\"Who is shooting at me...do you know?\"\n\nThe old man looks in your direction and gives you a strange glance. He quickly moves away from the door and disappears down a hall in the back of the diner marked \"Restrooms.\"\n\nMaybe it was the outside light of the flashing \"Captain Trips Diner\" sign but something did'nt look quite right in the old man's eyes.\n\nNow is your chance to run but risk getting shot outside. You grab your flashlight and hold it under the table.\n\n\"Maybe I can whack him with this when he is not looking.\" you think.", "action_results": [null, {"action": "wait to use the mag flashlight on him", "result": "Before the old man returns, the cook comes back with a menu. Her face has totally changed from happy to down right terrified.\n\nShe motions you to read the menu and returns to the kitchen.\n\n\"This is weird...\" you think.", "action_results": [null]}]}, {"action": "accept the soda", "result": "\"Yes, ma'am.\" you say.\n\n\"I'm parched and would love a soda right about now.\"\n\nThe woman gives you a nice smile and disappears behind the doors. The old man begins pacing in front of the doorway mumbling something under his breath.\n\nThe bowl of chili looks really good but would go better with a tall glass of your favorite cola. The woman returns with a large pitcher of ice and fizzy soda. She sets down a red 32oz. glass with Coca-Cola inscribed on the side and fills the glass with soda.\n\nYou flash her a quick glance of acceptance and swallow the whole thing down. Even small bits of ice slide by tickling your throat.\n\nYou slam down the glass and the lady begins laughing in appreciation.\n\n\"I love a man with an appetite.\" she says with a chuckle.\n\nHaving said that, you dig into the chili. It is darker and thicker than any you have ever had before. The saltines seem to disappear in the bowl as you shovel spoonful after spoonful into your mouth.\n\nSoon the bowl and the pitcher are both empty and you feel great.\n\nThe man grabs his flanel jacket from of a coat rack by the door and goes outside in front of the diner. Swinging the shotgun in the air he screams out something you don't understand.\n\n\"Must be some foreign language\" you think.\n\nYou scan the room for a phone but find nothing.\n\nThe diner lady begins to laugh at the old man and walks toward the kitchen entrance. The old man retunrs with a frown on his face and looks toward you. He sets the gun back behind the counter and sits down on the other side of the table you are sitting at and puts his face in his hands as if exhausted.\n\nYou can hear the buzzing of the large neon sign out front.", "action_results": [null, {"action": "ask if he has a working phone", "result": "Now that the old man has finally settled down a little bit, you decide to ask if he has a means of communication to the outside world.\n\n\"Do you have a phone?\" My cell phone doesn't seem to be picking up a signal.\"\n\n\"That's exactly how I like it.\" barks the old man. \"No phone.....no bothers.\"\n\nYou look at the man as he rubs his face in his hands. He begins to speak of the past and how the world was much simpler when we didn't have so much damn technology....blah....blah...\n\nHe seems as if he has seen it all. His eyes are tired and hands are weathered and wrinkled. He gives you a quick glance and you catch what seems to be some yellow tint in his eyes.\n\nHe could possibly be sick or have a disease....\n\nSuddenly, your bowels seem to fill from all that chili and you quickly yearn for a toilet. Looking over the shoulder of the old man, you notice a large sign that reads \"Restroom.\"\n\nYou pardon yourself and head toward the sign.", "action_results": [null]}]}]}]}, {"action": "shine the flashlight at the direction of the noise", "result": "You hide behind one of the earthy mounds and shine the flashlight in the direction the bullets seem to be coming from.\n\nThere seems to be some nearby hills and ....something just moved. You dust off dirt from the mound that poured onto your shirt and lap and settle back behind the mound. You attempt to flash the light in the same direction but....the mound begins to move...again.\n\nBacking away...you hear a distant cry.\n\n\"Get outta there!!!!\"\n\nYou look over in the direction of the distant light and see a man yelling and waving at you.\n\nBam....Bam...\n\nBullets whiz by you as you make your way toward the man. As you do, the earth seems to rumble and fall out from underneath you.\n\nYou fall back into a small hole. The mound you once hid behind begins rumbling toward your direction.\n\nBullets ricochet off the mound making it rumble even more. A strange noise eminates from it sounding like a shreik. It echoes in the night sky.", "action_results": [{"action": "try to make your way toward the man", "result": "You run as fast as you can, bullets whizzing past you. Getting closer, you see the man is standing in front of a small building. A giant neon sign flashes brightly and the old man beckons you inside.\n\nThe sign reads \"Captian Trips Diner.\"\n\nAs you stumble through the door a bullet bounces of the large sign causing sparks as some of the light bulbs go out.\n\nThe room is full of booths and a counter with spinning seats just like an old 50's diner.\n\n\" Go catch your breath.\" the old mans bellows and motions you toward a corner booth.\n\nSoon your heart trate slows to normal and your breathing is not so fast and heavy.\n\n\"Time for some chili.\" states the old man. \"It's the best in the west!!\"", "action_results": [null]}, {"action": "try to make it back to the truck", "result": "You try to work your way out of the hole but it seems impossible. All of the earth around you is moving and swirling as if alive. Soon you are unable to reach the top of the hole as the mound moves over you... filling the hole.\n\nYou are crushed.\n\n \n~THE END~\n\nYou have reached the \"Gargoyles\" ending.", "action_results": []}]}]}, {"action": "try hitchhiking back at the main road.", "result": "It doesn't take long before you to see headlights coming down the main road.\n\nYou never thought you would be doing this but you stick your thumb out and motion the car toward you.\n\nSomething magical happens...the car pulls over as it slowly passes and the passenger door flies open. Two quick honks of the horn for you to get in.", "action_results": [{"action": "get in the car", "result": "Closing the car door behind you, you get a big whiff of smoke. It's very dark inside the large car but you make out the silhouette of the driver smoking a cigarette or something.\n\n\"You shouldn't be out here.\" the driver states in a \"matter of fact\" tone.\n\n\"Goblin Valley is not safe at night.\" he says. \"You know how it got it's name?\"\n\nYou stop to ponder this man's motives. He hasn't even stopped to introduce himself or anything. I guess beggars can't be choosers.\n\nYou shake your head \"NO.\"\n\n\"The legend of Goblin Valley dates back to the 50's where some archeologists found fossilized bones in some caves out here.\" \" They were said to be those of gargoyles.\"\n\nA laugh escapes your lips and you pucker up real quick to stop anymore from coming out.\n\n\"I'm not kidding.\" says the mysterious driver aounding a little angry at you.\n\n\" It was said that at night they would fly around trying to find human females to breed with and then ... keep them in the caves until giving birth. This process would usually kill the female humans.\n\n\"Is this guy crazy.\" you think. Maybe he just likes scaring hitchhikers he picks up out here.", "action_results": [{"action": "try an change the conversation", "result": "\"Where are we headed?\" you break into his conversation.\n\n\"Gold Flake\" he responds after a short pause.\n\n\"I can't wait to get there....anything is better than listening to this guy go on about gargoyles. you think.\"\n\n....think again.", "action_results": [{"action": "to Gold Flake...this way...", "result": "The sun starts to come up over the horizon as you enter the town of Gold Flake.\n\nThe driver, you now notice, is an old man chewing on a large cigar.\n\n\"This is it.\" he says with a growl. He stops the car in front of a old wooden sign marked \"GOLD FLAKE.\"\n\nYou are glad to get out and smell fresh air for a change. As he drives off, he kicks up dust making it hard to see.\n\nYou wave to the old man with only your middle finger outstretched.\n\nTurning toward town, you look for any signs of life. Maybe you can get somebody with a working phone to call your uncle.\n\nYou notice a saloon nearby and see if anyone is around.", "action_results": [null]}]}, {"action": "ask to get out of the car.", "result": "\"Let me out of the car!\" you demand.\n\nAlthough it's dark in the car and you can't see the man's face, you know he is looking at you. After a quick pause he says \"I'm not slowing down 'til I get to Gold Flake.\"\n\nThe man guns the engine and soon your way past Goblin Valley toward the town of Gold Flake.\n\n ", "action_results": [null]}]}]}, {"action": "try your cell phone.", "result": "Just like in the movies.\n\nNo signal.\n\nAll you can do is go back to the main road or travel further up the gravel road and check out the flashing light.", "action_results": [null, null]}]}]}]}, {"action": "paved road to Interstate 666.", "result": "By nightfall, you reach the junction to Interstate 666. You feel tired and are amazed that it is growing dark. The day seemed to just fly by.\n\nYou notice an old broken down neon sign in the distance. As it comes into view, the sign reads \"Motel Hello.\" The \"o\" seems to flicker on and off. A few cars are parked out in front of the office.\n\n\"Maybe I could get directions to Interstate 44 (which, according to the map, is the road you should be on right now.)\"\n\nYou park your truck and go into the office. An old dusty counter and a bell is just about all that resides in this room. You ring the bell twice...nobody. You ring again...nothing. You notice the keys to the rooms hanging behind the counter. You could grab one, unpack, and try back later.\n\nWhich is it?", "action_results": [{"action": "grab a key.", "result": "You notice a thick coat of dust caked over everything in your room except for a VHS machine hooked up to what seems to be a brand new Zenith 36\" color t.v. A video tape sits inside the mouth of the VCR machine. The tape is without a label.\n\nHmmmmm....", "action_results": [{"action": "try to get some sleep.", "result": "You hop into your \"Sponge Bob\" pajamas and pull back the covers to the bed. You find more dust under the covers than what was on top. You try the best you can to brush away the dust but there is just too much of it.\n\n\"This bed has not been slept in years.\" you think.\n\nYou need someplace to rest but it's definitely not going to be here.\n\nFed up with the place, you pack everything up and head down the road in hopes for a more accomidating facility.", "action_results": [{"action": "keep going down route 666.", "result": "Another 2 hours go by and you see nothing resembling civilization. You start to run low on gas when you notice an old, washed out billboard that reads \"Gas and Mini-mart up ahead 2 miles.\" The sign seems very old but the lights shining on it are very bright...as if just changed out.\n\nYou head on toward the gas station...", "action_results": [{"action": "'cause you got to go pee!!!", "result": "You reach the gas station just in time. The truck sputters up to the gas pump. There are two other vehicles pulled up to the Mini-Mart entrance. A red mini-van and an 18 wheeler...well, just the cab.\n\nYou notice the gas pump is missing it's nozzle. A sign hangs over the pump that reads \"Out of gas.\" On further observation, you notice all four pumps have the same sign hanging over them.\n\nGreat!!! Now what?\n\nYou notice people moving about in the mart. The lights are bright but you are too far to see what is going on inside.\n\nIt seems that a man and a woman are walking around the store and another is behind the counter.\n\n\nWhat do you do?...you need fuel somehow.", "action_results": [{"action": "go inside and ask about the gas pumps?", "result": "Upon passing the drivers side of the mini-van, you hear a muffled, high pitched squeal followed by some rumbling. The red van begins to shake a little and then comes to a stop.\n\nThe windows are tinted but, at closer look, it seems you can make out a hunched over figure sitting in the back.\n\nThe rumbling starts again followed by some grunting.\n\n\"What could be going on in there?\" you think to yourself.", "action_results": [{"action": "investigate further?", "result": "You make your way  over to the passenger's side of the red mini-van and check the sliding door. It's unlocked.\n\n A petite woman is tied up in the back seat of the van. Duct tape runs across her mouth. She turns her head toward you and begins screaming through the  tape. The muffled sounds of her screams catch the attention of the attendant inside the mini-mart.\n\nYou watch as he grabs a double barrel shot gun from  behind the counter and points it in your direction.\n\nThe first blast causes the glass of the mini-mart window to shatter. You don't wait for the second. In a flash you get into  the van and slide the door shut. You turn and quickly pull the tape from the mouth of the woman.\n\n\"HELP ME!!!!!\" she screams.  \"I've been kidnapped by these two maniacs!!\"\n\nThe second blast shatters the van's windshield and rocks it from side to side. Pieces of glass cover the  dashboard and front seats.\n\n\"AAAAAHHHHH!!\" you both scream.\n\nLooking for a way out of this mess you notice the keys are still in the ignition.\n\n\"Let's get the heck out of here!!\"  you say as you slide into the driver seat. You catch a glance at the crazy mini-mart attendant reloading his gun and running for  the mart's front door.\n\nThe van comes alive and you peel out of the parking lot and back on to the interstate.\n\nLooking in the rearview mirror, you see two large figures get into a car and drive in your direction.\n\nYou mash on the gas pedal and check the speedometer. It reads 70mph....80mph....90mph....The woman sitting in the back suddenly screams and yells  \"WATCH OUT!!!!\" \n\nYou look up in time to spot a man in the middle of the road. He is waving his hands wildly over his head. He seems to be screaming something. You are  heading right at him...headlights glaring in his eyes...\n\nCan you swerve out of the way?\n\n \n ", "action_results": [null, null]}, {"action": "continue on into the mini-mart?", "result": "\"I'm not getting involved.\" you think as you open the door to the mart.\n\nYou slowly look around inside and nod \"Hi.\" to the attendant behind the counter. He is an older man in his mid 30's and heavily tattooed with fading images of half naked ladies and a rose with what used to be a dagger but now looks like an ugly bruise on his forearm. Tattooed flames come up from the left side of his neck although most of the tattoo is hidden under his work shirt.\n\nThe attendant quickly waves and then points his attention back to the couple in the candy aisle. A man and a woman are huddled around each other. They seem to be attempting to shop lift and doing a poor job of it.\n\nThe attendant is about ready to call their bluff just as you walked in...or so it seems.\n\nYou watch as the attendant pulls a sawed off shot gun from behind the counter and point it at your head.\n\n\"Get with the others.\" he says very clamly.\n\nWithout hesitation, you walk over and stand in the candy aisle with the couple. At closer look, you notice the woman carrying an infant and the man attempting to keep it calm.\n\n\"I just came in here to ask about the gas...because my truck is...\" you start to say.\n\n\"Does it look like I care what you need?\" the attendant bellows. \"I'm waiting for my partner and then we get the heck out of here!!\"", "action_results": [{"action": "keep your eye on the shotgun.", "result": "Seeing the shotgun reminds you of the a murder spree that has gone on for the past month.\n\nApperantly, there are three men that escaped prison and are taking hostages and killing anyone that gets in their way. You've been reading about it in the paper.\n\n\nLooking down beside the counter you spot newspaper rack. You notice the attendant's ugly mug all over the front page. it reads \"TWO ESCAPED CONVICTS KILL 3 ON ROUTE 666!\"\n\nAt closer look, you spot YOUR FACE and those of the unfortunate couple you are with.\n\n\"Lets go.\" says the partner as he comes out from the back room zipping up his fly.\n\n\"Let's grab some \"Hot Pockets\" and some beer...oh and maybe some candy for the kid tied up in the van.\" We got to get to the \"Titty Twister Bar\" by sun up.\"\n\n\"Everybody be cool....\" says the tattooed guy as he takes off the attendant's vest and throws it down behind the counter...with the real attendant's body.\n\n\"...I just did'nt want you to miss the Splatter Show.\"\n\nBLAM! BLAM! BLAM!\n\n\nTHE END\n\nYou reached a  \"DUSK TIL DAWN\" ending.", "action_results": []}]}]}, null, {"action": "try to find the restroom on your own?", "result": "You leave your truck and walk around the side of the mini-mart and enter a dimly lit back alley. You locate the men's bathroom at end of the alley. At the end of the alley is a metal gate that swings open and then crashes closed. You hear footsteps from beyond the gate entrance.\n\nShrugging your shoulders you enter the smelly, one stall bathroom and lay paper over the toilet seat before sitting down to do your business. You begin whistling and studying the displays of artwork that litter the stall walls. One in particular catches your eye.\n\nIt's a hideous picture of a shadow standing over a dead body and a two horned beast climbing out of the dead body's stomach. The shadow has a large hook in place of a right hand. Underneath  the drawing written in large, red letters are the words CANDYMAN repeated five times. \n\nSomeone really took some time drawing this masterpiece in this stinky stall and it gives you the creeps.\n\nYou quickly finish your business and leave the stall. You start to wash your hands when you look up into the mirror and see a black man wearing a brown leather jacket standing right behind you. You whirl around to find nobody there. You glance back at the mirror and the man is gone.\n\nMan, I'm losing it!! you think.\n\nJust as you  are about to leave the bathroom you notice the mirror begin to ripple and shake violently finally breaking all over the filthy floor. A hole was dug into the  wall behind the mirror and a 9 millimeter handgun and a small flashlight is stashed in the hole. You check the gun for  bullets and find one in the chamber and 2 left in the clip.\n\nMan, I am really losing it now!!!\n\nDo  you grab  the gun and flashlight or is it wiser to just leave those things alone?", "action_results": [{"action": "grab the contents in the hidden hole", "result": "Shoving the gun down the back of your pants, you feel the muzzle touch the top of your butt crack.\n\nWhoa!! That's cold!! you think. They always seem to do it on TV no problem.\n\nYou exit the restroom and begin to trace your steps back toward the front of the mini-mart.\n\n\"Come with me....my sweet!!\" bellows a low voice that shakes your brain.\n\nSomething touches your right shoulder. Something sharp and cold.\n\nCome with me......\n\n You slowly turn around and see the same black man...his eyes fixated on yours. You begin to feel light headed. You stumble back and the figure catches you in his arms. He hugs you close and begins to speak...\n\nLike so many others...I was filled with dreams and sharing them with the one that I loved. Just as the tragic death of Romeo and Juliet, this love was not to be but I was to suffer a black slaves fate...and forever ramain...in purgatory.\n\nEven though your head is shoved close to his chest, you hear no heartbeat, no respirations, just a rumbling that seems to take over his body.\n\nHe releases you and you quickly back away from the cloaked figure as he begins to shake uncontrollably.\n\n\"Bring me a bride so that I may rest.....\"\n\nHis mouth opens wide and hundreds of buzzing insects pour from it, obscuring his face! Soon his whole body is covered in bees!!\n\nYou remember the gun in your pants and quickly pull it out and point it at the buzzing mass before you.\n\nWhat will you do...", "action_results": [{"action": "shoot at the figure", "result": "You stare in awe at the swirling mass as it suddenly flies away from you, past the open gate and into the darkness.\n\nWhat the... you think. .\n\nAfter a few minutes you holster your gun and contemplate on what to do next.\n\nSuddenly from a short distance you hear...\"Find my bride...or I will never leave you...my sweet.\"\n\n ", "action_results": [{"action": "check the restroom.", "result": "Slamming the door behind you, you start to think of what to do next. This whole night has become something of a nightmare.\n\nYou turn to inspect the room and walk back into the filthy stall. To your amazement you find it occupied. A man seems to be sitting on the toilet, slumped over against the wall. The light over the sink poorly lights up the stall due to the metal barrier separating it from the rest of the room.\n\nSuddenly, the figure snaps to attention sitting posture perfect on the toilet. You can't quite tell who this person is or what he is up to but the sudden movement made you jump, your heart pounding at full capacity.\n\nYou grab the small flashlight you found earlier and shine it at the dark figure finding you face to face with the same black man you just met before. His face is contorted in a huge grin, his eyes missing their pupils. The eye balls seem to pulsate...almost bulging from their sockets.\n\nThe mouth opens again...no bees. Just laughter....HA HE HE HE HE HA....CANDYMAN.....HE HE...CANDYMAN......HAHA HEHEH CANDYMAN...HA HA CANDYMAN....\n\nThe man raises his arm and exposes a large hook on the end instead of a hand. It begins to scrape across the metal barrrier...across the creepy image of a man exiting out of the bowels of the devil.\n\nIn horror, you drop the flashlight.......the figure beginning to rise off his putrid throne.\n\nHE HE HE CANDYMAN....\n\nThe hook quickly swings in your direction, moving at your throat.\n\nBefore you know it, blood spews from your neck and you fall too your knees. Looking up at your murderer standing before you, he begins to unbutton his filthy, ragged shirt exposing hundreds of bees.\n\nTears escape your eyes...you know this is the last image you will ever see...before the bees cover your lifeless body....cover all the blood.\n\nTHE END\n\nYOU HAVE REACHED THE \"CANDYMAN\" ENDING.", "action_results": []}, null, {"action": "Use your flashlight and follow the noise.", "result": "Turning on your flashlight, you make your way past the gate and into the darkness. A few feet past the gate, you see something shining on the ground. At closer inspection, you see that it's a pocketwatch.\n\nYou pick it up and examine the exquisite artwork put into the dark bronze cover.\n\n\"It's very beautiful.\" you think.\n\nTICK, TICK, TICK...\n\nAlthough it's looks very old, it seems to still function!!\n\nYou push a small button next to the winding wheel and the cover flies open showing the face of the watch. Inside the cover is an old sketch of a man and woman...one black  and one white. \n\n\"What a cute couple. \" you say softly.\n\nSadness seems to pour over you as you hear the faint buzzing of the bees.\n\nQuickly, you shine your flashlight up ahead and make out the cloaked figure standing next to a large tree. The buzzing is coming from a large bee hive hanging from one of the branches.\n\n\"It is midinight!\" cries the voice. You have until dawn to find me my bride.\n\nYou look down at the watch and notice the minute hand move over the twelve.\n\n\"Follow this trail into another dimension, a dimension I cannot travel. Find my bride...or live with me forever.\"\n\nThe figure dissapears. You shine the light to the right of where the figure once stood and find a dirt trail that leads over the hill the tree stands on.\n\n\"Let's go find this guy a bride.\" you say.", "action_results": [{"action": "follow the trail.", "result": "Following the trail is quite easy to do since all of the bees lead you to where you need to go. Your trusty flashlight does the job but soon the night begins to break away and a hint of sunlight reaches over the horizon.\n\nSoon, you don't need the flashlight at all...everything seems to be moving at a fast pace. You notice a jack rabbit dart past you on the trail but everything around it seems to blur. Realizing you have focused on the buzzing bees the whole time, you start to look around you.\n\nEverything is moving at a fast pace yet nothing moves at all.\n\nYou stop as the bees surround your head and then dart away. You are standing in the middle of a ghost town. A few old buildings make up what is left of a town that looks like it came out of an old western.\n\nIn front of you an old saloon. The door to the saloon swing in and out with the wind.\n\nThings are moving normal now. You are drawn to the old saloon.", "action_results": [null]}]}]}, null]}, null]}]}]}]}, {"action": "try the office again.", "result": "Entering the office, you find that nothing has changed. Nobody seems to be around at all. You notice a large jar next to the cashier machine on the counter.  The lettering on the jar reads \"Farmer Vincent's Smoked Jerky.\" You have'nt eaten since you left for your Grandfather's house this morning. It's got to be well past dinner time by now.\n\n\"Nobody is around.\" you think. \"I could just grab a couple and nobody will even know the difference.\"\n\nYou open the jar and take a wiff of the contents. \"Man, they smell good!!\" you say out loud. Although you have been a strict vegetarian for about two weeks now, your stomach and olfactory senses seem to have forgotten that.\n\nDo you grab a couple pieces of jerky or...not.\n\n \n \n ", "action_results": [{"action": "grab some jerky", "result": "You quickly grab about 5 to 6 pieces of jerky and immediately shove about 2 or 3 into your mouth. They taste delicious and soon your stomach quits rumbling. You decide to nose around the office a little more.\n\nBRAAAH.....BRAAAAAAAA....BRAAAAAAAAAAAAAAAAAPAAAAPAAAAA....\n\nIt sounds like someone is trying to start a lawnmower or something from behind the office. Who could be mowing their lawn in the middle of the night.\n\nYou walk past the counter and into the back room marked \"EMPLOYEE'S ONLY\". There you find a room full of security cameras and video tape decks. Upon further examination you realize that every motel room has been assigned a camera view. Across the room is another door. The noise seems to be coming from the other side of the door.\n\nHow creepy! you think.\n\nBRAAAAAAAAAAAAAA!!!  BRAAAAAAAPAAAAAAPAAAAAAAAA...\n\nThe sound is much louder and closer this time.", "action_results": [{"action": "open the door?", "result": "Before you can even put your hand on the door knob, something or someone breaks through the door pushing you violently back into the video cameras. Sparks fly all around as a menacing figure holding a chainsaw stands about 5 feet away.\n\nBRAAAAAAAAAAAAAA!!!!! the chainsaw sputters. The figure wears a grotesque pig mask two or three sizes too big for it's  body. It wears denim overalls and a red long sleeved shirt. The outfits you usually see farmer's wear.\n\nYou can hear muffled laughter coming from  under the mask as the thin figure start to swing it's saw in a criss cross motion toward you. You try to run back toward the front office but it takes a second to get your feet to follow your commands.\n\nThe pig man barely nicks your shirt when the chainsaw comes in contact with a video monitor and then  sputters to a stop. The pig man tries to start his saw again still laughing from under the mask.\n\nThis is your chance to act!!!\n\n ", "action_results": [{"action": "make a run for your truck?", "result": "You clumsily run out of the office and back toward your truck. You can faintly hear the whirr of the chainsaw coming back to life.\n\nGrabbing for the driver's door you suddenly realize that all of your belongings are in your motel room including your keys to the truck. You try the door anyway  and...just as you thought...locked.\n\nYou got to get back to your motel room... and fast!!!!", "action_results": [{"action": "make a dash for the motel room.", "result": "Using the key you got from the office earlier, you open the door to the motel room and grab your truck keys. You also grab your bags and start to head back to your truck.\n\nYour heart pounds with adrenaline and your mind is working on pure instinct now.\n\nAs you get closer to your truck you find the \"pig man\" standing in front of the driver's side door. White smoke billows from the chainsaw as he he holds it over his head and shakes it menacingly.\n\n\"It takes all kinds of critters to make Farmer Vincent's Fritters.\" it screams from behind the mask.\n\nAt that moment you feel your energy start to leave you. You begin to have trouble focusing and you start to lose control of your body. You feel hot liquid run down your leg and realize you are urinating in your pants. Your hands seem to lose their grip on your bags and the last thing you hear is your bags hitting the asphalt of the parking area.\n\n You black out.", "action_results": [{"action": "is this the end?", "result": "The smell of fertilizer is stifling as you wake up in a daze. You try to move your arms and legs but can't. It seems you are unable to move anything but your head.\n\nYou open your eyes and make out what seems to be a pinwheel and flashing lights. To your left are.....something is demanding your attention to the flashing lights. Elevator music is playing in the background. You seem to feel real calm even though you can't move a muscle. Using your hands to make a fist, you grab what seems to be mounds of dirt. Have you been buried alive?\n\nWhat's going on, you think. Just at that moment someone whispers in your ear.\n\n\"Pay attention to the pinwheel and listen to the pretty music.\"\n\nIt's difficult to fight off the desire to obey the voice but you are able to look around and notice you are buried to your neck in what seems to be a garden. It is still night time but bright lights surround your head. A large woman with overalls is bent over speaking into the ears of other people buried along with you. Just their heads are sticking out of the ground making rows of 20 to 30 bodies.\n\nYour try to scream but can't. The only sound you make is a pathetic gargling as your throat seems to catch on fire. You swallow hard and taste blood run down your throat.\n\n\"Vincent, come quick...this one is trying to yell or something.\"\n\nJust then a man in overalls and a plaid shirt comes into your limited view.\n\n\"Hahaahaaa, I guess he doesn't realize his tongue and vocal cords have been cut out honey.\" \"I knew he'd go for my famous jerky.\" \"Nobody can resist it.\"\n\nYou stare at the man she calls Vincent with utter horror. His white hair covered by a straw cowboy hat seems to make him all the more menacing as he starts to smile at you.\n\nHe stands over your head and raises a shovel over his. The woman standing by  him is morbidly obese and has long red hair styled into pigtails like a deranged \"Pipi Longstocking.\"\n\nThat is your last thought as the shovel comes crashing down onto your skull instantly killing you.\n\n\"It takes all kinds of critters to make Farmer Vincent's Fritters.\" they both say in unison.\n\n \nTHE END\n\nYou reached a \"Motel Hell\" ending.", "action_results": []}]}]}, {"action": "run directly at the pig man!!", "result": "Without hesitation you run directly at the pig man as it tries to start the chainsaw. You tackle it to the ground and the pig mask goes flying off  the head of what seems to be a man in his late 50's or early 60's.\n\nHis face is stuck in a contorted grimace as he hits the ground with you on top of him. He begins to laugh as his bloodshot eyes start to dart in your direction. You make a fist out of your right hand and without even thinking, send it crashing into the nose of the laughing, old man.\n\n Blood begins to flow freely form both nostrils as he continues to laugh at you. He raises on finger toward you in a mocking manner. At this time you realized you are going to need something more to finish him off.\n\nWhat could finish off this crazy old coot?", "action_results": [{"action": "hit him over the head with a video monitor?", "result": "As you go to grab a nearby video moniter, you start to feel very tired. The monitor seems to get very heavy as you pull the wires away and try to lift it over your head to finish off the old man.\n\nSoon your eyes are unable to focus and you drop the monitor to the ground.\n\nThe last thing you can make out is the old man slowly getting back to his feet and putting on the pig mask. His laughter echoing in  your ears.\n\nYou black out!!", "action_results": [null]}, {"action": "try to start the chainsaw and go \"Leatherface\" on him!!", "result": "You step over the laughing, old man and grab the chainsaw with both hands.\n\nBRAAAAAAPAAAAAAAPAAAAAA!!!! The chainsaw starts up after only one try. It takes a couple of seconds to wrench the saw out of the t.v. monitor but soon you turn and swing the chainsaw in the direction of the old man.\n\nThe old man's laughing face becomes one of sheer terror as you split his head wide open, blood flying everywhere painting the room deep red. It is you that has begun to laugh as the man's face becomes unrecognizable, his hands pumping into fists and finally releasing their grasps in the air and dropping to the ground. The chainsaw sputters to a stop halfway down the old man's face. The room suddenly becomes very quiet.\n\nYou finally stop and realize what you have done. After what has just happened, anything your grandfather has waiting for you doesn't seem all that interesting now.\n\nWhat should you do...", "action_results": [{"action": "head home and try to forget the whole thing.", "result": "You slowly pull out of the Motel's parking lot and back onto the interstate. You watch as the neon lights of the \"Motel Hello\" sign get further and further away.\n\n\"It feels good to be away from there\" you think as you sigh in relief.\n\nYour body starts to relax for the first time in hours and your heart rate starts to return to normal. You drive for seems like forever finding no signs or markings as to where you are. Nothing seems familiar on this road.\n\n \"Did I take a wrong turn somewhere\" you think as your eyes start to get heavy. Soon you start to nod off.\n\nYou wake up to a blaring horn and head lights coming right at you! You swerve out of the way just in time to hit a tree head on.\n\nBLAM!!!!!\n\nYou black out!!!!\n\n \n\"Dr. Tait, please come to room 315....Dr. Tait....room 315 please.\"\n\nWhoa, what a splitting headache you have. You go to open your eyes and you are met with bright lights. The bightness soon fades and is replaced by a man in a white lab coat and holding a small flash light.\n\n\"I see he is waking up.\" the man says in a British accent.\n\n\"Oh let me see!\" says another masculine voice close by you.\n\nSoon the face of your father is staring back at you. You smile as he smiles back. You try to speak but are unable. You try to move but cannot. Your father's face becomes very sad and a tear wells up in his right eye.\n\n\"Your paralized my boy, your dad blurts out and begins to cry uncontrollably.\n\nThe doctor returns in view and explains what happened in the crash. Something about severing your spinal cord and being permantly paralized.\n\nYou want to pay attention to what the doctor is saying but you can't because your eyes are fixated on the old man standing in the shadows of your hospital room. He begins to laugh uncontrollably as he points a boney old finger at you.\n\n \nTHE END\n\nYou have reached a \"MOTEL HELL\" ending. ", "action_results": []}, {"action": "try to contact the local authorities (well...it WAS self defense).", "result": "Dropping  the chainsaw, you stumble out the front door of the main office and walk toward Interstate 666. You are still in shock as to what happened tonight.\n\n About a mile up the road you spot a phone booth with the light flickering on and off. You go inside, put a couple of coins in the slot and dial 911.\n\nAn operator picks up the phone and you burst  into tears while explaining all that just happended.\n\nYou wait for the operator to respond but the phone seems to go dead.....then...\"I'm sorry. the operator finally states. \" I just don't believe you.\"\n\nYou are flabbergasted at the response.\n\n\"Excuse me?\" you say.\n\n\"Go back to the motel and you'll find that it never happened.......\" CLICK.\n\nYou run back to the motel and into the back office where the whole bloody mess took place.\n\nYou find NOTHING!!!  Not a drop of blood.\n\nSuddenly , there is movement on one of the working video cameras next to the murder scene. You scream as you realize it's the pigman himself, waving a bloody  chainsaw at the camera. He stops in time to remove the mask revealing a face you recognize.\n\n Your own.\n\nYou stare at yourself in the monitor, your face, contorted into a sinister grin from  ear to ear.\n\nYou can't bear it anymore...your  heartbeat races and you find it hard to breath all of a sudden.\n\nYou faint.\n\n ", "action_results": [{"action": "is this the end?", "result": "Amonia fills your nostrils and reality re-aquaints itself with you in a rush. You can hear clapping and cheering all around you.\n\nCould this all have been  a crazy dream? you think.\n\n\"Where am I?\"  you whisper.\n\nOpening your eyes, you find yourself on an ambulance stretcher in the parking lot of the \"MOTEL HELLO\" stage. An ambulance, two big semi trucks, and about 10 to 15 vehicles now litter the once eerie parking lot. Flood lights brighten the whole lot exposing at least 20 to 40 people clapping and cheering and pointing at you.\n\nYou notice your grandfather in the crowd also clapping although he looks like he is laughing at you a little bit. He doesn't look a bit sick.\n\nA man in a black leather jacket smiles and walks over toward you. A camera man follows him.\n\n\"We want to welcome you to a new reality show in which you have unknowingly been the star for the past hour.\" the man says.\n\nYou look up at him in confusion.\n\n\" The show is callled \" SCARED SENSELESS!\" he continues. \" It's kind of a game show to see how long it will take to scare someone  into fainting.\" \" You have been chosen as the very first contestant of the first episode, and may I say, you did very well.\" he concludes.\n\nYour grandfather walks up beside you and gives a big hug and says laughingly, \"You got punked.\"\n\nYou soon  realize the whole thing was a set up from the start and your grandfather was behind it all.\n\nHe bought a local TV studio and  hired a top notch film, special FX, and stunt crews to put together the first episode. He used you as his first victim to see if his little reality show was gonna sink or swim.\n\nOH, IT SWIMS!...\n\nTwo weeks later the episode aires and it's an instant hit. Everyone loves it and you become somewhat of a celebrity.\n\nTwo weeks after that you are at home and opening your mail. You find a letter  from  your grandfather among other fan mail. Quickly opening the envelope you see a card with a  ghost on the front and a check for the amount of $1 million. On the bottom of the card it says...\n\n Thanks for being such a great sport.  Grandfather.\n\n \nTHE END\n\nYou have reached a \"MOTEL HELL\" ending.\n\n ", "action_results": [null]}]}]}]}, null]}, null]}, null, null]}, null]}, null]}]}]}