{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=11413", "context": "", "first_story_block": "When you first laid eyes on her she was unconscious. And underwater. But, she was still an amazing sight.\n\nYou had been snorkeling off the coast of your seclude island you live on, in taking the beauty of the multi colored fish and billowing sea plants. You see fish wandering over to a part of the ocean you hadn’t snorkeled near before. Curious, you followed them and were shocked to find a girl lying unconscious on the ocean floor. You immediately plunge down and grab the girl, pulling her to the shore.\n\nYou didn’t know much about CPR, with living alone on an island and all, but luckily you didn’t need to. As soon as she reached the surface she started breathing. You carry her from the soft sand to your hut made out of sticks and palm leaves and you laid her on your couch. Years before you lived on the island you had packed up everything you owned in your house that didn’t need electricity and basically moved to the seclude island. You were fed up with all the noise of the city and you decided you wanted to become a hermit—with the basic comforts of modern day like a bed, couch, and other furniture.\n\nAs she lay on your couch, you were able to get a good look at her. Her brown hair was like a waterfall on her shoulders and she wore a silk blue satin dress that flowed on her legs like a mermaid tail. She obviously wasn’t dressed for swimming. You thought that maybe she just fell overboard from a boat and the crash knocked her out. Though why she was so close to shore, you didn’t know.\n\nHours later, she comes to. She opens her marble blue eyes and looks around, looking quite scared. She spots you and her eyes widen and she tenses up. You have to calm her down.\n\n ", "action_results": [{"action": "Soothe like a mother", "result": "“It’s okay, it’s okay,” you soothe, putting a hand on her shoulder. She flinches and drew back, looking more frightened. “Really, you don’t have to be afraid. You’re safe now.” She obviously has no idea what you are talking about. “You were underwater, and I pulled you up. Really, I’m a good person.” You scoot a little closer and she stands up abruptly and slips. You reach out to grab her as she falls and you catch her hand just before she hits the ground. You pull her up and she falls into your arms. She looks into your eyes and blushes, pushing you away. She crosses the room and sits down into a single wooden chair and looks away. She refuses to even look at you for days. She doesn’t talk either.", "action_results": [{"action": "Her smile", "result": "A few days after the rescue, you are getting fed up with the girl. She looks around your age, twenty or so, and is stunning. But she won't smile.\n\nShe won't talk, will barely look at you, and she won't show any emotion to you. Every morning is the same routine--wake her up, eat a small breakfast, and try to get her to do something. Unfortunately, she never does anything but gaze out the window and watches the waves of the ocean.\n\nFinally the day comes when you are determined to make her smile. You sit down next to her at the window and she glances at you.\n\n\"Hi,\" you greet softly. She keeps her gaze locked on the ocean. \"Um . . .\"", "action_results": [{"action": "Tell a cheesy joke", "result": "\"Why did the chicken cross the road?\" She looks at you and raises her eyebrow. \"To show the possum it could be done.\" Her lips curled up a bit into a smile. You grin and say, \"You wanna hear another joke?\" She nods.", "action_results": [{"action": "Musical joke", "result": "\"Why did Mozart sell his chickens?\" she looks at you, confused. \"Because they kept going 'Bach, Bach, Bach'.\" She snorts a laugh and shakes her head slightly, looking into your eyes. She smiles warmly puts a light hand on your shoulder. She looks deep into your eyes and you look into hers, entranced by the blue and green swirling around her pupils. After a moment she looks away and pulls her hand away, then went back to staring out the window.", "action_results": [{"action": "Thoughtful Times", "result": "After a month, better things started to happen between you two . . .", "action_results": [{"action": "Speech", "result": "The mysterious girl one day takes notice of your painting. Years ago a paint set washed up on shore along with a drenched canvas. You spent days trying to dry it well enough to use and slowly, but surely, it did and you spent even more days painting a beautiful masterpiece of the ocean shore that can be seen during the sunset with a couple of mermaids and wildlife swimming in the ocean.\n\nThe girl starts staring at the painting rather than through the window, day after day. You find yourself starting to watch her everyday as well, studying her features, adoring her body, and wondering so hard what her voice sounds like. You imagine every tone you can that could fit the beautiful body of the girl, but you can't decide which would fit her best.\n\nI don't even know her name, you realize. I have to get her to talk. But how . . .?", "action_results": [{"action": "Ask her name", "result": "\"What's your name?\" you ask as you come up behind her. She flinches and snaps her head toward you. Her eyes twinkle in fright and she shakes her head. \"Why not?\"\n\n\"I-I'm not ready,\" she stutters quietly, not looking away from you.\n\n\"You talked,\" you whisper, leaning lightly against the wall. \"If you can talk at all, I think you're ready to tell me your name.\"\n\nShe looks down at the floor. \"Marina.\"\n\n\"Marina?\" You almost laugh. \"I've never heard of any name like that.\"\n\n\"My parents were from Spain, so they wanted to give me a Spanish name. They named me after part of the word 'seasalt' in Spanish. Sal marina is seasalt in Spanish. Sal wasn't a very suitable name, so they went with Marina.\"\n\n\"Well, it's very beautiful, once you get used to it.\" You pat her on the head like she's a child and she laughs, swatting your hand away. \"I'll leave you to your painting gazing.\" She stares at the painting for three more days.", "action_results": [null]}, {"action": "Talk about the painting", "result": "\"You like the painting, I'm guessing?\" you ask as you come up behind her. She nods without looking away. \"I painted it myself, you know.\" She glances at you skeptically. \"No, really. It took me days to get everything just right. The sunset, the water, the mermaids . . .\" You smile at her. \"What do you think . . . err, what should I call you, anyway?\"\n\nThe girl smiles. \"It's a great picture,\" she whispers, barely audible. \"And you can call me Marina.\"\n\n\"Marina?\" You almost laugh. \"I've never heard of any name like that.\"\n\n\"My parents were from Spain, so they wanted to give me a Spanish name. They named me after part of the word 'seasalt' in Spanish. Sal marina is seasalt in Spanish. Sal wasn't a very suitable name, so they went with Marina.\"\n\n\"Well, it's very beautiful, once you get used to it.\" You pat her on the head like she's a child and she laughs, swatting your hand away. \"I'll leave you to your painting gazing.\" But she no longer looks at the painting. She looks at you.", "action_results": [null]}]}, {"action": "Ocean", "result": "\"Do you want to go down to the ocean? You've sure seen it enough from the window,\" you offered, appearing from your bedroom with your swim trunks on and an old T-shirt you wore in the water. She looks up at you from the window and looks at her own attire. She hasn't changed her clothes at all since you rescued her. Even she can tell that her clothes are starting to stink, and swimming in the ocean won't help the smell. You hold up a long dress that once floated on shore. It seems to be much like one a woman would wear to the pool side or beach. Swimming in it shouldn't be a problem.\n\nWithin minutes she's changed into the dress and the two of you are walking down the sandy path to the main beach. The sun is beating down on the two of you and she is practically skipping towards the ocean. You smile to yourself as she almost laughs in joy at the fresh air after being stuck in your hut for over a month.\n\nAs soon as she reaches the beach, she sprints toward the cool waters of the ocean. She shrieks a little as the cold seawater splashes her, but giggles at the tickle of seaweed under her toes. You sit down on the sand and watch her as she wades around in the water. She occasionally will go underwater and a couple seconds later appear several yards away from where she was originally.\n\nYou are a tad worried about her, considering she was unconscious in the water when you found her. Whenever she goes under you search around for where she is to make sure she comes up. You relax more when she does.\n\nAt one point she looks over to you and waves you over.", "action_results": [{"action": "Go in with her", "result": "You spring up and run into the water. Her face lights up and she greets you with a hug. She quickly pulls away, blushing. She takes your hand and leads you further out. The ground drops beneath you and you have to kick your feet to keep afloat. She smiles and turns violently, making you spin with her. You yelp at the sudden jerk, but laugh when she keeps spinning you in circles.\n\n\"You're very fun,\" you giggle when she stops spinning you. She smiles wide and goes under, pulling your legs down a second later. You call out when you go tumbling into the cold water and when you come up you're laughing and sputtering at the same time. \"Fun, fun, fun.\" She snickers and swims away, making great progress. You try to go after her, but she's too fast. \"I will catch up with you!\" you vow. She just laughs louder.", "action_results": [null]}, {"action": "Stay on the beach", "result": "You shake your head at her and her face drops a little, but she smiles again sadly and wades some more in the water. At one point she screams and falls into the water. You jump up and search for her to come back up, but after ten seconds she doesn't, which takes longer than she did before. You run into the water and to where she was moments ago. You look around, not finding any sign of her.\n\nSPLASH!\n\nYou get pulled underwater and you come back up, sputtering and wiping saltwater out of your eyes. When you are finally able to see, you find her right in front of you, covering her mouth to keep from breaking out in laughter.\n\n\"What the heck . . .?\" you trail off. You open your mouth wide and stare at her in disbelief. \"You little trickster! You didn't really fall!\" She shakes her head and chuckles escape her lips. \"You scared me half to death!\" She laughs out loud and dives back into the water, appearing yards away in seconds.", "action_results": [null]}]}]}]}, {"action": "Love joke", "result": "\"A woman's husband had been slipping in and out of a coma for several months, yet she stayed by his bedside every single day. When he came to, he motioned for her to come nearer.\n\n\"As she sat by him, he said, 'You know what? You have been with me all through the bad times. When I got fired, you were there to support me. When my business failed, you were there. When I got shot, you were by my side. When we lost the house, you gave me support. When my health started failing, you were still by my side... You know what?'\n\n\"'What dear?' she asked gently.\n\n\"'I think you bring me bad luck.'\"\n\nShe laughs before she can stop herself and she covers her mouth. You grin wildly and chuckle a little yourself. You carefully take her hand and she doesn't recoil, but looks into your eyes. You look back and see the blue and slight green roll around in her iris, surrounding her pupils. \"You have wonderful eyes,\" you whisper. She rolls her eyes, but gives you another peek and smile before she loses emotion and turns away to the window. Her hand goes limp and it feels like you're holding a rock. You sigh and drop her hand.\n\n ", "action_results": [null]}]}, {"action": "Tell a musical joke", "result": "\"Why did Mozart sell his chickens?\" she gives you a confused glance. \"Because they kept going 'Bach, Bach, Bach'.\" Her lip twitched into a quick half smile. You grin and say, \"Do you want to hear another joke?\" She raises her eyebrow.", "action_results": [{"action": "Cheesy joke", "result": "\"Why did the chicken cross the road?\" She looks at you and raises her eyebrow. \"To show the possum it could be done.\" Her lips curled up a bit into a smile and she snickers lightly. She glances at you again and turns back to the window.", "action_results": [null]}, null]}]}]}, {"action": "Soothe like a friend", "result": "“Hey, it’s all right,” you say. You sit down on the ground in front of the couch and she eyes you suspiciously. You tilt your head and look at her curiously. She didn’t know what happened, you know for sure. “You were underwater out by the shore. I pulled you up. Do you know what happened?” She shakes her head cautiously. “Okay. It’s all right, though. You’re safe now. Don’t worry.” Her eyes flicker, but she trusts you enough to let you make her food and give her a place to sleep for a few nights without fuss. But she still doesn’t speak.", "action_results": [null]}]}