{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=21879", "context": "", "first_story_block": "You're an orphan. You don't know anything about your parents. You have never even met them before the hand of fate swept them away from you. All you know is that they died on October the 10th, the day the monstrous creature struck your village.\n\n\nYou remember growing up in an orphanage. Neither the adults nor the children there cared for you. Everyone avoided you for some reason. Even then, you felt like there is something you can do to change their opinion, until today. For today is the day that they've unanimously decided to kick you out.\n\n\nYou stumble into the street as the door shuts behind you. The thunder in the sky cackles as though they are laughing at you. The rain pours down your body as you lurch around the street, trying to find a shelter somewhere where you can stay. At least you found a dumpster in an secluded alleyway, and you grab the head of the dumpster, before flipping it up and climbing in.\n\n\nHow do you want to spend your childhood?\n\n\n- You can choose to spend your childhood on the streets. If you choose this path, you will gain immense charm. Charm is useful for many things, such as bartering for lower prices inside stores, and in general getting along with people. There are also techniques that will require charm to use, and other techniques that rely on charm; such as that the more charm you have, the more your damage your technique will do.\n\n\n- You can choose to spend your childhood in the woods, training on your physical attributes. If you choose this path, you will gain immense strength and dexterity. Strength and dexterity determines how much damage you do to your opponents. While strength reflects how much health you have, and the maximum amount of damage you can dish out, dexterity determines the minimum.\n\n\n- You can choose to spend your childhood in the library, reading away your days. If you choose this path, you will gain immense intelligence. Intelligence determines how many chakra you have, and how much damage your chakra base attacks will do. You will need this for almost every techniques you come across. You will lose the game if your chakra hits zero.\n\n\n- You can choose to spend your childhood hiding from people in the daylight, and coming back out at night time to do various night activities, such as stealing, and spying on people. If you choose this path, you will gain immense stealth. Stealth is required for certain missions you will do, such as that you won't be able to do certain missions until your stealth is are the required level. There are also techniques that will require stealth to use, and other techniques that rely on stealth; such as that the more stealth you have, the more your damage your technique will do.  ", "action_results": [{"action": "On the streets", "result": "You have no parents. No one to take care of you. The orphanage that you were suppose to live in, you were kicked out. You didn't even know why. What were you suppose to do? Go crawl inside a hole, and die quietly? No. You were stronger than that. You wouldn't have given up, and you didn't give up. You found an abandoned apartment, and you made it your home, as well as you can. \n\n\nThen you spent the rest of your time on the streets, scavenging what you can find. Running errands in the red district. Bartering with anyone who would trade with you. Even though most people are still wary of you, there are some that are willing to befriend you, mostly those in the red light district. As it is, you gained a lot of charm points in your childhood.  \n\n\nCharm + 45 \n\nStrength + 11 \n\nDexterity + 14\n\nIntelligence + 19 \n\nStealth + 9", "action_results": [{"action": "Waking Up", "result": "8:04 A.M\n\nYou wake up.\n\n\nThe first thing you see is the white walls. And past that, the open windows. It was nice and windy out last night, so you left the windows open. Two techniques you have used before suddenly pop into your head. The henge, and the vampire sucking technique. The henge technique basically changes you into anyone you want to, but you usually use it to change into a female counterpart. The vampire sucking technique basically let you leech health from your enemies when you're in battle.\n\n\nOh. There's another technique you know, which is called the shadow clone technique. This technique lets you create copies of yourself. You can also combine this technique with your henge technique. Which means your clones can also henge into anyone they want. You have different clones scattered around your house for various purposes. ", "action_results": [{"action": "Your history", "result": "8:08 A.M\n\nYou're an orphan. You don't know who your parents are, and how they died. You just know your own name, and you're not even sure if it was the one your parents gave you before they passed away.\n\n\nEveryone hates you for some reason.\n\n\nEverywhere you go, people point at you and whisper things behind your back.\n\n\nWhich is why you decide to stay out of sight, ever since you have understood what those whispers behind your back is really saying about you.\n\n\nSince then you decide to wear gray clothes because they are less conspicuous. That way, you are less likely to be noticed. That way, you will not be seen and harassed.  \n\n\nYou live inside a village.\n\n\nThe people here have a system. A system to defend themselves.\n\n\nThere are two types of schools for children here in the village. One is for regular civilians. Another one is for military recruits.You have decided to join the academy for military recruits because you  want  to learn how to defend yourself against those people who really hate you; against those who really want to hurt you.\n\n\nEver since you have enrolled in the academy, you've been pushed back by the instructors. Your test papers had gone missing, your instructions had been written wrong, and your weapons were handed out dull and broken.\n\n\nYou have decided that you have to act the idiot in order for them to underestimate you; in order for them to think that you're not a threat; that you're just an idiot.\n\n\nYou have to fail.\n\n\nSo you did. You have failed twice. Once to persuade them that you're not a threat. And another one to prove that you're just another feeble minded idiot, so that they'll shift their attention somewhere else.\n\n\nIt worked. Like a charm. \n\n\nThey have no idea what you're capable of.\n\n\nToday's going to be the third time around that you're taking this test. \n\n\nYou see no point in continuing to fail this test anymore. You are strong enough now. You have gained enough power, and you're going to pass it this time.  After that, you're going to surpass them all.", "action_results": [{"action": "Open your closet", "result": "8:28 A.M\n\nYou get up and open your closet door.\n\n\nInside is...\n\n\n ", "action_results": [null, null, null, null, null, null]}, null, null, null, null, null]}, null, null, null, null, null]}]}, {"action": "Training in the woods", "result": " \"Amanda!\" you yell from the kitchen. \"I swear, if you don't turn the telly down, I will KILL YOU!\"\n\n\n The blaring from the living room drowns out her response, which drives you mad. You tap your foot impatiently. I will wait five seconds before I go in there, you tell yourself.\n\n\n One.....Two.....Three.....Four.....\n\n\n \"'Manda! I'm coming in there!\" You say furiously as you storm from the kitchen. The living room's lights are dimmed, so the glare from the telly makes you blink. Amanda is curled up on the couch, her eyes glued on the screen. Her red hair is a mess, and she is dressed in rumpled up pajamas.\n\n\n \"Amanda,\" you say as you grab the remote. \"You really need to stop this! Your head is going to explode from the sound.\"\n\n\n \"Shut it, Jess!\" Amanda shushes you. \"Turn it up, this is really important!\" You roll your eyes and listen to your roommate.\n\n\n The reporter is just finishing up a story. \"...and the residents of Greenwich should be more cautious. The number of robberies and break-ins have increased over the last two weeks. So, make sure to lock your doors when you leave to house.\"\n\n\n \"So?\" you say as you turn it off. \"It's just some robberies. Nothing unusual.\"\n\n\n \"But he said it was happening in Greenwich! That's here, in case you forgot!\" Amanda says as she gets up from the couch. She stretches, and walks with you to the front door. \"We have the same chance of getting robbed as anyone else here!\"\n\n\n \"'Manda,\" you turn around, exasperated. \"Who in creation would want to break into the flat of two twenty-year old women that can barely pay the rent? It's not like we have anything of value here.\"\n\n\n You grab your purse from the table by the door. Glancing into the mirror, you check to see that your hair is still in its place, and your mascara hasn't smudged. Pleased, you turn to Amanda.\n\n\n \"We have a telly, a microwave, a DVD player, and some jewelry upstairs, Jess!\" Her green eyes flash with fear. Amanda is always worried that someone would break into the flat that you share and steal everything you have.\n\n\n \"Oh, for God's sake. Listen to me. No one is going to rob us!\" You unlock the door. \"Right, I'm going out.\"\n\n\n \"Make sure you get some more apples. We're nearly out,\" Amanda reminds you.\n\n\n \"Yeah, don't worry. I'll remember.\" You walk into the hallway. \"Lock the door behind me!\"\n\n\n Your best friend lets out a retort as you close the door in her face. Time to go to town.", "action_results": [null, null, {"action": "Going Shopping", "result": " You walk down the street, carrying a bag of groceries. The car is just down the street. Thank God. Once again, you made the mistake to wear heels to the shop.\n\n\n Trying to shift your grip on the bag, you stop for just a moment. The bag is really heavy, since you decided to buy a few more things that you saw. You get a good grip just as a man runs straight into you.\n\n\n \"Oh, God!\" You moan as your bag falls to the concrete sidewalk at your feet. Something broke inside of it; you could hear the smashing sound. \"Thanks a lot! There's my week's pay, gone!\"\n\n\n You look up at the man who ran into you. \"Sorry! I am so sorry!\"\n\n\n He is in a tweed jacket, a striped shirt, and a bow tie. You can't see his face, since he is bending over the bag on the ground. You get down on your knees next to him. Sighing, you say, \"It's alright. Not your fault, anyway. I should have seen you coming.\"\n\n\n The man looks up at you, finally showing his face. All you think is, Blimey, he has a big chin. His eyes quickly scan you, sizing you up. \"What's your name?\" he asks.\n\n\n \"Jess. Jess Rowell.\" you say calmly as you pick up some apples. \"And, you are...?\"\n\n\n \"The Doctor,\" he says as he puts the now broken mug into the bag.\n\n\n \"Doctor who?\" you ask him.\n\n\n \"Just the Doctor.\" Finished, he stands up. You pick up your bag and get up.\n\n\n \"The Doctor?\" you muse. \"Well, Doctor, let me ask you this. Why were you running so fast?\"\n\n\n \"It's quicker than walking. Now, I really have to go. It's important.\" he explains. And, just like that, he's gone. You can see his head in the crowd before that disappears as well.\n\n\n You walk towards the car. Might as well go home.", "action_results": [null, null]}, null, null]}]}