{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=41698", "context": "", "first_story_block": "Your name is Bill Grey and you were born in Missouri in 1840.\n\n\nWhen the American Civil War broke out you sided with your friends and family and served on the Southern side, first in the Missouri State Guard and then with Quantrill's Raiders. After both your parents were shot dead by Union soldiers in the Camp Jackson Massacre your vengeance knew no bounds and you served as a guerrilla under such men as Captain Quantrill, Bloody Bill Anderson and Little Archie Clement. You were at the Lawrence Massacre in 1863 where Quantrill's Raiders killed some two hundred Yankee men and boys in Lawrence, Kansas. A year later you took part in the Centralia Massacre where, with the rest of Anderson's band, you helped stop a train, took two dozen unarmed Union soldiers off it and shot them dead - when soldiers were sent out a few hours later your band ambushed them as well and killed more than one hundred. Following Anderson's death in 1864 and Quantrill's in 1865 you and your surviving companions surrendered at the end of the Civil War.\n\n\nReturning to Missouri you try to rebuild your life as a farmer on your family's lands but it is impossible: though pardoned you and your fellow guerrillas have not been forgiven for your Civil War activities and are threatened and persecuted by pro-Unionist citizens and lawmen. The victorious North controls the banks, railroad and government and in fear of your life and unable to do business with any but your fellow impoverished Southerners by 1866 you have had enough. You learn that your last surviving war-time leader Archie Clement is secretly arranging a meeting of several former-Guerrillas and when he invites you to take part you readily accept. Clement's plan is to rob Yankee banks in Missouri to show the Federal Government that though the war may be over you and your companions are still fighting back. It is this fateful decision that will be your first step down the Outlaw path, a dangerous and lonely road...\n\n\nIn this story your fate will be determined entirely by your choices. The number of Gunfights you take part in, the people you Injure and Kill, the number of Robberies you commit and your Score (your share of the amount of money you steal) will all be recorded. Your main aim is to survive, avoiding both prison and death in order to continue your Outlaw career with a long-term goal of eventually retiring. Be careful: one wrong decision, particularly in a gunfight where any moment can be your last, will signal a sudden and fatal end to your career, prison is less of a final ending but depending on the evidence against you can either be a short term delay to your career or a decisive end to it. Your secondary aim is to build up your Score by taking part in as many successful robberies as possible, if you are part of a ten-man team that rob a bank of $10,000 dollars for example your share will come to $1,000 and this will be added to your Score. When your career ends, whether through peaceful retirement or suddenly and violently, you will be sent to the Performance Table where you can compare your Gunfights, Injured, Killed, Robberies and Score to your fellow Outlaws as an indication of how well you performed - leaving a comment at the end of the story will also enable others to see your Score.\n\n\nGood luck Reader, your Outlaw story is about to begin.", "action_results": [{"action": "The First Step", "result": "You and your fellow Outlaws meet at the James Family Farm to plan your first bank robbery. There are seven of you: your youthful leader Little Archie Clement, calm and reserved Frank James, cunning Cole Younger and his reliable brother-in-law John Jarette, the Shepherd brothers George Shepherd and one-eyed Ol Shepherd and finally yourself. You fought alongside each other for years during the War and you know from experience they are all brave and daring. It is your 20 year old leader Little Archie, the youngest and deadliest man present, who arranged this meeting and plans the robbery.\n\n\n\"It's time for us to ride again boys,\" he declares to you all. \"Show those Yankee carpet-baggers that there is still some fight in the South! The town of Liberty, is our target boys, we'll all ride in together. Frank, you and Cole will go in the bank, take the tellers hostage and put all the money you find in the safe into this haversack. The rest of us will wait outside, hold the horses and keep anyone from entering the bank. When you two have finished lock the tellers in the vault, come outside and we'll mount up and ride off. If the alarm is raised boys pull out your pistols and fire them into the air like we used to do in the War when we raided a town - it works wonders for keeping those Yankee shop owners and stable boys off the street! If they start shooting back clear out fast, whether we have the money or not. We'll hit the bank on February 13th, an unlucky day for Yankees but a good day for us!\"\n\n\nOn the chosen day you and your companions ride into Liberty early in the morning when there are few people on the street. With winter snow still swirling through the air you and your companions rein in outside the bank while Frank and Cole dismount and enter the bank, giving their horses's reins to the Shepherd brothers to hold. The moments seem to drag by ponderously with no sound coming out of the plain stone building in front of you. A few townsfolk are glancing at you all curiously; you reach into your right pocket and nervously clench your heavy but loaded revolver which you have hidden inside. Suddenly Cole and Frank emerge from the bank, the latter holding a bulging haversack. They walk quickly back to their horses and begin to mount up. It all seems too easy.\n\n\nSuddenly a voice from inside the bank shouts out \"Robbery! They're robbing the bank!\" As a few nearby civilians start in alarm you and your companions promptly draw out your pistols and begin shooting them into the air, yelling at people to get off the street. Two youths are standing nearby when the alarm is raised and promptly turn and start running down the street in the direction of a Gun Store. Little Archie spurs his horse after them and fires a shot at them with his pistol, which misses. \"Shoot them,\" he shouts at you, who are closest to him. \"Shoot them, they're going for the guns!\" Obediently you raise your pistol and point it at one of the fleeing teenager's backs but hesitate about pulling the trigger.", "action_results": [{"action": "Shoot the boy", "result": "Your shot hits one of the boys in the back, pitching him face-first down to the street with a cry. The other boy takes shelter in a doorway so turning your horse away you and your companions ride out of town. Using routes well-known to you all you ride your horses across the countryside for several hours, completely eluding any pursuit that might have been sent after you. Reaching a safe place you stop to count to your money and to your amazement you find that Frank and Cole have managed to steal $60,000, your share alone comes to $8,500.\n\n\nLittle Archie is pleased but instinctively cautious. \"There will be a big noise about this so it is best if we split up for a time,\" he declares. There is some discussion and then you all make your decisions: Little Archie is going to check into a hotel in the town of Lexington, Missouri and lie low for a while. Frank, John and Cole all decide to hide out at Cole's family farm near the town of Independence while George and Ol are going back to their own Farm near the town of St Joseph. All your companions invite you to go with them and you need to choose who to hide out with.", "action_results": [{"action": "Go with Little Archie to Lexington", "result": "You and Little Archie travel to Lexington where you rent rooms in a hotel and lie low for the rest of the year, spending your stolen money in bars, restaurants and with sporting ladies. One winter's night in December however Little Archie's notoriety leads to an arrest attempt. You and Archie are sitting in a saloon having a quiet drink when three blue-uniformed soldiers armed with rifles approach your table. \"Gentlemen, you are both under arrest,\" one of the soldiers declares.\n\n\nYou and Archie glance at each other and then Archie springs to his feet, pulling a pistol from his pocket as he does so, and starts firing. The soldiers scatter, one firing back and hitting Archie in the side. You are on your feet, pistol in hand and follow Archie as he dashes across the room, hand clasped to his bleeding side, and the pair of you use the pandemonium of fleeing bar customers to escape out a side door into an alley. Several horses are tied up nearby and untying two you mount up. Archie turns and spurs his horse down the alley towards the main street while in the other direction you can see the alley opens up into a side street. You have a choice of directions.", "action_results": [{"action": "Follow Little Archie towards the main street", "result": "As you both ride out of the alley into the main street a volley of gunshots ring out from a dozen soldiers waiting in a line. Both of you are hit several times and fall from your horses into the dust of the street. You are so badly hurt you are barely able to move, turning your head slightly you see Archie trying to re-cock his pistol with his teeth. As the soldiers approach cautiously, rifles raised, Archie rasps \"I've done what I've always said I would do, die before I surrender.\" You are unable to speak and moments later you and your companion are both dead.", "action_results": [{"action": "Your Outlaw Career is at an end", "result": "This is the Performance Table where you can compare your Gunfights, Injured, Killed, Robberies, Score and Fate with those of your fellow members of the James Gang to see who is the greatest Outlaw!\n\n\n1: Jesse James: Gunfights: 11, Killed: 7, Injured: 1, Robberies: 21, Score: $19,900 - Killed.\n\n\n2: Frank James: Gunfights: 11, Killed: 2, Injured: 1, Robberies: 17, Score: $26,900 - Surrendered.\n\n\n3: Cole Younger: Gunfights: 6, Killed: 1, Injured: 2, Robberies: 15, Score: $26,800 - Imprisoned.\n\n\n4: John Younger: Gunfights: 4, Killed: 4, Injured: 0, Robberies: 7, Score: $3,300 - Killed.\n\n\n5: Bob Younger: Gunfights: 3, Killed: 0, Injured: 2, Robberies: 8, Score: $12,100 - Imprisoned.\n\n\n6: Clell Miller: Gunfights: 4, Killed: 0, Injured: 0, Robberies: 8, Score: $12,500 - Killed.\n\n\n7: Jim Younger: Gunfights: 3, Killed: 1, Injured: 1, Robberies: 5, Score: $2,200 - Imprisoned.\n\n\n8: John Jarette: Gunfights: 3, Killed: 0, Injured: 1, Robberies: 3, Score: $10,600 - Killed.\n\n\n9: Charlie Pitts: Gunfights: 2, Killed: 0, Injured: 1, Robberies: 5, Score: $3,400 - Killed.\n\n\n10: Wood Hite: Gunfights: 2, Killed: 0, Injured: 1, Robberies: 4, Score: $2,400 - Killed.\n\n\n11: Bill Chadwell: Gunfights: 1, Killed: 0, Injured: 0, Robberies: 5, Stolen: $3,400 - Killed.\n\n\n12: Dick Liddil: Gunfights: 2, Killed: 0, Injured: 0, Robberies: 4, Stolen: $1,200 - Surrendered.\n\n\n13: Ol Shepherd: Gunfights: 3, Killed: 0, Injured: 0, Robberies: 2, Stolen: $10,200 - Killed.\n\n\n14: Little Archie Clement: Gunfights: 2, Killed: 1, Injured: 0, Robberies: 1, Stolen: $8,500 - Killed.\n\n\n15: George Shepherd: Gunfights: 2, Killed: 0, Injured: 0, Robberies: 2, Stolen: $102,00 - Imprisoned.\n\n\n16: Bill Ryan: Gunfights: 0, Killed: 0, Injured: 0, Robberies: 4, Stolen: $2,800 - Imprisoned.\n\n\n17: Charlie Ford: Gunfights: 2, Killed: 0, Injured: 0, Robberies: 1, Stolen: $100 - Surrendered.\n\n\n18: Clarence Hite: Gunfights: 1, Killed: 0, Injured: 0, Robberies: 2, Stolen: $200 - Imprisoned.\n\n\n19: Bud McDaniels: Gunfights: 1, Killed: 0, Injured: 0, Robberies: 1, Stolen: $7,800 - Killed.\n\n\n20: Tom McDaniels: Gunfights: 2, Killed: 0, Injured: 0, Robberies: 1, Stolen: $2,000 - Killed.\n\n\n21: Tom Webb: Gunfights: 1, Killed: 0, Injured: 0, Robberies: 1, Stolen: $2,000 - Imprisoned.\n\n\n22: Ed Miller: Gunfights: 1, Killed: 0, Injured: 0, Robberies: 1, Stolen: $1,000 - Killed.\n\n\n23: Tucker Bassham: Gunfights: 0, Killed: 0, Injured: 0, Robberies: 1, Stolen: $1,000 - Imprisoned.\n\n\n24: Hoobs Kerry: Gunfights: 0, Killed: 0, Injured: 0, Robberies: 1, Stolen: $1,600 - Imprisoned.\n\n\n25: Robert Ford: Gunfights: 3, Killed: 2, Injured: 0, Robberies: 0, Stolen: $0 - Killed.\n\n\nMost Prolific Gunfighter: 1: Frank James / Jesse James (11 Gunfights), 2: Cole Younger (6 Gunfights).\n\n\nMost Lethal Hurter: 1: Bob Younger / Cole Younger (2 Injured).\n\n\nMost Deadly Killer: 1: Jesse James (7 Killed), 2: John Younger (4 Killed), 3: Frank James (2 Killed).\n\n\nMost Enthusiastic Robber: 1: Jesse James (21 Robberies), 2: Frank James (17 Robberies), 3: Cole Younger (15 Robberies).\n\n\nMost Successful Bandit: 1: Frank James ($26,900), 2: Cole Younger ($26,800), 3: Jesse James ($19,900).\n\n\nOverall Best Outlaw: 1: Jesse James, 2: Frank James, 3: Cole Younger, 4: John Younger, 5: Bob Younger.\n\n\nAs always thank you for taking the time to read my story, please rate and if you would like others to see your score please leave a comment. Have a good day!", "action_results": []}]}, {"action": "Set off by yourself up the alley towards the side street", "result": "You turn your horse away from Little Archie's and spur it down the alley into the side street. The side street is clear of people so you gallop down it towards the edge of town: as you do you hear a volley of gun shots, a horse screaming and then an ominous silence. Riding to a small knoll overlooking the town you look down and your worst fears are realized: your companion is lying dead in the dust of main street surrounded by silent soldiers.\n\n\nAnxious not to share your leader's fate you ride cross-country for twelve hours straight until you reach the safety of the Shepherd's Family Farm. George and Ol are shocked to hear of Little Archie's death and for all of 1867 you all lay low before a meeting is arranged and the gang re-convenes in the spring of 1868.", "action_results": [{"action": "Another Robbery", "result": "It is a somber group that gathers at the James Farm in the spring of 1868: you, Frank, John, George, Ol and Cole are all saddened by your leader's death. Also present at the gathering is Frank's younger brother Jesse James, a garrulous Civil War veteran who was shot three times in the war including one occasion when he blew half his right index finger off while cleaning a loaded pistol. You are all unanimous that you should continue robbing banks and stealing Yankee money, as the oldest and most experienced of the group John Jarette takes charge.\n\n\n\"Missouri may be dangerous for us now,\" he says seriously. \"We should cross the border into Kentucky, rob a bank in that Yankee state and then ride back here to hide out. I've been doing some investigating the bank in Russellville, Kentucky is wealthy. This should be our next target.\"\n\n\nOn the chosen day the seven of you ride into town. While the Shepherd brothers guard your horses you, Frank, Jesse, John and Cole all dismount and walk into the bank. There are three tellers inside and as you approach the front counter you all draw your pistols.\n\n\n\"This is a hold up,\" John barks. \"Throw up your hands.\"\n\n\nInstantly one of the tellers springs to his feet and starts running towards a side door. You aim your pistol at the fleeing man's head but pause, wondering whether or not you should pull the trigger.", "action_results": [{"action": "Shoot the fleeing man", "result": "You fire a shot that grazes the teller's head and though the man stumbles he keeps running, makes it to the door, throws it open and dashes outside yelling \"Robbery!\" Moving quickly you and Frank ransack the vault, throwing all the money you can find into two haversacks while the others guard the tellers and rifle the counter. Shutting the remaining tellers inside the vault you all race outside. While you and your companions mount up the Shepherd brothers begin firing shots into the air to keep citizens off the street.\n\n\nYou have just pulled yourself onto your horse's back when a young man comes running out of a store across from you with a pistol in his hands. As you and your companions begin spurring your horses down the street he fires a shot at you all, which whizzes overhead to shatter a window in the back behind you.\n\n\n\"Get that bastard with the gun,\" someone shouts. You have your pistol in your hand and consider firing back.", "action_results": [{"action": "Fire back", "result": "Raising your pistol you fire back: your shot hits the man on the side, spins him on the spot and he falls to the ground. Turning your horse you spur after your companions and moments later you are out of town and riding across the countryside. You ride hard until you are back across the border in Missouri and there you pause in a copse of trees to count the money you have stolen: you are all pleased to discover it comes to $12,000, which split seven ways makes your share $1,700, which has been added to your Score.\n\n\n\"We need to all split up now to make it harder for the Law to track us,\" John declares.\n\n\n\"Jesse and I will go back to our Farm and hide out there,\" Frank declares.\n\n\n\"I'll go with George and Ol back to their Farm to hide out,\" John decides.\n\n\n\"My brother John has just got a job at his friend Tom McDaniel's Farm near the town of Scyene down in Texas,\" Cole says thoughtfully. \"I'll go down there for a bit to lie low.\"\n\n\nYou consider who to hide out with.", "action_results": [{"action": "Go with Frank and Jesse to the James Farm", "result": "You join the James brothers at their farm where you live quietly for a few weeks until one morning Frank returns from town with a newspaper and a grim expression.\n\n\n\"Yankee lawmen killed John and Ol,\" he says tersely. \"George is in prison charged with bank robbery.\"\n\n\nYou and Jesse crowd round to read how your three companions were identified as participants in the Russellville robbery and were tracked to their homes by lawmen. George later receives a three year prison sentence for his part in the robbery. Despite the loss of three of your companions Jesse is eager for the three of you to rob a bank and after a year and a half when you feel it is safe you make a plan to rob the little bank in the town of Gallatin, Missouri.\n\n\nRiding into town one winter's morning you leave your horses tied up outside and walk inside to find a single teller talking to a customer. The teller looks oddly familiar to you and you can't figure out where you have seen him from until Jesse pulls you and Frank to one side.\n\n\n\"Isn't that Colonel Cox?\" Jesse asks quietly. \"That Yankee Colonel who killed Bill Anderson during the War? I heard he lived in Gallatin.\"\n\n\nThe three of you study the teller closely. You now remember Cox well from his picture in the newspapers, he led an ambush that killed several of your friends including your former leader Bloody Bill Anderson. The teller does indeed look exactly like him and Frank agrees quietly. \"Let's kill him,\" he mutters. Approaching the bank counter the three of you draw your pistols from your pockets. The customer backs away and the teller looks up startled.", "action_results": [{"action": "Shoot him in the head", "result": "Your bullet hits the teller in the head, blasting a circle of red blood and gore onto the wall behind him. As the teller slumps dead in his chair Frank and Jesse fire more bullets into him. The customer screams \"Murder!\" and starts running past the three of you towards the door to the bank. \"Shoot him,\" Jesse yells.", "action_results": [{"action": "Shoot the customer as well", "result": "Your shot hits the man in the back of the right arm but he keeps on running and makes it through the door and out onto the street. \"Quickly boys, get the money,\" you call out and moving quickly you, Frank and Jesse scoop up all the money you can find from the counter, which comes to several hundred dollars. Unwilling to spend time pillaging the vault you all run outside and begin mounting your horses but the alarm has already been raised a a few citizens are taking pot shots at you with pistols from teh shelter of a gun store.\n\n\nWhen a bullet nicks it Jesse's horse rears up in terror, spilling it's rider to the ground before running off. \"Get up behind me Jesse,\" Frank yells and while you fire your pistol at the gun store, trying to cover them, Jesse awkwardly scrambles up behind Frank. The three of you ride out of town on two horses, not stopping for several hours until you reach the safety of the James Farm. There you find you have escaped with less than $700, making your share a paltry $200. There is worse news to follow however.\n\n\nThe next morning Frank returns to the Farm with a paper. \"It wasn't Colonel Cox who we killed in Gallatin,\" he declares. \"It was some bank clerk called John Sheets. They know it was us as well, we've all been identified by name. We'd better clear out.\" Leaving the James Farm the three of you go traveling for a year to wait for the attention to die down before returning to Missouri in the summer of 1871 and arranging a meeting with Cole Younger at the home of your mutual friend Clell Miller. Despite the loss of John, George and Ol you are all determined to continue your robberies.", "action_results": [{"action": "A new Gang", "result": "By the time you, Frank, Jesse and Cole meet in the summer of 1871 you have all been identified as bank robbers and probably killers or would-be killers. Frank, stern and silent sits thoughtfully to one side, fingering a bible lying in his lap. Jesse, grinning and cheerful sits next to him while Cole, balding but as tough as any man you know sits alone in the corner. You sit next to Clell Miller, a light-hearted friend of Jesse's who as a teenager served briefly as a Guerrilla during the War. You all chat over things and despite the deaths of Little Archie, John and Ol and George's retirement from crime following his release from prison the five of you resolve to form a new Gang and continue robbing Northern banks as revenge for their treatment of Southerners since the War ended. Jesse has been looking as possible targets and has chosen a bank in the pro-Union town of Corydon in Iowa, a place in which bank robbers are unheard of.\n\n\nOne summer day the five of you ride into town, dismount, tie up your horses and walk into the bank. It's Sunday and everyone is at church except a lone teller who is quickly captured. You and Frank empty the contents of the vault rapidly into a sack and then locking the teller inside you stroll outside, mount your horses and begin riding off. The robbery has been so easy that when you pass an open-air church service Jesse got resist shouting out to them gleefully \"Hey there, we've just robbed the bank!\" Frank frowns but the congregation just ignore you and whooping and laughing you all ride out of town.\n\n\nYou all ride back to the James Farm in Missouri where you count the haul and find you have made off with $8,000, making your share $1,600. When the papers report the crime you, Frank, Jesse and Cole are all identified again and the newspapers begin calling you the James-Younger Gang. Jesse is delighted with his newfound fame while Cole prevails upon the rest of you to let his younger brother John Younger join the Gang. John, who has already killed three men including two Texan lawmen, is an angel-faced but deadly young man and Jesse especially seems pleased to have him in the Gang. You plan your next bank robbery to take place in Kentucky.", "action_results": [{"action": "29 April 1872: Columbia, Kentucky", "result": "As you have done so many times you and your companions ride into a small town early one morning. While Frank, Clell and John hold the horses outside you lead Jesse and Cole into the bank. Inside four customers are sitting at a table talking while one smiling cashier waits behind the counter. The three of you walk up to the counter and draw your pistols.\n\n\n\"Consider yourself under arrest,\" Cole says cheerfully.\n\n\nTo your amazement the cashier begins shouting \"Bank Robbers! Bank Robbers!\" at the top of his voice.\n\n\n\"Shut up man or I'll kill you,\" you yell at him but the cashier keeps shouting warnings at the top of his voice.", "action_results": [{"action": "Shoot him", "result": "You shoot the cashier in the chest and he staggers back, blood spreading across his shirt front. Jesse and Cole shoot him as well and the cashier falls dead to the ground. Instantly the four customers spring to their feet and start running for the door. \"Stop them,\" Jesse yells.", "action_results": [{"action": "Fire a shot at them to try to stop them running", "result": "You fire a shot that hits one of the men in the hand. He yells in pain but a moment later the four customers have scrambled out the door leaving the three of you alone in the bank with the dead teller on the floor behind the counter. \"Quickly, grab the money\" you tell the others and moving fast you snatch up all the money you can find on the counter. In less than a minute you are back outside to find Frank, Clell and John firing their pistols into the air as you, Jesse and Cole scramble back onto your horses. A man runs out onto the street and fires a pistol at you, Jesse fires back. Both miss but Jesse's shot prompts the man to take cover and the six of you are able to spur your horses out of town and escape.\n\n\nRiding hard you do not stop until you are a long way from Columbia. When you pause to count the money you find you have escaped with less than $1,000, which makes your share $200. Frank is especially unhappy.\n\n\n\"We're killing too many bank tellers Jesse,\" he tells his brother. \"This will bring the law down on us.\"\n\n\n\"Maybe we should lay off banks for a while,\" Jesse says thoughtfully and grins. \"I have a mind to rob a ticket office at the Kansas City Exposition.\"\n\n\nAfter a quick discussion Cole and John both offer to join Jesse but Frank and Clell decide it is better to lay low - Frank is going back to the James Farm while Clell is going back to his own family's farm. You consider what is best to do.", "action_results": [{"action": "Join Frank at the James Farm", "result": "You and Frank hide out at the James Farm and the surrounding area for a while, relying on newspapers for your information. You read about how Jesse and his companions succeeded in robbing the Kansas City Exposition. You also get a scare when you learn that Clell has been arrested for the Columbia Bank Robbery but is released after the shaken witnesses failed to correctly identify him. After a year when you feel the heat has warn off you and the gang reunite to plan your next robbery.", "action_results": [{"action": "Another Robbery", "result": "By now you and your companions have become famous across America as the James-Younger Gang and Southern newspapers laud you as Robin Hood type figures continuing the fight for Southern Rights while Northern newspapers focus on the amounts you have stolen and the men you have killed, a number which altogether has reached six slain. Jesse loves all this attention and John and Clell enjoy it too but Frank is quick to point out that you haven't made much money from your recent robberies.\n\n\nThat is why on a lazy summer afternoon you and your fellow Outlaws ride into the little town of St Genevieve. While Frank, Clell and John look after your horses you, Jesse and Cole enter the bank. There is just one cashier inside and following your usual procedure you take him prisoner, empty the vault of money and then lock the cashier inside. As you are riding out of town Jesse again throws caution to the wind and begins firing his pistol into the air and cheering. Clell and John soon join in, much to Frank and Cole's disapproval.\n\n\nReturning to the Younger Farm this time you count the money and find you have stolen $4,000, making your share $600. All the robberies seem so easy that Jesse decides it is time to increase the stakes. He lays out a plan for you all to rob a train in the state of Iowa, a extremely rare crime that is sure to gain the attention of all America. Though Clell and John readily agree to the plan Frank and Cole are more reluctant and only agree on the condition that more men can be brought in to join the Gang. You all agree to meet in the town of Adair, Iowa in two months.", "action_results": [{"action": "From Banks to Trains...", "result": "In the pre-dawn morning light you and the rest of the James-Younger Gang assemble outside the busy little town of Adair. Cole and John have brought along their brothers Jim and Bob to join in the robbery. Jim is a steady veteran who you fought alongside during the Civil War, though he seems reluctant to be involved in this robbery, Bob is a likable and reliable young man. You and Clell turn up with Charlie Pitts, a quiet but tough man who is another former Guerrilla. Frank and Jesse arrive with an extremely tall and chatty man called Bill Chadwell. Altogether there are ten of you, including the two James brothers and the four Younger brothers.\n\n\nThough you held up trains during the War you are all new to peacetime train robbery and you study the railroad trying to think of the best way to get the train to stop near your place of concealment. Predictably it is Jesse who has the idea of using a mental bar and a hammer to tear up the track, reasoning that the driver will see the broken line and halt the train alongside where you will be waiting with the horse. You all agree to the plan. \"Who will tear up the track?\" Cole asks and you all glance among yourselves.", "action_results": [{"action": "Volunteer to tear up the track", "result": "Taking the hammer and the bar you pry up several rails and toss them to one side. You and the rest of the Gang then take cover in the trees near the track and wait for the train. When the train comes down the line you are astonished by how fast it is going. The driver sees the damage to the track and slams on the brakes but the train is going too fast: to your astonishment the locomotive shoots off the end of the broken line and crashes down onto it's side with an ear-splitting crash, as does the first passenger carriage. The noise is indescribable.\n\n\nThe train has come to a complete halt with the front two carriages on their side and you and your deafened companions emerge stunned from the trees. While Bill, Charlie, Bob and Jim hold the horses and Jesse leads most of the rest towards the Express Carriage at the rear of the train you and Frank jog to the crashed locomotive and peer inside. The sight sickens you, the driver has been literally crushed to death and the fireman has been badly hurt, bleeding freely from his head.\n\n\nYou are still shaken by the time you return to the woods and are rejoined by Jesse and the others. Mounting up you ride away from the train you have just wrecked and ride nonstop for several hours to get to safety. When you count the money you are disappointed to find the train was not carrying a lot, just $3,000 which is divided between the ten of you to make your share $300. Despite the small profits from this you know this brazen robbery will increase your already great fame and notoriety.\n\n\nBill, Clell and Charlie are all a bit unnerved by the attention this crime will bring and decide they will all go and hide out at Charlie's farm in Missouri. Jesse, as usual, is delighted and indifferent to the fact the robbery has led to another death. He intends for himself, Frank, Bob, Cole, Jim and John (all the James and Younger brothers) to ride south into Arkansas to rob a stagecoach, another type of crime the Gang haven't committed before which Jesse hopes will lead to more fame. It is up to you whether or not you want to go into hiding or join in the crime spree.", "action_results": [{"action": "Join Bill, Charlie and Clell in hiding out at the Pitts's Farm", "result": "Hiding out at the Pitts Farm you feel confident of avoiding detection because though both you and Clell are well-known outlaws Bill Chadwell and Charlie Pitts have never been connected with any crime and you rely on those two to go into town for all your supplies and newspapers. You read how the James and Younger boys continue to pull robberies in Arkansas and Missouri but there are consequences: the Pinkerton Detective Agency is hired to bring you and your companions to justice. Frank and Jesse kill one Pinkerton Agent near their Farm but a second gunfight claims the lives of two more lawmen and John Younger near the Younger Farm, Jim Younger being the sole survivor.\n\n\nA letter arrives from Jesse telling you all to meet the rest of the gang in Texas and when you reunite the Gang is a grim bunch. All the remaining Younger Brothers are saddened by John's death with Jim openly blaming Frank and Jesse for getting him mixed up in robberies and swearing he wants nothing more to do with either of them and that he's going to California. Frank and Cole also think it's better that you all lie low for a time at the farm of their friend Bud McDaniels but not Jesse: he sees it as the best way to avenge John is to pull another robbery and the newer members of the gang, Clell, Charlie, Bill and Bob Younger all agree to join him in robbing a stagecoach here in Texas. You need to choose who you join.", "action_results": [{"action": "Help Jesse, Clell, Bill, Charlie and Bob rob a stagecoach in Texas", "result": "Riding into the town of Austin you and your companions make inquiries about the local stagecoach routes before heading south and hiding in some trees to waylay a coach on its route. The hold-up goes smoothly, the coach is stopped and the passengers forced to dismount before being stripped of their valuables. Mounting up your ride cross-country before catching a train and rejoining Frank and Cole at the McDaniels Farm. During the ride you count the loot to find you have stolen $3,000, making your share $500.\n\n\nThe success of the robbery has encouraged Frank and Cole to join in fresh robberies and you soon have a new gang member in the form of Bud McDaniels, the cheerful life-long friend of the Younger family. Together you all plan a daring train robbery in Kansas but Bill and Charlie prefer to lay low this time and return to their hiding place at Charlie's farm as they are both enjoying the fact they haven't been identified as outlaws yet and have safety in their anonymity. You need to choose which group you join.", "action_results": [{"action": "Join Frank, Jesse, Cole, Bob, Clell and Bud in robbing the Kansas train", "result": "One winter's day you and your companions ride out to the train tracks near the town of Muncie. You start a fire right next to the tracks and hide in the trees: sure enough when the train comes down the line the driver sees the fire and stops the train. While Bob and Cole take the driver hostage you, Frank and Jesse board the Express Carriage and capture the messenger at gunpoint. Quickly emptying the contents of the safe into a sack you leave the train, all of you running back to where Bud and Clell are holding your horses.\n\n\nYou ride a long distance from Muncie before you stop to count the money and when you do you discover you have really hit the jackpot big time: you have stolen $55,000 from the train, making your share a whopping $7,800. Everyone, especially Bud, are very happy but you know it is time to split up again. Frank, Jesse and Clell decide to hide out with friends near St Joseph, Missouri, Bud McDaniels declares he intends to rent a hotel room in Kansas City while Bob and Cole decide they are going down to Texas to stay with their old friend Bud's brother Tom McDaniels. You need to choose who to join.", "action_results": [{"action": "Go with Frank, Jesse and Clell to St Joseph", "result": "You go with the James boys and Clell to hide out near St Joseph where you read in newspapers that Bud was identified as one of the Muncie train robbers and shot while trying to escape prison in Kansas City. His death saddens you all and drives you into hiding but in January 1875 you read even more incredible news in the newspapers. Suspecting that you and the others are in the area a small army of Pinkerton Agents surrounded the James Farm and blew it up with some kind of explosive. The explosion killed Frank and Jesse's eight year old brother Archie and tore their elderly mother Zerelda's right arm off.\n\n\nFrank and especially Jesse are overwhelmed with rage when they learn of the cowardly attack and Jesse's first reaction is to kill every single Pinkerton Detective involved in the raid. After calming a little he decides to settle for killing his neighbor Dan Askew who is wildly known to have allowed the Pinkertons to use his Farm as a base from which to launch the raid. One night the four of you approach the Askew Farm and knock on the door. When the old farmer opens his front door Jesse shoots him in the chest.", "action_results": [{"action": "Shoot him as well", "result": "Raising your pistol you shoot the old farmer in the head killing him. Fleeing the scene rapidly you and your companions take to the woods where you live in hiding. Reading newspapers you learn that the Pinkerton Detective Agency are sending one of their Agents, Jack Ladd, to investigate Dan Askew's murder. As Ladd also took part in the attack on the James Family Farm Frank and Jesse see more opportunity for revenge and decide to kill the Pinkerton as well.\n\n\nReturning to the Askew Property armed with rifles you and your companions sneak through the trees and get yourself into a position from which you can see the farm house. You watch it for several hours until finally a man in a smart suit who you recognize as Ladd from the newspaper photographs emerges from the front door. \"Now,\" Jesse murmurs and all of you raise your rifles. You consider whether or not to fire at the unsuspecting man.", "action_results": [{"action": "Shoot the Pinkerton", "result": "Your aim is perfect and Ladd jerks as four bullets slam into his chest, knocking him to the ground. Fleeing the property you decide it is better to get out of Missouri and heading south to join Bob and Cole. Most of the newspapers, which were initially supportive of the James brothers after the attack on their family, are outraged by the two murders and urge people everywhere to shoot any member of the James-Younger Gang on sight.\n\n\nGoing down to the McDaniels Farm you meet up with Bob, Cole and their host Tom McDaniels, brother of the slain Bud. Together with another friend and war veteran called Tom Webb the group are planning to rob a bank in West Virginia, far from your usual raiding areas. Frank likes the idea but uncharacteristically Bob, Clell and Jesse think it is better to lay low for a spell until the attention of the Pinkertons has worn off. You will have to choose who to join.", "action_results": [{"action": "Join Frank, Cole and the two Tom's in robbing the bank in West Virginia", "result": "On the morning chosen for the robbery you and your four companions ride into Huntingdon and dismount outside the town bank. While the two Tom's guard the horses you, Frank and Cole walk into the bank, draw your weapons, take the teller hostage, empty all the money in the vault into a sack and lock him inside the vault. Going outside you re-mount your horses and ride out of town. Once more it seems like you have pulled off another straight-forward robbery.\n\n\nYou haven't got far from Huntingdon when suddenly you spot a dozen horsemen riding out of the town straight after you. \"Now boys, ride for it,\" Cole calls out and all of you spur your horses into a gallop. You hear bangs behind you as the posse begin shooting their rifles and pistols at you all, the bullets whistling overhead and between you all. Suddenly Tom McDaniels reins his horse in and turns it about. \"Fuck this,\" he calls out as he pulls his rifle from his saddle scabbard and begins firing back at the posse.", "action_results": [{"action": "Join Tom in returning fire", "result": "Like Tom you turn your horse and fire back at the approaching riders. The posse fires a volley of shots at the pair of you and both of you are hit, Tom in the chest and you in the throat. Gasping wetly through the blood you turn your horse to try to ride away but the wound is fatal. You topple from your horse to the ground, Tom is also lying nearby. As your pursuers get closer and closer you stare up at the clear blue sky above you and silently expire.", "action_results": [null]}, {"action": "Keep riding after your companions", "result": "You keep riding but a yell behind you makes you glance back: Tom McDaniels has been shot in the chest and he slowly falls from his horse to the ground. You and your surviving companions concentrate on outracing your pursuers across the prairie and though they follow you all day at nightfall they finally break off the pursuit. Weary and exhausted you stop to count the money you have stolen: though you made off with $10,000 from the bank Tom was carrying some of it when he was shot so your share of the robbery is only $2,000.\n\n\n\"We need to split up in case they keep coming after us,\" Cole says wearily. \"Frank and I will keep going west into Kentucky, Tom you turn south and head into Tennessee. Keep a low profile and we will all meet up together again back in Missouri. This could be desperate work.\" You consider who you will go with.", "action_results": [{"action": "Go west into Kentucky with Frank and Cole", "result": "You continue west with Frank and Cole across Kentucky and into Missouri. On the way you read in the newspapers that Tom Webb has been captured in Tennessee. He is put on trial, found guilty and sentenced to eight years for armed robbery. You and your veteran companions are exhausted by the time you get back to Missouri: this has been your most difficult escape from a bank robbery yet and you spent the winter and spring lying low until the gang reunites in the summer of 1876 in the small Missouri town of Otterville.", "action_results": [{"action": "The Gang reunites", "result": "You and the other nine members of the James-Younger Gang who gather in an empty cabin on the edge of Otterville are the most wanted men in America. Jesse, grinning and carefree sits next to a dour and frowning Frank. Cole, tough and capable sits between his handsome, young brother Bob and his other brother Jim who looks like he is wishing he could be somewhere else. The joker Clell Miller and the tall Bill Chadwell are gazing at Jesse with something like adoration while the silent Charlie Pitts sits with them. Finally you are sitting next to the newest member of the Gang, another former Guerrilla but a bit of a weak link called Hoobs Kerry.\n\n\n\"Boys, we've had a turbulent couple of years but we sure are taking the fight to the Yankees, America's never known bandits like us before,\" Jesse declares. \"My idea for this year is that we rob a train here in Missouri first and then go all the way up to Minnesota and rob one of those fat Northern banks up there. Bill here is from Minnesota and knows the area well and together the ten of us are unbeatable! We'll pull off a crime so audacious all of America will be talking about it!\"\n\n\n\"I'm only here to try and stop you from getting my brothers Cole and Bob killed the way you got John killed,\" Jim Younger says dourly. \"You can rob your train here without me.\"\n\n\n\"Well I'm sorry you feel that way Jim,\" Jesse says, his smile not even flickering. \"What do the rest of you say? You're all in aren't you?\" Everyone else agrees and then it's your turn.", "action_results": [{"action": "Join Frank, Jesse, Cole, Bob, Clell, Bill, Charlie and Hoobs in robbing a train in Missouri", "result": "Leaving Jim behind you join the rest of the gang in holding up the train outside Otterville. As usual the robbery goes smoothly: after forcing the train to halt you and the James brothers empty the Express Safe while the Youngers guard the train staff and the others hold the horses. Mounting up you ride cross-country, easily eluding pursuit, and once you are well clear of Otterville. You have got away with a good haul: $15,000, which makes your share $1,600.\n\n\nYou are all ready now to make the trip up to Minnesota and even Jim joins you to help protect his brothers. At the last moment Hoobs gets cold feet, he has been nervous ever since the train robbery and he insists on staying behind at his farm in Missouri. You and the other outlaws are not impressed but since you can't force him to go with you if he doesn't want to you all agree to let him back out of the planned robbery and make preparations to head up to Minnesota without him.", "action_results": [{"action": "Join Frank, Jesse, Cole, Jim, Bob, Clell, Bill and Charlie in robbing the bank in Minnesota", "result": "You and your eight companions begin scouting towns in Minnesota for good banks to rob and settle on one in the town of Northfield. While you are in Minnesota you learn that Hoobs Kerry has been identified and arrested and has promptly identified each of the Gang including those who took part in the Otterville Train Robbery in exchange for a reduced sentence of two years imprisonment. You are all furious at Hoobs's betrayal but decide to go ahead with your plans anyway.\n\n\nAs usual it's Jesse who makes the plans. \"Folk in Minnesota will be on the lookout for nine men acting suspiciously so we won't all go in at once tomorrow,\" he declares. \"Frank, Bob and myself will go into the bank while Cole and Clell hold the horses outside. Bill, Charlie and Jim, I want you to wait on the edge of town and if you hear any shooting come riding in like hell firing your pistols into the air to get those Yankee townsfolk off the streets. I know it's a big town boys but this is a rich bank and the money we should get is worth the risk. Bill, which group do you want to join?\"", "action_results": [{"action": "Join Frank, Jesse and Bob in entering the bank", "result": "You and your friends ride up to the bank, leave your horses tied up outside and go in. There are three tellers but no customers inside the bank and drawing your pistols you approach the tellers. \"We're robbing this bank,\" Jesse declares. \"Don't any of you holler, we've got forty men outside.\" The tellers raise their hands and Frank wanders inside the vault to look at the safe inside. As he does one of the tellers suddenly grabs the vault door and starts pulling it shut. Frank darts back and jams his arm forward as the teller slams the door on it, running forward Bob hits the teller with his pistol and knocks him to the floor.\n\n\nYou all approach the fallen man, Frank angrily rubbing his crushed arm, and drawing a small knife from his pocket Jesse holds it to the injured teller's neck. \"Open the safe or I'll cut your damn throat from ear to ear,\" Jesse snarls. \"You'll have to cut my throat because I can't open the safe,\" the man replies bravely. A shot from outside makes you all glance at the door. As you do another of the tellers springs into action, and dashes away, through a back door and out into the street. \"Get him,\" Jesse shouts.", "action_results": [{"action": "Chase after the fleeing teller and shoot him", "result": "Racing to the backdoor you point your pistol at the fleeing man and fire. The bullet hits the teller in the back of his shoulder, though the man stumbles he makes it to the edge of the street and vanishes round a corner. As you shut the door and go back inside the bank you can hear shots outside and suddenly Cole's voice yelling \"Hurry up, they've given the alarm!\" \"God damn you, open the safe,\" Jesse barks at the teller on the floor and fires his pistol at the floor next to the man's head.\n\n\nYou and Bob quickly scoop all the loose notes you can find off the counter while Frank and Jesse continue to threaten the fallen teller who bravely refuses to help them in any way. Dozens of gunshots are ringing out on the streets outside now and again you hear Cole's voice shouting \"They're killing our men! Get out here!\" \"Fuck you,\" Jesse snarls, hitting the teller in the face again with his gun and then he and Bob give up and run out of the bank. As you are about to follow them you notice Frank massaging his wounded arm and eyeing the teller. \"We should kill that son of a bitch,\" Frank says to you.", "action_results": [{"action": "Shoot the man in the head", "result": "Going up to the teller you place your pistol against his head and squeeze the trigger, killing him instantly. You and Frank run outside to be greeted by a scene of utter pandemonium. Clell, Bill and a third man who looks like a citizen of the town are lying dead in the street; the rest of your Gang are riding their horses up and down firing their pistols up at the buildings where several men seemed to have armed themselves and are firing back. Bob's horse has been killed and Bob himself has taken shelter under a wooden staircase near the bank.\n\n\nYou and Frank make it to your horses and scramble on top of them, as you do someone starts shooting at both of you, hitting Frank in the leg and you in the left forearm, both fairly minor wounds. \"It's no use boys, lets clear out,\" you shout and spurring your horses into a gallop you concentrate on riding your horse out of time, quickly catching up with Charlie and Cole, the latter bleeding from several gunshot wounds. As you reach the edge of town you hear a scream behind you \"Don't leave me boys, I've been shot!\"\n\n\nGlancing back you realize you have all forgotten Bob who has sprung out of his hiding place and is sprinting down the street after you. \"Shit,\" Cole mutters and glances at you and Charlie. \"Cover me boys,\" he orders. Cole then does the most incredible thing you have ever seen someone do in real life: he spurs his horse directly back down the street towards his injured brother. Several men are shooting at them and though you and Charlie are firing your pistols at the buildings you might as well be throwing stones at them for all the good it does.\n\n\nCole and Bob seem to be moving through a virtual rain of bullets. Bob stumbles as one shot hits his leg. Two more graze Cole's horse making it scream and rear but he keeps it under control. Reaching down he helps Bob climb onto his horse. As he does three more bullets hit Cole, the dust exploding from his clothes in small puffs as each bullet hits him. Gritting his teeth he turns his horse around and gallops straight back towards you and Charlie. The gunfire is directed at you two now: one bullet grazes Charlie's arm and another bullet whizzes right past your right ear. As Bob and Cole reach you both you turn horses around and gallop out of town after Frank, Jesse and Jim.\n\n\nBehind you leave the dead bodies of your two fellow outlaws and the shattered myth of the invincibility of the James-Younger Gang.", "action_results": [{"action": "Flight", "result": "By the time you and your surviving companions make it out of Northfield you are in a pretty bad way: Bill Chadwell and Clell Miller are dead and everyone except Jesse (and possibly you) has been wounded: Charlie and Frank have both been shot once, Bob twice, Jim three times and Cole a remarkable five times, though all his wounds are minor. The most serious wounds are Jim's and Bob's the latter of whom has had his right elbow completely shattered. Altogether you have managed to steal less than $27 dollars from the bank in Northfield.\n\n\nPerhaps worst of all your only guide to Minnesota, Bill Chadwell, is dead leaving all of you stranded in a hostile state with only the knowledge that you have to head in a generally southern direction to reach safety. You don't have a single friend in Northfield and within days thousands of men in hundreds of posses are combing Minnesota for you. The first week after your escape from Northfield requires all the knowledge that all of you (except Bob) gained during your four years as Guerrillas during the Civil War and your eleven years as outlaws since.\n\n\nPerforming basic medical care for your injured and stealing a horse for Bob you manage to get the drop on one posse of several men who are hunting you, swiftly disarm them and ride off with their guns. Exchanging shots with another posse you escape during a rainstorm you pass yourselves off as a posse hunting the Northfield Robbers which goes well until one night when you camp on a small island and wake to find the island surrounded by hundreds of men. You only escape by unleashing your horses in one direction and swimming off in another, somehow escaping in the fog and the storm. After this narrow escape you spend a few days resting in an abandoned farmhouse before continuing, stealing horses along the way.\n\n\nBy the 14th things are serious. Both Bob and Jim have become feverish from their untreated wounds and can only travel very slowly. Finally Cole turns to you and the others.\n\n\n\"It's no good, we'll never get out of Minnesota going at this speed,\" he admits to you all. \"Bill, it's better that you, Frank and Jesse ride ahead. You'll be moving faster, attracting more attention from the posses and meanwhile me, Jim and Bob can keep going in our own slow way and hopefully slip out of Minnesota unnoticed while all the posses are busy chasing you.\"\n\n\nYou all consider the idea but Charlie shakes his head and declares that he wouldn't feel right abandoning the badly injured Younger Brothers. The James brothers have no problem with the plan and take all the Youngers money and personal possessions to give to their family in case the worst happens. Frank and Jesse decide to ride directly west towards the Dakotas and try to draw posses after them while the Youngers and Charlie continue south towards Iowa. You need to choose which group you will join. ", "action_results": [{"action": "Accompany the James Brothers west", "result": "You decide to split off with Frank and Jesse and after a week of riding you have covered a lot of distance. That night you approach a bridge over a lake and unfortunately a posse of men are sleeping on the bridge. Dismounting you all try to lead your horses quietly across the bridge but something wakes up one of the posse members. Sitting up he fires a rifle shot which passes through Jesse's thigh to hit Frank in the leg. A moment later he fires another shot which hits your left leg just below the knee.\n\n\nYelling in pain the three of you throw yourselves onto the backs of your horses and spur them into a gallop, rapidly escaping as the posse fire at you. Riding west non-stop for more than forty-eight hours you finally cross into South Dakota and safety three days after your injury. Turning south you escape back to Missouri. En-route you learn that a week after you parted with them your companions were discovered and surrounded by a posse in Minnesota. Cole, Jim and Bob were all wounded again and captured while Charlie Pitts was killed. All three of the Younger Brothers later draw a twenty-five year sentence in the state penitentiary, refusing to the last to name who took part in the Northfield Robbery with them.\n\n\nYour incredibly narrow escape and the complete destruction of the James-Younger Gang have persuaded you, Frank and Jesse that it is time to retire from crime. While Frank and Jesse go into hiding with their wives and children while you travel east all the way to New York and live anonymously for a long time. Finally three years after your escape from Minnesota a letter arrives from Jesse James. He has formed a new gang and would like you to join him in returning to the outlaw life. After a long internal struggle for reasons you don't, and perhaps never fully will, understand you find yourself on a train heading back to Missouri and your old outlaw life.", "action_results": [{"action": "The James Gang", "result": "Returning to Missouri you meet your old friend for the first time in many years. Jesse hasn't changed at all, though he is now in his thirties and has grown a beard he maintains all his old enthusiasm, high-spirits and carefree attitude. Apparently Frank wants nothing more to do with crime and is enjoying his retirement in Tennessee but Jesse has formed a new gang of five men, making you the seventh member of the new James Gang.\n\n\nThe new recruits don't impress you and are nowhere near as high quality as the Youngers or the other former members of the James-Younger Gang. The most reliable of the lot seems to be Wood Hite, Jesse's cousin and a former Guerrilla. Dick Liddil, a clever young man seems reliable enough while Bill Ryan, a hard-drinking admirer of Jesse also seems fairly dependable. The last two members of the Gang, Clell Miller's younger brother Ed Miller and a farmer called Tucker Bassham strike you as idiots and the absence of Frank James concerns you.\n\n\nDespite your worries your first robbery in three years goes very well: Jesse has decided to concentrate on trains rather than banks after his experience at Northfield and one winter's night you hold a train outside Glendale, using a red light to stop the train. You and Jesse quickly empty the Express Safe while the others guard the driver and passengers before you all mount your horses and escape cross-county. After several hours you pause to count the money, you have stolen $6,000 which makes your share $800.\n\n\nJesse is pleased with the success of the robbery but cautions his new recruits. \"This will get the law on our trail and when the papers learn I am behind it the whole state will be looking for us. It's best if we split up, Tucker you back to your farm at Jackson. Wood, Dick and Bill, you head up to Wood's family's place in Kentucky. Ed, you come with me, we'll go and hole up at your farm outside Norborne. Where you going to go Bill?\"", "action_results": [{"action": "Join Tucker at the Bassham Farm", "result": "You go with Tucker back to his farm, all the while having to endure his inane conversation conveying how excited he is by the amount of money you have made. He takes a shopping trip into Jackson and apparently brags loudly about taking part in the Glendale train robbery because the next morning there is a knock on his cabin door. When Tucker answers it you hear a man declare \"Tucker Bassham, you are under arrest for train robbery.\" You spring to your feet and glance around, you are in your bedrrom a short way away and though there is only one door that leads into the kitchen where Tucker is there is a window. You could try jumping through the window to escape but it would make a loud noise and could be dangerous.", "action_results": [{"action": "Try jumping through the window", "result": "You start running and crash through the window, glass shards raining down as you hit the grass below. You hear a shout of alarm in the building behind you but you are on your feet in a moment and don't stop running, reaching the safety of nearby trees in an instant and sprinting through them as you hear more shouts behind you. You make it to Jackson, steal a horse and keep going until you reach the Hite Farm in Kentucky where you join up with Dick, Bill and Wood. There you read that after his arrest Tucker promptly named all of you who helped rob the Glendale train. Soon after this you read that fellow gang member Ed Miller’s body has been found in Missouri, allegedly killed by Jesse James. Soon after Jesse himself turns up at the Hite Farm.", "action_results": [{"action": "More Robberies", "result": "The new James Gang has not had a good start with Tucker Bassham arrested and Ed Miller killed by Jesse for threatening to betray the Gang, that just leaves you, Jesse, Jesse's cousin Wood Hite, the cunning Dick Liddil and the alcoholic Bill Ryan. The murder of his old friend Clell's brother seems to weigh heavily on Jesse's conscience and the usual energy and cheerfulness of his younger years seems to be fading from your friend as Jesse enters his thirties. He remains as decisive as ever though.\n\n\n\"There are lots of stagecoaches in Kentucky and the authorities won't be expecting one of them to be robbed,\" he declares. \"Bill Ryan, you and I will ride out and hold up a stagecoach over by Mammoth Caves, they are always packed full of rich tourists. Dick and Wood, I want you to stay here in case I need you. Bill Grey, you can join us if you want or you can stay here and lie low with the boys.\"", "action_results": [{"action": "Help Jesse and Bill rob a stagecoach in Kentucky", "result": "You and your two companions ride out to Mammoth Cave, a popular tourist destination. You all wait by the side of the road and when a stagecoach full of tourist approaches you all surround it, pistols in hands. Forcing the unarmed driver and passengers to disembark you relieve them of their money and valuables before riding cross-country back to the Hite Farm. Counting your loot there you find you have made off with $2,000, making your share $600.\n\n\nBack at the Hite Farm Jesse is not content with your takings and having learned there is a large sum of money held in a store in the nearby town of Mercer he decides to rob that as well. Again he chooses to take Bill with him and also Dick while Wood will remain at the Farm making sure the place remains safe and keeping a watch out for lawmen. Again Jesse offers you the choice of whether to join him and the others in the robbery or remain at the Farm.", "action_results": [{"action": "Join Jesse, Bill and Dick in robbing the payroll", "result": "Riding into Mercer with the others you leave Dick and Bill outside with the horses and enter the store with Jesse. The pair of you draw your pistols and demand that the lone storekeeper hand over the payroll. \"My son has taken it to the bank already,\" the nervous man tells you with his hands in the air and sure enough the safe is almost completely empty. Jesse is very annoyed but there is nothing you can do except leave the store, mount your horses and ride away.\n\n\nJesse is very put out but after a winter spent exploring various states he learns that a similar payroll is being transported to the town of Muscle Shoals in far-off Alabama, a long way from your usual operating places. Jesse is determined to get the money and decides to take the ever-loyal Bill and Wood Hite with him this time, leaving Dick Liddil at the Hite Farm. Again he offers you the choice of accompanying him or staying at the Hite Farm.", "action_results": [{"action": "Join Jesse, Bill and Wood in robbing the payroll", "result": "Traveling south to Alabama with your friends you make your way to Muscle Shoals and learn what route the man carrying the payroll usually takes into town. Making your way to a lonely part of the road you all hide in some trees until the paymaster comes into sight. Emerging with pistols in your hands you all relieve him of the sack of money he is carrying before riding off across the countryside. When you stop to count the money you find you have stolen $5,000, making your share $1,200.\n\n\nYou and your companions are pleased by the easy job, especially Bill. \"I think I'll go back to Adairville in Kentucky to celebrate with some of my old friends,\" he says. \"Don't be there too long,\" Jesse says. \"I think I'm going to go and talk to Frank and some other boys to get them to join the boy. This summer I think we should start hitting trains in Missouri.\" Agreeing to meet up at the Hite Farm Jesse and Wood part ways with Bill leaving you free to choose who to join.", "action_results": [{"action": "Go with Jesse and Wood to talk to Frank", "result": "That summer you accompany Jesse and Wood to Tennessee where Frank is living a peaceful life in retirement as a farmer. Jesse manages to persuade his brother to return to the outlaw life while Wood also recruits his younger brother Clarence Hite. As you are all traveling back to the Hite Farm you learn that Bill Ryan has been arrested in Adairville after being recognized as a wanted outlaw. Despite this setback the five of you rejoin Dick Liddil at the Hite Farm where Jesse discusses his latest plans.", "action_results": [{"action": "The James Gang return to Missouri", "result": "The loss of Bill Ryan, his favorite gang member, has hit Jesse hard but despite looking more tired than ever Jesse's ambition remains as boundless as always. As well as you, Dick Liddil and Wood Hite Jesse has persuaded his brother Frank to rejoin the gang and also his cousin Clarence Hite, Wood's younger brother who is dying of tuberculosis and is so emaciated you are not certain he'll be up to the rigors of outlaw life. Jesse remains confident though.\n\n\n\"It is time we went back to Missouri and reminded the governor there that are fifteen years the James boys are still going strong,\" he declares, grinning at Frank. \"The Civil War may be over but we haven't stopped fighting it! We'll hold up a few trains and then clear out of the state.\"\n\n\nOn the chosen day Dick, Wood and Clarence camp outside the town of Winston while you, Frank and Jesse ride into town. Boarding the noon train you make your way to the driver's carriage where you take him hostage and have him stop the train close to where your friends are waiting. After the train stops you, Frank and Jesse make your way down the passenger carriages towards the express carriage, Jesse leading the way. \"This is a hold up,\" he barks to the passengers. \"Remain in your seats.\"\n\n\nWithout warning a uniformed conductor suddenly springs forward and grabs at Jesse's pistol. Startled the two men wrestle over the weapon while you and Frank stand by startled. \"Shoot him,\" Jesse yells.", "action_results": [{"action": "Shoot the conductor", "result": "You raise your pistol and shoot the conductor in the head. As the man falls to the ground Jesse regains control of his pistol and shoots him again in the chest. While the conductor lies on the floor bleeding and gun smoke rises in the carriage another passenger springs to his feet, gun in hand. \"Jesse,\" Frank yells out in warning as he aims his pistol at the man.", "action_results": [{"action": "Shoot the armed passenger", "result": "The man staggers as your bullet hits him in the chest and dropping his pistol he falls to the ground. \"Quickly boys,\" Frank calls out and the three of you hurry down the passenger carriage, leaving the two dead men behind you. Reaching the Express Carriage you find the safe contains very little money but you throw what little it does contain into a sack before making your escape from the train. Running to where you left your horses you escape cross country and count the money, finding you have made it away with $700, making your share $100.\n\n\nThe robbery and it's accompanying double-killing make national news and the reward for, you, Frank or Jesse reaches a record $5,000 each to be brought in dead or alive, making the three of you worth $15,000 altogether. Jesse is completely unperturbed and recruits another gang member, a young friend of Dick Liddil's called Charley Ford. Together the seven of you plan your next train robbery to take place on the fifth anniversary of the disastrous Northfield Bank Robbery.", "action_results": [{"action": "The Blue Cut Train Robbery", "result": "Five years to the day since the James-Younger Gang was destroyed at Northfield you and the rest of the James Gang rob a train at Blue Cut, Missouri. Together with the wary Frank and gregarious Jesse you halt the train with lanterns and climb aboard. \"I'm Jesse James,\" Jesse declares to the frightened passengers. \"You might have read about me in the papers. Stay calm and no one will get hurt.\" Making your way to the Express Carriage you empty the safe of a small amount of money and hastily disembark. Escaping on horses you find that you have made away with $1,000, which split seven ways makes your share $100.\n\n\n\"We need to split up boys,\" Jesse declares. \"Wood, Dick and Charley, you go and hide out at Charley's sister's place near Kansas City. Clarence, I want you to hole up in Adairville and get some medical treatment. I'm going to rent my own place in Kansas City. What are you going to do Frank?\"\n\n\n\"I reckon anywhere near Missouri is too dangerous at the moment,\" Frank says. \"I'm going back to my farm in Tennessee.\"\n\n\nJesse glances at you. \"What are you going to do Bill?\"", "action_results": [{"action": "Go with Wood, Dick and Charley to the Ford Farm", "result": "You accompany Dick, Wood and Charley back to Charley's Farm where you meet his sister Martha and his brother Bob, a nervous young man who seems to regard you all with awe. Your stay at the Farm isn't a happy one: Dick and Wood both like Martha and become increasingly hostile towards each other. The argument escalates one evening when you, Dick, Wood, Charley and Bob are all sitting upstairs. Screaming insults at each other Dick and Wood promptly pull out their pistols, spring to their feet and start shooting at each other.", "action_results": [{"action": "Join in the gunfight", "result": "Drawing your pistol you take Wood's side in the argument and fire a shot, hitting Dick in the leg. Dick returns fire, hitting Wood in the arm and suddenly Charley's kid brother Bob unexpectedly joins the gunfight, shooting Wood in the head. As you turn towards him Bob fires a second shot, hitting you in the throat. Gasping and choking you sink to the floor, your life's blood pouring from you as Bob coldly steps closer to you and executes you with a final shot. The same man who will kill Jesse James has just killed you.", "action_results": [null]}, {"action": "Get the hell out of there", "result": "You haven't survived this long by being stupid and springing to your feet you race through the door out of the room. The shots continue to ring out behind you ending in the sound of a body hitting the floor - later you will learn that Charley's brother Bob has killed Wood Hite. Making it to your horse in the Farm's stable you hastily mount up and ride away. For the rest of the winter you live in hiding in Missouri, not emerging until the winter. In the meantime the James Gang is destroyed.\n\n\nFirst Dick and Charley, fearful of Jesse's revenge after killing his cousin Wood, surrender to the law. They tell them where they can find Clarence Hite who is arrested in his hotel in Adairville. Finally Bob Ford murders Jesse James, shooting him in the back of the head while your friend hangs a picture on the wall. Stunned to hear the legendary outlaw is dead you make your way to Tennessee where the other remaining survivor of the gang, Frank James is still living.", "action_results": [{"action": "The end of the James Gang", "result": "Frank is in shock when you join him in Tennessee: like you he finds it impossible to believe that Jesse James, America's greatest bank robber and survivor of so many gunfights and robberies, is dead. As you spend the summer hiding out in Tennessee Frank grows increasingly pessimistic.\n\n\n\"They'll kill us next you know Bill,\" he tells you one day. \"I'm going back to Missouri to surrender. I figure if I surrender myself they might go easy on me, it's either that or keep running until they catch or kill me. I've got no choice. What are you going to do Bill? I suppose you could make a run down to Mexico or up to Canada or some place where the law ain't got no jurisdiction. But I reckon they'll still get you in the end, just like they got Jesse.\"\n\n\nYou carefully mull over what to do.", "action_results": [{"action": "Go with Frank to Missouri to surrender", "result": "You and Frank make your way to Jefferson City, Missouri where friends of Frank have arranged both of your surrenders to Governor Crittenden of Missouri himself. When you meet the Governor you both hand your guns over to him, Frank commenting that it is the first time in twenty-one years since the start of the American Civil War that he has surrendered his gun to anyone.\n\n\n\"We have spent our last twenty-one years on the run,\" you tell him. \"We have been hunted day and night, never able to rest in case every sound is an approaching posse or some lawman on our trail. It will be a massive relief to finally be able to rest.\"\n\n\nThe two of you are placed in custody and the next three years and taken over by a long series of trials in which Clarence Hite, Charley Ford and Dick Liddil all testify. Despite the many charges laid against you and the mound of testimony by some miracle you and Frank manage to argue your way into acquittal on all the charges and in the spring of 1885 you are finally pardoned of all your crimes and allowed to go free, a truly incredible result!", "action_results": [{"action": "One last enemy", "result": "By the 1890's as you enter your fifties it seems that you have put your outlaw past behind you and become a respectable citizen. You have little touch with your former fellow Outlaws: Jesse James, John Younger, Clell Miller, John Jarette, Charlie Pitts, Wood Hite, Bill Chadwell, Oll Shepherd, Little Arch Clement, Bud McDaniels and Tom McDaniels are all dead. Bob Younger and Clarence Hite are dead too, claimed by tuberculosis while Charley Ford has shot himself, overwhelmed by guilt for his role in Jesse's death. Tom Webb, Bill Ryan, Tucker Bassham and Hoobs Kerry all vanished after their release from prison while Cole Younger and Jim Younger are still incarcerated. That leaves just yourself, Frank James, George Shepherd and Dick Liddil alive on the outside, and naturally you have little contact with the last two.\n\n\nYou do see the face of an enemy one summer day when you are in a little town called Creede in Colorado to transact some business. Bob Ford, the man who murdered your friend Jesse, owns a saloon in town and you recognize him in the street. Hatred fills you and you strongly consider killing the man who killed your friend. Doing so would of course put you back outside the law again but it would be a fitting revenge after he betrayed and murdered Jesse James.\n\n\nYou carefully consider what to do.", "action_results": [{"action": "Buy a gun and kill Bob Ford", "result": "Making your way to a nearby gun store you buy a shotgun. After loading and cocking the gun you enter Bob Ford's saloon to find the man you are looking for standing at the bar with his back to you. \"Hello Bob,\" you call out and the young man turns around. Raising the shotgun you fire both barrels directly into his throat, nearly blowing his head off. As Bob Ford is blasted to the floor everyone in the saloon stares at you in stunned silence as you slowly lower the shotgun.\n\n\n\"That's for Jesse James,\" you declare.\n\n\nYou surrender without a struggle and after a short trial you are naturally found guilty of murder. The Judge takes a very lenient view of the killing and you are sentenced to just nine years imprisonment, being released in 1901. You never regret the killing of Bob Ford.", "action_results": [{"action": "The end of the story", "result": "The year of 1901 brings two pieces of good news for you: first the traitor Dick Liddil dies of a heart attack and then finally Cole and Jim Younger are released from prison after serving the full term of their twenty-five year sentences. Jim struggles to adjust and when his parole conditions don't allow him to marry the woman he loves he commits suicide a year after his release from prison, a tragic end to a life beset by tragedies. Cole does better, reuniting with you and Frank James.\n\n\nFor several years the three of you travel around the Old West in various exhibitions and shows, earning a bit of money from your notoriety. The days of the horseback outlaw are truly over now with fictional accounts of your crimes told in awful Dime Novels, songs and in the revolutionary new moving picture films. Your infamy is never far away and one day when the three of you have some business to transact in a bank Cole suddenly stops you.\n\n\n\"If the tellers see Frank James, Cole Younger and Bill Grey walk into their bank they are liable to start shooting,\" he points out.\n\n\nThe years pass and the last actors leave the stage: Frank dies in 1915 and Cole in 1916. The death of one time gang member George Shepherd in 1917 leaves you the last surviving member of the James Gang, now well into your seventies you continue to live in your native Missouri which is peaceful now. The young folks don't believe you when you tell them tales of whizzing bullets, thrilling horseback rides and the screams of dying men in the dust. They don't believe you when you say you rode with the best: the daring Younger Brothers and the best bandits of them all, the legendary outlaws Frank and Jesse James.\n\n\nCONGRATULATIONS, YOU HAVE EARNED THE HIDDEN SURVIVOR BONUS OF 100,000 WHICH WILL BE ADDED TO YOUR SCORE AND VISIBLE TO OTHERS IF YOU LEAVE A COMMENT.\n\n\nTHANK YOU FOR TAKING THE TIME TO PLAY MY GAME.", "action_results": [{"action": "Click here if you are interested in how I wrote this", "result": "Jesse James stands alongside Billy the Kid and John Wesley Hardin as one of the foremost outlaws of the Old West thanks in part to his actions and in part to his legend, which Jesse actively worked on and promoted during his lifetime. Jesse was genuinely a bank robber of outstanding ability, the James-Younger Gang's successful record would not be beaten until the rise of Butch Cassidy's Hole in the Wall Gang in the 1890's. Jesse had a reputation as a Southern Robin Hood and a deadly gunfighter of outstanding ability.\n\n\nIn truth most of the men Jesse and his gang shot and killed were unarmed and you certainly wouldn't have wanted to be in a bank when he and his pals came through the door. Many of their killings were random and pointless and Jesse rarely had much stomach for a fight once people started shooting back at him. Far from being a Robin Hood Jesse and his friends never shared their money with anyone except their immediate friends and family, in fact most of the banks and trains he robbed contained the money of his fellow Southern men in Missouri and other states.\n\n\nBut Jesse has been kind to Jesse in part because of the fun alliteration of his name and in part because of his legend. Jesse promoted himself in a way his somber brother Frank or the cautious Cole Younger never did and he couldn't care less about the people he hurt along the way. As one historian pointed out people tended to look at this legendary figure of Jesse James, they rarely spent time looking into the details of all the killings and robberies that put him on this pedestal.\n\n\nResearching outlaws is always fun and easy, building up a timeline of their activities provides a natural framework to build the story up around, all that really needs to be fleshed out are the characters of the outlaws themselves and the details of the gunfights which were genuinely dramatic and exciting. I think Cole Younger riding back into Northfield towards a dozen people shooting at him to rescue his wounded brother Bob show that the historic truth can sometimes be more amazing than fiction, even great works of fiction like True Grit.\n\n\nAs I have timelines for every gang of American criminals including the Doolin-Dalton Gang, the Hole in the Wall Gang, John Dillinger, Bonnie and Clyde, Baby Face Nelson, Al Karpis and the Barkers, Pretty Boy Floyd and every other major outlaw gang of bank robbers between the years 1865 and 2015 I may write more sequels depending on how this story is received, though the slightly repetitive nature of the story (robbery, possible gunfight, hide out for a time with another possible gunfight or arrest attempt, robbery again etc etc) does concern me as does the fact the reader is encouraged to kill defenseless people to improve his or her score.\n\n\nStill those people who really lived and really did so many incredible things may prove just too fascinating for me not to write about!", "action_results": [null]}, null]}]}, {"action": "Let him be", "result": "You manage to control yourself and turn your back on your outlaw life once and for all, riding out of Creede without exacting any vengeance. It doesn't matter: soon after you read in the newspapers that Bob Ford has been killed by a man called Ed O'Kelley who had a general dislike of him. Growing old gracefully you move into the Twentieth Century.", "action_results": [null]}]}]}, {"action": "Try your chances in fleeing south to Mexico", "result": "Parting ways with Frank you head south, cross the Rio Grande and join numerous American fugitives from justice in hiding out in Mexico. You spend three years living in Mexico, reading in papers as Frank is miraculously acquitted in trial after trial despite the mountain of evidence against him. Finally in 1885 all charges against him are dismissed and you receive word that all charges against you have been dismissed as well. A free and safe man for the first time in nearly twenty-five years, since the start of the American Civil War, you finally return to America.", "action_results": [null]}]}]}]}, {"action": "Go with Clarence to Adairville", "result": "You accompany Clarence to Adairville but your companion is so sick with his terminal tuberculosis that mostly he keeps to his room. One afternoon you are both eating dinner in the hotel's restaurant when several Deputy Sheriffs enter the room and immediately walk towards you. Immediately you know they are here to arrest you and a quick glance around reveals a door to the kitchen just a few feet from you. You could try to make a break for it but as all the Deputies are armed with guns it could be dangerous.", "action_results": [{"action": "Make a break for it", "result": "Springing to your feet you race towards the door, shoulder-barge through it and hurtle through the kitchen, past the stunned cooks and kitchen staff. The lawmen are in hot pursuit but bursting through a backed door you make it out into the street and spring onto the back of a nearby horse. Spurring it into life you gallop out of town as the Deputies fire their pistols at you. One bullet whizzes past your left ear, another knocks your hat from your head but miraculously you make it out of town unhurt and ride hard for Missouri where you spend the spring in hiding.\n\n\nDuring your time hiding the James Gang is destroyed. After killing Wood Hite in Missouri Dick Liddil and Charley Ford surrender to the law. Clarence Hite is imprisoned. Soon after Charley's younger brother Bob Ford shoots Jesse James in the back of the head while your friend hangs a picture on the wall. Stunned to hear of your legendary friend's death you ride for Tennessee where the other remaining survivor of the James Gang, Frank James, is living in hiding.", "action_results": [null]}, {"action": "Surrender", "result": "Like Clarence you raise your hands in surrender and allow the lawmen to take you into custody. Imprisoned in Adairville you soon learn that Dick Liddil and Charley Ford have surrendered to the law after killing Wood Hite in a gunfight. Soon after Charley's younger brother Bob shoots Jesse James in the back of the head while your friend has a picture on the wall. In order to avoid his brother's fate Frank James surrenders to the law in Missouri, finally bringing the James Gang to an end.\n\n\nYou and Frank go to court together in a remarkable series of trials that see Dick, Charley and Clarence all testify against you. In a remarkable series of trials that go on for three years you defeat all the charges against you both through lack of evidence, aggressive cross-examination and outright perjury. Finally in the spring of 1885 you are both released and for the first time in nearly twenty years you finally succeed in putting your outlaw life behind you.", "action_results": [null]}]}, {"action": "Go with Jesse to Kansas City", "result": "You and Jesse take a small house in Kansas City where you hide out for a time. In the spring of 1882 you learn that Clarence Hite has been arrested in Kentucky and Jesse invites the gang's newest recruit Charley Ford and his younger brother, a nervous youth called Bob Ford, to live with the pair of you. He is planning another bank robbery in Platte City, Missouri and wants you and the Ford brothers to take part in it.\n\n\nOne spring morning you are all sitting to breakfast while Jesse reads the day's newspaper and gives a cry of surprise. \"It says here that Dick Liddil has been arrested,\" he announces and you all glance at each other. \"Well, I suppose they'll get all of us in the end,\" Jesse says thoughtfully. Rising from the table he goes into the living room and later when you follow him you find he has taken off his gun belt and is standing on a chair, straightening a picture on the wall.\n\n\nSuddenly a deafening gunshot next to you makes you jump. The bullet hits Jesse in the back of the head, slamming his face into the picture and he falls off the chair. Turning you find Charley Ford's kid brother Bob standing next to you, a smoking pistol in his hand. As you glance at each other he hastily re-cocks his pistol.", "action_results": [{"action": "Draw your own pistol and shoot the man who murdered your friend", "result": "You draw your own pistol but you are too slow: Bob Ford finishes re-cocking his pistol and shoots you in the right eye. Without a sound you fall to the ground dead, slain just feet from your famous friend, the cold hand of justice having finally extinguished your criminal life at last.", "action_results": [null]}, {"action": "Make a run for it", "result": "Without hesitation you bolt from the room into the kitchen; Bob fires at you but narrowly misses. Passing Charley Ford you race out the back door of the house and make it across the yard and into the town. Rapidly escaping Kansas City, your mind numbed by the fact that Jesse James is dead, you make your way to Tennessee. In time you learn the truth: Dick Liddil and Charley Ford killed Wood Hite in a gunfight and then surrendered to the law, now Bob Ford has murdered your friend. Swiftly you make your way to the other remaining survivor of the James Gang, Jesse's brother Frank who is still hiding in Tennessee.", "action_results": [null]}]}, {"action": "Go with Frank to Tennessee", "result": "You travel with Frank to Tennessee and there you live quietly in hiding, reading in newspapers as the James Gang is destroyed. First Dick Liddil and Charley Ford surrender to the law after killing Wood Hite in a gunfight. Next Clarence Hite is arrested in his hotel in Kentucky. Finally Charley's younger brother Bob Ford goes up behind Jesse James as he is hanging a picture on the wall and shoots him in the back of the head. The murder of your friend shocks America and signals an end to your outlaw career.", "action_results": [null]}]}]}, {"action": "Let Frank deal with him", "result": "The man staggers as Frank shoots hits him in the chest and dropping his pistol he falls to the ground. \"Quickly boys,\" Frank calls out and the three of you hurry down the passenger carriage, leaving the two dead men behind you. Reaching the Express Carriage you find the safe contains very little money but you throw what little it does contain into a sack before making your escape from the train. Running to where you left your horses you escape cross country and count the money, finding you have made it away with $700, making your share $100.\n\n\nThe robbery and it's accompanying double-killing make national news and the reward for, you, Frank or Jesse reaches a record $5,000 each to be brought in dead or alive, making the three of you worth $15,000 altogether. Jesse is completely unperturbed and recruits another gang member, a young friend of Dick Liddil's called Charley Ford. Together the seven of you plan your next train robbery to take place on the fifth anniversary of the disastrous Northfield Bank Robbery.", "action_results": [null]}]}, {"action": "Let the James Brothers take care of the situation", "result": "While you watch Jesse manages to pull the trigger of his pistol and shoot the conductor in the chest. As the man falls to the ground Jesse shoots him again in the head. While the man lies bleeding on the floor and gun smoke rises in the carriage a second passenger springs to his feet, gun in hand. \"Jesse,\" Frank yells out in warning and raises his own gun.", "action_results": [null, null]}]}]}, {"action": "Go with Bill to Adairville", "result": "Parting from the others you and Bill make your way to Adairville where you spend several days drinking in saloons and generally having a fun time. The fun ends abruptly one night when Bill gets into a drunken argument with someone and boasts that he is friends with Jesse James. Lawmen quickly arrive on the scene and before Bill knows what is happening he is under arrest. You are standing by the bar at the time a few feet from a side door and as lawmen advance on you with pistols in their hands you consider making a break for it, though it could be dangerous.", "action_results": [{"action": "Try escaping out a side door", "result": "As the lawmen approach you suddenly make dart to the right, throw the door open and rush through. As the lawmen shout out you run down the alley outside, make it to a horse and mount up. You ride hard out of town and don't stop riding for 24 hours until you make it back to the safety of the Hite Farm: there you learn that Bill has been imprisoned for several years for his role in the Muscle Shoals payroll robbery but he has refused to name his companions. Soon after you arrive at the Hite Farm Jesse and Wood show up with their brothers Frank and Clarence Hite in tow, recruits for Jesse's latest plans.", "action_results": [null]}, {"action": "Surrender", "result": "You meekly raise your hands in the air and surrender, together with Bill you are taken into custody. Put on trial in Adairville you are testified against by none other than Tucker Bassham and convicted not only of the Muscle Shoals payroll robbery but also of the Glendale train robbery: you are both sentenced to eight years imprisonment. While you are in prison the James Gang is destroyed: Wood Hite and your friend Jesse James are killed while Dick Liddil and Frank James surrender to the authorities, both are later acquitted of the charges against them. By the time you are eventually released your outlaw days are long gone by and the world seems a very different place as you enter into a peaceful retirement from your outlaw life.", "action_results": [null]}]}]}, {"action": "Stay with Dick at the Hite Farm", "result": "You remain with Dick at the Hite Farm while your companions head south to rob the payroll in Alabama. The robbery goes off well but afterwards Bill Ryan is arrested in Adairville after he draws too much attention to himself. The news is bad but Bill refuses to talk and soon after Jesse and Wood Hite return to the Hite Farm with Wood's younger brother Clarence Hite and Jesse's brother Frank who has been lured out of his retirement as a farmer in Tennessee by his enthusiastic younger brother. Jesse has a summer of crime planned for his native Missouri.", "action_results": [null]}]}, {"action": "Wait with Wood at the Hite Farm", "result": "You stay with Wood at the Hite Farm while the others ride into Mercer to commit their robbery, only succeeding in robbing an already empty safe. Jesse is very put out but after a winter spent exploring various states he learns that a similar payroll is being transported to the town of Muscle Shoals in far-off Alabama, a long way from your usual operating places. Jesse is determined to get the money and decides to take the ever-loyal Bill and Wood Hite with him this time, leaving Dick Liddil at the Hite Farm. Again he offers you the choice of accompanying him or staying at the Hite Farm.", "action_results": [null, null]}]}, {"action": "Stay with Wood and Dick at the Hite Farm", "result": "You wait at the Hite Farm while Jesse and Bill pull off their robbery and rejoin you. Jesse has plans for another robbery and having learned there is a large sum of money held in a store in the nearby town of Mercer he decides to rob that as well. Again he chooses to take Bill with him and also Dick while Wood will remain at the Farm making sure the place remains safe and keeping a watch out for lawmen. Again Jesse offers you the choice of whether to join him and the others in the robbery or remain at the Farm.", "action_results": [null, null]}]}]}, {"action": "Surrender instead", "result": "You meekly surrender to the lawmen and together with Tucker you are both conveyed to Jackson for your trial. The trial itself is a short affair thanks largely to Tucker's testimony which names you and every other participant in the Glendale train robbery. You are found guilty and sentenced to an incredibly lenient two years imprisonment as the Glendale robbery is the only crime you are charged with and found guilty of. During your imprisonment you read that Ed Miller's body was discovered in Missouri, apparently killed by Jesse James. Bill Ryan is arrested a year after you but the other gang members are still at large by the time you and Tucker are released in the winter of 1881. Tucker immmediately goes into hiding while you go to Missouri to join up with Jesse, Wood Hite and Dick Liddil.\n\n\nBy this time Jesse has managed to expand his gang, persuading his brother Frank to join him, his cousin Clarence Hite (Wood's younger brother) and a friend of Dick Liddil's called Charley Ford have also joined the gang. Jesse is delighted to see you again and it doesn't take him long to persuade you to join him and the others in his latest train robbery planned in Missouri on the fifth anniversary of the disastrous Northfield Raid...", "action_results": [null]}]}, {"action": "Join Wood, Dick and Bill at the Hite Farm", "result": "You and your new friends go to Wood's farm and lie low for a few months. You are startled to read that Tucker Bassham has been arrested in Missouri and promptly named you and every other participant in the Glendale train robbery; soon after you read that Ed Miller’s body has also been discovered in Missouri, allegedly killed by Jesse James. A few months later Jesse himself turns up at the Farm looking grim and full of plans for your next robbery.", "action_results": [null]}, {"action": "Join Jesse and Ed at the Miller Farm", "result": "Jesse rents a small house on the outskirts of Norborne and together you, Jesse and Ed live there for a time. Ed is a heavy drinker and over time you notice he seems to hold you and Jesse responsible for the death of his brother Clell in the Northfield Bank Robbery three years ago. One night after an especially heavy drinking bout Ed threatens to tell local lawmen where you are all staying unless you give him money. Jesse takes you to one side and quietly declares he intends to kill Ed. He asks if you would be willing to help him.", "action_results": [{"action": "Help Jesse kill Ed", "result": "You and Jesse walk up behind Ed who is sitting in a chair. Without a word you both draw your pistols and shoot him in the head, killing him instantly. Wrapping the body in a blanket you dump it outside before saddling up and riding away, heading to the Hite Farm in Kentucky where Wood, Dick and Bill are staying. When you arrive you learn that Tucker Bassham has been arrested in Missouri and named all of you who took part in the Glendale robbery, worsening Jesse﻿'s already grim mood.", "action_results": [null]}, {"action": "Refuse to help murder your fellow gang member", "result": "You return to the kitchen and join Ed sitting at the table. A moment later Jesse walks up behind Ed and without a word he draws his pistol and shoots him in the back of the head, killing him instantly. Wrapping the body in a blanket you dump it outside before saddling up and riding away, heading to the Hite Farm in Kentucky where Wood, Dick and Bill are staying. When you arrive you learn that Tucker Bassham has been arrested in Missouri and named all of you who took part in the Glendale robbery, worsening Jesse's already grim mood.", "action_results": [null]}]}]}]}, {"action": "Keep going south with Cole, Jim, Bob and Charlie", "result": "You choose to remain with the Younger Brothers and Charlie while the James boys ride off. Initially the plan works well, continuing to head slowly south you rarely encounter posses now, most have them have drawn off west to chase Frank and Jesse. Unfortunately Bob and Jim's fever is continuing to worsen and you are moving slower than ever. One week after the James brothers split off you find yourselves approaching a copse of woods when a glance back shows a few hundred posse members armed with pistols, rifles and shotguns closing in on you.\n\n\nThe four of you run into a thicket and take shelter behind a fallen tree. \"If anyone wants to surrender they can,\" Cole suggests but you are all determined to go down fighting.\" As the posse fans out to surround the copse of trees where you are hiding and seven men armed with rifles approach on foot Cole sighs. \"When they get close let them have it,\" he orders. \"Bob, you reload our pistols. Ok boys get ready... now!\" Cole fires his pistol, hitting one of the approaching posse in the hip.", "action_results": [{"action": "Join the others in firing at the posse", "result": "You fire your pistol over the dead-fall, one of your shots clipping a posse member in the side. The posse returns fire, the men in front firing from cover while those behind on a slight hill direct their fire over their heads. Your friends are hit several times: Cole is hit three times, Charlie four times and Jim once but you all keep firing. Charlie glances at Cole. \"We are entirely surrounded and we had better surrender.\" Cole nods. \"Charlie if you want to surrender go but this is where Cole Younger dies.\" \"All right Captain, I can die as game as you can,\" Charlie replies. \"Let's get it done.\"\n\n\nSpringing to his feet with a pistol in each hand he opens fire, hitting one posse member in the hand. A moment later he is shot through the chest and with a groan he falls dead to the ground. A moment later Jim is shot in the face, the bullet knocking out several of his teeth and lodging in his head, clutching his face he falls to the ground. Cole turns to look at Jim and a bullet hits him in the back of the head, he too falls to the ground. Glancing round you catch Bob's frightened eyes looking at you.", "action_results": [{"action": "Copy Charlie and spring to your feet guns blazing", "result": "You spring to your feet, firing your pistols as fast as you can. One of your shots hits a posse member in the shoulder then someone shoots you in the chest, directly into your heart. You fall back behind the dead tree and as silence falls you quietly die, another Outlaw passing into the legend of the Old West.", "action_results": [null]}, {"action": "Keep firing from behind cover", "result": "You keep firing at the posse but a bullet passes over the dead tree to strike you in the upper chest and knocking you backwards onto the ground. You lie there among your fallen motionless companions as the guns slowly stop firing. You hear a voice shout out \"do you men surrender?\" A moment later Bob replies. \"I surrender. They're all down but me. For God's sake don't shoot me too.\" You get a glimpse of Bob rising to his feet when suddenly a shot rings out hitting him in the chest and he falls to his knees.\n\n\n\"Stop shooting,\" an angry voice yells. \"Anyone else fires I'll shoot them!\" A moment later a handsome young lawman climbs over the dead tree followed by his companions. \"I was surrendering,\" Bob murmurs to him. \"Someone shot me while I was surrendering.\" The posse members approach you and the others. Jim is moaning in pain, clutching his shattered jaw, while Cole tries to fight off two men who try to help him up. \"Cole it's over,\" Bob tells him. \"Give it up or they'll hang us for sure.\" Another two men lift you up, gasping in pain and barely aware of what is happening.\n\n\nThe four of you and the dead Charlie are taken into a nearby town in a wagon. You all receive treatment: in the gunfights at Northfield and Hanska Slough Bob has suffered a total of three bullet wounds, Jim five and Cole a remarkable eleven while you have been shot at least once, possibly more at Northfield. It takes two months of medical treatment until the four of you are fit enough to stand trial. Meanwhile Frank and Jesse James succeed in escaping back to Missouri.\n\n\nYour trial is an open and shut case and it is only by pleading guilty to bank robbery and murder that you all avoid execution: instead you are sentenced to prison for twenty-five years, all of you always refuse to identify Frank and Jesse James as your fellow bank robbers in Northfield. While you serve your sentence you read how first Jesse and then Frank return to their outlaw careers. Jesse is finally betrayed and shot dead by his friend Robert Ford in April 1882 and Frank surrenders to the law six months later.\n\n\nAfter a series of lengthy trials Frank defeats all the charges against him and is released from custody in 1885. Though Bob dies in prison of tuberculosis, worsened by his chest injury, in 1889 you, Cole and Jim all survive to be paroled from prison in 1901. By this time you are over sixty and both the Younger Brothers are in their fifties. Jim doesn't enjoy his freedom: unable to marry the woman he loves because of his parole conditions he commits suicide a year after his release.\n\n\nAs you and Cole enter the Twentieth Century you reflect over the lives you have led.", "action_results": [null]}]}, {"action": "Help Bob reload the pistols", "result": "You keep your head down and concentrate on helping Bob reload the pistols while your companions fire their guns. The posse returns fire, the men in front firing from cover while those behind on a slight hill direct their fire over their heads. Your friends are hit several times: Cole is hit three times, Charlie four times and Jim once but you all keep firing. Charlie glances at Cole. \"We are entirely surrounded and we had better surrender.\" Cole nods. \"Charlie if you want to surrender go but this is where Cole Younger dies.\" \"All right Captain, I can die as game as you can,\" Charlie replies. \"Let's get it done.\"\n\n\nSpringing to his feet with a pistol in each hand he opens fire, hitting one posse member in the hand. A moment later he is shot through the chest and with a groan he falls dead to the ground. A moment later Jim is shot in the face, the bullet knocking out several of his teeth and lodging in his head, clutching his face he falls to the ground. Cole turns to look at Jim and a bullet hits him in the back of the head, he too falls to the ground. Glancing round you catch Bob's frightened eyes looking at you.", "action_results": [null, null]}]}]}]}, {"action": "Leave him alone and make your escape", "result": "You turn and run out of the bank, as you do you hear a gunshot behind you as Frank coldly executes the brave teller. Outside the bank you are greeted by a scene of utter pandemonium. Clell, Bill and a third man who looks like a citizen of the town are lying dead in the street; the rest of your Gang are riding their horses up and down firing their pistols up at the buildings where several men seemed to have armed themselves and are firing back. Bob's horse is lying dead and Bob himself runs off to find cover but your horse and Jesse's are still alive and you pull yourself onto your horse's back as Jesse does likewise with his.\n\n\nAs Frank emerges from the bank and the gunfire intensifies you see that you have to get out of town fast or you will all be killed. \"It's no use boys, lets clear out,\" you shout and spurring your horses into a gallop you concentrate on riding your horse out of time, quickly catching up with Charlie and Cole, the latter bleeding from several gunshot wounds. As you reach the edge of town you hear a scream behind you \"Don't leave me boys, I've been shot!\"\n\n\nGlancing back you realize you have all forgotten Bob who has sprung out of his hiding place and is sprinting down the street after you. \"Shit,\" Cole mutters and glances at you and Charlie. \"Cover me boys,\" he orders. Cole then does the most incredible thing you have ever seen someone do in real life: he spurs his horse directly back down the street towards his injured brother. Several men are shooting at them and though you and Charlie are firing your pistols at the buildings you might as well be throwing stones at them for all the good it does.\n\n\nCole and Bob seem to be moving through a virtual rain of bullets. Bob stumbles as one shot hits his leg. Two more graze Cole's horse making it scream and rear but he keeps it under control. Reaching down he helps Bob climb onto his horse. As he does three more bullets hit Cole, the dust exploding from his clothes in small puffs as each bullet hits him. Gritting his teeth he turns his horse around and gallops straight back towards you and Charlie. The gunfire is directed at you two now: one bullet grazes Charlie's arm and another bullet whizzes right past your right ear. As Bob and Cole reach you both you turn horses around and gallop out of town after Frank, Jesse and Jim.\n\n\nBehind you leave the dead bodies of your two fellow outlaws and the shattered myth of the invincibility of the James-Younger Gang.", "action_results": [null]}]}, {"action": "Concentrate on getting all the money you can", "result": "You ignore the fleeing man and begin scooping all the loose change you can find on the counter into a sack but Bob runs after him, stands in the back door of the bank and fires a shot at the fleeing man. Coming back inside the bank he slams the door. As he does you can hear shots outside and suddenly Cole's voice yelling \"Hurry up, they've given the alarm!\" \"God damn you, open the safe,\" Jesse barks at the teller on the floor and fires his pistol at the floor next to the man's head.\n\n\nYou and Bob quickly scoop all the loose notes you can find off the counter while Frank and Jesse continue to threaten the fallen teller who bravely refuses to help them in any way. Dozens of gunshots are ringing out on the streets outside now and again you hear Cole's voice shouting \"They're killing our men! Get out here!\" \"Fuck you,\" Jesse snarls, hitting the teller in the face again with his gun and then he and Bob give up and run out of the bank. As you are about to follow them you notice Frank massaging his wounded arm and eyeing the teller. \"We should kill that son of a bitch,\" Frank says to you.", "action_results": [null, null]}]}, {"action": "Join Cole and Clell in guarding the horses outside", "result": "That morning you ride up to the bank and while your companions enter you, Clell and Cole wait outside. After a few moments two men approach the bank and though you and Clell move to intercept them the men are walking too fast and suddenly freeze as they witness your friends holding up the bank at gunpoint through the bank's glass windows. \"Keep your damned mouths shut,\" Clell hisses and the men nod and start walking away when suddenly one of them starts shouting \"Get your guns boys! They're robbing the bank!\" Swearing Clell draws his pistol and fires a shot one of the men's head which misses.\n\n\nYou, Cole and Clell quickly mount your horses and begin galloping up and dozen the street firing your pistols into the air and shouting \"Get in, get in!\" Alerted by the shot, Jim, Bill and Charlie gallop into town and begin imitating your tactics. Unfortunately for you and your friends the townsfolk quickly find their weapons and begin returning fire at you all from the safety of windows, doorways and store fronts. As he rides past the bank Cole shouts to the men inside \"hurry up! They've given the alarm!\"\n\n\nAs you ride along the front of the bank you see a young man standing absolutely motionless nearby staring round in confusion. \"Get off the damn street,\" Cole yells at him as he rides past but the man just steps at him before suddenly putting his hand into his pocket.", "action_results": [{"action": "Shoot the man in the head", "result": "Your shot hits the man in the head and he falls to the ground fatally wounded. You turn away just in time to see Clell get shot off his horse by a bullet fired from somewhere high. As you and Cole ride towards him and dismount Clell is in a bad way, lying on the ground with blood pouring from his face and shoulder. A quick check reveals he is indeed dead. Cole snatched up Clell's pistol and cartridge belt but as he does so a bullet hits his left leg.\n\n\nGlancing up you think you can see the man who shot and killed Clell. He is standing at an upper-story window rapidly reloading a rifle in his hands. Though it is a very difficult shot with a pistol you could try to shoot and kill him.", "action_results": [{"action": "Fire up at the sniper", "result": "You fire up at the man, missing, and a moment later he fires back, hitting you in the throat. You fall backwards to the ground, your pistol flying from your grasp. You are dimly aware of Cole at your side shouting something in your ear but you can't hear him. You quickly bleed to death as the gun battle rages on, one of five men killed on this bloody day.", "action_results": [null]}, {"action": "Concentrate on finding cover", "result": "You duck down behind your horse to avoid the sniper but behind you another of the townsfolk fires a shot that hits you in the right arm. Swearing you risk remounting your horse and gallop after Cole, who has also been hit again in the shoulder. Riding past the bank he shouts \"They're killing our men! Get out here!\" Continuing down the street, still firing your pistol, you pass the dead body of Bill Chadwell who is lying dead in the dirt and Jim Younger, still mounted on his horse but bleeding from multiple wounds.\n\n\nFinally Frank, Jesse and Bob emerge from the bank at a run and make it to their horses. \"It's no use boys, let's go,\" you shout at them and turning your horse you spur it down the street leading out of town. You are soon joined by Charlie and Cole, the latter bleeding from several gunshot wounds. As you reach the edge of town you hear a scream behind you \"Don't leave me boys, I've been shot!\"\n\n\nGlancing back you realize you have all forgotten Bob who has sprung out of his hiding place and is sprinting down the street after you. \"Shit,\" Cole mutters and glances at you and Charlie. \"Cover me boys,\" he orders. Cole then does the most incredible thing you have ever seen someone do in real life: he spurs his horse directly back down the street towards his injured brother. Several men are shooting at them and though you and Charlie are firing your pistols at the buildings you might as well be throwing stones at them for all the good it does.\n\n\nCole and Bob seem to be moving through a virtual rain of bullets. Bob stumbles as one shot hits his leg. Two more graze Cole's horse making it scream and rear but he keeps it under control. Reaching down he helps Bob climb onto his horse. As he does three more bullets hit Cole, the dust exploding from his clothes in small puffs as each bullet hits him. Gritting his teeth he turns his horse around and gallops straight back towards you and Charlie. The gunfire is directed at you two now: one bullet grazes Charlie's arm and another bullet whizzes right past your right ear. As Bob and Cole reach you both you turn horses around and gallop out of town after Frank, Jesse and Jim.\n\n\nBehind you leave the dead bodies of your two fellow outlaws and the shattered myth of the invincibility of the James-Younger Gang.", "action_results": [null]}]}, {"action": "Ignore him", "result": "You turn away but seconds later you hear a gunshot and glancing back you find the young man shot through the head and lying motionless on the street. You turn away, this time just in time to see Clell get shot off his horse by a bullet fired from somewhere high. As you and Cole ride towards him and dismount Clell is in a bad way, lying on the ground with blood pouring from his face and shoulder. A quick check reveals he is indeed dead. Cole snatched up Clell's pistol and cartridge belt but as he does so a bullet hits his left leg.\n\n\nGlancing up you think you can see the man who shot and killed Clell. He is standing at an upper-story window rapidly reloading a rifle in his hands. Though it is a very difficult shot you could try to kill him.", "action_results": [null, null]}]}, {"action": "Join Jim, Bill and Charlie waiting on the edge of town", "result": "You join Jim, Bill and Charlie on the edge of town hoping the alarm will not be raised requiring you all to ride into town. Unfortunately, mere moments into the robbery, you hear a gunshot which is the signal for all of you ride into town. Spurring your horses into a gallop and drawing your pistols you ride down the street, firing your guns into the air and shouting for townsfolk to get off the street. Unfortunately by the time you all arrive the situation has degenerated into an all-out battle.\n\n\nTownsfolk have taken cover in buildings up and down the street, grabbed their weapons and are firing back at you all. Jim is hit in the left shoulder as you all gallop down the street and you are fired at by some people who have taken shelter in stores further down the street. Bill reins his horse to a halt and taking careful aim at the people he fires back  at them with his pistol while Jim and Charlie keep riding on.", "action_results": [{"action": "Join Bill in firing at the people in the building", "result": "You and Bill halt and fire your pistols at the people in the store but unfortunately there are several of them, they are behind cover adn they are armed with rifles. First Bill and then you are hit in the chest and with a wet gasp you fall from your horse onto the ground. Shot through the heart you rapidly bleed to death as the gunfight rages on.", "action_results": [null]}, {"action": "Keep riding on", "result": "You keep riding and hear a boom of a rifle and see Bill fall from his saddle dead to the ground. As you all reach the bank several more shots are fired at you: Jim is hit in his other shoulder and a bullet grazes your right hip making you wince. Outside the bank Clell Miller and another man are lying dead in the street while, Cole bleeding from his own wounds, is outside the bank firing his pistol into the air. As you arrive Bob, Jesse and Frank emerge from the banks and mount their horses, except Bob whose horse has been killed so he takes shelter under some wooden stairs.\n\n\n\"It's no use boys, let's go,\" you shout at everyone and turning your horse you spur it down the street leading out of town. You are soon joined by Charlie and Cole, the latter bleeding from several gunshot wounds. As you reach the edge of town you hear a scream behind you \"Don't leave me boys, I've been shot!\"\n\n\nGlancing back you realize you have all forgotten Bob who has sprung out of his hiding place and is sprinting down the street after you. \"Shit,\" Cole mutters and glances at you and Charlie. \"Cover me boys,\" he orders. Cole then does the most incredible thing you have ever seen someone do in real life: he spurs his horse directly back down the street towards his injured brother. Several men are shooting at them and though you and Charlie are firing your pistols at the buildings you might as well be throwing stones at them for all the good it does.\n\n\nCole and Bob seem to be moving through a virtual rain of bullets. Bob stumbles as one shot hits his leg. Two more graze Cole's horse making it scream and rear but he keeps it under control. Reaching down he helps Bob climb onto his horse. As he does three more bullets hit Cole, the dust exploding from his clothes in small puffs as each bullet hits him. Gritting his teeth he turns his horse around and gallops straight back towards you and Charlie. The gunfire is directed at you two now: one bullet grazes Charlie's arm and another bullet whizzes right past your right ear. As Bob and Cole reach you both you turn horses around and gallop out of town after Frank, Jesse and Jim.\n\n\nBehind you leave the dead bodies of your two fellow outlaws and the shattered myth of the invincibility of the James-Younger Gang.", "action_results": [null]}]}]}, {"action": "Stay behind with Hoobs in Missouri", "result": "The others are disappointed by your decision but accept it and you choose to stay behind at the Kerry Farm with Hoobs. One morning you are in the kitchen when there is a knock on the front door. When Hoobs goes to answer it you hear a voice cry out \"Hoobs Kerry, you are under arrest!\" Springing quietly to your feet you quickly consider your options. There are two doors out of the kitchen, one to a pantry and one leading outside, you can either hide in the pantry or run out the back door and make for the nearby woods.", "action_results": [{"action": "Hide in the pantry", "result": "Quickly and quietly you cross the room, slip inside the pantry and close the door behind you. Unfortunately for you the lawmen search the house to see if anyone is hiding there and soon discover your hiding place. Dragged out you are taken into custody with Hoobs Kerry who soon starts singing like a canary, identifying all the members of the James-Younger Gang including you and claiming you took part in the Otterville Train Robbery, whether you did or not. Your trial is a foregone conclusion so you plead guilty to armed robbery of a train and escape with the incredibly light sentence of two years imprisonment.\n\n\nWhile you are in prison the rest of the gang tries to rob a bank in Northfield, Minnesota but the alarm is raised and an epic gunfight breaks out. Bill and Clell are killed and soon after Charlie is killed and Cole, Bob and Jim are all wounded and captured in a second major gunfight. Only Frank and Jesse James succeed in escaping Minnesota and when you are released in 1878 you immediately return to Missouri to rejoin them, Hoobs has already been released and gone into hiding. By the following year Jesse has formed a new Gang and he invites you to join them.", "action_results": [null]}, {"action": "Run out the back door", "result": "Opening the back door silently you slip outside, shut the door and run for the safety of some nearby woodland. You escape completely and stealing a horse you set off up to Minnesota after your companions. You manage to catch up with them and breathlessly tell them the story of Hoobs's capture. You all decide to go ahead with your robbery plans anyway and continue on up to Minnesota and begin looking for banks to rob.", "action_results": [null]}]}]}, {"action": "Join Jim in sitting this robbery out", "result": "You hide out with Jim at Hoob Kerry's Farm while the others pull off the robbery and rejoin you. You are all ready now to make the trip up to Minnesota and even Jim joins you to help protect his brothers. At the last moment Hoobs gets cold feet, he has been nervous ever since the train robbery and he insists on staying behind at his farm in Missouri. You and the other outlaws are not impressed but since you can't force him to go with you if he doesn't want to you all agree to let him back out of the planned robbery and make preparations to head up to Minnesota without him.", "action_results": [null, null]}]}]}, {"action": "Go south into Tennessee with Tom Webb", "result": "You and Tom split off from the other two and ride south. For five days you make your way out of West Virginia and across Tennessee until you feel confident you have left your pursuit behind you but you are mistaken. One afternoon as you are trotting your horses along a rocky hill path several lawmen suddenly rise from behind several rocks to your right and level their rifles at you. \"Throw up your hands gentlemen,\" one of the lawmen calls out. \"You are under arrest.\"\n\n\nAfter a moment's hesitation Tom raises his hands. He is between you and the lawmen giving you a little time and glancing to your left you see the hillside descends steeply into a tree-lined valley. You could spur your horse down into the valley but it would be very dangerous and if you horse trips or fall he could roll down the hill, killing you both. As the lawmen approach slowly and cautiously you know you only have seconds to decide.", "action_results": [{"action": "Surrender like Tom", "result": "Meekly you raise your hands into the air and together with Tom you are taken into custody. Imprisoned in Nashville you are put on trial and witnesses from Huntingdon swiftly identify both of you as men who helped rob the bank. You both refuse to name your fellow outlaws and together you are both sentenced to eight years imprisonment for armed robbery. This effectively ends your outlaw career and until 1883 you are forced to perform hard labor in the prison.\n\n\nOver the following years your companions are all captured or killed. Bill, Clell and Charlie are killed and Bob, Cole and Jim are captured following a failed bank robbery in Minnesota the year after your capture. Frank and Jesse remain at large for another six years until Jesse is murdered by a friend of his called Robert Ford while he hangs a picture on the wall and to avoid the same fate Frank surrenders himself. Finally the long years of prison end and in the winter of 1883 you and Tom are released. Frank soon after is acquitted after a series of trials and both of you decide to renounce your outlaw ways and enter into a peaceful retirement.", "action_results": [null]}, {"action": "Risk spurring your horse down the slope", "result": "You spur your horse down the slope and the lawmen cry in alarm as you vanish from sight. Bounding and slipping your horse takes you down the slope in what seems mere seconds and you are in the safety of the trees. Riding as fast as you dare through the woodland you make it to safety and escape from Tennessee back to Missouri. You later read that Tom Webb was found guilty of armed robbery and sentenced to eight years imprisonment, true to the rest of you he doesn't identify his fellow outlaws. You hide out in Missouri over the winter and spring until in the summer the gang re-gathers again in the little Missouri town of Otterville.", "action_results": [null]}]}]}]}, {"action": "Lie low with Jesse, Clell and Bob in Missouri", "result": "You decide to stay in Missouri with your friends and hide out at the Farm of Hoobs Kerry, another former Guerrilla but a bit of a flake. The others travel to West Virginia and pull off their robbery but during their escape Tom McDaniels is shot and killed by a posse and Tom Webb is captured: only Frank and Cole make it back to Missouri. You spend the rest of the year and the first half of 1876 resting until Jesse summons all the Gang together for a meeting to plan your next robberies in the small Missouri town of Otterville.", "action_results": [null]}]}, {"action": "Let the others kill him", "result": "You hold back from firing but the others don't and Ladd jerks as three bullets slam into his chest, knocking him to the ground. Fleeing the property you decide it is better to get out of Missouri and heading south to join Bob and Cole. Most of the newspapers, which were initially supportive of the James brothers after the attack on their family, are outraged by the two murders and urge people everywhere to shoot any member of the James-Younger Gang on sight.\n\n\nGoing down to the McDaniels Farm you meet up with Bob, Cole and their host Tom McDaniels, brother of the slain Bud. Together with another friend and war veteran called Tom Webb the group are planning to rob a bank in West Virginia, far from your usual raiding areas. Frank likes the idea but uncharacteristically Bob, Clell and Jesse think it is better to lay low for a spell until the attention of the Pinkertons has worn off. You will have to choose who to join.", "action_results": [null, null]}]}, {"action": "Let Jesse finish him off", "result": "Jesse shoots the old man twice more in the chest and he falls dead to the ground. Fleeing the scene rapidly you and your companions take to the woods where you live in hiding. Reading newspapers you learn that the Pinkerton Detective Agency are sending one of their Agents, Jack Ladd, to investigate Dan Askew's murder. As Ladd also took part in the attack on the James Family Farm Frank and Jesse see more opportunity for revenge and decide to kill the Pinkerton as well.\n\n\nReturning to the Askew Property armed with rifles you and your companions sneak through the trees and get yourself into a position from which you can see the farm house. You watch it for several hours until finally a man in a smart suit who you recognize as Ladd from the newspaper photographs emerges from the front door. \"Now,\" Jesse murmurs and all of you raise your rifles. You consider whether or not to fire at the unsuspecting man.", "action_results": [null, null]}]}, {"action": "Go with Bud to Kansas City", "result": "You join Bud in going to Kansas City where you both check into a hotel and begin celebrating your success at the train robbery by frequenting local bars. Unfortunately one night Bud drinks too much and brags to some girls that he helped rob the Muncie Train, they promptly tell some local lawmen. That night you are woken by a fist slamming against your hotel door and a voice calls out \"This is the law Bill Grey, come out with your hands up in ten seconds or we start shooting!\" You spring from your bed and glance around the room, the only exit apart from the door is the window but you are on the first floor and could hurt yourself quite badly if you try jumping out.", "action_results": [{"action": "Surrender to the lawmen", "result": "\"Ok, I'm coming out,\" you call wearily and open the hotel door to find a pistol pointing at your face. You and Bud are promptly taken to the Kansas City Jail but as you are taken to a cell a commotion breaks out a few cells away as a prisoner grabs a policeman who has got too close to the cells. The two lawmen escorting you and Bud promptly abandon you both to go and deal with the situation. Though handcuffed you both immediately take advantage of the situation and make a break for the unlocked front door of the Jail.\n\n\nSeeing what you are doing the lawmen shout in alarm and as you race down the street a shotgun blast suddenly fires behind you. The charge hits Bud in the back, nearly cutting him in half as he flies to the ground dead. You glance back and see a Deputy standing in the Jail doorway re-cocking his shotgun for another shot. An alleyway opens to your left and you could dart down that or you could keep going towards a horse tied to a hitching post a short way further down the street.", "action_results": [{"action": "Dart down the alley", "result": "You reach the alley and dart down it just as the lawman fires again, the shotgun pellets whistling harmlessly across the mouth of the alley behind you. Racing down the alley and then through a tangle of streets you manage to find an unguarded horse, steal it and ride out of Kansas City. You find a blacksmith who can remove your handcuffs and unnerved by your narrow escape you spend the next year in hiding in Kansas until in the summer of 1876 you get a letter from Jesse telling you the Gang is gathering in Otterville, Missouri. Reluctantly you return to your outlaw life.", "action_results": [null]}, {"action": "Make for the horse", "result": "You keep running down the street but the shotgun explodes into life behind you. Dozens of tiny razor-sharp pellets tear through your back and emerge out your chest, shredding your heart and other organs. The blast throws you down onto the street and kills you in an instant of oblivion, conclusively ending your attempt to escape justice.", "action_results": [null]}]}, {"action": "Risk the jump", "result": "Opening the window wide you slip your legs over the sill, brace yourself and slide down. You fall straight down fifteen feet and land in a crouching position, badly spraining your right wrist. Hissing in pain you spring to your feet as you hear your hotel door burst open above you and slip down an alleyway. Racing through the streets you find and steal a horse before riding out of town. A few days later when you are in another town you learn that Bud McDaniels was arrested and killed trying to escape.\n\n\nYour latest narrow escape has made you wary of fresh crimes for a while and you spend a year drifting around Kansas while your fellow gang members pull off more robberies and crimes. Finally in the summer of 1876 Jesse summons the whole gang together to meet in the little town of Otterville, Missouri to plan your most daring crimes yet.", "action_results": [null]}]}, {"action": "Go with Bob and Cole to Texas", "result": "You and your two friends go to Tom McDaniels's house where you lie low together with another friend of Tom's and a fellow war veteran called Tom Webb. You read in the papers that Bud McDaniels was recognized as a train robber in Kansas City and killed while trying to escape arrest. Bud is very sad to hear about the death of his brother. You are all soon joined by Frank, Jesse and Clell who have fled Missouri after killing two men including a Pinkerton Agent.\n\n\nYou, Cole and the two Tom's have developed a plan to rob a bank in West Virginia which is far from your usual hunting areas and hopefully not as well protected. You explain the plan to the others but only Frank is keen, unusually Jesse, Bob and Clell think it is better that you lie low for the rest of the year and start robbing targets again next year. Finally only Frank, Cole, Tom McDaniels and Tom Webb agree to the idea while Jesse, Bob and Clell announce they are going to hide out in Missouri.", "action_results": [null, null]}]}, {"action": "Join Bill and Charlie in hiding out at the Pitts's Farm", "result": "You hide out with Bill Chadwell and Charlie Pitts at Charlie's farm, mostly staying in and around the property while the others do the chores of going into town for supplies and newspapers. You become reliant on the newspapers, reading avidly about the rest of the gang's crimes but rarely seeing your fellow outlaws until after two years you are starting to go stir-crazy. You persuade Bill and Charlie to join you in robbing a bank in the little town of Baxter Springs, Kansas.\n\n\nOne spring morning you lead your companions into the little town of Baxter Springs and dismount outside the town bank. While Bill holds the horses you and Charlie walk into the bank, draw your pistols, take the lone teller hostage and loot the safe. After locking the teller inside you all ride out of town, traveling cross-country until you get to a safe place where you can count the money. You find that you have stolen $3,000, making your share $1,000 - not bad for a morning's work! You return to the Pitts Farm for a few months until a letter arrives from Jesse telling you that the Gang is gathering in Otterville, Missouri to plan it's most daring robberies yet!", "action_results": [null]}]}, {"action": "Join Frank and Cole at the McDaniels Farm", "result": "You stay at the McDaniels Farm and soon learn that the robbery of a stagecoach in Texas went off without a hitch when the rest of the gang (bar Jim Younger who is still in California) rejoin you at the McDaniels Farm. The success of the robbery has encouraged Frank and Cole to join in fresh robberies and you soon have a new gang member in the form of Bud McDaniels, the cheerful life-long friend of the Younger family. Together you all plan a daring train robbery in Kansas but Bill and Charlie prefer to lay low this time and return to their hiding place at Charlie's farm as they are both enjoying the fact they haven't been identified as outlaws yet and have safety in their anonymity. You need to choose which group you join.", "action_results": [null, null]}, {"action": "Go to California with Jim Younger", "result": "You travel with Jim out to California where the pair of you purchase a cabin, a tract of land and live a quiet life as farmers for two years. You continue to read about your companions committing more crimes but continuing to elude capture. Finally a letter arrives from Bob urging you both to return to Missouri where the Gang are planning their most daring crimes yet. \"We'll have to go,\" Jim says with a great sigh. \"I'll never forgive myself if the law catches or kills Bob and Cole like it did with John and I'm not there to help them.\" Reluctantly the pair of you leave your peaceful lives in California and in the summer of 1876 you return to Missouri to return to the outlaw life.", "action_results": [null]}]}, {"action": "Join Frank, Jesse, Bob, Cole, Jim and John in robbing a stagecoach in Arkansas", "result": "Crossing the border into Arkansas you and your companions continue your crime spree by holding up a stagecoach one night outside the town of Hot Springs. After stopping the coach you all force the passengers to disembark at gunpoint and relieve them of their money and valuables. Escaping back across the border to Missouri you count the loot and find you have gotten away with $2,000, which split seven ways makes your share $200. Jesse now has plans to rob another train.", "action_results": [{"action": "Another Train Job", "result": "At a little community called Gad's Hill you, Frank and Jesse board the night train, having come up with a new way to stop the train. Making your way to the locomotive you draw your pistols, take the driver hostage and order him to stop the train where the four Younger brothers are waiting next to a fire. They board too and while you and Frank guard the driver Jesse leads them to the back of the train to rob the Express Carriage. This safe is quite full and when you have finished the robbery you all mount your horses and ride off, back across the Arkansas border knowing state law forces can't pursue you across state lines. Counting the money you find you have stolen an impressive $12,000, $1,700 of which is yours.\n\n\nBut your crime spree is not finished yet.", "action_results": [{"action": "Another Arkansas Hold-Up", "result": "Keen to expand into new areas of criminal achievement Jesse has heard of a wealthy store owner in the little Arkansas town of Bentonville. Sure enough one evening you all ride into town and dismount outside, while the others hold the horses you and Cole enter the store and at gunpoint force the solitary owner to hand over the contents of the till. He might be wealthy by Bentonville standards but not by your standards, he hands over a paltry $200 which isn't large enough to warrant you getting a sizable share.\n\n\nYour unprecedented crime wave in Arkansas and Missouri has got the attention of the National Press and in Missouri you all read how the Pinkerton Detective Agency has been hired specifically to bring each and every member of the James-Younger Gang to justice. Though Jesse and Bob want to continue the crime spree the rest of you persuade them it is better that you all split up. Frank and Jesse decide to go back to the James Farm, Jim and John will go back to the Younger Farm while Cole and Bob decide to go and hide out at the Farm of their friend Bud McDaniels. You will have to pick one of these pairs to accompany.", "action_results": [{"action": "Hide out with Frank and Jesse at the James Farm", "result": "Riding with the James boys you soon get back to their Farm where you hide out for a time until one night there is a knock on the door. Frank and Jesse's mother Zerelda opens it and a young man steps in. He claims he is a worker looking for work in the area and heard there might be a place in the James Farm. Zerelda leads him into the kitchen where you and your companions are waiting. You can tell just by looking at him he isn't a common worker and has the look of an educated man. Frank draws his pistol, cocks it and points it at the man. \"You are a Pinkerton Detective,\" he declares. \"I would bet my life on it.\"\n\n\nThe man vigorously denies this but a quick search of him reveals a pistol in his pocket and incriminating papers. The three of you march him out of the Farmhouse and across several fields, interrogating him the whole way. Finally when Jesse holds a knife to his throat the man breaks down and admits he is a Pinkerton Detective called Joseph Whicher. You and Jesse glance at each other. \"What do you want to do with him?\" you ask. \"Shoot him,\" Jesse replies. You silently glance among yourselves deciding who will do it.", "action_results": [{"action": "Take out your pistol and execute Whicher", "result": "You walk up behind Whicher and shoot him in the back of the head. As he falls to the ground Jesse draws his pistol and shoots him twice more in the back. Frank kneels down to check that he is dead before nodding. \"Let's go,\" Jesse mutters and returning to the Farm the three of you mount your horses and ride south to Texas. A week later you are shocked to read of another gunfight in the area: two more lawmen caught up with Jim and John and in a raging gun battle both lawmen and John Younger were killed.\n\n\nAs Pinkerton Agents pour into Missouri to avenge their slain Detectives Jesse fires off a series of letters summoning the whole Gang to Texas. Cole, Bob and Jim are devastated by the death of their brother, particularly Jim who blames Frank and Jesse for getting John involved in robberies in the first place, swearing he wants nothing more to do with them and declaring he's going to California. Frank and Cole think it's better to lie low at their friend Bud McDaniels's farm but Jesse is certain the best way to avenge John's death is to rob a stagecoach here in Texas and the newer gang members, Clell, Bill Chadwell, Charlie Pitts and Bob Younger all agree to join him. You have to choose who to go with.", "action_results": [null, null, null]}, {"action": "Leave it to Frank or Jesse to kill Whicher", "result": "You are all silent for a moment and then Jesse walks up behind Whicher and shoots him in the back of the head. As he falls to the ground Jesse shoots him twice more in the back. Frank kneels down to check that he is dead before nodding. \"Let's go,\" Jesse mutters and returning to the Farm the three of you mount your horses and ride south to Texas. A week later you are shocked to read of another gunfight in the area: two more lawmen caught up with Jim and John and in a raging gun battle both lawmen and John Younger were killed.\n\n\nAs Pinkerton Agents pour into Missouri to avenge their slain Detectives Jesse fires off a series of letters summoning the whole Gang to Texas. Cole, Bob and Jim are devastated by the death of their brother, particularly Jim who blames Frank and Jesse for getting John involved in robberies in the first place, swearing he wants nothing more to do with them and declaring he's going to California. Frank and Cole think it's better to lie low at their friend Bud McDaniels's farm but Jesse is certain the best way to avenge John's death is to rob a stagecoach here in Texas and the newer gang members, Clell, Bill Chadwell, Charlie Pitts and Bob Younger all agree to join him. You have to choose who to go with.", "action_results": [null, null, null]}]}, {"action": "Hide out with Jim and John at the Younger Farm", "result": "You and your two friends go into hiding at the Younger Farm for a time but one morning you read in the papers that Frank and Jesse have killed a Pinkerton Detective near their Farm and you decide you'd better leave. After traveling all night you are hiding out at a friend's farm where you hear men making inquiries about you to the farm's owner. After they leave John is keen to get after those men and find out who they are and you and Jim reluctantly agree.\n\n\nRiding down the road you see three men riding ahead of you. You and Jim draw your pistols and John pulls a shotgun from his saddle scabbard and all three of you shout for the men to halt. One reins in but the third gallops away for his life, with casual accuracy Jim fires a shot that knocks the hat off his head but leaves the man beneath it untouched. As he vanishes down the road the rest of you close in on the two that remain and order them to throw their guns onto the road which they do.\n\n\nWhile Jim dismounts and begins collecting up the pistols you and John start questioning the two men. They insist they are cattle buyers but when you accuse them of being Pinkerton Agents one of the men suddenly pulls a small pistol from his pocket and shoots John in the throat. Knocked backwards by the force of the shot John instinctively shoots the man in the chest with his shotgun. The wounded lawman turns his horse away from you all and Jim fires a shot at him, missing. The second, unhurt lawman, also turns his horse away as you raise your weapon.", "action_results": [{"action": "Shoot him in the back of the head", "result": "Your shot hits the man in the back of the head and he falls from his horse. While Jim runs over to check if he is alive John spurs his horse after the wounded lawmen and chases him straight across a field towards a copse of trees, dropping his shotgun as he goes and drawing a pistol which he fires at the man. You spur your horse after John and watch as he shoots the wounded lawman a second time knocking him from his horse. Exhausted and weakened from his injury Jim turns away without checking to see if the lawman is dead or not.", "action_results": [{"action": "Spur your horse into the thicket to check if the lawman is dead", "result": "You gallop your horse straight towards the thicket and as you do the lawman shakily rises from cover and fires a pistol shot at you. The bullet hits you squarely in the right eye, toppling you from your saddle and you lie insensible on the ground. You are the fourth victim of a gunfight that claimed the lives of the two lawmen and your fellow outlaw John Younger. Your famous last gunfight will become the stuff of Western Legend, though this is no consolation to you as you lie dead on the green fields of Missouri.", "action_results": [null]}, {"action": "Approach cautiously with pistol ready", "result": "You approach cautiously and as you do the badly-wounded lawman rises from cover to fire a shot at you. You fire first, hitting him in the chest for the third time and knocking him down, fatally wounded. Turning you spot your friend John reeling in his saddle nearby, blood pouring down his chest from his neck. As you ride towards him he suddenly topples to the ground. Reaching him you dismount and drop to your knees alongside him as his brother Jim runs up but it is too late. Your friend John is dead.\n\n\nTwo farmer working in a nearby field witnessed the gunfight and run up. \"See that my brother is buried right,\" Jim tells them, tears in his eyes, as he takes John's pistol from his motionless hand and you both run back to where you left your horses. Remounting you leave the two lawmen and John lying dead on the bloody field. Riding south you escape Missouri and eventually make it to Texas where you rejoin the rest of the Gang.\n\n\nJim is inconsolable and blames Frank and Jesse for his brother's death, claiming they lured John into taking part in their robberies. Swearing he never wants to see them again he declares he is going to California. Frank and Cole also think it is a good idea to lie low at their friend Bud McDaniels's farm but not Jesse: he thinks the best way to avenge John is to rob a stagecoach here in Texas and the newer members of the gang, Clell, Bill Chadwell, Charlie Pitts and Bob Younger, agree with him. You have to choose who you will accompany.", "action_results": [null, null, null]}]}, {"action": "Check to see if John is alright", "result": "You glance at John who seems to have recovered, as you do Jim raises his pistol and shoots the fleeing uninjured lawman in the back of the head. While Jim runs over to check if he is alive John spurs his horse after the wounded lawmen and chases him straight across a field towards a copse of trees, dropping his shotgun as he goes and drawing a pistol which he fires at the man. You spur your horse after John and watch as he shoots the wounded lawman a second time knocking him from his horse. Exhausted and weakened from his injury Jim turns away without checking to see if the lawman is dead or not.", "action_results": [null, null]}]}, {"action": "Hide out with Bob and Cole at the McDaniels Farm", "result": "You and your friends hide out at the home of Bud McDaniels, who along with his brother Tom is a good friend of the Younger Family. There you read about the Pinkerton Detectives flooding into Missouri in search of you all. Frank and Jesse confront and kill one near their Farm, prompting you, Cole and Bob to flee south to Texas. You are still en route when you learn that two more lawmen have caught up with Jim and John and in a bloody gunfight both lawmen and John Younger are killed. Bob and Cole are devastated when you grimly report their brothers death to them.\n\n\nReaching Texas you are soon joined by Frank and Jesse with the rest of the gang following soon after. Jim in particular is angry, blaming Frank and Jesse for John's death because they got him involved in robberies in the first place and he angrily swears he is going to California and wants nothing more to do with them. Frank and Cole also think it is better to lie low and hide out at Bud McDaniels's Farm but Jesse persuade the newer gang members Clell, Bill Chadwell, Charlie Pitts and Bob Younger that the best way to avenge John is to rob a stagecoach in Texas. Again you have to choose who to join.", "action_results": [null, null, null]}]}]}]}]}, {"action": "Let someone else do it", "result": "Jesse uses the hammer and iron bar to pry up several railway tracks. You and the rest of the Gang then take cover in the trees near the track and wait for the train. When the train comes down the line you are astonished by how fast it is going. The driver sees the damage to the track and slams on the brakes but the train is going too fast: to your astonishment the locomotive shoots off the end of the broken line and crashes down onto it's side with an ear-splitting crash, as does the first passenger carriage. The noise is indescribable.\n\n\nThe train has come to a complete halt with the front two carriages on their side and you and your deafened companions emerge stunned from the trees. While Bill, Charlie, Bob and Jim hold the horses and Jesse leads most of the rest towards the Express Carriage at the rear of the train you and Frank jog to the crashed locomotive and peer inside. The sight sickens you, the driver has been literally crushed to death and the fireman has been badly hurt, bleeding freely from his head.\n\n\nYou are still shaken by the time you return to the woods and are rejoined by Jesse and the others. Mounting up you ride away from the train you have just wrecked and ride nonstop for several hours to get to safety. When you count the money you are disappointed to find the train was not carrying a lot, just $3,000 which is divided between the ten of you to make your share $300. Despite the small profits from this you know this brazen robbery will increase your already great fame and notoriety.\n\n\nBill, Clell and Charlie are all a bit unnerved by the attention this crime will bring and decide they will all go and hide out at Charlie's farm in Missouri. Jesse, as usual, is delighted and indifferent to the fact the robbery has led to another death. He intends for himself, Frank, Bob, Cole, Jim and John (all the James and Younger brothers) to ride south into Arkansas to rob a stagecoach, another type of crime the Gang haven't committed before which Jesse hopes will lead to more fame. It is up to you whether or not you want to go into hiding or join in the crime spree.", "action_results": [null, null]}]}]}]}, {"action": "Join Jesse, Cole and Frank in robbing the Kansas City Exposition", "result": "After a few months hiding out you and your companions ride into Kansas City on the day of the Exposition and approach the ticket office. \"Hand over the money box,\" Jesse tells the cashier and you all draw your pistols. The man obediently obeys and quickly the four of you start to ride away. The alarm is quickly raised and as the guards of the Exposition are alerted you and your friends start firing your guns into the air to clear the crowd. It works well and you are quickly clear and riding to safety.\n\n\nJesse is delighted with the ease of the robbery and opening the cashier's money box you find you have made off with $1,000, which split between the four of you makes your share $200. The event is widely reported and to make sure the reports are correct Jesse sends his own letter to the newspapers describing the robbery. You are slightly worried when you learn that Clell has been arrested for the Columbia Bank Robbery but he is soon released when witnesses of the robbery fail to identify him, in high spirits you and the rest of the Gang gather in the spring of 1873 to plan your next robbery.", "action_results": [null]}, {"action": "Join Clell at the Miller Farm", "result": "You and Clell hide out at the Miller Farm for a few months until one evening there is a knock on the door. Clell goes to answer it and you hear a voice declare \"Clell Miller, you are under arrest.\" You are sitting in the kitchen and springing to your feet you raise to the back door. As you do you hear a voice yell halt and glancing back you see a Deputy Sheriff standing in the kitchen doorway pointing a pistol at you. You have to decide whether or not to surrender or keep running.", "action_results": [{"action": "Surrender", "result": "Unwilling to risk a bullet in the back you sigh and raise your hands. You and Clell are taken into custody and escorted to the local jail. There you find things aren't as bad as you fear: you and Clell are only charged with the armed robbery of the Columbia Bank. Even better when the four customers who were in the bank are brought to the jail to identify you they seem uncertain that you are the men who really robbed the bank. Thanks to their mistake you and Clell are released on bail due to the lack of evidence and you both promptly go on the run. Pleased at your lucky break you meet up with the rest of the gang in the spring of 1873.", "action_results": [null]}, {"action": "Keep running", "result": "Taking a risk you dart out the door, promptly turn right and spring around the side of Clell's farmhouse. The Deputy tries to pursue you but you lose him in the dark and escape through the tangle of trees that surrounds Clell's home. Making it to safety you read more good news in the papers: after being arrested and charged with the Columbia robbery Clell was released when witnesses failed to identify him as one of the robbers. Pleased at your success you and the rest of the gang reunite the following spring.", "action_results": [null]}]}]}, {"action": "Let someone else deal with them and focus on getting all the money you can", "result": "You move towards the counter and as you do Cole fires a shot that hits one of the men in the hand. He yells in pain but a moment later the four customers have scrambled out the door leaving the three of you alone in the bank with the dead teller on the floor behind the counter. \"Quickly, grab the money\" you tell the others and moving fast you snatch up all the money you can find on the counter. In less than a minute you are back outside to find Frank, Clell and John firing their pistols into the air as you, Jesse and Cole scramble back onto your horses. A man runs out onto the street and fires a pistol at you, Jesse fires back. Both miss but Jesse's shot prompts the man to take cover and the six of you are able to spur your horses out of town and escape.\n\n\nRiding hard you do not stop until you are a long way from Columbia. When you pause to count the money you find you have escaped with less than $1,000, which makes your share $200. Frank is especially unhappy.\n\n\n\"We're killing too many bank tellers Jesse,\" he tells his brother. \"This will bring the law down on us.\"\n\n\n\"Maybe we should lay off banks for a while,\" Jesse says thoughtfully and grins. \"I have a mind to rob a ticket office at the Kansas City Exposition.\"\n\n\nAfter a quick discussion Cole and John both offer to join Jesse but Frank and Clell decide it is better to lay low - Frank is going back to the James Farm while Clell is going back to his own family's farm. You consider what is best to do.", "action_results": [null, null, null]}]}, {"action": "Keep yelling at him to be quiet", "result": "You keep shouting at the teller but he continues to shout at the top of his lungs. A moment later Jesse and Cole both shoot him and the cashier falls dead to the ground. Instantly the four customers spring to their feet and start running for the door. \"Stop them,\" Jesse yells.", "action_results": [null, null]}]}]}]}, {"action": "Let him go", "result": "Frank fires a shot that hits the man in the back of the right arm but he keeps on running and makes it through the door and out onto the street. \"Quickly boys, get the money,\" you call out and moving quickly you, Frank and Jesse scoop up all the money you can find from the counter, which comes to several hundred dollars. Unwilling to spend time pillaging the vault you all run outside and begin mounting your horses but the alarm has already been raised a a few citizens are taking pot shots at you with pistols from teh shelter of a gun store.\n\n\nWhen a bullet nicks it Jesse's horse rears up in terror, spilling it's rider to the ground before running off. \"Get up behind me Jesse,\" Frank yells and while you fire your pistol at the gun store, trying to cover them, Jesse awkwardly scrambles up behind Frank. The three of you ride out of town on two horses, not stopping for several hours until you reach the safety of the James Farm. There you find you have escaped with less than $700, making your share a paltry $200. There is worse news to follow however.\n\n\nThe next morning Frank returns to the Farm with a paper. \"It wasn't Colonel Cox who we killed in Gallatin,\" he declares. \"It was some bank clerk called John Sheets. They know it was us as well, we've all been identified by name. We'd better clear out.\" Leaving the James Farm the three of you go traveling for a year to wait for the attention to die down before returning to Missouri in the summer of 1871 and arranging a meeting with Cole Younger at the home of your mutual friend Clell Miller. Despite the loss of John, George and Ol you are all determined to continue your robberies.", "action_results": [null]}]}, {"action": "Hold your fire", "result": "You pause but Jesse shoots the man in the head, blasting his brains out onto the wall behind him. As the teller slumps dead in his chair Frank and Jesse fire more bullets into him. The customer screams \"Murder!\" and starts running past the three of you towards the door to the bank. \"Shoot him,\" Jesse yells.", "action_results": [null, null]}]}, {"action": "Go with John, George and Ol to the Shepherd Farm", "result": "The four of you arrive at the Shepherd Farm where you hide out for a time until, less than two weeks after the Russellville Robbery John returns to the Farm with a bombshell: all four of you have been identified as participants in the Russellville Robbery and warrants have been issued for your arrests.\n\n\n\"We need to split up again,\" John declares. \"I'm going back to my farm, you stay here Ol. George, you go and hide out at the Miller Farm. Who do you want to go with Bill?\"\n\n\nYou consider who would be best to hide out with and where you consider safest.", "action_results": [{"action": "Go with John to the Jarette Farm", "result": "You and John go to his Farmhouse where you are the only residents and for a few days you live in peace. One night you are woken by an alarming crackling sound and springing from your bed you see smoke filling the house. A glance through the windows shows dozens of men outside armed with all sorts of weapons from guns to pitchforks. Grabbing your pistol you rush out of your room in your underclothes to encounter John similarly prepared.\n\n\n\"The house is on fire and we're surrounded by vigilantes,\" John declares. \"We'll have to make a break for it.\"\n\n\nThere is only one door into the farmhouse and no windows so John approaches it carefully, a pistol in each hand and prepares to charge out guns blazing. As he does so you glance at the chimney and the thought strikes you that if you can somehow squirm up there you might be able to drop down from the roof and escape, though if you get stuck you'll probably be burnt alive.", "action_results": [{"action": "Follow John out the main entrance", "result": "The pair of you throw open the front door and race out into the night as flames engulf the house. As you start running a voice shouts \"Death to the bank robbers\" and gunshots ring out. John jerks like a marionette as bullet after bullet tears through his body and he topples to the ground. You make it a few more feet until a shotgun explodes into life directly in front of you, hitting you in the centre of the chest and hurling you back onto the ground. As you struggle to rise more pistol and rifle bullets hit you and like John you die in a rain of bullets, killed by vigilantes on this bloody night.", "action_results": [null]}, {"action": "Risk the chimney", "result": "Squirming awkwardly up the chimney you shimmy yourself up the narrow chimney shaft. Outside you hear shouts and dozens of gunshots but focus on ignoring the intense heat and making it up the chimney. Finally you burst out into the cold night air of the roof. Approaching the edge of the roof cautiously you glance down to see John lying dead in a pool of blood just in front of his house. There is a shout as a vigilante spots you and points at you.\n\n\nTurning you race across the roof as vigilantes fire at the spot where you were seen and with a flying leap you jump off the back of the roof, fortunately landing on one of the few snow mounds to have escaped destruction from the spring sun. Scrambling up you race through the trees that surround John's farmhouse and make your escape through the forest. After an all-night journey you manage to make it to a friend's house and safety.\n\n\nIn the morning you buy a newspaper and read about a series of raids carried out against you and your companions. Ol Shepherd is dead too, killed by lawmen while resisting arrest. George has been arrested and charged with bank robbery. After a short trial he is found guilty and given a short prison sentence. For the next three years you move around Missouri, never staying in one place for too long until finally in the spring of 1871 you re-establish contact with Cole Younger and Frank and Jesse James and arrange to meet at the farm of your mutual friend Clell Miller.\n\n\nThough the gang has lost three of its members you are determined to continue your bank-robbing career.", "action_results": [null]}]}, {"action": "Go with George to the Miller Farm", "result": "You and George set off towards the Miller Farm but you never get there. One evening you reach the little town of St Joseph and as you are trotting your horses down the street two lawmen armed with rifles emerge from an alleyway to your right. \"Hold up your hands men, you are under arrest!\" one calls out. George immediately raises both his hands but the thought crosses your mind that rather than surrender you could lean down your horse's left flank and try to spur it into a gallop for safety. That would be far more dangerous than just surrendering however.", "action_results": [{"action": "Surrender", "result": "Slowly you raise your hands and allow the lawmen to take you into custody. You and George are swiftly imprisoned and put down for an early trial, around the same time both John and Ol are shot and killed while trying to escape arrest. Your trial is a simple affair: you and George are both found guilty of armed robbery and both receive a fairly lenient sentence of three years imprisonment. You serve your time and when you are both released George decides he is done with crime and is ready to go straight. You have no such intention and immediately arrange to meet Cole Younger, Frank and Jesse James at the farm of your mutual friend Clell Miller to resume your outlaw career.", "action_results": [null]}, {"action": "Try riding to safety", "result": "You start to raise your arms and then suddenly yell out \"Fuck you, you sons of bitches!\" Leaning down in your saddle to try to keep your horse's body between yourself and them you dig your spurs in so deep they draw blood. With a scream your horse bolts, the lawmen fire a few pistol shots which zip overhead but within seconds your horse has carried you down the street, out of town and across the prairie leaving the startled lawmen with their prisoner. Riding your unhappy horse all night you reach safety and over the next few days learn what has transpired.\n\n\nIn a series of raids lawmen and vigilantes have killed Ol and John and captured George, who gets a short prison sentence. For the next few years you live a wondering assistance, moving around Missouri and other states to avoid detection. Finally, in the spring of 1871, you renew contract with Cole Younger and Frank and Jesse James and arrange a meeting at the home of your mutual friend Clell Miller. Despite the loss of three of your companions you are ready to resume your career in banditry.", "action_results": [null]}]}, {"action": "Stay with Ol at the Shepherd Farm", "result": "You stay with Ol hiding out at the Shepherd Ranch while the other two clear out and for three days all is peaceful. One morning you hear a knock on the front door and you hear Ol go and open it. \"Hello Ol,\" a voice says. \"I am Detective Bligh, this is Detective Gallagher and you are under arrest.\" There is a bang and a yell that sounds very much as though Ol has just hit someone with the door and then Ol bolts into the kitchen and races for the back door, pulling a pistol from his pocket as he goes.\n\n\nYou have two swift choices to make, you can either follow Ol out the back door or run through a door that leads to a bedroom. From the bedroom a second door opens into the hall and you might be able to slip back through the front door as the Detectives run through, though the plan is a risky one.", "action_results": [{"action": "Follow Ol out the back door", "result": "You follow Ol out the back door and spring across the yard outside towards the safety of some trees, pulling your pistol from your pocket as you run. The two Detectives follow you both outside and begin shooting, Ol goes down first with a bullet in his back. A second later you are hit in the back of your head and your world ends in an explosion of light followed by endless darkness. Both you and Ol are cut down and killed in a series of raids that also bring John and George's careers in banditry to an end.", "action_results": [null]}, {"action": "Run into the bedroom and try to circle round to slip out the front door", "result": "You dart through into the bedroom and moving as swiftly and silently as you can you circle round to the hall door. As you expected both Detectives run straight through the kitchen and out the back door where they begin shooting at the fleeing Ol. You take your chance, dart out the front door and immediately make a left to the safety of some nearby trees. Fleeing through the thickets on foot you make it to the farm of a friend several hours later.\n\n\nOver the next few days you learn what has happened: Ol was indeed shot dead while trying to run away while John was also killed and George arrested in a series of raids (George later receives a short jail sentence for armed robbery). Shaken by your narrow escape you spend the next three years moving around Missouri and generally lying low until you finally get back in touch with Frank and Jesse James and Cole Younger and arrange a meeting at the home of your mutual friend Clell Miller to return to your chosen profession of robbing banks.", "action_results": [null]}]}]}, {"action": "Go with Cole down to Texas", "result": "You travel south with Cole to Texas and join his brother John and John's employer Tom McDaniels at McDaniels's Ranch. You are in Texas when you learn that in a series of raids in Missouri your friends John Jarette and Ol Shepherd have been killed and George Shepherd has been arrested and imprisoned after they were identified as Russellville Bank Robbers. Fearing he'll be identified to Cole goes to California to join another brother Jim but you like Texas so you stay on with John and Tom for a few years.\n\n\nNearly three years after the Russellville robbery you, John and Tom go into the local town of Scyene to have a few drinks in a bar. John drinks more than you two and begins boasting he is an excellent shot and can hit any target. To demonstrate this he pulls out his pistol and shoots the smoking pipe out of the mouth of an old man who is sitting at a nearby table. The very frightened man leaves the bar and initially you think nothing of it.\n\n\nThe next morning after spending the night in town the three of you go down to the local stable to collect your horses and ride back to Tom's ranch. While you are in the stables two Deputy Sheriffs walk in and approach the three of you with pistols in their hands. \"John Younger?\" one of them asks. \"We have had a complaint of attempted murder lodged against you and we need to take you into custody. Please hand over your weapons.\" \"Certainly officers,\" John says pleasantly, drawing his pistol from his pocket. He is still smiling when he shoots the lawman in the chest.\n\n\nThere is a moment of stunned silence and then all five of you draw your weapons. The wounded officer fires back at John, his shot creasing his hip while the other officer aims at you.", "action_results": [{"action": "Fire at the man aiming at you", "result": "You fire at the lawman, by luck or skill you shoot him through the heart and without a sound he falls to the ground, his pistol discharging as it hits the ground though the bullet goes wide. John has shot the lawman who wounded him again and the man has sunk to his knees, though he is still trying to raise his gun arm from the ground to fire at John again. John's gun clicks on a faulty cartridge and there is a risk the badly-injured lawman might shoot him.", "action_results": [{"action": "Ride your horse up and shoot the wounded lawman in the head", "result": "Your shot hits the wounded lawman in the side of the head and he falls to the ground where he lies still. An ominous silence descends on the stables as the three of you stare down at the bodies of the two Deputy Sheriffs whom you have just murdered. Tom, who hasn't moved since he drew his pistol, is shaking. \"We need to get out of here,\" John mutters as blood drips from his hip and through his fingers and spurring your horses out of the stable you rapidly clear out of Scyene. You pause briefly to collect your things from the McDaniels Ranch before riding on while Tom clears out to other parts.\n\n\nIn Missouri you and John split up: John goes back to the Younger Ranch to see his brother Bob and recover from his injury. Meanwhile you get back in touch with Cole and Frank and Jesse James and arrange a meeting with them at the home of your mutual friend Clell Miller. Your role in the murder of the two lawmen in Texas has put your name firmly back on Missouri's list of wanted men so you figure it's time for you to get back to robbing banks and making some money!", "action_results": [null]}, {"action": "Let John deal with the mess he has made", "result": "John raises his pistol, shoots the wounded lawman in the side of the head and he topples to the ground where he lies still. An ominous silence descends on the stables as the three of you stare down at the bodies of the two Deputy Sheriffs whom you have just murdered. Tom, who hasn't moved since he drew his pistol, is shaking. \"We need to get out of here,\" John mutters as blood drips from his hip and through his fingers and spurring your horses out of the stable you rapidly clear out of Scyene. You pause briefly to collect your things from the McDaniels Ranch before riding on while Tom clears out to other parts.\n\n\nIn Missouri you and John split up: John goes back to the Younger Ranch to see his brother Bob and recover from his injury. Meanwhile you get back in touch with Cole and Frank and Jesse James and arrange a meeting with them at the home of your mutual friend Clell Miller. Your role in the murder of the two lawmen in Texas has put your name firmly back on Missouri's list of wanted men so you figure it's time for you to get back to robbing banks and making some money!", "action_results": [null]}]}, {"action": "Raise your hands to show him you mean no harm", "result": "You raise your hands but to your amazement and fury the lawman points his pistol at you and fires, hitting you in the left side. As pain shoots through your chest you cry out in anger and lower your pistol but seeing what is happening John has already turned and shot the lawman who wounded you in the side of the head. As the lawman falls dead to the ground John turns back to the lawman who shot him and squeezes the trigger again, hitting him in the chest. As the lawman sinks to his knees on the ground he tries to raise his gun arm but when John tries to shoot him a third time he revolver clicks on a faulty cartridge.", "action_results": [null, null]}]}]}, null]}, null]}]}]}, null, null]}, null]}]}