{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=60128", "context": "", "first_story_block": " \n\n \n\nPaper-Mache\n\n\nBy Jster02", "action_results": [{"action": "Start", "result": "The pain is the first thing you notice.  It feels as though someone's poured an entire vat of hot coffee over your entire body.  Somehow, you get the sense that you've been asleep a lot longer than normal. You open your eyes to find yourself laying in a patch of grass, staring up at a clear, starry sky, interrupted by the branches of nearby trees.  You don't move for a moment. How did you get outside? You don't remember going to sleep out here... as a matter of fact, you don't remember going to sleep at all. Or anything else, as a matter of fact.\n\n\nThe pain is fading fast, so you sit up and take a look around, pulse racing. The shadowy forms of trees surround you, the sounds of the night bombarding your senses.  It occurs to you that you're hyperventilating. Is this what it feels like to have a heart attack? No this is a panic attack of some kind. Instinctively, you find yourself focusing on a single blade of grass in the field.  With shaking hands, you pluck it from the dirt and study it, taking note of its shape, the feel of it in your hand, the nearly indistinguishable pattern of little veins running through it. Mindfulness. That's supposed to help with Panic attacks.  Somehow, you remember that. But you can't remember where you learned it.  \n\n\nSlowly but surely, your breathing normalizes.  You wipe the snot from your nose and the tears from your eyes as your body stops convulsing.  For the first time since you woke up, you notice the cool night breeze. You're going to be fine.  If you just keep your wits, you'll find a way out of this eventually. You take a quick inventory of everything you can remember.  Random bits of knowledge surface in your head, facts about whales, mathematical formulas, the steps to changing a tire. But no memories of the people, or events, or books that taught you those things.\n\n\nAs you contemplate these things, you notice a few items laying in the grass around you.  Namely, a small backpack and an odd metal disk, with a glowing screen on one side. You pick up the disk first and examine it.  \"Insufficient power,\" flashes across its face over and over in red.  Something about it tugs at something in your memory, but you can't quite put your finger on what.  Confused, you slip it into your pocket and turn to the bag. You unzip it to find a lighter, a knife, a sleeping bag, a pillow, and... a whole mountain of Cheez-Its and Mountain Dew?  Just what kind of person are you? Still, it's better than nothing, so you slip it over your shoulders.\n\n\nAs you try (and fail), to take your bearings from the waning crescent moon, (not that it really matters, it's not like you know where you came from), you become aware of a strange noise in the distance.  You stop and listen. Is that yelling? Wait, yelling is a human noise, right? So, where there's yelling, there's humans. Before you can even finish processing that thought, your feet are carrying you towards the source of the noise.  You didn't know you could run this fast on pavement, much less over the uneven turf of the forest, but then, maybe you're a famous football player or something and just don't remember it.  \n\n\nThe yelling grows louder as you draw nearer.  A dim light shines in the distance, growing brighter.  You slow down a little, these shouts don't sound like happy ones.\n\n\n\"Stop struggling or it'll only hurt more!\" a gravelly voice says.\n\n\n\"Help! Stop! Let me go!\"  An extremely high pitched voice this time.\n\n\nYou've slowed to a tip-toe now.  Whatever this is, you're not sure you want to be a part of it.  Still you creep closer until you can just make out the figures involved between the trees.  They look small from here, no bigger than children, but then, it's a little hard to tell from this distance.  It looks like they might be wearing some kind of cloaks, green ones, if your eyes don't deceive you.  \n\n\n\"Gag her before she draws someone to us!\"  Says the gravel tongued shadow to two others holding down a third, \"Get her in the bag and tie it tight.  The last thing we need is another escape.\"\n\n\nYour palms are soaked with sweat.  You should do something, anything, to help, but whoever these people are, they certainly don't sound like the kind of folks you'd like to mess with...", "action_results": [{"action": "Creep closer and attack", "result": "You drop into a crouch and creep closer, stopping behind trees whenever you can.   Now that you're closer, you can make out more details, and boy are these people weird.  They're even shorter up close, they'd probably only come up to your waist.  But that's the least strange thing about them.  They're skin resembles Paper-Mache, all folded over itself.  And then there's the ears, so long and pointy.  Almost as big as they are, and yet still they point straight up.  Forget whatever you thought about only humans yelling.  You must've forgotten that too, because these things are no humans.\n\n\nThe two biggest creatures hold down a smaller one, (perhaps that one is only a child), while the one that appears to be the leader stands and watches.  Like you thought, all but the one on the ground are clad in green cloaks, reaching nearly to their feet, with a strange symbol of something like a broken goblet embroidered on their backs in brown.  \n\n\nThey've nearly got the child into a big sack now, but she (he? It?) still hasn't given up.  \n\n\n\"Please!\"  She cries, \"I just wanna go home!  Let me go home!\"\n\n\n\"We're giving you a new home.\"  Says the leader, \"A better home!  Don't you want to help make your old home better?\"\n\n\n\"No!  I want my papa!\"\n\n\nJust watching this makes you nauseous.  This has got to be stopped, there's no way you can sit by and let it happen.  Before you've even so much as thought of a plan, you're on your feet, charging the creatures with...", "action_results": [{"action": "the knife!", "result": "You flick your knife open and tense for battle.  It feels so small in your hand, so weak.  If only you had a gun, or a hatchet at least.  Still, it's better than using your fists. \n\n\nBefore you have the chance lose your nerve, you charge one of the creatures holding down the... other creature.  (You're really not sure what to call any of these things, you've never seen anything quite like them before).  You slam into it, knocking it to the ground before it has a chance to react.  It's eyes go wide as you plunge the knife into it's stomach, (or what appears to be it's stomach).  It penetrates easier than you expected, the knife.  Feels a little too easy.\n\n\nBut before you have time to fully contemplate the moral ambiguity of your actions, you see, out of the corner of your eye, the other creature charging you with some kind of sharpened stick.  You act faster than you ever thought you could, rolling to the side, just as it brings it's stick down in a stabbing motion.  The stick buries itself into the chest of the first creature, (the one with the knife still stuck in it's chest).  If it wasn't dead before, it certainly is now.\n\n\nThe creature with the stick stares at it's fallen friend, stunned.  You should strike now, while it's distracted, but all you can do is stare at the dead creature.  You did that.  Even though it's not exactly a human, something about the whole thing just feels wrong.  Slowly, the surviving creature turns towards you.\n\n\n\"Why would you do that?\"  He asks,  \"That was my friend!\"\n\n\n\"You were attacking that... other creature!\"  You say.  Even as you say it, the words feel hollow.  \"He... had it coming!\"\n\n\n\"You have no idea what you've gotten yourself involved in!\"  He says, \"You're messing with things you shouldn't you crazy monster!\"  With that, the creature charges you once more, wrenching it's weapon from the chest of its dead friend.  Perhaps you should let him strike you down.  Maybe you're the monster here.  But then, what about that other creature?  The one he was tormenting?  What does that make him?  No, you were just acting as any good person should when they see someone in danger. Just as the creature reaches you, instinct takes over and you slam your fist into it's head.  \n\n\nThese creatures don't just look like Paper-Mache, they tear like it too.  As soon as your hand makes contact, his face crumples inward and he staggers back, falling to the ground, dead.  You stare at your hand, stunned.  Either you've got some sort of hidden superpowers, or these creatures are weaker than most.  That doesn't seem normal.  Even with your broken memory, you can be pretty sure of that.\n\n\nAs the adrenaline wears off, you remember that there were three creatures involved.  Two doing the heavy lifting and one giving orders.  You take a quick look around you, but see nothing.  It must've run off somewhere; the only other living thing left in the area is the creature you came to save in the first place.  ", "action_results": [{"action": "Check on the fallen creature", "result": "The creature lays in the dirt, staring at you.  It trembles as you approach, inching away on its back.\n\n\n\"Who are you?\"  It asks with trembling voice, \"What do you want?  I want my papa!\"\n\n\n\"I'm not going to hurt you,\"  You say, trying to sound as soothing as you can,  \"I'm here to help.\"  \n\n\n\"You're... not gonna hurt me like those other guys?\"\n\n\n\"No, I was saving you.  That's why I hurt them.\"\n\n\n\"Oh... Okay...\"\n\n\nYou stare at each other wordlessly for a few moments, unsure of what to say.  Finally, you extend your hand to help the creature up.  It stares for a second at your arm, and asks,\n\n\n\"What are you doing?\"\n\n\n\"I'm helping you up.\"\n\n\n\"How does holding your hand out help me up?\"\n\n\n\"You grab it and... oh, never mind.  Do you know how to get home?\"  (Does this thing even have a home)?\n\n\n\"I think so...\"\n\n\n\"Alright, can you walk?\"\n\n\nThe creature struggles to its feet.  \"Yes.\"\n\n\nAnother moment of silence.\n\n\n\"I'm Pila,\"  the creature says, \"...thanks.\"\n\n\n\"You're welcome.  Come on, let me walk you home.\"\n\n\n\"Okay.\"\n\n\nYou set off down the path, Pila leading the way.  For a few minutes you travel in silence.  The hooting of owls and the howl of the wind are your only company as you trudge through the trees.  Finally, you can't help but break the silence. \n\n\n\"What are you exactly?\"\n\n\nPila looks at you, her ears twitch slightly.  \"I already told you, I'm Pila.\"\n\n\n\"No, I mean, what are you.  As in, what species are you?\"\n\n\n\"What's a species?\"\n\n\nYou struggle to come up with an explanation.  \"It means, what kind of creature are you?  I don't know how else to explain it.\"\n\n\n\"I'm confused.\"\n\n\n\"Well... I'm a human.\"  You point to yourself, then look around for something else to name.  You spot an owl sitting on a branch, \"And that's an owl,\"  You point at the creature, \"But what are you?  I've never seen anything like you before.\"\n\n\n\"I still don't understand... human?  Is that what you said your name was?\"  \n\n\nIt's no use trying to get anything out of her.  You sigh, and say,  \"Never mind, it's not important.\"  \n\n\n\"Okay!\" She says\n\n\nAs you're talking, you come to the side of a hill, with little stairs carved into the side for you to climb down.  Lights twinkle a little ways below; must be some kind of village.  \n\n\nPila points at the lights.  \"That's where I live. It's also where my mama and my papa live.  And all of my friends.  Let's go!\"\n\n\nWith that, she dashes down the stairs.  They're the perfect size for her little feet, (if a little big).  As for you though, you may as well be going downhill on gravel.  You nearly slip at least three times as you descend, but in the end you make it to the bottom unscathed.  \n\n\n\"We're almost there now,\"  Pila says, running up the path.\n\n\nYou follow as quick as you can, it wouldn't do to lose her again.  If that happened you might as well have never saved her at all.  As you jog along the path, you pass a strange plant, just taller than you are.  It grows on a thin, blue stalk, straight up, until it droops over at the top, opening into a strange, orange bulb.  The bulb glows in the dawn, lighting the whole path beneath your feet.  Just a few moments later, you pass by another on the opposite side of the path.  The entire trail leading up to the village is lined with these plants, lighting the way like streetlights on an old city road.  ", "action_results": [{"action": "Pila's house", "result": "It soon becomes apparent that you are closer to the village than you thought.  Is it just you, or are those buildings smaller than they seemed from afar?  You come to the edge of the village to find that the smallest of the houses are about your height.  Everything is half the size it should be, from the road through town to the stones that pave it.  Stranger still, it all has the same Paper-Mache quality as Pila's skin.  \n\n\nYou follow the little creature through a twisting maze of streets, just a tad bit too small for you.  You begin to see other creatures like Pila milling about.  Most stare at you, terrified, a few even run the other way, screaming.  But every time that happens, Pila shouts after them,\n\n\n\"It's okay, he's nice!  He saved me from bad people!\"\n\n\nAfter about five minutes of walking, a high pitched whistle cuts through the air.  You try to ignore it, but it persists.\n\n\n\"What is that?\"  You ask.\n\n\n\"Oh that?\"  Pila stops and turns,  \"That's the alarm.  People sound it whenever there's an emergency.  Then the watchmen come and help whoever sounded it.  My papa is the leader of all of the watchmen.\"  She beams with pride. \n\n\n\"Shouldn't we be worried.\"\n\n\n\"No, this happens a few times every day.  My papa will take care of it, whatever it is.\"\n\n\n\"Well, alright.\"\n\n\nYou walk for a few minutes more, then the alarm stops, leaving you in complete silence.  \n\n\n\"See?\"  Pila says, \"Everything's going to be-\"\n\n\nA voice from behind interrupts her, \"What in the name of the water-pit are you?\"\n\n\nYou and Pila turn in unison to see a whole squadron of creatures, all pointing little wooden spears your way.  But before you can do or say anything, Pila runs straight up to them.\n\n\n\"Papa!\"  She cries, flinging her little arms around the one who appears to be their leader.\n\n\n\"Pila?\"  He says,  \"What are you doing with this... thing?  Did it hurt you?\"  He turns his gaze on you.  \"What were you doing with my Daughter, you monster?\"\n\n\n\"No, Papa!  You don't understand!  This is human, he saved me from a bunch of really mean people.  They tried to put me in a big bag, but then he came out of the forest and beat them up!\"\n\n\nPila's father is quiet for a minute.  Then, he turns to the creatures behind him and says, \"You can relax.  Looks like we won't be needing spears.\"  He turns back to you, and takes a few steps in your direction.  \"I apologize... human, is it?  It's just that no one's ever seen anything like you before.  So it was only natural the alarm was sounded.  They all thought you were some kind of monster!\"\n\n\n\"I thought the same when I first saw creatures like you.\"  You say,  \"If you don't mind me asking, what exactly are you?  I've never seen anything quite like you either.  At least, I don't think I have.\"\n\n\n\"You stand in a village full of Oalkwardners.\"  The Creature says,  \"I am Merk, head of the Watchmen of Arrorn.  I help to protect this place from any sort of outside invaders or natural disasters.  That's why I came when I heard you had arrived.  By the way, thank you so much for rescuing my daughter.  If you ever need anything at all, just come find me and I'll do my best to make it happen.\"   He stops and thinks for a moment.  \"Are you planning on staying here a while?\"\n\n\n\"Actually,\"  You say, \"I have no idea how I got here in the first place.  So, I guess I'm kinda stuck till I figure out how to get back home.\"\n\n\n\"That's strange indeed,\"  Merk says,  \"Come with me, if you need, you may stay with me and my family while you're here. You did save Pila, after all.  It's the least we can do.\"\n\n\n\"I guess I have nowhere else to go,\"  You say.\n\n\n\"Yay!\"  Pila says,  \"It'll be like when we have all the family over for a feast!\"\n\n\nAnd once again, you set off through the streets.  As you walk, you explain to Merk how you woke up in the forest with no memory and found Pila in trouble.  \n\n\n\"What were you doing out there, Pila?\"  Merk asks, \"Why on earth did your mother let you go out so late?  And why on earth did you take this long to come back?  From what Human said, it doesn't sound like you were too far from town.\"  Merk frowns, \"In fact, you'd better come up with a pretty good explanation as to why you were out so late, or else you're in hot water!\"\n\n\n\"It's not my fault!\"  Pila says, \"I went out to play hide-and-seek in the woods with my friends.  The sun was going down, but we knew it would still be light outside for a little bit, so we thought it would be okay.  But I really wanted to win.  I never win at hide-and-seek, so I needed a plan to make sure they'd never find me.  So I went really far away on the road.  But then it started to get dark, and I got scared.  And then, the ground started shaking, and I got really scared.  So I ran away into the trees.  But then I got lost, so I was really really scared.  It took me a long time to find my way back to the road, and then when I was walking back, the mean guys came and tried to put me in a bag!\"\n\n\n\"You said the ground started shaking?\"  Merk asks, \"But I didn't feel anything here.  I was on the night-watch, so I know.\"\n\n\n\"But it's true, Papa!\"  Pila says, \"There was a really bright light in the sky too!  It was like lightning, but it stayed there for a looooooong time.\"\n\n\n\"Don't make up stories, Pila.\"  Merk sounds a little irritated now, \"When we get home, you're going to have to do some chores.\"\n\n\n\"But Papa-\"\n\n\n\"Let's not do this in front of our guest, alright?\"\n\n\nPila sighs,  \"Yes Papa...\"\n\n\n\"Good girl.  Oh look, we're here.\"\n\n\nThe streets are a bit wider here, and the houses a bit bigger.  They're all spaced apart, each one with a good five-or-so acres of space.  You've stopped in front of a beautiful yellow one, that looks like it might be two stories high, (though it's hard to tell what with the strange sizes of everything).  \n\n\n\"We have the best house in the village!\"  Pila beams, \"That's because Papa has the best job.  I wanna do it when I grow up too, so I can have this same house.\"\n\n\nMerk laughs.  \"I'm glad you think this house is the best.  You've never told me that before.  Come on, lets go inside.\"\n\n\nYou follow Merk to the front door, where it becomes apparent that you might have a problem.  \n\n\n\"I'm... not sure I can fit,\"  you say, staring at the door.  It comes up only to your chest and looks just a little too narrow for you to fit through.  \"I don't want to mess up your house.\"\n\n\nMerk thinks for a moment, wringing his hands.  \"That really is a shame.  We might have to figure out somewhere else for you to stay, I'm sorry.\"\n\n\nIt's then that you remember, you've got camping supplies in your backpack\n\n\n\"I can just sleep outside,\"  You say,  \"I've got a sleeping bag and a pillow, I'll just lay it out in your yard somewhere, if that's alright.\n\n\nPila's face brightens,  \"Papa, can we eat outside with Human too?\"\n\n\n\"I guess we may as well, so long as it stays nice outside,\"  Merk says,  \"Now you'd better go get some sleep.  I'm not sure how you can be this chipper after staying up all night like that.  Besides, you'll need your rest if you ever want to get done with the massive list of chores you're gonna get once I figure out just how much trouble you're in.\"\n\n\nPila sighs, and starts towards the door.  \"Yes papa...\"\n\n\nYou spend the rest of the day on Merk's property, not daring to re-enter the village for fear that someone might see you and sound the alarm.  (\"Just until we get the word around that you're not a threat,\" Merk says). For a while you talk with Merk, trying to figure out where exactly you are.  Eventually, Merk pulls out a map of the area, and you find that you don't recognize any of the landscape.  (Though, you can't quite remember any other landscapes either).  You just can't make heads or tails of the situation.  \n\n\nOnce evening rolls around, Merk's wife, (who you quickly learn is named Fila), brings you dinner in a bowl, much too small for you to properly hold.  It's filled with some kind of goop that smells like burning rubber, and doesn't taste much better.  But you don't say anything, and just choke it down best you can.  You know you can eat some of the Cheez-Its from your bag after everyone else goes to bed.\n\n\nAfter an hour-or-so more of small talk, everyone decides to hit the sack.  As the Oalkwardners head inside, you spread out your sleeping bag and lay down, staring up at the stars.  The moment your head touches the pillow, all the energy you spent today hits you at once.  You're asleep within minutes...", "action_results": [{"action": "A living nightmare", "result": "Your dreams are a confused mass of pictures and images.  Lots of formulas and numbers, the strange disk you found in the woods, a violet light engulfing you...\n\n\nA whisper in your ear breaks you from your slumber.\n\n\n\"Wake up, strange beast.  I need to talk to you.\"\n\n\nYou open your eyes so find that it's still dark.  The face of an Oalkwardner stares down at you, blocking out the moonlight.  It startles you so much, you sit straight up; if it wasn't for the creature's swift reflexes, your head would've smashed right into it.  That's when you get a good look at it in the light of the moon.\n\n\n\"What the heck do you think you're doing here?\"  You ask, \"You were the guy that ran away after I saved Pila!\"\n\n\n\"Not so loud,\" He hisses, \"Do you want to give me away?\"\n\n\n\"Yeah, actually.  I should call Merk right now, or better yet, do you in myself!\"  You take a deep breath to let out a shout.\n\n\n\"Don't!\"  \n\n\nSomething about the creature's tone stops you, if only for a moment, from alerting the Oalkwardners in the house.  What would drive any intelligent creature to walk into the lion's den like this in the first place? It just doesn't add up.\n\n\n\"At least hear me out.\"  Pleads the creature, \"I need your help.\"\n\n\n\"What makes you think I would help a kidnapper?  Seriously, are you crazy?\"\n\n\n\"It's not just me you'd be helping, but them too!\"  he gestures towards the house, \"In fact, you'd be helping every Oalkwardner in this village.\"\n\n\n\"Is that a threat?\"  You ask, \"Are you going to kill them or something if I don't cooperate?\"\n\n\n\"My word, you must really think I'm some kind of monster, monster.  No, I'm not here to hurt anyone. Like I said, I'm here to help.\"\n\n\n\"How does kidnapping children help anyone?\"\n\n\n\"I was getting to that.  This village, Arrorn, I believe it's called, is not as peaceful as it seems.  It is under the rule of King Faerdalm, a cruel, ruthless tyrant.\"\n\n\n\"Sound like something a teenager would come up with for a writing contest,\"  You say, rolling your eyes.\n\n\n\"Will you let me finish?\"  The creature glares at you, \"He takes their food, says they owe it to him for getting to live in such a 'great and powerful country.'  It's all a load of bull, of course. He takes so much that a good many of the villagers die every year from starvation. I'm part of a resistance group trying to stop it.  We've been working on a way to get rid of Faerdalm once and for all, so everyone can be free, just like in the good old days. That's why we've needed to take children, to run tests on them.  We're developing a way to make ourselves stronger, so we can finally stand up to him. But we're still a ways out from perfecting it. It's going to take a lot more people, a lot more deaths, to finally perfect it.  To be quite frank, I'm getting quite sick of it.\"\n\n\n\"So, where do I come in?\"  You ask.\n\n\"Never in my life, have I ever seen a creature as powerful as you.\" He says, \"If you were to join us, we would be able to achive our goal much quicker. And the quicker we achive it, the less needless deaths must occuer.\" He extends his hand, as if to shake yours, \"So, are you in?\"", "action_results": [{"action": "Shake his hand", "result": "The Oalkwardner smiles as you shake his hand.  \n\n\n\"Very well then,\"  he says, \"We must go at once, there are many preparations to be made.\"  he stops for a moment and looks at you,  \"You may call me Bolard, by the way.\" \n\n\nWith that, he makes a single clicking noise with his mouth, and a whole hoard of Oalkwardners dressed in the same cloaks as Bolard step out from the shadows, surrounding the two of you.\n\n\n\"We're heading back to base,\"  Bolard says,  \"Better get moving if you wanna get any sleep tonight!\"\n\n\n\"Hold on a second!\"  you say, \"Were you planning on ambushing me if I said no?\"\n\n\n\"Of course not!\"  Bolard says,  \"They were just here in case you were... unreasonable, and decided to attack me.\"\n\n\nSomething about his tone puts you on edge, but you can't exactly do anything about it with all these guards around.  You follow the pack into the forest...\n\n\n \n\nBolard leads the group back up the path you came from, past the place where you witnessed the attempted kidnapping.  You walk for hours, never stopping for even so much as a five minute break.  As the sun's rays begin to peak over the horizon, the leaders of the pack turn off the trail abruptly and lead you into more densely wooded area.  \n\n\nAs the sun grows higher in the sky, you notice that there is still a sort of trail here, just fainter and harder to see than the one you left.  It seems this way has been traveled a few times before, the vegetation trampled underneath it.  After a few more hours of walking, the group stops abruptly, and you nearly trip over the Oalkwardner in front of you.  \n\n\nYou sigh with relief.  This must be some kind of break.  Thank goodness, your feet feel like they're about to fall off.  But instead of dispersing and finding spots to sit down and talk, the Oalkwardners stay where they are.  There's motion at the front of the pack, someone's doing... something, you're not sure what.  Then, a great wooden hatch opens up from the ground, revealing a spiral staircase descending down into the earth.  You didn't see it because it was camouflaged by dirt and leaves, somehow stuck on top of it. \n\n\nThe assembly moves forward, down the stairs, and you follow at the middle of the pack.  You reach the bottom and find yourself in a hard packed dirt tunnel, with a few paths branching off from it.\n\n\n\"To your barracks, everyone!\"  Bolard says, \"I must speak with the monster for a moment.\"\n\n\nThe crowd disperses, heading down various tunnels, chattering amongst themselves.  Bolard turns to you.\n\n\n\"I'm not going to have you stay in the barracks with the others,\"  He says, \"You're a might too big for the beds there, and I don't want you rolling over and crushing someone or something.  Instead, I think you ought to take one of the private suites, which are usually reserved for our highest ranking officials.  Thankfully enough, we've got a few to spare.  Come, I'll take you there now.  I'm headed that direction anyway.\"\n\n\nYou follow Bolard through the tunnels, trying your best to remember how to get back to the hatch.  Thankfully, it isn't too far.  After a few minutes, the dirt walls become wooden, which feels a little nicer.  It's like being in a regular hallway, (if a bit cramped, due to your size).\n\n\n\"This is your room,\"  Bolard says, opening the door at the very end of the hallway, \"Take some time to get acquainted with your new surroundings.  I will return shortly,  there are a few matters of grave importance which I must discuss with you.\"\n\n\nHe shuts the door, leaving you to explore your new accommodations.  Not to say there's all that much to explore, the room is quite barren.  The only furniture is a sleeping pad that looks like it's woven from grass and a little table on the far side of the room.  It's all too small for you, but you'll just have to make do. You take off your backpack and sit on the mat. It feels so nice to take a rest after all that walking. \n\n\nWhile you sit, you begin sifting through the contents of your bag, laying them out on the floor in front of you.  You stop when your hand touches the strange metal disk you found in the forest when you woke up. The screen still flashes, \"insufficient power,\" over and over again.  Maybe if you can get it charged up again, you might be able to uncover some clue about your past.  You flip it over and look at the back. There's a little tank strapped to this side, with a tiny bit of green fluid inside.  Is this the stuff that powers it? If you fill it up, will the disk work again?\n\n\nAs you ponder all these things, the door opens and Bolard walks in.\n\n\n\"Come, monster,\"  he says,  \"I need to relay the plan to you, so that we're ready.\"", "action_results": [{"action": "The plan", "result": "Bolard leads you back out into the hallway and through another nearby door.  This room is less barren than the one you sleep in, and it's set up more like an office.  \n\n\n\"Sit,\"  Bolard gestures towards a stool, too small for you, in front of a desk in the middle of the room.  You obey, sitting uncomfortably low, as Bolard walks around the desk and sits on a stool of his own on the other side.\n\n\n\"Monster,\" Bolard says,  \"You have displayed great strength.  Strength enough, perhaps, to take out an entire army single handedly.\"\n\n\n\"What do you mean?\"  you ask, \"I've never fought anyone in my life since yesterday.  At least, I don't think I have.\"\n\n\n\"Training will be provided of course,\"  Bolard says, \"With your great strength, and the proper training, you may lead us to victory.\"\n\n\n\"You're crazy!  What kind of insane thing do you want me to do anyway?\"\n\n\n\"I want you to storm the king's palace.  In two weeks time, there'll be a banquet, and all his advisors and officials will be there.  If you attack then, you'll be able to cripple his regime, creating a power vacuum with no one to fill it.  That's when we'll step in and take over, creating a new era of peace and prosperity.\"\n\n\n\"But why just me?  Why should I do this alone?\"  \n\n\n\"Because if you don't, more innocent Oalkwardners will die!  They'll keep doing experiments, stealing more children to use as lab rats!  We've got someone inside the palace who can get you inside.  There's no turning back, you agreed to this when you shook my hand.\"\n\n\nYou open your mouth to argue, but then close it.  It's useless to argue.  If you refuse to do as he says, he'll probably have you killed or something.  \n\n\n\"Any questions?\" Bolard asks.\n\n\nYou don't say anything.\n\n\n\"Good.  You may spend the rest of the day as you wish.  Go explore the facility, if you want.  Get to know your way around so you feel more comfortable here.\"\n\n\nYou turn and walk out the door, back to your room.  There's nothing else to say.", "action_results": [{"action": "The note", "result": "You return to your room to find a note, laying on your pillow.  \n\n\n\"Come to the mess hall at midnight.  There's something we must discuss.\"\n\n\nConfused, you turn it over to see if there's anything on the back, but there's not.  For a moment, you stand there, staring at the piece of paper in your hands.  What's going on?  You've hardly met anyone yet, and already someone wants to talk with you privately?  Is it some kind of trap?  But what if it's important?\n\n\nCuriosity burns within you.  You have to find out what this is all about.  If things go wrong, you'll just have to find a way out of it.  \n\n\n \n\nThat night, you creep out of your room and head to the mess hall at what you think is about 11:30.  (It's hard to tell, the Oalkwardners use a complex system of hourglasses to tell time. It's nothing like what you're used to).  Luckily, you explored most of the tunnels beforehand, so you find your way easily enough, with ten minutes to spare.  \n\n\nYou enter the mess hall to find... nothing out of place.  There's not another person in sight. You're not surprised, you are early after all.\n\n\nSomething touches your shoulder.  You whirl around to see a cloaked Oalkwardner with a wooden mask over their face, standing behind you.  \n\n\n\"What-\"  you start to say, but the Oalkwardner puts a finger to its lips.  It beckons for you to follow, and scurries down a tunnel at the far side of the room, one of the few you have yet to explore.  You follow behind as best you can, trying your best not to lose them in the twists and turns of the passage. Soon, you reach a staircase, leading up to a hatch.\n\n\nThe Oalkwardner leads you through the hatch and into the cool night air.  You hadn't realized how much you missed the surface until now, and you cherish each breath of fresh air.  They lead you a little ways into the forest, then stop.\n\n\n\"So,\"  the Oalkwardner says,  \"You're the one Bolard was talking about.  The one that's gonna save the entire rebellion.\"\n\n\n\"I... guess.\"  you say, confused.  \"What did you want to talk about, exactly?\"\n\n\n\"Do you want to know how Bolard sees you?\"  The Oalkwardner asks. \n\n\n\"What?\"\n\n\n\"When he looks at you, he sees only a pawn.  A monster which he can bend to his will and use for his own gain.\"  The Oalkwardner turns to face you. \"But you are not the only one. He treats everyone that way.  All of the high ranking Oalkwardners do, at least in this rebellion.\"\n\n\n\"What does this have to do with me?\"\n\n\n\"If their plan succeeds, and they manage to take power, I fear they will estate an even worse government than there already is.  You are the key piece in their plan. But if that key piece were to fail...\"\n\n\n\"What, you want me to die on purpose?\"  \n\n\n\"No, of course not!  But I want you to fake your own death.  Me and some others are ready to desert this crazy rebellion and take whatever the king has to throw at us.  It can't be worse than what they've got planned. Not only that, but we want you to tip the king off about their plans while your at it.  We'll write a note, and we want you to leave it somewhere they'll find it once you're inside the fortress.\"\n\n\n\"Wait, so am I going into the fortress or am I faking my death?\"\n\n\n\"You're faking your death at the fortress.  They'll just think you failed your mission, but you'll actually have run away, with me and the others.\"\n\n\n\"I hardly know you!  Why should I trust you?\"\n\n\n\"I'll give you until the day of the attack to think it over, alright?\"  The Oalkwardner says, \"I get that this can be hard, but I'm begging you, please don't fail us.\"\n\n\nYou sigh.  \"I'll think about it.\"\n\n\n\"Good.  Now, go get some rest.  You've got a long couple of weeks ahead of you.\"", "action_results": [{"action": "The choice...", "result": "The next two weeks are a blur.  You train for six hours a day, preparing for the big day.  Before you know it, it's nearly arrived.  The night before, you find another note on your pillow, this one a little longer than the last.\n\n\n\"Enclosed is the note you must plant in the fortress,\" It reads, \"I hope you've decided to help us, as we desperately need it.  Meet us in the woods behind the fortress once you've done the job, and we can escape.\"\n\n\nThere's another piece of paper, this one explaining everything about the rebellion, where to find their headquarters, and how best to stop them.  You skim it, then shove it in your pocket.  You're still not sure whether to go along with the rebellions plan, or join the defectors.  Whatever you do, you'll have to decide now...", "action_results": [{"action": "Tell Bolard about the defectors and end this right here and now", "result": "There's no point risking complications during the mission. You'd better tell Bolard about this right now.  You stand and head to his office.  He's still in there, organizing some of the books on his shelves, as you enter.\n\n\n\"Hello, monster.\"  He says, nodding to you.  \"What can I do for you?\"\n\n\n\"Defectors,\"  you say,  \"They've been trying to get me to help them, I've got proof!\"  \n\n\nYou show him the note.  He reads it, his eyebrows rising higher and higher with every sentence.\n\n\n\"My word!\"  he cries,  \"We must do something about it before it's too late!  I'll initiate a surprise inspection, we'll catch those filthy traitors yet!\"\n\n\nHe rushes out of the office.  You head back to your room and sit on your bed.  Did you do the right thing?  There's no stopping it now, so you'd best try and get some sleep.  It doesn't come easy though.  There's a lot of yelling and screaming from the other tunnels, probably the defectors.  You try your best to ignore the conflicting feelings in your stomach as you drift into an uneasy sleep...", "action_results": [{"action": "The attack", "result": "The next day, you begin the journey to the fortress, escorted by a few rebels, and Bolard himself.  It takes several days to get there, and you get to pass by Arrorn on the way, so that's fun.  (Though, you don't get to actually enter the village.  Too much risk of being recognized or something).  \n\n\nFinally, you spot it, sitting on a hilltop just on the horizon.\n\n\n\"Alright,\" Bolard says, \"There's a little side door you're going to be let in through.  It leads straight to the great hall.  Once you get inside, kill as many people as you can, alright?  Especially the ones that look super regal, because those are probably royalty.\"\n\n\n\"Anything else?\"  you ask, dryly.  \n\n\n\"Actually, yes.  The king wears this magic armor all the time.  He doesn't get hurt by physical attacks.\"\n\n\n\"Why didn't you tell me this sooner?\"  you protest,  \"What do you want me to do about him if I can't hurt him?\"\n\n\n\"I'm getting to that!\"  Bolard sounds annoyed,  \"I do have something that'll kill him.\"\n\n\nHe reaches into his bag and pulls out a glass bottle full of... water.\n\n\n\"What's this for?\"  You ask.\n\n\n\"What do you think?  It'll get through the cracks in his armor, and kill him!\"\n\n\n\"It's water.\"\n\n\n\"Exactly!  Water kills people!\"\n\n\n\"I don't follow.\"\n\n\n\"Didn't anyone ever tell you that water disintegrates people?  The skin soaks up too much and it just falls apart.\"\n\n\n\"That's not how it works for Humans,\" you say,  \"We can touch water, no problem.\"\n\n\n\"Really?  Well, that sure makes things easier.  This way you can cross the moat, no problem!  I was wondering how we'd do that.\"\n\n\n\"Yeah... Okay.\"  You roll your eyes.  \"Just give me the bottle.  I'll smash it over his head or something.\"\n\n\nAs you get closer to the fortress, you start to make out more detail.  It looks like it mainly consists of a bunch of towers, surrounded by a wooden wall.  By the time the sun sets, you're within a hundred yards of the walls. \n\n\n\"Perfect!\"  Bolard says,  \"Look, all the nobles are already inside.\"  He points to the closed drawbridge, as if to prove it.  \"The doorway is just around the back of the fortress.  Good luck, monster.\"\n\n\n\"Thanks,\" you say, rolling your eyes.  You grab your knife and hop into the moat, making it across in less than a minute. You rush around the side of the wall and find a door, carved into the side.  Just as you reach it, it flies open, and a female Oalkwardner beckons you inside.  \n\n\nAs soon as you enter the fortress, the nauseating smell of Oalkwardner food hits your nose.  You ignore it best you can and take a look around.  You're in an alcove at the edge of the great hall, which consists mainly of a bunch of wooden tables lined up together.  Over fifty Oalkwardners sit around it, laughing, eating, getting drunk...\n\n\nThis is perfect!  If they're tipsy, you can strike much more easily.  Quickly, you locate the king, (his armor sets him apart from the rest quite nicely), and sneak up behind him.  Then, in one quick motion, you bash the bottle over his head, shattering it into a million pieces.  The water splashes everywhere, (it definitely wasn't a small bottle), and the entire room goes silent.  Then, the king begins to scream, and the room erupts into chaos.  \n\n\nQuick as you can, you start punching, kicking, stabbing right and left.  Oalkwardners go flying everywhere, most dying the instant you touch them.  You manage to take out about half of the nobles before they get wise and start running for the door.  At the same time, some of the guards seem to be getting ready for a counter attack.  You'd better figure out what to do next, and fast...", "action_results": [{"action": "Get out now, while you still can. (You've already killed the king, and that's all that really matters).", "result": "You dash out the door before the guards can strike back.  Soon as you make it to the moat, you know you're home free.  The guards can't follow you here.  Before you know it, you've reached the other side.  \n\n\n\"Bolard!\"  You call, \"I got the king!\"\n\n\nHe and the other guards come running from around the corner.\n\n\n\"Great!\"  Bolard says,  \"That should be enough!  Worst comes to worst, and we have to launch another assault.  They're crippled without a leader, it should be easy.\"\n\n\n\"Good to know.  Now why don't we get out of here before they come after us?\"\n\n\nBolard laughs.  \"Yes, let's get on that.\"  And you run off into the forest together.", "action_results": []}, {"action": "Go after the rest of the so-called nobles", "result": "You can't leave any behind to take the king's place, or else the entire mission is a failure.  You rush out after them, easily catching up to them with your longer legs.  Guess they're not the types to exercise... or do whatever it is these creatures have to do to get stronger.  You plow through them like they're snowmen.  But the guards begin to come after you, and they clearly do exercise.  They begin to surround you as you chase the last noble across the courtyard.  (Most of them never made it past the great hall door).  \n\n\nJust as the guards close in, you leap atop the last noble, crushing him under your weight!  He dies instantly.  Unfortunately for you, the guards reach you at that exact moment, stabbing you in about fifteen different places at once.  You also die instantly.\n\n\n \n\nBut hey.  At least you saved the kingdom.  Sort of...", "action_results": []}]}]}, {"action": "Go along with the defectors plans", "result": "What are you thinking?  Of course you're going along with them!  This rebellion kidnaps children, for crying out loud!  There's no way they'd make good rulers.  You finger the note in your pocket, your resolve slowly growing.  Tomorrow, you get to leave this place forever.  With that thought in mind, sleep comes easy...\n\n\n \n\nThe next day, you begin the journey to the fortress, escorted by a few rebels, and Bolard himself.  It takes several days to get there, and you get to pass by Arrorn on the way, so that's fun.  (Though, you don't get to actually enter the village.  Too much risk of being recognized or something).  \n\n\nFinally, you spot it, sitting on a hilltop just on the horizon.  The King's fortress.\n\n\n\"Alright,\" Bolard says, \"I didn't have much to do last night, so I thought a lot about the plan.  We've got an informant inside the fortress who can let you in so you can carry out the mission.  Just do what we discussed and we'll be fine.\"  He thinks for a moment, then says,  \"Also, I brought something in case the king doesn't fall so easy.  He's got this enchanted armor, and I'm not quite sure you'll be able to break through it. So, I procured a bottle of water.\"  He pulls a glass bottle out of his bag and hands it to you carefully.\n\n\n\"What's this for?\"  You ask.\n\n\n\"What do you think?  It'll get through the cracks in his armor, and kill him!\"\n\n\n\"It's water.\"\n\n\n\"Exactly!  Water kills people!\"\n\n\n\"I don't follow.\"\n\n\n\"Didn't anyone ever tell you that water disintegrates people?  The skin soaks up too much and it just falls apart.\"\n\n\n\"That's not how it works for Humans,\" you say,  \"We can touch water, no problem.\"\n\n\n\"Really?  Well, that sure makes things easier.  This way you can cross the moat, no problem!  I was wondering how we'd do that.\"\n\n\n\"Yeah... Okay.\"  You roll your eyes.  \"Just give me the bottle.  I'll smash it over his head or something.\"\n\n\nAs you get closer to the fortress, you start to make out more detail.  It looks like it mainly consists of a bunch of towers, surrounded by a wooden wall.  By the time the sun sets, you're within a hundred yards of the walls. \n\n\n\"Alright,\"  Bolard says,  \"Good luck monster!\"  He gives you a shove towards the moat.  You jump right in and swim across, making it to the other side in less than a minute.  You head around the back of the castle, where you find door carved into the wall.  As you're contemplating how to get inside, it swings open and a female Oalkwardner beckons you inside.  \n\n\nThat's when you realize you'll have to kill her so she doesn't reveal that you're a traitor once you escape.  As soon as she shuts the door, you bash her over the head with your fist, taking her out instantly.  You feel a little guilty about it, because after all, she did let you in.  But then, the king is probably gonna execute all of the rebels anyway, right?\n\n\nYou're in a little alcove in the great hall, unseen by the group of people at the table, talking and laughing.  There's another door nearby, presumably to the courtyard.  You'll head out there in a moment, but first you've gotta figure out the best way to deal with the note...", "action_results": [{"action": "Go up to the table and deliver it yourself", "result": "You have to make sure the king gets this note, don't you?  So, you walk right up to the table, reaching in your pocket for the note.  \n\n\nBut before you can say so much as a word, someone screams.  Now what on earth could've caused that?  You look around, but realize they're all looking at you, backing away.  You open your mouth to say that you come in peace, but before you do, a guard rushes over and stabs you in the gut!  You're so surprised, you don't do anything when the others come and follow suit!\n\n\nYou fall to the ground, still clutching the note in your hand.  Your vision swims, then fades to black.  Hopefully they'll still find the note in your hand.  They'll probably feel pretty stupid about killing a potential ally, but that's their loss...", "action_results": []}, {"action": "Leave it stuck between the door and the wall on your way out", "result": "You slip out the door before anyone notices you, leaving the note behind.  Now, you're in the fortress courtyard.  Luckily, it's deserted, probably thanks to the banquet.  Even more lucky, you spy another exit door just across the courtyard.  You head straight for it and try to open it.  To your immense surprise, it swings right open.  Are they really this under prepared?  What if someone broke into the fortress through that?\n\n\nYou step outside the walls, and realize that there's no handle on the other side.  Closed, the door blends seamlessly with the wall, making it completely invisible.  How interesting, looks like they had an escape route planned in case of an attack.  So smart of them.\n\n\nYou cross the moat and hurry back into the forest, hoping against hope that Bolard doesn't see you.  Once you're a good hundred feet in, a voice from besides you nearly makes you jump out of your skin.\n\n\n\"Did you do it?\"\n\n\nYou turn to see the masked Oalkwardner and a few others looking at you, waiting for an answer.\n\n\n\"Yeah,\" you say,  \"It's done.\"\n\n\n\"Perfect!\"  The Oalkwardner pulls off his mask, revealing his face.  \"Now that I know I can trust you, I can take this stupid thing off.  I was just wearing it in case you betrayed us or something.  My name is Culmad, by the way.  Now what do you say we get the heck out of here?\"\n\n\n\"Yeah,\"  you say, \"Why don't we?\"\n\n\nAnd you set off into the forest, together.  \n\n\nWhen word gets out about what you did, you will be hailed as a hero, the savior of the kingdom.  But for now, perhaps you ought to just try your best to make a life for yourself in this place.  It seems like you've already got yourself a few friends to start your new life with.  Best of luck...", "action_results": []}]}]}]}]}]}, {"action": "Do not. (No way I'm helping this guy).", "result": "You stare at the Oalkwardner's hand.  Slowly, you shake your head, and he draws back his arm, frowning.  \n\n\n\"I figured this might happen,\"  he says,  \"I suppose you won't be much use as an assassin if you don't cooperate.  But we may be able to find... another use for you.\"\n\n\n\"What are you talking about?\"  You ask, \"I said no!  I'm not going to help you!\"\n\n\nBut he doesn't respond.  Instead, he makes a popping sound with his mouth, three times in a row.  Suddenly, an entire hoard of Oalkwardners appears from all directions, all holding spears, all wearing the same cloaks as the leader before you.  \n\n\n\"I feared it might come to this,\"  he says,  \"That's why I brought backup.  The data we gather from studying you might just help us yet.\"\n\n\nYou leap to your feet and tense for a fight.  \"You're going to kidnap me now?  Bring all the Oalkwardners you've got, I'll just do them in like I did your other friends!  You said it yourself!  I'm a force to be reckoned with!\"\n\n\nThe Oalkwardner shakes his head and raises his hand.  All of his soldiers, or whatever it is they are, leap towards you as one.  There are far too many to fight off, even if you're stronger than they.  Even still, you put up your fists and start swinging madly as you are engulfed in a wave of papery skin.  Each swing of your arm makes contact, sending the creatures flying right and left.  But as much as you punch and kick, they still manage to get a grip on you, pulling you this way and that, crawling up your legs and weighing you down.  For some reason or other, none of them have spears.  Not that you're complaining, if it weren't for that fact, you'd probably be dead already.\n\n\nA single Oalkwardner is light as a football, easily tossed around in a fight.  But a whole hoard?  That's enough to crush a grown man under their combined weight.  Slowly, your knees begin to weaken as more and more of the creatures pile on top of you.  You stagger around for a few moments until you finally collapse, falling backwards into the grass.  It's hard to see anything, they cover your face, blocking your view.  But over their cries, you can just hear the leader's voice.\n\n\n\"You should've taken my offer, monster.  Perhaps then, we could've been friends.\"\n\n\nA pain slashes across your wrist.  Something's cut you!  Before you have time to figure out what that might be, you begin to feel dizzy.  The edges of your vision close in until all that's left is one small pinprick of light.  Then, even that is extinguished, and the world fades away...", "action_results": []}]}]}]}]}, {"action": "the lighter!", "result": "Common sense says the knife would be the better choice.  I mean, how much damage can you really do with a lighter?  It takes too long to set someone's clothes on fire; you'll be tackled from behind before you have a chance to hold the flame in place long enough.  But for some strange reason, the lighter just feels like the right tool for the job.  \n\n\nBefore anyone even has a chance to process the fact that you're there, you tackle one of the creatures holding the... other smaller creature down.  It's like running into a giant beach ball, except made of Paper-Mache.  You thought it would be harder to send the creature flying, but it's so light, you hardly notice the impact.  By the time the two of you hit the ground, you've already pressed the lighter to the thing's head and flicked it on.  To your amazement, it's skin goes up in flames faster than a pile of dry pine needles.  So fast, you nearly burn yourself before you manage to get far enough away from it.  These things not only look like they're made of paper, the also burn like it too. \n\n\n\"What is this?\"  The leader cries, \"What the heck are you?\"\n\n\nThere's no time to respond.  The other creature (not the leader), is already upon you.  It charges towards you, so fast you can barely get the lighter around in time... But you do.  The creature runs right into the flame, recoiling as if it's been stabbed.  Within seconds it's reduced to ashes, just like the first one.  \n\n\nThe leader stares at you and takes a few steps back.\n\n\n\"P-please...\"  he says,  \"D-don't hurt me!\"\n\n\nBefore you have a chance to react, he's already running away, off into the forest.  He's far too fast for you, that's for sure.  By the time you get to your feet again, he's already disappeared into the trees.  \n\n\nAs the dust settles, the weight of your actions sets in.  You've just killed two intelligent creatures.  Even if they're not quite human, they still talked.  What if they had family?  Kids?  You had no way of knowing the lighter would kill them.  You just thought you might give them a scare, send them running.  But the way they treated that other creature... there's no way they were really worth sparing... right?  \n\n\nSpeaking of which, you'd better make sure that other creature is alright...", "action_results": [null]}]}, {"action": "Watch from afar. Better to stay safe than risk your life for a stranger.", "result": "You stay where you are and listen.\n\n\n\"Please!\" cries the high pitched voice, \"I just wanna go home!  Let me go home!\"\n\n\n\"We're giving you a new home.\"  Says the gruff voiced one (probably the leader), \"A better home!  Don't you want to help make your old home better?\"\n\n\n\"No!  I want my papa!\"\n\n\n\"My word!\"  The leader explodes,  \"She's a child! How hard is it to get a child into a bag?\"\n\n\nThe screams become muffled now, and a new voice says\n\n\n\"We're not incompetent, you shriveled prune!  See? We've already got her in.  If you'd use your rotten husk of a brain for one second you'd stop yelling and see that.\"\n\n\n\"Under the old order, a comment like that would get you executed.\"\n\n\n\"So what?  We're out to put an end to the old order, not-\"\n\n\n\"Would you shut up?  You want someone to hear us?  You're worse than the little girl!\"\n\n\n\"All I'm saying is, you won't do anything about it.  You know it's wrong, I know it's wrong, so stop making stupid hollow threats!\"\n\n\nThe leader laughs, a cold, empty laugh.  \"I'll be the judge of what's right and what's wrong, thank you very much.  Not everything about the old order has to go.  Don't throw the slush out with the water, as they say.  Now pick up that bag and start walking.  We've taken too long already.\"\n\n\nWith that, the muffled screams of the child fade into the distance as the light grows further away.  Soon, all you can hear is the pounding of your heart, returning slowly to normal.  It's a good thing you didn't get tangled up in that mess.  No telling what would've happened if they'd seen you.  Still, the sounds of that girl screaming still ring in your ears.  Something tells you they might linger still for a little while longer.\n\n\nSoon as you're sure the danger's passed, you walk a little closer to the scene of the crime, or whatever it was you just saw.  To your surprise, there's a path not too far from there.  The kidnapers must've been waiting in the bushes or something, and jumped out to grab the girl as she passed.  With no other options at hand, you start down the path in the opposite direction from the kidnapers.  It's lined with stones, with a few oddly-shaped bricks set in the ground here and there, as if, a long time ago, it was paved.  \n\n\nThe trees are thinning out now, and soon you can see the night sky in all it's glory.  You come to the edge of a hill and stop.  Down the slope in front of you, lights are visible.  A village rests at the bottom of the hill, still sleeping in the light of the stars.  What's more, from your vantage point you can just see the beginnings of the sunrise peeking up from behind the mountains in the distance.  The path has given way to a rough set of stairs carved into the hillside.  They are smaller than most stairs you've seen, like they were carved especially for children.  Still, it's better than picking your way down the slope and probably slipping a few times along the way.  \n\n\nYou reach the bottom of the hill in record time and find yourself still a mile or so away from the village.  Looks like the path continues into it, so you keep following it.  As you walk, you pass by a strange plant, just taller than you are.  It grows on a thin, blue stalk, straight up, until it droops over at the top, opening into a strange, orange bulb.  The bulb glows in the dawn, lighting the whole path beneath your feet.  Just a few moments later, you pass by another on the opposite side of the path.  The entire trail leading up to the village is lined with these plants, lighting the way like streetlights on an old city road.  ", "action_results": [{"action": "The village", "result": "It soon becomes apparent that you are closer to the village than you thought.  Is it just you, or are those buildings smaller than they seemed from afar?  You come to the edge of the village to find that the smallest of the houses are about your height.  Everything is half the size it should be, from the road through town to the stones that pave it.  What's more, everything is made of the strangest materials, the likes of which you've never seen.  (At least, not that you can remember).  The only thing you've seen that looks remotely like this is Paper-Mache, but this must be sturdier than that, otherwise these houses would've fallen down ages ago as soon as the wind decided to pick up.\n\n\nAs you draw nearer to the center of town, you begin to feel that unsettling feeling of being watched.  It's been present for quite some time now, growing stronger as the sun continued to light up more of the sky.  Are those eyes you see, poking out between the shuttered windows of the houses?  Why is nobody out and about yet, it may be early, but even still-\n\n\n\"What in the name of the water-pit are you?\"  A voice from behind snaps you out of your thoughts. \n\n\nYou turn, knocking your elbow on the corner of the houses nearby.  Grimacing from the pain, you see before you a strange creature, almost human, yet not quite.  Its head comes up only to your waist, and it's skin has the same Paper-Mache quality as the walls of the buildings beside you.  The ears are the strangest part, sticking straight up into the air.  It's a wonder something so small can hold them up like that for so long.  The creature holds something like a spear, made of wood, pointed straight at you.  \n\n\n\"Do you speak, you big brute?\"  The creature asks, \"What are you, why have you come here, waking us all up in the night?\"\n\n\n\"The sun's out,\" you reply, \"People get up when the sun is out, don't they?\"\n\n\n\"Do you like getting up at the crack of dawn?  Some of us sleep in and that's besides the point.  What the heck are you, and why are you here?\"\n\n\n\"What am I?\"  You ask, your irritation growing with each word this creature says, \"What are you?  What is this place?  I've never seen anything like you.\"\n\n\nOther creatures, like this one before you, peak their heads out from doorways and windows, drawn out by the commotion at hand.\n\n\n\"I am Merk, head of the watchmen of Arrorn.\"  Says the creature, \"This village and it's people are under my protection.  If you have come to do harm, consider this my warning.  State your purpose or leave this place, lest I am forced to raise my spear and drive you out myself!\"\n\n\n\"I haven't done anything!\"  You protest, \"Why are you threatening me?  Don't I have... rights or something?\"  That thing may be small, but the stick it's holding still looks pretty sharp.\n\n\nThe creature pauses, lowering it's spear just a touch.  \"I don't know what you mean by 'rights,'\" it says, \"But you raise an important point.  I apologize for threatening you, it's just that I've never seen anything quite like you in all my seventy-four years of life in this village.\"\n\n\n\"I'm a human... I think,\" You say, still feeling a little annoyed, \"And in all my... well, I'm not sure how many years of existence, I've never seen anything quite like you either.  I think.\"\n\n\n\"I am what is known as an Oalkwardner.\"  Says the creature, (Merk, as he called himself), \"As are all others like me.  This village-\"\n\n\nA high pitched whistle cuts through the air, cutting Merk off mid sentence.  He seems to jump a little when he hears it, his stance becoming more rigid, more alert.  \n\n\n\"The alarm!\"  He says, raising his spear once more,  \"I'm sorry, but duty calls!\"  He leaps towards you and you flinch.  Is he going to attack you after all?  But no, he soars over your head and lands behind you, taking off as soon as his feet touch the ground.\n\n\n\"Wait!\"  You call.  The idea of being left alone in this strange village terrifies you.  Who knows?  The next person you talk to might attack you for real.  You run after Merk, ducking through the too narrow streets, nearly flattening a few unsuspecting Oalkwardners.  Even with your longer legs, Merk is faster than you, slowly drawing farther and farther away.  \n\n\n\"Please!\"  You cry once more, \"I don't even know where I am!\"  \n\n\nMerk slows a little and looks over his shoulder.  \"If you want to stay with me, then do so!\"  He calls back, \"But I must warn you, I have work to do.  I may not be of much use to you.\"\n\n\n\"That's... fine...\"  You pant,  \"Just... slow down... a little.\"\n\n\n\"We're almost there, human!  I cannot slow my pace, there may not be much time!\"\n\n\nYou can hardly begin to imagine what he means by that in your current state, (you're not going to be able to run much longer with this pain in your side), but he's clearly not slowing down.  Maybe it's the fear of being left behind, but somehow you find the strength to keep up the pace.  The road grows wider with each twist and turn, until it gives way to a dilapidated plaza with a strange tower in the middle.  Atop it is what looks to be a horn of some kind, with an Oalkwardner blowing into it.  This is where the high pitched noise came from earlier.  \n\n\nMost of the people milling about the square ignore the horn, as if this is some kind of daily occurrence.  Merk slows at the base of the tower, stopping in front of an Oalkwardner in something resembling a dress, it's ears drooping.  You catch up just in time to hear the ensuing conversation.\n\n\n\"Fila?\"  Merk asks, \"Why have you sounded the alarm?  What's wrong?\"\n\n\n\"Its Pila,\" Says Fila, \"She's dis-\" the Oalkwardner notices you for the first time, \"What in the world is that?\"\n\n\nHer ears stick straight in the air and she leaps backwards, trembling.  Merk turns and sees you standing there.  \n\n\n\"This is human.  It's friendly, don't worry.\"  He turns to you and says, \"And this is Fila, my wife.\"\n\n\n\"Why is everyone so afraid of me?\"  You ask, \"I haven't done anything wrong.\"\n\n\n\"I'm sorry... hue-mon.\"  Her ears begin to droop once again, \"I'm just worried, that's all.  Our daughter,\"  She gestures to Merk and herself, \"is missing.  She went to play with her friends yesterday evening.  I meant to stay up waiting for her, but I was so tired that I just couldn't stay awake.  And when I woke up, she still hadn't come back.\"\n\n\nMerk's eyes grow wider, and he grips his spear tighter.  \"What do you mean, she hasn't come back.\"  \n\n\n\"I mean, she isn't here, Merk!  She might've disappeared like all those other-\"\n\n\n\"No!,\"  he says,  \"I'm sure she's fine.  She probably just got lost.  We'll find her.\"\n\n\nA chill runs down your spine.  You'd forgotten about the kidnapping you saw in the forest after Merk confronted you.  You were too worried about staying alive to think about someone else's troubles.  But now the memory returns in full force, the fear it brings creeping through every fiber of your being.  \n\n\n\"I'm not so sure about that...\"  You say, voice trembling a little.  \n\n\nMerk turns to you.  \"What do you mean?  Did you have something to do with it?\"  He picks up his spear, gripping it tight.\n\n\n\"No!  But I think I might have seen what happened.\"  And you go on to explain the strange events which you saw when you first awoke.  When you finish, Merk covers his face with his hands.\n\n\n\"I've dealt with this sort of thing for years,\" he chokes, \"But it's always been someone else's kid.  Someone else's heartache...\"  He looks up at you.  \"This is the fourth kid to disappear in the last month.  If these people that took... that took my daughter, took the others too...\"  He stops and covers his face again.\n\n\n\"Then,\" Fila says, \"If we find her, we find them all.  Hue-mon.  Please, will you help us?  Take us to where you saw her, tell us which way they went.  Then, maybe, we can find her.  Her, and everyone else.\"", "action_results": [{"action": "\"Of course I'll help!\"", "result": "Maybe it's bravery, or maybe it's the guilt of having done nothing to help the girl in the first place, but you don't hesitate to say yes.\n\n\n\"Thank you so much!\"  Merk says, \"Come on, we'd better get going now.  Normally I'd get a team together to help with the search, but since I have you, I think we'll just go as a twosome.  The time it takes to round everyone up isn't worth it.\"\n\n\nYou leave the village and lead Merk back up the hill to where you saw the kidnapping.  His ears twitch nervously as you walk, and he talks incessantly.  \n\n\n\"I just don't know what I'll do if we don't get her back.\"  he says at one point,  \"the thought of never seeing her again... hurts more than anything.  Why couldn't it have been me?  What do they want with children?\"\n\n\nYou don't respond.  There's just nothing to say.  At this point you reach the staircase, and begin climbing up it.  In the light of the day, you're beginning to notice something strange about the trees.  It's been bugging you for a while now, come to think of it.  From what you can draw from your broken memory, these trees aren't like any back... well, wherever you came from.  The shapes of the leaves are different, so is the pattern of the bark.  It's like the entire forest is something out of a fantasy world.\n\n\nAs you draw near to the scene of the kidnapping, you slow down.\n\n\n\"It happened just up there,\"  you point, \"They went up the path that way once they were finished.\"\n\n\n\"We've gotta make sure we don't miss anything.\"  Merk says, \"Thankfully, this path isn't as well traveled as it once was, or our search would be nigh impossible.  Keep an eye on the edges of the trail, let me know if you see any sort of clues.\"\n\n\n\"What am I looking for anyway?  If I see, say, a broken branch or something, how are we to know it wasn't broken by a deer or some other, innocent travelers?\"\n\n\nMerk sighs,  \"I don't know, human, but right now it's all we have.\"\n\n\nFor the next couple of hours, you walk the trail, scanning the ground for something, anything that might help you.  But there's nothing.  Not so much as a blade of grass is out of place, (if, indeed, blades of grass can be considered out of place in a forest).  The sun is growing low in the sky now, soon it'll be too dark to search.  Your feet ache and your stomach rumbles, your stash of Cheez-Its isn't enough to satisfy your hunger completely.\n\n\nThen, you see something that is a little out of place.  A few of the trees just off the path look as though they've had bites taken out of them by some big hungry monster.\n\n\n\"Merk?\"  you say, \"Do you see that?\"\n\n\nMerk jumps a little at the sound of your voice.  \"What is it?\"  he asks, excited,  \"Did you find something?\"\n\n\n\"I don't know,\"  you say, pointing, \"I'm not quite sure it's what we're looking for, but it's definitely something.\"\n\n\nMerk takes one look at the markings on the trees and his eyes go wide.  He reaches over his shoulder and draws his spear.  \n\n\n\"What is it?\"  You ask, your muscles tensing up in fear,  \"What's wrong?\"\n\n\n\"Those markings,\" Merk's voice trembles a little, \"are from a beaver.\"\n\n\nYou stare at him for a moment.  Then, a chuckle escapes you lips.  \n\n\n\"What's so bad about a beaver?\"  You laugh,  \"Are you afraid one might drop a tree on you or something?\"\n\n\n\"Beavers are no laughing matter,\"  Merk snaps, \"They're vicious killers!  If you'd heard a quarter of what I had about them, you'd be scared too, I guarantee.\"\n\n\n\"Do you want to turn back?\"\n\n\n\"Heck no!  If I turn back, it means I don't get Pila back, and if I don't get Pila back...\" he trails off, and is quiet for a moment. Then, he shakes his head.  \"It doesn't matter, we're not stopping.  Beavers or no, we will keep going.  I don't think I could live with myself if we didn't.\"\n\n\n\"Whatever you say,\"  you shrug,  \"I'm not afraid of beavers, so I guess you'll just have to face your fear if we meet one.\"\n\n\n\"Let's try to make sure we don't meet one, alright?\"\n\n\n\"Alright,\" you say, rolling your eyes.\n\n\nYou continue up the trail.  As it continues to get darker, the two of you go slower and slower, as it's harder to verify that there are, indeed, no clues in a given area.  The beaver markings are becoming more and more numerous the longer you walk, which does nothing to help Merk's nerves.  It's not exactly great for yours either, if you're honest with yourself.  You may not be afraid of beavers as you know them, but there's always that chance that \"beaver\" means something different in this place than what you know.  \n\n\n\"Do you think we should stop for the night?\"  you ask, as the darkness grows too thick to properly see through, \"So we don't miss anything in this darkness?\"\n\n\nMerk thinks for a moment, then sighs.  \"I guess you have a point.  We'd best make camp here.  Hold on for a moment, I have to go... erm, relieve myself.\"\n\n\nHe heads a little ways off the path, and you sit down on a rock to wait for him.  Your feet need a rest, they've probably got blisters all over after all that hiking.  \n\n\n\"Human!\"  Merk cries,  \"Come look at this!\"\n\n\nYou groan and stand up.  Guess your feet aren't getting that much of a rest after all.  \n\n\n\"What were the kidnapers wearing?\"  Merk asks when you reach him.\n\n\n\"It was hard to tell from so far away,\"  You say, trying to remember, \"It looked like they were wearing some kind of robes.\"\n\n\n\"What color were they?\"  \n\n\n\"Green, I think, why do you ask?\"\n\n\n\"Because I found this!\"   Merk gestures towards a little thorn bush to his left.  Hanging from one of the branches is a small scrap of green fabric.  \"I bet they went off this way!\"  he says,  \"We should see if we can follow their trail.\"\n\n\n\"Can you do that in the dark?\"\n\n\nMerk goes quiet for a moment.  \"I... don't know.\"  he admits,  \"Probably not as well as in daylight, we might lose the trail or something if we go now.  But they could get further away if we wait.  Oh, it's so much harder to think clearly about these things when it's your own daughter at stake... \"\n\n\n\"We best wait till morning,\"  You say, \"We don't want to lose the trail in the dark and get ourselves lost.  We wouldn't be much help then would we?\"\n\n\nMerk doesn't say anything for a moment.  Then, he nods slowly.\n\n\n\"I guess it's the best we can do,\"  he sighs,  \"It just hurts to sit here, doing nothing.\"\n\n\n\"I get it,\"  You say, \"But think of it this way:  by waiting, we're maximizing our chances of finding her.\"\n\n\n\"Yeah, I know.  Let's get set up, I'm tired.  If we're going to get some sleep tonight, we'd better do it soon...\"", "action_results": [{"action": "The next morning...", "result": "You sleep like a rock.  It's been a very long day, that's for sure.  You've hardly stopped since waking up in the forest last night.  But of course, it doesn't last.  You awake to Merk staring down at you, poking your side with his foot.\n\n\n\"Wake up, human,\"  he says, \"It's time to go.\"  \n\n\nYou sit up, blinking back the sleep from your eyes.  The sun is just beginning to rise, but by all accounts, it's still pretty dark outside.\n\n\n\"Shouldn't we wait a little longer?\"  You ask, \"until it's lighter out?\"\n\n\n\"By the time we pack up camp, the sun will have risen a little more.\"\n\n\nYou take one last longing look at your sleeping bag, then roll it up and start getting your stuff together.  In a half hour's time, you're on the trail again, Merk leading the way with his tracking skills.  \n\n\n\"What's the plan when we if we do find them?\"  You ask.\n\n\n\"We don't know what we're walking into, so we'll have to improvise.\"\n\n\n\"Oh...\"\n\n\nFor a while, the two of you walk in silence, Merk stopping every ten feet or so to check for new clues.  It seems people have traveled this way before, and relatively frequently.  There is a faint trail, if you really look for it, where other Oalkwardners have gone before.  \n\n\n\"These beaver markings are getting more and more frequent,\" Merk says after you've been on the trail an hour,  \"I think we're headed right into the heart of their territory.  What on earth were they thinking, coming to a place like this?\"\n\n\n\"Listen,\" you say, \"I'll deal with any beavers that come our way.  All I need to do is wave my hands in the air and make a loud noise.\"\n\n\n\"You're either a lot stronger than you seem, or an arrogant fool if you think that.\"  \n\n\n\"It's a beaver!  What harm can it do?\"\n\n\nMerk doesn't respond.  Instead, he stops short, and you nearly trip over him.\n\n\n\"Why are we stopping?\" you ask\n\n\nMerk puts a finger to his lips and points down the path.  You look and see something big and hairy laying just to the side of the trail.  It's some sort of creature, about the size of a bear, and it isn't moving.  \n\n\n\"It's a beaver,\"  Merk whispers,  \"If you really know what you're doing, go deal with it!\"\n\n\n\"That's no beaver,\"  you whisper back,  \"I'm not sure what that is, but it's not a-\"\n\n\n\"Shut up and take a look, will you?\"\n\n\n\"Fine!\"\n\n\nQuietly as you can, you walk closer, crouching behind trees at every opportunity.  But it never moves.  You're not even sure it's breathing.  Then, you notice the blood staining the ground around it.  Whatever this creature is, it's dead.  \n\n\n\"Merk, I think it's dead!\"  you say.\n\n\n\"Are you sure?\"\n\n\nYou walk right up to the creature and take a closer look.  It has a gaping hole in it's stomach, and multiple puncture wounds in various places.  Looking at it up close, it occurs to you that this thing really does bear an uncanny resemblance to a beaver, right down to the teeth and tail.  The only thing that's different is the size.\n\n\n\"Yeah,\"  you call, \"I'm pretty sure.\"  Just to prove it, you give it a good kick in the side. \n\n\n\"My goodness,\"  Merk says when he gets closer, \"Never in all my days... Those look like spear wounds.  And that big hole in it's stomach looks too clean to have come from some kind of other animal.\"\n\n\n\"Are you saying an Oalkwardner did this?\"  \n\n\n\"Possibly.  And a powerful one at that.  I certainly hope we never have to fight them, should we ever meet.\"\n\n\nThe two of you stare at the beaver corpse for a few minutes.  Finally, Merk breaks the silence.\n\n\n\"We should keep going, the trail continues this way.\"\n\n\nUnnerved, you follow him.  Something about that corpse put you on edge.  Every random snap of a twig has you checking over your shoulder, searching for potential threats.  For another two hours, you walk in silence.  Neither of you dares say a word, in case whatever killed that beaver is somewhere lurking nearby.  The trees are growing thicker now, the beaver markings more numerous.  Then, Merk stops again.  \n\n\n\"Do you hear that?\"  he whispers\n\n\nYou stop and listen.  \n\n\n\"What is it?\"  you ask, not hearing anything,\n\n\n\"Shhh!\"\n\n\nFor a few minutes, you're completely still.  Then, you hear it, ever so faintly in the distance.  The sound of voices.\n\n\n\"Let's go,\"  says Merk, and takes off towards them on silent feet.\n\n\nAs quietly as you can, you follow behind him.  The voices grow louder as you get closer, and soon you can make out snippets of conversation.\n\n\n\"...Hold her still...\"\n\n\n\"...better be quick...\"\n\n\n\"...somebody help!\"\n\n\nThe last voice is louder than the others, more clear.  Merk stand up straighter when he hears it.  \n\n\n\"That's my daughter,\"  he says in a low voice,  \"If they hurt her, I swear I'll...\"\n\n\nHe doesn't finish the sentence, but instead speeds up even more.  You follow as closely behind as you can, worried that he might do something stupid.  Suddenly, the trees give way to a clearing, where a large group of Oalkwardners in green cloaks gather around something at the very center.  \n\n\n\"It's almost finished!\"  one of them says,  \"I'm applying the branch now, everyone back off!\"\n\n\nThe group spreads out enough that you can just see what they were gathering around.  A small Oalkwardner is strapped to the ground, drenched in some kind of green substance.  \n\n\n\"Please stop!\"  She cries, struggling against her bindings,  \"I don't like this, let me go!\"\n\n\nThe cloaked Oalkwardner ignores her and tosses something on top of her struggling form, then takes a few steps backwards as fast as he can.  The girl, Pila, begins to scream, and the earth begins to quake.\n\n\n\"NO!\"  Merk cries, and runs into the clearing before you can do anything to stop him.  (How he manages to do so without tripping is beyond you).  All the cloaked Oalkwardners turn and look at him in shock as he runs towards them.  They draw their spears and get ready to fight, but instead of charging them, he leaps into the air, sailing over their heads, and lands right next to Pila.\n\n\nBut while all this is happening, Pila's skin begins to give off a faint blue glow, growing brighter every second.  By the time Merk reaches her side, she's too bright to look at.  \n\n\nAs Merk reaches out to touch her, a bolt of lightning flashes up from the ground, and the sound of thunder resonates throughout the forest.   A split second later and the light is gone.  A moment later, the earth stops it's quaking.  You turn and look at the place where Pila once was, and gasp.  All that's left of Merk are a few scraps of Paper-Mache skin and a pile of ashes.  As for Pila... what on earth is that?  A strange lump of wood lays in the middle of the clearing.  It takes you a few seconds to realize that it's an exact copy of Pila.  What the heck did they do to her anyway?\n\n\nPresently, about half the Oalkwardners head over towards a contraption over on the other side of the clearing, (you can't quite make it out from here), while the rest mill about, chatting nervously among themselves about what Merk did.  If you're going to try anything, now might be the time to do it.  You might be able to save Pila and Merk's remains, at least...", "action_results": [{"action": "Attempt to steal the remains of the fallen Oalkwardners", "result": "You may not get this chance again, so you'd better make the most of it.  You run into the clearing as fast as you can.  It only takes a moment for one of them to notice you and sound the alarm.  By the time you've reached Pila's side and scooped her up in your arms, every last one of them are charging towards you, spears drawn.  Without thinking, you run back the way you came, leaving Merk's remains behind.  (Not that there was much left to collect to begin with).  \n\n\nBranches scrape your face as you run, but you don't stop.  The Oalkwardners aren't slowing down, so neither can you.  No telling what'll happen if they catch you.  It's a good thing you've got adrenaline, because otherwise the blisters on your feet alone would've stopped you in your tracks by now.  But it doesn't really matter.  They're gaining on you too quickly to escape.  Suddenly, the wooden lump in your arms shifts, and you're so startled, you drop it and proceed to trip over it, falling face first into the dirt.  As you're getting back to your feet, you see out of the corner of your eye, the wooden Pila getting to its feet.  Slowly, it turns towards you, staring at you with glowing yellow eyes.  Then, it leaps on top of you, and digs its claws into your chest.  You're too surprised to do anything about it.  By the time you've recovered from the shock, you're too delirious from the pain to care.  The last thing you see as the world fades away is the Oalkwardners running away in terror as the creature feasts on your flesh...", "action_results": []}, {"action": "Wait and follow them.", "result": "You stay where you are and watch as they pick up the contraption and carry it to Pila's remains.  That's when you realize, it's a cage.  They set it down right beside her and put her remains inside it.  Then they close it up and lock it tight.  Four Oalkwardners pick it up by the corners and lead the way into the forest.  You follow at a distance, careful not to be seen.  The brush is thicker than ever here, branches scratch your face and you nearly trip several times.  Luckily, you manage to keep your footing in the end.  \n\n\nAs you walk, you begin to notice something strange about the wooden remains of Pila in the cage.  Every once in a while, they shift a little, as if of their own accord.  Is it just your imagination, or did one of her arms just twitch?  The Oalkwardners glance up at it every time this happens, and you notice a few of them gripping their spears, getting ready to draw them in case... well, you're not sure what.  \n\n\nAll of a sudden, the whole procession stops.  Something's going on at the very front of the group, but you can't quite make it out from this distance.  Then, you see it.  A wooden hatch opens up in front of them, about four times their size, and they begin to descend down it, carrying the cage somewhat awkwardly between them.  Then, the rest of them follow.  Soon as the last one descends, the hatch falls closed.  You rush over to it and find that it's camouflaged to look like part of the landscape, though, if you really look hard enough, you can just see the outline of it in the grass.  \n\n\nYou wait about five minutes before you try to open it.  (Just to make sure no one's lingering by the door when you come in).  A good tug on the handle, (cleverly disguised as a tree root), confirms that, as expected, it's locked.  As you stand there, trying to figure out a way to get inside, you hear the muffled sound of footsteps coming up, getting nearer and nearer to the surface.  Quick as you can, you back away and duck behind a bush, just before the hatch comes open.  A single Oalkwardner climbs out, leaving the door open behind him.  He grumbles something about \"Bathrooms\" and \"Relieving himself,\"  and heads off a little ways into the woods.  \n\n\nNow's your chance!  Thanks to that Oalkwardners carelessness, the door is wide open in front of you.  You slip inside as quickly as you can, pulling the door shut behind you.  It clicks when it closes, probably locking itself automatically.  Good, now that Oalkwardner won't come in from behind and surprise you.  \n\n\nYou find yourself at the top of a spiral staircase, which descends about twenty feet before stopping.  When you reach the bottom, you find yourself in a dirt tunnel with three paths branching off from it.  ", "action_results": [{"action": "The tunnels", "result": "You are at the bottom of a spiral staircase, leading up to the surface.  Three, hard packed dirt tunnels branch off from here, each with a sign that tells where it leads.  A notice board full of announcements hangs on one wall.  You glance over it and notice one in particular reminding the whole facility of a mandatory meeting at this very time.  This is perfect!  You'll be able to explore the whole place without being caught!\n\n\nThe first tunnel is marked \"auditorium,\"  the second says \"Lab,\" and the third, \"Containment.\"", "action_results": [{"action": "Go down the path labeled \"auditorium\"", "result": "You slip down the hallway, trying to be as quiet as you can.  This must be the way to their meeting place.  It's probably where everyone is right now.  Sure enough, you begin to hear the faint sound of voices echoing down the tunnel, growing louder as you go further.  Soon, you come to a round wooden door, blocking the way.  From behind it, you can hear the voices, or rather, one voice, of someone giving a speech on the other side.  You press your ear to the door and listen...\n\n\n\"As you well know,\" the speaker says, \"The order of the broken chalice has spent years upon years preparing to liberate this land in which we all live, by slaying the tyrant in our midst!\"  The crowd cheers at this, sounds like only a few hundred Oalkwardners.  Are they really planning some kind of uprising with such a small amount of people?  As if in answer to your question, the speaker continues, \"Though we are few in number, the king cannot begin to anticipate our secret weapon: The Oalkfriers!  Thanks to the dedication of our resident alchemists, we have perfected the art of creating fearsome beasts, made of the strongest substance known to our kind: the wood of a simple oak tree!\"\n\n\n\"The day of the uprising draws nearer and nearer.  Just a few more Oalkfriers and we will be ready to estate our glorious new order.  Allow me to go over the plan once again.  We begin by releasing our Oalkfriers into many of the current order's key locations.  This includes their military bases, ambassador homes, and the palace itself.  They will wreak havoc, destroying everyone in their path.  Once they have done their job, we will move in and neutralize them, leaving no-one to prevent us from taking the throne ourselves!\"  The crowd cheers once again.\n\n\nYou've heard enough.  Whatever this is, it can't be good.  You've got to do something about it, or else there's no telling what might happen!", "action_results": [{"action": "Charge into the auditorium and take out as many as you can!", "result": "There's nothing else for it.  You fling open the door and rush into the room, screaming.  The entire auditorium turns to look at you just as you reach the Oalkwardners nearest to the door.  Before they can react, you start kicking as many as you can.  They go flying, your foot leaving dents wherever it lands.  Compared to these papery creatures, you're like some kind of superhero, with ten times the strength of any of them. \n\n\nUnfortunately for you, however, there are about five hundred of them, and they're not about to let you plow through all of them without a good fight.  Many draw their spears, and leap at you all at once.  You try your best to fight them off, but there's just too many!  They latch onto you wherever they can, driving their spears into your arms, your legs, your stomach.  The pain is overwhelming.  Those spears may be small, but they still hurt pretty bad.  You fall to the ground as the world fades away around you.  Who knew you'd be killed by a pack of midgets?", "action_results": []}, null]}, {"action": "Go down the path labeled \"lab\"", "result": "You head down the tunnel, trying your best to tiptoe.  The earthy ground helps muffle your footfalls, thank goodness, but it doesn't matter.  There's no one in the tunnel.  When you reach the end, you find yourself in a room made of wood.  Shelves line the walls, filled to the brim, not only with books, but also with other curiosities.  Jars of frogs, and creatures stranger still, all of them dead.  There are little models, carved from wood, bits of untempered metal and glass, among other things.  \n\n\nA wooden cauldron sits in the center of the room, with a strange liquid sitting in it, still as glass.  A table stands off to the side, holding numerous cups and bowls of different liquids and powders, none of which you recognize.  A neat stack of papers sits on one end of the table, pinned down by a particularly large bowl of rocks.  \n\n\nEverything here is perfectly neat and organized.  Nothing is so much as an inch out of place, even the tiniest grains of powder in the bowls seem to have a strange, indescribable order to them.  ", "action_results": [{"action": "Fill a bottle of the cauldron liquid", "result": "You take off your backpack and rifle through it, until you find just what you need:  an empty plastic bottle.  (You finished off the mountain dew the first day you got here).  Quickly, you dip the bottle into the cauldron and fill it up, screwing the cap back on once you're done.  Let's just see what you can accomplish with that...", "action_results": [null]}, {"action": "Check the notes", "result": "You take the bowl of rocks off of the stack of papers and glance at the paper on top.  \n\n\n\"To destroy and Oalkfrier,\" the title reads.  Below are a few paragraphs in immaculate handwriting.\n\n\n\"Oalkfriers are essential to the master plan of the Order of the Broken Chalice, however, they must be neutralized once they've served their purpose, lest they overrun the kingdom.  I have created a poison of sorts, powerful enough to destroy these creatures within seconds. For now, it sits in the cauldron in my lab, waiting to be used. It is nearly perfect, as much so as I can hope to make it.  Just in case something is to happen to me before the plan is carried out, (though I highly doubt it), I will relay the instructions for its use below\"\n\n\n\"The poison is inactive until acted upon by a catalyst of some sort.  This is for the safety of those using it. To activate, place a generous helping of Sodium Chloride (table salt), into it.  (I have a bowl full of it on my desk in the lab). Then, throw it on the Oalkfrier as fast as you can. Get as far away as you can, as even the fumes from this deadly cocktail are enough to kill a whole room full of Oalkwardners.  (You should be alright so long as you're outside, but I still wouldn't chance it.\"\n\n\nYou look up from the paper.  The bowl of salt is just to the left of the stack of notes.  On a whim, you pick it up to take it with you.", "action_results": [null]}, null]}, {"action": "Go down the path labeled \"containment\"", "result": "You sneak down the tunnel, checking around every corner just in case someone hasn't made it to the meeting yet.  It wouldn't do to get caught now, there's no telling how many Oalkwardners are holed up down here.  Luckily, the tunnel isn't that long, and after a few twists and turns, you find yourself in a large, dimly lit room, full what looks to be some kind of boxes \n\n\nIt takes a moment for your eyes to adjust, but when you do, you realize that these aren't boxes at all, but cages, just like the one they used to carry Pila's remains through the forest.  What's more, every last one of them has a wooden Oalkwardner inside them, exactly like Pila after the lightning struck her.  Gripped with a deadly cocktail of curiosity and fear, you approach the cage nearest to you and peer inside for a better look.  It's a perfect likeness of an Oalkwardner child, right down to the Paper-Mache quality of it's skin.  The only thing that's missing are the ears, which look like they've been broken off.\n\n\n\"What on earth have they done to you?\"  You whisper to yourself.\n\n\nAroused by the sound of your voice, the eyes of the wooden Oalkwardner snap open.  They give off a harsh, yellow glow, lighting up the dim room just a little.  You stare at the creature, stunned, and it stares back.  Then, without warning, it leaps at the bars of the cage, snarling.  You leap backwards in the nick of time as one of its arms reaches between the bars and takes a grab at you.\n\n\nThe noise wakes the other creatures and before you know it, all of them are attacking their bars, trying to get at you.  Fear overtakes you, and you take off running back down the way you came. What on earth was that anyway?  What do they want with all these monsters?  How are they creating them?  All these questions race through your mind, unanswered, as you reach the crossroads once again.", "action_results": [null]}]}]}]}]}, {"action": "\"Naw, I'm good.\"", "result": "\"I'm sorry.\"  You say, \"I'm not sure where, or even who I am.  I don't think I'm up to this sort of mission.\"\n\n\nFila stares at the dirt, clearly disappointed.\n\n\n\"Could you at least tell us where you saw them last?\"  Merk asks\n\n\n\"I guess it couldn't hurt,\"  you say. You explain how you came down the path from the top of the hill, and how you went in the exact opposite direction as them.  \"Just keep going down the path and, I don't know, get some kind of tracker-person to pick up their trail. Am I saying that right?\"\n\n\n\"I suppose that helps,\"  Merk murmurs, \"Thank you human.  I hope that the knowledge you have granted me is a fair substitute for your presence on this journey.  Come on Fila, let's go round up a search party.\"\n\n\nYou watch as they walk back into town, leaving you alone in the square.  All the things you felt after witnessing the kidnapping resurface, guilt, helplessness, the whole package.  For a moment you sit there, feeling sorry for yourself. Then you notice the Oalkwardners looking your way, suspicion in their eyes.  Maybe you'd better find somewhere else to stay, you're not quite sure you're welcome here. It wouldn't do to have another incident like you did with Merk.\n\n\nSo, you head out of the village the same way you came in.  Luckily, the most threatening thing you encounter on your way out are a few nervous glances as the rest of the village wakes up.  Soon, you've left the buildings behind and are back on the path through the forest. After you've gone a ways, you turn off the path and head out into the field surrounding the village.  Once you're far enough from the path that you're not likely to run into any unfriendly villagers, you toss your bag onto the ground and pull out your sleeping bag and pillow and spread them out on the ground.  Not that you need to go to bed yet, but just to give yourself something to do, if only for a few minutes. Guess this'll serve as a camp for the time being.\n\n\nFor a while you stare off into the distance, thinking of nothing in particular.  Your mind wanders, replaying the events of the day, contemplating your memory loss, trying to tease something from the thick fog that seems to engulf your thoughts every time you try to remember anything before you awoke in the forest.\n\n\nAfter a while, a line of figures appear in the distance, coming from the village, following the trail into the woods.  You can just make out Merk and a few others, all carrying bags slung over their shoulders and spears in their hands. They don't notice you watching them, and carry on into the forest, following the information you gave them.  Hopefully they find what they're looking for.\n\n\nThe rest of the day is uneventful at best.  You busy yourself by building a fire, even though it's far too hot to need one, and exploring around your campsite.  It crosses your mind that maybe you should head back into the village and introduce yourself, show them that you're nothing to fear.  You go back and forth as to whether or not you should, but eventually sheer boredom convinces you to be brave and face the Oalkwardners.  So you stamp out the fire best you can and start towards the path into the village. You've almost reached it when a lone Oalkwardner comes dashing out of the forest and trips, falling right on its face\n\n\n\"Are you alright?\"  You ask, rushing to the creature's side.\n\n\n\"They've been taken!\"  It gasps, \"Merk and the others... I was the only one... to escape.  Man that hurts...\" It rolls onto its side, revealing a gaping hole, oozing a clear substance.\n\n\n\"What happened to you?\"  Your heart pounds that the sight of the... well, you think it's blood.  \"I... I think you need a doctor or something.\"\n\n\nThe creature doesn't respond.  It just lays there, taking in shallow breaths, coughing every once in a while.  You don't think, you just act, scooping up the body and taking off running towards the village.  It's lighter than you'd expect, but maybe that's just adrenaline.\n\n\n\"Help!\"  You shout as you run through the village streets,  \"A doctor! She need a doctor!\" The Oalkwardners look at you terrified.\n\n\n\"A monster!\"  One of them cries, seeing the creature in your arms.\n\n\n\"No!\"  you shout,  \"Don't those ears of yours work?  I'm trying to save-\"\n\n\n\"Run it'll kill us all!\"\n\n\nThe Oalkwardners scatter in all directions, screaming.  But there's no time to worry about them, you keep going, still calling for a doctor.  A minute of this and the alarm sounds once more, cutting through the air. Still you search, frantically, for someone to help you.  Then, you round a corner and come face to face with a wall of spears. The Watchmen of Arrorn have come to stop you, thinking you're a monster.\n\n\nBefore they can attack, you kneel and lay the Oalkwardner in your arms at their feet.\n\n\n\"I didn't do this.\"  You say, \"You have to help her, she's going to die!\"\n\n\n\"Why should we believe you, monster?\"  One of the watchmen asks, \"For all we know, you're responsible for all the disappearances.\"\n\n\n\"Why would I come here if I was the one who did this?\"  You ask, \"What, do you think I'm stupid?\"\n\n\n\"I don't know,\"  the watchman says,  \"I don't make a habit of dealing with monsters.\"\n\n\n\"Enough of this!\"  A voice from behind the line of Watchmen startles everyone.  \"Clear a path, you idiots! This is no monster, but an acquaintance of Merk!  He spoke to this creature just this morning and determined it was no threat!\" The Watchmen part to reveal an especially wrinkly Oalkwardner. \n\n\n\"I found her on the path!\" you say, \"She's from the search party that went out after Merk's kid, but I think something went wrong!\"\n\n\nThe wrinkly Oalkwardner takes one look at the wounded creature at your feet and gasps.  \"Never, in all my years as an elder... I can treat her, but we must get to my office quickly.  Come on, I need you to carry her, it'll be quicker that way!\"\n\n\nYou scoop her up and follow without a word.  The elder's office is on the edge of the town square, (Which, thank goodness, is pretty close).  It's bigger than some of the other buildings in the town, so you can just squeeze inside.  \n\n\n\"Set her down here!\"  he says, sweeping the contents off a table in the middle of the room in one motion.  You obey, and the elder gets to work without another word, it's as if he's forgotten you're even there.  For a while you stand there awkwardly, watching as the Elder stitches up the wound. What if he needs you for something?  He probably won't but even still, you'd better stay put.\n\n\nSurprisingly, the operation takes only a half hour.  After the Elder finishes bandaging the wound, he looks up at you.  \n\n\n\"Thank you, human.\"  He says, \"We are in your debt.  You may leave if you wish, but-\"\n\n\nThe injured Oalkwardner moans on the table, cutting him off.  \"They're gone... Dead, all of them.\" Her eyes are open, and they're staring straight at the elder.\n\n\n\"What happened?\"  You demand, perhaps a little too swiftly.\n\n\n\"Don't pressure her, she just woke up,\" The elder says.\n\n\n\"No, I'm okay,\"  she says, wincing, \"But they're not.\"\n\n\n\"If you feel you have the energy to talk, please go on,\"  The elder says, \"I would like to know more about this myself.\"\n\n\n\"We were tracking... the kidnapers.\"  She says, \"But... they found us. A whole hoard of them.  There was some kind of talk of a base... said they were gonna... overthrow the king... but no time... to pay attention...\"  Her ears droop, \"And... they killed... I was... only one...\" Her eyes roll back in her head and she passes out.\n\n\n\"My word!\"  The elder says, rushing to her side and taking her right ear in his hand, \"She'll be alright once she gets some rest, but you should probably head outside for now.  We must make preparations for a funeral for those who were lost. Do you have anywhere to go?\"\n\n\n\"I set up camp just outside the village,\" you say, \"I'll be alright, just tend to her.\"", "action_results": [{"action": "The funeral", "result": "After word gets around about how you helped save that Oalkwardner girl, the villagers seem to trust you enough to allow you to roam the city without sounding any alarms.  Over the next few days, you help with preparations for the funeral, in part because there's nothing better to do, but also because you feel a little bad about not helping Merk with his search.  Who knows?  Maybe you would've been the difference between his life and death.\n\n\nWhen the day of the funeral rolls around, the entire town gathers in the square.  It's the most extravagant display you've ever seen in your short time at the village, with tons of food for all and more flowers than you've ever seen in one place before.  It must've cost a fortune in... whatever these guys use as currency.  Merk must've done quite a lot to help the community, because there sure are a lot of drooping ears.  (Which, you've learned, is the Oalkwardner's equivalent to crying).\n\n\nYou stand at the edge of the crowd, still not quite feeling like a part of the community, as the Elder gives a speech.\n\n\n\"We are gathered here today to commemorate the life of Merk, Gertra, and Silia, three of the greatest-\"\n\n\nA pounding in the distance interrupts the speech.  The whole crowd turns towards the source of the noise just in time to see a whole procession of Oalkwardners dressed in the brightest reds and yellows, all riding creatures like ponies, but with little spines running down their back instead of manes. They beat on little drums, all in sync.\n\n\nThe Oalkwardner at the front of the pack raises her arm and raises her voice.  \n\n\n\"Presenting, the great Yelgar, Grand Protector of Realgna and the surrounding country!\"  \n\n\nThe Drummers beat their drums faster and faster now, parting to allow a carriage to pass through, drawn by three lizard-like creatures, the size of bulls.  The crowd parts for the carriage, and it stops right in front of the stage.  \n\n\nThe door on the side of the vessel opens, and out hops a rather tall Oalkwardner wearing a red cape and strange, red bracelets spiraling around the entirety of his forearms, like snakes.  \n\n\n\"People of the village of Arrorn!\"  He says, \"I have come with grave news.  It truly is a shame to interrupt such a lavish funeral, but there are more important matters at hand.  It has come to my attention that there is a base of Rebels in the area, planning to overthrow the kingdom and estate a blasphemous 'new order.'  These are the very same rebels that killed these three!\"  He gestures at the paintings of the three fallen Oalkwardners, set on easels on the stage.  \"We must act now, lest our glorious empire be overthrown.  Outside this village is the seventy-third division of the King's army, sent to protect this village and take out the Rebel scum in our midst!  It is for this reason, that the King and I felt the need to impose martial law on this village and the surrounding area!  We will also be tripling the tax to sustain our troops.  And we'll be taking all this lovely food you've set out for the funeral.  Desperate times, desperate measures and all that.\"\n\n\nA cry of protest comes from deep within the crowd.  \"You're already taking three quarters of everything we have!\"  A female Oalkwardner pushes her way to the front of the crowd to confront the Yelgar.  \"We can barely survive as it is!  And that food for the funeral is the last of our reserves, we only took it out in the first place because Merk and the others did so much for us in their lives!\"\n\n\nYelgar stares her straight in the face.  \"I understand your concern.\"  He says, \"But as I said, desperate times, desperate measures.  Guards, restrain her!\"  Two of the horsemen hop off their steeds and grab the girl by the arms, forcing her to her knees.  Yelgar raises his hand, and slaps her across the face, and the crowd gasps.\n\n\n\"Do not question the authority of the Crown.\"  Yelgar says, still deathly calm, \"Or you might wind up like them too,\"  he nods towards the paintings.\n\n\n\"Who gives a crap about the Crown?  We're all gonna die anyway under your 'martial law', so may as well go out fighting!\"  The girl glares at Yelgar, as the whole crowd seems to hold its breath.\n\n\n\"I see how it is,\" Yelgar says, clearly disappointed.  \"Then let this be an example to anyone else who thinks of dissenting.\"  He reaches beneath his cloak and pulls out a wooden knife, raising it above his head to strike at the girl, now trembling in the guards grip.\n\n\n\"C-come on,\"  the girl says, voice faltering,  \"They can't stop all of us!  I say we finish what those rebels started!\"  \n\n\nStill, no one moves.  The whole thing reminds you, once again, of the girl in the forest the night you woke up.  The guilt of leaving her behind wells up within you, are you really gonna let it happen again?", "action_results": [{"action": "Heck no I'm not letting that happen again! Attack Yelgar!", "result": "\"Hey, stop!\"  You cry, before you can think of anything cleverer to say.\n\n\nEveryone turns towards you, shocked.  Even Yelgar raises an eyebrow. Before anyone has the chance to grab you, you rush towards Yelgar, and his eyes go wide.\n\n\n\"What are you?\"  He cries, dropping the knife to the ground with a clatter.  \n\n\nYou don't answer, just slam your foot into his face, full force.  He goes flying into the side of the carriage and crumples to the ground, dead.  Holy smokes, did you actually just do that?  How the heck did you do that?  But there's no time to think about it now, a few of the other guards are just realizing what's happened and are charging you.  \n\n\n\"He killed the Grand Protector!\" one of them shouts,  \"Stop him before he does any more damage!\"\n\n\nYou should probably run, but something stops you.  So, you tense up, and get ready for battle. Soon as the first horseman gets close, you swing at him with everything you've got.  He goes flying off his steed, tripping up one of the others.  \n\n\nThen it's rinse and repeat for the whole fight.  You find, to your surprise, that you're extremely strong compared to the Oalkwardners.  With every swing, you take out another guard, and a few from the crowd cheer. But now more of the guards are waking up to what's happening, and they begin to encircle you.  There's no way you can beat them all, no matter how strong you happen to be in comparison. Before you have time to react, you're surrounded. They all point their spears your way, slowly closing the circle now that they know they've got you cornered.\n\n\nFrantically, you look around for any sort of weakness in their wall of spears.  But you can't seem to see... wait, there! One of the guards is a little further forward than the others, and smaller too.  If you attack him, then maybe you can stay out of reach of those spears.\n\n\nIt's a split second realization, and you act on it, charging the guard and tackling the pony out from under him.  (That way, you stay out of reach his spear too). You don't stop to look at the damage you've caused; they'll be after you in seconds!  So, you dash towards the edge of the village. Even though it's only been a few days, you've already got a rudimentary knowledge of this village's layout, which is much more than the guards have, (seeing as they've only been here for an hour, tops.  \n\n\nYou quickly manage to lose your pursuers in the twists and turns of the city, but that doesn't mean you're stopping.  You don't slow down till you've made it out of the city, and left the buildings far behind. This is a different path than you've taken before, so it's a good thing you've already got most of your stuff with you.  No chance you'll be able to swing by your little campsite on the way out. So that means you'll have to do without the sleeping bag and pillow you left there this morning. Hope you like sleeping in the dirt.\n\n\nSpeaking of camping, the field surrounding the village is dotted with Oalkwardners in the same red and yellow cloaks of the other guards, setting up tents among other things.  Luckily, they don't notice you, and you soon find yourself in the forest once again. It's only then that you allow yourself to slow to a walk. You feel a little sad about leaving Arrorn, even if you never felt like you truly belonged there.  There's no way you'll ever be able to return, at least, not for a while.", "action_results": [{"action": "Wandering in the woods", "result": "For the next few days, you continue on the path, surviving on nothing but the supplies left in your bag.  You're almost out of Cheez-Its, so you'll have to find another village soon or you might starve.  No one comes after you, probably because you took out their leader.  No-one to give orders.  Still, you move quickly as you can, just in case they are still after you.\n\n\nOn the third night, you veer off the path a little to find a nice place to sleep.  You've given up on finding something even remotely comfortable, (as your aching back won't let you forget).  What you're really looking for is something concealed, so if anyone tries to find you, they'll just walk right past without noticing.  Tonight, you're lucky.  There's a shallow divot in the ground, just big enough for you to spend the night in.  All you've gotta do is cover it with leaves and sticks, and you're set.  \n\n\nThe sun hasn't even finished setting by the time you finish, so you sit on a nearby rock and pull out your last bag of Cheez-Its and stare at it.  If you eat them now, you'll go to bed hungry, but be hungry in the morning,  but if you wait, you're not sure you'll even be able to sleep due to the hunger pains.\n\n\nThe snapping of a twig behind you breaks you out of your thoughts.  You turn around, just as something, you're not sure what, slams right into you!  It sends you toppling off the rock and into the dirt on your back.  Before you even have the chance to comprehend what's happening, you find yourself staring into the eyes of a raggedy Oalkwardner, standing on your chest and pointing a spear at your throat.\n\n\n\"I wouldn't try to escape, if I were you.\"  The Oalkwardner says, \"You may be strong, monster, but I'm certainly quick enough to drive this spear right through you before you have the chance to take a single swing at me.\"\n\n\n\"What the heck is this?\"  You ask, a quaver in your voice.  \"Where did you come from?\"\n\n\n\"The King sent me after you.\"  The Oalkwardner says, \"They call me Kralmer, I'm one of the greatest bounty hunter's this side of the water-pit.\"\n\n\n\"So you're a filthy mercenary!  You kill people for what... money?\"  \n\n\nKralmer spits out of the side of his mouth.  \"I'm not doing this for money!  The king's holding my family, said he'd only let them go if I took you to him.  It's nothing personal, I assure you.\"\n\n\n\"Well, that sucks,\"  You say, \"But isn't there another way, aside from, you know, killing me?\"\n\n\n\"I wish,\"  He sighs,  \"But the king says bounty hunting is illegal.  That's why he took my family.  I was gonna be executed, but he said he'd grant us a pardon if I brought you to him.  Filthy rat won't follow his own rules.  Anyway, really sorry about this.  I heard what you did back in Arrorn.  Heck, I'd join you if I could.  But I've got my family to think of.  I'll try to make your death swift.\"  With that, he raises his spear to deliver a killing blow.\n\n\n\"Wait!\"  You cry.\n\n\n\"What?\"  Kralmer says, sounding impatient,  \"Look, I don't like this any more than you do, so may as well get it over with.\"", "action_results": [{"action": "\"Don't I at least deserve a fair fight?\"", "result": "Kralmer pauses for a moment and thinks.  Your heart pounds as you watch him, hoping against hope that he's honorable.  \n\n\nHe sighs and says,  \"Why do ya gotta make things so complicated?\"  And he leaps into the air, landing about ten feet away from you.  \"I guess you have a point.  This way, I at least don't have to feel so bad.  Stand up now, I guess we'd better do this.\"\n\n\nYou stand up, feeling just a little bit relieved.  But the danger's not over yet.  You've still gotta fight him.\n\n\n\"Monster,\"  Kralmer says,  \"Just promise me this.\"\n\n\n\"What?\n\n\n\"Show me no mercy.  On the off chance you beat me, I'd rather not have to face my family to tell them... I've failed.\"  \n\n\n\"Well... okay.\"\n\n\nKralmer readies himself.  \"Now... are you ready?\"\n\n\n\"I suppose I am.\"  Your palms are slick with sweat.  \n\n\n\"Right then.  Now fight!\"  \n\n\nBefore the words have even left his lips, he's already flying through the air towards you, faster than you could've imagined possible.  There's no time to put up any sort of defense before he smashes right into your head, his spear penetrating straight through your right eye.  The pain is so great, you hardly notice as you fall to the ground, or Kralmer's whispered apology as the world fades around you.\n\n\nWell, that ended quicker than expected...", "action_results": []}, {"action": "\"What if we figure out a way to get your family back without me dying?\"", "result": "Kralmer lowers his spear ever so slightly.  \"What, you got some kind of master plan that'll get the king outta the way?\"\n\n\n\"Well...\" you say slowly, your mind racing.  You've got a half formulated idea already, if only you had more time to think...  \"Don't you get an audience with the king or something?  To show him my dead body?\"\n\n\nHe thinks for a moment.  \"I suppose, but if you're thinking of trying anything, you best be aware that the king is heavily guarded.  And he wears this enchanted armor, made by his dark sorcerer, Maeldral.  While it's on, he's practically immortal!  That's why no-ones ever, you know, killed him before!\"\n\n\n\"But it must have some kind of weakness, don't you think?\"\n\n\n\"I dunno... his Maeldral might have something in his notes or something, but I have no idea where he'd keep something like that.  I mean, that's really dangerous knowledge.  I'm sorry, but I have to kill you.\"\n\n\nHe raises his spear once more, ears drooping.\n\n\n\"But I'm super strong, remember?\"  You say, \"At least compared to you guys.  If we find a way in, I can take out the guards.  I took out fifteen or so of the king's men just the other day in Arrorn.  Then you won't have to kill me, because your family will be safe!  I could go after the king by myself, if you don't want to get tangled up in all this.\"  \n\n\nHe seems to think it over for a moment.  Then, he sighs and steps off your chest.  \n\n\n\"Stand, monster...\"  Kralmer says, \"I'll accept your terms on the condition that we break my family out before anything else.  And after that, you're on your own.  I have my family to think of.\"  He's quiet for a moment.  \"You're lucky the king has a reputation for making bad deals.  I'm not the first to be roped into something like this by that soggy bag of water, and from what I've heard, he doesn't always follow through.  I certainly hope you're more honorable than he is.  Now, let's find a better spot to camp.\"", "action_results": [{"action": "To the palace!", "result": "Thankfully, Kralmer has enough food for the both of you, so you go to bed with a full stomach.  But you just can't get to sleep.  After a half hour of tossing and turning in the dirt, you sit up and take inventory of your supplies, (for lack of anything better to do).  It's then that you remember the strange disk you found on the night you first woke up in the woods.  You must've forgotten about it after seeing the kidnapping.  It's been in your bag this whole time, waiting to be rediscovered.\n\n\nYou take it out and examine it.  Something about it tugs at your memory, but you just can't place it.  For a while you stare at the screen, flashing \"insufficient power,\" over and over in red.  Tapping at the screen does nothing, and there are no other buttons to speak of.  On the other side is some kind of clear plastic tank, with a little bit of green fluid sloshing about inside.  You can't make heads or tails of it.  Soon, you're fast asleep, the disk resting on your chest...\n\n\n \n\nYour dreams that night are filled with visions of the disk.  You see yourself putting it together, building it, tweaking it.  It's the most important thing you've ever created, more important than your family, your friends, the outside world.  The disk consumes your entire life, you work on it day and night.  And then, one day, there's no more work to be done.  You fill the tank with the green liquid, harvested from the core of a meteorite, tap the screen a few times, and suddenly find yourself surrounded by a brilliant, violet light...\n\n\n \n\n\"Wake up, monster!\"  \n\n\nYou open your eyes to the sight of Kralmer's wrinkly face.  \n\n\n\"Eat something, we've got a long trek ahead of us.\"  he pushes a bowl of black goop into your hands and walks a few paces away as you attempt to choke it down.  \n\n\n\"So,\"  he says as you finish,  \"You're still here.\"\n\n\n\"Yup,\"  you say, running your tongue over your teeth to get the last little bits of your breakfast off.  \n\n\n\"You really are honorable then...  I suppose I should call you something other than 'Monster.'  What are you anyway?\"\n\n\n\"I'm a human,\"  you say.\n\n\n\"Good to know, human,\"  Kralmer grins,  \"Now, like I said, we've got a long ways to go, so let's get going.\"\n\n\n \n\nFor the next two days you walk on, stopping only to sleep.  \n\n\nOn the evening of the second day, Kralmer says \"Look! It's just over this hill,\" and dashes ahead.  You follow, quick as you can.  When you crest the hill, you can just see the outline of some sort of fortress, sitting on a hilltop on the horizon.  \n\n\n\"We ought to make camp a little ways off the trail, and soon.\"  Kralmer says,  \"Just in case some of the King's guard happen to pass.\"\n\n\nYou follow him off the trail and into a nearby thicket.  For a good ten minutes, you push through the brush, covering yourself in all sorts of scratches.  Finally, you come to a clear spot, right at the heart of the thorn bushes.\n\n\n\"There,\" Kralmer says,  \"No way they'll think to look here.  Now, we'd better come up with some kind of plan before we get any closer.\"\n\n\n\"Do you know if there are any secret entrances?\"  You ask.\n\n\n\"The only way in, so far as I know, besides the front gate would be through the moat.  It runs right through the dungeon, so the king can drown his subjects in it.\"\n\n\n\"Great!\"  you say,  \"We'll swim in that way!\"  \n\n\n\"Swim?\"  Kralmer asks,  \"What does 'swim' mean?\"  \n\n\n\"You've never heard of swimming?\"  You ask,  \"You know, where you paddle to stay afloat in the water?\"\n\n\n\"Human, you are far more powerful than I ever could've imagined,\"  Kralmer is clearly awed,  \"We Oalkwardners cannot touch the water.  If we soak in it, it seeps into our skin, making it weaker and weaker, until it simply dissolves into mush.  I imagine it's a horribly painful way to go, hence why our lovely, benevolent King uses it to dispose of anyone who so much as looks at him funny.\"\n\n\n\"My word!  That's why I never found any sort of well in the village!  I had to suck the moisture out of mud to survive!   What do you do when it rains?\"\n\n\n\"I've heard of this 'rain,' you speak of.  Thankfully, such a calamity has yet to befall this land.\"\n\n\n\"But what about all these trees and plants?  How can they grow without water?\"\n\n\n\"I don't know what you mean!\"  Kralmer says,  \"All plants need is a little sunshine and they'll grow just fine.  But we're getting off topic.  The best way to get into the palace may just be for you to sneak in through the moat.\"\n\n\n\"But what about you?  How will you get inside?  What about your family?\"\n\n\n\"I... don't know.  But the moat could be our best shot.  You may have to go in without me.\"\n\n\n\"You trust me that much?\"\n\n\n\"I trust you more than I trust the King, I'll say that much.  There'll be no-one to guide my family out of the dungeon, should you decide to go after the King.  If you feel the need, you can disregard my earlier request for them to be let out first.  Should you manage to take the fortress, you'll then be able to set them free.\"\n\n\n\"Alright...\"  you agree, \"I'll do it.\"  \n\n\n\"Great.\"  Kralmer says, \"We'll think of some kind of meeting point.  I really appreciate this, Human.  You are quite possibly the most courageous creature I've ever met.\"\n\n\n\"You're welcome,\"  you say.\n\n\nAfter a moment of silence, Kralmer says,  \"Well, we'd better make camp.  I have a feeling it's gonna be a long day tomorrow.\"\n\n\n\"You and me both,\"  you murmur, as you stand up to start getting the camp ready.", "action_results": [{"action": "The moat", "result": "You reach the fortress at about noon the next day.  It's really not much of a castle.  Instead of stone, like you would expect, it's made completely out of wood, with a few rickety looking towers poking up from behind the wall. Once you're only about a hundred feet off from the moat, Kralmer stops you.\n\n\n\"Send my family out this way, when you get out.\" He points at a spot where the moat goes under the wood.  \"You see where the water crosses under the wall?\"\n\n\n\"Yeah?\"\n\n\n\"That should take you into the dungeon.\"\n\n\nYou don't say anything.  This is all happening so fast, you're not sure you're ready.\n\n\n\"Thanks again, human.\"  Kralmer says, \"Whatever happens, I'll make sure your legacy lives on.\"\n\n\n\"Right,\" you say, \"Thanks.\"\n\n\nThere's no point in stalling, so you start running towards the moat, fast as you can, so no one sees you.  Once you reach the edge, you don't hesitate to dive right it.\n\n\nThe water is warmer than you expected, and murky.  It's hard to stay afloat with a backpack on, but you still manage to keep your head above the water.  Luckily, it doesn't seem to be flowing in any particular direction, so you have no trouble with current.  You swim for the opening Kralmer pointed out and duck under it.  Suddenly, the sunlight from above is gone.  You're in a sort of dirt tunnel, with just enough space at the top for you to breathe.  It's fairly short, and before you know it, the river opens up into a sort of pool at the edge of a huge underground room.\n\n\nYou swim to the edge of the pool, out of breath.  Are you really this out of shape?  For a moment you sit on your hands and knees, panting.  Then, you look up and get a good look at the wall on the other side of the room.  You suck in your breath.  It's lined with cages, set into the wall, dirty and disheveled Oalkwardner eyes staring out at you from behind wooden... well, they're not exactly bars...  more like fat wooden sticks.\n\n\nIt looks like this part of the fortress is built into the hillside, as half of the walls are wood, and the other half, dirt, hard packed.  \n\n\nThankfully, there are no guards down here, at least not right now.  You need to decide if you're going to free the prisoners now, or wait until after the king is dead.", "action_results": [{"action": "Go after the king first", "result": "\"I'll be back for you all later,\"  you say, as loud as you dare.  \n\n\nThere's an opening in the wall with a spiral staircase going up, so you head through it.  At the top of the stairs is a wooden door.  You can hear voices from the other side, probably guards.  Quietly, you turn the handle and push it open.  Two guards stand on the other side, their backs to you.  They don't notice you, because they just keep chatting about the weather.  You creep closer, and closer, and then you put a hand over each of their mouths and drag them back through the door before they even realize you're there!\n\n\nThey struggle in your grip, but their flailing is no match for your strength.  You carry them downstairs, still covering their mouths, and toss them into the nearest empty cell.  You steal the keys off their belt while you're at it, and lock them inside.  \n\n\n\"What's going on?\"  one of them cries.\n\n\n\"What the heck are you?\"  Asks the other.\n\n\n\"Shut up, both of you!\"  You say,  \"I need to know where the Dark Sorcerer lives.\"\n\n\n\"Why would we tell you that?  You're kidnapping us!\"  the first guard says,\n\n\n\"Because if you don't, you die!\"  You say, slamming your fist against the bars.  \n\n\n\"I'm not talking.\"  The first guard says, crossing his arms.\n\n\n\"Well, I am!\"  The Second one says, trembling,  \"He's in the tower opposite us, at the very top!\"\n\n\n\"What the heck is wrong with you?\"  The first guard says, \"If you tell it that, you're breaking your sacred oath to protect the king!\"\n\n\n\"I'd rather stay alive, thank you very much!\"\n\n\n\"Shut up, or I'll kill you both!\"  You say, feeling a little guilty.  (Threatening lives isn't exactly the most fun thing in the world).\n\n\nThey go quiet after that.  There's no way to know how long they'll stay quiet though, so you'd better be quick.  You head back up the stairs and slip out the door.  Luckily, the courtyard isn't all that crowded, but there are still a few Oalkwardners milling about here and there.  \n\n\nA line of bushes sits in the shadow of the wall, wrapping all the way around, so you crouch behind it to avoid being seen.  As fast as you can, you crawl around the perimeter until you reach the tower the guards were talking about. There's no-one there to guard the door, it's almost too easy.  Quickly, you slip inside and find yourself staring at yet another spiral staircase.  \n\n\nYou take the stairs four at a time, as they're smaller than stairs for humans.  The tower has multiple levels, with rooms branching off on each one, but you don't stop to look in any of them until you reach the very top.  The stairway ends in a trapdoor. You press your ear up against it, but hear nothing. Pushing on the door reveals that it's locked, with the same type of wooden lock that was on the cells in the dungeon.  For a moment, you panic. What are you going to do if you can't get in? It would be a defeat on the whole purpose of this mission!\n\n\nThen, you remember that you stole the keys off the guards you trapped in the dungeon.  Checking over your shoulder to make sure no one's coming, you pull out the wooden key ring and try each one of them on the lock.  The key slides in on the fourth try, and the door swings open freely to reveal something like a cross between a bedroom and a laboratory.  One side of the room has a big table full of all kinds of odds and ends, different materials and chemicals. The other side has a bedroll, woven from grass and stuffed with... well, more grass.  \n\n\nYou start looking around for anything that looks like it might do away with magic armor.  You look through the contents of the table first, but don't find anything remotely useful. (Though, there is a cage of yellow rats on one corner, which is quite entertaining to look at).  You're about to turn elsewhere when you spy something else. Hidden behind a stack of books is a bowl of a strange green substance, glowing slightly in the dim light.  \n\n\nThis is the same fluid that's in the back of the disk you found in the forest when you first woke up!  You pull it out of your backpack to confirm.  Maybe, if you refill the tank on the back, it'll work properly again, and you can find out more about what it does. ", "action_results": [{"action": "Fill up the tank and see what happens", "result": "You pull the disk out of your bag and examine the tank on the back.  There's a little cap you can take off to open it. It comes off in two twists, and you fill it with the goo from the bowl.  As you screw the cap back on, a little beep sounds. You flip the disk over and find that the display at the front has changed.  \n\n\n\"Power Restored.\"  It flashes, \"Ready for dimensional rift generation.  Please set coordinates or choose a preset.\"    \n\n\nTwo options appear on the screen, one reads, \"set new preset\"  and the other simply says, \"home.\"\n\n\nFor a moment, you forget all about your mission.  This thing can send you home? Impulsively, you tap the button, and a message pops up.\n\n\n\"Warning:  Dimensional travel may disrupt certain brain functions, including cognition, memory, and vision.  Continue at your own risk.\"\n\n\nYou hesitate, but curiosity gets the better of you and you push \"Continue\" on the screen.  \n\n\nIt'll just be a short trip, you tell yourself.  Just to jog your memory a little, then you'll come right back.  A violet light envelops you, burning your skin. You shut your eyes as it becomes too intense to look at.  It's like you're spinning, being stretched in fifteen different directions at once. That's about the point at which you lose consciousness.  \n\n\n \n\nThe pain is the first thing you notice.  It feels as though someone's poured an entire vat of hot coffee over your entire body.  Somehow, you get the sense that you've been asleep a lot longer than normal.  You open your eyes to an overcast, gray sky.  You're laying on the lawn of someone's house, in the middle of a quiet suburb.  You sit up and look around.  There's a backpack a few feet away, with a strange disk beside it.  How the heck did you get here?  You try to remember, but find that you simply cannot.  If you really concentrate, you can just remember a strange violet light...", "action_results": []}, {"action": "There's no time for this. Keep looking for the weapon.", "result": "You sigh and leave the bowl alone.  Maybe you can come back here once your mission's over.  There's a book lying on the floor next to the bed that you didn't notice until now.  Its cover is blank, and it looks hand bound. Curious, you pick it up and open it to a random page.  Numerous entries in impeccably neat handwriting fill the pages. Looks like the sorcerer keeps a diary.\n\n\nYou skim the pages, looking for any mention of the king's amour.  A full page drawing of a helmet stops you in your tracks. It's entitled, \"Kingly helmet.\"  The next few pages are the same, full of images of chest plates and gauntlets, different designs and chemical formulas.  It's only when you reach the last page of drawings that you find anything useful. A little blurb at the bottom of the page tells you everything you need to know.\n\n\nIt has come to my attention that this amour, while stronger than anything this world has ever seen, is not infallible. It does not block out liquids, so that a little splash of water might be enough to do our great monarch in.  I must keep this fact a secret, or I fear he may have me executed. Thankfully enough, no one else can so much as touch this water either, so there's little chance of it being used against him. I certainly hope none of our enemies figure out a way to circumvent this, as it could spell doom for the entire kingdom.\n\n\nYou look up from the book.  This is perfect! All you've got to do is lure the king down into the dungeons and push him into the water and you're set!  At that moment, you hear shouts from outside. You rush to the window and look down into the courtyard to see the tiny figures of three guards dragging Kralmer into the courtyard.  Your heart begins to pound.  You have to save him!\n\n\nThen, an idea comes to you.  An idea that might just save Kralmer and everyone else.  You rush down the stairs as fast as you can. When you reach the ground floor, you open the door to the outside just a crack and peer out.  You can just see the guards holding Kralmer on the other side of the courtyard. Now all you've got to do is wait...\n\n\nA minute later, the king comes out of one of the towers, just as anticipated.  (You know it's him because he's clad in a strange bronze amour, unlike any you've ever seen.  At least, that you remember you've seen). He talks to the guards for a moment, then they all head towards the dungeon.  Quick as you can, you start to crawl around the perimeter, behind the bushes, towards the same place.\n\n\nYou reach the door to the dungeon just as the king and his guards enter, and wait a moment to let them get a little further ahead.  Then, you go in after them. As you sneak down the stairs, you can hear their voices.\n\n\n\"What happened?\"  the king shouts.\n\n\n\"We were trapped by a monster!\"  \n\n\nYou jolt a little.  You'd forgotten all about the guards you trapped in the cell!  The king must've found them.\n\n\nAt this point, you've reached the bottom of the stairs, and are peaking into the next room.  The king and his guards are still talking.\n\n\n\"Go sound the alarms,\"  the king orders, \"I've got an execution to oversee.\"\n\n\nIt's now or never.  You dash out into the next room, screaming at the top of your lungs.  Everyone leaps backwards in shock. By the time they regain their footing, you've already scooped up the king under your arm.  He's heavier than most with that armor, but you manage.  \n\n\n\"Let me go or I'll have you executed!\"  he screams, \"Guards, take him out!\"\n\n\n\"Never!\"  you shout, and dive into the pool of water at the opposite side of the room.  \n\n\nThe king shrieks in pain as the water floods through the cracks in his armor.  You turn away, not wanting to watch. By the time you've exited the lake, the king is dead.\n\n\nThe guards stare at you, openmouthed.  You ready yourself to do battle one more time, but then something entirely unexpected happens.  One of the guards in the cage begins to clap. Then the rest of them join in. All the prisoners pick up on it too, until the entire dungeon is applauding.  \n\n\n\"Bravo, monster!\"  one of the guards in the cage says,  \"The rest of us hated him just as much as anyone else.  Now we can all be free!\"\n\n\n\"You have done well, Human.\"  Kralmer says, \"I believe you will go down in history as a hero.  Never before has such a great deed been performed alone.\"  \n\n\n\"Yeah,\" you say, trying not to think about the king's final screams as he died,  \"I guess... I guess it was pretty great.\"", "action_results": [{"action": "Epilouge", "result": "After the king's death, the rebel group that the king was trying to stop steps into the power vacuum and takes over.  They estate a glorious new order in which all of the people share their resources and the government owns the means of production.*  The people are quite receptive to it, as they hated the old order of things and needed a change.\n\n\nThe story of the Human that ended the terrible reign of king Maeldral is passed down from generation to generation, until it becomes legend.  Some say you integrated into their society and are living a quiet life in a village near the edge of the kingdom.  Others think you returned to your own world.  Whatever the answer, everyone agrees that you are a hero.  Thanks to you, the kingdom is much better off.\n\n\n \n\nThe end.\n\n\n*The only reason this sort of Communism works is because they are fantasy creatures in a fantasy world.  Do not attempt in real life, it never has worked out, and probably never will. ", "action_results": []}]}]}, {"action": "Free the people first", "result": "You rush up to the bars of the nearest cage to you.  In that moment, you decide that there's no way you're leaving anyone behind.  If you're taking one, you're taking them all.\n\n\n\"I'm here to save you.\"  You say in a low voice, \"all of you.\"  \n\n\n\"What... are you?\"  Asks the Oalkwardner in the cage, inching backwards.\n\n\n\"I'm a friend, now let me get these bars off the cage.\"\n\n\nYou grip the bars and pull as hard as you can, but they don't budge.  This is real wood, not the Paper-Mache everything else in this place is made of.  You're going to have to find another way to get through it.  Maybe you can steal the keys off a guard or something.  Or maybe...\n\n\nYou sling your bag off your shoulders and go through the contents until you find what you're looking for.  It takes a minute, and for a moment you fear it might have fallen out of your bag.  But no, at the bottom of your bag, lays your lighter, untouched since the night you first woke up.\n\n\nMaybe, you can use this on lock of the cell!  Because even that's made of wood, for some reason.  Or maybe you should just play it safe and look for the keys...", "action_results": [{"action": "Attempt to burn through the lock", "result": "Working quickly, you put the lighter up to the keyhole and flick it on.  Somehow, even after you swam through that moat, it still works.  The lock catches instantly, faster than you would've thought possible.  Once again, you grip the bars and wrench open the door.\n\n\n\"Are you a wizard?\" The Oalkwardner asks,  \"What kind of magical power is that?  I've never seen anything like it?  Also, is it going to eat the whole door?\"\n\n\nYou glance once again at the door to see that the entire thing is engulfed in flames.  How is it possible for fire to spread that fast?  Either this is your faulty memory at work, or this wood is different from the stuff back at home.  Even as you think this it's already spreading to the rest of the cell.\n\n\n\"Get out of there!\"  You cry, pulling the Oalkwardner out of the flaming cell.  \n\n\nThe fire is spreading quicker and quicker.  Before you even manage to take so much as two steps back, the entire wall is in flames.  The other trapped Oalkwardners scream as they and their cells are consumed in the flames.\n\n\n\"We've gotta get to the exit!\"  The Oalkwardner says, pointing to an opening in the wall, with a spiral staircase just beyond it,  \"Come on!\"\n\n\n\"But what about-\"  You're cut off by a loud crack.  The exit collapses, and sparks fly everywhere.  One of them lands on your Oalkwardner friend, and catches him on fire.  \n\n\n\"Gaahhh!\"  he screams as the flames engulf him, burning him as if he's made of paper.  Your stomach turns at the sight and you look away.\n\n\nAt that moment, the ceiling caves in, and falls right on top of you, killing you instantly.", "action_results": [{"action": "Epilouge", "result": "So, you're dead.  But let's look on the bright side of things, shall we?  After you died, the fire spread to the rest of the palace, burning it completely to the ground.  No one escaped, not even the king and his invincible suit of amour!  Not even his children made it out, so there was no one left to take his place.  No one, that is, except for the rebel alliance the Grand Protector and his army were trying to find.  With the king dead, they sweep in and take power within a month.  They estate a new order, where everyone shares what they have, and the government owns the means of production.*\n\n\nEven you get to live on in the hearts and minds of everyone you saved from the king's reign of terror.  They even erected a statue in your honor!  (Though, it looks nothing like you).  You will be known forevermore as, \"Human, Martyr of the New Order.\"\n\n\nSo, in a way, even you get to live happily ever after.  Everyone, it seems, gets a happy ending.\n\n\n \n\nExcept for all the innocent people you killed in the dungeon.\n\n\n \n\nAnd Kralmer, because his entire family is dead.  He will forever curse your name.\n\n\n*I swear, I'm not communist.", "action_results": []}]}, {"action": "Go find a guard and steal the keys", "result": "\"I'll be right back,\"  you say, turning around.  There's an exit a few yards away, a neat gap in the wall with a spiral staircase behind it.  You head up the staircase as quietly as you can and find yourself at a wooden door. You can hear muffled voices on the other side, probably the guards.  Gently as you can, you turn the knob and open the door. Sunlight floods into the room, blinding you momentarily. Seems the door opens into the courtyard.  Two guards stand on the other side, their backs turned to you, chatting about the weather.  \n\n\nEver so slowly, you inch out the door, getting closer and closer until they're in your reach.  They still haven't noticed you. Then, quick as you can, you grab them, clapping your hand over their mouth.  Before they have a chance to react, you dash back through the door, carrying them with you. Soon as you reach the edge of the stairwell, you throw them down onto the floor below, killing them instantly.\n\n\nYou hurry down the stairs, taking them two at a time.  After making sure the guards are thoroughly dead, you check their pockets for keys.  It doesn't take you long to find them. Strangely enough, they're made of the same wood as the lock.  \n\n\n\"I'm back!\"  you say as loud as you dare.  \n\n\nYou dash to the first door and unlock it, then go to the next, and the next.  Soon, every cell is unlocked, and you're surrounded by a bleary-eyed crowd of Oalkwardners, staring up at you.\n\n\n\"What now?\" one of them asks.\n\n\n\"I'm getting you out of-\"  You start to say, but stop.  Above you, you can just hear the sound of muffled voices.  You put your finger to your lips, and creep towards the exit, where you can hear better.  \n\n\n\"Why is this door open?\"  one asks, \"And where are the guards?\"\n\n\nCrap!  You must've forgotten to close the door behind you on your way back down!\n\n\n\"I thought I heard something down there,\"  Another voice says, \"Let's go check it out, I've got a bad feeling about this.\"\n\n\nThe sound of footsteps coming down the stairs resonates through the whole room.  You ready yourself for a fight as the bottoms of Oalkwardner feet and red and yellow cloaks become visible on the stairs.  \n\n\n\"What on earth?\"  one of them says. They must've seen the dead guards at the bottom.  You don't waste any more time. You charge into the room with the stairwell, screaming at the top of your lungs.  Five guards stare at you from halfway down the stairs, too stunned to move, at least for a moment. You use it to your advantage, bounding up the steps and plowing through the first two before they even think to raise their weapons.  \n\n\nOf course, the other three are a little smarter.  They back out of your reach before you can take a swipe at them, and ready their spears for an attack.  You stop ascending for a moment and assess the situation. They've got the high ground, and their spears are ready.  You may be stronger than they, but a shaft of wood through the heart will still kill you, regardless of who's holding it.  \n\n\nWithout warning, The Oalkwardner in front leaps into the air towards you, ready to bring her spear down on your head.  You leap backwards, nearly tumbling down the stairs, just avoiding what could've been a fatal strike. For a moment, you're both off balance, but you recover first, and drive your fist into her face.  \n\n\n\"Noooo!\"  one of the other Oalkwardners cries, and charges at you wildly.  \n\n\nYou step out of the way just in time, and he trips over his own feet, falling off the rickety spiral staircase to his doom.  That's four down, now where's that last one. You look around wildly, just in time to see the edge of a cloak disappearing through the door at the top of the stairs.  \n\n\n\"Come on!\"  You call down to the prisoners below, \"We have to get out of here, now!  Up the staircase!\"\n\n\nThe prisoners obey, flooding into the room, and starting up the stairs after you.  There are about two dozen in all, not as many as you might have thought, but still a substantial number to herd out of a fortress like this.  \n\n\nAs you lead them out into the courtyard, a high pitched shriek cuts through the air.  It's an alarm, just like the one back in Arrorn! The entire courtyard is in chaos, people running this way and that, guards and civilians alike.  The gateway out is on the other side, about a hundred yards away, sitting wide open. But it won't be for long, even from here you can see guards gathering by the big swinging doors, getting ready to push them closed and trap you inside.  \n\n\n\"Quick, to the exit!\"  You shout, breaking into a run.  Everyone else follows as you weave through the crowd, trying your best not to trample any innocent people.  (If, indeed, there are any innocent people in this place). It looks like you might just make it, until you've made it about halfway across the courtyard.  Seemingly out of nowhere, guards on little ponies, like the ones that invaded Arrorn, flank your band of criminals. Slowly but surely, they're closing in, going ahead of you to cut you off.  If you don't do something fast, you're going to be surrounded.\n\n\nThere's no time to think though.  No time to come up with a brilliant plan.  Before you even quite realize it, there's nowhere left to go.  The guards are in front and behind, to the right and to the left.  You are struck with a strange sense of Deja Vu.  This isn't the first time you've been in a situation like this, it happened back in Arrorn too!  So if you just do the same thing you did before, you'll get out of it just fine.\n\n\n\"Don't stop!\"  You cry, \"I'll clear a path!\"\n\n\nThere's no time to pick out the weak link, so you just plow on forward, attacking the guard directly in your path.  Soon as you get within range of the spears, you leap into the air and drive your foot into the guard's chest.  He tumbles off the horse, screaming, and all the prisoners flow through the gap you've created.  After you've ran a good thirty feet from the circle, you glance over your shoulder to make sure everyone got through.  But to your horror, only about half have made it past the circle.  The rest of the guards have closed in further, getting rid of the gap you created.  More of them have to get taken out if you are to have any hope of saving everyone.  \n\n\nWorse, there are more guards coming from the sides, and the doors are halfway closed.  If you don't get the rest of the prisoners out quick, no-one will make it out at all.", "action_results": [{"action": "Cut your losses and lead those who are left out to freedom", "result": "It hurts more than you could've ever imagined, leaving people behind like this.  But there's no sense in you dying too.  You keep running until you reach the gate and the others follow.  As you pass through it, you notice a few of the Guards coming after you on ponies out of the corner of your eye.  You're about to turn and fight them, when something shoots out from the shadows and knocks the first one off his horse.  Then it takes down the second, and the third!  Kralmer has come to your aid.  \n\n\n\"Let's get out of here, Human!\"  He cries, catching up to you,  \"We've gotta leave the kingdom as fast as we can!  Go somewhere else, where they'll never find us.\"\n\n\n\"Right,\" You say, \"I hope we've got enough supplies...\"\n\n\n\"We'll survive, we can forage if we need to.\"\n\n\n\"Perfect, you got somewhere in mind?\"\n\n\n\"Sure!  I'll lead the way...\"\n\n\n \n\nA week of walking later, you cross the border of the land you were in and into somewhere nicer.  You and the former prisoners integrate into a nearby village.  They all celebrate you as their hero, and come together to build you a nice, human sized house.  After a few months of living there, it really starts to feel like home.  You even get used to the food.\n\n\nAs for Kralmer, his family just so happened to be amongst the half you managed to save.  It's a good thing too, you're not sure he would've forgiven you if you hadn't managed to get them out alive.  You have dinner with him most nights, and the two of you become quite good friends.  \n\n\nThe villagers are happy to have you as part of their community.  After the brave deeds you committed, they see you as their last line of defense.  If anything ever happens, you'll be there to save them.\n\n\nBut that hasn't happened yet.  For now, you've been blessed with some much needed peace...", "action_results": []}, {"action": "Go back and save the rest of them", "result": "\"Go on without me!\"  You cry, \"I'll catch up!\"  You turn and run back to the circle of guards, and knock the first one you reach off his horse.  Then you do it again, and again. By the time the guards realize what's happening, you've already taken out four of them.  \n\n\nThe rest of the prisoners take this as their cue to leave, they rush through the gap you've created and head towards the gate, and as soon as the last of them has gone past you, you turn to follow, but find yourself face to face with even more guards.  You tense for battle once more, and start swinging, taking down as many as you can!\n\n\nBut they're getting smarter.  Instead of surrounding you, they all form a barrier in front of you, cutting you off from the gate.  You try to plow through them as best you can, but as soon as you take out one, another takes its place!  Suddenly, a sharp pain pierces your side. You look over to see a single Oalkwardner, driving a spear deeper and deeper into the side of your stomach.  Then, another pain, this time in your back. You've been stabbed once again!\n\n\nThe pain brings you to your knees, as more and more spears pierce your flesh.  The last thing you see before everything fades to black are the last few prisoners slipping through the door as it closes with a few of the Oalkwardner guards hot on their heels.  Whether or not they survive is in their hands now...", "action_results": []}]}]}]}]}]}]}]}, {"action": "Yeah, I can live with that. This way I get to stay alive, even if I have to live as a coward.", "result": "You want to do something, you really do, but fear paralyzes you.  It's all you can do to look away as the knife comes down.  Even without looking, you know when the knife falls by the gasps of the crowd and the final screams of the victim.  \n\n\n\"Do not forget the events of today,\"  Yelgar says, \"Remain under the crown, lest you meet the same fate as this poor, misguided soul here.\"\n\n\nA wave of nausea hits you, you can barely manage to stay standing.  What kind dictatorship is this?  The village seemed almost peaceful when you first arrived, but now, you're not so sure.  Your thoughts are interrupted when you hear one of the guards say,\n\n\n\"Sir!  What on earth is that?\"\n\n\nYou turn to see one of the taller soldiers pointing straight at you.  Your heart begins to pound.  Now the rest of the guards are looking at you, you can feel their eyes all over you, crawling over your skin like spiders.\n\n\n\"It's a monster!\"  Yelgar cries,  \"Capture it before it destroys the village!\"\n\n\nYou should do something, run, hide, get ready to fight.  But suddenly there doesn't seem to be enough oxygen in your lungs, as much as you gasp.  You fall to your hands and knees, heaving.  Another panic attack?  There's no time for this, you have to escape... but it's so... hard to breathe....\n\n\nBefore you know it, you're surrounded by guards, all pointing spears your way.  They close in so tight that any one of them could take you out in one blow if they really needed to.  Why isn't anyone standing up for you?  They all know you're harmless.  Maybe they're all too afraid to say anything.  \n\n\nThe guards all bring down their spears at once, and you know no more...", "action_results": []}]}]}]}]}]}]}