{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=56501", "context": "", "first_story_block": "These stories occur within a set time limit where the reader has to solve the mystery by asking the right questions to the right people and looking in the right places for clues (and recognizing the importance of some clues over others). The Normal setting for this TIME challenge is 100, if a reader wants an Easier game they can select this feature to be allowed a TIME of 125, for a Harder game a TIME of 75 is given (this isn't recommended for readers reading the story for the first time).\n\nSo Reader, Choose your Difficulty.", "action_results": [{"action": "Easy Difficulty (125 Time Points)", "result": "The Dorset Evening Gazette - 1 July 2000\n\nTRAGIC DEATH ON BLACKSEA ISLAND\n\nThe residents of Poole were shocked to learn this morning of the apparent suicide of Blacksea Island resident Robert Powell, aged 15. Powell and his mother Olivia Powell, aged 40, were volunteers for the National Group and both lived and worked on the Island. Powell, who took the ferry to and from the mainland to attend and leave Poole Grammar School every morning and evening was described by one classmate as a “happy” and “intelligent” student.\n\nIn a statement issued by the Dorset Police Force it was confirmed that “A teenager died during a fall from a clifftop on Blacksea Island sometime between the hours of 10pm and 6am last night. At this time no foul play is suspected as the part of the island on which the deceased and his mother were living, known locally as “The Wetlands”, is enclosed by a high spike-topped wall and barred gates, making entry by a third party extremely unlikely.\n\nThis paper was able to speak with Barry Guest, owner and operator of the Blacksea Ferry. “I can’t believe it,” he told us in a statement. “Robert was a happy boy and just about the last person I would have expected to top himself. I reckon it was an accident, a fall from the cliffs though Robert would have known better than to go up there at night. I feel sorry for his poor mum, she’s been left all on her own now.”\n\nRobert Powell’s suicide is the third such to happen on the island within living memory: on 25 December 1920 island owner Colonel Augustus Foster shot himself in the Hall of Blacksea Castle and on 5 July 1960 Castle Housekeeper Gwen Green apparently drowned herself in a Lily Pond on the island following a devastating fire on 30 June that had claimed the lives of her husband, butler Jack Green, and the island’s owner, Lord Marcus Van Raalte.\n\nBlacksea Island has a history of death and madness and indeed the eccentricity of a number of the island’s owners, most notoriously “The Mad Doctor” William Benson and the much-reviled Lady Mary Bonham-Christie, who closed the island to the public during her ownership of the island from 1960 to 1980, has done much to bear these suspicions out. This latest suicide is just the most recent in a long line of tragic and unusual deaths to occur on this notorious island.", "action_results": [{"action": "The Mystery", "result": "You lay down the Dorsetshire Gazette for 1 July 2000 (by now, nearly a month old) and stare moodily over the Blacksea Ferry’s railing towards Blacksea Island, squatting like a bug on the gentle sea, its thickly-growing dark green trees clustering together like a wall which, together with the almost total lack of beach beneath the steep cliffs, makes the island and its secrets appear ominously impenetrable. With a sigh you flick open your notebook to a page you have titled SUSPECTS.\n\nSUSPECTS:\nThe ten Resident Volunteers who were actually on the island on the night of 30 June 2000:\nIris Grey (50), Castle Compound Volunteer.\nBarry Guest (40), Ferryman of the Blacksea Ferry.\nGeorge Loader (80), Castle Compound Volunteer.\nGerry Luff (30), Island Handyman.\nFather Patrick Ould (40), Island Priest.\nBill Parsons (30), Island Farmer.\nOlivia Powell (40), Wetlands Volunteer.\nRobert Powell (15), Wetlands Volunteer and Murder Victim.\nArthur Van Raalte (40), Castle Compound Chief Volunteer.\nCharles Whitburn (20), Island Gamekeeper.\n\nYou stroke your finger over Robert’s name. To you it’s not just a name, it’s a friend, a hundred happy memories, an ear in times of trouble and a joker in times of play. He was your best friend in school and given time he might have become more than that. That will never happen now and you want to know why. You KNOW Rob would never have killed himself. You KNOW that. So now you need to find out if his death was accident or murder.\n\nYou suspect the latter.\n\nYour name is Susan Knox and you are a fifteen-year-old amateur detective. You know that your time is limited: the first ferry arrives at the island at 9am and the last ferry leaves the island at 5pm and tomorrow, because of the tragedy, the National Group Volunteers on the island will be moved to another location and a new group will move onto the island: this is your last chance to find out what really happened to your friend Robert.\n\nYou don’t believe either the accident or suicide theories which means it must be murder. There were only nine other people on the island on the night your friend died and as steep cliffs ring the island except in one place where the ferry lands (which is locked up at night) you are sure that his killer must be somewhere on the island. You are determined to find out who it is, how they murdered your friend and why.\n\nAs the ferry bumps alongside the Island’s Quay you rise to your feet alongside the other tourists who visit the island daily. As you climb off the boat with the others you reflect that time is short and you have to search everywhere and talk to everyone to find the clues that you need to solve this mystery so that you can confront the staff of the island when they gather together to leave on the last boat.\n\nYou owe it to the memory of your best friend to find the person who killed him.\n\nNOTE: YOU MIGHT FIND IT USEFUL TO PICK UP THE LIST OF SUSPECTS TO REFER TO IT IN THE FUTURE. TAKING NOTES OF YOUR OWN WOULD ALSO BE A GOOD IDEA.", "action_results": [null, {"action": "The Quay", "result": "You find yourself standing on the island’s wooden Quay, the Blacksea Ferry tied up and bobbing alongside on the gentle swells of the sea. The Ferryman Barry Guest, a weathered brown-bearded man in a sailor’s cap is sitting on one of the passenger seats with his feet up reading a newspaper. Otherwise there is no one else in sight. Looking towards the island from the Quay a metal gateway in a high metal fence leads into the Castle Compound, dominated by the great grey-stone Blacksea Castle towering over some smaller buildings. As miniscule particles of sea spray makes contact with your bare arms and legs you shiver and wish you were wearing more than a shirt and shorts. Now you wonder what to do first.", "action_results": [{"action": "Talk to Barry Guest", "result": "“Excuse me,” you call out to Barry the Boatman. He glances up from his newspaper with a good-natured smile.\n\n“Boat’s not leaving for another ten minutes love.”\n\n“It’s not that, I was wondering if I could ask you some questions?”\n\n“How can I help you, young lady?”\n\nYou pause suddenly, wondering what to say.", "action_results": [{"action": "\"Is it true that someone died on this island recently?\"", "result": "Barry frowns at that.\n\n“Ah yes, young Robert. Sad business that and totally unexpected. He fell off the cliffs up near his home in the Wetlands. They’re treacherously steep so you mind you don’t go near the edge Miss. I feel sorry for his poor ma. It’s hit her hard as you could imagine it would and between you and me she likes a spot of the old drink a bit too much. Bad business all round I’d say. Why did you ask?”\n\n“No reason,” you say quickly “Just remember reading something about it.”\n\nBarry makes a sound of agreement and looks at you expectantly.", "action_results": [{"action": "\"Is there any way of getting off this island after the last ferry leaves?\"", "result": "Barry laughs cheerfully.\n\n“No dear, best be down here by 5pm or you’ll be in for an uncomfortable night – usually I’d say you could stay with the residents but they’re all leaving too. You see that gate at the end of the Quay? That and the whole fence with it is electrified at night, a gift from the late Lady Christie god rest her soul. She couldn’t stand the idea of people coming on her island without her knowing it so she installed that. After I lock that gate at 5pm the generator kicks in and with the cliffs nigh-unclimbable, you wouldn’t be getting on or off this island until I come back at 9am tomorrow.”\n\nYou study the electrified fence thoughtfully.", "action_results": [null, {"action": "\"How long have you worked on this island?\"", "result": "Barry rubs his beard thoughtfully at that question.\n\n“Depends what you mean by work young lady. I first starting helping my grandpa run this ferry when the arthritis in his hands got bad, I guess that was in about 1975. We used to make the monthly grocery runs for Lady Christie, now she was a strange one, very unusual lady. Used to make us unload everything on the Quay and come and get it when we were gone, in five years I couldn’t have spoken to her more than a dozen times. After she passed on in 1980 the National Group kept me on after my grandpa retired and I’ve been making the runs ever since.”\n\nHe smiles proudly.", "action_results": [null, null, {"action": "Wish him good day and walk into the Castle Compound", "result": "You walk into the Castle Compound which is really a small walled square with gates to the west and east leading into the island and to the Quay respectively. Gravel crunches underfoot and the smell of the sea fills your nostrils as you glance around: the imposing grey stone of Blacksea Castle dominates the entire southern side of the square while two smaller buildings: a Museum and a combined Gift Shop / Café fill up the northern side. In the middle of the square is a sign reading WELCOME TO BLACKSEA ISLAND. Apart from yourself the square is empty.", "action_results": [null, {"action": "Go west into the island interior", "result": "You walk down a path that leads to a crossroads on the east side of the island. It is signposted: “East to Castle and Ferry, North to Wet Lands and Villa, South to Clifftop Walk and West to Main Street.” Between the West and South paths stands Blacksea Church, a beautiful stone building with a path leading to it, the path passes through a small cemetery that contains several graves. Your heart gives a painful twinge as you realize that this is where your friend Robert is buried.", "action_results": [{"action": "Walk towards Blacksea Church", "result": "Outside Blacksea Church, the path passes from the Church to the Crossroads through a low stone wall which encircles the church and the graves inside: you recognize the graves of Colonel Augustus Foster, William Waugh, Lord Marcus Van Raalte, Lady Mary Bonham-Christie, Jack Green, Gwen Green and your friend Robert Powell, for some reason both Foster and Gwen Green’s graves stand side by side outside the stone wall while all the rest are within its boundaries. Through a window you can see a middle-aged Priest in vestments talking to some tourists.", "action_results": [{"action": "Examine Augustus Foster's Grave", "result": "You read Foster’s grave:\n\n“COLONEL AUGUSTUS FOSTER OF HIS MAJESTY’S NINTH NORTHUMBERLAND FUSILIERS, DIED BY HIS OWN HAND ON BLACKSEA ISLAND, 25 DECEMBER 1920.”\n\nYou consider the plain stone slab for a few moments and then turn away.", "action_results": [{"action": "Examine William Waugh's Grave", "result": "You read the brief but bitter inscription on Waugh’s grave:\n\n“WILLIAM WAUGH, 1895-1940. FAILED AT EVERYTHING HE TRIED.”\n\nThe words seem blunt and harsh and you suspect they were chosen by Waugh himself.", "action_results": [null, {"action": "Examine Marcus Van Raalte's Grave", "result": "You examine the inscription on Marcus Van Raalte’s rather ornate, marble, tombstone.\n\n“LORD MARCUS VAN RAALTE, BORN 7 JANUARY 1900, DIED IN TRAGIC CIRCUMSTANCES 30 JUNE 1960. REQUIESCAT IN PACE.”\n\nYou look at the pristine grave with fresh flowers at its base for a few moments more before moving on.", "action_results": [null, null, {"action": "Examine Jack Green's Grave", "result": "You examine Jack Green’s grave:\n\n“JACK GREEN, BORN 4 APRIL 1929, MURDERED 30 JUNE 1960. A WONDERFUL FATHER, A FANTASTIC HUSBAND AND A LOYAL SERVANT.”\n\nYou are struck by the use of the word “Murdered” on the grave as well as also noting that there are fresh flowers in a basket in front of the grave.", "action_results": [null, null, null, {"action": "Examine Gwen Green's Grave", "result": "You examine Gwen Green’s grave:\n\n“GWEN GREEN, BORN 10 SEPTEMBER 1930, DIED BY CHOICE ON 5 JULY 1960. REUNITED WITH HER BELOVED JACK FOREVERMORE.”\n\nAs with Jack Green’s grave there are fresh flowers in a small basket in front of the tombstone.", "action_results": [null, null, null, null, {"action": "Examine Mary Bonham-Christie's Grave", "result": "You examine Mary Bonham-Christie’s simple grave:\n\n“MARY BONHAM-CHRISTIE, BORN 27 MAY 1899, DIED 4 MARCH 1980. RECLAIMED BLACKSEA ISLAND FOR NATURE, NOT HUMANS.”\n\nThe words are ringed with engravings of animals and flowers.", "action_results": [null, null, null, null, null, {"action": "Examine Robert Powell's Grave", "result": "You stand sadly before your friend’s grave.\n\n“ROBERT POWELL, BORN 4 FEBRUARY 1985, TAKEN BY THE ANGELS 30 JUNE 2000. REST IN PEACE.”\n\nYou stare sadly down at the wreathes of fresh flowers lying in front of the grave, remembering Robert’s smile, the way he used to make you laugh with his imitations of your teachers and all the special times that you had together. “I will find the person who killed you,” you whisper to your friend. “I will find who did it and why and how and I will prove it all.”\n\nYou feel that somewhere, somehow, Robert is looking down on you and smiling.", "action_results": [null, null, null, null, null, null, {"action": "Go into Blacksea Church", "result": "You walk into the church and look around. It is a smart but plainly furnished building with rows of pews leading up to a raised platform on which stands an alter and some candles. Jesus and the Apostles look down from a stain-glass window which transforms the sunlight into beautiful colours. The Priest, who can only be Father Patrick Ould, nods a friendly greeting in your direction. You quickly think of useful questions you could ask him.", "action_results": [{"action": "\"Can you tell me about this Church's history?\"", "result": "“I’d be glad to,” Father Ould replies. “This Church was commissioned by William Waugh in 1925 and built that year as a place for the workers in his Pottery Factory to come and worship on Sundays. It has seen many funerals over the years but also a few Christenings and one Wedding, that of Jack and Gwen Green in 1950. Nowadays we still conduct Sunday Services which some of the volunteers and a few visitors attend.”", "action_results": [{"action": "\"Why are two of the graves outside the cemetery's walls?\"", "result": "Father Ould frowns slightly.\n\n“You mean the burial plots of Colonel Foster and Mrs Green? Well, because both of them were suicides they cannot be buried on hallowed land so they have been laid to rest just beyond the boundaries of the cemeteries. Foster shot himself n the Castle and Green drowned herself in the Lily Pond close to here. Suicides cannot be interred on holy ground.”", "action_results": [null, {"action": "\"Has anything strange ever happened in this church?\"", "result": "Father Ould chuckles.\n\n“It depends on what you mean by strange. For example, in 1910 Dr Benson claimed to have seen ghosts in the area where the church was later built but alas, it seems the poor man was losing his mind. At night I won’t deny the church does become a little unnerving and there is an ominous feel about the church and the cemetery… I have never seen anything though. Do the spirits of the dead rise up out of the ground by night and flit around the living, unseen and silent, during the day as some would have us believe? Well maybe, but if there are ghosts they are secretive ones.”", "action_results": [null, null, null]}, null]}, null, null]}, null, null, null]}, null]}, null, null]}, null, null, null]}, null, null, null, null]}, null, null, null, null, null]}, null, null, null, null, null, null]}, null, null, null, null, null, null, null]}, null, null, null, null, null, null, null, null]}, null, {"action": "Go north to the Wetlands", "result": "You walk briskly down a sunlit path and soon come to an open gate with a heavy metal bolt in an imposing metal fence with spikes at the top. A sign next to the gate reads THE WETLANDS (EAST GATE). OPEN 9AM-6PM. You know it is in this area that your friend died, somewhere in the marshy northern part of the island. At the gate is a T-Junction, one path goes south through the gateway towards a crossroads you can see while other paths snake off to the east and north.", "action_results": [{"action": "Go North", "result": "You follow the path until it comes to another T-Junction. Paths snake off to the North, West and South. There is no signpost and because of the twisting of the paths and the thick undergrowth you cannot see where they lead.", "action_results": [{"action": "Go North", "result": "You follow the path north until it ends abruptly in a small wooden cabin with glass windows: a hide that is open to tourists and is used to watch the animals, mainly birds, who live in the Wetlands. You rest inside for a moment and then trudge back south towards the Junction.", "action_results": [null]}, null, {"action": "Go West", "result": "You follow the path until you come to yet another T-Junction with paths branching north, east and west. A small white-stone building sits just south of the Junction with the word VILLA engraved above the open door. Happily the junction is very logically signposted and it reads “North to Van Raalte Memorial and Clifftop, East to East Gate, West to West Gate”. You rest for a moment, wiping the sweat from your forehead and considering where to go next, bearing in mind that you are fairly sure that the Clifftop north of here is where your friend died.", "action_results": [{"action": "Enter the Villa", "result": "You step quietly into the Villa to find the ground floor is a Museum of sorts. There are tables inside which are lined with various papers, books and notices identifying them, among the contents is Dr William Benson’s Journal, Colonel Augustus Foster’s Letters, William Waugh’s Financial Reports, Lord Marcus Van Raalte’s Accounts and Lady Mary Bonham-Christie’s Drawings. Sitting despondently behind a desk in the corner is a middle-aged woman staring at the floor. She has a smell of alcohol hanging about her and with a start you realise she is Olivia Powell, Robert’s mother. There is a black and white engraved photograph of a man with a burnt face standing in a field behind her.", "action_results": [{"action": "Read Dr Benson's Journal", "result": "You leaf through Dr Benson’s Journal, which begins with the Doctor describing his journeys around the island examining the plants. One of his earlier entries reads “Found a remarkable book on Plants in the Old Chapel ruins, all in Latin but translatable. Also discovered a number of notes with it (also in Latin) in which the original owner seems much interested in one particular plant. If it grows on this island I am confident I can find it.”\n\nLater the Doctor does appear to find the plant as he writes “Have discovered the black Henbane. It possesses most remarkable qualities when ingested in small quantities, producing pleasant and euphoric sensations. I intend to do much research on it’s medicinal qualities using myself as a test patient.” These tests apparently have an unsettling effect as the doctor’s journal quickly descends into incoherency.\n\nOne typical passage is “Dancing ghosts haunted me again, capering and howling all around me. The world is a bubble and I am the pin”, another passage reads “Flew like a bird again today and sung with the trill of a thousand voices”. His last entry reads “You can play rugby and girls do that with a soft ball and go home after, oh I am a dog called Biscuit and when I am happy I don’t get snappy. Hey ho, the circus is in town but I didn’t invite them, oh, no, no, no. I am the puppet master and the cats came out to play.”\n\nYou put the book down thoughtfully.", "action_results": [{"action": "Read Colonel Foster's Letters", "result": "Foster’s collection consists of twelve letters in a folder apparently written to his fellow officers, either a Major Barrowclough or a Captain Goodall. His writing style is terse and matter of fact but confident, in his first letter he informs his friends “I completed the transference of my personal belongings to Blacksea Castle Sunday last and feel confident I shall be perfectly content in this place.”\n\nLater the Colonel begins to make reference to what he calls “His Shadow” and at one point states “I am determine to ensure that my Shadow does not drag me down and destroy me. I have fought many battles but dealing with this damnably dark misery is the most difficult of all.” He seems more confident in one letter, stating “Had a spot of luck and chanced upon a new restorative which helps me maintain my good spirits and keep the Shadow away.”\n\nThe Colonel’s last few letters mainly concern his worsening depression. “Can’t seem to do a damn thing about the Shadow, even my pick-me-up doesn’t help. I have the most terrible dreams where all those damned Boers are shooting me full of holes and Zulus are cutting me up.” His writing style worsens and his last letter ends with a poignant “I wish to God someone would come up and blow my brains out. I am in hell, hell, hell and everywhere everything is utterly dark.”\n\nWith a frown you return the letters to their folder.", "action_results": [null, {"action": "Read Waugh's Financial Reports", "result": "You read Waugh’s financial reports, which conclude his Annual Transactions with his Gross Incomes and Expenses. The first report, with a starting capital of 100,000 pounds, makes large expenses for the construction of Maryland Village, Blacksea Church and the Pottery but very little income. Though the Expenses reduce in following years it always remains higher than his Income, which never rises above 10,000 pounds a year and usually much lower, and by the time of the last report, in 1940, Waugh has nearly exhausted all his initial funds, having just over 5,000 pounds left of his original investment. It does not make for happy reading.", "action_results": [null, null, {"action": "Read Lord Van Raalte's Accounts", "result": "You glance through Lord Van Raalte’s Accounts from 1940 to 1960 and see that he employed twenty-two people on the Island during his time here, butlers, maids, gamekeepers and boatmen, he also spent large sums constructing the Villa and Hides in the Wetlands and a Hunting Lodge, Gamekeeper’s Hut, Blacksea Farm in the southern half of the island and Living Quarters near the Castle. The accounts end abruptly with his death certificate (his cause of death being Smoke Inhalation) and his last Will and Testament in which he leaves everything to his wife.", "action_results": [null, null, null, {"action": "Examine Lady Bonham-Christie's Drawings", "result": "You examine Lady Christie’s drawings, which are all of either animals or some natural feature, the sea apparently being a favourite theme of hers. There are no people in any of the pictures nor any sign of anything man-made. The drawings are well-done but not terribly relevant to your search so you soon lay them back down.", "action_results": [null, null, null, null, {"action": "Talk to Olivia Powell", "result": "Olivia Powell looks like she is taking her son’s death badly: her eyes have dark shadows under them, her face is pale and drawn and she has the sickly scent of gin hanging around her. She looks up at you with indifference as you awkwardly think what to say.", "action_results": [{"action": "\"Mrs Powell, I was a friend of your son's...\"", "result": "Olivia looks at you with keen interest.\n\n“Susan isn’t it? Robert spoke of you often, he said you were his best friend at school. If that is so then you know as well as I do that my son didn’t kill himself and he didn’t fall by accident from that clifftop. He was pushed. He was friends with everyone here, he would have gone with anyone to the clifftop. They all have keys, any one of them could have let themselves into the Wetlands and into this Villa while I was sleeping and forced or tricked my little boy up to that clifftop to kill him. The spot is just north of here, less than five minutes walk. It’s the closest place they could have chosen to make his death look like an accident or suicide. I don’t know why anyone would kill my angel. He didn’t have an enemy in the world.”\n\nOlivia wipes tears out of her eyes and you swallow awkwardly.", "action_results": [{"action": "\"Mrs Powell, I heard what happened. I'm so sorry...\"", "result": "Olivia looks at you sadly.\n\n“Thank you. I am dealing with it the best I can but it is very hard. I am all alone in the world now, his father left us when he was very young and I can’t trust the other volunteers on this island anymore. I don’t know what I am going to do after I leave this island, I don’t have any family left anymore. It’s terrible to be a woman at forty who doesn’t have a single friend in the world and no family now...\"\n\nYou wish you could say something to comfort her but you can’t find the words, all you know is that identifying her son’s killer could bring the poor woman some comfort.", "action_results": [null, {"action": "\"Who is the man in the photograph behind you with the burnt face?\"", "result": "Olivia glances at the photograph behind her.\n\n“That is my late father Tom Jones. He came here in 1920 when William Waugh built his Pottery and Maryland. He got his face burnt one day when he fell in a kiln in the Pottery, after it closed down he stayed on to work as a gameskeeper for Lord Van Raalte. He left the island in 1960 when Lady Bonham-Christie threw everyone off, moved to the mainland, married my mother and I was born. Unfortunately, he and my mother died in a car crash when I was ten, he was driving home from a bar when he lost control of the car; Mum used to beg him not to drink and drive but he never listened. After I got married I took my husband’s name and decided to keep it after he walked out on Robert and I. As this is the only place where my family has any real history we decided to move here. I thought it would be a good place for Robert to grow up…”\n\nOlivia tales off.", "action_results": [null, null, null, null]}, null, null]}, null, null, null]}, null, null]}, null]}, null, null]}, null, null, null]}, null, null, null, null]}, null, null, null, null, null]}, null, null, null, null, null, null]}, {"action": "Go north", "result": "You follow the path north as it rises steadily before ending suddenly at a cliff edge and a large stone memorial which reads “Dedicated to the Memory of Lord Marcus Van Raalte who did so much to improve this island until his tragic death on the night of 30 June 1960. Dedicated by the National Group.” Near this stone is a second, quite separate memorial where several bunches of flowers and cards with Robert’s name written in them lie in a huddle on the ground.\n\nWith a jolt you realise this is the spot where your friend died.\n\nStepping right up to the cliff edge, the wind causing your long blond hair to dance madly in the breeze behind your head, you look down and see the cliff descends straight down before ending in several jagged rocks just above sea level. Anyone who jumped off this must have known they were certain to die. It is hard to imagine your friend Robert willingly choosing certain death, even if forced or threatened he must have known his chances where better where you now stand. Try as you might you cannot imagine anything that would have compelled him to jump off the cliff and you also find the pushed-off-the-edge scenario hard to believe.\n\n\nChewing your bottom lip you glance thoughtfully around the area, There are several exotic and colourful looking flowers growing nearby but one in particular catches your eye. It is a fairly small plant with green leaves and a dozen flowers with yellow petals and disgusting-looking black pollen. The reason it draws your attention is that several of the flowers appear to have been snapped off but there is no sign of petals or leaves on the ground. It looks a little like some animal has eaten or taken them, but you don't think there are any animals larger than rabbits or squirrels on the island.\n\nAfter a period of silent contemplation you turn your back on the spot where your friend spend his last living moments and head back the way you came.", "action_results": [null]}, null, {"action": "Go west", "result": "Following your path through thick undergrowth, mosquitoes buzzing annoyingly around your bare arms and legs, you come to another T-Junction. Paths wind off through the undergrowth to the west, east and south. There is no signpost.", "action_results": [{"action": "Go West", "result": "You follow the path west until it ends abruptly in a small wooden cabin with glass windows: a hide that is open to tourists and is used to watch the animals, mainly birds, who live in the Wetlands. You rest inside for a moment and then trudge back east towards the Junction.", "action_results": [null]}, null, {"action": "Go South", "result": "You continue down the path and come to a T-Junction, just south of an imposing metal fence with spikes lining the top and a heavy looking bolt on the gate. A sign next to the gate reads THE WETLANDS, OPEN 9AM-6PM. You know the area where your friend died is somewhere in the Wetlands, the marshy northern part of the island. Paths branch away north, east and south, the north path passing through the fence into the Wetlands. A nearby signpost reads \"North to the Wetlands, East to Main Street, South to Maryland and Clifftop Walk.\"", "action_results": [null, {"action": "Go East", "result": "You follow your path quite a long way before arriving a T-Junction in the very centre of the island with paths leading East, South and West while a big, spike-topped metal fence runs along to the north, the ground beyond looking definitely marshy. A nearby signpost reads \"East down Main Street to Blacksea Church and Castle, South down Middle Walk to Clifftop Walk, West down Main Street to Maryland Village.\"\n\nJust to the north, between the Junction and the fence are the ruined walls of a small square-shaped building, the walls ranging in height from one to three feet and signposted \"The ruins of the Old Chapel, circa 1600-1650.\" The ruins are much overgrown with plants and apart from the walls you can't see anything else from the path.", "action_results": [{"action": "Investigate the ruins of the Old Chapel", "result": "You step carefully through the overgrown vegetation around and inside the Old Chapel, plants scratching your legs, and explore the ruins inside the crumbling walls. It doesn’t look like anyone has made any effort to maintain the ruins but under one bush you do find the rusted remnants of a very old spade with the initials WB deeply carved into the wooden handle. There are holes in the groundnear the spade and in one of them you make a startling discovery.\n\nDeep inside one of the holes is a yellowed and dirty bone, surprisingly long, in fact it looks so long it seems impossible that it is an animal bone but looks worryingly like a human bone, possible an arm or leg bone. What concerns you most is that there are extremely visible teeth marks in the bone of what looks like human teeth. Turning it over you also see there are knife notches on the bone. The bone looks centuries old and certainly has nothing to do with your friend’s mysterious death but it is an unnerving discovery all the same. You carefully put the bone back where you found it, wipe your hands on your shorts and walk back to junction.", "action_results": [null, {"action": "Go South", "result": "You continue down your north-south path along a path lined with perhaps the most beautiful flowers you have seen on the whole island and soon come to a simple stone bench with a small sign next to it that reads “The Whispering Seat, built circa 1930. A place for young lovers to come and share secrets”. Looking around you see there is a lot of engravings on the surrounding trees, most of it recent, of the “A loves B” variety. The oldest inscription is simply the words “J and G Forever, Valentines Day, 1960” enclosed in a heart and carved on a tree directly behind the Whispering Seat. The path continues to the north and south.", "action_results": [null, {"action": "Go South", "result": "Following your North-South path you soon come to a small pond just to the east of the path, covered with Lilies. The pond has a beautiful but slightly mournful aspect. A small memorial stone is set next to the pond, engraved on it are the words “Sacred to the memory of Gwen Green who perished here by her own choice on 5 July 1960 following the murder of her husband and best friend Jack Green. Rest in Peace.” You glance at the still, silent waters of the pond and wonder who put this memorial here.", "action_results": [null, {"action": "Go South", "result": "You continue following your path and soon come to a T-Junction, with paths branching off to the north, east and west (steep cliffs leading down to the sea lie to the south). A signpost reads “North to the Old Chapel via Middle Walk, West to Blacksea Farm and Maryland, East to the Lodge, Blacksea Church and Castle.” You glance at each of them wondering which way to go.", "action_results": [null, {"action": "Go East", "result": "You follow your path and soon come to a Lodge sitting at a corner of the path where it branches off North and West, the North path is signposted \"To Main Street\" and the West path is signposted \"Clifftop Walk\" (and does indeed run close to the south clifftops of the island). The Lodge is a small building (you know it is a lodge because it has the word LODGE above the door, everything is logical on this island).\nA man is sitting outside trying to fix a bicycle, which he has partly disassembled, with a variety of tools. His nametag reads Gerry and you realise he must be Gerry Luff, the island’s handyman. You consider approaching him.", "action_results": [{"action": "Talk to Gerry", "result": "You approach the handyman, who is a young, plain-looking man wearing grimy overalls. He nods a greeting in your direction but seems rather absorbed in fixing the bike. You consider your inquiries.", "action_results": [{"action": "\"Excuse me, do you know much about the island's history?\"", "result": "Gerry rubs his grimy forehead with the back of his hand.\n\n“Sorry Miss, history’s not really my area. There’s a museum back over by the castle and I think there’s some stuff down in the Villa in the Wetlands, I know there used to be a Pottery factory further up this path and a village for the workers, but they are both in ruins now. I’m sorry Miss, I’m can't help you much with this.\"", "action_results": [{"action": "\"Excuse me, is it true that someone died here recently?\"", "result": "Gerry nods unhappily.\n\n“Yeah, that poor Robert boy. He was a nice lad, he used to come down here and chat to me a bit whenever he needed something fixed. He never seemed like the unhappy kind to me but then they never do, do they? Still, bit of a shock when it happened. His poor mum must be heart-broken, we haven’t chatted much but whenever we have she seemed a nice lady.”\n\nHe shrugs and glances at his gears and pieces of metal, clearly keen to get back to tinkering about with it.", "action_results": [null, {"action": "\"Excuse me, how many volunteers are on the island?\"", "result": "Gerry runs his oily fingers through his hair.\n\n“That’s a good question Miss, I guess I’ll have to think about that for a minute. There’s Arthur the Chief Volunteer and Iris over at the Castle. There’s Bill who runs the farm and he got the padre and Barry the Boatman staying with him. There’s Charlie the Gamekeeper and Mrs Powell over in the swamps. Oh and old George, not sure where he stays. I guess that makes.. about nine of us? We’re leaving tonight though.\"", "action_results": [null, null, null, null]}, null, null]}, null, null, null]}, null, null, null, null]}, null, null]}, {"action": "Go West", "result": "You walk along the path of Clifftop Walk, enjoying the beautiful weather and lovely views over the sea, when you come up to a building marked Blacksea Farm. A man is out front, sitting on a low wall and eating a sandwich, it doesn’t take much detective work to discern that he is Bill Parsons, the island farmer. You consider whether or not to start a conversation with him.", "action_results": [{"action": "Talk to Bill", "result": "You approach Bill, a youthful looking man with a slightly red face and sandy coloured hair. He bids you good day in a cheerful and unconcerned sort of way and continues eating his sandwich. You think about your questions.", "action_results": [{"action": "\"Have you noticed anything strange happen around the island?\"", "result": "Bill laughs.\n\n“It depends on what you mean by strange young lady. Well, to tell you the truth, things you might call strange seem to happen here more often than you would think. For example, I keep chickens out back but I generally let them roam free, sometimes they get halfway across the island and I need to go and bring them back. A few weeks ago one managed to wander all the way into the Wetlands and when I retrieved it, it was acting half-crazy, trying to fly, running in circles and even into walls. It settled down after a while though... that struck me as pretty strange.”", "action_results": [{"action": "\"Is it true that someone died on the island recently?\"", "result": "Bill’s smile fades.\n\n“Yeah, young Robert Powell over in the Wetlands. He was a nice kid, we all liked having him about the place. It was a sad thing to hear and his mum took it pretty hard but I shouldn’t wonder at that. These cliffs look pretty but it’s a long drop onto hard rocks underneath and I wouldn’t expect anyone to come walking back from that. Truth be told I’ll be glad to get off this island and back to the mainland.”", "action_results": [null, {"action": "\"Who are the other volunteers?\"", "result": "Bill chews a bite of his sandwich thoughtfully.\n\n“There’s quite a few of us about the place. I’ve got the Priest and Ferryman staying here with me, my neighbors Bill and Charlie are just up and down the road, depending on which way you’re coming. There’s old George, Iris and Boss Arthur down by the quay and poor Mrs Powell up in the Wetlands... I guess that makes nine of us Miss.”", "action_results": [null, null, null, {"action": "Head on west", "result": "You stroll down the path, enjoying the beautiful views south across the cliffs, and soon enough you come to another building, a small brick building signposted “Gamekeeper’s Hut”. The young Gamekeeper, Charles Whitburn, (who you notice is fairly good looking) is standing outside the hut splitting woods with an axe. For some reason he has a bemused expression on his face.", "action_results": [{"action": "Talk to Charles", "result": "You approach Charles who stops swinging his axe and nods affably at you.\n“Good day madam, how can I help you?” You find yourself unusually tongue-tied around him and while trying to think of something to say you can’t help but notice his arms and chest look very muscular.", "action_results": [{"action": "\"Has anything strange happened around here recently?\"", "result": "Charlie laughs, a pleasant sound that somehow makes your heart beat faster.\n\n“Well yes, as it happens. I keep a double-barreled shotgun under my bed, as every gamekeeper on this island has done for the last century, but today I went to get it to hand it and the gun license papers over to the next gamekeeper: the papers were there but the gun was gone! It’s true I haven’t used it for a while but it was a few months ago when I used it to put down a wounded bird. I'm sure I didn't put it anywhere else and although the other Volunteers have keys to my hut I can’t imagine anyone taking it. I have to admit, I’m completely baffled and it won’t look very good this evening when I have to report I’ve lost my gun and the shells that go with it.”\n\nYou listen with great interest and at the end of the conversation you assure him that you are sure the gun will turn up.", "action_results": [{"action": "\"Is it true that someone died here recently?\"", "result": "Charlie sighs.\n\n“Yeah. My friend Robert fell or got shoved off a cliff about a month ago. The papers say they think it might be suicide but I got on well with Robert and he just wasn't the sort of boy to do that kind of thing. I find it hard to see how he could have fallen accidentally, even at night, but then again I can’t see why anyone would want to hurt him. This island is a strange place though and sometimes unusual things happen here without much explanation.”\n\nCharlie shrugs good-naturedly and you feel a warm glow inside.", "action_results": [null, {"action": "\"What are the other volunteers like?\"", "result": "Charlie laughs.\n\n“Oh, they’re a good bunch. They’re all a bit older than me but they’re a nice lot. George is the oldest, he’s been here since 1920, or possible 1520, was actually born on the island, and sometimes I think he’s never going to leave. I saw him go by an hour ago heading to Maryland Village to do some work, he used to live there you know. The others are a nice crowd but we’re all moving off tonight and a new group’s coming in.”", "action_results": [null, null, null, {"action": "Continue west", "result": "You continue walking along Clifftop Walk and approach a corner where the path splits off north and east, you of course coming down one of the paths. Just inside the corner is an interesting ruin of a large brick-walled building, identified by a sign as “The Pottery Factory”. You walk inside and but the buildings is overgrown with plants and apart from the crumbling brick walls not much remains. For some reason there are lots of empty or broken gin bottles lying scattered around the ruins, picking one up you see a manufacturing date for 1946, another has 1954 written on it. Someone really liked to drink gin here.\n\nYou stroll back out of the ruins to the main path and contemplate which way to go.", "action_results": [null, {"action": "Go north", "result": "You walk along Clifftop Walk, humming to yourself, when you come across a large ruin just east of the path, or rather lots of small ruins. Some twenty houses in a neat formation both sides of a central street have collapsed in on themselves, only the brick walls remain standing. A signpost identifies the site as “Maryland Village”. Standing in the middle of the central street thoughtfully contemplating one of the ruins is an old man leaning on a walking stick: you quickly realize he is George Loader, the oldest volunteer on the island. The path continues on north and south.", "action_results": [{"action": "Talk to George", "result": "You approach George who turns to face you as you come up.\n\n“Hello there young lady,” he says cheerfully. “Just looking at the house I was born in. I guess I know this island better than anyone else still alive. I can tell you about anything you’re interested in.”", "action_results": [{"action": "\"Can you tell me the history of the island?\"", "result": "George beams.\n\n“Certainly. I was born here in 1920 which was the same year William Waugh built this village and the pottery, my old man worked there for oh... many years and I did my first work there with the other men when I was fifteen. A very decent man was Waugh but unlucky in his investments. The clay was not very good stuff and Waugh never made a lot of money. He became rather depressed and, to be honest, a little strange by the end of his life.\n\nAfter he died along came Lord Van Raalte and he was a real gentleman, he did a lot to help the island. I suppose about half of the other workers, including myself, stayed on and worked for him, I used to run Blacksea Farm for him, that was a long time ago now. Of course all that changed after he and Jack died in that fire… Lady Christie came along and she didn’t like people much. She made everyone leave but I came back in 1980 when the National Group brought the island. Since then I’ve been helping them as much as I can. I keep thinking maybe I should retire but I can never seem to let go of the island. It might sound strange to you but to me this is a magical place. I don't think I could ever leave it.”", "action_results": [{"action": "\"Did you know a man called Tom Jones?\"", "result": "The old man gives a start and gives you a very piercing and unfriendly stare.\n\n“How do you know about Tom?” he asks in a dry voice. Without waiting for an answer he begins to talk and talk. “Of course I knew him. Everyone on the island knew him. I worked alongside him for twenty-five years. I was in the Pottery that day he turned up drunk as a lord, tripped over his own feet and fell into a kiln, burning his face.”\n\nGeorge’s tone becomes thoughtful and he stares into the distance.\n\n“Tom always had a drinking problem. Lord Van Raalte never should have kept him on as Gamekeeper and when he learnt about Tom’s problems he should have fired him but his Lordship was too much a gentleman to do that. Everyone knew that at least once a week Tom would get several bottles of gin delivered from the mainland, take them over to the Pottery and drink them all. He’d sit in those ruins all alone at night drinking and thinking god only knows what.\n\nAnyways, everyone knew he held a candle for sweet Gwen Green and he wasn’t shy about it neither. Her husband Jack was a decent man, and a good mate of mine, but when Tom jumped out and half-tore Gwen’s top off one night when he was in his cups Jack snapped and gave Jones the biggest beating of his life. Three days later Jack and his Lordship died in that fire at Blacksea Castle. Nothing was ever proven but we all reckoned started that fire and he never had no witnesses to prove he didn’t... Everyone who lived on the island at that time, including poor Gwen, felt certain about it.\"\n\nGeorge shakes his head as it to shake away bad memories.\n\n“He left with the rest of us when Mrs Christie took over in 1960. I remember hearing, years afterwards, that he’d killed himself and his wife driving drunk into a tree, left a young daughter behind apparently. He was a disgusting man, ill-tempered, mean-spirited and hateful. I will tell you the truth: I was glad to hear it when he died. What he did to the Greens was unforgivable.”\n\nGeorge seems surprised at the anger in his own voice and offers you an apologetic smile.\n\n“I’m sorry lass. It was all a long time ago, I doubt anyone except myself remembers all that now. I hadn’t even thought about that man Jones for a long time until you mentioned his name just then. Was a bit of a shock to tell you the truth.”\n\nYou mutter an awkward apology.", "action_results": [null, {"action": "\"Did you know Jack and Gwen Green?\"", "result": "George’s face abruptly assumes a very pained expression.\n\n“I knew Jack and Gwen well and there was not a nicer or more loving couple in the world. They were just lovely people. Jack was a butler to Lord Van Raalte and Gwen was a Housemaid, I suppose they first moved here around 1955. They had a young daughter with them too… I can’t for the life of me remember her name. She was a very quiet girl, hardly left their house here in the village. People thought she was a little strange in the head.\n\nOf course, Jack died in that fire at Blacksea Castle in 1960 while trying to help old Lord Van Raalte get through the flames. They reckon the fire was started by a man who was sweet on Gwen and who’d had a fight with Jack over the issue. Gwen was broken-hearted. She drowned herself in the Lily Pond, I remember the day we pulled her body from the water. Me and another man had to wade it to get it, it was as cold as ice and the eyes were all wide open and staring.\n\nSuddenly there was the loudest scream I've ever heard and that little orphan girl of theirs, who was only about ten years old at the time, ran out, jumped on the man everyone reckoned had started the fire and started screaming over and over “When I’m big I’ll kill you, kill you and your whole family the same way you killed mine.” Some of the lads dragged her off but the child was inconsolable, like a wild animal. She kicked and bit and scratched and hit anyone who came near and all night she screamed and sobbed. It was thought that her parents’ death had unbalanced her reason and she was sent to a hospital on the mainland. I don’t know what became of her.”\n\nGeorge shakes his head and suddenly cuffs at his eyes.\n\n“It was such a tragedy. Jack and Gwen were the kindest people you'd ever meet and they didn’t deserve what happened to them. I can never forget the look in that little girl’s eyes as she was dragged off spitting, hissing and writhing like a snake. I’ve never seen anyone so full of hate in my life.”\n\nThe old man shivers a bit and shakes his head again.\n\nYour mind is racing.", "action_results": [null, null, null, null]}, null, null]}, null, null, null]}, null, null]}, null, null]}]}]}, null, null]}, null, null, null]}, null, null, null, null]}, null, null]}]}, null, null]}, null, null, null]}, null, null, null, null]}, null, null]}]}]}]}, null]}, null, null, null]}, null]}]}]}]}, {"action": "Go East", "result": "You follow the path east until it ends abruptly in a small wooden cabin with glass windows: a hide that is open to tourists and is used to watch the animals, mainly birds, who live in the Wetlands. You rest inside for a moment and then trudge back west towards the Junction.", "action_results": [null]}, null]}, null, null]}, {"action": "Go into the Castle", "result": "You step into Blacksea Castle, your feet echoing loudly as they strike the paved stone floor, even though you are trying to walk quietly. On the floor just inside the entrance is a stone with the eerie message:\n\n\"IT WAS ON THIS SPOT ON THE NIGHT OF 25 DECEMBER 1920 THAT LIEUTENANT COLONEL AUGUSTUS FOSTER, LATELY OF HIS MAJESTY'S 9TH NORTHUMBERLAND FUSILIERS, IN A FIT OF DESPONDENCY, PERFORMED THE ACT OF SELF-MURDER BY MEANS OF A SINGLE PISTOL SHOT TO THE HEAD. MAY GOD HAVE MERCY ON HIS SOUL. THIS MEMORIAL STONE WAS DEDICATED BY HIS BROTHER OFFICERS IN MEMORY OF HIS LONG AND DISTINGUISHED CAREER IN THE SERVICE OF HIS COUNTRY.\"\n\nLooking up from the stone you see a marked-off flight of stairs ascending upwards with a sign saying CLOSED TO THE PUBLIC in front of it. Off from the Hall where you are standing, in different directions are four doorways with signs above them identifying them as BATHROOM, BEDROOM, LIBRARY and LIVING ROOM. From the sound of complete silence, it seems like you have the entire castle to yourself at the moment.", "action_results": [{"action": "Walk into the bathroom", "result": "You walk into the bathroom and look around. This is a simple unisex bathroom used by male and female tourists containing the sort of things you usually find in a public bathroom with the addition of a shower in one corner which is presumably used by one of the Volunteers. Unsure what you were expecting to find you sweep hair out of your eyes and behind your ear and step back out into the hall.", "action_results": [{"action": "Walk into the bedroom", "result": "You walk into the Bedroom to find it is a neatly made little room with a bed, table and wardrobes. The walls, originally white, are blackened and scorched suggesting a fire occurred here long ago. You spot a corner of some piece of paper poking out from under the pillow on the bed and reaching down you draw out an old black and white photograph. You examine it curiously.\n\nThe photo shows a family of a man, a woman and a child. The woman wears an old-fashioned maid’s uniform and the man looks quite smart in a suit and waistcoat. Both have happy smiles on their faces. The young child is a girl about ten years old in plain white clothes, she is staring unsmiling at the camera and looks vaguely familiar. Turning the photo over on the back you see someone has written the words “Me, Daddy and Mummy, Blacksea Island, 1960.” You carefully replace the photo where you found it and leave the room.", "action_results": [null, {"action": "Go into the library", "result": "You walk into the Library, a large square room with three walls lined with cluttered bookshelves. A few comfortable chairs and tables are scattered around the room, on the nearest table is a small pile of three books that someone has recently been reading. One is a fairly modern book titled “Animals of Dorset”, one is an old-fashioned looking book titled “Disorders of the Brain” and the last is an extremely old, Medieval-looking, book titled “Herbs and Plants”.", "action_results": [{"action": "Flick through Animals of Dorset", "result": "You glance through the Animals of Dorsetshire, a colourful book filled with information about animals, birds and fish. You don’t see anything much of interest in it and soon put it back down.", "action_results": [{"action": "Flick through Disorders of the Brain", "result": "You glance curiously through Disorders of the Brain, which you see was written by Dr William Benson in 1905. You find that one page contains a bookmark and glancing at it you find it is a passage detailing how the ingestion of poisonous herbs and fungi can induce mental disorders such as hallucinations and irrational behaviour, one sentence that has been circled with a pencil reads “Regular ingestion of the aforementioned plants will render these psychoactive effects more or less permanent and overthrow the rationality of the brain, plunging it into a chaotic state where illusion becomes indistinguishable from reality.” You place the book back down thoughtfully.", "action_results": [null, {"action": "Flick through Herbs and Plants", "result": "You pick up Herbs and Plants and open it carefully, the pages creaking. On the first page you find the words “Winchester Cathedral Press 1550” written in pen in a modern style. The rest is all written in Latin, which you can’t read, but you find a bookmark on a page containing detailed drawings of a plant called Hyoscyamus niger. Beneath this drawing are several depictions of people’s faces, all of which look insane, angry or confused. The flower appears to be quite small with green leaves, white petals and a poisonous-looking black pollen. You put the book back down.", "action_results": [null, null, null, null, {"action": "Go into the Living Room", "result": "You wander into the Living Room to find it is a comfortable looking room with a sofa, TV and table. On the table you find several yellowed newspapers from 1960, all of them with front page articles about a fire that occurred in Blacksea Castle, pretty much here you are standing, claiming the lives of Lord Marcus Van Raalte and his butler Jack Green (ISLAND LORD AND BUTLER PERISH IN FIRE reads one typical headline). Other article clippings deal with the suicide a few days later of Green’s widow Gwen (HOUSEKEEPER DROWNS HERSELF IN ISLAND POOL, HUSBAND DIED IN FIRE FIVE DAYS BEFORE).\n\nAs you flick through the clippings an old black and white photograph of a man with a hideously burnt face falls onto the table. The man is standing in a field, squinting at the camera. Turning the photo over on the back you find the words “Where is Tom Jones?” written in pen and under it, apparently added later, the words “Dead – Car Crash. The Cunt.” scribbled in pencil. Slightly startled by the last word you put the photo back where you found it and leave the room.", "action_results": [null, null, null, null]}, null]}, null, null, null, null]}, null, null, null, null, null]}, null, null, null, null, null, null]}, null, null]}, null, null, null]}, null, null, null, null]}, {"action": "Go into the Museum", "result": "You walk into the Museum, holding the door open for an elderly couple of tourists coming out. The walls are lined with eight chronologically-arranged plaques detailing the island’s history from 1500 to the present while a smiling woman with greying hair stands behind a counter answering the questions of curious tourists. You glance around the Plaques wondering if there is anything useful there:", "action_results": [{"action": "Read Plaque 1: Blacksea Island Origins", "result": "You step over to the plaque and read:\n\n“Blacksea Island in beautiful Blacksea Bay was uninhabited until King Henry VII decided the island would make a useful garrisoned post in 1500 and ordered the construction of Blacksea Castle which concluded five years later. From records it seems a garrison of forty men were posted on the island but they were subsequently withdrawn later for reasons not recorded and the castle and the island were both abandoned to nature once more. The castle is now used as a residence for National Group volunteers.”\n\nBeneath the writing is a diagram of the Castle showing that a ground-floor Hall, Living Room, Bedroom, Library and Bathroom are open to visitors.", "action_results": [{"action": "Read Plaque 2: The Hermit of the Island", "result": "You step over to the plaque and read:\n\n“In 1600 it is recorded that a priest of Winchester Cathedral was banished to the island for “indulging in Black Magic”. It was apparently this Hermit who constructed The Old Chapel, the ruins of which can be found just west of the modern Blacksea Church. Excavation of The Old Chapel have uncovered a number of bizarre and sinister artefacts which support the claim of the Winchester Monks that The Hermit practiced black magic: bizarre screams and strange fires were reported on the island for many years until approximately 1650 when the Hermit of Blacksea Island vanishes from record.”\n\nBelow the writing is a 17th century drawing of the island showing fires burning at different locations.", "action_results": [null, {"action": "Read Plaque 3: The Mad Doctor", "result": "You step over to the plaque and read:\n\n“In 1900 the island was purchased from the Crown by Doctor William Benson, a respected Botanist and General Practitioner of medicine. He converted the ground floor of Blacksea Castle into living quarters and moved his vast collection of exotic plants into the Wetlands section of the island, many of which still grow there today. Sadly, during his time on the island, Dr Benson developed a serious mental illness which led to his forcible relocation back to the mainland in 1910 where he was institutionalised in Bournemouth Mental Hospital, dying of unknown causes later that same year.”\n\nBeneath the writing is a black and white photograph of a rather intense bookish young man wearing spectacles.", "action_results": [null, null, {"action": "Read Plaque 4: The Depressed Colonel", "result": "You step over to the plaque and read:\n\n“Following his cousin’s death in 1910 Edward Benson arranged the sale of Blacksea Island to Lieutenant Colonel Augustus Foster of the 9th Northumberland Fusiliers. Foster, who had served with distinction in the Anglo-Zulu War and the First and Second Boer Wars in South Africa, moved to the island that same year following his retirement from the British Army. Unfortunately, he suffered from depression, and on Christmas Day of 1920 he shot himself in the main Hall of Blacksea Castle. A memorial stone marks the spot where he died and he was initially buried in Poole Cemetery before being re-interred in the cemetery of the newly-completed Blacksea Church in 1930, where his is the oldest known burial site on the island.”\n\nBeneath the writing is a black and white photo of a serious looking man in full army uniform.", "action_results": [null, null, null, {"action": "Read Plaque 5: The Unfortunate Industrialist", "result": "You step over to the plaque and read:\n\n“After the suicide of Colonel Foster his heirs sold the island to industrialist William Waugh, who moved to the island in 1920. He quickly conceived of the idea of using clay mined from the island to make pottery and arranged for thirty men and their families to move to the island. To accommodate them he built numerous buildings on the island including Maryland Village to house his workers, Blacksea Church and the Pottery Factory while he himself resided in the Castle. Unfortunately, the clay of Blacksea Island proved to be of low quality and Waugh never realised the profits he dreamed of, a disenchanted man he died of pneumonia in the bedroom of Blacksea Castle on 7 December 1940 at the age of forty-five and was buried in the cemetery of Blacksea Church.”\n\nBelow the writing is a black and white photograph of a middle-aged man in a suit with an unhappy expression.", "action_results": [null, null, null, null, {"action": "Read Plaque 6: The Generous Lord", "result": "You step over to the plaque and read:\n\n“After Waugh’s death his widow sold the island to wealthy banking magnate Lord Marcus Van Raalte who redeveloped the island as a private hunting reserve for himself and his friends. The Pottery Factory, which had been closed after Waugh’s death, was allowed to fall into disrepair but Van Raalte rehired many of its workers to work for him, constructing the Villa in the Wetlands and the Hunting Lodge, Blacksea Farm and the Gamekeeper’s Hut on the island and the buildings this museum and adjacent gift shop stand in, as residences; to support his hunting interests he imported large numbers of exotic birds into the Wetlands, which he transformed into a large park ringed with spiked walls and gates, and filled it with Hides and walkways for his hunting (today a monument to his work stands in the Wetlands).\n\nUnfortunately, Van Raalte’s redevelopments were ended by his death in the terrible fire that broke out in Blacksea Castle on the night of 30 June 1960, claiming the lives of both himself and his butler Jack Green (Green’s widow Gwen drowned herself in grief five nights later). After that terrible night developments on the island were halted and the island was sold to Lady Bonham-Christie. Van Raalte and the Greens were interred in Blacksea Cemetery.”\n\nBeneath the writing is a black and white photo of an elegantly moustached gentleman in a suit, a shotgun folded over one arm.", "action_results": [null, null, null, null, null, {"action": "Read Plaque 7: The Antisocial Lady", "result": "You step over to the plaque and read:\n\n“After Lady Mary Bonham-Christie purchased Blacksea Island from the Van Raalte’s in the summer of 1960 she ordered an immediate “Back to Nature” policy and ordered all the remaining residents off the island, some of whom had lived there for up to forty years. Lady Christie promoted the growth of the plants and wildlife on the island and allowed many buildings, notably Maryland Village and the old Pottery Factory, to fall into disrepair while she lived exclusively in Blacksea Castle. She took extraordinary steps to prevent people visiting the island, including installing an electrified fence across the entrance of the island’s Quay. She was found dead on the island of natural causes relating to old age in 1980.”\n\nBeneath the writing is a colour photograph of an intimidating-looking old woman standing frowning on a structure you recognize as the Island’s Quay with Blacksea Castle behind her.", "action_results": [null, null, null, null, null, null, {"action": "Read Plaque 8: Re-opening the Island", "result": "You step over to the plaque and read:\n\n“After Lady Christie’s death the National Group was able to purchase Blacksea Island from her descendants in 1980 and after extensive work re-opened the island to tourists. The National Group maintains a staff of nine-full time Volunteers and one ferryman on the island and has performed extensive renovation work, returning all of the island’s buildings to their former glory except for the Old Chapel, Maryland Village and the Pottery Factory, which currently remain in ruins. Plans are underway to rebuild the latter two structures in the near future.”\n\nBeneath these words is a group photo of ten volunteers, your heart gives a painful pang as you recognize Robert’s smiling face.", "action_results": [null, null, null, null, null, null, null, {"action": "Talk to the Volunteer lady", "result": "You walk over to the volunteer running the Museum and read her nametag as Iris, you realize she is the Iris Green (aged 50) you have listed on your Suspect List. She is a greying pink-faced lady who turns to you with a smile.\n\n“Hello dearie, how can I help you?” she asks cheerfully.", "action_results": [{"action": "\"Could you tell me a little about the island's history?\"", "result": "Iris laughs unexpectedly.\n\n“Oh sure dearie, this island has had a colourful history. Did you know one of the first people to live here was a hermit monk who was expelled from the mainland for practicing dark magic? In 1900 it was purchased by Dr William Benson but after he went mad in 1910 Colonel Augustus Foster brought the island. He shot himself ten years later and industrialist William Waugh tried, unsuccessfully, to mine clay here. After he died in 1940 Lord Marcus Van Raalte took over the island and ran it until he died in a fire in 1960, Lady Bonham-Christie took over, evicted all the people and owned the island until she died twenty years ago, at which point the National Group brought the island. There is more information on the plaques behind you.”\n\nYou glance at the plaques and consider whether to ask her another question.", "action_results": [{"action": "\"Is it true that someone died recently on the island?\"", "result": "Iris’s face adopts a thoughtful expression.\n\n“Ah yes, poor Robert. It was a great shock when that happened, a great shock. Quite what he was doing up on those cliffs I am sure I have no idea but I don’t think he meant to fall or that he wanted to. Personally, I think he fell by accident. You be careful not to go too close to the edge during your time on this island young lady, the island might not look it but it can be surprisingly dangerous.”", "action_results": [null, {"action": "\"I was wondering, how many volunteers help run the island?\"", "result": "Iris’s face brightens.\n\n“There are nine of us here. Arthur’s the boss, you can find him today over in the Gift Shop. Me and George run things here, though he’s gone over to do some work at Maryland today. Barry’s our boatman and Father Patrick is our resident Priest in Blacksea Church. Over in the Villa in the Wetlands is Olivia, Bill does our farm work, Gerry our general work and Charlie keeps the animals under control. Altogether we make quite a happy family here. We all have keys to everything and we all live on the island, I live on the ground floor of Blacksea Castle myself.”", "action_results": [null, null, null, null]}, null, null]}, null, null, null]}, null, null]}, null]}, null, null]}, null, null, null]}, null, null, null, null]}, null, null, null, null, null]}, null, null, null, null, null, null]}, null, null, null, null, null, null, null]}, null, null, null, null, null, null, null, null]}, null, null, null, null, null, null, null, null, null]}, {"action": "Go into the Gift Shop / Cafe", "result": "You walk into the Gift Shop / Café and find it is run by a smart-looking man in a suit with grey hair and a distinguished look about him. He wears a nametag that says Arthur and you realise he must be Arthur Van Raalte, the relative of a previous island owner. You consider the questions you could ask him.", "action_results": [{"action": "\"Excuse me, are you Marcus Van Raalte's son?\"", "result": "Arthur brightens immediately.\n\n“Yes actually, Marcus Van Raalte was my father. He owned this island from 1940 until 1960 and those were probably the island’s best years. My father employed twenty-two people, the island’s entire population barring children at that time, and the work he did here greatly enriched the island. Of course all that ended in very tragic circumstances…”", "action_results": [{"action": "\"I was wondering if you could tell me about the fire that happened here?\"", "result": "Arthur’s face darkens.\n\n“On the night of 30 June 1960 a fire broke out in the Hall of Blacksea Castle. My father Marcus Van Raalte and his loyal butler Jack Green perished in the blaze, poor Green’s widow later killed herself. My mother was pregnant with me at the time so she was on the mainland, I was born three weeks after the fire. No one knows how it started, I recall there was some suspicion at the time that an alcoholic gamekeeper called Tom Jones who was in my father’s employ might have started it, apparently he had made some unwanted advances on Green’s wife and a grudge had developed between himself and Jack Green but nothing was ever proved. It was a great tragedy for my family and for the island as well.”", "action_results": [null, {"action": "\"Can you tell me how many volunteers help on this island?\"", "result": "Arthur thinks for a moment.\n\n“There are nine of us. I live here above the gift shop, George lives over above the museum and Iris lives in Blacksea Castle. Olivia is out at the Villa, Barry our boatman lives with Bill Parsons, our farmer, as does Patrick Ould, our Priest. We’ve got a handyman called Gerry and a gamekeeper called Charlie who have their own homes as well. This is our last day here though: we’ve all been packing and this evening we’re going back to the mainland and being sent off somewhere else. Due to recent events I think we’ll all be glad to be leaving this island.”", "action_results": [null, null, null]}, null]}, null, null]}, null, null, null]}]}]}, null]}, null, null]}, null, null]}, null]}]}]}]}