{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=10524", "context": "", "first_story_block": "The world is dark, and cold. Your eyes see nothing, your ears hear no sound. Your heart no longer beats and you can't move a muscle. Congratulations, you are dead. But not for long. You hazily recall your last moments...\n\n\nWalking through the nightclub you see an ocean of flesh moving rhythmically to the blasting music. You see the women wearing skirts so short that you wonder how it's legal. Two people however catch your interest the most. A woman of about 20 something is sitting at the bar staring off into the distance. She is wearing a purple dress that ends at her upper thighs. Her alabaster skin looks smoother than porcelain. Her fine blonde hair is like a river of gold. You are immediately attracted to her but as you make your way through the crowd you spot another beauty. At about midway to the woman in the purple dress you spot another one at the opposite end of the bar. This one is wearing a low cut top (that is quite tight fitting) and a miniskirt, she radiates sexiness. She is also quite pale and has fiery red hair and catches you staring at her. She gives a small smile and then looks away. The old divining rod is no help here so who's it gonna be?", "action_results": [{"action": "The girl at the bar", "result": "\"Hi,\" You say followed by whatever cheesy pickup line that comes to mind. Surprisingly it works and you get her attention. Her emerald eyes seem full of life and she looks hungrily at you, almost licking her lips for you. Obviously a good sign. After about an hour of conversing you learn that she lives nearby and she invites you back to her place. And you thought today would suck (All puns intended). You leave the club and follow her back to her place. Turns out she lives in a pretty tidy and sparse apartment down the road from the club. She leaves you on her couch to go \"slip into something more comfy\" and goes into what looks like her bedroom. Feeling like you just won the lottery you begin to check out her apartment, it's pretty empty except for a desk with some papers on it and a bookcase. The desk looks like it has newspaper clippings on it and the bookcase has some strange looking books on it. Feeling a little paranoid what do you do?", "action_results": [{"action": "Search the bookcase", "result": "After looking through the titles of the book you find that they are all on vampire myths and legends. However there is one that catches your eye out of all of them, it is labeled as \"Diary of a vampire\" and it intrigues you. Looking through the diary you find that it mentions a nightclub and a gullible guy with cheesy pickup lines trying to get into the owner's panties. The owner of the diary then goes into detail of how they want to dismember the guy after they drain them. You are horrified to find all of the similarities and find that you only have two choices you can either confront \"Sarah\" as she signs at the bottom of the diary or you can run for your life. Which do you choose?", "action_results": [{"action": "Run away fast as you can", "result": "Unfortunately you can't run away from a vampire that easily. The blonde tracks you down, drains you of blood, and snaps your neck. You die as a human and do not rise again.", "action_results": []}, {"action": "Confrontation", "result": "You confront the blonde with the evidence you found, and she tells you everything. She is a vampire and she wishes to turn you so that she is not alone anymore. She also tells you to trust her and that her name is Sarah. She gives you the option to die and the option to live forever.", "action_results": [{"action": "Die", "result": "She kills you and you die, you do not rise from the grave either.", "action_results": []}, {"action": "Live Forever", "result": "Sarah walks up to you and softly kisses you on the side of your neck and then bites you. you only feel a tiny pin prick and feel her as she sucks a little of your blood. She then bites her own arm and offers it to you. You take it and start to suck her blood as she sucks the blood out of your neck, making some sort of circle. Her blood tasted... sweet, like syrup but sweetened. you never knew that blood tasted so sweet until you finally pass out from sensory overload due to how sweet her blood tastes. She then whispers into your ear\n\"It's alright my love, we will be together soon enough and she breaks your neck.\n\nYou die but this is not the end...", "action_results": [{"action": "Arise Fledgling", "result": "You awaken from a cold slumber. You feel as if an eternity has passed and you feel dazed. Looking around you see that you must be in a crypt of some sort. High stone columns rise up to support a low and dark ceiling. There is no light in here save a sliver of moonlight which is shining in from a skylight. Immediately, like some sort of old habit, you scan the surrounding area and find it empty, you are alone in a crypt. Looking down you see that you're in a coffin and that the lid is nowhere to be seen. You then realize how different the world seems now. Everything seems to be sharper and clearer, you can hear crows outside quite a ways away from your crypt. You can smell the scent of death emanating from the surrounding area. Definitely a graveyard.\n\n\n\nWhat do you do?", "action_results": [{"action": "Wait around", "result": "You decide to wait for whoever decided to open up your coffin and disturb your slumber.\n\nYou wait and wait until eventually you see the moonlight slowly turn to sunlight. On a whim you try sticking your finger into the light. As you do it is set ablaze with fire. You try to smother the fire but it is no good, it seems that as a vampire you are more flamable than gasoline and you are completely set on fire. You were a vampire for less than a day and you are already a pile of ashes, maybe you weren't cut out for this thing.", "action_results": []}, {"action": "Inspect your surroundings", "result": "A quick look around can't hurt.\n\nAfter inspecting your surroundings you find that there is a note in the corner of your crypt with a rock on top of it.\n\n\n\nThe note says:\n\n\nTo the newborn reading this congratulations on your successful turning, you'll find that your new life will be much, much more than what it was previously. You are now stronger, faster, and (possibly) more intelligent than before when you were mortal. Now in your new life you must only fear The Three Things, which are as follows:\n\n#1 Fire\n\n#2 Sunlight\n\n#3 The Thirst\n\nEnjoy Eternity\n\nMarcus\n\nPS The door to your crypt, which you probably already know, is locked. See if you can jump up to the skylight, or if you're too big to squeeze through it just break down the door of your crypt.\n\nAfter reading the note you glance around again and notice a stone door which you thought was an engraved decoration. It looks a little imposing and quite heavy. Looking up at the skylight you can see that it is indeed quite small.", "action_results": [{"action": "Skylight", "result": "Crouching down you leap up the distance to the skylight, unfortunately you misjudge how much strength you have gained and you wedge yourself into the skylight by the shoulders with your arms pointed upwards. Unable to break the ceiling to free yourself you are forced into staying there until the sun rises.\n\nYou burn to a crisp and turn into a pile of ashes.", "action_results": []}, {"action": "Door", "result": "The skylight doesn't look big enough to fit you so you back up to get ready to charge at the big stone door. Getting into a running start, you dash towards the door like a crazed bull, only a lot smaller and lighter. You close your eyes and you hit the door right on...and smash clear through it into the night. You stop and turn back to the crypt only to see it collapse due to the amount of force you put into annihilating the door which you did quite successfully as you pick pieces of door out of your hair.\nYou wander around the graveyard until finally you find a road. On the side of the road a car is parked...it seems oddly familiar.", "action_results": [{"action": "Run down the road", "result": "You run down the road for a long time and you come upon a town, looking down you finally pay attention to your attire...which consists mainly of what you had on your person when Sarah turned you. Checking your pockets you find rubble and your wallet which still has some cash in it.\n\nHeading to the nearest clothing store you buy a shirt and some pants and put them on seeing that you didn't bust through a wall in them.\nYou wander around the town until you stop at an alley and see someone yelling at somebody on the ground. With your enhanced senses you stay hidden and listen in, curious to see what's going on. There might be a free meal in this.\n\n\"Where's my money, bitch!?!\"\n\n\"Please don't hurt me!\"\n\n\"What the fuck did you do with my money!?!\"\n\nWhat do you do?", "action_results": [{"action": "Help the poor girl out", "result": "You decide to help the girl, but how are you going to do it?", "action_results": [{"action": "Kill the guy", "result": "You decide to get rid of this girl's problem and get a meal for yourself. Using your strength and speed you run with blinding speed to the guy, wrap your arms around him, and leap as high as you can into the air. You leaped at an angle so that you would land on a rooftop and drain this guy. Unfortunately you didn't cover his mouth during your leap and he is quite terrified... and screaming. You quickly snap his neck before he makes too much more noise. Lucky for you either this is a neighborhood that doesn't care if someone screams or everybody is a deep sleeper... probably both.\n\n\"A good clean kill fledgling, I rarely see someone so young as you make a kill without everything being covered in blood.\"\n\nYour entire body freezes just before you indulge in your meal as you hear a male voice coming from behind you, you had no indication he was there a second ago.", "action_results": [{"action": "Who is this mysterious voice?", "result": "Hello there fledgling, my name is Marcus but you can call me M if it suits you. I was sent by the woman you know as Sarah to help guide you through the early stages of the turning. Seems that you are doing quite well to by the look of your meal. But no matter. We must get you to our headquarters so that we can prepare you.\"\n\n\"For what?\"\n\n\"For war.\"\n\nSeeing that this guy is the guy who warned you about the sun and fire you follow him to wherever he's leading you.\n\nMarcus guides you through the building back down to ground level, which you find ridiculous since you could probably survive the fall if you jumped from the roof. However you don't bring this complaint up in fear. You can already tell that Marcus is a veteran vampire and that you should show as much respect as possible. Who knows what a vampire of his caliber is capable of?\n\nOnce the two of you reach ground level Marcus leads you to a black sedan with heavily tinted windows. He opens the door and ushers you into the back seat. You are nearly pushed right into the other passenger of the car, from what you can tell it is a woman wearing a trench coat with the collar turned up and wearing a hat and sunglasses. You can barely see golden blonde hair from under the hat. Oddly familiar...\n\nYou almost ask her something when from behind you hear a weird clicking sound. Turning around the last thing you see is a taser headed right for you. There is no time to dodge it and the taser knocks you out cold, but fortunately it doesn't light you on fire.", "action_results": [{"action": "Hours later...", "result": "You wake up dazed but alive and in a very comfortable four poster bed too. You sit up and look around and see that you are in a room of someone very rich because just about everything is either intricate, golden, or without a doubt priceless. It'd be best to not break anything.", "action_results": [{"action": "Fake being asleep still", "result": "Pretending to sleep sounds like a good idea, you don't know why they tased you so it'd be best to just sit back and observe for a little bit.\n\nYou roll over and snuggle down into the covers a little bit so that you can get a look at any cameras that might be in the room. You don't see any so you decide to try and mimic the position you were in when you woke up. Laying flat on your back with your arms on either side of the large bed. Your plan seems to work because you hear voices approaching the room.\n\n\"...mean he's not waking up?\" a female, possibly Sarah.\n\n\"Your majesty it's been 6 hours since the car, if he's not awake then I doubt that he'll be waking up anytime soon.\" Definitely Marcus.\n\n\"But what are we going to do about the experiment? And we are so close too!\"\n\n\"Then we'll just have to find another fledgling that has yet to kill. He is just another subject your majesty. I doubt he can be of much use anyways.\"\n\nYou hear a loud smack after this, most likely a slap and some hushed scolding that you can barely make out. Obviously Sarah cares about your well being but for now you decide to stay \"asleep\" until you can find out more.\n\nThe door to the bedroom opens and someone walks over to you and put their hand on your shoulder. You can feel a sigh from Sarah, who put her arm on you and you hear Marcus make a remark along the lines of \"I told you so.\"\n\nSarah gets furious at this and you decide to work on your acting a little bit and roll over and mumble \"C'mon mom, 5 more minutes...\"\n\nA deafening silence fills the room.", "action_results": [{"action": "And the Emmy goes to...", "result": "You fortunately. Get a reaction out of Sarah when she starts to shake you to make you get up. Finally you \"wake up\" and all you say is \"Oh hey Sarah, where you been?\"\n\nSarah bursts into tears and embraces Marcus merely chuckles and backs up towards the door. Sarah makes some attempts to talk but she's so happy that all she can do is sob. Instead of her explaining things Marcus helps out.\n\n\"What the queen is trying to say is that we need your help. You see as a fledgling that has yet to feed you still have the option of being cured of your vampirism. What do you say, we won't blame you if you don't want to go back.\"\n\nWell...?", "action_results": [{"action": "Cure", "result": "\"Alright I'm game, let's do this.\"\n\n\"Wonderful, now if her majesty would just let go we'll begin immediately.\"\n\nMarcus somehow manages to pry you from Sarah and leads you through a maze of corridors, hallways, and passages. You cannot hope to survive this maze without a guide. Eventually Marcus stops at a door and opens it, ushering you into it. You enter the room and see that tons of medical and scientific equipment stuffed into it. It seems that all the equipment is centered around a single bed. Looking closely at it you notice leather straps and bloodstains on said straps. You turn around to try and weasel your way out of this but it's no good. Marcus pulls out the trusty taser and once again you are knocked out.\n\nWhen you come to again you're strapped to the bed and a very bright light is shining into your eyes. You can hear voices but they sound disembodied and far away. You start to get a sinking feeling and you begin to fear what comes next, whatever it may be. The last thing you feel before the horrors of the \"cure\" is the comfort of a soft hand holding your own.", "action_results": [{"action": "Blackness", "result": "For what feels like an eternity the only thing that you are left with in the blackness of the cure induced coma is a raging fire of pain in every limb of your body. At first it was just a tingling on your skin, but now the raging firestorm that your body feels trapped in has no end in sight. You begin to pray for your life, hoping that someone, somewhere, will hear. Finally after the eternal abyss of pain ends you finally rest and sleep and sleep for a long time.\n\nDays Later\n\nYou open your eyes up to the world once more but something isn't right. You're in a hospital bed and someone is on top of your arm and cutting off the flow of blood from it. You try and smell but it's no use, whatever powers you once had are now gone. No longer are you a hunter of the night. You have returned to the day to day existence of a simple human man. Nothing new or special, just plain old human you.\n\nThen you realize with a start that the person on your arm is Sarah, and that things might just be a little different...", "action_results": [{"action": "Time Lapse....(Epilouge)", "result": "Three years later...\n\nThings have been rather quiet for you. Nothing really extraordinary happened to you after you had been cured. They just gave you some money and sent you on your way. Three years later and bam, you're back in the same club looking for someone to keep you company all over again...\n\nNah, not really. Just kidding. Here's what REALLY happened.\n\nAfter you healed up after the cure (to which you still don't know what they did to you) and eventually the vampires managed to advance the cure to where it could even cure those that had fed. Sarah immediately underwent the operation and was also cured. A year after that you and Sarah got married. The next year you become a father. And finally just this year your kid said her first word. \"Dadah!\" You sometimes reminisce about the days that you were a vampire but you take one look at your kid and those thought completely die for a little while. As long as you have that kid you don't need to be a vampire, being a dad is just as good in your book. You imagine about the future (that is well provided for by the vampires for your hard work as a test subject) and you're satisfied in knowing that you can take anything headed your way.\n\n\"Honey?\"\n\n\"Yes Sarah what is it?\" She only calls you honey when she's about to drop some news on you.\n\n\"I'm pregnant.\"\n\nYou smile and nod and start to laugh. You hold Sarah tightly hoping that this moment of pure happiness never ends and your wish comes true.", "action_results": []}]}]}, {"action": "No Cure", "result": "\"Thanks but no thanks.\"\n\n\"Oh well, that's too bad. I guess we'll just have to tie up a loose end instead.\"\n\nYou are surprised when Sarah tears out your throat and even more surprised when you see the look on her face, on of unwavering hatred. Wow you must have REALLY pissed her off. Well at least you only felt her wrath for a fraction of a second.", "action_results": []}]}]}, {"action": "DESTRUCTION RAMPAGE", "result": "You decide to screw whoever decided to tase you and you immediately begin to smash everything in sight. You turn an antique oak tea table and matching chairs into toothpicks, you turn the priceless looking one-of-a-kind paintings into tissues and toilet paper. I think that it's needless to say that when Marcus enters the room and sees your destructive violence and the state that the bedroom is in he tears you limb from limb literally.", "action_results": []}]}]}]}, {"action": "Forget it, i'm walking away before i get noticed", "result": "You play it safe and walk away from the pimp and the ho, it's probably better that way. you wander around the city, mindful of your growing thirst before it gets too out of hand. You decide to embrace your predatory ways and hunt for some food. Going into a crowded bar you see tons of chicks doing shots like no tomorrow... that's good because there won't be for one of them.\n\nYou have two choices, the first is a biker chick that seems to hold liquor like the Hoover Dam holds water, she has dirty blonde hair and you can see that all her face says is attitude. Second you have her unfortunate companion who looks quite feeble and meek, and quite out of place. She is wearing glasses and has her red hair in a bun. To you she seems to be the DD for her friend\nPick your prey.", "action_results": [{"action": "Biker Chick's Sober friend", "result": "You walk up to the girl that looks like she actually has something in her besides alcohol and nicotine. She's shy at first and plays hard to get for a while but with your vampiric charm none can resist you. Finally after she drops off her friends you follow her to her house where you decide you'll make a meal out of her and use her home as a bed for the day. Unluckily when she takes you into her home she tells you she'll slip into something more comfortable. Wait, haven't you heard that from somewhere before? You think about this more until she comes back with a lit molotov cocktail in her hand. The last thing you hear is \"DIE BLOODSUCKER.\"\n\nSeriously how do people keep finding out you're a vampire? Maybe you aren't good at this at all.", "action_results": []}, {"action": "Biker Chick", "result": "You decide to go after the better looking and much more gullible (thanks to alcohol) woman of the two. It barely takes a few minutes before your sucking her life from her neck. However doing this left you incredibly vulnerable and her friend decided to look for her. In moments her friend (who you learn the hard way is a black belt in a couple martial arts) completely kicks your ass. You get up a little later and go back into the bar and get a different drinking biker chick but this one has no helpful black belt to stop you. Full and nearing exhaustion you hide in an abandoned building for the day.\n\nYou have a strange dream while asleep.", "action_results": [{"action": "Dream", "result": "You dream that you are lying down in a large grassland surrounded by grass as far as the eye can see. There is a light breeze and the sun is up but you aren't getting burned by it. This is the most peaceful of all the places you have ever been. After sitting up and looking around you see that there is a small river cutting through the grassland. Suddenly you feel thirsty and head down to the river for a drink of water. You bend down to take a drink from the river and as soon as you put your hand in the water it darkens and reddens until it turns into a river of blood. Looking up from the river you see that the grass has died and you are in a barren wasteland. The sky turns red and black clouds soon block the view of it. Then it begins to rain but the raindrops aren't water, they're blood. You look around and the once peaceful grassland has turned into a bloodbath... literally. You hear someone behind you and turn to see who it is... only to see that it is yourself, covered in scars and wielding a wicked looking blade. Your evil twin merely grins at you and he raises his sword over his head. Just before he brings it down you wake up and see that the night has returned. Time to go hunting.\n\nYou spend a few days in the city and eventually you are forced to move on. The hours eventually turn to nights, nights turn into days and days turn into months, many of them.", "action_results": [{"action": "3 Years Later", "result": "It has been three years since your rebirth as a fledgling and much has changed, both within you and outside of you. You now live on the outskirts of your old city alone. You sleep in the basement until nightfall and then you head towards town to find a meal. Since being born your body has \"mutated\" from what it once was. You are now much stronger and faster than ever before, as if all of your powers were doubled. But that is not the only power that concerns you.\n\nAbout a year after your rebirth a power struggle emerged between two major vampire factions. You are uncertain of who started what but you have managed to stay away from the conflict and remain a neutral party in the war. You spend the time that you aren't asleep or hunting in your home training and honing your powers so that they stay sharp in case of an emergency. That emergency happens today.", "action_results": [{"action": "A knock at the door", "result": "An unfamiliar sound in your home you hear someone know at your front door. From the pounding you can tell that they're quite strong and they mean business. Using your nose you can tell that the person on your doorstep is a vampire. A quick note about the smell of vampires: you can tell how old a vampire is by the scent they give off. This smell is so light that not even dogs can pick it up. To a human a vampire's smell is used as another lure to help secure prey, but to another vampire the scent is of decay. The more decay you smell, the more powerful the vampire.\n\nThe visitor smells of one thousand graveyards each filled with one thousand open mass graves. You tremble in fear of the smell, but what are you going to do about it?", "action_results": [{"action": "Be wary and see if you can investigate more about the visitor", "result": "You try to look through a window that overlooks the front doorstep. All you see is a strange looking person wearing a trench coat, a hat, and gloves. The visitor looks incredibly suspicious and imposing.", "action_results": [{"action": "Open the front door", "result": "Throwing caution to the wind you open your door wide to the mysterious and powerful vampire. Before you stands...a large trench coat and wrapped in it is a little girl of no more than 5 or 6. Kneeling down you stare into the child's eyes and you cannot believe your own. Her eyes are black with a little bit of red around the pupils (vampire's eyes). Suddenly your pint sized visitor grins revealing her dagger-like fangs and leaps at you. You react just in time to stop her from biting you but she pins you on the floor with a strength that you know could only come from years of survival as a vampire. She then begins to pummel you and you become disoriented. She keeps beating you until you are a bloody pulp. The last thing you hear is the sound of a lighter being lit.", "action_results": []}, {"action": "Ignore the visitor", "result": "You attempt to hide your presence and ignore the vampire as best you can, but it is futile. The vampire breaks down your door and rushes inside your home and immediately finds you and pins you on a nearby wall.\n\nYou are surprised at the appearance of the vampire. It appears that you have been beaten by a child of no more than 7. That's right. The elder vampire from which you hid from is a female child with long blonde hair (which you thought looked quite familiar) that would touch the floor, if the girl was touching the floor. Instead the little girl levitated so that she could actually pin you on the wall. She is not happy with you.\n\n\"What a pitiful excuse for a vampire, hiding from something that poses even a remote threat.\"\n\nYou cannot answer, the power that exudes from this little girl is preventing you from doing anything other than putting on a look of sheer terror.\n\n\"I was ordered by my sire to bring you to our side if you proved smart enough to best me, but seeing as that didn't happen i have to eliminate you now.\"\n\nYou look around for anything that might help you in this dire situation when you see a glimmer of hope, an idea, that just might work.", "action_results": [{"action": "Lightbulb", "result": "In case that a vampire would attack you, you had prepared countermeasures around the house to prevent someone from killing you in your own home. The glimmer of hope was the lighter that you know is in the nightstand to your immediate right, within reach, and full of fluid. But do you risk it?", "action_results": [{"action": "Hell yeah!", "result": "Uh-Oh dummy, you forgot that you can't move a single inch against this broad! Reach and reach all you want to but you're never gonna get that lighter!", "action_results": [{"action": "I don't care! I'm not going to die like a coward! I'm going to go down kicking!", "result": "You desperately try and break out of the girls hold but it is stronger than iron. You try every dirty little trick that you can think of to get out of this situation until finally you break the little girl's concentration causing her power to drop just enough for you to quickly move your body and grab the lighter and light it, an inch from the little girl's skin. Her eyes widen in terror as you hold the flame just over her skin, she begins to tremble in fear of the fire. But then she grins and says \"Pass.\" You don't see the blur that is her fist crash into your face but you feel it, for a moment, and fall unconscious.", "action_results": [{"action": "Nighty nite", "result": "You awaken what you think is hours later in a damp, dark cell. Your eyes adjust naturally to the low light and you see a message neatly scrawled in the dust of your cell.\n\n\n\nTEST #2: ESCAPE\n\nRULES\n\nBARS ARE ELECTRIFIED\n\nNO TIME LIMIT\n\nNO FOOD\n\nNO WATER\n\nNO BLOOD\n\nNO TOOLS\n\n\nFAIL=DEATH\n\nGood luck!\n\n\nYou already start to feel the helplessness set in but there is nothing you can really do. The electric bars might kill you if tampered with, you have nothing in your cell except a metal bunk, a pillow, a rough blanket, and a seat with a bouncy cover.\n\nWell wasting no time you...", "action_results": [{"action": "Check out the seat", "result": "You decide to investigate the seat and you are granted with the knowledge that the seat is made of rubber, after some manuevering of the rubber you've made a rudimentary pair of handles to help you with bending the bars. But will the rubber hold?", "action_results": [null, {"action": "Bend the bars", "result": "You try to bend the bars but sadly the rubber isn't quite resistant enough to the electricity. It still shocks you but it isn't enough to kill you, just stun you. Well now that that's over what else are you going to try?", "action_results": [{"action": "Check out your bed", "result": "After searching through the bed you get a great idea. The sheets are actually made of steel wool (which to vampires feels like regular wool) and will ignite if an electric current is run through it. This might make an excellent distraction for the guards (that you assume are there) to open up your cell and allow you to make a mad dash for freedom.", "action_results": [{"action": "Do it", "result": "You throw the bundle of steel wool at the electrified bars and it is set ablaze... but the wool bounces backwards straight into you. Seems that your illusion became a reality. You die a fiery death.", "action_results": []}, null]}, {"action": "Panic", "result": "You start to panic and go insane inside the tiny claustrophobia inducing cell. You go mad with dehydration, hunger, and the thirst. eventually you go so crazy that you break through a solid stone wall of about 3 feet in thickness into a room with a fountain of blood, a fountain of water, and a table full of food. On a banner the word \"Pass\" is written. Looks like panicking actually helped in this situation. You immediately sate your thirst (for both blood and water) and calm your hunger with food afterwords. Then you curl up on the dusty floor and pass out.", "action_results": [{"action": "ZzzzZzzzZzzzzzzZzzzZz...", "result": "During your sleep you have a strange dream... almost like a vision. In the dream you are a powerful vampire and you have just slain a powerful enemy and all the vampires are cheering your name. You feel proud that you have finally gained the acceptance of your kind... but it's not enough. You have a strange empty feeling that immediately swallows up the pride... it is loneliness. You begin to feel depressed in the dream, you don't even know why or you can't figure it out one of the two.\n\nYou wake up just as you feel that you have an answer. When you open your eyes you see that the little girl is standing over you once again. She is staring right into your eyes which you think is kinda weird and it's creeping you out but you don't get up for fear of another ass-kicking.\n\n\"Get up.\"\n\nYou decide to not get on her bad side so you do as asked. She then walks away and you follow her.\n\nShe eventually leads you to a sort of throne room with a small stone column in the middle. You don't know what comes over you but you immediately head towards the column... and see that it is really a basin holding blood. Once again you don't know what possessed you to do this but you do it anyways. You cup some of the blood in the basin in your hand and drink.\n\nAfter about ten seconds of pure agonizing silence you start to feel something...", "action_results": [{"action": "A surge of power", "result": "The surge of power is unlike anything you have ever felt. You can feel it like an internal bonfire through all of your muscles and sinews. From your bones all the way to your skin your power seeps into every crack and crevice. After about a few seconds of this extraordinary feeling it leaves you and you collapse. You can hear voices in the distance though, cheering your name like you just killed the strongest enemy in the world... smiling to yourself, you think that killing the strongest thing in the world would technically be suicide. Although you collapsed you can feel the reservoir of endless strength that the blood granted you. You stand back up and face the basin of blood. Then you turn around and look at the crowd of vampires that has suddenly appeared behind you. You raise your fist in the air and it is met with the cheers of your allies. You feel so powerful that nothing can stop you at all.\n\nMany years later...\n\nA long time ago you proved yourself in the trials necessary to turn into a vampiric equivalent of a prince. The little girl, who you find out is named Hayley, is the equivalent of a princess but there is no bad blood between you two. Actually you two couldn't be better friends. Although many years have passed you constantly think about those 3 years that you spent looking for your sire. You wonder if you'll ever find her again but for now you are satisfied with being a prince. Who knows maybe you'll see Sarah again someday? Only time will tell...", "action_results": [{"action": "Epilouge", "result": "20 years later...\n\n20 Years have passed since you became a vampire prince and life has been good to your so far. You learned much in the short two decades of study and ruling as a prince. You learned that you were selected to be a prince because you have the \"Insigne Rex\" which you learned is latin for \"Mark of the King\" basically you were destined to be a vampire prince from the moment you were sired. And while on the subject of sires you did in fact see Sarah again. You went back to her apartment and found that her stuff was still in it. Looking through the books and papers of her home you learn surprising information.\n\nSarah was in fact purposely turning guys that showed the makings of a good vampire to bolster the ranks of her family's troops. You see that the name of the family is Umbra... loosely translated it means \"Shadow\" and that Sarah is listed as a breeder for Umbra. Horrified at this you leave and run right into Sarah as she's bringing in yet another sucker (not a vampire but a guy like you once were). Many things pop into your head but it's when she kneels before you that you snap back to reality. You decide to leave and just go before you decide to do something rash.\n\nCenturies pass and you only grow in strength. You bring a new Golden Age of the Vampire by actually coming out of hiding and taking an offshore island as the homeland of vampires. After intense negotiations and maybe a war or two you seal the vampire's place in history and your people prosper for many, many years.\n\n\n\nAnother few centuries pass and you are reaching the end of your life. You can feel it inside of you. When a vampire dies of old age they don't exactly die. They turn into stone and hibernate. They wake in times of great need and you know that it will happen to you. You feel the process begin and you head for your coffin in the bottom of the palace that thanks to you is now the capital of the Vampiric Legion. As you lie down and feel your skin turn to stone you wonder quietly who will succeed you and stuff like that... but you rest easy knowing that when the time is right your return shall bring the vampires into another Golden Age. You begin to feel very tired and you shut your eyes and never open them again.", "action_results": []}]}]}]}, {"action": "Commit suicide", "result": "You commit suicide by holding on to the electric bars. The sparks on the bars set your clothes ablaze and ergo set you ablaze.\n\nQuick note, why did you commit suicide? That was just dumb. Panicking would have gotten your story farther than this. Why don't you just hit the go back button and get a do over?", "action_results": []}]}]}, null, null, null]}]}, {"action": "Might as well give up", "result": "You accept your fate and let the little girl snap your neck, paralyzing you. She then pulls out a book of matches and using the power of her mind alone (and without even looking at what the matches are doing) she lights one and throws it onto your body just as she lets go.\n\nGameover, you died.", "action_results": []}]}, {"action": "No, i will accept my humiliating punishment from this little girl who barely lifted a finger to kick my ass", "result": "The little girl completely kicks your ass. Then she says \"What a waste of my time.\" and uses your own lighter to set you on fire. You die.", "action_results": []}]}]}]}, null, null]}]}]}]}]}]}, {"action": "Kill the scumbag and the ho", "result": "Using your fast reflexes, amazing strength, and quiet footsteps you sneak up on the guy and snap his neck without even blinking. You then proceed to choke the girl using one arm to hold her in place on a wall and drain her of her blood. After she dies you drain the guy too.\n\nAfter you finish your meal you walk out of the alley only to find that a cop is walking towards you and you are covered in blood. The cop immediately arrests you and finds the two bodies. After easily snapping the cuffs and killing the cop you are pursued by them into a building which you hold out in until morning, you try to hide but they find you and you kill all of the cops in the nearby area. Suddenly out of nowhere a contingent of vampires sees that you have made a mockery of their rules that you do not even know yet and are immediately lit on fire and slain on the spot.", "action_results": []}, null]}, {"action": "Approach the car", "result": "You are sure you've seen that car before so you approach it to see if anyone is inside of it. While approaching it you see that a window rolls down and someone points a gun at you. You barely have time to dodge the hail of bullets that come at you, even with your vampiric reflexes. You run and hide behind a nearby tombstone and the bullets stop. You hear someone get out of the car and reload the weapon. They begin to walk towards the tombstone where you are hiding, completely unafraid.", "action_results": [{"action": "Take the human by surprise and disarm them", "result": "You run out from behind the tombstone and charge the human with incredible speed. You manage to get a hold of the gun... just as he begins to fire in at point blank range. The bullets hit on-vital areas but the muzzle flash is enough to ignite your overly sensitive skin and set you ablaze. Death comes fast but painfully.", "action_results": []}, {"action": "Take Cover", "result": "Unfortunately you can't outrun bullets but fortunately the human is a terrible shot for an assassin and you easily run away. You hide in a nearby crypt and spy on the assassin. You see that it is a man of about thirty and he is on a cell phone. You listen in on the conversation from afar.\n\n\"Sir? I lost the target.\"\n\n\"YOU IDIOT! I DON'T PAY YOU TO FUCK UP! I WANT THE FLEDGLING DEAD OR ELSE! YOU FUCKING GOT THAT!?!?!\"\n\n\"Sir, I'm only a human, how the hell can i keep up with a vampire?\"\n\n\"...Figure it out.\"\n\nObviously whoever wants you to die doesn't want to spare the manpower to make you dead. What are you doing to do about the grunt?\n\nYou start to feel your stomach growl and your throat goes oddly dry...", "action_results": [{"action": "Mealtime", "result": "You sneak around some more tombstones making sure that the human doesn't see you... you chuckle on the inside at how ignorant the human is. When you are behind him and within three feet of his neck you pounce on him like the predator you are and drain him of his blood.", "action_results": [{"action": "Pick up his phone", "result": "Picking up you assailant's phone you hit redail and call up his boss. You are greeted with this.\n\n\"IS THAT MUTHAFUCKA DEAD OR ARE YOU JUST PLAIN DUMB YOU INSOLENT LITTLE...\"\n\n\"I wouldn't use that tone with me sir.\n\n\"Who the hell are you?\"\n\n\"You should have brought more guys. I might've been nicked by a stray bullet.\"\n\n\"Oh just you wait muthafucka, just you wait.\"\n\nHe then hangs up on you and you hear a beeping nearby that is faster and faster until finally you realize quite late that the car has a bomb in it. From the link below it doesn't look like you survived all that well either. turns out he didn't need more guys.", "action_results": []}]}, {"action": "Interrogate him", "result": "You manage to sneak around behind him and take him by complete surprise. You take his gun and bend it so that it wont fire and you pin him on a nearby tombstone. You do it hard enough for the stone to tremble a bit to make your intentions clear.\n\n\"Who do you work for?\"\n\n\"Fuck you bloodsucker, might as well kill me cuz you're not getting anything out of me.\"\n\nFine, have it your way.\"\n\nYou begin to torture him for answers so that you can find out who wants you dead. It's nothing too serious except you just scratching him with your unbelievably sharp nails until he starts to runs his mouth... which happens a little too quickly.\n\n\"Alright, i'll tell you anything.\"\n\n\"Who do you work for?\"\n\n\"I work for a guy named M. He hasn't told me anything except that letter and to kill you.\"\n\n\"Do you know who put me in there?\"\n\n\"Yeah i do actually. M mentioned that some girl of his turned you and put you in there to protect you. She came by earlier tonight to check on you. That's how i knew.\"\n\n\"Do you know where she is now?\"\n\n\"No.\"\n\n\"Where is M?\"\n\n\"He has a bar in town. It's this place where a lot of bikers hang out.\"\n\n\"Thank you. As appreciation for cooperating i'll kill you before i feed.\"\n\nYou keep your word.\n\nWhat now?", "action_results": [{"action": "Go find the bar", "result": "You decide that finding the bar is important seeing as how you won't leave your sire behind (those of you who got here from back in time might need to pay more attention to that)and decide to investigate the biker bar. You search for hours but are unable to find it. Eventually you give up for the night and you decide to bunk in an abandoned tenement house. Too bad for you that the next morning it is demolished to make room for a mall with you in it still. You get a nice and fatal char broil from the sun.", "action_results": []}, {"action": "Forget about M and Sarah and be your own vampire", "result": "Actually you do quite well as a vampire for many years. You evade the mortals at every turn and you hide the bodies from your hunts quite well too. You live for quite a while too until one day the prey you selected happens to be an experienced vampire hunter. Needless to say you are eliminated quite quickly, odd for living so long under the radar.\n\nOk now you know that leaving your sire behind is a really bad move, now are you going to go back and find out what happened or are you just going to end the game right here? This is the only time i will give you a retry in this storyline so be prepared for the minefield ahead.", "action_results": [null]}]}, {"action": "Flee", "result": "You try and run from him but seeing that he does have a full clip and his boss just yelled at him his accuracy miraculously improves. He manages to hit you in your legs and before you can get up he runs up to you and shoots you in the head... oddly enough it doesn't kill you but it paralyzes you. Unable to move he then says something and he goes back to his car. He then begins to pour what you think is gasoline on you... Your killer then lights a match and says one last thing to you.\n\n\"Nothing personal, but you are a terrible vampire.\"\n\nHe throws the match on you and you light up like a Christmas tree light.", "action_results": []}]}]}]}]}]}]}]}]}, {"action": "Search the clippings", "result": "After browsing through the clippings on the desk to satisfy your paranoia you find that they are all of murders and that they all the victims were drained of blood and that they were all male and about your age. This worries you and you find that in a drawer of the desk is a diary, it says \"Sarah's Diary\" on the first page. Reading through it you find out that the owner of the diary was either bat shit crazy or a vampire, most likely a vampire with all the gory details that were provided. Armed with this information what do you do?", "action_results": [null, null]}, {"action": "It's just paranoia, let it go and have a good time", "result": "You sit down on the couch and relax, it's just you being a little paranoid. After a few minutes the blonde, clad in super sexy lingerie, tells you to come on in. You quickly (and for good reason) enter her bedroom to find it covered in plastic. Just as you are about to ask what's up she hits you over the head with something heavy, as you slowly fade from this world you feel a sharp prick in your neck and then nothingness.\n\n\n\nYou do not turn into a vampire, instead you turn into a bloodless husk, she has drained you dry.", "action_results": []}]}, {"action": "The girl at the other end of the club", "result": "You barely managed to choke out a \"Hi\" before she immediately grabs you and runs out of the club with you, By the time she stops you're quite a ways from the club.\n\n\"Oh thank God that we got out of there.\"\n\"Uh mind if i say what the fuck just happened?\"\n\"Oh yeah, you must have a strong will buddy, that blonde chick was about to make you her next meal.\"\n\"I just don't like blondes all that much, besides what do you mean by next meal, and who the hell are you and why did you drag me out of the club like i was luggage?\"\n\"Alright i guess you at least deserve an explanation\"\n\nThe girl, who says her name is Alice, tells you that the woman at the bar was a vampire and that she was going to turn you into a blood milkshake. Alice then begins to tell you that she is a vampire hunter and that she was keeping the vampire from eating to weaken her and slay her when the sun rose in a few hours. She mentions that you might have potential as a vampire hunter seeing as how you resisted the bloodsucker but then she asks you to come with her to help her kill the vampire.\nDecisions, decisions.", "action_results": [{"action": "Follow her", "result": "Going with what you feel is right you follow Alice as she leads you to her hideout. The hideout is located in a shabby looking tenament that as far as you can tell has no obvious residents. She stops at the door and turns to face you. Look i need to ask you before we go in, how do you feel about vampires in this world?\n\nWell? How do you feel about vampires existing?", "action_results": [{"action": "Vampires must die", "result": "\"Oh well that's too bad.\" She states and near immediately tears off your head and begins to suck the blood spurting from the stump where your head was. Seems that vampires lie a lot.", "action_results": []}, {"action": "We can coexist", "result": "\"Ok, from that I can trust you.\" she says happily and leads you into the shabby building. Inside there is a surprisingly good looking set of stairs that leads down into a basement of some sort. Following Alice she leads you into an empty chamber. She leads you into it and you hear a door shut behind you. Alice then turns around again and says, \"This is the end, i'm going to give you a choice. You can either die quickly and painlessly or i can change your life forever. I'm not a vampire hunter only, i'm a vampire that hunts other vampires in case they break our strict laws. So what'll it be, Death or Undeath?\"", "action_results": [{"action": "Death", "result": "\"Alright then, goodbye.\"\nAlice keeps her word and kills you faster than you can blink. You didn't feel a thing and she didn't even feed from your dead body. Your body is found a week later and the cause of death is undetermined. You are buried and do not rise from the grave. No one knows how you died to this day.", "action_results": []}, {"action": "Undeath", "result": "\"Are you absolutely sure you want this?\"\n\"Yes, I am tired of this earth and i wish to see it from another view. Make me a vampire.\"\nAlice keeps her word and bites you on the neck and drains a bit of your blood. She then bites her own wrist and offers it to you. Without saying a word you take her wrist and drink the blood coming from it. It tastes surreal, it is the most amazing thing that you have ever, or will ever, taste. You can feel power flowing into you from her blood and you keep taking more and more blood from her wound until finally she punches you in the face. You stop taking her blood and look up and she is furious.\n\"What the hell man!? Are you trying to kill me!?\"\n\"I took too much?\"\n\"Yeah just a little would have done but you almost drained me! Now you have to die.\"\nBefore you can manage to ask she breaks your neck and you fall to the floor dead but this is not the end, you do not stay dead for long...", "action_results": [{"action": "Arise", "result": "You awaken but you don't open your eyes yet, you can hear voices somewhere near you. One you can tell is Alice's and the other you don't recognize but sounds like a man. You listen in on their conversation.\n\n\"I just want to know what the hell you were thinking when you turned him!\"\n\n\"I was thinking about the survival of our race. Plus there's something about him... I can feel it.\"\n\n\"Well while you stake the future of the vampiric race on some guy you met in a club I'll return to Alenia and do REAL work on helping out vampire kind as we know it.\"\n\nHearing this disturbs you and you decide to get a better sense of your surroundings...", "action_results": [{"action": "Open your eyes Dummy!", "result": "You look around and it seems that you have missed the last century. You are surrounded by high tech equipment and electronics. even the polished walls have a high tech feel to them. the voices were coming from the hall connected to your room. Taking a look around you notice that there are no windows and there's no doorknob... at least on your side.\n\nSuddenly you hear a pressurized hiss and all of the electronics sink into the floor. The walls also seem to move back giving you a lot more room than you thought you had. Just then Alice walks in. You walk up to greet her but, for some odd reason, she decided to greet you with a right hook to your temple at full force and with a blinding speed.", "action_results": [{"action": "'What the hell!?!\"", "result": "You manage to choke this out right before Alice chokes you out. In fact she chokes you so hard the she \"accidentally\" snaps your neck and severs your spinal cord too. Death is immediate and painless. She cries a lot but you are soon replaced.\n\nOk reader, this is the only time you're going to see this so listen up. You died at the hands of your creator but you were caught seriously off guard and it was an accident. I realize that this is highly improbable and i am willing to let you choose retaliate from this page. There will be no more retries so be careful.", "action_results": [{"action": "Retaliate (from the dead)", "result": "She's either really pissed or she wants you dead. Or both. Either way you're not gonna let some girl kick your ass right? She goes for an uppercut but you manage to somehow block it and hold on to her arm as you do a backflip that you know you couldn't do as a mortal. You land on top of her in a rather compromising situation. Your male brain decides to ponder on this and you hesitate. Alice utilizes this opportunity and she pins you in just a few movements.\n\n\"You'll do. Your movements suck but you have potential as a fighter. Pass.\"\n\n\"Wait that was a test?\"\n\n\"Yeah, the test was to see if you would respond accordingly when someone you recognize attacks you. It was also to see if you were an OK fighter. You can improve on the fighting part so I'll teach you how but you still pass this test. Now on to the next test, there's only two more including the next so don't fuck up otherwise we have to kill you.\"\n\n\"What the fuck Alice? What's this test?\"\n\n\"How thirsty are you?\"\n\nWith her mentioning you notice just how thirsty you are. You throat feels like it just gargled sand and you think that you need water... but the thought actually repulses you. Then you think about blood... and the thirst worsens.\n\n\"WELL GET USED TO BEING THIRSTY, I'LL SEE YOU IN A WEEK.\"\n\nAlice then dashes out the door which you realize needs no knob because like the rest of the stuff in this place it's all future-y and goes upwards into the ceiling before crashing down. You try to run after Alice but the door is locked behind her.\n\nYou then realize what the test is. One week with no blood whatsoever.", "action_results": [{"action": "Panic", "result": "You decide to panic like many other people would at this situation. You go insane and start to hear voices in your head. Your world is spinning and if you were still mortal some men in white coats with a funny looking jacket would be trying to find you. You descend so far into madness that Alice is forced to end your life to save your own psychosis.", "action_results": []}, {"action": "Stay Calm", "result": "You relax and take a few deep breaths. Panicking will not help you in this situation so you decide to somehow pass the time without knowing it. You ponder how to do this and finally you realize that you should meditate.\n\nYou get into a comfortable sitting position on the cold steel floor and you delve into the depths of your mind. You dive right past all of your memories, repressed or otherwise. You keep going and going, sifting through all of your mental baggage until you find the center of your own psyche.\n\nYou then enter your mind's very core...", "action_results": [{"action": "What's in it?", "result": "Your are now in a bright grass field. As far as the eye can see there is only green grass and bright light. There is a gentle breeze blowing and you feel at peace. The light, although quite bright, is not sunlight and is oddly comforting. You decide to lay down and bask in this peaceful inner world of yours.\n\nSuddenly you hear a shriek of terror... a woman's. You immediately dash into the direction of the scream and you find Alice being chased by a huge monster. It is covered in scales and has vicious looking claws. What do you do?", "action_results": [{"action": "Save Her", "result": "You decide to forgo danger and you run in to help your creator. You then have a startling realization. This is YOUR dreamworld and you can do whatever the hell you want to in it. So using your imagination you think of the beast exploding into a billion little bits and guess what? you were right. Exactly that happens.\n\nYou turn to Alice but at that moment the real world Alice is trying to wake you up. Exiting the dreamworld you wake up and see Alice's eyes staring into yours and, well, lets say you decide to take advantage of the situation. You reach forward and kiss Alice. She is genuinely surprised but she doesn't stop you. when the kiss is over she slaps you.\n\n\"What the hell Alice!?\"\n\n\"First of all you pass the seven days challenge. Second only do that when I give you permission.\"\n\nYou are frustrated and angry but at the same time glad, because she didn't say she didn't like you. Only that she's not ready. Oh and you passed so you congratulate yourself.\n\n\"Is there another test I should worry about?\"\n\n\"Oh, you have only just begun.\"\n\nAt saying this Alice has a terrifying grin and you feel your spine freeze up. Welcome to hell, my friend is all you can think.", "action_results": [{"action": "Hell freezes over", "result": "Years pass as Alice trains you in combat and instructs you on your vampiric powers. You learn that as a vampire you are entitled to certain abilities that would normally be considered as magic. You can levitate, blend with shadows, you can even dive into a person's mind and drive them insane.\n\nShe teaches you all of this by using you as an example.\n\nYou might have cared about this if you weren't plagued by thoughts normally plaguing the male mind. She even uses this as an advantage to keep herself out of reach but to make you reach anyways. She makes it seem like she'll accept you as a lover, but then she pushes the bar even higher and higher until one day, you decide to train on an off day from Alice to attempt and beat her in at her own game. You train for quite a while using a technique Alice taught you about slowing time down using your speed and train. Using this technique one hour gets slowed down into about 15 minutes. eventually 6 hours later you deem yourself ready. Tomorrow you finally get your prize.", "action_results": [{"action": "Tomorrow", "result": "It is exceptionally early when you wake up to wait for Alice. You decide to think about what you learned, not just the combat but the politics and heritage and culture of the vampire race.\n\nAlice told you (between punches) that there are two major warring vampire factions. Basically they are two feuding families that haven't set aside their differences to help stop the end to the vampire race. All they care about is destroying the each-other. Alice then told you in a rare moment that she was once a part of one of the families and that she fell in love with a member of the opposite family. When she and him tried to flee her family caught the both of them and killed her lover. It was then that she left her family and renounced her name. She would say nothing more except that he kind of looked like you but longer hair and broader shoulders and that you're a little taller. She then kicked you in your groin and told you harshly to never let your guard down.\n\nYou didn't show it at the time but you froze when you heard this. This must not have happened as long ago as she makes it seem because the description of the guy matches your uncle, Sam, who went missing not long after you were born. All that was left was a note that said \"Primavera\" and nothing else. You then asked if the name Primavera meant anything to Alice. She avoided the question (with an uppercut). You plan to make her tell you everything if... no, when you kick her ass.", "action_results": [{"action": "A noise from your room", "result": "It seems that nostalgia helped you wait because you can hear that someone is in your room. Your nose tells you from the all too familiar scent that Alice is in there beating your sheets flatter than paper. You burst from the bathroom and rush Alice who has a surprised and almost comical look on her face. Luckily you manage to land a few good blows before she realizes that you aren't playing around and taking this spar seriously. She tries to do her signature groin kick on you but you prepared for this and but a cup made of metal on the stop this. After you render her kick useless you grab her leg and flip her over, you then pin her arms on her back and put your knee into her back as well. Victory is yours.", "action_results": [{"action": "\"I win!\"", "result": "You wish you had a camera. The look on her face is priceless. You then state your request and she accepts it. She tells you that she'll tell you every last detail tonight, at dinner, alone... together... (do i really need to reiterate that any more?)\n\n\"Like a date?\" You ask.\n\n\"It's not a date, but at least it's not an interrogation.\"\n\n\"Good point.\"\n\n\"Although there is a condition to this 'date'... no questioning until after we eat, then when we come back i'll tell you everything alright?\"\n\nYou agree and begin to prepare for the dinner ahead... but you have to ask at least one question.\n\n\"Alice?\"\n\n\"Dress casual, bring a coat to blend in, it's November.\"\n\n\"Alright thanks, see yah!\"", "action_results": [{"action": "Later that night...", "result": "A few hours later you're on a rooftop with Alice overlooking the city. Both of you are trying to pick out which human looks tastier. You point out a few easy pickings and Alice picks out a guy who could've been mistaken for a pro bodybuilder. Just your luck. After jumping off the building into a shady the both of you go into hunting mode and begin to stalk your prey from afar. You see that he intends to cut through a nearby park and Alice sees this as well. You both increase the following distance to compensate for the lack of crowds to hide in. Suddenly you see an opportunity to strike, the guy bent down to pick something up off the ground.\n\nYou can strike at him now or you can wait and follow him some more.", "action_results": [{"action": "Be patient", "result": "You sit back and wait for another opportunity to strike but it never comes. The guy turns around and pulls a shotgun out from his coat and fires it in your general direction. You manage to duck behind a tree and as the pellets whiz over your head you see that they're incendiary rounds. That makes it obvious that this guy is a vampire hunter. You pop back up to make a run for his gun but he was expecting this and fired another round in your direction. This one connects and it not only sets you on fire but it also causes massive pain before you finally lose all feeling because all the nerves in your body get burned shut by the flames. You become just another notch in the hunter's weapon.\n\nGAME OVER", "action_results": []}, {"action": "Strike", "result": "Putting every Olympic runner in history to shame you charge with blinding speed towards the prey while nearly silent. The guy turns around but it is too late, his neck is already snapped by the time he realizes that you are there. Alice runs up behind you and the look on her face is that of surprise. She is obviously impressed with the kill and you offer first bite to her. After she finishes you drain the last bit of blood from the guy and tear his body to pieces and quickly bury them in different corners of the park, all in all about thirty seconds of the date down the drain. Alice smiles at your efficiency and you take her arm and begin to walk through the park like a happy couple. Then you start the questions.\n\n\"Alright let's begin, who's Primavera and what does it have to do with me?\"\n\n\"Primavera is the name of one of the two warring families. The other is Sangre. The Primavera is Italian vampiric nobles and Sangre is Spanish vampiric nobles. The Italian and Spanish vampires have been warring for centuries and even they don't know how it started. Since I am of the Primavera you are technically also part of them. However since I left the family this does not apply anymore.\"\n\n\"What does the name Sam mean to you?\"\n\n\"Sam was the name of my lover from the Sangre family. He was kind and sweet although his outlook on the world was a little childish. He believed that all people were capable of kindness and good. This eventually led him to his downfall.\"\n\n\"Why me?\"\n\nShe gives you a confused look and you explain your question.\n\n\"Why did you pick me, out of all the other people in that club?\"\n\nYou reminded me about him. That's why I asked you that question about vampires and humans coexisting, to see if you shared his beliefs.\n\n\"Would you like some dessert?\"\n\n\"Actually that isn't a bad idea...\"\n\nYou two spend the rest of the night (after dessert) chatting about everything from fighting to music.", "action_results": [{"action": "Many years later.... (Epilouge)", "result": "Approximately 5 years later\n\nYou hear a knock on your door and you open the door. At the door is a man in a fancy looking suit which you assume is Armani. You can see that this is no ordinary man due to his vampiric scent. \"Hello,\" He says \"I am a representative of the Primavera family and I would like to...\"\n\nAt hearing Primavera you shut the door in his face. You and Alice do not want anything to do with either Primavera or Sangre. Your visitor has enough sense to not knock again but not enough to step away out of earshot before he makes a call on his cell phone.\n\n\"Boss.\"\n\n\"Yes, what is it?\"\n\n\"They aren't going to join\"\n\n\"Oh well, that's okay. Go ahead and kill them.\"\n\n\"My pleasure sir.\"\n\nThe last thing he ever does is hang up his cell phone. And by the time he does that you're already halfway to his throat. He turns around and you are the last thing he sees as you proceed to annihilate him with the years of combat training provided by your mate. You look back at the house and Alice is already there carrying a two large sacks, one of which you know has your name on it. It was time to move again.\n\nApproximately 20 years later...\n\nYou and Alice happily spend your time moving all over the world from place to place but you both avoid Europe like the plague, for traveling there would be a death sentence. You both spend the rest of your happy lives traveling the world and helping those in need (when it was profitable). Eventually you are both contacted by Primavera again. They beg and beg and finally after intense negotiations (both on and off the phone) you use your persuasive powers and both you and Alice are accepted into Primavera as it's king and queen. Eventually you and Alice manage to finally end the conflict between the two families and peace is brought to the vampiric world. ALthough there is still bad blood between the families peace is officially declared and both families work to establish a partnership between them.\n\n100 years or so later...\n\nAs King of all Vampires you united the two clans under a single banner. You also bring a golden age to the vampire race as vampiric children roam the streets of Illium, the country of Vampires. You keep this region of the world secluded from the rest and rule with an even hand. Alice bore many of your children and went into what is known as the Deep Sleep. A process in which a vampire turns into stone and sleeps for centuries until the time is right to re-enter the world. This time comes to you too and when it does you descend into your family's crypt and lie down with your beloved Alice. As you begin to fall asleep you wonder what the world will be like when you awaken. Only time will tell...", "action_results": []}]}]}]}]}]}]}]}, {"action": "Leave Her to Die", "result": "You decide that your life is not worth risking and the beast catches up to Alice and she is slain. The beast then turns toward you and starts to chase you. The beast is re-energized from killing Alice and he catches you faster than anticipated and you are killed quite quickly.\n\nIn your dreamworld you died and after your 7 days are up Alice finds you in a comatose state and after a few hundred years of prolonging your life you are killed to be put out of your misery.", "action_results": []}]}]}]}]}, null]}]}]}]}]}, {"action": "Try and get away from this crazy broad", "result": "Unfortunately she doesn't want anyone to know her secret, while you desperately try to flee from her like a maniac she pulls out a pistol and shoots you. Her aim is quite good so she shoots you in the head. Have fun being dead and not undead.", "action_results": []}]}]}