{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=11274", "context": "", "first_story_block": "You awake in a great hall, huge stone pillars holding up the high ceiling, fine stone art carved into the perfect marble walls. Couples dressed in medieval finery dance around you, ignoring the nearly naked man on the floor who just woke up. With surprise and embarrassment you realize you're only wearing a loose pair of breeches that only reach to your knees. You keep a hand on it to stop it from falling down.\n\n\n\"Ah! Another one. I had just begun to believe the party was over. Seems the second round has started! Grab a lady and begin the dance anew. Oh, you might want to put something on first. Or not. Whatever you think is an appropriate way to celebrate!\"\n\n\nA man sits in a stone throne a few steps up in front of you. He stares at you with dark red eyes as he taps his bare feet on the lovely gold and red carpets. His pure white hair is pushed back over his head, over his ears, and under a dull plain looking iron crown, more like a simple iron circle than a crown. He puts his hand over his chin in a thinking position.\n\n\n\"On second thought; that is the perfect way to celebrate! Everybody naked! Brilliant my speechless friend! Haha, someone grab my friend here a partner!\" He jumps up and rips off his coat.  \"Nevermind, I will!\" He grabs your hand and pulls you up, spinning you around and around.\n\n\nEveryone around you is going through the long process of undressing and he pushes you into the crowd, towards the only person done, a woman who gracefully catches you before you not very gracefully fall into the nearly naked bodies.\n\n\nYou don't know if this is a nightmare or a fantasy.", "action_results": [{"action": "Where am I?", "result": "She's behind you, holding you up. You get back your footing and turn around to face her. She grabs your hands and starts to dance, forcing you along. Her long black hair is pulled up into a ridiculous hairdo, nearly making you laugh, but her intense face stops you.\n\n\nYou open your mouth to ask the question, but she places one finger over her red lips.\n\n\nShe turns her head and looks at you.\n\n\nYou look around. The women have all stripped to down to their shifts and the men down to breeches or hose.", "action_results": [{"action": "Ignore her warning", "result": "As soon as you open your mouth again she pushes you away and stops dancing.\n\n\nThe crowd has stopped and is looking at you. The man, now minus his tight black pants, stares at you. You noticed that some of his guards are walking torwards you.\n\n\n\"Please, please, hold all questions until the end of the presentation.\" He claps and everyone resumes dancing.\n\n\nEveryone but you that is, as his guards have long since killed you and are now in the process of cleaning up the mess your blood leaves on the smooth tiles.", "action_results": []}, {"action": "Keep quiet for now", "result": "Considering you have no idea what in the hell is happening, you decide to take her silent advice. You nod to let her know you understood her message. Her large lucious lips briefly show a tiny smile.\n\n\nShe leads as you slowly dance. She tries to bring you up to speed, but you've no talent for this.\n\n\nSuddenly, you hear it. A cacophony of bells and whistles, flutes and drums. The horrible sound is quiet at first, messy and brutal, but as the volume grows it becomes cleaner. The cruelty of the sound is transformed into music by the strings that fade in.\n\n\nAnd then your feet will themselves along. They know every move, exactly what to do, exactly when to do it. You hands are placed at just the right place on your partners body. You search for the source of the sweet sound, seeing the man sprinting and springing all around the room, screaming. The music is so loud you can only hear his roars of laughter as he passes by you.\n\n\nThe choir starts in and the sound feels like honey. The men at first, low basses, then the women join in, their high sopranos filling the air with such lovely wisps of beauty. You lean your head back and open your mouth to drink in the sounds.\n\n\nYour partner leans against you closely as dance, right against your chest, but the music is the only thought in your head and heart. Your body almost don't care.", "action_results": [{"action": "Quiet", "result": "And then it stops without notice. You nearly fall down, and would have, if it weren't for the support of your partner.\n\n\n \n\nThe strange man has stopped dancing, his laughter the only sound now. \"Stop! Stop stop stop! Everyone!\"\n\n\nThe people had continued dancing without the music, but now at his word they halt their movements.\n\n\nThe man looks around at them all. He squints his eyes and angles his head with a hand cupped around his ear.\n\n\n\"What? Time already? It can't be. Oh yes it is, is can be, because it is and therefore must be and can be. Oh well, next time, same time. And you, find some proper trousers . Here, you can have mine.\" He hands you his black pants. You reach out to take them, in shock.\n\n\n\"On second thought, no.\" He quickly grabs it back. He walks through the wall behind his throne, disappearing, all the while laughing.\n\n\nThe room breathes a collective sigh and everyone is searching the floor for their clothing.\n\n\nYour partner is putting on her clothes, and you avert your gaze.\n\n\nPeople all around are talking now, and she finally says something.\n\n\n\"Relax. I bet you have many questions. Come. We'll find you something to wear.\"\n\n\nYou open your eyes and she's wearing a simple grey outfit, probably something that went under the ridiculous dress she's carrying now. Her hair is down now, and you can't help but appreciate her stunning beauty.\n\n\nYou take a breath. You'll listen to her and keep quiet for now, at least until you have an inkling of what's going on. This feeling of tension inside you isn't just because you're mostly naked... But it probably would be better if you were wearing something proper. You blush.", "action_results": [{"action": "She guides you out of the room", "result": "She takes your arm and pulls you towards a corner of the great hall.\n\n\"The man you just met is Zaren. He's... Complicated. All you need to know right now is that he's God here. If he asks you to do something, it's not a question. You obey him. Without hesitation.\"\n\nShe pulls you through the stone blocks of the wall before you know what's happening. It's chilly on your naked skin and tickles slightly.\n\n\"A few decades ago Zaren had an argument with... with a door. Apparently, the door won, so he decreed that all doors be hung and then burned.\" She looks straight at you, not even blinking. \"It was a few years before he got sick of that and decided to introduce these fake walls.\" She pulls you through a narrow hallway, past tapesties of Zaren eating breakfast. In every single one he's moving. You can hear whispers coming from them, most of them asking if it's on. A few people pass you, guards and servants by their look. None of them gives you a second glance. You look in awe at the beautiful artwork on the walls.\n\n\"Oh my, I'm forgeting my manners. It's good Zaren isn't here. We must be quiet. He hears much of what is not meant for him. My name is Ophelia.\" She pulls you through a series of walls, all made of gorgeous stone with artwork carved into the individual blocks. \"It's been a long time since one has joined the upper ranks. Maybe you'll even last. Although I've never heard of someone... Well, just appearing out of thin air. Something that Zaren would do certainly, but I think he went through that phase a few hundred years ago. It's hard to remember all the things he does... You will be joining the upper rank, won't you? You must be, Zaren did not request your absence, as he calls it, or an execution, as we call it. So, why are you here?\"\n\nShe pulls you into a room full of mannequins and fabric, with colourful carpet on the floors, walls, and ceiling. \"I'm sure the Tailor will find something for you. So why you are here?\"", "action_results": [{"action": "Where is here, exactly?", "result": "\"Oh my. Now that is a very good question. But here comes the Tailor.\" She turns around and curtsies towards the door.\n\n\n\"What -\" You stand there speechless.\n\n\nA man walks into the room and bows, a spotless fine black coat shimmering around his white furry torso, four furry little limbs poking out of the coat. They are end in three long, delicate fingers with little hairs at the base and bare human-like tips. His hairy legs have the same pattern, with his feet looking almost normal. Large wings are folded at his back, trailing on the floor.\n\n\nHis large black eyes poke out from his white fur and his human jaw opens to speak in a slightly buzzing voice.\n\n\n\"Hello, good lord. I am the tailor. I must say, your eyes are a wonderful colour. Such a light but intense brown. They will be a challenge to match correctly, but I will enjoy creating your outfits for you.\"\n\n\n\"What...\" You take a step back, bumping into a mannequin and accidently knocking it over.\n\n\n\"You will have to work on your coordination if you plan to be part of The Court. Dancing is quite popular here. But even if you fall or some such thing, you will look wonderful. Still, that is not my job. Now come over here, I must measure you. Take a look around at the outfits. You may find one you like.\"\n\n\n Ophelia stares at you and gestures. You timidly take a few steps forward.\n\n\nThe tailor places his finger tips on your arms, mummering to himself. \"Don't you need measuring tape for this?\" You ask.\n\n\n\"Measuring tape? Bah, I am better then the tailors you have known. A true master can look at a man for a second and make him a god within minutes.\"\n\n\n\"I've never known any tailors.\"\n\n\n\"Well then trust me, I am the best. Now lift your arms please?\" As he slides his hands around your arms and chest you look away, uncomfortable.", "action_results": [{"action": "Look at the strange carpeted walls", "result": "Colourful fine carpets cover all the walls, some more rugs hanging over them in turn.\n\nThe carpets are like a dark, dull rainbow. The carpet itself is black, with colours seeming floating over it like a reflection in water. The colours swirl and mix and seperate so slowly you have to careful look before you see the emerging patterns of dancing colours.. You watch a batch of a grey blue twirl around with concentrated yellow and green drops, absorbing them.\n\nThe rugs draped over them like curtains over imaginary windows are stationary pictures of outfits, each in a different pose. They continue from down the walls onto the floor and a few hang from the ceiling. You recognize a few outfits, but what really catches your eye is the one hidden on the far left, the one that looks just like Zaren's black finery. It's the only one with a person in the clothes.\n\nZaren's in it, posed elegantly in his black and gold coat. His arms are raised as if to greet you, but his face perfectly shows his comtempt at your very existance. All but his eyes, which are laughing. You do not know if the contempt is the joke.\n\nThere is a man behind that insanity, you are sure of it. Whether the insanity is a cover or not, you do not know.\n\nYou look back at the swirling patterns. They are starting to resemble pictures now, just barely, but the proper shades are coming in...", "action_results": [{"action": "An Arena", "result": "Your heart beats.\n\nYou stand in an great amphitheatre, on shifting sands. It's quiet for but a moment, and then the clashes of weapons rings out in great echoes, with cheery yells of murder providing a bass quality. Smiles flash all around as people hack or are hacked about and nothing but snorts of laughter without the barest hint of pain accompany the carnage.\n\nSprays of blood float on the air. Spilled guts and limbs sink deep into the sands. Heads laughing are choking on sand and sweet blood spills out of their lifeless bodies.\n\nYou smell gore in the air and it clouds your thoughts. Little droplets rain down in your vision. You count each as they pass. Some spray in the corner of your eye hits your cheek and you can taste the liquid life.\n\nLiquid life.\n\nLife.\n\nYou're alive.\n\nWhere is your weapon?", "action_results": [{"action": "A claymore on the ground to your right", "result": "The heavy blade is laying on the ground.\n\nYour heart beats.\n\nYou survey the fight.\n\nIt's a giant mass of men screaming in a variety of different emotions. Joy here, fear there. You can see spectres spectating, watchers watching, and shadows spectating as well, because what else would they do? Be serious.\n\nWith all the chaos, if you crouched you could conceivably have more cover. A lower center of gravity would also be a benefit. A quick roll would provide more cover and speed, but lack the same control. The ground, while littered with weapons and bodies, has a clear path to your weapon. You could try to crawl there. This would provide the most cover, but you risk being stepped on, and what you gain in cover you give up in speed.\n\nBeat.\n\nMove now, or risk danger for another look around.", "action_results": [{"action": "Crouch", "result": "You shift and fall, knees bent, head low. An arrow whistles in the air.\n\nBeat.\n\nYou senses collaspe in on this one thing. The arrow shines brightly as the sun catches it and then wades in and out of bloody bodies.\n\nYour toes curl in the sand, trying to the draw the rest of your body in. Your arms follow your slowly moving torso as it curls as well. You blink and lose the arrow. When your eye open your head to low to see it. You can only hope. You push foward with one foot.\n\nBeat.\n\nThe arrow catches your left shoulder blade and tears through the top layer of muscle and skin but leaves your body mostly intact.\n\nBeat.\n\nYou grit your teeth and swallow a gurgle of pain. You've had worse. You lie.\n\nBeat.\n\nBeat. Beat.\n\nBeat. Beat. Beat.\n\nYou reach the sword and grab it with your right hand, using all your strength to swing it up and around so your weak hand to hold it.\n\nThe man in front of you laughs as back is penetrated by the blade. The combination of the unbalancing swing and the collision shock your hands and they tingle. Oh wait, that's because someone cut them off. Now who would do such a thing.\n\nA laugh swirls around in your mouth and tastes great. You let it out and the fear and terror and pain all disappear.\n\nA pommel strike to the face later and you're laying on the ground as the battle rages on, spitting out sand and blood and teethe as you laugh.", "action_results": [{"action": "Back in the room", "result": "You blink. The world is... well, not really \"normal\", but... it's better. You bring a hand to your head, fine, but tears are falling down your face. Colours spin in your eyes. The madness of the walls creeps and lurks in your head and it's shrieks and whispers make your ears bleed.\n\n\"You looked at the walls, didn't you? Where did you go? Nevermind, it's not important. It's not frequently a pleasent place anyway. Now look at me. Hmm, the barber will have to take a look at you. Fuzzy face, tangled hair. Still, not my job. Now please stand still and um, please do not touch anything. You don't seem graceful. No offense meant, my good sir.\" The Tailor lets go of your arm and waddles off on his strange legs. He walks straight through a carpeted wall.\n\nYou carefully sit down on the floor. This isn't real.\n\nBut it is.\n\nThis can't be real.\n\nBut it is.\n\nIt was a dream then. But you're --  you're awake now. It was a dream. Just a dream.\n\nNo, no, no, NO, NO, NO! This can't be happening. The world is spinning now, and you feel faint and dizzy. There's a sour taste in the back of your dry mouth. Don't open your eyes. Don't look up. This isn't real. This isn't real. This isn't happening. Your heart pounds. Your fists close and your arms tense.\n\nNo, no, no, NO, NO, NO!\n\nSomething touches your head -- NO! \"Get away! Get away! Take your bug men and crazy kings and doors and dreams and shove it!\" You fling yourself backwards and push off the attacking nightmares.", "action_results": [{"action": "Ophelia", "result": "You hit the nightmares and they gasp. You open your eyes.\n\nIt's just Ophelia. Just Ophelia. She's holding her wrist in her other hand.\n\n\"I...\" Your mouth closes. This is it. This is all happening too fast, too fast, too much. You didn't mean to hit her but the world is just spinning now.\n\n\"I'm sorry. It's been so long since any of us have seen someone new to The Court, let alone to this world. Most people -- well, besides you, everyone -- come to this realm through the slums and move up. I'm afraid you'll have to forgive them. This place changes people... Some for the better, like the Tailor. Or at least he would say so. Most... Well, you'll see soon. Please, just calm down, and I'll answer all your questions. Zaren will forgive us this.\"\n\n\"I'm sorry... I didn't mean---\"\n\n\"I know. Just hold on a moment. We'll get you some clothes and then I'll take you to your rooms. I'll explain there. Just hold on.\"\n\nYou take a deep breath. You're under control now. Those walls... They play with your mind. But you're back now.\n\nThe Tailor walks back through the wall.\n\n\"Now sir, please take a look around the room. The mannequins have some samples, the carpets others, although you probably would like to stay away from them now. Small changes can be made quite easily to the design, or even after if you are disappointed with my work, although I doubt that will happen. Anything custom will have to come later I'm afraid. You have much work to do my friend.\"", "action_results": [{"action": "The black outfit", "result": "You point out the tapestry in the corner, the one with Zaren in his shining black clothes. There's something about it that intrigues you. Something that just draws you in.\n\n\nOphelia and the Tailor give each other a look.\n\n\n\"I'm... I'm afraid you'll have to choose another my friend. I don't believe Zaren would be... happy. Wait. I think I have something in a similar style. Take a look at this. You may request changes if you wish.\" The Tailor pulls out a tapestry and peels it apart. You did not notice before, but they're made of different layers stuck together. Each layer contains one piece of the outfit.\n\n\nThe pants are the same thin fit, but looser at the ankles. The belt has two buckles of polished gold and beautiful leather. \"The tanner can make you such a belt. It is only cloth that I may create.\" The Tailor buzzes. A tight but long shirt with slightly ruffled sleeves is next. It's tight around the torso and hugs the waist with large shoulders. Over that comes a waist coat with shining gold buttons.\n\n\n\"It is designed with a similar cloth in mind and the same colours. Colour, that is. The shirt is long sleeved and with a waist coat, but I will keep your wishes in mind. You may take these rags for now. It will be completed soon. I suggest you visit the barber, cobbler, and tanner. Oh, and all gentlemen of The Court are expected to have their own sword. Something about duels. I never saw the point of it, but it's been a long time since I was... different. That reminds me. You should have been here before. The style now is very fond of vibrant colours, not this... Monotone thing you have chosen. That must have been at least decades ago... Off, now.\"\n\n\nYou don't particularly feel like hanging around, so you accept his choice and the Tailor fills you hands with fine shirts and breeches, simple but elegant. Only he would call them rags. He then turns you around and pushes you along and out. You nearly panic when he shoves you into the wall, only to remember that it is in fact a door.\n\n\nOphelia walks down the hall. \"Coming?\"", "action_results": [{"action": "Follow her", "result": "\"One second.\" You call out.\n\n\nYou'd prefer to be clothed at this point.\n\n\nYou slip on a pair of pants and a shirt before running, trying to catch up to her without dropping any of the things you're carrying.\n\n\nShe looks at you. You feel self conscious suddenly, despite your newly clothed appearance. You look straight ahead, trying to keep even steps and the same pace as Ophelia, who walks fast.\n\n\n\"Zaren didn't tell me where you'd stay. I suppose the guest quarters --  no, that's no good. They're too far, for one, and I don't believe Zaren considers you a guest. He is very fond of order and organization. Or at least the order and organization of others. We'll drop these off in my room for now. We have others to visit. Please wait just a little bit longer.\"\n\n\nYou and Ophelia walk in silence. The stoned passage gives way into large rooms with bustling people. Ophelia leads you past a great fountain spitting out clear water and up stairs. Putting on pants was probably a good decision.\n\n\nOn the second level people jostle and bump into your and it takes great skill not to drop anything.\n\n\nAfter a few minutes of twisting turns Ophelia stops in the middle of a hall. \"This is my humble abode. Please just dump those off on my desk.\" Ophelia then pulls you through the wall. You doubt you'll ever.... get.... used.... to that?", "action_results": [{"action": "Ophelia's room", "result": "This isn't a room. It's a damn mansion. This is just one room and it's huge.\n\nExpensive carpets cover over parts of the floor. The high quality marble shows through in other parts. The walls are the same stones from the halls, but large paintings with golden frames cover parts of it. A giant golden chandelier hangs from the ceiling. Giant golden stairs are placed on both sides of the room.\n\nBefore the stairs stands a bronze statue of... Something. It looks like a regular man, naked but for a cloth that hangs from one shoulder, but something feels off about it. His face is turned down and his eyes closed, one mouth corner lifted in a sneer. He's kneeling almost in a pleading position, as if he dare not look up.\n\n\"Zaren's work. I suppose he thinks it a gift and why he's right of course. It's very lovely. Every so often when one disagrees with him death is not always the suitable punishment. I'm sure Tunc agrees with me, though he may not express it well.\" Ophelia grabs your hand and leads you quickly to a small, bare room behind the statue. Her face is ashen.\n\n\"Check the walls!\" She hisses at you, then brushes her fingers along the walls. You follow her example, even if you cannot fathom why. She and you check the whole wall and she takes a deep breath.\n\n\"Zaren has a habit of popping up when he isn't wanted. We can never be sure we are safe, but vigilance is the only option if we wish to survive. We must go soon, but if you have any questions that must be answered, ask now. We must be very careful what we say outside this room, even inside it.\"", "action_results": [{"action": "Tunc", "result": "\"Oh... Tunc. Yes. Tunc was a friend of mine... A very, very long time ago.\" Ophelia leans against a wall. \"You can drop those clothes off right here.\" She gestures towards the spotless floor. \"Tunc. He... Disagreed with Zaren a very long time ago. Zaren is unpredictable at best, and the king of chaos at worst. The power he wields is not a good combination with his nature. Tunc took a great risk. He thought he could challenge Zaren's rule. He... Failed. Listen closely. I don't care to relive the experience, so I will not be sharing any details, and I'd doubt you'd really want to hear them once you understand his fate.\" Ophelia looks down, unsure. \"I tried to warn him....\" She pauses and closes her eyes.\n\n\nThe memory is obviously a painful one for her. You are unsure of what to do, so you just stand there, dumbly.\n\n\nShe takes a few seconds to collect her thoughts and then continues in a monotone voice.\n\n\n\"Zaren is a creative.... Man. He didn't kill Tunc, exactly. He decided to create an example of him. He was feeling particularly... Well, something. It's hard to tell what goes on in his mind, though it gets easier after time. That's what scares me the most, I suppose. Anyway, Zaren is a powerful man. He has abilities that the rest of us cannot comprehend. He's kept Tunc alive even as he is now.\" She looks straight up at you. \"I suppose there's no easy way about this.  That statue out there is Tunc. Zaren did something with him. I used to cry, talk to him, anything, but there's a time when you just have to let go. Especially here. I'm not even sure if it was meant to be a punishment, reward, or just some twisted form of art. Zaren is confusing, misleading, childish, and any other number of unpleasant things.\"\n\n\n\"You said Zaren keeps him alive... Does that mean?\" You ask, afraid of the answer.\n\n\n\"Yes. He moves, ever so slowly. Once in a very great while he cries. That's where the \"art\" comes in.\" She sighs. \"Do you have any other questions?\"", "action_results": [{"action": "Zaren", "result": "\"Zaren? You mean besides his seeming complete and utter insanity? Well, I told you. He's a god here. The god here. There's not much else to him. I could tell you about all the things he's done over the years. All the times I nearly laughed at him. All the times others did laugh at him, and paid for it. All the times he laughed along with them. He's unpredictable. Don't forget it, ever. If you remember nothing else, remember that. I've seen him kill people for following his instructions to the word. He's done things... Things that are worse than death. Tunc's fate is far from the worst.\"\n\n\n\"Then why? Why do you let him do it? Why not do something about it? Surely he couldn't stop you all?\"\n\n\n\"Look at Tunc. As bad as things are, they could be worse. Zaren's powerful in ways even the strongest of us can't imagine. Tunc used to say that reality is Zaren's bitch. He was frank like that. Everyone here has at least the smallest ability for magic, and some are very talented, but Zaren's in a class of his own. Besides, most have adapted. They've learned to live with it. It doesn't matter how awful something is. If you live with something for a long time it becomes the norm. You can only be in sheer terror for so long before it bores you.\"\n\n\nYou can see it in her eyes. The fear that has long given way to numbness.\n\n\nShe attempts to smile. \"Better the devil you know.\"", "action_results": [{"action": "Where am I", "result": "\"Now that's a good question. The short answer is: I don't know. Nobody does as far as I know. Except, perhaps, for Zaren, but I don't think he's likely to share that information, do you? You really never went through the slums?\" Ophelia narrows her eyes suspiciously.\n\n\n\"I don't know what you mean.\" You answer truthfully.\n\n\n\"The slums are what they are. A broken down place infested with poverty and suffering. Everyone, nobility and peasants alike, appears in the slums. People don't really have children here. Pregnancy is extremely rare among the population, even over large periods of time. Most women will go their whole life without a child. Most pregnancies will end in miscarriages. Almost all of those carried to term will be stillborn. Of the handful of people over our whole history to be born here... I've never met one. I've heard that they turn out strangely, even compared to the average citizen. Nothing specific, just strange. There are rumours that Zaren is one, but I doubt a thing like him was even born, even in another place. To my knowledge there is no one older than Zaren alive today so I guess we'll never know. Anyway, people will simply \"arrive\" here instead. From somewhere else. Always... Well, you're the exception, but always in the slums. They're not a pleasant place. The slums are filled with screams and the raving of the mad. The \"upper ranks\" to which you now belong are comprised of the completely sane, or at least the sanest. Zaren... I don't think he's insane. I've known him too long. No, I think he just likes to watch us suffer in our own filth.\"\n\n\n\"So you can't tell me anything about where I am.\"\n\n\n\"No, I can tell you much about where we are. I just don't know where where we are is. I can't tell you anything about where any of us came from. Most people don't remember anything and even if they do it's after a long time of searching. But it just tears them apart. It's best to forget if you start remembering.\"\n\n\n\"But I... I remember.... Something.\" You're not sure. It's that faint form of memory, but vivid in strange places. More like a story that you've visualized.\n\n\n\"Forget it. Or if you can't forget it, ignore it. At the very least leave it alone. Do not go any further into that abyss.\"\n\n\nBut this memory is to real to forget. Ophelia looks at you, rolls her eyes, and sighs. \"Okay. Tell me about it, but then that's it. Don't ever think you can make it farther into your own mind. It won't end well.\"\n\n\n\"I remember. I remember... \" Words roll of your tongue as you look through the past towards the only memory you can find.", "action_results": [{"action": "White", "result": "It's white. Some of it is powder and some is thicker and clear. Some of it sticks together.\n\nSnow. It's snow. And it's falling.\n\nYou look up. The sky is dark with little flecks coming into existance as they get close enough for you to see them.\n\nSnow crunchs under you.\n\nYou open your mouth and catch a flake on your tongue and then laugh. You look at one closely. It's pretty with its twirls and patterns and designs.\n\nYou dance, dance in the snow, falling, rolling, screaming with laughter and fun.\n\nEach flake unique but nothing without its friends.\n\nThen it's gone. You have it here in your head now, fixed and alive, something you'll remember. There's more...\n\nBut that's gone, at least for now.", "action_results": [{"action": "Memories", "result": "Ophelia is speechless for a minute.\"Wow. That's a lot, well, compared to me. You, you like... Liked nature, didn't you?\"\n\n\n\"I don't know. Maybe. It's all I remember anyw--\"\n\n\n\"No. No. I'm sure you have more in there. Don't try to remember... But if you do... I don't know if we come from the same place, but maybe, just maybe, we do. If you remember enough it might trigger my memories too.\" Ophelia looks hopeful. Happy. You don't think she'll ever remember if she hasn't by now, but it's not in your heart to crush her new found hope. She smiles for a brief moment, caught up in a memory that isn't hers yet is still her only link to her potential past, even if it's faint at best.\n\n\nThen she remembers where she is right now and shakes her head to rid her of her folly. \"Anymore questions? We don't have much time.\"", "action_results": [{"action": "Doors", "result": "\"Oh yes. I told you about the \"fight\" Zaren had. He got rid of all the doors in The Court, except for the large front doors to the palace. Apparently they \"took his side\". Without doors we lacked privacy, but Zaren didn't care. Probably didn't eve occur to him. But after a few years he had his brilliant idea; fake walls. No one had any idea he could do something like that, but I don't think it surprised anyone. That's why we check the walls. He can build them anywhere he wants, so we must be vigilant, vigilant always. It's tiring at first but you build up a habit eventually.\"\n\n\"Doesn't it... Freak you out?\"\n\n\"At first it was a little strange, but after a year or two you don't even think about it anymore. You start to forget what doors look like.\"", "action_results": [{"action": "The Court", "result": "\"This is The Court. It's part of this realm. It, the slums, the markets, and a few other districts make up about half of it, with wildness making up the other half. Zaren keeps meticulous records of nearly everything, including maps. I'm not sure why, he's a very chaotic person, but I guess even chaos is ordered from time to time -- otherwise it would have an order to it. We should visit his libraries some time. Just one of them would take a very long time to read through. Every so often he'll change the realm so much that previous records need to be updated, so he purges almost everything and everyone starts again. He always keeps a very accurate record of the books he's had though, even the purged ones. There are rumours he keeps copies of them somewhere after he destroys the others. I wouldn't put it past him, but there are many things only Zaren knows, and this is one of them. But that doesn't really answer your question, does it?\n\n\n\"Tell me about The Court.\" You ask.\n\n\n\"Well, it's composed of servants, guards, and merchants and the like that look after us from the upper ranks. You've met the Tailor and seen a few of the guards and servants. You'll also meet the Tanner, the Shoemaker, the Barber, the Blacksmith, the Jeweler, and various teachers and instructors. Probably a few more I'm forgetting. Almost all necessities and wants are provided for us. We are the only sane ones left in this forsaken realm. We are basically Zaren's playthings. Let's see, what else....\"\n\n\nShe stops to think for a moment.\n\n\n\"We're in the west wing right now. It's devoted mostly to private residences. Zaren will assign you one soon. For the most part he'll let you decorate it as you wish -- oh, that reminds me, the Framer, the Painter, the Carpenter, the Mason, and a few others. Anyway, he may give you some \"gifts\", akin to housewarming gifts. He would be \"offended\" if you did not accept them. He's given me things: paintings, statues, furniture. A lot of it is weird and out of style, but surprising none of the chairs will break... or strangle you, or something else Zaren would find funny. Let's see... There's the south wing which houses the servants quarters and the kitchens and other such things, and the south tower, which is primarily for the craftsmen. What is literally called The Court is in the northern end and is filled with Zaren's gardens, libraries, mess halls, and other areas for social gatherings. Oh, the gymnasium  as well. The east wing holds more craftsman and merchants. Some of the market district blends in with this area. The west wing also includes the entrance to this palace and the long hall, as we call it. Zaren's throne room really, but he also has thrones in other rooms.\"", "action_results": [{"action": "Events", "result": "\"We also have many events, like the dance you saw. The Tailor mentioned duels; all the men learn how to fight, as well as quite a few of the women. Zaren finds it amusing, although he doesn't allow anyone to die. Most of the time. We have feasts every few days and a hunt the next day. Lets see. There's contests and tournaments. You must participate in at least one event. That's where those teachers and instructors are useful. What else... I think that's all. If not, well, you'll figure out the rest as you go. You seem like you already know how to dance, so that's one less thing.\"\n\n\n\"But I don't.\"\n\n\n\"Then what was that back in the dance hall?\"\n\n\n\"Didn't you hear the music? It was so loud.\"\n\n\nOphelia's eyes narrow. \"What music?\"\n\n\nCurious.", "action_results": [{"action": "It's time", "result": "\"It's time. No more questions. That reminds me; one more thing you should know. Time functions strangely here. Nothing grows or changes unless Zaren wills it. Every so often he'll change The Court - usually not to a noticeable extent but once in a while there are some great changes. But back to the point; time is strange. We don't quite... Age. But that's a discussion for later. We still have to visit the Shoemaker, the Blacksmith, the Tanner, the Jeweler...\"\n\n\nThe list feels nearly endless, though it's actually short. Ophelia goes through them as she leads out of the empty room, back into the halls, and towards the south tower, leading you through winding halls, large decorative rooms, up and down stairs, out onto a blooming courtyard and finally in front of the south tower.\n\n\n\"We didn't go this way before.\" You ask, curious.\n\n\n\"You were naked before. I didn't think you'd want to.\"\n\n\n \"Fair enough.\"\n\n\nThe tower itself is huge, made of tiny white stones grinded and polished to create a perfect cylinder. The entrance is a pair of huge and heavy stone slab doors that are currently open. The tower is a hub and dozens of people are walking in and out at any one moment, mostly guards, servants, and nobles. You and Ophelia are out of place in your plain clothing as the guards are wearing armour, the servants the uniforms of their specific job, and the nobles in outlandish outfits.\n\n\n\"We have much to do and little time to do it. After the formal dances Zaren will do \"realm maintenance\". I mentioned it before; this is when he plays around with the fabric of reality. That's why it's so busy. Everyone wants to get their work done before Zaren changes anything. It will be busy after too. The tower is frequently full, especially at these times, but I have seen it nearly empty a few times.\"", "action_results": [{"action": "The lift", "result": "\"Follow me.\" Ophelia walks past the guards and weaves through the throng of people with grace. You follow carefully, not wanting the heavy armoured feet of the guard to crush yours. She leads you up a spiraling staircase to a small platform reaching over the center. As soon as you step on it floats upwards. Ophelia grabs your arm to keep you from falling or freaking out.\n\n\n\"Be calm. If you stand still it is surprisingly safe. The Tailor's rooms are on the third floor, so it was unnecessary to take the lift. The others reside near the top though, so unless you would like to go up all those stairs we're taking the lift.\" Ophelia holds your arm tightly.\n\n\nYou force yourself to take a breath and try not to look down. Ophelia senses this is not the time to talk and so you just stand there, jaw clenched. Finally Ophelia takes a breath and talks.\n\n\n\"Who shall we visit first? As a new member of our lovely \"family\" you have priority, so don't fret about lines or some such nonsense. After we visit them all we should go back to the Tailor and pick up the beginning of what will, trust me, become a very large wardrobe .\"", "action_results": [{"action": "The Blacksmith (this will continue the story)", "result": "Ophelia smiles. \"He's a friend of mine. Please don't let his appearence frighten you, he is at heart a gentle man, but he can be a bit sensitive. I mentioned... Changes. Some, like the Tailor, are happy with their new existence. The Blacksmith is good at his job and enjoys it, but I believe he misses some things about his previous life.\"\n\nThe lift slows down and moves towards a space that it then attaches to. Ophelia walks straight off. \"Come on. Don't hesitate. It gets better with practice.\"\n\n You step off the lift. It leaves your feet and lowers again, leaving you with a nearly falling sensation. Your heart pounds and you don't care to look down, even though you're on a stable floor now. Ophelia holds your arm and pulls you forward, not even looking back at that horrible open space.\n\n\"It's a little way from here.\" Ophelia walks beside you, much more steady than you could be. With perfect posture and graceful movements she looks almost regal. \"Do you have any combat experience? The Blacksmith will have to make you many weapons of all kinds, especially if you are fan of the dueling, so you should be familar with them all and with more than one style.\"\n\n\"No... Well, I don't really remember.\" You can smell the fires and you know you are close.\n\n\"Oh... Yes. My apologies. We're getting closer. Zaren created these spaces to minimize the smells. They're particularly bad at the tanery; though we are beyond many of the more unhygenic and barbaric practices, it smells nearly as foul as it would if we used the original \"recipes. Here we are.\" Ophelia stops and pulls you into a searing steam filled room.", "action_results": [{"action": "Meeting the Blacksmith", "result": "The steam that flies in your face and shocks you quickly dissapates. Beyond it there is a large forge filled to the brim with tools that line shelves and walls, with all kinds of hammers, chisels, tongs, and other things you don't recognize of all different sizes; and works, both completed weapons that are displayed and those still to be finished. There is a regular anvil as well as other large metal pieces for shaping metal. There are buckets of water, ingots of different metals, and even polishing materials thrown around the large yet somehow still full room.\n\nThere the sound of a hammer striking metal, a steady, heavy ting ting ting. A man grunts with each sound. He turns around and you gasp. That is not a man.\n\nHe's tall, easily another half of a man. Horns curve out of his large furred head and a bull's nose move as he smells the steam; above those large and surprisingly deep blue eyes. His neck is thick and his arms bulge with muscles as he grips the hammer. He wears a thick leather apron to keep his skin safe, but still litle burn marks line his arms. As he steps forward you hear the clip clop of his hooves. He turns to look at Ophelia and his scowl turns into a smile. \"Ophelia! So nice to see you. It's been too long since you visiting me in Tartarus. I almost thought Hades had got you.\" His voice is baritone, regular but higher than one would expect, and softer. \"And this is?\"\n\n\"He's new. He... Doesn't have a name yet. That reminds me, we must discuss that as well. Anyway, he requires some weapons.\" Ophelia smiles at the Blacksmith and goes forward to hug him.\n\n\"Always business with you. Does he have any experience? Preferences? You will definitely need a polearm, sword, and dagger, but anything else will be your choice. You look like you can handle the heavier weapons. What would you prefer for a sword, first of all? One or two handed? Any specific type? We have something of almost everything. Take a look along the walls. Pick out anything you like. Feel free to try it.\" He speaks so fast you can't respond before he starts onto something else.\n\nYou look at the wall the Blacksmith points to, scanning the swords, but something catches your eye. It's in the corner up higher than the rest. You walk over and look over it. It's an arming sword of a regular length, with a plain black covered hilt and  pommel. The cross guard is a thin long diamond shape and the blade is double edged but dull.\n\n\"This one. This is the one.\" You barely hear yourself say it. Yoo careful pick the blade off of the wall and hold it; it's perfectly balanced and its weight compliments you well.\n\n\"Now that's an old one. Before my time even. It doesn't look much like my predecessor's work either. It's amazing it's lasted this long. Alright, hand it over to me. I'll make you one.\" The Blacksmith walks over to you.\n\n\"Can't I have this one?\" There's something about it. Something about the way your hand fits on it, something about the cool feeling of the leather over the hilt, something about the plain ridge in the middle that just draws you into it.\n\n\"I don't see why, but I don't see why not. Are you sure you'd not rather have a new one? I won't sharpen or polish it - that's not my job. Oh well. You must still pick out a dagger and polearm. Other weapons will come later. The Court is a game of time.\"", "action_results": [{"action": "The polearm and the dagger", "result": "\"You can use the grindstone and I'll give you some whetstones and polishing cloth. Still, you will need a dagger and a polearm of some kind. You look like you would fancy a heavier weapon. Take a look at the wall. I've got a poleaxe that I've recently finished; it's the perfect length for you. Let me get it.\"\n\nYou stare at the walls again, this time at one filled with pole weapons, some leaning against the wall, some packed on shelves, some in actual weapon holders. There are the long pikes that take down calvary lined on shelves at the top. Other weapons have spikes, tongs, flat ends for hammering, large and small points, curved blades, and any combination thereof. The choice between weapon types is dizzying, and even among the individual types there are more variables; weight, length, thickness, curve, even the way the shaft and tip are joined.\n\nYou carefully pick up a weapon or two and try them out, a swing, a thrust, a step and a turn. They are unsurprisingly heavy, much heavier than your smaller sword. You place them back, making sure they are not going to fall and cause an avalanche of weapons. You look around a bit. You manage to pick out a few weapons that look good.\n\nThe Blacksmith walks back in carrying one of the heavy weapons in one hand like it's nothing and places it on a weapon rack.\n\nIncluding the weapon the Blacksmith just brought in you've narrowed it down to three: a halberd about your height, with an end that has a long spike at the tip, a small axe on one side and a hook on the opposite, all mounted on a thick and sturdy wood pole; a slightly smaller warhammer with small but brutal looking spike on one side and the flat end for crushing, all on a mix of metal of wood; and the Blacksmith's weapon, a longer glaive, with a long curved blade on the tip and a small hook, on heavy dark wood.", "action_results": [{"action": "Halberd", "result": "You pick up the halberd and inspect it. It's heavy of course, but you're strong enough for it. The blade is engraved with long intricate lines and designs that circle around the point, connecting to rays from the ax blade and a hatching pattern on the hook.\n\n\n\"The halberd? A good weapon. It looks well suited to you as well, just the right height.\" The Blacksmith stands beside you, picks up the weapon he brought in, and places it in a rack. \"It's a complicated pattern, but a beautiful weapon.\"", "action_results": [{"action": "The dagger", "result": "You place your weapons on a table and stare at yet another wall. Again, there's a wide selection but you're getting better at scanning them. The shorter weapons are packed in much tighter in than the others, nearly making you dizzy. You feel a few; the short weapons are light and nimble with sharp edges and points. Though there are many different kinds and variations between all those you decide to narrow it down to just a few of different kinds.\n\n\nYou look along the choices and pick out three again; a cinquedea about a foot long, with a very wide blade that is decorative and an even longer cross guard with a short handle and pommel; a stiletto at the opposite end of the spectrum, with a very thin blade and handle that can easily pierce or find a way through armour; and a baselard, with a thicker blade, thin handle, and no cross guard or pommel to speak of.\n\n\n ", "action_results": [{"action": "The cinquedea", "result": "You reach out and lightly touch the blade of the cinquedea, running your hand over the tip to the fullers and the cross-guard. It softly nips your fingers when you run them over the sharp blade, drawing the tiniest drop of blood. You wipe your hand on your shirt and pick up the dagger. It's light and strangely balanced because of the abnormally wide blade where it connects to the hilt, but already you're getting used to it. You give it a practice thrust, twist it, and pull back.\n\n\n\"That one?\" asks the Blacksmith. \"Very well. You have great taste, I can tell. It seems just the right one for you. Well, we're done here for now. Armour will wait until later, because we'll have to measure you for each piece, and even then it'll take a while to make. Still, you're set up enough for now. It was nice seeing you Ophelia, and nice to meet you as well.\"", "action_results": [{"action": "Back to the lift", "result": "Well that's everything done so far. Not much really.\n\n\nOverall I'm not very happy with this in any way that counts. The story and characters aren't great so far, there's little to no real choices, and it sort of jumps from one part to another. The only reason I'm submitting it is because it's the most work I've ever done on a story, and I guess that's something to be proud of at least. At the best it's... rambling I guess.\n\n\nPlease tell me what you think.", "action_results": []}]}, {"action": "The baselard", "result": "\"That one?\" asks the Blacksmith. \"Very well. It seems you have good taste, though all my weapons are high quality. It seems just the right one for you though. Well, we're done here for now. Armour will wait until later, because we'll have to measure you for each piece, and even then it'll take a while to make. Still, you're set up enough for now. It was nice seeing you Ophelia, and nice to meet you as well.\"\n\n\nWith your right hand you hold out your arm to press against the baselard. The cool metal cuts your skin lightly, drawing less than even an entire drop of blood on your finger tip. You pick up the blade, smearing that crimson speck on the hilt. It's light as a feather in your grasp, perhaps too light after holding other weapons. With a practice slash from high and then to the left you sense the way the dagger reacts to force, gaining an understanding of its balance.\n\n\n\"Interesting choice.\" remarks the Blacksmith. \"Okay then. All done here I suppose. Armour will come later -- we've little enough time now, and it requires much measuring. But you've got everything you need for the moment. I'll be seeing you Ophelia, and you as well I suppose.\"", "action_results": [null]}, {"action": "The stiletto", "result": "You pick up the blade by its handle and feel the guard over to the tip, where the sharp edge bites into your finger and draws a small drop of blood. You wipe the blood off your hand and hold the knife in the light to look over it. Light as any knife or dagger is, it glides though the air easy, almost requiring no effort. You sweep at and the air, listening to it cry out in that distinctive whistle.\n\n\nThe Blacksmith looks over you and the blade before speaking \"You choose that one? Good. Well I suppose that's everything. You'll need armour as well, but you'll need to be measured before and then it'll take a while for me to make all of it. But regardless, we're done here for now. Good to see you Ophelia. Wealth and health to you both.", "action_results": [null]}]}]}, {"action": "Warhammer", "result": "You hold the war hammer in your holds and turn it over. Heavy, but that's the point. The hammer itself is completely flat and even, smaller than you'd imagine, but that only concentrates the damage you'd guess. There's a metal grip on it, with a pattern to make it easier to hold.\n\n\"Ah, the hammer. Brutal thing, that is. Just around the right size for you though.\" After placing the glaive he brought in on a rack the Blacksmith points to the hammer. \"It doesn't matter if someone's wearing armour. With this, a single whack and it'll smash through a helmet, and even if it doesn't, it can still break bones, cause concussions, and at the very least give a very nasty bruise. The hook can rip through armour too, though usually a good set of platemail can block it. It's good for taking down calvary. The hook can tear at the legs of a horse, get the man off his mount, and the hammer can crush the horse's legs.\"", "action_results": [null]}, {"action": "Glaive", "result": "You look at the glaive that the Blacksmith brought in. The wood is smooth, balanced and strong, and the blade looks like it craves blood. You pick it up and its just as heavy as you expected. It's simple compared to the other weapons; no intricate patterns or designs, but it's lovely nonetheless.\n\n\"The glaive? Ah, a good choice. I knew it'd be the weapon for you, just the right size.\" The Blacksmith stands beside you. \"It may seem simple, but I made it with the care all my weapons deserve. Of course, the wood work isn't mine, but all metal has been forged by my hands.\"", "action_results": [null]}]}]}]}, {"action": "The Tanner", "result": "\"I see. Get the worst out of the way first? I must say, the stench is worst I've ever smelled. He's not a... Nice man. Not mean, but wild. Feral, even. I've heard talk that he was born here, but he's one of the oldest I know of, so again, another thing we never may know. As you know, Zaren plays around with... the world. So don't let his appearence frighten you. If anything is terrifying, it's the stink. He's harmless really.\"\n\nYou slow your upward motion and the lift reachs another floor, where it attaches to a opening.  Ophelia walks off. \"Don't let the height scare you. It's quite safe as long as you don't linger.\"\n\nOne foot off and it feels stable enough. But as soon as your other leg leaves the platfrom descends. You go falling forward as your body compensates for the motion. Ophelia catches you and steadies you. \"Let's go. The walk is long, to keep the smell from the lift.\"\n\nOphelia leads you through a maze of halls and small rooms, as the smell gradually builds up and pains throb in your head. Just as you're about to pass out she pulls you into the tannery. There's a look of digust on her face. \"Let us meet the Tanner.\"", "action_results": [{"action": "Meeting the Tanner", "result": "The smell hits your face; fresh rather than the stagnant air outside, but just as bad. Your eyes water and you blink again and again just to see. You nose and mouth curls up in disgust. There are furs everywhere, not just pelts but entire animals. \"He prefers to skin them himself.\" Ophelia simply says. Tools for skinning and shaping litter the ground and little buckets of what you hope is water but is more foul smelling are sprinkled about the room. Larger vats are filled with the same foul odorous liquid, some of them colourless, but more black, brown, gray, or other dull colours. There are piles of furs, rags, and leather everywhere, some drying, being shaped, or otherwise in progress to becoming whatever they will be.\n\n\nA particularly large and dirty pile moves and -- oh dear, that's not a pile. It's a wereanimal, foul and feral, loudly poking around in dog corpse, picking out internal organs and placing them aside, sorting them. He pulls out bones and bits, and is covered in blood. Every so often he licks clawed hands with a slurping sound. He starts to peel off the skin with tools and surprising care when he lifts his head up and sniffs at the head. Turning around, he spots you and his mouth turns into a disgusting smile. \"Ophelia? Why hellos! Goodness, goodness, I ams filthy.\" Emphasizing and adding an S to some words he speaks to you. He grabs a rag and attempts to clean his hands, then wipes drool and blood from his face with them. He's covered in spotted, dirty, clumped fur, especially along his legs and shoulders, with a longer patch on top of his leading down his back on his spine. The hair is shorter on his face and snout, except for a few long whiskers that poke out of his lips and along his chin. The shaggy fur recedes along his hands, leaving nearly thin fingers for precision in his trade. He wears only a pair of shorts and bones on a string on his thick and long neck. His ears are pierced, the left is tattered and they flap about independent of his head. His eyes are large and green and watch Ophelia with a sense of sincerity. He seems more like a dog than anything else.\n\n\n Then, as if suddenly seeing you, \"I knows you! The Tailors said you were coming. Yesh, yesh. I have here somewhere... I cuts and cures it long time ago, ready for yous. Just waits, waits.\" He walks around in circles on his large paws and sniffs at the air. \"Yesh, yesh, I see its!\" He stretches up and pulls something off a shelf. \"They gives me nice shiny buckles for belts. I use the yellow ones this time. People like the yellow ones.\" He sounds like a child, a filthy terrifying child. \"You reminds me. You reminds me of hims. You gots the smell. He goods man, you know. Others they think he crazy, but he nice, he nice to mes. Used to be hads to thinks. All the times. Hard. Now I just do these things and I gets all I wants. He nice man. Waits, first I gots to cleans.\" He dips the belt in some sort of oily liquid and then hands it to you. \"He says to use the oils because somes don't like the smell. But yous get used to it. I thinks it smells good now. Also these. The Tailors said yous might like.\" He hands you a pair of leather arm bands.", "action_results": [{"action": "Back to the lift", "result": "You take the black belt and bands out of his hands and try to hold as little of them as possible, with a forced smile. The Tanner smiles back at you, oblivious of your disgust.\n\n\nOphelia takes your arm. \"We have to go now.\"\n\n\nThe Tanner smiles at you. \"Come backs to visit. And if yous wants armours, I cans make it. But laters.\" His tail wags and he waves at Ophelia.\n\n\nOphelia pulls you out of the room and walks off quickly, then runs after reaching the corner.\n\n\n\"I'm sorry. I just can't stand it. He's just so pitiful. I want to hate him, I really do, but I also feel an overwhelming sense of sorrow for him.\" Her face is white and her hold is gripping your arm so hard it hurts. Her face says not to talk about it anymore, but you have a feeling there's something that she's not telling you.\n\n\nThe smell diminishes as you get farther from the tannery. Once you reach the lift again you put on the belt and bracers, if just to buy some time before you have to step back on it. To your surprise the solution that the Tanner used actually seems to have worked. In fact, they have a slight leather smell, but otherwise are devoid of any discernible smell.\n\n\nYou're about to step back on the lift. If you want to ask Ophelia about the Tanner, now is the time.", "action_results": [{"action": "Ask Ophelia about the Tanner", "result": " \n\nFor a second, you're not sure she heard your question. She just holds your arm and pulls you onto the lift. Just when you're about to ask again she answers in a quiet voice, holding her necklace in a tight fist.\n\n\n\"The Tanner is an animal. A nice, good-natured, even gentle thing, despite his appearance and the whispers of some, but an animal nonetheless. He isn't a man -- or maybe isn't one anymore. He can't make the decision to lie or even mislead. If you ask him a question he will answer to the best of his ability. He said you were like Zaren.\" She trails off.\n\n\nYou want to know why this scares her so much. Maybe you smell like Zaren or something. Ophelia seems to be afraid of him, but why would this bother her so much? You're about to ask when her nails dig into your arm deep enough to cause marks, but not blood.\n\n\n\"I don't want to talk about it. At least not now. Please.\" And that's all she'll say for now. A forced smile covers her anxious face. \"Where to now?\" She says, deftly changing the topic. \"We've still got things to do yet.\" She lets go of your arm and lightly touches the mark. \"I... Sorry.\"\n\n\nThe discussion seems to be over. You doubt she'll even respond if you ask again, so you respect the silence, though you are still confused.\n\n\nThe lift starts to move. \"So, what's our next destination?\"", "action_results": [null, {"action": "The Jeweler", "result": "\"Everything in the details... Everyone here is given a seal, to carry on their person at all times. Men typically have signet rings. Many women will choose a pendant instead. I personally have a ring, but I wear it on a chain around my neck. The Jeweler will take down a design, finger size, and preferences, and Zaren will approve. Most of the time he doesn't care, but once in a while he will change it slightly. Sometimes dramatically, though this is rare. So likely the choice will be yours. The Jeweler will work with you, but give it some thought first.\" Ophelia looks about, then moves closer to you. \"I think that's part of Zaren's control over us. He always seems to know where everyone is, what they're doing, what they're saying. I'm not saying I know for sure, but I cover my ring when I speak plainly. The less risks one takes, the better.\" she whispers in your ear. She moves back. \"You can also request other jewellery, but as I understand it is not fashionable currently, except for your seal, at least for men. It might make it harder for you to fit in with the established nobility.\"\n\nYou move towards an opening in the cylindrical tower and the platform fixes itself there, with an  invisible seam with the floor. Ophelia walks off with more courage than you can muster. \"We have a lot to do. There's no time to stand around.\"\n\nYou look down and take a deep breath. One foot, now the other. The platform starts to descend when you leave it. You step forward quickly, not looking back at the empty air and open space behind you. Ophelia watches you with a grim grin. \"It's not very far from here.\" She starts off and turns a corner, with you jogging a bit to catch up.\n\n\"I suggest not going with any words or animals, at least alone. Zaren seems to have something against them; he often changes the design if they include those. Here we are. Ready to meet the Jeweler?", "action_results": [{"action": "Meeting the Jeweler", "result": "You walk through the wall with Ophelia into the room. There are glass containers on the floor and on top of tables filled with beads of all colours, plain metal rings of different kinds, precious and semi precious stones, small chains, strings, and little pieces of metal that look like the latches for necklaces and bracelets. The containers are everywhere except for a single corner where tiny tools lie on a table along with both lit and unlit candles.\n\n\n\"Hello friend! I am the Jeweler. Ophelia has no doubt told you about me?\" Says a high pitched voice. It continues before you can answer. \"I am currently finishing some very delicate work, which requires great concentration, so quiet, please. I will be with you in a moment. Just let me.... Yes, there... And.... Darn. No... Ah, there we go. Okay, step forward please.\" You step forward, searching for the source of the voice. \"A signet ring then? Please, would you mind grabbing one of those gold rings in the container over there.\" You finally spot the source of the voice, a small woman sitting on the work table. Her small hand points over to a large glass container filled with gold rings. They have a large flat part for the emblem, but are otherwise regular rings. You walk over and pick one up.\n\n\nShe's a fairy or a small dryad of some kind, perhaps a foot tall at most, and slender. Beautiful white wings stretch out on her back. She wears a silky ruffled green dress with a darker green bodice. Long blonde hair is pulled back over her pointed ears down her back to her waist. She's beautiful in a way that leaves you unable to look at or touch her for fear of spoiling her beauty. But you can't look away from her. She looks into your eyes and you hear the calls of nature, the smell of pine trees and dew, the wind and sun over your skin. She blinks and the feeling is suddenly gone. \"The ring please?\" You hand it over carefully and she strains to place it down on her work station. \"Oh, my. I forgot to even ask you! You would like gold of course?\" She stares at you and you hesistate to break this precious moment.\n\n\n\"Ahh... Um, yeah, sure, of course.\" You mumble through the words, not even sure of what you're saying. You're lost, lost in the wind flowing through the trees in your head. It's not even her anymore; now it's a forest in your head, falling leaves littering the ground and life all around you. The wind sighs the sun shines and suddenly sly it's gone.\n\n\nThe Jeweler takes out a tiny piece of charcoal from a drawer in her small work table and a piece of paper. \"Okay, let's get started. This is just a simple start; I'll fix lines and edges later but I need an idea of what you'd like.\" She draws a large circle in the middle of the page.\n\n\nYou stand there, staring at the paper for a few minutes. You close your eyes to think to concentrate, but it doesn't help. Minutes pass in silence as the others wait for you. There, there, now, there's an image in your head, perfect and wonderful. You taste it; like a light wine, you feel it, soft and thick, you hear a dissosance in your head, harsh but pleasing and soothing. This is it, this is what you want, but it just swirls and plays around in your vision, beyond words. You can't force this out, the words just don't come. You can't explain this image in your head and eventually it fades, as much as you'd like it to stay. Something, some small part of you, tells you this is not something you should share. You don't know why, but the feeling is so strong that you accept it. It has the same feeling as your memory, but something indefinite whispers in your mind that it's not.\n\n\n\"Let's start with an animal. That's a popular one.\" The Jeweler starts. \"Anything you want. Then we'll add details, designs, words maybe. We could also start with a sort of shield type of a coat of arms, if you'd like.\"", "action_results": [{"action": "A coat of arms", "result": "The Jeweler holds the charcoal careful and draws a shield in the center of the paper. \"There's the standard shape. It will need a motto on the bottom. This is just the shield of a coat of arms, so no supporters. That's the animals that stand on the side of the shield.\" she adds hasitly. She draws the shape of a scroll or ribbon kind of thing on the bottom.\n\nYour bones quake. You feel a snapping in them, not painful, but just as strange. The hair on your nape stands up and quivers against the air. There's a slow low hum in your ears, resonating and echoing around. The room suddenly seems ominous, an unfounded but overwhelmingly strong sense of danger.\n\nWithout as much as an explaination the feeling passes down from your head to your feet and is absorbed into the ground. That image hides in the corner of your ears for a split second, and then everything is back to normal.\n\n\"Do you have any ideas yet? I mean, you don't have to do a motto, but it's part of the seal.\" There is slight concern on the Jeweler's face.\n\nA few ideas pop up in your head, far away but just around the corner. You realize with a start that they're memories. Letters and words fade into and out of your vision and some undefined voice mumbles them. You know that they're part of your past so you make an effort to pick them apart and put them together properly.", "action_results": [{"action": "Each life begets its own death", "result": "\"Each life begets its own death...\" You mutter. The phrase is full of guilt and worthlessness that corrupts your tongue and mouth before filling the air with its nothingness. So close to your heart it infects everything inside your body with its tendrils of darkness. You'd like nothing more than to scream with confusion, anger, sadness, anything that expresses this bitterness, but that would let the nothingness back in. That other feeling rises up in defiance but is gone before anything comes of it.\n\n\"I... See...\" The words flow on the paper, lines like withering branches and vines perventing each word in turn; and then the Jeweler pulls back, done. \"Zaren decides what kind of writing is used on seals. I cannot change it for you. How... How does it look?\" The written blight tells of infinite sufferings, but only if you can see past it, only if you can see the puzzle that this piece belongs to. It's subtle in this way, overwhelming in others. Words of a kind of praise come to your lips but all that passes is agreement that it looks good. \"We're... Done? My, that was speedy. It takes much longer than that for most. They always want something moee complicated -- though they never have any idea what it is that they want.\" That's because the author doesn't have time for that shit, okay?\n\n\nOphelia pulls on your arm but you stay seated for a moment, consumed by fears. Finally she says \"Come on, get up, we're not done yet.\" and she helps you out of the seat.\n\nThe Jeweler calls out a farewell as hurry out of the room, head down and body curved to appear as if you were nothing.", "action_results": [{"action": "Back to the lift", "result": "You shake yourself free of those words. Not now. Now is not the time.\n\n\nYou and Ophelia make your way back to the lift in silence. Just before you step on she speaks. \"I know things are strange now... Jumbled up even. It's both fast and slow, and exhausting even to think about. But really it's not that bad. Once in a while The Court has its bad days but most of the time we live like -- like nobility.\"\n\n\nShe steps on and pulls you with her. You shudder when your feet touch it again. Ophelia either doesn't notice or ignores it.\n\n\nThe platform moves. You don't know how exactly, but you consider what Ophelia said and leave that mystery for another day.\n\n\n\"So now what?\" Ophelia asks.", "action_results": [null, null, {"action": "The Shoemaker", "result": "\"Tired of walking around barefoot, hmm?\"\n\nThe platform stops its climb and moves towards a ledge. Ophelia walks off. \"Here we are. Quickly now. It will descend as soon as your foot leaves it.\"\n\nYou almost jump off. Her words are true and you feel the platform leave your feet. The sensation is terrifying and you almost lose your balance. Ophelia grabs you arm again and pulls you forward. She turns around and walks down into a hall, motioning for you to follow. Every step from that horrifying open space is another breath you can take.\n\n\"It's only a short walk from the lift.\" Ophelia looks back at you. \"Here we are. It's hard to remember where the walls end at first; it gets much easier with time. Come now, let's meet the Shoemaker.\"\n\n ", "action_results": [{"action": "Meeting the Shoemaker", "result": "Ophelia pulls you into a large room. It's filled with foot forms, scraps of leather and buckles on the ground; on shelves are are kinds of footwear, from simple hide sandals to elaborate cloth crakows, to wooden clogs, to heavy leather guard boots. Other tools are hung up on walls, on various shelves, on tables and littering the ground. Short work tables line the far wall and tiny stools and chairs sit in front of them. Someone sits at the edge and grumbles.\n\n\"Another one? Already? I haven't finished repairing miss's 'Oh, but I need them to dance' shoes. Never mind the huge tear. I have another pair, exactly the same, but no, we can't have new shoes on her pretty little feet. Nevermind the fact she looks like the Tanner. Nobody wants to watch her dance anymore than they want to vomit. Well, come on over here.\" A small man stand up and waddles over from the far wall. You don't quite realize how short he is until he's standing up next to you, less than half your height. \"Oh, tall man, eh? Everyone is tall these days. I used to be tall, you know. Oh, well, as long as you don't have abnormally large feet.\"\n\nThe man is middle aged, with graying hair and a short but full beard. He wears a small cap with an eyepiece for better vision. How this really relates to shoemaking you don't know. He's wearing a ruffled green shirt under a purple and silver jacket. A cravat lies at his neck, matching his blue and yellow bright pants.\n\nThe man pulls up a chair and a small stool. \"Sit down please? Good. Now lift your left foot up onto the -- Yes, good.\" He barely takes a look at your foot before you starts. \"I have something perfect for you. A nice pair of boots, black leather. Already made. The Tailor told me it'll work. Please say yes. Everyone wants something new, something custom, just a little bit different, nevermind the fact they have no idea what they're saying and what they want will look awful. Just think about it. I'll go get them.\" He waddles off.\n\n\"The Shoemaker misses being nobility. He used to be a regular man, tall even, but once Zaren has an idea... Well, that's it for you. That's why he's wearing those clothes; pieces of a bygone time. He may complain a lot but he's good at his job. It may seem like he's trying to get rid of you, but if he says he's got something for you, he does.\" Ophelia quickly explains while the Shoemaker is in some other room.\n\n\"Found them!\" He calls, and he runs, somewhat comically, back into the room and towards you. He breathes hard and tries to fit the boots on your feet but fumbles. Finally he ties them tight and motions for you to stand. \"Come on now. Stand up.\"\n\nYou stand up and find that surprisingly, they fit perfectly.\n\n\"Don't look so shocked. I may hate it but I'm good at what I do. You see the little designs? The patterns in the leather? It takes forever to create those, and they can only be done as the shoe is ready. A single mistake and I have to start again. Anyway, that's what this is for.\" He points to the eyepiece. \"And the stitches of course. Why, you can't see the stitching, can you? Well that's because I'm good at my job!\" While you try out the boots he picks up another pair that he dropped running back into the room. They're just as nice, but plain. \"These are for everyday wear. Wouldn't want to wear out those nice boots now would we? Well, maybe you want to, but I sure don't want to repair them or make some new ones.\n\n\"We'll be going now. Don't have a nervous breakdown.\" Ophelia smiles and motions for you to get up.\n\n\"Why I never -- ungrateful swine!\" But through his bitter words the Shoemaker smiles.\n\nOphelia seems to be popular here.", "action_results": [{"action": "Back to the lift", "result": " \"Not so bad, is it? Really, most days end up like this. Boring but safe.\" Ophelia leads you back to the lift. \"The Shoemaker is a nice fellow really. Even if he's nervous and whiny half the time. And he's good at his job -- though Zaren always makes sure the people he appoints are. You'll need many more shoes; everyone at court does, but we're good for now.\"\n\n\nYou're back at the lift and though you're hesitant to get on Ophelia walks on without as much as a shiver. \"You get used to it.\" She says, reading your expression.\n\n\n\"I doubt it.\" slips out of your mouth. The platform starts to move.\n\n\n\"Still more to do. Always more to do. Where to next?\"\n\n\n \n\n ", "action_results": [null, null, null, {"action": "The Barber", "result": "She looks at your face. \"I imagine it must be... Itchy.\" She takes your chin in her hand and turns your head. \"Hmm, yes, you do need a shave badly.\" She says, entirely professional.\n\n\nThe lifts slows and stops at a open ledge. Ophelia confidently steps off, practically strutting. \"Be quick. It will leave as soon as you take pressure off it completely.\"\n\n\nYou step off carefully with one foot and spring forward with the other. Ophelia was not lying; the platform leaves your feet just as much as you leave it. It's uncomfortable and leaves you off balance. Ophelia holds your arm while you steady, and then pulls you forward into the maze again.\n\n\n\"It's not that far because the men must visit so often.\" After a few minutes of turning left, left, right, left, left, right, right Ophelia stops. \"I think it was... Oh my. I don't think I remember where it is. It's been so long since I even passed by it.\" She stands there and thinks for a few seconds and you nearly groan, but first you hear a voice.\n\n\n\"Hello Ophelia. I don't suppose you need a shave? Just to your left there... Yes, that's it.\"", "action_results": [{"action": "Meeting the Barber", "result": "The Barber looks up at you and gasps, though it sounds more like a groan, rusted, like metal on metal. \"Oh my. Just let me finish this up and I'll get straight to you. Sorry fellows, this guy's got a more urgent case.\"\n\n\nYou just stand there watching, enthralled. This man -- if he could be called that -- is some strange combination of metal and bits of flesh, as if he wears an elaborate suit of armour. You can see marks on the skin where it meets the metal, like stitches or stretched skin. What looks like a bronze helm covers a little more than half his face, from the right cheekbone across his nose down through the left side of his mouth and chin. There are patterns in the helmet, to look like false skin, and hair on his head.The way it moves when he talks looks painful, but he does it in complete comfort. There's only a hole for one human looking black eye, whereas the other is a rotating orb of silver. The metallic side of his face is gleaming and smooth but on the other side is an ironically long and unruly beard, full of red, blond, brown, and black hairs, with even a hint of gray and white. Nuts and bolts attach metal arms to his torso, though there are fingers of flesh that bend on them. Each movement stresses the metal and makes a slight moaning noise. Ribs of bronze cover the right side of his body, shaped to look muscular, though the man himself is simply skinny, nothing more. The only thing he wears beside the strange armour is a pair of trousers held up by a large belt. Where it ends his feet begin, toes of silver and gold mixed with skin covered toes. One foot has a ankle that looks like iron; the rest of him is covered in bits and pieces of metals of different kinds.\n\n\nYou look away, trying not to stare. Instead you study the room.\n\n\nScissors and razors rest on tables along with shaving cream, brushes, and combs. Farther back in the room there are other tables filled with tools for other parts of the barber trade; dentist equipment, like hammers, drills, small sharp picks; equipment for minor surgeries, like thread, forceps, smaller scissors, and blades to split skin. Blood splatters are dried on the sheet covered tables back there, barely visible because of a ragged curtain. There's a faint stench of alcohol.\n\n\nYou sit down in a chair next to Ophelia, who looks entirely out of place but doesn't seem to care much.\n\n\nThe men waiting are nobles you'd guess, from their manner and clothes. None so much as looks at you. Ophelia whispers in your ear \"They are very refined about it but they are staring at you. I don't suppose you even noticed. Turn your head away and use your peripheral vision. Laugh, as if I said something funny.\" You laugh. It's grating and hard, not a true laugh, but sure enough you see some of the men watching you. \"You'll learn they subtleties soon. You've made a unique impression on them. They don't know what yet to make of you. Ignore it for the moment.\"\n\n\nThe barber sends out the man that was in the chair and motions for you. Ophelia follows you over as you sit the barber's chair.\n\n\nOphelia stands next to the Barber and motions to your head. \"Just whatever's in fashion now, please. It's not the time to stand out.\"\n\n\n\"Very well, madam. Moustache?\"\n\n\nOphelia shakes her head. \"No. It's common but it's probably better to go simple for the moment. Less attention, which, trust me, is what you want.\" She explains to you.\n\n\nThe Barber holds your head and sets about taming it. He's efficient, certainly. Within a few minutes there's a mountain of hair on the floor and your head feels much lighter. He pulls at it and styles it this way and that. By the time he's done it's itchier than it's ever been. \"And lean back now.\" He asks, pulling out a razor. When you do he begins lathering up your face and then starts to shave it. It's a quicker process than you would have expected, probably because he's got so many customers to see to.\n\n\n\"Done. Hopefully it is satisfactory.\" You stand up and feel your face. Clean. Your hair is still longer, falling to around your chin.", "action_results": [{"action": "Back to the lift", "result": "Your head feels light and your cheeks are raw; still it's nice to feel less like an animal. You rub your hand through your hair and pull it back.\n\n\nOphelia smirks and you walk back to the lift together. \"It's all normal for us, I suppose, but it must seem strange to you.\"\n\n\n\"That's an understatement.\"\n\n\n\"I don't fully trust the Barber. I have no proof -- you never do -- but I think he's a particularly devoted servant of Zaren. Some are like that. They hope he'll reward them, or perhaps simply not punish them. It doesn't change anything, but they never stop trying.\" Ophelia whispers to you, though she walks straight and doesn't face you, lips barely moving. \"And here we are again.\"\n\n\nOphelia marches on as if it's nothing and though you don't trust the platform not to drop, you step onto it as well.\n\n\n\"What next?\"", "action_results": [null, null, null, null]}]}]}]}]}]}, null]}]}, {"action": "Trust none and watch all.", "result": "\"Trust none and watch all.\" You say flatly. The words seep wisdom and ooze suspicion in a way that leaves you listening for footsteps behind you, for whispers and winds, for anything out of place. You have to resist the strong urge to look behind you. Those other words dance around, but you have this now. You distrust them. You want nothing but this. That feeling that so captured you threatens you again, but then is gone, and the room is as it was when you first stepped through the door.\n\nThe Jeweler carefully writes down your words without an inkling of what they really mean. If she understood, she wouldn't look so calm. \"This is the traditional writing. Does it look good?\" The words copied down in ink so easily are beautiful in their way, long and flowing, with just a hint of what the words really mean. It's good but it doesn't really convey the true feeling of the words -- these are just letters thrown together.\n\nThe Jeweler smiles at you. \"All finished? Great! That's much faster than usual. Most of the time someone doesn't even know what they want.\" That's because the author doesn't have time for that shit, okay?\n\n\nOphelia pulls your arm and motions for you to get up. You flinch at her touch. \"Come on, we still have things to do.\"\n\nThe Jeweler calls out a farewell as Ophelia coaxes you to leave the room.", "action_results": [null]}, {"action": "All power is a trust", "result": "\"All power is a trust.\" You confidently say. Those words haunt you with a sense of responsibility. They fill up your heart with a solid ache almost -- not uncomfortable, but familar and friendly. You feel a great weight on your shoulders heavy but... Necessary. Power wells at your fingertips and crawls around your arms. That feeling from before throbs in your heart again with its insistence before fading once more.\n\nIn quick and controlled strokes the Jeweler marks down your words. \"Here we go. This is the way Zaren choose, so the writing is as it must be. What do you think?\" The sentence holds a piece of what you feel now, but it still does not bring it alive. The long and carefully continuing letters are nonetheless beautiful. You smile. \"And we're done here. That was quick. I haven't met someone who knew exacty what they wanted in a long time. Most people just hint at what they want.\"\n\n\nYou stand up and take a step towards to the door before turning to Ophelia and saying. \"Coming?\"\n\nThe Jeweler calls out a farewell as Ophelia follows you out of the room.", "action_results": [null]}]}, {"action": "A bear", "result": "\"A bear, eh?\" She holds the charcoal and careful draws a simple but elegant picture of a bear on its hind legs, paws out to the left. \"How about this?\"\n\n\"Uh... Yes.\" You feel a sudden shiver, uncomfortable for a second. It wallows in your bones and shakes your spine, making its way up from your legs to your head with a chill. Something about this room screams at you and something about this moment rouses your suspicions. Something... Something...\n\nBut as quickly and as unexplained as the feeling began, it leaves your body. That image flashes through your head again, just once, and everything is calm once more.\n\n\"How about a motto? That's a popular one. Take a moment to think about it.\"\n\nYou do. A few ideas flash by. They're abstract but deep, something inside your own head. You realize that they're memories. From where you don't know but even the words are a piece of your past and as such you feel slightly more calm. You focus on the flying words and manage to pick out three phrases.", "action_results": [{"action": "Time is the father of truth.", "result": "\"Time is the father of truth.\" The words make their way out of your mouth with a sense of meaning, a subtle power that soothes your body and spreads from your chest to your limbs. It hangs over your head, not present or overpowering but always there, always more influential and powerful in the end. That feeling you had only moments before surrounds you again and then just like that is gone, though you suspect it's hidden somewhere, always present.\n\n\"Here we go. Zaren chose this particular style of writing, so I can't change that. Does it look good?\" The Jeweler's small hands have slowly but surely written down those ever important words. In the long strokes it oozes this subtle feeling that has come over you, but it lacks something, some piece that so captures the words. Though you cannot deny its beauty. You nod at the Jeweler. \"Great! That was much better than the average person is -- they always want this or that, no no, this, no no, that, and... Well I shouldn't complain. It's just so nice to find someone who actually knows what they want.\"That's because the author doesn't have time for that shit, okay?\n\nYou slowly rise from your seat and inspect the room anew.\n\n\"We still have things to do.\" Ophelia remarks.\n\nThe Jeweler calls out a farewell as you and Ophelia walk out of the room.", "action_results": [null]}, {"action": "Call no man happy till he is dead.", "result": "\"Call no man happy till he is dead.\" Weakly and without hesitation the words come, spilling out of your mouth with a rasp. Suddenly your limbs are lead and your head struggles to stay afloat. Your eyelids fight to close, wanting to keep out the world but knowing all the while that they can't. That feeling from before picks up again and then lacking the energy to continue it gives up.\n\n\"Carefully now and... Zaren has decided this writing style by the way, no substitutions. Take a look.\" The Jeweler has lightly written down your words with shapely curved letters connecting to each other. The look of it saps energy from you and is reminiscent of this sadness filling you, but it lacks the totality of it. You cannot disagree with its expression of this depression though. You mumble some agreement. \"Good... That was faster than the other nobles can be. They always want changes and this and that... It really sucks out your energy. It's good that you had even an idea of what you want.\"That's because the author doesn't have time for that shit, okay?\n\nOphelia pulls you up and you nearly go limp.\n\n\"Let's... Let's go.\" Ophelia whispers.\n\nThe Jeweler calls out a farewell as Ophelia helps you out of the room.", "action_results": [null]}, {"action": "Thy dreams shall be prophets.", "result": "\"Thy dreams shall be prophets.\" Such wise words. Words that see behind the now, beyond this. You eyes open wide and you can sense and nearly see shadows moving; playing on the walls and jumping out of thin air. It's a feeling of something more -- something indefinite and changing. The coldness from before prickles your skin again and whispers sweet nothings before jumping ahead in time, farther than you.\n\n\n\"I see. Here. Zaren's choice of font; it's been decided. Now what do you think about this?\" The Jeweler's thin fingers knowingly write down your words with smooth letters that crawl across each other, always to the next, always to the next. They call to mind something more but only a haunting lost feeling, not the real knowledge that they are. But you feel that these are it, this is the way it should be, so you press your fingers close to the letters and look at the Jeweler. \"It's okay? Yes, well that was fast. Your peers usually ask for a dozen changes before it's even close. Well, at least you know what you want.\" That's because the author doesn't have time for that shit, okay?\n\n\nYou get up and pull Ophelia towards the door.\n\n\n\"Let us go. More to do, always more to do.\" You say with a shudder.\n\n\nThe Jeweler calls out a farewell as you lead Ophelia out, holding her arm.", "action_results": [null]}]}, {"action": "A lion", "result": "The Jeweler sketches out a quick head, complete with a mane, then a body. The lion is rampant and holds its paws towards the center of the paper. \"Okay, we've got a focus now. That's good. We'll be done before you know it.\" says the Jeweler.\n\n\nYou spare a glance to look around the room. There's something in the corner of your eyes, flashing. The air feels colder suddenly. At first it chills your arm and then heat surges up over your skin. There's an ache in the back of your eyes, but more like something akin to nausea than any sort of stinging pain. For a second you forget; not anything in particular but you forget it nonetheless.\n\n\nWith a final throb in your head it fades as it moves down your spine. You see that image again, distant and faint but undoubtedly there. It quietly screams at you and then silence comes once again. The whole thing is strange beyond words and the room feels harsh in this light now.\n\n\n\"How about a motto? That's a popular if simple one. It could be anything, ahem... Nearly anything you would like.\" The Jeweler nods at you as she speaks.\n\n\nYou pull back into your head again and from some part of you there are whispers. You try hard to sort and pick them apart as you realize that they're memories from some distant part of your mind. With effort you sort the sounds and isolate three different segments.", "action_results": [{"action": "Forgiveness is the giving, and so the recieving, of life.", "result": " \"Forgiveness is the giving, and so recieving, of life.\" Forgiveness. How strange. Foreign on the tongue but familiar in your head. LIke a question, please something, please what? Everything is bright now -- too bright, but you don't mind. A slight tinger  spreads through your hands and then makes its way to greet you in your chest. A feeling of potential crawls up into your brain, of greatness. That ache that so took you before resurfaces before fading in the depths.\n\n\n\"Hmmm...\" The Jeweler stares at the paper and angles her head before starting to write down your words. \"Zaren decided how I was supposed to write, so changes to be made there. Done. Are you okay with that?\" The words are long and very stylized, with a hint of warmth in the letters, but it is only an echo of the warmth in your chest. It still compels you to look though, so you in affirmation. \"Good to go then.... Wow. That was so fast. Nobles are always... Well, I shouldn't say always, but they always take forever to decide what they want, and then they want to change it. It's... Good. Good to finally see someone who isn't like that.\"That's because the author doesn't have time for that shit, okay?\n\n\nYou get up from the chair and offer your arm to Ophelia. She stares at you with a look of incredulity before shaking her head and taking your arm.\n\n\n\"We should go now. Don't want to keep anyone waiting.\" You say.\n\n\nThe Jeweler calls out a farewell as you help Ophelia out of the room.", "action_results": [null]}, {"action": "Fair peace becomes man; ferocious anger belongs to the beast.", "result": "\"Fair peace becomes man, ferocious anger belongs to the beast.\" you whisper. The phrase seems so solid and so close, so much like something worming its way around your heart. Something to hold onto, no matter what. Other words float around, too faint to see or hear, but you have this now, you have something. It seems distant and intensely personal at the same time. There's a echo of that feeling and then the room is calm for a moment as it fades.\n\n\n\"Okay. This is the traditional way to write, chosen by Zaren, so no choice about that. That look good?\" The Jeweler copies down your words, oblivious to their serenity, in her small hands. The letters are all long and flowery, with flourishes and careful spacing. Still, it doesn't do the feeling of peace that those words bring you any justice. The Jeweler looks at your expression. \"Okay, then we're done here. Much faster than usual. Most people want this or that and it takes quite a few tries to even get close. It's rare that one will even know what they want.\" That's because the author doesn't have time for that shit, okay?\n\n\nOphelia takes your arm and pulls you up from the seat. \"We have much to do and little time in which to do it.\"\n\n\nThe Jeweler calls out a farewell as Ophelia drags your overly calm body out the doorway.", "action_results": [null]}, {"action": "Death borders upon our birth and our cradle stands on the grave.", "result": "\"Death borders upon our birth, and our cradle stands in the grave.\" You have to restrain yourself from screaming out those words. It's anger, pure anger, confused and saddened but defiant in the face of everything. There's no reason or rhyme to it, nothing but a strong will and grievous duty. Your heart pounds with a madness. A surge of emotion brings to mind that feeling from before, overwhelming and full of strength.\n\n\n\"Okay then. Here it is. Zaren chooses the writing style by the way. Well, take a look.\" The Jeweler hands fly around the page and the words follow her pen. There's a harshness in them, that same anger, but it only throbs in your head once or twice, rather than this intense pressure. You cannot deny the beauty though, with long flowing letters and smooth, careful lines. You study the words and grunt your approval. The Jeweler smiles. \"Great!... I... Um... That was fast. Pretty simple compared to some of the crazy designs some people want. It's good to see you; someone who knows what they want.\"That's because the author doesn't have time for that shit, okay?\n\n\nYou take Ophelia's arm and pull her towards the door. \"Come.\" You say simply.\n\n\nThe Jeweler calls out a farewell as you pull Ophelia along.", "action_results": [null]}]}, {"action": "A snake", "result": "\"A snake?\" The Jeweler blinks. \"Now there's a rare one. How about this?\" The Jeweler quickly sketches the shape of a snake. Half is circling around the bottom and the other half sticks up. The snake has a thick middle and a large head. The mouth is open, revealing big fangs and a long forked tongue.\n\n\nYou feel a tugging in your head, like your brain is being unraveled. It doesn't hurt per se, but the sensation is a frightening one. Your fingers twitch and a quiet high pitched creak dances in your ears. Shivers race around your body and hide under your skin. The room, despite its fullness, feels empty and distant. There's... Something...\n\n\nBut the feeling is gone before you can make it through that thought, all traces of it rushing out through your skin like escaping heat. The room seems lighter again. Whatever just happened, it's done.\n\n\n\"And now a motto. Something short.\" The Jeweler looks up at you.\n\n\nYou're thinking about it when a rush of words overtakes your mind, all jumbled. They're memories, you realize with a start. Something about them seems important, so you put the pieces together carefully, and come up with three complete sentences.", "action_results": [{"action": "Conquer chaos and ordain order.", "result": "\"Conquer chaos and ordain order.\" It's a rigid sentence, inflexible in your mouth, coming out as one long word. A stubborn phrase if there ever was one. The mess in this room chills you. The nearly overpowering urge to straighten it up overcomes you, but you fight it off for the moment. Order. Order is needed here. You can feel the residue of that moment from before spilling over into the now, carefully finding a way through your veins.\n\n\n\"Ooh.\" The Jeweler hmms and oohs before putting pen to paper and letting the words take form. \"All seals have the same writing -- the letters and such are all uniform. Zaren likes it.\" The paper seems to grow around the words that are taking their place on it. It's flowing and curved but there is a pattern of strict structure to it that you can see beneath that, not quite so hard but close enough to make you catch a breath. The Jeweler looks at you and you voice your approval. \"Great work then, for a noble -- er, I mean, well... Usually it takes forever for them to choose and then they want to change things and well... This was much faster then those other... I'll just stop talking now. \" That's because the author doesn't have time for that shit, okay?\n\n\nYou stand up and straighten your back, before heading towards the door.\n\n\n\"Well I guess we should get going anyway...\" Ophelia remarks as you're already waiting for her to catch up.\n\n\nThe Jeweler calls out a goodbye as Ophelia runs to catch you.", "action_results": [null]}, {"action": "Does the world have nothing inside?", "result": "\"Does the world have nothing inside it?\" It takes you a moment to realize those words slipped out of you mouth. You feel... Empty. Though empty implies there was ever anything there, that there's something there, that anything could be there. But you are simply empty, the epitome of emptiness. Whatever feeling had overcome you before stretches forward through time to work it's way around the hole that is you for a few seconds.\n\n\n\"Now let's see... There and there...\" The Jeweler fills up the paper with your words. \"Seals all have the same kind of writing -- Zaren likes it that way.\" You look at the page as the ink slowly spreads across it and feel... You feel.... Nothing. Nothing at all. The words, with their silent curving whispers over the paper, might as well not be there at all. As if they are not there at all. The Jeweler looks at you for some semblance of emotion, but you stare off, at the paper but beyond that. \"O-Okay.\" She looks shaken without some response from you. \"I'll take that as a yes then. Then we're done. Fast too -- I like that.\"hat's because the author doesn't have time for that shit, okay?\n\n\nBut you just continue to stare into the paper as the words are consumed by your emptiness.\n\n\n\"Come on then... Come on.\" Ophelia arm is over yours, pulling until you're up and out the door.\n\n\nThe Jeweler whispers a farewell at you and waves at your blank unseeing face.", "action_results": [null]}]}]}]}, null, null]}, {"action": "Keep quiet", "result": "You close your mouth. She obviously doesn't want to talk about it and you still have things to do before Zaren... Does whatever Zaren does.\n\n\nYou play with the folds of your belt and you and Ophelia stand in silence for a moment.\n\n\n\"Thank you... I just... I'll explain it later. We've things to do now. I understand that things must be confusing for you -- it was for me, and even I had some experience with The Court before I joined it. It just... I've never done this before.\" Ophelia is quiet with this last sentence. \"Zaren has people for this. I don't understand why he told me to help you. Then again, I don't understand why he does anything he does.\"\n\n\nThe lift starts to move again.\n\n\n\"Where to next?\"\n\n\n ", "action_results": [null, null, null, null]}]}]}]}, null, null, null]}]}]}]}, null, {"action": "Tailor", "result": "\"The Tailor? He's been here a very long time, longer than me, longer than most.... He used to be like us. I just barely remember it. He had another name too, but it's so far off I don't have an inkling what it could have been. Anyway he always had a talent for clothing, but he's had a lot of time to perfect his craft as well. Zaren decided he wanted to change The Court to something more like what you see now. He made the Tailor into what he is now so that he could... Well, so that he could be the Tailor. Zaren rubs off on people. He places the seeds of madness in our minds. The Tailor's soul was more fertile than most, but he still retained the appearance of reason. So he gladly accepted his changes and new role. He's happy with it, I think. One of few, but he has a long history here, and a possibly longer future.\"\n\n\n\"What... Is he?\"\n\n\n\"Oh... That's your question. He's a silk worm. Part silk worm at least. At least he used to be a silk worm. I guess he's a moth now.\"\n\n\nYou don't really want to think about him anymore.", "action_results": [null, null, null, null]}, null]}, null, null, null]}]}, {"action": "Gray", "result": "It's soft. It's got pieces branching off of it. It's small and blandly coloured. The colours continue along tiny pieces, like somebody just cut some of it out. This one is small, but you know there are bigger ones.\n\nIt's a feather.\n\nYou hold it close and peer at it. It looked solid at first, but now you see the little bits of fluff.\n\nThe sky is blue and clear and you can see all the birds flying through the skies. Ravens flap in the wind and caw far off. Little songbirds sit on tree branches and tweet songs. Rabbit bolt through every so often.\n\nIt's an orchestra of the wild.\n\nThere's a slight breeze and the smell of trees. Green is everywhere. Long pieces of grass feel soft under your feet. Leaves and flower buds cover trees. This is it. This is life.\n\nThen it's gone. You have it here in your head now, fixed and alive, something you'll remember. There's more...\n\nBut that's gone, at least for now.", "action_results": [null]}, {"action": "Black", "result": "They're big, much bigger than you. The big thing in the middle has pieces coming, and more off of those pieces. They're black.\n\nThey're trees. Dead trees.\n\nYou smell the air. Cold. Ashy. Fire, savage fire, has destroyed this haven of nature. But it's nature's way.\n\nYou feel sad.\n\nYou sit on a fallen tree. The fire is gone. Even the ground is cold now.\n\nYou look up and see the sky. Gray. Ready to rain its tears on this dead place and put out any of the remaining flames. Little drops already dot the the air. A few fall on your head, as if nature is reassuring you.\n\nThey mix with your tears, clearing paths through the soot on your face.\n\nThis place is special. You loved something here. What?\n\nThen it's gone. You have it here in your head now, fixed and alive, something you'll remember. There's more...\n\nBut that's gone, at least for now.", "action_results": [null]}]}, null, null, null]}, null, null, null, null]}, null]}]}]}]}]}]}, {"action": "Crawl", "result": "The muscles holding you up loosen and you fall down.\n\nBeat.\n\nYour knees hit the sand and throw up little flecks. You hear a whistling sound.\n\nBeat.\n\nThe rest of you falls forward, hands moving in position to cushion your fall.\n\nBeat.\n\nAn arrow, bright and deadly, glides over you.\n\nBeat.\n\nYou catch the ground and embrace it, pushing forward with your legs.\n\nBeat. Beat.\n\nThe battle rages. Hand and elbow crawl forward as you make your way slowly to your weapon. Someone steps backwards into your path. You punch their leg and they fall out of the way. There is no mercy in this moment. Someone else tries to step backwards, but trips over you and falls. Almost there. Your hand is on your weapon now.\n\nBeat. Beat. Beat.\n\nYou jump up and swing the blade around. You catch someone just barely on the back of their arm; you run them through and cleanly pull out the blade. In this small space no one can respect the length of the sword, so you kick a few people to clear a space. Something catches you in the side of your head and you fall down and... is that.... bloood.....", "action_results": [null]}, {"action": "Roll", "result": "Your arms start the long journey up. Your head lowers to meet them.\n\nBeat.\n\nAn arrow shines between the blood and the laughter, then disappears.\n\nOne leg contracts to bring your body in and the other pushes to give you your momentum. Your heel leaves the sand, then just your toes make contact with the ground, then you're in the air..\n\nBeat.\n\nYour arms cover your head and you bring up one leg. The other pushes as you lean forward and bring your body low and ready for contact with the ground.\n\nBeat.\n\nSomething rips through the skin in your left arm, leaving a relatively shallow wound.\n\n\nBeat.\n\nBeat. Beat.\n\nYour body falls and hits the ground, and with a little effort, the roll is completed.\n\nBeat. Beat. Beat.\n\nYou reach the sword and grab it as your legs push you up. You bring the sword up and around to stand between you and the man in front of you.\n\nAnother man with a smaller blade tries to stab your side. Your larger blade leaves little time to parry it and even less to regain balance, so you side step instead and let your movement swing the heavy sword around in his direction. He jumps back and knocks your blade just enough to leave him unscathed. Now that you're out of his range, you thrust foward and neatly catch his arm as he tries to avoid the attack. You push foward further and to the right, catching his torso. As you pull back the blade, he collaspes, eyes shut in pain at first, then open as he roars in laughter.\n\nAll around you people are dying. Bodies litter the ground and few are left. Such a waste of life. The violent ones are dead, leaving the survivors to look across at each other in both suspicision and dread.\n\nSilence comes across the arena.\n\nThe shades gather at the edges and stare at you. One sits alone, on a throne of burning night. It opens its mouth....\n\n\"NO! NO! NO NO NO NO! Please, stop! I beg of you!\" You plead and cover your ears, but that doesn't alleviate the shattering misery the shade spouts.\n\nYou writhe, you writhe, on the ground, tears streaming and blood leaking from your nose and the shades scream and scream and it hurts your heart so close to bursting you thrash and cry and pray but the anthem continues as others join in and they file into the sands as you see through blurry bloody eyes and surround you and rip you apart rip you apart rip you apart fingers and limbs and organs and blood so much blood and the shadows the shadows they scream and scream and scream and...", "action_results": [null]}, {"action": "Look", "result": " \nYour eyes flicker and see everything on the battlefield.\n\nBeat. Beat.\n\nRecognition flashes for but a brief moment, as you see the sun shining on the arrow that procedes to catch your throat and rip through flesh to find sweet death. Blood spurts out and you drift into blackness. It feels like an eternity but some part of you knows it's only a beat or two before you die.\n\nBeat. Beat.\n\nNow death is all that is left in your eyes as all traces of you meld into the sands and you are swept away from existence.", "action_results": []}]}, {"action": "An axe in the hands of the man to your left", "result": "The man next to you screams and whacks a corpse on the ground with your simple battle axe. He smiles and pulls himself up to grip the weapon with two hands and bring it down over the head of another distracted man.\n\nYour heart beats.\n\nYou spare a quick glance over the rest of the battlefield.\n\nMen fight all around you, clanging metal and shrieking warriors ringing in your ears. There's laughter, joy, fear, and hatred in those screams. Shadows stand all around the raised edge of the arena, perfectly still.\n\nYou need a weapon in your hands, something to defend yourself against this writhing mass of life and death. You need your axe; it's yours. It fits perfectly in your hand and bites at the flesh of your enemies like a loyal dog. There is no question: you must get it back.\n\nBeat.\n\nThe man is chopping here and there and everywhere. He's not even holding your axe right.\n\nBeat.\n\nAttack him now and rely on your skills, or sneak up behind him?", "action_results": [{"action": "Attack now!", "result": "You rush, hoping to catch him unaware. He swings the axe around to his right and slashes another man.\n\nBeat.\n\nYour feet both push you forward and you put your hands into the perfect position to attack himand grab the handle of the axe. Both feet leave the ground and propel you into the man.\n\nBeat.\n\nYour right hand curls to give him a brutal punch with all your weight in his throat. Your left hand opens to grab the axe before he can swing it around to you.\n\nBeat.\n\nBeat. Beat.\n\nBeat. Beat. Beat.\n\nYour fist makes contact with him and he falls back a bit, his face twisting in pain. You grab the handle of the axe and wrench it from his grasp as he's weak. Your fist only glances his neck and he recovers quickly to tug back at the axe and kick your shins. You quickly push him off and bring the axe down while he's still weak, but he blocks his face with one arm. There's a sickening thud as you bury it into his shoulder. He tries to pull it out and push you away as adrenaline covers his pain, but you elbow him in the face and kick him to the ground as you pull out the axe.\n\nLaughter takes him and he thrashes about on the ground. You sink the axe into his back and he stops moving, but that laughter continues. You're just about to end his pathetic life when an arrow catches your leg and tears open a huge gash. You collapse onto one knee and drop the axe as someone stabs you with a sword. The end sticks out of your left side and blood flows as the sword is pulled back. You lie on the ground and something bubbles inside of you.\n\nWell now, isn't that funny. You didn't get it before , but now...\n\nIt's too much and you giggle until you can't breathe, but even when you try to stop and take a breath all you can feel is that hole in your torso. The other man grabs your hand and lets out a shriek, squeezes, and then his smile is stuck on his dead face. You can't help it. You smile too. And laugh. And laugh and laugh until a sword somehow finds its way into your eye. Woopsy daisy. How'd that get in there?", "action_results": [null]}, {"action": "Sneak up on him", "result": "You quickly move around a few fights and dodge a few weak attacks, making your way to the man.\n\nBeat.\n\nHe's still whacking into a corpse, though a different one now. His back is to you... It's the perfect time to strike.\n\nBeat.\n\nYou lift your hands and go flying into his body, slamming him forward.\n\nBeat. Beat. Beat.\n\nBefore he can respond your arms are wrapped around his neck from behind. The fool drops your axe on his foot so he can claw at your arms. Chokes and screams are stuck in his throat and there's a wheezing sound; the only air he can get out, and none of it goes back in. You give another squeeze. He beats against your body with one hand, but lacks to strength to do any damage, already fading.\n\nSuddenly, something hits you in the leg. You collaspe onto the man and look to it. An arrow is sprouting from your leg like a plant in the dirt. At the sudden shock of it you let go of the man and he tries to turn around. Before either of you realize what's happening your hand is on the axe and the axe flying to towards his head... And then his head is flying off by itself. The warm blood hits you like a geyser. You roll around and sit up.\n\nAnother arrow grows in your shoulder. You aren't sure when that happened. You can barely feel it now, barely feel anything. A gurgle and a giggle are swallowed by blood in your mouth, when you realize there's another arrow there. You fall back, trying to laugh and just barely managed to make a sound. You're drowning now... Drowning in your own blood... And losing to much of it... And...\n\nIt's... Funny. Funny. Haha funny. And then it's nothing, nothing but black.", "action_results": [null]}]}]}, {"action": "A library", "result": "Hundreds of volumes of large tomes cover shelves that reach up to the very high ceiling. You are in narrow crack between two long shelves. You walk through the space between the shelves, trailing your hands on the book. The shelves are so close you can't help but bump into a book here and there. The shelves are so large and heavy they don't make even the slighest movement when you fall against one accidently.\n\nYou've tripped over a ladder. It's laid along the ground, edges from shelf to shelf, the same kind as there is in every other row. They were used to reach the books once, but no one reads these records anymore. Now they just keep the space between the shelves uniform. Those maps hate being in the same place as the other non fiction and always try to push the shelves apart.\n\n\nThe books are all a dull green, faded from dust and time. They are larger than usual. Each one is about as wide as your palm and the same length as your arms. They are stuffed in very tightly, leaving not one inch of space. You wouldn't want to have the job of putting them into the shelves.\n\nYou reach one end of the row. There's next to no room between the wall and the shelf, but you manage to squeeze through. The rows of shelves seem to go on forever in this direction. You use the next row to turn around and face the other way. The shelves end a few rows up, so you head that direction. You come out into a small space between a shelf and the grey stone wall.\n\nThere's a door here you could try it but it's locked. Oh. There's also another small shelf here at the end of the row. You look at the small selection it has. Most are records of the books in this library. They include just a topic and a number. There are too many books to even list the names in this tiny shelf.\n\nThree books that are not records draw your attention.", "action_results": [{"action": "Pick up the small brown book", "result": "You pick up the small brown book. Its wretched condition is something compared to even the oldest and worst kept tomes you've seen.You take out a sheet of paper to record its name.\n\nThe ratty cover nearly comes off when you lift it to turn to the first page. There's no title or author listed, just a strange star design in the center of the page. You copy onto another piece of paper with your fountain pen the design as best you can and place it beside you so you can request another copy of whatever this book is.\n\nYou turn the page as carefully as you can. The thin paper seems almost as if to look at it would shred it.\n\nIt's another design. With your vast experience what? in many different languages and the writing of many different authors, in the books prior to the invention of the printing press of course, you can easily see that the symbols were of the same hand. You turn the pages, seeing nothing but strange symbols belonging to no language you can recognize. Even then, it should have repeated characters, but each design is different, leading you to believe it is no language, simply meaningless symbols.\n\nThe next page is torn in the center where the symbol would be. Through the hole you can the next page is blank.\n\nYou check the torn page; it's a violent rip but does not look in danger of growing and the rest of the page is blank anyway.\n\nBut there's something about that blank page...\n\nYou look at it carefully. There! A shape! A rip! A tear! That wasn't you, you're careful. You haven't ripped a page in... Well, it's been so long you've forgotten.\n\nThat's not a rip though... It's growing, like a burn. You set the book down away from the others to keep the fire from spreading but... It's not hot. It's not smoking. Still, the pages burn through.\n\nFiery shapes grow... Why, it's almost moving... It's beautiful. You can't.... You can't look away.\n\nThe ash blows up through the windless air and the sparks bloom into flowers of fire. It's an inferno bubble around you. Your skin burns and blackens and crackles. You can see through the fire now.... In the fire now... It's...", "action_results": [null, null, {"action": "A graveyard", "result": "Colours are swimming behind your eyes and gnawing at the scenic dead trees in front of you as they fade.\n\nIt's raining, not here, somewhere far off, with crashing thunder and bright lightning in the corners of your senses.\n\nIn front of you is a open grave on the top of a hill. The sloppily made wooden coffin is broken into splinters. The insides are empty. In the distances other graves stand, but they are ... somehow... unimportant now. Long strands of grass creep over the edges of the grave and little pieces of dirt tumble in.\n\nSomeone is crying and someone is laughing behind you, but you cannot bring yourself to look away from the stone in front of you that stands watch over its open grave. It's crumbling and cracked but somehow still standing. All it says is \"Forever\" in letters impossibly red on the flawed white stone. A dead tree reaches over the grave and pats your back with its branches. \"You need to forget.\" it whispers in the language of wind. \"You need to--\" But it stops and the sounds fade off.\n\nThe sky is dark and clear but the sun burns bright and white over your head as the moon crawls away from it.\n\n\"What?\" You scream. \"I need to... What?\" This isn't what you want. There is something else... Here... There is....", "action_results": [{"action": "Someone is laughing", "result": "Someone behind you is laughing! That's it! Their continuous laughter is flapping about in the wind and hitting the back of your head. You shake with rage. This is a solemn moment! The death of   the willows! The willows? Something strange is going on. The low throaty laughter slaps you across the face, back and forth. You spin around to face the defiler of this grave. This isn't you... What's happening?\n\n\nYour arms shake and snake around. You hiss at the fellow but no one is there. The sky is blood red now and the far off clouds are smiling. \"I told you. You have to forget. You have to-\" The tree speaks, and is silenced by the howling wind. \"Shut up! Close your foul mouth for one second!\" you scream at the wind. It shrieks back at you  \"You have to-\"\n\n\"Shut up! Shut your filthy mouth! I'm not listening to your lies anymore!\"\n\nSome crows are picking at the tree like woodpeckers and green ooze is coming out of the holes, but wait, they are caterpillars. The circle of life!\n\nThe laughing is back! That awful laughing! But it's high now, like a giggle of some demon spawn. You spin around once again as the crows land on the grass in front of you and sway back and forth. They are giant! Wonderful, you should eat one. Eat one now! WHAT?!\n\n\"Shoo! Shoo!\" You scream, but their taking flight only blocks the laughing one even more. The tree beside you opens its maw and swallows you. All you glimspe is the red sky over long green grass and a white hand.", "action_results": [null]}, {"action": "Someone is crying", "result": "Someone behind you is crying! That's it! The hairs on the back of your stand up and weep at the sight! You must look, you must! but you know it will destroy you. The tree holds you carefully but firmly in its grasp. You have to see the sobbing! You must see the source of the willows! Some part of you questions what that is, but that part of you is buried under this damned sobbing!\n\nYour muscles strain and shake. Your eyes ache as you turn them so far in your head you can nearly see your brain. Little speckles appear in your vision and dance a while before bidding adieu, leaving black fuzz in their absence. Watch! It grows! Lovely!\n\nLook here! See, a butterfly! It floats on the harsh wind. Your head bobs as you follow its winding path.\n\nIf only that in insistant and incessant weeping pause for just a second! You turn around to give the fellow a piece of your mind, but your mind? this isn't your mind that tree is in the way! It opens its great maw and you see something, but the black fuzz! It grows in your vision and blocks it out! All you see is the red sky over long green grass and the screaming face of the butterfly. \"Move!\" you cry but you only glimpse a white hand before the tree swallows you.", "action_results": [null]}]}]}, {"action": "Pick up the grey book", "result": "You pick up the grey book. With just that slight movement a huge cloud appears. As you discover through the huge dust cloud and your tears, it's actually a very old blue book, not grey.\n\nYou walk through the cloud, past the door, and sit down where the air is clearer. You open up the blue book to the first page. In large flowery letters the title is written, \"The Journals of Pip: Volume 8\". Below that, \"His Search For the History of the Colour Blue\".\n\nYou turn the page to read tiny block letters.\n\n\"In his first year of journal writing, three years before his first published novel, \"Theories on the Disappearance of Gravity During the Great Regression\" (since which it has been discovered that spontaneously reverting the universe to a previous state may cause gravity to turn into small quantities of gravy, one of the outlined theories connecting the disappearance with the large increase in gravy mining during the years affected), Pip completed a few journals. One of these was a detailed plan and record of his three month long search for the nature and history of the colour blue. In the following pages you will see his journey as he discovers blue.\"\n\n\"I have tracked it to a cave near the Grinning Stones. At first their wide mouths and the little giggles unnerved me, but I have grown used to their strange habits now. It has been nearly a week since I have seen it enter the cave, but I know it is in there. I hear the little snores before I sleep, \"blu-o-o-o-o-o-o-o.... blu-o-o-o-o-o-o-o...\" it calls. At dawn it will wake me up with a \"Cocklebluedoblue!\"\n\nYou close the book. You just can't read through this radical nonsense. You've read through Pip's research; it's very good. But the man obviously has some trouble telling reality from fiction in his everyday life. You've been to the Grinning Stones; there are no caves anywhere near that region. It's too bad, he was a smart man. A little jerky and obsessive, but smart nonetheless.\n\nBut you have to admit, those stones are creepy, especially at night.\n\nYou pick it up and start on the... long, long journey, to row J786.", "action_results": [null]}, {"action": "Pick up the gigantic green and gold book", "result": "You place your hands over the gigantic book. It has a smooth and soft cover. Hands on the sides of it you strain to lift the thing, but settle for sliding it out instead. You sit down by the door so you can place the thing on your lap\n\n\nYou turn it around and lift the cover. Inside is written I can't understand this language \"Sinful Lake\" in large, golden letters on a black page. It's written in the formal language of birds that are red. You'd think that birds, even just red birds, would only need a single language to communicate, but you must admit, you like the formal language over the everyday filth they will typically squak in. It's a good thing both languages are part of their education system.\n\n\nYou turn the page. There is a diagram of a regular looking oak tree in white and more golden writing.\n\n\n\"Quercus miaxia, also known as the Sinful Oak, is a species of oak tree that exists solely in the region of Sinful Lake. It is the only thing that will grow anywhere within a mile of the stagnant, murky waters. They often grow much denser and taller than other oak trees, but besides that, their diet, and their peculiar taste in soil, they are nearly indistinguishable from Quercus prinus. The Sinful Line is the tree line beyond which they cannot survive. It creates a very noticable change between thick forestation and bare plains.\n\n\nBoring\n\n\nYou flip ahead a few pages.\n\n\nHowever, there has been some controversy over their diet. They have been known to trap smaller prey with the use of a sap that first traps them and with an oxydizing process begins to digest in a very slow manner. The tree will then grow around the trapped prey, which is often still alive through most of the  process. After the prey is absorbed the tree will shrink down around the space the prey has left, with only the bones of the prey remaining. Certain logs found with the bones of what is agreed to be a extinct canine species with a bone structure remarkably similar to humans in the center is the cause of some very unfortunate rumours for us who study these awe inspiring trees.\n\n\nThese rumours that they can trap and eat humans are completely unfounded. The numerous expeditions that into the Sinful Lake region that have disappeared are agreed to have traveled through the Lake into a little known bed and breakfast that exists on the other side. Numerous letters and records are listed in volume 2 and 3 of this series to prove this.\n\n\nYou flip back to the beginning. \"Sinful Lake\". Under that in very tiny letters it reads \"A study by Quercus miaxia Bob\".\n\n\nYou pick up the book with some effort and make your way to row A139 to replace it.", "action_results": [null]}]}, null]}, {"action": "Look at Ophelia", "result": " \nShe's watching the Tailor as he measures your body. You look at her stunning eyes, bright but deep, as they follow the Tailor's hands. They are framed by thin eyebrows, bunched forward as if in intense thought. Her light cheekbones are high in her face and her cheeks thin. Her strong chin leads into weak jaw lines, disappearing in the thick black hair that caves over her thin shoulders and covers the neck of her grey dress.\n\nHer dress is long, covering everything from her wrists to her ankles, but tight around her torso, while loose at her legs. It's not meant to be a showy thing, but the way it fits against her skin reveals her beauty better than the poofy gold decorations that she carries under her right arm now.\n\n The Tailor starts feeling the width of your legs from the calves down and you resist the urge to squirm in... it's?... grasp.\n\nOphelia looks back at you.", "action_results": [{"action": "Smile", "result": "You smile at her, not a large, joyful smile, but a small smile of thanks. You would have never thought you'd enjoy having a woman stare at your naked body in such a circumstance, but without her here you would probably freak out at the furry hands that are measuring your thighs and climbing higher. You take a deep breath. Just calm down....\n\nThe tailor reachs up to your hips and you let out a low squeak against your will.\n\nOphelia laughs so quietly you almost doubt she did. But her smirk confirms your hearing.\n\n ", "action_results": [{"action": "All Finished", "result": "You relax as the Tailor stops his rubbing and moves back. \"You are quite a splendid fit for many of my discarded outfits! Now wait here. I will bring some of them out for you to try on, and we'll see what you like and what looks best on you.\"\n\n\nYou feel a little cold with your skin bare against the frigid air, and definitely a little awkward about standing naked in some castle's hallway.\n\n\nOphelia asks you something, but you're deep in thought.\n\n\n\"What?\"\n\n\n\"Before you ask me anything you should know that most of the inhabitants will tell the king if you insult him or his system in anyway. I can answer some of your questions later, once I show you to your quarters, but if you need to know anything right now, ask before the Tailor returns. I've never known him to be a 'loyal' subject, but considering self preservation... He enjoys his life here, unlike much of the other nobility. So do you have any questions about this place?\"", "action_results": [{"action": "The Tailor", "result": "Before you have time to ask any questions the Tailor waddles back in, carrying all kinds of clothing of many materials and colours.\n\n\n\"These are what you can wear for now, while I create your outfit. Please, sir, while I sort these take a look around. Find something you like. Samples are on the mannequins and the carpets. Changes can be made easily if you wish. Pick one thing please. After it is completed you will likely need to see the others, so a proper wardobe can wait until you return to pick up your clothing.\"\n\n\nYou look around the room, noticing the colourful tapestries hanging from the walls and the ceiling. They are pictures of different outfits of many different styles. You recognize a few outfits from your brief dance, but the one you really see is hidden on the far left. It looks just like Zaren's black clothing. It's the only one with a person in the clothes.\n\n\nHe's in it, posed elegantly in his black and gold coat. His arms are raised as if to hug you and  his eyes smile and laugh as if at a joke, but the rest of his face shows nothing but disdain.", "action_results": [null]}]}]}, {"action": "Turn away", "result": "You turn away. You're not exactly at your most confident while you're naked and some... moth thing is poking you all over. You can't build up the nerve to look at the Tailor either, so you just stare into space while he plies his trade.\n\nA slight buzzing comes from the Tailor's... lips? He turns his head and looks at you from different angles.\n\n\"Hold your arm up. Yes. Please. Okay. Good... I think I have an idea now. Hmm. Something red would look wonderful on you... What do you think? What is your favourite colour? Style? We're in a lull in proper style currently.\" He speaks fast and leaves no space to answer his questions. \"Good for creative expressions, it looks rather silly I think, but Zaren...\" The Tailor's face falls. \"Nevermind.\"", "action_results": [null]}]}]}]}]}]}]}]}