{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=11906", "context": "", "first_story_block": " You wake up in some dimly illuminated room with a damn headache, and the first thing you notice is that you are really thirsty. You also notice that you are not “in” the bed, but instead you are simply on top of it, dressed in a really creased gray suit, and apparently you didn’t even bother taking off your shoes. All of this makes you think “Fuck this, I’m never drinking that much alcohol again in my whole life”.\n\n  But there seems to be something weird in this whole situation: You can’t remember what clubs did you visit last night, or what did you drink at them. Hell, you can’t even remember whether you went out last night or not (even if the answer to that question seems pretty obvious). And what is worse, you don’t have a clue about who the hell are you or where the hell is this place, now that you think about it.\n\n  And since that’s really creepy, you think “Nah, this must be a dream, I’ll wake up soon enough and then I’ll laugh at my own stupidity”. But until you wake up from such a hateful dream, you should do something… “Hell no, there’s no reason to get up in such a hateful dream as this one, screw it” you think as you turn yourself to find a more comfortable position to sleep.\n\n  You try to remember if you had seen some horror movie or whatever thing that could justify such a crappy dream, but you realize there’s no way to find something like that out without your memories. And while you keep thinking in these deep, sort of pointless, thoughts, you fall asleep again. And suddenly:\n\n\n Voice of a Man: “AAAAAAAAA Who are you and what the **** are you doing here?!”\n\n You: “Fuck! Who are you?”\n\n Man: “What the… You are sleeping in MY house and you dare asking me who am I?”\n\n You: “Eh… Well, yes… Why wouldn’t I do it? I don’t remember having ever seen you in my life. And who says this is your place?”\n\n Man: “… O.o… ¬¬ Get the hell out of here right now or I’ll call the police”", "action_results": [{"action": "Try convincing him that you are just a poor human being lost, scared, and unsure :(", "result": " You: “But… But… I can’t remember how did I make it to this place, or who am I, or… you are the only person that can help me! :(”\n\n Man: \"How did a fucking junkie get in my house…?”\n\n You: “No! I swear it’s true! I can’t remember anything, if you kick me out of here I won’t even know where to go to :(”\n\n Man: “Well, I’ll hate myself for doing this later, but… Let’s say I believe you. What do you suggest I do? The only thing I can think of is that the police might know something about you. But you probably should just go straight to a psychiatrist… er… doctor. Or perhaps a hypnotist so you can do a regression, or however those are called. Actually, I know a hypnotist…”", "action_results": [{"action": "The word 'Hypnotist' sounds cool and awesome, and possibly helpful here", "result": " You tell him to call the hypnotist, and he suggests you go sit down in the living room while he  finds the number and phones him. In the living room, you notice a black leather wallet that looks pretty badass, so you grab it thinking it might be yours, and open it.\n\n Inside it you find a bunch of cards and identifications, all of them with different names. Before you can think any more into it, the owner of the flat comes back and informs you that the hypnotist has some free time in 20 minutes, so you should get going. You ask the man if the wallet is yours. He says he’s never seen it in his life, so you put it in your right pocket, noticing right then and there that you also have a lighter in that pocket for some reason.\n\n The man must have been pretty happy about you leaving, because you got perfectly clear directions and reached the building where the hypnotist works in no time. Once you are in his “office”, he tells you to close your eyes, something about a brilliant white light surrounding you, and whatever else they use to make you fall asleep… I mean, enter in a trance\n\n It seems to have worked, because you have the feeling of having been asleep for a while now. You look at the hypnotist’s face, and notice he’s staring at you as if you were something weirder and more creepy than a pink-stripped white alien. You eventually gather enough courage to ask him what he got out of the session, and the hypnotist starts reading his notepad in a voice devoid of any emotions:\n\n “Firstly, you said you see yourself, aged 15, talking happily to some friends, until you all see a bunch of dragons flying over your heads and one of your friends say “Oh shit, I knew this town was fucked. How about we run?”, thing you all agree with. You run through the field and eventually take shelter in a castle. Soon after that, an army of angry dwarfs sieges the castle, and you have to fight them\n\n Next scene is about you running through a highschool filled with zombies, until you find your goal: The garden. You walk around there and notice the guy you hate sitting next to a beautiful well. You turn to walk in the opposite direction thinking “this guy isn’t going to mess with my day!”, but suddenly you stop and say: “then again, I doubt I’ll ever have a better chance of doing this...” You run up to him and kick him straight into the well, in a slow motion movement that is repeated from 3 different angles\n\n Now you are feeling really dizzy inside a hospital’s room, some blond guy is helping you out of there. He says his name is Dani, and that he wants to “save your ass”. He drags you through the hospital, and eventually gets you out of there and throws you inside a car. He then stops and lets you somewhere, telling you he’ll be in contact with you, and if you can’t find him, go to Decasibar\n\n\n Finally, you are at the first plant of a hotel with \"some stereotyped characters, the kind you see in teenagers movies: The nerd, the evil tough guy who thinks highly of himself, the 2 blonde stupid girls who are best-est friends, the black man,the lonely bitch and the hot guy\", in your own words. You all have to participate in a Battle Royale-like game, you see every single fucking death and give a long list of dark details I will *not* mention. In short, the friends kill the black guy, the tough guy kills the hotter one, then the friends deal with the loner, the nerd kills tough guy (thianks to his knowledge of horror movies, he knew exactly where was the guy going to attack him from, and he managed to shoot him through the door), the 2 friends kill each other by activating some trap and the nerd runs away\n\n A weird man armed with a giant wirecutter appears and tells you “Lots of people can’t appreciate their lives. But not you. Not anymore”, you answer “But I didn’t even do a thing, the nerd did kill someone, though”. He comments “Oh, you are honest. Now you’ve really won, he will live too… but first… You must pass a trial”. Apparently he wants to cut a finger off your left hand, you oppose the idea, and he says “LISTEN YOU IDIOT, IT’S YOUR FINGER OR YOUR LIFE”. So you nod, he cuts it and stores it in a plastic bag, and then bids farewell to you, smiling”\n\nYou: “Eh… hehehe… I see...”\n\nHypnotist: “Get out of here now before I call a psychiatric, you fucking piece of shit on crack”\n\nYou: “Yeah, great idea”\n\n You run out of the building, in your hurry your wallet fell off your pocket -.- oh well, you are definitely not going back to the poor hypnotist. Not in a week, at least. That must have been tough on him. And hey, at least you still have the lighter, which is a golden, pretty cool-looking one. You walk in no direction until you see a bar in front of you. Called “Kasi bar”. Didn’t you say something that sounded like that in your insane rambling? Something about a Dani guy telling you to go there? Well, you won’t lose a thing for trying, will you?", "action_results": [{"action": "Enter the Kasi bar", "result": " You get in the bar, which at this time of the day (whatever it is) is nearly empty. You order a beer after telling the barman that “Dani recommended this place” and you are given one without any questions, which makes you happy (and worries you. Who the hell is Dani?)\n\n You sit down in a table by the darkest corner of the place and wonder if you should ask someone about Dani, although you are not sure about whether you can trust him or whether he'll be any helpful. But then again you got a free beer by just mentioning his name, which makes him cool :D\n\n Suddenly, asking someone else becomes unnecessary, since Dani, dressed in a yellow tracksuit with a couple of black lines that looks slightly familiar to you for a couple of seconds, enters the bar, looks at you, and says:\n\nDani: “AAAH, that’s how I like it! You accepted my invitation!”\n\nYou: “Eh… I'm sorry but… who are you?”\n\nDani: “Bad memory? I got you out of the fuckin’ hospital where they were turning you into a mindless soldier with weird skills”\n\nYou: “... What?”\n\nDani: “You know, I know this is going to sound pretty strange to you, but it all started the day you met my sister. Fuckin’ girl is one of them… So they tracked you, and then you were posioned. But just like they expected you to do, you survived with no poisonin’ symptoms at all.\n\nSo they went straight to phase 2, a.k.a “mix of random drugs that can be natural, artificial, or plain crap”. As in, they injected that shit in your blood”\n\nYou: “HAHAHAHA yeah, sure”\n\nDani: “I know right? it does sound fuckin' weird. Nearly as much as your rantin’s as I kicked your ass out of the hospital (they included dragons and bizarre murders, true story). But as I was sayin’, they injected you some new mix and waited to see what effect it’d have on ya, or if it’d simply kill ya. While they were at it, they used this little girl to erase your memories, just to make sure ya wouldn’t try escaping from the place out of nostalgic feelings for your previous life.\n\nPhase 3, ya never reached this one because I got ya out of the place. If you, my friend, had died, your corpse would have been disposed of. If you had survived but showed no signs of an ability, they’d prepare a new mix and retry. Finally, if ya got a new skill, they’d help you to control that ‘power’, and eventually ya would have been sent to do some missions.”\n\nYou: “… Dude… There’s no way I’m believing that, and you know it, right?”\n\nDani: “Of course I do, but I had to try :D Anyways, believe it or not, there’re at least 2 groups out there trying to find you: One of them wants to kill ya, since they have some funny “nothin’ gets out of here” policy, and the other one wants ya to join them (I dunno what are their plans, though)”\n\nYou: “And how can you know that?”\n\nDani: “Why, because their funny experiment on me gave me an attempt at being omniscient. I didn't get *THE* omniscience, but I got to know some useful things. For instance I may find a credit card and know its secret number right then and there, or I can know at any time where are some specific objects located, so I can have someone located if I want it. For instance, I could just stick a lighter into his pocket and whenever I want to talk to him I’ll just go to him and say ‘hey, have ya got a light?’”\n\nYou: “Wait, that thing you just said…”\n\nDani: “Yeah, ya don’t need omniscience to know the lighter in your pocket is mine. Sorry, I ain’t gonna get your memories or your previous life back, I just can’t do that. But we can end with the makers of weird people’s organization. The only reason why I hadn’t left the place until the day I got you outta there was that I knew perfectly well that there was no way I could finish them. That is, until your apparition in the picture, when at last I had an option :D So what’d ya say, will ya help me do this?”", "action_results": [{"action": "Agree to help Dani", "result": " You decide to help Dani, even if you don’t understand half the stuff he's just said\n\nDani: “So yeah, in that case… I guess it’s time I help ya with that weird ability of yours… which will require you to drink some interestin’ thingy, and stuff. It’ll only be 3 or 4 hours worth of side effects and things will be much better for you after it :D”\n\n After taking the risk and drinking some blue liquid Dany was carrying around in a little bottle, you go through some hours of complete mental blackout (which started, by pure coincidence, I'm sure, right after you drank it), you feel…\n\n Absolutely nothing different. It’s already nighttime, though, so you assume Dani just lied to you and wasted your time.\n\nDani: “No, no, you’ll notice soon enough. Way sooner than you’d expe-”\n\nYou: “AAAAAA TRAITOR!!!!” *you get up and knock out the bastard who had silently walked up to you from behind and was about to hit you in the head with a baseball bat. With a single punch, too :O*\n\nDani: “Yeah, that’s what I meant… Poor guy, I never mentioned you’d defend yourself :D your ability is, basically, anticipatin’ a dangerous situation and avoidin’ it in the best possible way by pure instinct. Although I guess we're gonna have to work on the 'Shoutin’ like a FUCKIN’ ALARM before doin’ it' part”\n\nYou: “¬¬… Shut up and tell me how’s that thing going to change my life”\n\nDani: “Well, in other words… Welcome to the Paranoid People Association :D”\n\n*silence*\n\nYou: “Excuse me?”\n\nDani: “Ya know how one of the types of paranoia is feelin’ as if you are bein’ chased or threatened by things or beings who are completely inoffensive. From now on, you’re gonna notice all kind of threats, varyin’ degrees of danger. Normal people will think you can’t trust anyone at all.\n\nHowever, callin’ ya ‘paranoid’ would be a big mistake: whenever you feel somethin’ bad is gonna happen to you, it’ll be because it really *is* gonna happen. But it will be fun, especially once you manage to block the unimportant warnings :D”\n\n Realizing that this Dani probably knows what is he talking about, and that asking more questions now is a waste of time you just nod and tell him to get his plan working,\n\n Dani takes you to his car and he drives you around the city until the hospital you two had apparently escaped from. Once in there, he tells you that he doesn’t trust your “wannabe alarm complex” and tells you that for the sake of both of you he’s going to have you gagged.\n\n You try to convince him that it won’t be necessary, then you rant about how that goes against the human rights, then you rant some more about random reasons against this, but Dani ignores you and tells you he will also tie your hands if you don’t stop saying stupid things. So you decide to shut up and let him do as he wished.\n\n Wait a second, why was this guy carrying a gag in his car? O.o\n\n Anyways, it’s easy for you two to reach the basement you two were heading to thanks to the fact that Dani knew where would the (few) guards be patrolling and your alarm-thing made you hide in a safe location (taking him with you) whenever you noticed someone coming in your direction (I guess Dani’s “they see you, they kill you” sayings really got to you, because you anticipated them *all*).\n\n After Dani enters the right access code, you find… nothing in there! (apparently). Well, there are a bunch of shelves, and boxes, and random stuff. One would say it’s an archive or a storage of some sort. Taking the gag off yourself (you’ll never admit it, but it was helpful), you ask “eh… didn’t you say we were going to kill these people?”\n\nDani: “I said ‘end the makers of weird people’s organization’. Best way to do that is blowin’ their way of creatin’ them. You didn’t think I was gonna come here and kill everyone on sight did ya?”\n\nYou: “Well, actually…”\n\nDani: “Meh, who cares. They’re out there if ya want to try doin’ that, but I suggest you don’t bother, ‘cos you probably wouldn’t make it out of here alive with the shitload of weapons they have and, deep down, they ain’t that bad. Their recruitin’ and creatin’ agent ways ARE bad, but their goal is protectin’ the country and makin’ sure no one else has this ‘technology’. Actually, I’d consider joinin’ them again if they weren’t gonna shoot me a couple of times before saying hi due to this betrayal business. Which will becoe a damn big betrayal once I’m done here. So… will you help me? :D”", "action_results": [{"action": "Ignore Dani's reasons and get your revenge", "result": "You: “Nah, I’m not leaving without at least getting some answers out of the guys who forced me into this thing >.>”\n\nDani: “Well, you see, I understand your feelings and all, but you are lookin' for 4 people: The one who created the system, he never even knew he had done it and he wouldn’t have used it again; the one who decided to use it to create this agency; the one who discovered the experiment could be done on you; and last but not least, the person who brought you here. You may or may not remember that the latter one is my sister. It ain’t like I really like her, although I don’t hate her either, but… I’m not letting ya kill her anyway :D”\n\nYou: “Oh, and what can some guy who only knows a lot of random things do to stop me? As in, the person who can anticipate any dangerous situation, from doing whatever I want to?”\n\nDani: “Apparently nothin’, right? Thing is, you are cool in my opinion, even if back then I was kinda scared of your ability. So I must say it once more: Don’t try anythin’ stupid. But you’re free to go find them if ya want, I doubt you’ll find my sister anyway, so it wouldn’t be that bad :D”", "action_results": [{"action": "Follow Dani's advice and help him complete his plan", "result": " You mumble something that sounds close to “screw them all” while Dani pulls out what seems to be a… shoe box (Seriously, how the hell does he hide all of that in a damn tracksuit?). He puts it in the middle of the room, opens it and… starts setting the bomb inside it to explode, it'd seem.\n\nYou: “O.o Wait, you’ve been carrying a bomb next to me for all this time and I haven’t noticed a thing!?”\n\nDani: ”Ya know, I could lie and say “Oh, no, this thing wasn’t dangerous at all because I knew perfectly well how to make it”. But even when I knew how to make it, and yes, I’ve done it on my own, I couldn’t guarantee that it’s 100% safe. So your paranoid ways should’ve noticed something, I’m sorry for this one detail… :D ”\n\nYou: “… What are you talking about? ¬¬”\n\nDani: “Remember that gap in your memory after you took my funny drink? Well, while ya were off, I gave you something else to limit your alarm-thing when it came to big explosions… and it might have had some side effects, but that’s irrelevant :D I have the antidote back in the car, anyway, then ya’ll be fine”\n\nYou: “Alright… Damn smiling guy who trusts no one… ¬¬”\n\nDani: “No, I do trust people, I just like making sure things work fine! :D”\n\n Dani sets the thing to explode in around 20 minutes, which is more than enough for you two to leave the place. Once again you have no problems thanks to the gag… I mean... you are glad you are never using that thing again.\n\n As you drink the transparent liquid Dani gives you once you’ve reached the car, you hear a pretty big explosion and some alarms, but most of the building seems to be alright, apparently. That makes your destructive side sad :(\n\nDani: “There, there. We’ll have plenty of time to destroy stuff and blow building up if it comes to that. Now we are outta here and I'll deal with some unfinished business…”\n\n Dani drives to some big, pretty cool-looking house located in the other side of the city. He tells you to wait for him inside the car, since he’ll be back in 5 minutes. Indeed, he appears again exactly after 5 minutes, bringing a couple of CD’s he has apparently “borrowed” from the owner of the house.\n\nYou: “What’s that supposed to be?”\n\nDani: “Ah, nothing all that interesting… you still have that lighter with ya?”\n\n You give it to him, he burns the CD’s inside a trashcan, making sure there’s nothing but ashes left of them. Once he's happy about the results, he says “Well, everything’s done :D Now I suggest we get out of this city and do whatever we feel like doing. Because if we two work together, we can do pretty much anything :D”\n\n He is right, actually. You two will probably have fun for the rest of your life. And I’m not implying you two are gay, I tell ya. Lots of homophobic people out there. But hey, maybe you like that stuff and… Nah, Dani doesn’t feel like that about guys anyways :D. So just go and do whatever you feel like doing with your life.\n\n Congratulations on reaching the one I consider to be the “Best Ending”, Especially if you made it here on your first read.\n\nEND", "action_results": [{"action": "Try again?", "result": " You wake up in some dimly illuminated room with a damn headache, and the first thing you notice is that you are really thirsty. You also notice that you are not “in” the bed, but instead you are simply on top of it, dressed in a really creased gray suit, and apparently you didn’t even bother taking off your shoes. All of this makes you think “Fuck this, I’m never drinking that much alcohol again in my whole life”.\n\n  But there seems to be something weird in this whole situation: You can’t remember what clubs did you visit last night, or what did you drink at them. Hell, you can’t even remember whether you went out last night or not (even if the answer to that question seems pretty obvious). And what is worse, you don’t have a clue about who the hell are you or where the hell is this place, now that you think about it.\n\n  And since that’s really creepy, you think “Nah, this must be a dream, I’ll wake up soon enough and then I’ll laugh at my own stupidity”. But until you wake up from such a hateful dream, you should do something… “Hell no, there’s no reason to get up in such a hateful dream as this one, screw it” you think as you turn yourself to find a more comfortable position to sleep.\n\n  You try to remember if you had seen some horror movie or whatever thing that could justify such a crappy dream, but you realize there’s no way to find something like that out without your memories. And while you keep thinking in these deep, sort of pointless, thoughts, you fall asleep again. And suddenly:\n\n\n Voice of a Man: “AAAAAAAAA Who are you and what the **** are you doing here?!”\n\n You: “Fuck! Who are you?”\n\n Man: “What the… You are sleeping in MY house and you dare asking me who am I?”\n\n You: “Eh… Well, yes… Why wouldn’t I do it? I don’t remember having ever seen you in my life. And who says this is your place?”\n\n Man: “… O.o… ¬¬ Get the hell out of here right now or I’ll call the police”", "action_results": [null, {"action": "Decide it's time to run away ASAP", "result": " And after you successfully escape from the mysterious man… whoever he was… you realize you are in the middle of an unknown city with no references at all about your location due to your rushing. That can’t be good.\n\n Asking some random person sounds like the reasonable thing to do. Of course, the police department seems to be the most reasonable place to go to, mainly because you don’t know who are you and/or, now that you notice it, you have no wallet with any clue to your identity (you do have a lighter though, and one could think you were quite the fucking addicted smoker if you’d rather keep a lighter than an identification on yourself), but now you are not so sure about whether you should go there or not.\n\n People are still walking near you (ignoring you completely) and you continue thinking what the hell should you do, when a 20 year-old blond guy comes near you and asks you:\n\nGuy: “Excuse me, have you got a light?”\n\nYou: “eh… yeah, sure” *handing him the lighter*\n\nGuy: “Thanks a lot”\n\nYou: “You are welcome”, unless you can tell me what the hell has happened to me, you don’t really have anything I need at the moment, anyways.\n\nGuy: “Actually I might be able to explain a couple of things to you”\n\nYou: “Uh? Did you say something?”\n\nGuy: *handing back the lighter* “Me? No, nothing. But you seem kinda cool, come meet me later at the Kasi bar. Go straight ahead, turn right as soon as you can, then walk a bit and you’ll see it next to the football team’s official shop, there’s no mistaking it. Tell them Dani told you to go and have something to drink. See you there!” *running away*\n\n Well, booze probably brought you to your current situation, and it’s unlikely to get you out of it. But it’s not like you have many better things to do at the moment. Right now, finding this Dani guy seems quite lucky for you, so you start walking towards the Kasi bar…", "action_results": [{"action": "Actually, no. We don't trust mysterious strangers", "result": " “Nah, trusting unknown people can’t be good”, you think. You walk with no direction hoping the cold will put in your brain some random inspiration on what the **** to do now.\n\n You are so focused on these thoughts of despair that you don’t notice some guy is walking straight towards you. This person probably trusted you to step aside because he is carrying a heavy-looking box. But as we’ve previously said, you don’t notice him in time, so you two crash, and the box falls painfully on your right foot.\n\nMan: “Oh, I’m so sorry, are you alright?”\n\nYou: 'obviously not, you bast…' “Yeah, yeah… no problems”\n\nMan: “You are the bastard, you should have stepped aside!”\n\nYou: “Eh? What did you say?”\n\nMan: “I SAID YOU DIDN’T STEP ASIDE! What the hell were you thinking?”\n\nYou: “O.o Well it’s a long tale, you know”\n\nMan: “Let me guess: you wake up with all the symptoms of a bad hangover and you have no idea about who the hell you are”\n\nYou: “O.o N-No, that’s not it at all. Why’d you say something like that, ha ha…”\n\nMan: “Quit being a retard and come with me”\n\n Well, this taller-and-fatter-than-you-man whose age you can’t tell seems to know a bunch of things and might help you to find out what the hell has happened to you. On the other hand, the fact that he knows all of that might mean that he is the one who has caused you to *be* in this situation, and you have a feeling that whatever they’ve done to you, they aren't done with you (for better or for worse)", "action_results": [{"action": "The man has information that you need to know, follow him", "result": "The man picks up the box again and starts walking. Other than telling you that his name is James, he stays silent until you two reach an old but pretty normal looking building. Once you two are in his flat, he tells you to wait for him at the living room and shortly after this he comes back with a couple of beers, handing you one of them.\n\nJames: “I guess you wonder many things right now, like who am I and what’s happened to you”\n\nYou: “Well, yes”\n\nJames: “Ok, I’ll tell you what I know, questions later. What’s happened to you? I can’t tell you what exactly, since they like trying new things, and that means it might be pretty much anything. However, it all started when you met one of them who found you using whatever their system to detect us is. You were found and later poisoned. But you survived, and either you didn’t even notice a thing or the symptoms were way fewer than they should have been. So they went for the second part of the plan: preparing a “mix” with all sorts of weird… unhealthy… natural or artificial substances they had around the lab, inject them in your blood and wait for the ef…”\n\nYou: “HAHAHA yeah, sure.”\n\nJames: “I told you to be quiet. As I said, they injected something in your veins and waited to see what effects it had on you or if it killed you. And just in case, they also added one extra thing to make you lose every single memory of your life up to that point.\n\nUsually, you either die, and they get rid of your body in whatever random way, or you develop some random ability. Obviously, after your “brain-reset”, they are the only ones you can trust, so at its due time and once you are able to fully control your power, they start sending you to fulfill their missions.\n\nAs for me… Well, I went through that process. Got any questions now?\n\nYou: “… Do you really expect me to believe that?” 'HAHAHA this guy has seen way too many weird movies. And he's got ideas to make an even weirder one!'\n\nJames: “Of course I don’t expect you to believe me right after telling you. As you are thinking, and with good reasons, it sounds too much like a crappy and weird movie”\n\nYou: “… So, uh… I take it your power is hearing other people’s thoughts?”\n\nJames: “Sure, you could call it like that…”\n\nYou: “Ok, let’s say I believe it. Who are these people with enough free time to do that and why do you keep on calling them “They” when it seems you are part of their weird experiments?”\n\nJames: “Some sort of sect, or that’s what I remember being told by someone. We should go meet some friends tonight, they’ll explain all of this much better than I can. If you are interested on it, of course”\n\nYou: “Well, I don’t really have plans for later... By the way, now that you mention the whole \"hearing people’s thoughts”…. I think I found someone earlier who did the same, but I thought I was being paranoid“\n\nJames: “Hmm? Who is this “someone”?”\n\nYou: “Some blond guy called Dani, I think… he told me to go see him to a bar… Capi, or Kati…”\n\nJames: “Kasi, I guess. But I don’t know any Dany who goes there… Anyways, that's enugh procrastinating for me, I should go back to work. Stay here today and don’t even think of going out. That Dani might be one of Them and I think they don’t like it when things don’t go exactly as they expect them to go…”\n\n After saying that, James finished whatever was left of his beer and left. The dark tone in his last sentence sounded convincing enough to keep you calmly watching TV the whole afternoon until James came back, when you two left to see the “friends” of this man.\n\nAround midnight, you two arrive to the place, which seems to be a club filled with teenagers… ok, whatever it takes to cover your activities, or something. After introducing you to a couple of friends, Marta and Alex, James tells you to go to the room next to the toilets, “the one with the “NO TRESPASSING” note, yeah”.", "action_results": [{"action": "Sure, why not?", "result": " Once in the “office” or whatever this room is supposed to be (Honestly, who would put their office next to the toilets in this lame mockery of a Club? Your memories may have been deleted, but you think this city isn't really normal) You see a blond guy wearing sunglasses, sitting behind a desk reading a newspaper. For some reason, the only thing you manage to say is:\n\nYou: “AAAAAA WESKER!!!!”\n\nMan: “... yes, sometimes people say the same as you, although not in such a weird way, I must say. I’m Marius, and even if they’ve told me about you, no one told me what's your name…?”\n\nYou: “I’d tell you if I knew it, but…”\n\nMarius: “Oh well, who cares. I’ve been told you are wondering who were the guys who used you to try their new drugs. You see, I don’t know who directs their organization, although I imagine their leader to be the classical mad scientist who was always failing until one day, not too long ago, he created by mere chance an artificial drug that looked promising. As he had no one to experiment on due to a short budget (Because really, who would have financed his research?), he decided to try it on himself.\n\nThis probably got him even crazier and gave him some sort of special ability. And like that, he decided to try conquering the world by creating an army of people like us.\n\nYou: “ You \"imagine\" that? Then what the hell are you talking about? O.o”\n\nMarius: “The thing is, one of the side effects of that tratment over my brain made me develop a pretty good intuition… I’m not completely sure about those things being real…”\n\nYou: “Excuse me?”\n\nMarius: “Never mind… Hey, would you like helping us kill this mad guy?”\n\nYou: “But… From what you are saying, the only thing he’s done is removing our memories in exchange of some superior power, it isn’t THAT bad, is it?”\n\nMarius: “Well, have you ever wondered whether this was something that you wanted to happen in the first place? what kind of life did you have before the experiment? And do you even know what is *your* power?”\n\nYou: “Well… now that you mention it…”", "action_results": [{"action": "Agree to help him kill this scientitst", "result": " Now that he has you where he wanted, the blond man looks much happier.\n\nMarius: “Excellent. I knew you were reasonable :D”\n\nYou: “Fair enough. When do you want to do it, or how, or what exactly are you planning on doing?”\n\nMarius: “When: soon. Where: he’s in this very city, although I assume he’ll move soon enough to look for new test subjects. There’s a limited amount of people who can endure the stuff those 3, you and me have. Until then, I suggest you talk to James to get a job and find out what, if any, is your power, because it should be useful to you”\n\n You end up working a couple of weeks in the delivery company James was working for, and Alex allows you to sleep in a spare room in the flat where he lives until you find a place for yourself.\n\n As sad as it is, you either have no skills or you can’t guess what is yours, so the Friday when Marius tells you he has a plan, you are the first one to ask what are the available weapons for the task.\n\n Once they make you shut up in exchange of an AK-47, he informs you that the “mad guy” you have to terminate is residing alone and happy in the house where he has lived his whole life, because apparently his mad deliriums tell him no one has enough power to destroy him and doesn’t even need guardians to protect himself.\n\n Marius himself admits this sounds ridiculous, so he asks for a couple of volunteers to join him, because this really doesn’t seem like it’ll be any difficult.", "action_results": [{"action": "You are too lazy to be a volunteer, just be quiet", "result": " Well, if someone else can do it, why should you go? Marta seems to think the same, so Alex, James and Marius leave the bar while you 2 go for another round of drinks to make some time.\n\n Two hours of drunken conversation later, these 3 still haven’t come back, so you decide to go somewhere else. You go back to the club at 4 a.m and still no sign of these guys. Too bored and drunk to do much more, you decide to simply say your goodbyes and head back to your places.\n\n The next day, the radio news talk about an explosion in a house that killed at least one person and hurt 2 more people badly. You try telling yourself it’s just a coincidence. just to try avoiding the guilty feeling of being drinking happily as the place exploded. In any case, Marta and you decide to go see the survivors, James and Alex, in the hospital. Neither of them remembers what happened the night earlier.\n\n You never heard again about/of Marius and the scientist whose name you never learned seems to be missing in action, so you guess it’s mission complete or something, whoever the dead person was. So from now on, you’ll try to live the most-normal-you-can life you can.\n\nNot the best ending, but at least you have some friends who can understand you around ;)\n\nEND", "action_results": [null]}, {"action": "Be a volunteer", "result": " Well, they’ve lent you an AK-47, so you’ll have to use it, right? You leave with Marius and James and head to the scientist’s place. Pretty cool and big house for the “failure at science” Marius said he was, you know.\n\n You get in the building through the backdoor, then you all go upstairs, and as you step in front of the room where the target probably is, you have a damn bad feeling, something like:\n\nYou: “AAAAAAA let’s get out of here as soon as possible” *running towards the stairs*\n\nJames: *running after you and grabbing you* “So much for the low profile… What the hell is wrong with you?”\n\nYou: “O.o … Eh, I really don’t know”\n\n Suddenly, someone shoots from the other side of the door you were in front of seconds ago, fully hitting Marius (the only one of you who hadn’t moved out of there). What's left of the door is opened, and you see the man who is probably the sicentist Marcus mentioned armed with a shotgun he aims at you two:\n\nScientist: “What the… what are you guys doing here? And… what’s Marius’ corpse doing here? O.o”\n\nYou: “Well fuck, you just killed him and… Wait, do you know him? O.o”\n\nScientist: “Of course I do, he helped me with my research for years. Then we experimented with some weird substance we had just developed and Marius decided to try it on himself, even if it was risky. But he died. Or so I thought O.o”\n\nJames: “Are you sure?”\n\nScientist: “You bet. Shortly after that, some people in expensive suits came here asking for the experiment’s results. Someone had already died due to them, so I refused to give it to them. But they wouldn’t leave me alone, until one day… They simply stopped coming, I thought they had given up, but now that I think about it, they probably just got the investigation files from the copy I had left at the lab for… yeah, must be that”\n\nYou: “So… You have no idea about the uses for that thing”\n\nScientist: “None other than causing your death, I thought. I still have some data from those experiments in some CD around here, I mean… WHY ARE YOU TWO IN MY HOUSE TALKING HAPPILY WITH ME!? YOU DAMN THIEVES GET OUT OF HERE BEFORE I PHONE THE POLICE!”\n\nJames: “Eh, sure, sure >.< do you need help to get rid of the body or something?”\n\nScientist: “No, that won’t be necessary, I’ll tell them he came here to rob me, I heard some noise, got scared and shoot him. I guess they’ll believe me, I’m a respected scientist with no previous criminal records. BUT YOU 2 GET OUT OF HERE BEFORE I DENOUNCE YOU  TOO”\n\n As both of you walk back towards the club, you agree on the scientist’s words making sense, but Marius didn’t really have a reason to lie to you. Why would he have bothered saving you from whoever that was if just going to his old-friend’s place would have solved it all? Besides, if the scientist really didn’t know a thing about this stuff, and you are positive he *didn’t* know it, why would Marius want him dead?\n\n Well, the only person who could have answered that is Marius, and he’s dead. After the explanations, Marta and Alex agree that Marius’ actions seem illogical, and you all reach the conclusion that Marius himself was the real \"mad scientist\" from his stories, his madness made him believe a bunch of people in blue wanted you all dead and that solves almost everything you have heard from him.\n\n Almost. Tsk, not understanding some details about a lying mad man’s life is not that much of a problem for 4 people who don’t know who they were before some experiments. You have more important things to do now, like living a normal life xD\n\nEND", "action_results": [null]}]}, {"action": "Refuse to participate in this business", "result": "You: “Nah, I still don’t think what he’s done is bad enough to deserve the death penalty”\n\nMarius: “Alright, I didn’t want to show you this, but… Remember that part about “they don’t like it when things don’t go as they expected them to go”? Well… it’s true. I can show you the evidence”\n\nYou: “I wonder how are you going to do that”\n\nMarius: “You only have to sit in that chair and stay calm…”\n\n You do as he says, and suddenly you are having a flashback. If going through the past memories of someone else's may be called “flashback”.\n\n  As if you were seeing a movie, you see a man jumping out of a pretty high window straight into a dumpster. A dirty version of himself gets out of there and limps towards a steel fence, somehow managing to climb over it. Suddenly an alarm goes off making the man look extremely pale and scared. He starts running, not giving a damn about his obviously messed leg that is probably going to get much worse by doing this, never looking back.\n\n He runs down some streets, both empty and crowded ones, until he trips and falls down in the middle of an empty one. as he tries to get back up, 2 people dressed in dark blue suits catch up to him, and aim their shotguns at him.\n\nUnlucky one: “Please… I won’t say a thing… I just want to live a calm life and…”\n\nThug: “You accepted the rules back then, and you know the price for breaking them”\n\nUnlucky one: “You can’t do this-”\n\n*Gunshot, end of flashback*\n\nMarius: “Did you enjoy the movie?”\n\nYou: “who was that guy, how have you done that, and why should I care”\n\nMarius: “Well, other than that ‘intuition’ I mentioned, it could be said that I have access to other people’s memories when they are in the right circumstances. Such as a great anxiety, for instance. I don’t know if you’ve recognized it, but the place where he got killed is only a couple of blocks away from here. He probably was scared enough to “broadcast” all of that up to this place. And from what I get from you, the way you look like and your thoughts, I’d say you might have seen some of those people in blue?”\n\nYou: “... That's none of your business”\n\nMarius: “Ok, I’m asking again. Do you want to join us and eliminate the leader of that group, or do you want to go back out and allow his minions to destroy you in some dark alley?”", "action_results": [null, {"action": "\"I still refuse\"", "result": "You: \"I still can't do this. I'm just not a murderer\"\n\n\nMarius: \"I really hoped you'd see things our way, at least after seeing that...\"\n\nYou: \"I'm sorry, about that. May I leave now?\"\n\n Since he says nothing, you assume you've been given permission to leave, and start heading out of the office. However, you are suddenly shot in the back of the head.\n\nMarius: \"And i'm sorry about this, but you know about our existence and we can't let them get that information out of you. And yet this is a fate nicer than the one they would have given you in case they had found you\"\n\n You don't really get to hear him say that, though, for you are already dead :(\n\nEND", "action_results": [null]}]}]}]}, {"action": "This guy probably wants to take you to some dark alley and kill you >.< Run away", "result": " You start running around random streets. The man either didn’t follow you or you managed to lose him. Well, good riddance, you suppose. You sit down to rest for a while, still kinda scared about the stuff the man told you, “same as anyone placed in my position”, you think. Sudenly you start laughing for no reason, probably due to the side-effects of seeing so many weird things in less than 2 hours since you woke up.\n\n So happily you laugh that you don’t notice the woman who has stopped right in front of you, smiling as she pulls a gun out of somewhere and shoots you twice in the chest, effectively turning your laughter into a “what the hell\" face. The woman simply aims for your head and says “Sorry, but rules are rules” as she pulls the trigger and kills you.\n\n Hey, it might have been worse. Well, perhaps not. At least you died kind of happy\n\nEND", "action_results": [null]}]}, null]}]}]}, {"action": "Choose a more radical approach to this thing", "result": "You: “Well, good for you. So… Good luck”\n\nDani: “Yeah… Same to you… Don’t go after my sister first, will ya :D”\n\nYou: “O.o you are damn weird, you know… anyways, see you around”\n\n You get out of the room and run around the building for a while. You realize now that you didn’t ask Dani about the location of any of your 4 targets, and you also realize that wasn’t a smart move. Well, entering some office and interrogating whoever is inside it will probably be enough to find that out. Once you are in front of an office that seems to be currently occupied, you hear an explosion and an alarm goes off.\n\nYou: 'Shit, Dani must have done something >.< And what the hell do I do now?' \"AAAAAAARRRGGG!!!!\" *running around some halls*”\n\n Suddenly, you feel really tired. Like, you literally faint.\n\n You wake up not knowing where are you, or who the hell are you, or how did you end up here anyway. You are told that you are the latest member of some elite group, and you’ll be a memeber of this group until you die or they let you go.\n\n You’ll never know that the reason you are alive right now and serving these guys instead of simply dead is a note Dani left near the place he had blown with some explosive device:\n\n“Hi, I brought the guy I got out of here back (mainly because he didn’t feel like helping me destroy your twisted system in a quiet way). He doesn’t remember a thing about me. Actually, he doesn’t remember anything at all. So he’s not worth killing, I tell you. Besides, he is a cool guy with some nice skill :D”\n\n Well, if you don't think about the manipulation being done on you (and you can't really do it, since you don't know about it), at least you are working in a pretty interesting organization. It's not too bad of an ending for you, even if there are better ones out there\n\nEND", "action_results": [null]}]}, null]}, {"action": "Refuse to help him", "result": "You: “Meh, not interested”\n\nDani: “Oh well, you fucked my plan. Whatever, I’ll have to find someone else one of these days… I suggest ya get out of this city as soon as possible, they’re looking for us around here because it’s the only place where we could be that they can think of :D And that’s about it, I suggest you never get anywhere near a psychiatrist”\n\nYou: “What?”\n\nDani: “Nah, nothing, I’m outta here… By the way, take this *he hands you some car keys*. Ya know, blue car parked right in front of the bar. Take care, maybe if you’re still alive I’ll go find you some day :D” *he leaves*\n\n You suppose he’s right, so you take the car keys and enter the car… which surprisingly DOESN’T explode after you start its engine, as you assumed it’d happen (Seriously, what kind of guy would give you a car when you’ve only known him for 20 minutes?)\n\n Well, you’ll have time to think about that and many other things, like what to do with your life. You’ll probably end up slightly insane, as Dani seemed to hint with the psychiatrist part, but who knows, you might actually survive somehow\n\nEND", "action_results": [null]}]}]}, {"action": "The police might be helpful for once!", "result": " This man clearly wants to get rid of you, so 5 minutes later you have been given clear instructions to reach the closest police department, being wished “good luck” and had the door locked right behind you as you left the flat.\n\n You walk towards the police department as fast as you can because the whole “I can’t remember a thing” is freaking you out. Wait, maybe the thing that’s freaking you out is that man dressed in a dark blue suit who is following you. Isn’t he?\n\n “Damn, someone traded my memories for a DAMN MENTAL ILLNESS CALLED PARANOIA”, you think", "action_results": [{"action": "Keep walking not giving a damn, it's probably nothing", "result": "“Whatever, I'm freaking out for nothing. Screw him if he’s following me, let him run and chase me and interrogate me if that’s his intention\", you think as you keep walking. \n\n For some reason I think you wouldn’t have thought that way before having your memories erased. I’m not sure what would you have thought, but not that, certainly; whatever, let’s go back to the interesting thing.\n\n You reach the Police Department with no problems at all, so you suppose your “pursuer” simply happened to have the same route as you. After some minutes thinking on what the hell are you going to tell the police officer in front of you, and noticing that you don’t even have a wallet or some sort of identification, or money, or ANYTHING (except for a cool-looking lighter stored in your right pocket), you decide a serious approach will be the best way to finish this. Problem is, taking “a serious approach” is complicated in your current position:\n\nYou: “Hi, do you think you could you help me with some problem I have?”\n\nShe: “What is it?”\n\nYou: “Thing is… I’m really… disoriented… I’ve woken up in a house I didn’t know, with no identifications or anything, and I can’t remember anything about myself. The owner of the place didn’t recognize me, but he suggested I came here”\n\nShe: “Well… Eh… I think it’s the first time I’ve heard something like that. Be honest: Are you on drugs and/or alcohol?”\n\nYou: “O.o… No, not that I can remember… Why does everyone ask me that question?”\n\n After a while, she informs you that they have no reports of any missing person who might fit your description. She also says that an investigation to find out who are you may start if you wish so, and while they are at it you could go see a psychiatrist or they could give you a new, temporal identity and some money so you can go and do something useful, you fucking junkie (alright, she doesn’t use those words, but that’s the impression you get, anyways)", "action_results": [{"action": "Decide to go to a psychiatrist until the investigation is over", "result": " Seeing a psychiatrist and waiting for the police to fix your problems sounded well. During a week you slept in a room the police lent you (out of pity) that was located in the police department and went to see the psychiatrist. The bad thing is, this “doctor” wasn’t exactly the best in his promotion, because after some sessions in which he found absolutely nothing, he decided to send you straight to a mental asylum, saying you had some sort of “schizoidal paranoia” that had been provoked by the prolonged usage of toxic substances, or something like that. Well, maybe it’s your paranoia what makes you think he’s making all of that up, but you’ll never be sure of that, HAHAHAHA\n\n So you complained to the police, you asked for a new doctor… but no, the Fucking psychiatrist had the labs analyze a sample of your blood he took during your first session and in there he found a combination of toxic stuff that could be a worthy opponent to whatever is on Keith Richards’s blood, so no one believed you.\n\n At the present time, a cop has come and told you a van from the “medical center” is about to arrive to take you to your new location, leaving the room right after informing you. And he didn’t lock the door! This may be your last chance of escaping your fate at the mental asylum, although being back out on the streets with no memories, home, or anything sounds pretty bad, too. Not to mention, the stupid psychiatrist would probably say that you’re a dangerous individual and must be terminated", "action_results": [{"action": "Trying to escape is not worth the risk, let's just go to the Psychiatric Hospital", "result": "Two nice guys enter your room, introduce themselves, and tell you everything is going to be ok. They lead you to a van, and once in front of it, your (unconfirmed) paranoia tells you getting in the van will be bad. REALLY BAD.\n\nYou: “AAAAAAAAAA let me go back to my room!!!” *turning and starting to run back towards the building*\n\nMan #1: *grabbing you* “Oh, I thought we wouldn’t have to do this for once!”\n\nMan #2: *forcing you into a straitjacket and pushing you into the van* “Nah, it happens everytime… Shame, he seemed to be pretty relaxed a moment ago”\n\nMan #1: “you can never trust these guys…”\n\n They lock you inside the van, letting the straitjacket on you. You still think something bad is going to happen, but understanding that no matter how much you cry they won’t give a damn, you shut up as the driver and the other guy talk happily.\n\n Your paranoia, however, turns out to be right. As the 2 assholes who were sent to pick you up keep on talking like… assholes… the one driving doesn’t pay enough attention to the traffic and you all end up crashing into a truck You all die pretty quickly, which is obviously quite bad for you\n\nEND", "action_results": [null]}, {"action": "No way, anything is better than a Mental asylum, you have to escape!", "result": " 20 seconds after the cop’s departure, you silently get out of the room and move through some corridors. Leaving through the main door when we all know someone’s coming to get you sounds pretty retarded, so you decide to hide inside the women’s toilets, pretty close to a row of people waiting for who knows what.\n\n You hear some noise 5 minutes later, but no cops come anywhere close to your hiding place. When the place goes back to normal, you leave the toilets and run to the emergency exit, leaving the building through it. Funny how you found an emergency exit, especially one that wasn’t even remotely guarded, you know…\n\n You ask the first person you see the road to the closest bus station. Once you get there, you steal a wallet off some stupid tourist, grab all of his money, and buy a ticket for the first bus leaving the city. You also say that you found this wallet on a bank in the station (such a nice guy you are, eh ;) )\n\n Once in the bus, you recall how extremely easy robbing was for you, maybe you could do this to survive. Like, you might even have been a robber before the incident, because that was easier that saying your own name (eh… wait, I can’t really use this comparisson effectively with you)\n\n “Meh, whatever”, you think, “as soon as I get to wherever this bus is taking me to, I’ll make those cops regret not having found my identity and decide sending me to a mental asylum by becoming the best robber in the district, hahahaha”\n\n Yes, you will do that… For some reason, you have a feeling that your attempt won’t go that badly, but that’s another tale. Congratulations on being alive, even if this isn't the best possible ending\n\n END", "action_results": [null]}]}, {"action": "Get a new identity until the investigation is over", "result": " You think the prospect of answering random questions a man asks you sounds too similar to going back to school for your liking, so you accept a new identity and the police lends you a crappy spare room they have in the department (until you find something better or die, probably).\n\n They suggest you ask for a job at some places marked in a list titled (although crossed out now) “local businessmen who employ ex-cons”. None of them sound particularly appealing to you, so you close your eyes and randomly choose one, which happens to be some “scrap metal” business\n\n You know, maybe the salary isn’t great (it’s around the same amount as the one you pay monthly for your newly acquired crappy apartment), but removing pieces of cars is funny, and after some time you might have learned enough to get a new job at a better place, a workshop or something. Well, that’ll depend entirely on you and how much does this thing really interest you.\n\n Of course, the police never found out anything about who were you supposed to be. But hey, you can’t really miss something you can’t remember, right?\n\nEND", "action_results": [null]}, {"action": "Decide the Police is useless here and try going somewhere else", "result": " You were wise choosing not to trust the police. Or perhaps you weren't, who knows :D Anyways, you feel that you can’t trust them to really help you on this matter, and before they can ask you more questions, you walk out of the building.\n\n Soon after leaving, a blond 20 year-old guy walks up to you and asks you if you've got a light.\n\n You do have a lighter, indeed (although you don’t really know why), so you lend it to him. As he starts smoking, you wonder why would you keep a lighter and not a wallet, and you think you’ve been quite stupid to leave the flat without thinking on *that* detail.\n\nGuy: *as he smokes* “Yeah, it certainly has been an stupid movement by your part, but you shouldn’t really feel guilty about it. You’re fucking confused right now, after all”\n\nYou: “Uh? What did you say?”\n\nGuy: *giving you the lighter back* “Me? No, nothing. But you seem kinda cool, come meet me later at the Kasi bar. You only have to go straight ahead in that direction, you’ll see it easily. Tell them Dani told you to go and have something to drink. See you there!” *running away*.\n\n Well, booze probably brought you to this situation, and when you have a drinking problem drinking more is rarely the way to fix it. On the other hand, this Dani has invited you to go, and it’s very rude to ignore an invitation, especially when you have NO MONEY AT ALL with you.", "action_results": [null, null]}]}, {"action": "Stop and run back to face your possible pursuer", "result": " You turn around and walk up to the dark-blue-suited man, who at this particular moment seemed to be really interested in the clothes of a random shop.\n\nYou: “Hey, why are you following me?”\n\nHe: “Hmm now that you mention it… yes, I’ve been following you”\n\nYou: “Damn, I’ve already noticed that, now can you answer my question and tell me why?”\n\nHe: “Well… the fact that you are here talking to me instead of running away implies that you don’t remember us. Which puts me in a moral dilemma because, you know, I’ve been sent to kill you because you escaped our operation base knowing who we are. But it’s obvious you don’t really know it. But shit, I've just told you that…”\n\nYou: “wait, what? O.o”\n\nHe: “Ah, shit, I’ll have to kill you”", "action_results": [{"action": "Punch him in the face and Try to escape", "result": " You punch him and turn to run as fast as you can to try getting him off your heels\n\n Your move apparently caught him off-guard, and this has given you a small distance, but you should choose where to go to, quickly.\n\n You may try running straight ahead the street you are at, which is pretty big and crowded, hoping the man will not start shooting everything on sight to get you, or turning to one of the smaller streets left, with less people and probably better places to hide at", "action_results": [{"action": "Run down the main street", "result": " You run. You run like a damn paranoid being escaping from some unknown thing… wait, that’s pretty much what you are.\n\n Your follower has apparently gotten lost somewhere on the way. Good for you (I guess)", "action_results": [null]}, {"action": "Try the side streets", "result": " Well, that was a bad move. Sure they were smaller streets, but since there weren't enough people complicating his task, the suited man managed to follow you all the way to a dead end where no one else was present, shooting you dead right there without any more ceremonies\n\nOuch :(\n\nEND", "action_results": [null]}]}, {"action": "Try to negotiate with him", "result": "You: “Wait a second! You don’t have to kill me, I don’t even know what are you talking about, what’s this thing about me having escaped, anyways?”\n\nHe: “Hey, what can I do? I have my orders”\n\nYou: “Hell if I know… take me back to the place from where I escaped, for instance?”\n\nHe: “Well, that sound like a good idea, yeah”\n\n He leads you to his car and once there he drives you to who knows where, which seems to be at least in the other side of the city.\n\n During the relatively short journey you wonder what’s the deal with this guy, since he is supposed to kill you but doesn’t even seem to know you or be all that smart to start with. Like, it was you who suggested going back “there”, so maybe if you had said “just let me go” he might have gone and done that. And now that you think it, it certainly would have been easy to lose him in the streets of that city. Ah well, no sense crying now.\n\n You get out of the car accompanied by the man, and notice that you are standing in front of what appears to be a huge hospital. You realize that once you go in there, there’s no coming back, but at the same time you understand that right now you can’t do anything else other than going in there or dying, which is bad >.<\n\n You enter the “hospital” and the suited man leads you to some office in there. After knocking on the door and having a brief conversation with whoever is behind the door, you are eventually told to come in (the damn psycho didn’t take his eyes off you for a second while you were out there >.<). Once in the room, you see a dark-haired woman in her early thirties who looks like she’s damn bored, who is sitting in front of a laptop writing something.\n\nShe: “So... you can’t remember anything, right?”\n\nYou: “Exactly”\n\nShe: “You see, we applied some… experimental treatment on you while we were in this very hospital, and before that you accepted to work under us. When you accepted that, you knew you were accepting to work for us or we would have to kill you”\n\nYou: 'I don’t really think I would have accepted an agreement under those terms, but what can I do' “I see”\n\nShe: “However, you escaped somehow before the treatment was over, and it’s true that we think you might have been helped to escape, or even forced to do so by some outsider. That’s why we are going to allow you to join us again in the same terms”\n\nYou: “So I either join you with no chance of leaving or…?”\n\nShe: “you die, obviously. That doesn’t mean you are a prisoner here or that you’ll never get out of here in the future”\n\nYou: “Well… I suppose I have no choice…”\n\n Let’s say you’re now part of a special group with strange and useful powers (or something) that were “awakened” by an injection of drugs, toxic artificial things and who knows what else straight into your blood (as a mere agent, no one is going to explain the whole process to you). You are not really sure if you’ll be working under the good guys or the bad guys, and right now you don’t even know what’s your “power” (as much as that woman tells you that it’s obvious that you have one and you probably have already exhibited it spontaneously). Oh well, at least it sounds like this might be funny xD\n\n Well, as far as endings go, this could have been much worse, congrats!\n\nEND", "action_results": [null]}]}, null]}]}]}