{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=10359", "context": "", "first_story_block": "Day Zero.\n\nYou wake up, it seems like a normal day.\n\nA little too normal....", "action_results": [{"action": "Go To Work", "result": "You put your clothes on and head to work. Regardless of the abnomal normality of this day, the bills need to be paid. You walk down the street to your local 7/11 ,head to the back room and put on your work clothes.", "action_results": [{"action": "Time to Work", "result": "You spend the rest of the day working, your 9-5 job goes by as normal as ever.\n\nAt little too normal....", "action_results": [{"action": "Well works done, let's go home", "result": "You change back to your normal clothing and walk back home. There's not much to do so you make some food, play some games, masterbate and fall to sleep.\n\nEverything was just too normal though...", "action_results": [{"action": "Day One", "result": "Suppose it makes sense nothing unusual happens until the first day. After all, if anything happened the day before then that would have been considered the first day, now wouldn't it have.\n\nBefore you wake up, let's reflect on who you are so you don't die to some random incident due to some crazy issue you had that you should have known you had all along since you are you.\n\nAnyways....\n\nName: James\n\nAge: 23\n\nSex: Yes Please Male\n\nOccupation: Clerk at 7/11 (Full time)\n\nIntelligence: Average\n\nStrength: Average\n\nStamina: Low\n\nWeapon Experience: You can swing a melee weapon, then again anyone can do that.....that's it\n\nRelationships: You got a best friend who lives next store (Bob) and your family (Mom/Dad/younger Sister) lives across town, that's it. Don't you get lonely?\n\nDriving: You can drive fine, but sadly you cannot afford a car right now.\n\nSpecial Traits : None, you are an average bastard", "action_results": [{"action": "Guess it's time to wake up", "result": "You wake up at 8am, take a shower, throw on some clothes and turn on the local news. Everything seems to go just like it did yesterday, and the news is pretty much the same. Except all the normal murder stories are replaced by animal attacks and riots.\n\nThe news doesn't say anything specific, no mention of zombies or anything, but the potential is still there...\n\n ", "action_results": [{"action": "Go to work anyways", "result": "You decide to head to work anyways, you need money if you're going to finally buy a car and you have bills to pay.\n\nNothing unusual happens on the way to work, nor for the first 3 hours. However at noon the news starts to say some interesting things. It's saying that the attacks and riots this morning are actually due to a new virus. They instruct everyone to return to their homes and wait until further instructions.\n\nNo one arrives for the next hour, and finally your boss calls and tells you to go home. You change and proceed to head home, but then something different happens.\n\n ", "action_results": [{"action": "Well it's about damn time", "result": "You exit the employee room, and find a customer standing just inside of the entrance to the store. He seems pretty out of it. You tell him the store is closed and he turns to you.\n\nHis clothing is covered in blood, and his eyes seem completely black. He starts to stumble towards you.\n\nYou continue to yell at him, angry that he is ignoring you. Finally, when he's just out of arm's reach, you realize hes probably been infected with that virus you heard about on the news.\n\nYou hate to admit it, but he's probably a zombie.\n\n(Well no shit Sherlock)\n\nSo, what's the plan?", "action_results": [{"action": "Wrestle Him", "result": "You um...decide the best course of action is to wrestle a zombie.\n\nPerhaps \"average intelligence\" was a bit too generous...\n\nRegardless, you slip behind the zombie and put him in a chokehold. You lean back, fall to the floor, and wrap your legs around him.\n\nNow usually this is the part where the person would slowly lose consciousness, and you would then let go and kick them a few times for good measure. Sadly this person is a zombie and can't lose consciousness. As such, his continous struggle eventually gets him out of your iron grip, and he bites your arm.\n\nWe could go further into the story, but you can guess what your ending is now.\n\n \n[Death]", "action_results": []}, {"action": "Avoid him and exit the store", "result": "You avoid the man and exit the store. He looks pretty dangerous what with being covered in blood and all. You lock up behind you, effectively trapping the man inside.\n\nYou don't care though, whoever works next can deal with him. You walk home and throw on the news to see exactly what this new virus is.", "action_results": [{"action": "The News", "result": "The news says that the new virus causes people to become hyper agressive, and that it is passed by the transfer of bodily fluids. They advise again that everyone stay indoors and wait for further instructions.\n\nFurther in the day a video is shown on the news, the nature of the video makes it appear as if the news itself was not the one showing it. The video shows a man and one of the \"infected\", he says that they are like zombies from movies and such. The two are outside, it appears to be a parking lot but you can't tell what the building is and there are no cars.\n\nHe says there is no cure and that everyone should put their \"Zombie Survival Plan\" into full effect. He then shoots the newly dubbed zombie in the head, and instructs that the only way to kill them is to damage the brain, however destroying their legs can render them pretty harmless as well. He continues and says that they are slow, and you can outrun them, however they never get tired.\n\nPretty detailed for the first day of the infection.\n\nBy now it's pretty late, you've been watching the news so intently that you've lost track of time, you go to sleep and decide that tommorow you'll put your Zombie Survival Plan into full effect!", "action_results": [{"action": "Day Two", "result": "You wake up to day two of the infection. Only now do you realize that you don't actually have a zombie plan.\n\nWell no worries. The infection is still in its early stages, and it should be at least a few days until all hell breaks loose. Until then you can probably walk the streets with no worries.\n\nProbably...\n\nSo, what's the plan?", "action_results": [{"action": "Go next door to your buddy Bob's", "result": "You decide to go see your buddy Bob.\n\nYou exit your house, lock it, and walk next door. You knock on the door and he answers.\n\n\"Hey James, wanna get high....\" Bob says, answering the door and showing you some weed.\n\n ", "action_results": [{"action": "Fuck Yea!", "result": "You nod your head and enter. The next few hours go by quickly.\n\nWell, at least you think they do....", "action_results": [{"action": "Hours Later", "result": "Hours later you remember why you came to Bob's house in the first place.\n\n\"Hey...hey Bob\"\n\n*cough* \n\n\"Sup?\"\n\n\"You know there's like, zombies out right now. Right?\"\n\n\"Shit....shit really?\"\n\n\"Yea\"\n\n\"Fuck man. I thou-\"\n\nBob's comment is interupted by a knock on the door, a slow heavy pound.", "action_results": [{"action": "Idiots can't knock right", "result": "You go to the door and look through the peephole. Bob comes up behind you and tries to look through, but you push him back. Outside there's a girl, Bob's girlfriend if you're not mistaken.\n\nSadly his girlfriend is in bad condition, in fact shes missing an arm. Clearly she's a zombie, which begs the question...\n\nShould you open the door?", "action_results": [{"action": "Yes", "result": "You open the door....really?\n\nYou honestly thought that opening the door for the one-armed chick who is clearly a zombie fell into the \"good idea\" category?\n\nWell you did it anyways. The girl's knocking arm misses the door and instead hits you in the chest. It doesn't hurt, but she grabs onto your shirt and lunges forward at your neck. You attempt to fight her off, and are somewhat successful. Although you keep her face away from your neck, you both fall down to the floor, her landing on top of you. Using all your strength you push her off of you and towards the door. She ends up in a sitting position at the base of your feet.\n\nThis entire time Bob is just staring at the two of you. Finally he does something.\n\n\"Dude, that's Claire right!\"\n\nActually it's Casey, but this isn't the time to correct him and lecture him on how he should at least know the name of the girl he's dating. You attempt to crawl away from her but unfortunately she grabs your foot and takes a large bite into your ankle.\n\nYou kick her in the face with your good foot and manage to get her outside the door, the quickly lean forward and shut the door.\n\nBut you've been bit, so your story ends here. Also you eat Bob, but that bastard kind of deserved it for not helping you anyways.\n\n[Death]", "action_results": []}, {"action": "Course Not", "result": "You turn away from the door. There's no way in hell you're opening it and letting her inside.\n\n\"Who's that?\" Bob says.\n\n\"Errr....wrong number\"\n\n\"Oh...\"\n\nBob walks away, apparently believing that the person knocking at the door had the wrong number. You throw on the TV and watch the news for the next few hours, forgetting all about the reason you came over to begin with....\n\nHours later you remember though (good thing right?).", "action_results": [{"action": "Time for \"The talk\"", "result": "Hours later you tell Bob that zombies have risen, and go into a detailed description of your day.\n\n\"Woah...sounds rough.\"\n\n\"Yeah, well least I'm alive. So what's your zombie plan?\"\n\nBob stands up from the couch and walks to his room. He comes back and throws a piece of paper at you.\n\nHe actually had a zombie plan...\n\nYou read it and it's not the most detailed, but it's better than your plan....of nothing.... You decide that in may be in your best interest to stay with him. Then again the guy can be very unpredictable, and when his weed runs out he'll probably get pretty pissed. But then again, he has a shotgun and you have no weapons at your place. Though trusting this guy with a shotgun makes you feel a bit uncomfortable.", "action_results": [{"action": "Stay with Bob", "result": "You decide Bob's plan is better than yours, and depending on what you've done you may not even have the supplies needed to survive on your own.\n\nA week passes and things happen. The military comes by in a caravan and tries to pick people up, but the two of you decide to stay inside (you were also scared they would find the weed). After picking people up the miltary attempts to control the situation, but they fail quite badly. People and zombies alike attack, but Bob's house holds out, at least for the first two months.\n\nThe weed ran out after the first month, naturally Bob was pretty upset at first, but he dealt with it without going apeshit on you.", "action_results": [{"action": "Phase 2 Interlude", "result": "Well, this is a bit awkward....\n\nLet's just say due to some constraints in the system and whatnaught you have to come here before Phase 2 can begin.\n\nSuppose a congratulations is in order, then again you only beat the first of three sections. Not to mention unless you were a dumbass (or having fun) you shouldn't have died at all. Common sense was all that was required to survive.\n\nGood luck in the next section, it requires slightly more thinking.\n\nAlso there was one actual ending in phase 1, see if you can get it later.\n\nHere's something to help you on your journey.", "action_results": [null]}]}]}]}]}]}]}, {"action": "Drugs are bad mkay...", "result": "You shake your head.\n\n\"It's not optional\", Bob says in an angry tone.\n\n\"Kay....\"", "action_results": [null]}]}, {"action": "Go get supplies", "result": "You decide to get supplies. Sadly you do not have a car, so your place for supplies is the local grocery store, a good 15 minute walk.\n\nYou walk there with no issues, however everyone seems to have the same idea you do, and are all stocking up on supplies. You enter the store and see complete chaos.\n\nWell, what now?", "action_results": [{"action": "Go back home", "result": "You go back home, since you'd prefer not to die just to get some food. You return with no issues and decide on your next course of actions.", "action_results": [{"action": "Go to you parent's house", "result": "You decide to be a momma's boy and head to your parent's house. I mean, who else would know better how to survive zombies than your parents, right?\n\nIt's a long walk, and since you won't be carrying anything (or returning for that matter) you ride your bike there. The journey takes an hour and along the way you notice various people taking part in riots, causing violence and eating each other. Though you hope those last ones were actually zombies.\n\nYou hope...", "action_results": [{"action": "You get to your parent's house and....", "result": "You arrive and put your bike in the garage. Everyone should be home what with the news telling everyone to be at home and all. You enter through the front door and are greeted by you parents.\n\nYou explain the situation as you know it and they explain that the military is coming, soon. They say within a week they will be here and then they will take everyone to a \"safe location\". Until then your family will wait it out in their home. They have enough food for a week easily, and your dad has already started boarding up the house.\n\nThey insist you stay with them, but since you're a big boy they don't plan to keep you here by force. It sounds like a good deal, wait a bit then be rescued by the miltary. There might be some sort of catch, but for now you don't know what it is.", "action_results": [{"action": "Stay with your family", "result": "You decide your best bet is to stay with your family. You doubt that the military will be as bad as they are in the movies during these times, so you're sure they can help you.\n\nWell, kinda sure...\n\nRegardless of if they can or cannot help, you and your father board up the rest of the house and your family waits out the week. Mant games of scrabble are played. Sadly you suck at scrabble, which makes this week one of your least favourite weeks ever (the zombies made it pretty bad too).\n\nThen the military finally arrives.", "action_results": [{"action": "Well it's about damn time", "result": "The military arrives a week after the start of the outbreak. True to their word, they begin calling out to people in the middle of the street to come outdoors and be picked up. Any nearby zombies stand no chance, as the military caravan consists of armoured vehicles which can handle the small amount nearby easily.\n\nYou family opens the front door for the first time in a week and runs to the caravan. You kick the scrabble board for good measure before following them outside.\n\nYou approach one of the transport vehicles (the one you family ran to before you) and are greated by a soldier.\n\n\"Greetings\", the soldier says as you approach, \"what brings you out here?\".", "action_results": [{"action": "[Moan like a zombie]", "result": "You make various noises to try and mimic a zombie.\n\nNow why the hell would you do that?\n\nThe soldier, in all of his 30 minutes of experience with zombies, has no idea that you are in fact, not one. As a result, he instinctively shoots you. No worries though, he has been trained properly and gives you a clean shot between the eyes. You don't even have time to scream.\n\n[Death]", "action_results": []}, {"action": "\"I want to come\"", "result": "\"I want to come.\"\n\n\"Well fair enough, come on in!\" the soldier replies, motioning for you to come in.\n\nYou hop in and ride out into the sunset, just like some old western movie...", "action_results": [{"action": "Epilogue - Family", "result": "Ha! Like you'd actually get a real epilogue. You choose the fastest way out of the city.\n\nYou and your family make it to the shelter and are protected by the military. You get news a little later that Bob was killed, cause of death was zombies.\n\nYou live the rest of your life in the shelter. Sure the food is crap, the military is full of assholes, and there's not much to do, but hey you're alive right?\n\n \nStats\n\nYou got the First Epilogue available in the game.\n\nYou survived Phase One.\n\nYou got the Mediocre Ending.\n\nYou got the achievement : Family Man", "action_results": []}]}, {"action": "\"I want to pillage and rape this town \"", "result": "\"I want to pillage and rape this town\", you reply.\n\n\"You do eh....\" The soldier says, looking you up and down.\n\n\"Well see, I can't let you do that, so, uh....\" The soldier thinks about what to do in this situation and decides that it's best to shoot you in the leg. You scream out in pain and hear your family protest, but the soldier ignores them and the vehicle drives away.\n\nYou manage to crawl to the sidewalk but the pain of the shot is too much and you faint due to blood lose. Shortly after, a crowd of zombies stumble by.\n\nI'm sure you can guess what they plan to do with you....\n\n[Death]", "action_results": []}]}]}, {"action": "Go back to your place", "result": "You decide you're better off not trusting the miltary to this, you ponder on the idea of convincing your parent's and sister to not trust them but decide their best chance is to. After all a zombie world is no place for a family....\n\nYou say what may be your last goodbyes to your family and head back to your house, it takes a while but once again you beat all odds and return unharmed (though you're pretty damn tired by now).\n\nToo tired to try and get supplies you decide to just walk next door to Bob's house and see what his plan is.", "action_results": [{"action": "See what Bob's plan is", "result": "You go next door to Bob's house. He answers the door, clearly high. Not bothering to ask him anything in this state, you enter and close the door behind you. He stares at you the whole time with a blank look on his face, but says nothing.\n\nMoments later you hear knocking on the door. A slow, heavy knock.", "action_results": [null]}]}]}]}, null]}, {"action": "Go to where most people are - those are the supplies you want", "result": "You decide to go where everyone else is, because following the crowd is sometimes a good thing. Right?\n\nYou try and get a shopping cart through the crowd but give up, there's far too many people. You instead reach out and grab as much food as you can in your arms.\n\nHowever this is where your plan of following the crowd fails you. You see, some not-so-friendly people with guns had the same idea. They also seem to not be big fans of large crowds, and so they shoot in the air and into the crowd a few times.\n\nMost people are uninjured and run away, as gang of men have made their point. Sadly you are not in the group that survived, because you were shot in the leg. Now of course, a shot in the leg isn't fatal, but it did cause you to fall to the ground. Then what was your cause of death you ask? The large crowd of people who trampled you to escape was.\n\nHey, at least you weren't eaten.\n\n[Death]", "action_results": []}, {"action": "Go to where no one is, it's safer that way", "result": "You decide to avoid the large crowd of people and go to the less populated areas. The pickings are slim, but you manage to get your buggy at least half full with food. You should be able to survive at least a few months with this much.\n\nYou hear a few gunshots from a couple of isles over, followed by a mass of people running out of the store. You take this as your cue to leave, and quickly run out of the store pushing your buggy of food.\n\nYou get out fine, and your journey home is uneventful. You hope you don't run into those who made the gunfire later.\n\nWell now you're home, you got food, next step is to....", "action_results": [{"action": "Barracade and wait it out", "result": "You decide to barracade your house and wait things out. You grab various tools and pieces of wood, then board up all your windows and doors.\n\nThe next two months pass by and many things happen.\n\nMany, many things....", "action_results": [{"action": "Well what happened?", "result": "A week after the events of the first day of the infection various things happened.\n\nPanic happened, riots happened. Real ones, not the initial ones which were actually just zombies causing havoc. Martial Law is put into effect, though it only lastws a few weeks before the military was over-run. Fighting the zombies head on was a bad idea but the military didn't learn this fast enough. They came by with caravans originally and picked up anyone who was willing to come with them. Then they created blockades and such to try and contain the problem. But eventually they were over-run.\n\nYour home is attacked a few times, but nothing major. A few gun fights happened just outside as well, but you survive. You've lost a bit of weight, but you're alive and well...ish.\n\nTwo months have passed and for the past week it's been very quiet outside. No zombies, no people, nothing. Good thing too, because you're out of food and need to do leave the house now.\n\nOh and congratulations, you survived Phase 1 of the zombies.", "action_results": [null]}]}, null]}]}, null]}]}]}, {"action": "Try and reason with him", "result": "You continue to yell at the man, determined to get through to him. When he finally reaches you he grabs ahold of you and gives you a heartfelt hug. It seems you finally got through to him.\n\nWait...no....no that's not a hug! The man grabs a hold of you and proceeds to bite your neck, ripping out the flesh from it. You fall to the floor and bleed out. Good thing you bleed out quickly, being eaten alive sure is painful.\n\n\n[Death]", "action_results": []}]}]}, {"action": "Call in sick and see how everything progresses", "result": "You call in sick, you don't feel like being involved in any riots or being murdered. Nothing new appears until noon, when they announce that the cause of all of this violence is a new virus, and that everyone should stay indoors until further notice.\n\nGood thing you didn't go to work.\n\n ", "action_results": [null]}]}]}]}]}]}]}