{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=5466", "context": "", "first_story_block": "Creator Notes: Please maximize the window to fully enjoy. I made this to tell a story while allowing you to see first-hand what the characters feel, think, and what they've been through. I wanted to make something enjoyable and worthwhile, so here it is.\n\nDisclaimer: All pictures are not mine - they are from google. Where the heck else will I, a 14-year-old, get  angel pictures? However, all characters and such are mine.\n\n\n\n\n                                                                                                                                                                                                 \n We throw out our bodies on the fire and we die,\nSettle into ashes as the flames keep piling high\nWe tossed and spread the kerosene and alcohol,\nThe ethylene ignited cardboard homes.\nThe second in a hundred and again as many years\nStreet signs, skyscrapers and names.\nState Street, what a great street\nWhen the places and the people stayed the same.\n\nWinter beats the summer on the worst ones\nI fall in love again on the first ones\nCarbon vapor lines burn as a grid\nLike the burning summer evenings like my fingertips did ...\n\nThis town is choking on our filth\nObstinate displays of wealth\nClog our Lincoln, Wicker, Rogers parks.\nHere's to your health Chicago.\nFiddle as we burn.\nNevermore, nevertheless\nBuild it up and tear it down and never learn .....\n\n-- The Lawrence Arms  \n\n                                                                                                                                                                                              \n\n \n \n\n\nPROLOGUE:\n\n BURNING CHICAGO\n\n ", "action_results": [{"action": "Start the game.", "result": "' \nThere's a strange soft ringing in my ears, but I cannot open my eyes. Cinders of gray and red have blinded me, my movement halted by something large crushing into my back, my ribs. In an instant, I remember everything. A sound of gunfire and a thick, hearty smell of fuel makes me naseous.\n\n\"Yuzo! Aki!\" I can't even recognize my voice, it's so torn and raggerd.\n\nThe apartment is no longer an apartment, but a pile of rubble and belongings - some of them I would know as my own. Swollen and burning with tears, my eyes try to pry open and see, and I'm made frantic by the sound of perpetual ringing and crumbling.\n\nMy leg is mingled under the thick layers of debris and rock, and I fear it will only mangle worse with struggles.", "action_results": [{"action": "Try to pry away.", "result": "When I finally decide to try to pry myself out from under the rubble, I brace my abused hands down and pull out with as much vigor as I had to muster. I had to tell myself, no matter the strain placed on my leg, that staying would not save me. I have to escape, and I have to find Aki and Yuzo. I can't simply abandon my childhood friends.\n\nThere was a loud pop that came after my leg was released from the painful hold, and I screamed. Oh, how I wish to see. I could feel hot ash brush under my face, in my hair. I tried so horribly to leep them away; I must've been pathetic.", "action_results": [{"action": "Go find Aki and Yuzo.", "result": "Slowly, I have gotten through much of the debris, though troubling. At the moment, my mind was set upon my two friends. If I was in such a wretched state, what was of them?\n\n\"Y-Yuzo! Can you hear me! Please answer me!\"\n\nThey could've been buried in debris...", "action_results": [{"action": "Go find help.", "result": "I decide to find someone to help, someone who has better eyes and can see more than me. Someone who could tell me whether my friends have made it through; I would not make it without it.\n\n\"Is anybody out there?! Anyone?! Please, answer me!\" \n\nFor a long time, there is no response, and suddenly a \"Who's there?\". It was a deep voice, like one's father would have. Then, a hand touching my shoulder. \"My god, boy! You shouldn't be walking! You have a deep laceration in your side! And your eyes...\"\n\n ", "action_results": [{"action": "\"Please, we need to find my friends.\"", "result": "He was silent as a grave, looking at me with sad eyes. \"Kid, you're a miracle to be alive yourself. Your friends have a ghost of a chance. A ghost of a chance, I'm telling you.\"", "action_results": [{"action": "\"No, you're wrong! Dammit, you're wrong!\"", "result": "My face scrunches with anger, my aching eyes glaring. \"Damn it, they are fine! They could be alive! You need to save all of the people alive right?! No matter the stakes! No matter anything!\"\n\n\"Kid, calm down. You'll only hurt yourself.\"\n\n\"How can I be calm when...!\"\n\nThe man was right - I think I'd fainted in the prime of my cursing and ranting. '\n\n \n\n...This is where it will truly begin.", "action_results": [{"action": "End of Prolouge", "result": " \nIn 1954, Zempaphs were introduced into life; these newborns had contracted Schizophrenia Morphi, a specific type that allows into the baby a new part of the brain to use - almost like a locked door being opened up with a new key. Most are born insane, it's said, but out of every ten, there is a good three that have no symptoms of brain defunctions. Of course, only an estimated three hundred are recorded to date.\n\nOf this small group through billions of the Earth's people, they are gifted with unusual abilities. Normally, telepathic abilities and telekenesis -- even more than those as well. They are normally instantly noticed at birth because they are born feeble; and the Umbilical cord detaches around five hours before birth. We speculate that that is because the brains oxygen lowers, except the part of the brain that can perform the Zempaph abilities that then 'vacuum' stronger brain cells - the many accelerated during the fetus phase - and use it to boost its power in the last moments.\n\nMost births have proven fine to the mother - no miscarriages or mothers dying have yet to be seen. Now, the whole Zempaph debate (on whether to take more special... 'precautions'...) is in 1983, when one in certain, a young boy, had murdered his fellow classmates in Gates Elementary School. It spawned the Zempaph Hazard and Confinement Law, which would immediately put any one of the specimen into special classes to undergo brain alterations. In this way, they would not be as unstable, and the chance of murder is cut in half. When they brake laws, they are confined to special rooms.\n\nSome people thought it wrong, but it had more support than protest.\n\nThe next incident... one of the most horrific incidents ever recorded in human history... would be The Devil's Act. In this, one Zempaph in specific had went on a rampage and destroyed cities near Canada... Chicago being a major one. Thousands or thousands had died from one: Julian Moore. He was around twenty-seven when the whole thing occured in 1989, using a manipulation of fire to destroy everything in sight. We still don't know if he is a 'Fire Manipulator' or a 'Fire Starter'. Fire Manipulators can bend an already lit fire, while a Starter can make it from components in the air.   \n\nMoore was taken down by the local police, but he was never found nor known to be dead. In fact, we think he is very well alive, surfing the State of the Union. We don't know if he's still dangerous, or if the insanity that drove him is gone.\n\n--Doctor Elaine J. Rechell\n\nChapter One: Bana-Jxo", "action_results": [{"action": "Chapter One.", "result": "Chapter One: Bana - Jxo\n\n\n\n\n\nEr wartet auf den Mittagswind\ndie Welle kommt und legt sich matt\nmit einem Fächer jeden Tag\nder Alte macht das Wasser glatt\n\nIch werf den Stein zu meinem Spaß\ndas Wasser sich im Kreis bewegt\nder Alte sieht mich traurig an\nund hat es wieder glatt gefegt\n\nIm weißen Sand der alte Mann\nzitternd seine Pfeife raucht\nnur das Wasser und ich wissen\nwozu er diesen Fächer braucht\n\nDie Ahnung schläft wie ein Vulkan\nzögernd hab ich dann gefragt\nden Kopf geneigt es schien er schläft\nhat er bevor er starb gesagt\n\nDas Wasser soll dein Spiegel sein\nerst wenn es glatt ist, wirst du sehen\nwieviel Märchen dir noch bleibt\nund um Erlösung wirst du flehen\n\nDen Fächer an den Leib gepresst\nim Todeskrampf erstarrt die Hand\ndie Finger mussten sie ihm brechen\nder Fächer bleibt zurueck im Sand\n\nDen Alten ruf ich jeden Tag\ner möchte mich doch hier erlösen\nich bleib zurück im Mittagswind\nund in dem Fächer kann ich lesen\n\nDas Wasser soll dein Spiegel sein\nerst wenn es glatt ist, wirst du sehen\nwieviel Märchen dir noch bleibt\nund um Erlösung wirst du flehen.\n\n                    --Rammstein", "action_results": [{"action": "Begin.", "result": "Toronto\n\n4.14. 1994\n\nA lanky figure had spread itself out on the park bench of Toronto, a newspaper masking away his face, only showing a mass of red hair popping out from the top. His foot tapped a perpetual beat of three clicks, his eyes reading the words covering his face.\n\n\"Oh wow... another speculation about Julian Moore. I've become quite famous ever since that little squabble.\" he said in a soft, almost sweet voice. He lifted his hand, and twirled it slightly to create a splinter of fire in his palm. \"Curses.\" he laughed, \"It's funny, actually.\"\n\nIn truth, he felt a little bored.\n\nHealth:   100\n\nMoney: 5\n\nLevel:  1", "action_results": [null, null, {"action": "Go to the store?", "result": "\"How may I help you, sir?\"\n\nMoney:  5\n\nBandages -- $2.00\n\nTwinkies -- $1.00\n\nChips -- $1.00\n\nBottled Water -- $1.00\n\nMagazine -- $2.00\n\nScrewdriver -- $2.00 Special Offer!", "action_results": [{"action": "\"Meh, nevermind.\"", "result": "Well, where to now?", "action_results": [null, {"action": "The market.", "result": "Bana-Jxo quickly crossed to the market, his eyes scanning the front window for excellent offers.\n\n\"I only buy the best offers...\" he said softly to himself.\n\n\"Oh, me, too! Me, too.\" a soft, female's voice said from the side. \"Hi, my name is Lisa Dickenson. It's nice to me you!\"  It was a African-American girl of around fourteen or fifteen, with black hair that bounced like cotton and Bana-Jxo smiled politely. Cheery girl she was...\n\n\"Hello. My name is Bana-Jxo. It's nice to meet you, too,\" he paused, and pointed to her clothes. \"By the uniform, I'm guessing you're a Refugee Nurse, right? You help patients from The Devil's Act, hunh?\"\n\nShe smiled perkily. \"Yes! I do help them. You know, not very many people are around here, though. Toronto's been so empty. Afterall, a lot of the people who lived here were killed.\" She frowned.\n\n\"Sorry. Didn't mean to spark up anything.\"\n\n\"Nah it's fine!\" she laughed, \"By the way, your name - where did it come from, exactly? It's pretty weird sounding.\"\n\n\"Bana-Jxo? Just picked it  up, I guess. So, are you here for some regular shopping?\"\n\nShe nodded. \"Actually, I'm getting some pears for a patient of mine. The poor guy, he lost his eyes the day of the incident when he was just around thirteen. He can only see a little through his right eye, but it's all blurry and stuff.\"\n\n\"Hmm... how terrible.\"\n\n\"But he's doing very well... ah, I should get going.\" she started off, \"Thanks for the little chat, Bana-Jxo! Do stop by the hospital and say hi!\"\n\nThe red-head waved as she left.\n\n\"What an oddball.\"  \n\n ", "action_results": [{"action": "Go start something on fire.", "result": "The trash occupying the trashcan lit up within a flick of Bana-Jxo's hand, his eyes transmfixed hypnotically on the dancing flame. He wanted so much to burn flesh again - such a disguisting trait, he'd told himself thousands of times. It was like a dog trying to stray from the taste of blood: once you try it, it is difficult to stop.\n\nHis fingers twitched at the fire's free movement, and he knew that this was the only way to control his thirst. It wasn't very helpful, but it kept him from killing more people. \"Let's see... what to do...\" There wasn't much to do - not if he were to keep his identity hidden. Julian Moore wasn't dead, yet he had to conceal this with Bana...\n\n\"Somebody, help! Call 911!\"", "action_results": [{"action": "\"Aw, what the heck - might as well help.\"", "result": "Bana-Jxo made his way through the crowd to find what the issue was. A billow of smoke rose up above them all, and he realized that a house had caught fire. \"Aw... how unfortunate of them.\" He told himself softly, and argued within himself to either help the house - and possibly people inside - or to simply shrug it off and leave.\n\n\n \n ", "action_results": [{"action": "\"I'll help them! They just better not notice me...\"", "result": "Bana-Jxo lifted his hand, and...Use item.", "action_results": [null]}, null]}, {"action": "\"It's really none of my business...\"", "result": "Ignoring the pleas from the sidelines, Bana-Jxo continued his way down the streets - they still had a look of scorching, blackened coal, much yet to be cleaned even in five years, and stopped hesitantly when he felt someone watching his back. It was an unsure feeling, but he had an urge to turn and confront.\n\n\"Who's there?\" he asked casually, and  man in a rather large jacket with sharp, icy blue eyes turned from the corner.\n\n\"Ah, good hearing.Moore, I assume? I'm George Elith, from the U.N.S.S.\"\n\nBana-Jxo smirked. \"United Nations Special Soldier. A place they take Zempaphs to enforce big problems and do the government's dirty work.\"\n\nGeorge shrugged. \"Better than completely destroying three states.\" He stared intently. \"There's no mistaking it. You used Schizophrenia Morphi, right? Sad to see you can't even repent enough for that crisis.\"\n\nBehind him, a bench hovered threateningly, his hand reaching for a gun placed on his inner coat pocket.\n\n ", "action_results": [{"action": "Ready to fight?", "result": " \nHealth:  100\n\nGeorge's Health: 60\n\nGeorge has moved right - a bench has been flung your way!\n\n\nEnemy Stats\n\nElith, George\n\nZempaph Ability - Telekinesis\nOthers - .45 [Gun]\nLevel - 1\nHealth - 60\nHand - Right-handed", "action_results": [{"action": "Evade left!", "result": "The evade was successful!\n\nGeorge prepares to shoot!\n\nHealth:  100\n\nGeorge's Health: 60", "action_results": [{"action": "Move left!", "result": "The evade was not successful! Bana-Jxo loses 20 health points!\n\nHealth:  100\n\nGeorge's Health: 60", "action_results": [{"action": "Continue.", "result": "George lifts a car, and flings it your way.\n\n \nNo where to run!\n\nHealth:  80\n\nGeorge's Health: 60", "action_results": [{"action": "Evade!", "result": "The evade was not successful! Bana-Jxo loses 20 health points!\n\nHealth:  80\n\nGeorge's Health: 60", "action_results": [null]}, {"action": "Duck and Strike!", "result": "Critical! George has lost 40 health points!\n\nHealth:  80\n\nGeorge's Health: 60", "action_results": [{"action": "Continue.", "result": " \nGeorge flinched! His power is exhausted!\n\n\"Hah, stupid rookie!\"\n\nHealth:  80\n\nGeorge's Health: 20", "action_results": [{"action": "Use Zempaph special...!", "result": "George tumbled to the ground, blood caking his jacket and bubbling from his chin. The burns were marked over his body, and he gasped in pain. \"D-damn... i-i....t!\" He spoke, before losing the battle and falling limp.\n\nHealth:  80\n\nCongratulations! George has been taken down!", "action_results": [{"action": "Battle One - Stats!", "result": "Battle Stats!\n\nLevel up to Two!\n\nGained - Telekenesis Lvl. 1!\n\nGained - One money!\n\n\n \nStats now:\n\nHealth:  80\n\nMoney: 6\n\nLevel: 2\n\n \n ", "action_results": [null, {"action": "Go onward.", "result": "Julian sighed, and looked down at the man with pity. \"Sorry, pal. I guess I have another guy that dies 'cause of this...\" he told the corpse of Elith. Bana-Jxo grunted and winced, losing enough balance to slouch down. Blood trickled out through his jacket and shirt - a trail of red from a bullet wound.\n\n\"That basta... he got me....\" Bana murmured. A thin oozing road of saliva and blood ran down his lip, and he started off down the road silently. He'd managed to get down past the block before tumbling into a backyard garden, and simply laid there. \"I had it coming... after all, karma takes affect always...\" he said before going unconsious.\n\n\"Oh no...! Mr. Bana-Jxo, are you all right?! Mr. Bana -Jxo!!\"\n\n\nEnd Chapter One: Bana-Jxo", "action_results": [{"action": "Chapter Two: Hospitality", "result": " \nToday's a reason for living\nToday's the blood from a stone\nToday's a light from a candle\nHelping us to find our way home\n\nToday we carry each other\nToday the past is a freak\nToday's a time for forgiveness\nYou were never that good to me\n\n-- Our Lady Peace\n\n \nCHAPTER TWO", "action_results": [{"action": "Begin.", "result": "It had been five years since the deaths of Aki and Yuzo, and of mother and father - since the Devil's Act had taken place. He'd left Chicago to Toronto, and had began the slow healing. Rick, the man that had found him in the debre of his home, had said he was damn lucky to have survived, and damn lucky to be able to use his right eye, even if it's just a little.\n\nHe rolled the pear in his hand a bit, feeling the cold texture before taking a healthy bite. Lisa smiled from beside him, her eyes showing joy.\n\n\"Did I do good with the selection?\"\n\nTokio looked to her and smiled. \"Very nicely. Thank you, Lisa.\" Lisa and he had known eachother well over the last couple of years, because she was essigned to the floor he'd been assigned to. He paused, and tilted his head. \"Hey, what was the commotion in the room about? Who's the guy brought in this room?\"\n\nLisa jumped up, looking toward the unconsious form in the bed nearby. \"Oh, his name is Bana-Jxo. I found him in the hospital garden - he'd been shot, you know.\"\n\n\"Is that so?\"  \n\n\"Well, if you want to put it like that, yeah.\"\n\nLisa leapt with surprise, and looked Bana's way. He had an amber eye open, staring with a little smile their way.\n\n\"AH!  You're already awake? I didn't think you'd be yet!\"", "action_results": [{"action": "\"No, I'm still unconsious... It's just all in your mind.\"", "result": "Tokio chuckled, and Lisa crossed her arms with a pout. \"Yeah, yeah, sure. You know, that's no way to thank me saving, you! I ain't going to wait for a 'thank you'!\" \n\n\"Thanks.\"\n\nShe sat at the edge of Tokio's bed, and chuckled. \"You're weird - is that hair color natural? Can't be. Not that blazing red hair.\"\n\n\"No, not my real color. But I like sticking out like a sore thumb, you know?\" The truth of the matter was he was simply diguising himself better to keep people from knowing who he was - or, at least, attempting to diguise himself.\n\n\"Well, did you know you're the first to come here in these five years that wasn't a Devil's Act Refugee or victim?\"\n\nBana-Jxo lowered his eyes. \"I see.\"\n\nLisa smiled, and held out a pear. \"Here. A little something to help you out.\"\n\n \nSTATS:\n\nMoney raised by $8!\n\nHealth healed!\n\n ", "action_results": [{"action": "Sleep...", "result": " \n\nIt'd been a few days before they - well, namely Lisa - would even let the bored red-haired Zempaph up, and when they finally did on the third day there, he was completely relieved.\n\n\"You healed pretty well. And fast, too.\" Tokio told Bana as they walked down the hospital hall.\n\nBana quivered slightly, chuckling nervously. \"Not too healthy yet. My legs are a bit like jello.\" He scanned the walls, finding it hard to even glance at Tokio. Here, again, was a man crippled by Julian Moore. This hospital reeked of his sins in the past, and made a constant lump form in his throat. It frightened him a bit, even, to know how many he'd never spoken to because they were all dead...\n\n\"Are you all right, Mr. Bana-Jxo?\" Tokio asked worriedly, and he nodded.\n\n\"Just a little ill still. I'll be fine - just fine.\"\n\nBana-Jxo looked out the window, and his eyes widened slightly. Outside, there were U.N.S.S men scowering below, searching for someone, it seemed.", "action_results": [{"action": "\"I have to go.\"", "result": "Tokio looked at Bana-Jxo with his good grey-blue eye with question. \"What? What do you mean?\"\n\nBana patted his shoulder and jumped up onto the window's ledge. \"Tell Lisa I said thanks again! Can't say it enough!\" He grinned, \"And thanks for your hospitality. I don't think I deserve it as much as you'd think!\"\n\nTokio ran toward the window. \"Wait, you can't kill yourself! It's not the answer to your -- \"\n\nBana-Jxo jumped down, landing on his feet and bolting quickly away from the group of U.N.S.S that had not seen him in his swiftness.\n\n\"...I... can't believe it.\" Tokio said, watching the colorful blob that was Bana speed away. \"What is he...?\" \n\nTokio gripped his cane tightly in his hand, and ran to leave the hospital after him.", "action_results": [{"action": "Encounter.", "result": "Bana-Jxo had ran a good distance until he'd stopped at the front of the hospital. There was a soft girl's voice, mocking and angry. \"You must be Julian... the one that killed George.\"\n\nBana-Jxo looked around suspiciously. 'Where is she...?'\n\n\"I'm... around. You'll have to find me.\" Bana-Jxo gasped. \"You wanna' know how I can read your thoughts? I'm a Zempaph in the U.N.S.S., too, just like Mr. Elith. Let's see how man you are! I won't even read your mind to kill you...!\"", "action_results": [{"action": "Ready to fight?", "result": " \nGirl (???)\n\nLevel: 2\n\nHealth: 80\n\nWeapons: Telepathy [unused?], Sniper Rifle\n\n \nA snipershot sounded to the side! It missed your right foot as you move left!! \n\n\n \n Health: 100\n\n ", "action_results": [{"action": "Hide!", "result": "Bana-Jxo, having no other choice in the present condition, hides behind a tree - a shot from the sniper is fired from above, striking the pole behind you with presition and giving you a rather messy cut across the hand.\n\n \nHealth: 100", "action_results": [{"action": "Try to run out again!", "result": "Running forward only resulted in getting shot by the sniper! Bana-Jxo loses 20 Health!\n\nHealth\n\n80\n\n ", "action_results": [{"action": "Hide.", "result": "Bana-Jxo, having no other choice in the present condition, hides behind a tree - a shot from the sniper is fired from above, striking the pole behind you with presition and giving you a rather messy cut across the hand.\n\n \nHealth: 80", "action_results": [null]}]}]}, null]}]}]}, {"action": "Wait it out.", "result": "Bana-Jxo started off again, Tokio looking down where the red-head had moments ago. \"I wonder who they are.\"\n\nBana shrugged. \"Maybe they're here for someone, or here to get a check-up.\"\n\n\"Is that all you can come up with?\" a soft voice said, \"You upset me.\"\n\nBana-Jxo searched around the room, and saw no one.\n\n'Telepathy... Tokio isn't even hearing her...'\n\n\"I'll meet you outside... so no one inside is hurt.\"", "action_results": [{"action": "Encounter.", "result": "He had done as she had commanded, and met the woman outside - or, at least, thought he was to. When he'd gone to where she'd commanded, she was no where to be found. \"I'm here, but you'll have to find me, won't you?\" she giggled.\n\nHe sighed. It was the best way to keep those inside safe, he supposed, but this attention wasn't helping him at all. How did they catch on so quickly as to who he was? The last encounter he'd had with any police enforcement was in New York, not including, of coarse, the skirmish with George...\n\n\"Ah-ha, so you did kill George.\" she thought to him, \"Thought so. As to how we know it's you - they used me to read minds within the area. Let's see how well you'll fare!\"", "action_results": [null]}]}]}]}, {"action": "\"I'm just tough like that.\"", "result": "Lisa sighed. \"If you're so tough, how'd you get shot, anyway?\" She sat at the edge of Tokio's bed, and chuckled. \"You're weird - is that hair color natural? Can't be. Not that blazing red hair.\"\n\n\"No, not my real color. But I like sticking out like a sore thumb, you know?\" The truth of the matter was he was simply diguising himself better to keep people from knowing who he was - or, at least, attempting to diguise himself.\n\n\"Well, did you know you're the first to come here in these five years that wasn't a Devil's Act Refugee or victim?\"\n\nBana-Jxo lowered his eyes. \"I see.\"\n\nLisa smiled, and held out a pear. \"Here. A little something to help you out.\"\n\n \nSTATS:\n\nRaised to Lvl. 3!\n\nHealth healed!\n\n ", "action_results": [null]}]}]}]}]}]}]}]}]}]}, {"action": "Move right!", "result": "George fires on you, but misses - you move forward!\n\nHealth:  100\n\nGeorge's Health: 60", "action_results": [{"action": "Strike out!", "result": "The kick connected! George loses 10 Health points!\n\n \nGeorge will use Telekenesis!\n\n \nHealth:  100\n\nGeorge's Health: 60", "action_results": [{"action": "Continue.", "result": "George lifts a car, and flings it your way.\n\n \nNo where to run!\n\nHealth:  100\n\nGeorge's Health: 60", "action_results": [null, {"action": "Duck and Strike!", "result": "Critical! George has lost 40 health points!\n\nHealth:  100\n\nGeorge's Health: 60", "action_results": [{"action": "Continue.", "result": " \nGeorge flinched! His power is exhausted!\n\n\"Hah, stupid rookie!\"\n\nHealth:  100\n\nGeorge's Health: 20", "action_results": [{"action": "Use Zempaph special...!", "result": "George tumbled to the ground, blood caking his jacket and bubbling from his chin. The burns were marked over his body, and he gasped in pain. \"D-damn... i-i....t!\" He spoke, before losing the battle and falling limp.\n\nHealth:  100\n\nCongratulations! George has been taken down!", "action_results": [{"action": "Battle One - Stats!", "result": "Battle Stats!\n\nLevel up to Two!\n\nGained - Telekenesis Lvl. 1!\n\nGained - One money!\n\n\n \nStats now:\n\nHealth:  100\n\nMoney: 6\n\nLevel: 2\n\n \n ", "action_results": [null, null]}]}]}]}]}]}]}]}, null, {"action": "Try to go under and kick!", "result": "The kick connected! George loses 10 Health points!\n\n \nGeorge will use Telekenesis!\n\n \nHealth:  100\n\nGeorge's Health: 50", "action_results": [{"action": "Continue.", "result": "George lifts a car, and flings it your way.\n\n \nNo where to run!\n\nHealth:  100\n\nGeorge's Health: 50", "action_results": [{"action": "Evade!", "result": "The evade was not successful! Bana-Jxo loses 20 health points!\n\nHealth:  100\n\nGeorge's Health: 50", "action_results": [{"action": "Continue.", "result": "George lifts a car, and flings it your way.\n\n \nNo where to run!\n\nHealth:  80\n\nGeorge's Health: 50", "action_results": [{"action": "Evade!", "result": "The evade was not successful! Bana-Jxo loses 20 health points!\n\nHealth:  80\n\nGeorge's Health: 50", "action_results": [null]}, {"action": "Duck and Strike!", "result": "Critical! George has lost 40 health points!\n\nHealth:  80\n\nGeorge's Health: 50", "action_results": [{"action": "Continue.", "result": " \nGeorge flinched! His power is exhausted!\n\n\"Hah, stupid rookie!\"\n\nHealth:  80\n\nGeorge's Health: 10", "action_results": [null]}]}]}]}, {"action": "Duck and Strike!", "result": "Critical! George has lost 40 health points!\n\nHealth:  100\n\nGeorge's Health: 50", "action_results": [{"action": "Continue.", "result": " \nGeorge flinched! His power is exhausted!\n\n\"Hah, stupid rookie!\"\n\nHealth:  100\n\nGeorge's Health: 10", "action_results": [null]}]}]}]}]}]}]}, null]}]}, {"action": "Twinkies", "result": "You bought Twinkies.", "action_results": [null, {"action": "Go back.", "result": "\"How may I help you, sir?\"\n\nMoney:  4\n\nBandages -- $2.00\n\nTwinkies -- $1.00\n\nChips -- $1.00\n\nBottled Water -- $1.00\n\nMagazine -- $2.00\n\nScrewdriver -- $2.00 Special Offer!", "action_results": [null, null, {"action": "Chips", "result": "You bought some chips.", "action_results": [null, {"action": "Go back.", "result": "\"How may I help you, sir?\"\n\nMoney:  3\n\nBandages -- $2.00\n\nTwinkies -- $1.00\n\nChips -- $1.00\n\nBottled Water -- $1.00\n\nMagazine -- $2.00\n\nScrewdriver -- $2.00 Special Offer!", "action_results": [null, null, null, {"action": "Water", "result": "You bought a bottle of water.", "action_results": [null, {"action": "Go back.", "result": "\"How may I help you, sir?\"\n\nMoney:  2\n\nBandages -- $2.00\n\nTwinkies -- $1.00\n\nChips -- $1.00\n\nBottled Water -- $1.00\n\nMagazine -- $2.00\n\nScrewdriver -- $2.00 Special Offer!", "action_results": [null, null, null, null, {"action": "Magazine", "result": "You bought a magazine.", "action_results": [null, {"action": "Go back.", "result": "\"How may I help you, sir?\"\n\nMoney:  0\n\nBandages -- $2.00\n\nTwinkies -- $1.00\n\nChips -- $1.00\n\nBottled Water -- $1.00\n\nMagazine -- $2.00\n\nScrewdriver -- $2.00 Special Offer!", "action_results": [null, null, null, null, null, {"action": "Bandages", "result": "You do not have the money to get this.", "action_results": [null]}, null]}]}, {"action": "Bandages", "result": "You bought bandages.", "action_results": [null, null]}, {"action": "Screwdriver", "result": "You bought a screwdriver.", "action_results": [null, null]}]}]}, null, null, null]}]}, null, null, null, null]}]}, null, null, null, null, null]}, null]}]}]}]}, {"action": "\"So... What do I do now...?\"", "result": "The man is silent for a moment, overthinking his decisions. \"Come with me. I'll get you to our place. Maybe your friends are there... I'll carry you.\"\n\nHe lifts me up on his back, and I can't remember anymore. '\n\n...This is where it will truly begin.", "action_results": [null]}, {"action": "\"But Yuzo... and Aki...\"", "result": "\"I'm sorry, kid... but there's nothing I can do. We're to leave now - the city has gone to Hell.\"\n\n    His hand feels heavy on my shoulder, and I can't remember anymore after that... '\n\n...This is where it will truly begin.", "action_results": [null]}]}]}, {"action": "Continue the search.", "result": "I felt through the dirt and hot smoldering ash in search of them. I swear I could almost feel their warm skin, undead and uninjured, but it is only hot embers that burn me at the touch. Through my eyes, and feel warmth ooze down, and I do not check to see if its blood or tears.\n\nNo... my friends... it can't be...\n\nI fell unconsious there, leaving my search uncompleted.'\n\n...This is where it will truly begin.", "action_results": [null]}]}, null]}, {"action": "Remain there for help.", "result": "I can't say I remember how long I had sat there and remained so terribly still, so helpless and sightless and immobile. I called for my friends, but they did not reply, and it frightened me. I would scream in agony from time to time when the pain of my eyes struck a nerve. My eyelids were close to gone - I touched them beforehand in frightened curiousity just to touch bleeding flesh and soft eyeballs.\n\n\"Is anyone out there?\"\n\nI know my ears are not fooling me, they can't have!\n\n\"Hello? Hello!\" I call, and the male's voice grows as he speaks. I feel a hand gripping my shoulder, and hear him speak.\n\n\"God...\"", "action_results": [null]}]}]}