{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=44543", "context": "", "first_story_block": " \n\nIt’s officially winter break. You stumble toward your dorm room, brain turned to mush from taking five exams in three days.\n\n\nAll you have to do is grab your suitcase, and then you’ll be on your way to NYC to stay with your boyfriend, Keith, and his parents for Christmas. You’ve never met them, but he’s told you that they have a large, luxurious apartment with a pool--which sounds awesome, but intimidating. \n\n\nAnyway.\n\n\nKeith, the lucky son of a gun, has already flown out. (He’s a creative writing major. His exams consist of writing poems about his childhood and writing essays about the meaning of life.)\n\n\nYou pause in the hallway (which is empty--almost everyone else has finished exams and gotten the heck out of here.) Like every college dorm room in every movie ever, there's a whiteboard on your door.\n\n\nNow there's an \"I Heart NY\" magnet on there. The magnet holds a postcard with a photo of the Statue of Liberty. You're pretty sure it wasn't there when you left this morning. \n\n\n ", "action_results": [{"action": "Probably for your roommate. Go in your room without looking at it.", "result": " \n\nYou go in, shut the door, and finish packing.\n\n\n \n\nAs you roll your suitcase down the deserted hallway, you see something disappearing around a corner: a figure about three feet tall, with green skin.", "action_results": [{"action": "Follow it.", "result": " \n\nYou peek around the corner. Just a maintenance guy. He seems surprised there are still students here. ", "action_results": [{"action": "Speaking of which, CRIMINY, let's get going.", "result": " \n\nThe airport is hella crowded, and of course every single face you see is pinched with anxiety, like flying home for Christmas is the most horrific event of their lives. You aren't usually one to use the word vibe, but the whole atmosphere gives you a slightly sick feeling, as if your body is absorbing their stress. \n\n\n \n\nYou board the plane for the six-hour flight to your connection, Atlanta. Halfway through, you use the lav.\n\n\n \n\nWhen you return, there's a postcard on your seat. This one shows a picture of the Empire State Building. You turn it over.\n\n\n \n\nBlack, scrawling letters read:\n\n\n \n\nDear Clara,\n\n\nWhen you get off, that’s when I’ll find you. \n\n\nWhen I find you, that’s when I’ll kill you.\n\n\nWhen you run, better run fast.\n\n\nWhen you hide, better hide good.\n\n\nWhen you tell, it makes things worse.\n\n\n \n\nPanic clenches your throat. Is this real? Does someone actually want to kill you? \n\n\n \n\nWhat should you do? Tell the stewardess? Or follow the advice on the postcard?", "action_results": [{"action": "Tell", "result": " \n\nYou make your way to the galley and show the head flight attendant the postcard, explaining how you came to receive it.\n\n\nShe smiles, turns it over. “The Empire State Building. I’ve been there.”\n\n\nYou snatch it back and flip it to show her the message again. “Yeah, but someone’s threatening to kill me.”\n\n\n“I love New York.” Her eyes are glazed. “It’s my favorite layover.” She turns to smile at you. Her white teeth glitter.\n\n\nYou show another flight attendant with similar results.\n\n\nOkay, this isn’t going so well. What should you do? Start screaming for help, or just sit there, like, well, a sitting duck?\n\n\n ", "action_results": [{"action": "Scream.", "result": " \n\nImmediately, the co-captain comes out and helps the flight attendants handcuff you. You try to show them the postcard, but it slips out of your hand.\n\n\n \n\nThey lecture you about causing a panic to the other passengers. The escort you to an empty seat and check your vital signs to rule out medical issues, as they are trained to do, and then bring you a glass of wine to help you stop panicking (as they are also trained to do). You don’t drink it, of course--you need your wits about you. Because something is seriously screwed up.\n\n\n \n\nWhen the flight attendant returns to collect the still-full wine glass, you ask her if you’re on some kind of list now, or if you’ll be allowed to board your next flight.\n\n\n \n\nShe smiles. “ Don’t cause another disturbance, or there will be consequences.You must continue with the itinerary on your ticket.”\n\n\n \n\nHer tone is different--still creepily calm, but less robotic. There’s more of a sense that she might actually have a soul. This leads you, of course, to ask more questions, but she cuts you off saying she must clear the cabin for arrival.\n\n\n \n\nThe plane lands. What should you do--go to the TSA and tell them what’s going on, or just run and hope the killer doesn’t find you? ", "action_results": [{"action": "Inform TSA.", "result": " \n\nYou go to your airline’s main desk and ask to speak to a TSA agent.\n\n\nThe uniformed attendant, who isn’t much older than you but looks like she has a ton more responsibility, smiles briskly and pulls something up on her computer. “Yes, Miss Conner--we were wondering if you’d stop by. Follow me.”\n\n\nShe leads you into what looks like a small conference room. Four leather chairs are arranged around a shiny wooden table. At one end of the room is a Keurig machine, a small fridge, and a bowl of apples. “Would you like something to drink while you wait?” she asks. “The agent should be in here shortly, and he’ll explain everything.”\n\n\nYou meant to ask her some questions, but the kindness in her voice--as well as the promise that everything is finally going to start making sense--almost brings you to tears. You accept a bottle of water and sit quietly.\n\n\nThe man who comes in is holding a manila file folder. He has no face.\n\n\nWell, he has eyes, a nose, and a mouth, but they have no distinguishing features. He’s like a mannequin, except there’s nothing mechanical about his movements. He’s clearly real, just blank.\n\n\n“Hello, Ms. Conner.”\n\n\nFear is rising through your throat like smoke.  This is a trap--this is just what the killer wanted.\n\n\nHe smiles comfortingly. “Oh, no, Ms. Conner--I’m not here to kill you. That’s not my job. Shall I leave the door open? You may leave whenever you like.” He props it open and takes the seat opposite you, leaving you closer to the exit. A flat laugh. “Of course, leaving would mean starting the running part, which you may not be ready to do. I’m not sure I blame you there!”\n\n\nIt’s the same tone you use with your boyfriend’s parents on Skype. Jovial, polite. A voice for small talk.\n\n\n“Anyway, while you’re here, I’m supposed to go over the rules with you.” He opens the folder. “Rules are optional…” he reads, almost to himself. “We went over that. Okay, here we are. ‘If you are being briefed, you have been exceedingly stubborn in contacting the authorities. Stubbornness has both benefits and drawbacks, which we will discuss at the end.\n\n\n“The following are the rules: you will run. They will try to catch you. You can run, hide, or fight. If they catch you, if they overpower you, you will die.\n\n\n“But you will not ask for help from people of higher authority than yourself. If you continue to fail to accept the situation, you will lose, and losing this game will not be pleasant. You are safe when you cross the threshold of 333 Madison Avenue.”\n\n\nHe looks at you. “Do you need any part of that repeated?” he asks politely. “Or some coffee?”\n\n\n“But why is this happening? What’s the point?”\n\n\nHe shrugs, eyes flitting over the documents. “I don’t see a point.”\n\n\nRight. Let’s try another tack. “What do I have that they want?”\n\n\nHe reads from the paper again. “'You can run, hide, or fight.'”\n\n\nNot helpful. “Can I see what else is in the folder?”\n\n\n“Of course.”\n\n\nHe slides it across the table. On top is the paper he just read, typed in ordinary Times New Roman.\n\n\nBehind that is another sheet with what appears to be a dossier on you--your full name, birthdate, social security number, height, weight, hair and eye color, GPA, hometown, high school, and a short medical and dental history. The GPA is current as of the exams you just finished taking.\n\n\nPersonal life, it says, like on Wikipedia.\n\n\nConner is of Irish, Scottish, and American Indian descent. She enjoys photography, reading, and hiking. She is affiliated with no particular religion. Her flaws include an irregular flossing routine and passivity.\n\n\nThat’s it.\n\n\n“This is crazy.” These aren’t really the right words, because actually these papers are boring--pointedly boring, like they’ve been created to mock you.\n\n\nYou ask more questions--why you, why the teeth, how did they get this--but Faceless guy just gives you more polite non-answers.\n\n\nSuddenly something rather obvious strikes you. You’ve been dealing with this like it’s an airport emergency, but it’s bigger than that. You have your phone, and it’s got plenty of charge. Why not call the police?\n\n\n ", "action_results": [{"action": "Get Faceless Guy to leave, then call the police.", "result": " \n\n“Thanks,” you manage, trying to imitate the polite, professional tone he’s been using on you. “This is all...very strange. Could I just have a cup of coffee and process this for a few minutes?”\n\n\n \n\nHe smiles, says that’s fine, and reminds you your connection is at Gate 4C. Then he shakes your hand and leaves.\n\n\n \n\nFinally. You take out your phone and dial 911.\n\n\n \n\nOut of area, says the screen.\n\n\n \n\nThe desk attendant appears at the door.\n\n\n \n\nShe is no longer friendly. Her face is vacant, like a part of a machine no one is bothering to operate. In her hand is a ball-peen hammer.\n\n\n \n\nYou stand up automatically. But she keeps coming.\n\n\n \n\nYou shove the table at her, but it’s too heavy to do more than make her back up one step, then keep coming. You throw a chair, and she catches it. You rush to the right, but she always manages to stay between you and the door.\n\n\n \n\nShe closes in. You try to kick, but she doesn’t react. She bends low and, without breaking eye contact, smashes the hammer into the bone of your left ankle.\n\n\n \n\nColors swim against the sides of your skull, pain radiating through you like electricity.\n\n\n \n\n“This office closes in ten minutes,” she says. She turns and leaves. The folder is still on the table.\n\n\n \n\nYou decide to stop fighting the rules.\n\n\n \n\nYou accept that they--the goblins or whatever they are--are after you. So what should you do--run or hide?\n\n\n \n\n ", "action_results": [{"action": "Run.", "result": "You've decided to run with a broken ankle...so...let’s see how that works out.\n\n\n \n\nAfter about thirty feet, the goblins catch up. One hard bite to your abdomen (they’re only about three feet tall) and you’re down. They slash your throat--quick and painless, but you're still dead.", "action_results": []}, {"action": "Hide.", "result": " \n\nYou limp along for a few feet, then dart into a gift shop. You browse behind a high shelf, waiting to see if anyone (or anything) is following you. Nothing looks suspicious, and no one seems to be paying you any particular attention.\n\n\nYou buy a dark blue Atlanta Braves sweatshirt and pull it over the cashmere J Crew sweater you got from the thrift shop in order to impress your boyfriend’s parents. Then it’s too hot, so you stuff it into your bag--your bright red bag. After checking your surroundings, you limp over and find a tote bag that says Hotlanta! And buy it (the clerk is, by now, looking at you like you’re a freak). You step behind the shelf and transfer everything in your large purse into the tote bag.\n\n\nHoly damn, your ankle hurts. Every pulse of pain reminds you that this is real.\n\n\nSuddenly you see them. Two...things. They’re about half your height, with green scales and large yellow teeth. They walk on two feet like a person, but they move like lizards.\n\n\nAnd no one notices.\n\n\nPeople move around them automatically, like they do for plants or luggage, but their eyes never focus on them.  \n\n\nThe goblin’s eyes are small, soulless, but peering everywhere. Their little nostrils--their snouts are shaped like an alligator’s, but shorter--are twitching. They’re sniffing for you.\n\n\nYou step back, trying to move gradually in case fast movement kicks your scent into the air. Sweat pricks your underarms--a result, no doubt, of both your nervousness and the extra layer you’ve put on.\n\n\nBut when you peek again, they’ve passed by.\n\n\nYou pull off the sweater under your sweatshirt and manage to yank it off through the neck.\n\n\nMaybe the smartest thing would be to keep them in front of you. After all, your gate is all the way on the other side of the airport, and you only have four hours to get there. The only way out of this nightmare is to get on that plane to New York.\n\n\nYou wait for them to get about fifty feet ahead, peek out of the store, and, seeing nothing amiss, begin slowly following them, dragging your sore ankle as you walk toward the center of the airport. Along the way, you throw away the purse and sweater, and stop in the bathroom and cover yourself with sickly-sweet strawberry soap--anything to hide your natural scent.After a few minutes, you reach an escalator, which will take you down to the tram area, where you will get a ride to your terminal.\n\n\nAs you near the bottom, suddenly there is a slap-slapping on the marble floor, like someone in thin wet socks.\n\n\nYou turn. There are creatures behind you, weaving around the people at the top of the escalator.\n\n\nYou hurry down the escalator, biting back your yelps of pain. The tram to Gate C has arrived. Should you try to catch it, hoping the doors will close before they can follow you(or if they do, that you can hop out before they do) or turn and fight?  \n\n\n ", "action_results": [{"action": "Try for the tram.", "result": " \n\nYou limp onto the tram just as the doors close.  \n\n\n \n\nYou aren’t stupid--no way is this hell over with. But at least you’re safe for now.\n\n\n \n\nThe tram slows at B Gate. Will any of them get on? You edge toward the doors, ready to leap out, but it's just a group of middle schoolers in matching sweatshirts and their chaperone. The tram ambles forward.\n\n\n \n\nAt the next stop, a guy about your age, tall and skinny with a t-shirt advertising a Dropkick Murphys show from eight years ago, gets on. He notices you.\n\n\n \n\nHuh. Come to think of it, not many people have done that since you found the first postcard. You’re no Megan Fox, but you are a reasonably attractive twenty-year-old girl, and you’re accustomed to a moderate amount of male perusal while in public. And yet people’s eyes have been sliding past you all day. Only airport employees have acknowledged your existence. Weird.\n\n\n \n\nThis guy, however, sees you.\n\n\n \n\nProbably not good.\n\n\n \n\nYou edge a little closer to the doors. What if he’s one of them? A normal college-age boy outside, a goblin inside? Maybe that’s the next level--at first the monsters are easy to spot, and then they’re in the form of fairly cute guys.\n\n\n \n\nHe walks up to you. “Hi.”\n\n\n \n\nThis close he looks familiar. Familiar like a human I’ve seen before, or familiar like a goblin?\n\n\n \n\n“I think we went to camp together.”\n\n\n \n\nHis eyes are a yellow-striped green--what color were theirs? Damn. You were too panicked to notice.\n\n\n \n\n“Guess not,” he says. You must look pretty freaked out, because he starts backing away slowly.\n\n\n \n\nAnd then his face clicks into place. Triple R Ranch. Summer before fourth grade. His name is Dmitri, and the reason you still know that is that he was almost your first kiss. (Instead it was this loser named Jason in sixth grade. He told everyone you tasted like bubble gum--which doesn’t seem that bad, but somehow he made it sound absolutely disgusting. What a prick.)\n\n\n \n\n“Wait,” you say. “Dmitri, right?”\n\n\n \n\n“Yeah. You’re Claire.”\n\n\n \n\n“Clara, actually. That’s my real name.” You like Claire better, but it was too hard to keep telling everyone to call you Claire. They kept forgetting, and finally you just gave up and went with it.\n\n\n \n\nHe asks where you’re going, and you tell him. He says he’s going to Philadelphia to spend Christmas with his dad--he’s headed to the same terminal you are.\n\n\n \n\nHis eyes move over you, but not in a flirtatious way. “Are you okay?”\n\n\n \n\nYou look down. In addition to the sloppy-looking sweatshirt and the way you're holding your foot, you are sweating profusely. “It’s been...a stressful trip,” you finish lamely.\n\n\n \n\n“How so?”\n\n\n \n\nHe seems to know there’s a deeper meaning to that--which isn’t itself strange, Dmitri has always been able to read people pretty well--but you can’t shake the feeling that running into him is a little too coincidental. Should you trust him enough to tell him you’re being stalked, or just politely brush him off?\n\n\n ", "action_results": [{"action": "Trust Dmitri.", "result": " \n\nYou make up a story about an old boyfriend who is stalking you and has threatened to kill you. You say the authorities won’t do anything because the threats are all verbal, and there’s no evidence, and he has a perfect record. Dmitri is skeptical at first, but when he sees that your fear is real, he starts to believe you.\n\n\n \n\n“So what are you going to do?” he asks.\n\n\n \n\n“Get off at Terminal D, I guess. He's got to be watching Terminal C, since he knows my itinerary.”\n\n\n \n\n“Yeah, but he’s watching for you, right?”\n\n\n \n\n“Yeah…”\n\n\n \n\n“So let’s be a couple. He’ll be looking for someone alone, and that terminal should be pretty crowded since it’s a Delta one.”\n\n\n \n\nShould you agree to this, or stick with your original plan of going to D Terminal?", "action_results": [{"action": "Go to D Terminal.", "result": " \n\nThe second you step off, they're there, and you barely stumble backward into the tram in time. As you do, you hit your head on one of the light poles.\n\n\n \n\n\"Was he out there?\" Dmitri looks skeptical again. Probably because from his perspective you just leapt about two feet backward at the sight of a woman with a stroller. \n\n\n \n\n\"Yeah.\" The pain spiking through your head makes you want to kill people. \"Let's go with your idea.\"\n\n\n ", "action_results": [{"action": "Try terminal C.", "result": " \n\nReluctantly, you agree.\n\n\n“Here.” He takes off his sweatshirt, which is light gray, and you switch wit him. He turns the Braves one inside out so the logo isn’t visible, since they’ve seen it. You switch bags. He has a carryon, and he unzips it and yanks out a scarf his grandmother just gave him as a Christmas present. You loop it around your face.  \n\n\nWhen the tram slows at C, you look out the windows. Two of them are at the edge of the crowd, about ten feet away. There are about seven tram doors opening.\n\n\n“He’s here,” you mutter.\n\n\n“Too close for us to go?”\n\n\nDang, it would be easy to say yes. But you don’t. “No, we can probably make it.”\n\n\nHe puts his arm around you, and you put the hood up, making sure none of your hair is visible. You begin walking, heads turned toward each other.\n\n\n“We’re deep in conversation right now,” you say.\n\n\n“Yes,” says Dmitri. “And we’re not walking too fast.”\n\n\n“Because we’re so absorbed in our deep conversation.”\n\n\nA businessman barrels past you, giving you a look like you’re both idiots. He lets his overly large carryon run over Dmitri’s foot.\n\n\nBut no slappy-slap-slap.\n\n\nYou make it to the escalator. You make it up the escalator. You make it to terminal C, and duck into a bookstore. There is a closed sandwich stand, and you duck behind the counter and sink onto the sticky tile floor.\n\n\n“So....” says Dmitri. “You’re just going to hang out here for the next two and a half hours?”\n\n\nYou nod. Compared to being violently murdered, it sounds like heaven.\n\n\nAbout half an hour before your flight starts boarding, Dmitri goes to get you guys something to eat. When he comes back with Qdoba, he says, “the strangest thing happened. I just got a notification on my phone that my flight is canceled, and I’m rerouted through La Guardia. So I’m on your flight. Weird, huh?”\n\n\nA shiver of suspicion runs through you. “Yeah, weird,” you say, unwrapping your burrito.\n\n\nAlmost as weird as running into him in the first place.\n\n\nYou put down the burrito. You don’t trust Dmitri.\n\n\nActually, you do--you trust the weird little kid you met at camp. You’re just not sure if this guy sitting with you on this disgusting floor is actually him. This whole crazy day has been like something out of a twisted fairy tale, and isn’t there something in fairy tales about not taking food from strangers?\n\n\nAt the same time, you skipped breakfast this morning. You’re so hungry you’re slightly dizzy, even sitting down. You doubt you’ll be able to run or think at your best if you don’t get some nourishment.\n\n\nShould you eat or not?", "action_results": [{"action": "Eat.", "result": " \n\nYour stomach starts to churn. There’s nothing magical or enchanted about this nausea--it’s identical to the last time you got food poisoning. You turn and hurl the contents of your stomach onto the grimy floor.\n\n\nIt smells. It smells like me, you think. Like my insides.\n\n\nThe sound of running.\n\n\nYou leap up, and vault over the counter almost effortlessly--only later you remember Dmitri’s hands under your ribs, propelling you--and run.\n\n\nYou only have to elude them for twenty minutes. Twenty stupid minutes is all that’s between you and being okay.\n\n\nYou see an opening in the crowd and dart through. Without your heavy bag you must be faster than they are, because the space between you and them is widening. \n\n\nShould you keep running, or find a place to hide?", "action_results": [{"action": "Hide somewhere.", "result": "You duck into a large, crowded restaurant and hide at a table in the back. Ten minutes before your flight takes off, you slowly come out.\n\n\nDmitri is still by the empty deli counter.\n\n\n“What,” he says, “was that? It looked like you were having a seizure. Except no one even saw you. I could barely see you.” He shakes his head, as if something has been fogging his vision.\n\n\n“I’ll explain on the flight,” you say.  “If I ever actually get on there.”", "action_results": [{"action": "To the planemobile!", "result": " \n\nYour damp, shaking hand holds out the ticket. The agent smiles--a real, human smile--and tells you to have a nice flight. You walk past them and get on the plane. Their eyes never leave you, but they don’t move. Apparently you’ve earned the right to get on the plane.\n\n\nAs you get into the cabin, you halt. There's a goblin in an empty seat. (An empty first-class seat--pretty bloody annoying.) It’s somehow wearing what looks like an expensive pinstriped suit, and the stupid flight attendant is handing him some wine.\n\n\nIn the pocket of the seat in front of you is a postcard showing Times Square. You slide it out and flip it over.\n\n\nRest and eat.This ain't finished yet.\n\n\nWell, isn’t that great. You’d love to eat--if you had any friggin’ food.\n\n\nThis is just so stupid. What’s even the point of it? Goblins. Gremlins, or whatever they are. They’re bright Crayola green--they don’t even look realistic.\n\n\nDmitri appears in front of you. “Hi,” he says, but he’s talking to the guy in the middle seat beside you. “I have an exit row seat--would you mind switching so I can sit by my girlfriend?”\n\n\nThe guy is only too happy to switch to an exit row, and soon Dmitri is settled beside you.\n\n\n“I’m not your girlfriend,” you say. How are you even going to explain this whole crazy debacle to your boyfriend?\n\n\nEasy: you won’t. How could you? It’s unexplainable. You’ve become good at knowing which things not to bother Keith with, and this is definitely one of them.\n\n\n“I know,” Dmitri said. “But I didn’t think he would switch if we were just friends.”\n\n\n“Well, that’s really stupid.” You probably shouldn’t be taking this out on him, seeing as he rescued you and all, but you are hungry and exhausted and you know he’s about to ask a bunch of questions you can’t answer and you just want this stupid trip to be over already. “So the only good reason to sit beside someone is if you’re having sex with them? So what if we’re friends? Friends talk. Is having a conversation not a good enough reason to sit beside someone?”\n\n\n“Clara,” he says. “What’s going on?”\n\n\n“I don’t know. It just happened.” You explain what you can about the postcards and the goblins. You hand him the postcard, but he finds the handwriting impossible to read--which makes no sense, it’s sloppy, but not that sloppy.\n\n\n“Do you think they’ll actually kill you?”\n\n\n“Yes,” you say. “I do.”\n\n\nHe takes your hand.\n\n\nNot long after, you fall asleep.You wake up to the stewardess’ voice.\n\n\n“Miss Conner, here’s the meal you ordered for this flight.” She seems to be in a hurry, and pulls your tray out for you so she can set it down and attend to something else.\n\n\nIt appears to be a chicken salad sandwich and some chips. Which you definitely did not order.\n\n\nYou realize you’re nauseous, and incredibly hungry again.  \n\n\nShould you eat this incredibly sketchy food?", "action_results": [{"action": "Um, no. It's from the friggin' goblin club.", "result": " \n\n \n\nAs the flight goes on, you get more and more nauseous. Soon you are shaking all over. You wretch a few times, but there’s nothing for you to throw up, so you don’t.\n\n\nWhen it’s time to get off the plane, the goblin is already gone, just like all the other first-class passengers. A glass with a few traces of red wine sits on the tray beside his seat.\n\n\nYou walk through JFK with Dmitri. He holds your sweaty, shaky hand, watching your face for any sign of them, but there are no goblins.\n\n\nYou get your luggage from baggage claim and turn toward the exit. Outside is a long line of taxis.\n\n\nIn front of the door is a huge goblin. Taller than you. Taller than any human who's not in the NBA.\n\n\n“There’s one there,” you say dully to Dmitri, pointing toward it. His eyes follow your finger. He squints hard.\n\n\n“I think I see a--a shadow.”\n\n\nThere are about ten sets of doors to the taxi line, so you turn toward another one and start trudging toward it. It probably won’t work, but hey, what do you have to lose?\n\n\nIt doesn’t move. “Go ahead.”\n\n\nYou turn, shocked. They’ve never spoken before.\n\n\n“If you do, I’ll follow you. I’ll never kill you, but I’ll keep following you for the rest of your life.”\n\n\nYou can’t fight him. You’re tired and shaking, and at some point you must’ve banged your right knee on something because it hurts like hell. But you also can’t let him follow you around forever.\n\n\nWhat should you do?\n\n\n ", "action_results": [{"action": "Ask Dmitri to fight him.", "result": " \n\nAs soon as you ask him, the goblin laughs. It’s a liquid, disgusting sound. “What kind of story do you think this is? I’m not his goblin. Also, it's 2016--fight your own battles, missy.”\n\n\n ", "action_results": [{"action": "Fight him--hey, maybe you'll win.", "result": " \n\nOkay, what will you fight him with?\n\n\nYou now have your heavy, hard-sided suitcase, with a large textbook and the statue you planned to give to Keith's parents inside. Despite its weight, you could probably get it over your head, and since it's already in your hand, speed would be on your side.\n\n\nNearby is a frail old lady carrying a long umbrella with a fairly pointy metal tip.\n\n\nAlso nearby is a large, heavy metal luggage cart, which you definitely couldn't lift over your head but might do some serious damage if used like a battering ram.", "action_results": [{"action": "Hit him with the suitcase.", "result": " \n\nIn your weakened state, you can barely lift the suitcase. It doesn’t even slow the goblin down. He swats you like a fly, and the last thing you see before your head hits the floor is Dmitri reaching out his hand, trying too late to save you. ", "action_results": []}, {"action": "Ram him with the luggage cart.", "result": " \n\nYou grab one--uh-oh. They’re the kind you have to put coins into in order to make the brakes unlatch. It does almost nothing. The goblin leaps onto the cart and bites your head off.", "action_results": []}, {"action": "Grab the umbrella.", "result": " \n\nYou pull it out of the old lady’s hands. (She starts going after you, but Dmitri intercedes.) It’s light enough that even as jelly-like as your limbs are, you can lift it easily and aim it toward the goblin’s eye. You miss, but you still give him a hard poke in the forehead--not enough to break the skin, but enough that he toddles back a few steps, tiny eyes blinking.\n\n\n \n\nYou use the opportunity to whack him again.\n\n\n \n\nUnfortunately, this seems to wake him up. He comes toward you.\n\n\n \n\nYour friend had a Komodo dragon once. She loved to rub its belly--beneath the scales it was softer than its back or head. You stab his middle with all your might.\n\n\n \n\nSticky yellow blood gushes out, but he’s still coming. One more hit and he wobbles, then smacks onto the floor.\n\n\n \n\nHe’s dead. You’re free.\n\n\n \n\nYou feel nothing. Why should you? You should've been free all along.\n\n\n \n\nYou and Dmitri step outside. It’s raining, and the only thing out here that isn't gray is the long line of taxis. Ready to take you to the Upper East Side. Except you don't want to go there anymore--if you ever did. \n\n\n \n\n“Where are you headed?” Dmitri asks. He has no bags. He’s going to miss his flight to Philadelphia.\n\n\n \n\n“I don’t know,” you say. “But do you want to come with me?”\n\n\n \n\nThe two of you get a taxi and choose a different adventure. Which is, it turns out, the happiest ending of all. ", "action_results": []}]}, {"action": "Nope, not dying here. Let him follow you.", "result": " \n\nSo he follows you. He follows you to your boyfriend’s apartment--to the living room where you make small talk about your trip, into the bathroom while you pee, to the dining room where there is a lovely dinner prepared, into the bedroom where you and your boyfriend sleep. He follows you everywhere, little eyes tracing your every move.\n\n\nFinally, you decide to fight him. It’s like fighting air.\n\n\nYou try to ignore him. Sometimes it works, but mostly it doesn’t. You can’t sleep. You can’t relax with friends. You can’t even kiss Keith without getting uncomfortable.\n\n\nYour friends notice your awkwardness, and Keith gets tired of being pushed away. Your grades suffer. You’re alone more and more--alone with it. After about a year, your mind can’t take it anymore. It lets go.\n\n\nWith medication, you become a mindless--if peaceful--mental patient. But whenever they take you off it enough for you to notice your surroundings, what you see is the goblin. Because he never leaves. ", "action_results": []}]}, null, null]}, {"action": "You know what, whatever. Why the hell not.", "result": " \n\nYou eat, and you immediately you feel better. \n\n\n \n\nWhen it’s time to get off the plane, the goblin is already gone, just like all the other first-class passengers. A glass with a few traces of red wine is on the tray beside his seat.\n\n\n \n\nYou walk through JFK with Dmitri. He holds your hand, watching your face for any sign of them, but there are no goblins.\n\n\n \n\nYou get your luggage from baggage claim and turn toward the exit. Outside is a long line of taxis.\n\n\n \n\nIn front of the door is a huge goblin. Taller than you. His head is above the archway.\n\n\n \n\n“There’s one there,” you say dully to Dmitri, pointing toward it.\n\n\n \n\nHis eyes follow your finger. He squints hard. “I think,\" he says slowly, \"I see a...a shadow.”\n\n\n \n\nThere are about ten sets of doors to the taxi line, so you turn toward another one and start hurrying toward it. It probably won’t work, but hey, what do you have to lose?\n\n\n \n\nIt doesn’t move. “Go ahead.”\n\n\n \n\nYou turn, shocked. They’ve never spoken before.\n\n\n \n\n“If you do, I’ll follow you. I’ll never kill you, but I’ll never stop following.”\n\n\n \n\nOh. Well, great. Fighting him seems like a losing proposition. Sure, he doesn’t look terribly fast or strong, but you aren’t either--and you’ve got skin, not hard, armor-like scales. Also, he's huge. \n\n\n \n\nBut you also can’t let him follow you around forever.\n\n\n \n\nWhat should you do?\n\n\n ", "action_results": [{"action": "You know what, this ends now. Fight him.", "result": " \n\nOkay, what will you fight him with?\n\n\n \n\nYou now have your heavy, hard-sided suitcase, with a large textbook and the statue you planned to give to Keith's parents inside. Despite its weight, you could probably get it over your head, and since it's already in your hand, speed would be on your side.\n\n\n \n\nNearby is a frail old lady carrying a long umbrella with a fairly pointy metal tip.\n\n\n \n\nAlso nearby is a large, heavy metal luggage cart, which you definitely couldn't lift over your head but might do some serious damage if used like a battering ram.", "action_results": [null, null, {"action": "Hit him with the suitcase.", "result": " \n\nYou pick up the suitcase you just got from baggage claim and run at him with it. Like most lizard-like creatures, he has tiny little arms, and he can’t push it away in time. You manage to knock the wind out of him, but he seems basically unharmed. He reaches out and shoves you to the ground. On the smooth, slippery floor, Dmitri is able to yank you backward before the goblin can bite you, but now your back hurts.\n\n\n \n\nTime to try something else.", "action_results": [{"action": "Kay, never mind. Maybe having him follow you around won't be so bad.", "result": " \n\nSo he follows you. He follows you to your boyfriend’s apartment--to the living room where you make small talk about your trip, into the bathroom while you pee, to the dining room where there is a lovely dinner prepared, into the bedroom where you and your boyfriend sleep. He follows you everywhere, little eyes tracing your every move.\n\n\n \n\nFinally, you decide to fight him. It’s like fighting air.\n\n\n \n\nYou try to ignore him. Sometimes it works, but mostly it doesn’t. You can’t sleep. You can’t relax with friends. You can’t even kiss Keith without getting uncomfortable.\n\n\n \n\nYour friends notice your awkwardness, and Keith gets tired of being pushed away. Your grades suffer. You’re alone more and more--alone with it. After about a year, your mind can’t take it anymore. It lets go.\n\n\n \n\nWith medication, you become a mindless--if peaceful--mental patient. But whenever they take you off it enough for you to notice your surroundings, what you see is the goblin. Because he never leaves. ", "action_results": []}, null, null]}]}, null, null]}]}]}, {"action": "Keep running.", "result": "A huge tour group walks in a slow line right in front of you. You shove past them, but not long afterward, the slap-slapping comes behind you. Teeth gnash your knee, and you fall.\n\n\nA hard bite to your shoulder, and then the weight of the goblin is off of you, and you sit up in time to watch it careen into a moving walkway.  Dmitri stands above you.\n\n\n“What,” he says, “was that? It looked like you were having a seizure. Except no one even saw you. I could barely see you.” He shakes his head, as if something has been fogging his vision.\n\n\n“I’ll explain on the plane,” you say. Your shoulder is bleeding, but not too badly. “If I ever actually get on there.”\n\n\n ", "action_results": [{"action": "Continue toward the gate.", "result": " \n\nThey don’t move.\n\n\nYou keep walking, leg muscles braced, ready to stop and turn around.\n\n\nYour damp, shaking hand holds out the ticket. The agent smiles--a real, human smile--and tells you to have a nice flight. You walk past them and get on the plane. Their eyes never leave you, but they don’t move. Apparently you’ve earned the right to get on the plane.\n\n\nAs you get into the cabin, you halt. There is one in an empty seat. (An empty first-class seat--pretty bloody annoying.) It’s somehow wearing what looks like an expensive pinstriped suit, and the stupid flight attendant is handing him some wine.\n\n\nIn the pocket of the seat in front of you is a postcard showing Times Square. You slide it out and flip it over.\n\n\nRest and eat. This ain't finished yet.\n\n\nWell, isn’t that great. You’d love to eat--if you had any friggin’ food.\n\n\nThis is just so stupid. What’s even the point of it? Goblins. Gremlins, or whatever they are. They’re bright Crayola green--they don’t even look realistic.\n\n\nDmitri appears in front of you. “Hi,” he says, but he’s talking to the guy in the middle seat beside you. “I have an exit row seat--would you mind switching so I can sit by my girlfriend?”\n\n\nThe guy is only too happy to switch to an exit row, and soon Dmitri is settled beside you.\n\n\n“I’m not your girlfriend,” you say. How are you even going to explain this to your boyfriend?\n\n\nEasy: you won’t. How could you? It’s unexplainable. You’ve become good at knowing which things not to bother Keith with, and this is definitely one of them.\n\n\n“I know,” Dmitri said. “But I didn’t think he would switch if we were just friends.”\n\n\n“Well, that’s really stupid.” You probably shouldn’t be taking this out on him, seeing as he rescued you and all, but you are hungry and exhausted and you know he’s about to ask a bunch of questions you can’t answer and you just want this stupid trip to be over already. \n\n\n“Clara,” he says. “What’s going on, exactly?” Apparently he's figured out that jealous boyfriends aren't generally invisible.\n\n\n“I don’t know. It just happened.” You explain what you can about the postcards and the goblins. You hand him the postcard, but he finds the handwriting impossible to read--which makes no sense, it’s sloppy, but not that sloppy.\n\n\n“Do you think they’ll actually kill you?”\n\n\n\"I know they will,\" you say, because you do.\n\n\nHe takes your hand.\n\n\nNot long after, you fall asleep.You wake up to the stewardess’ voice.\n\n\n“Miss Conner, here’s the meal you ordered for this flight.” She seems to be in a hurry, and pulls your tray out for you so she can set it down and attend to something else.\n\n\nIt appears to be a chicken salad sandwich and some chips. Which you definitely did not order.\n\n\nYou realize you’re nauseous again, and incredibly hungry. \n\n\nShould you eat this incredibly sketchy food?", "action_results": [null, null]}]}]}, {"action": "Stuff the burrito in a napkin.", "result": " \n\nYou manage to hide the burrito in your napkin. The edges of your vision blur, and your knees are wobbly, but at least you’re safe.\n\n\nYou and Dmitri decide that the best way to get on the plane is for you to wait until the line is ending and then just run. He will stand near enough to see the gate and then text you when it’s time.\n\n\nWhen he texts you, you begin running. No goblins on either side of you. Your hunger disappears--nothing matters except getting on the plane.\n\n\nThey’re behind the desk.\n\n\nActually, they’re ON the desk. Waiting. Watching. Two of them.\n\n\nThe ticket agent is laughing, chiding that you aren’t that late.\n\n\nThe ink of your printed-out ticket stains your sweaty hand. You slow down, almost to a stop. Maybe you should miss the plane. If you run fast, maybe you can lose them for long enough to get a cab to the bus station.\n\n\nBut they didn't start chasing you until you got into this Godforsaken airport. Isn't it logical, then, that maybe they'll stop chasing you once you board?\n\n\nLook at you, trying to apply logic to a situation that's clearly insane. Yeah, that's a real productive use of your time.\n\n\nThey see you. They aren’t coming toward you--but then, why should they? You’re going straight to them.\n\n\nWhat do you do?", "action_results": [null, {"action": "Miss the flight. No way you're going to keep walking toward those things.", "result": "The second you start running, they start chasing. You manage to get ahead enough to hide in a crowded Brookstone, but you miss the flight and they find you when you come out. They kill you immediately.", "action_results": []}]}]}]}, null]}, {"action": "Brush him off.", "result": " \n\nYou have a pleasant conversation until he gets off--at your terminal, but you don't mention that. You ride the tram around the whole airport a few times and then decide to get off at Terminal D, since you assume the goblins are watching the tram stop at Terminal C.\n\n\nAs soon as you get off, they spot you. You try to run, but that works about as well as you’d expect for someone with a broken ankle. They catch you. And they do, indeed, kill you.", "action_results": []}]}, {"action": "Fight, despite the ankle.", "result": " \n\nOkay, what will you use as a weapon? You have your new tote bag, (which, despite being soft on the outside, is pretty heavy with a phone, bottle of water, and iPad). Also, there is a wheelchair that has been left at the foot of the escalator.", "action_results": [{"action": "Bash with bag.", "result": " \n\nYeah, heavy or not, it’s still just a bag, and there are two of them. You manage to hit one, and he seems to get dizzy. The other bites you, and you go down. No one notices you dying.", "action_results": []}, {"action": "Use the wheelchair.", "result": " \n\nPicking up the heavy chair with only one reliable leg causes you to lose your balance. Immediately they’re on you. The last thing you see after one of them takes a bite out of you is a woman stepping over your body, as if she can't see you at all. ", "action_results": []}]}]}]}, {"action": "Run.", "result": " \n\nYou run for a few hundred feet, then dart into a gift shop. You browse behind a high shelf, waiting to see if anyone (or anything) is following you. Nothing looks suspicious, and no one seems to be paying you any particular attention.\n\n\n \n\nYou buy a dark blue Atlanta Braves sweatshirt and pull it over the cashmere J Crew sweater you got from the thrift shop in order to impress your boyfriend’s parents. Then it’s too hot, so you stuff it into your bag--your bright red bag. After checking your surroundings, you limp over and find a tote bag that says Hotlanta! And buy it (the clerk is, by now, looking at you like you’re a freak). You step behind the shelf and transfer everything in your large purse into the tote bag.\n\n\n \n\nSuddenly you see them. Two. They’re about half your height, with green scales and large yellow teeth. They walk on two feet like a person, but they move like lizards. They look like the bad buys in a fairy tale. Goblins, or something. \n\n\n \n\nAnd no one notices.\n\n\n \n\nPeople move around them automatically, like they do for plants or luggage, but their eyes never focus on them.\n\n\n \n\nThe goblins' eyes are small, soulless, but peering everywhere. Their little nostrils--their snouts are shaped like an alligator’s, but shorter--are twitching. They’re sniffing for you.\n\n\n \n\nYou step back, trying to move gradually in case fast movement kicks your scent into the air. Sweat pricks your underarms--a result, no doubt, of both your nervousness and the extra layer you used to have on.\n\n\n \n\nBut when you peek again, they’ve passed by.\n\n\n \n\nMaybe the smartest thing would be to keep them in front of you. After all, your gate is all the way on the other side of the airport, and you only have four hours to get there. The only way out of this nightmare is to get on that plane to New York.\n\n\n \n\nYou wait for them to get about fifty feet ahead, peek out of the store, and, seeing nothing amiss, begin following them. You begin walking toward the center of the airport. Along the way, you throw away the purse and sweater, and stop in the bathroom and cover yourself with sickly-sweet strawberry soap--anything to hide your natural scent.After a few minutes, you reach an escalator, which will take you down to the tram area, where you will get a ride to your terminal.\n\n\n \n\nAs you near the bottom, suddenly there is a slap-slapping on the marble floor, like someone in thin wet socks.\n\n\n \n\nYou turn. There are creatures behind you, weaving around the people at the top of the escalator.\n\n\n \n\nYou hurry down the escalator. The tram to Gate C has arrived. Should you try to catch it, hoping the doors will close before they can follow you (or if they do, that you can hop out quickly) or turn and fight?  ", "action_results": [{"action": "Run for the Tram", "result": " \n\nYou leap onto the tram just as the doors close.  \n\n\n \n\nYou aren’t stupid--no way is this hell over with. But at least you’re safe for now.\n\n\n \n\nThe tram slows at B Gate. Will any of them get on? You edge near the doors, ready to leap out, but none do, and the tram ambles onward.\n\n\n \n\nA guy about your age, tall and skinny with a t-shirt advertising a Dropkick Murphys show from eight years ago gets on. He notices you.\n\n\n \n\nHuh. Come to think of it, not many people have done that since you found the first postcard. You’re no Megan Fox, but you are a reasonably attractive twenty-year-old girl, and you’re used to a moderate amount of male perusal while in public. And yet, for the most part, people’s eyes have been sliding past you all day. Only airport employees have acknowledged your existence. Weird.\n\n\n \n\nAnd yet this guy sees you.\n\n\n \n\nThat’s probably not good.\n\n\n \n\nYou edge a little closer to the doors. What if he’s one of them? A normal college-age boy outside, a goblin inside? Maybe that’s the next level of this--at first the monsters are easy to spot, and then they’re in the form of fairly cute guys.\n\n\n \n\nHe walks up to you. “Hi.”\n\n\n \n\nThis close he looks familiar. Familiar like a human I’ve seen before, or familiar like a goblin?\n\n\n \n\n“I think we went to camp together.”\n\n\n \n\nHis eyes are a yellow-striped green--what color were theirs? You can’t remember. You were too panicked to notice.\n\n\n \n\n“Guess not,” he says. You must look pretty freaked out, because he starts backing away.\n\n\n \n\nAnd then his face clicks into place. Triple R Ranch. Summer before fourth grade. His name is Dmitri, and the reason you still know that is that he was almost your first kiss. (Instead it was this loser named Jason in sixth grade. He told everyone you tasted like bubble gum--which doesn’t seem that bad, but somehow he made it sound absolutely disgusting. What a prick.)\n\n\n \n\n“Wait,” you say. “Dmitri, right?”\n\n\n \n\n“Yeah. You’re Claire.”\n\n\n \n\n“Clara, actually. That’s my real name.” You like Claire better, but it was too hard to keep telling everyone to call you Claire. They kept forgetting, and finally you just gave up and went with it.\n\n\n \n\nHe asks where you’re going, and you tell him. He says he’s going to Philadelphia to spend Christmas with his dad--he’s headed to the same terminal you are.\n\n\n \n\nHis eyes move over you, but not in a flirtatious way. “Are you okay?”\n\n\n \n\nYou look down. You are sweating profusely. “It’s been...a stressful trip,” you finish lamely.\n\n\n \n\n“How so?”\n\n\n \n\nHe seems to know there’s a deeper meaning--which isn’t itself strange, Dmitri has always been able to read people pretty well--but you can’t shake the feeling that running into him is a little too coincidental. Should you trust him enough to tell him you’re being stalked, or just politely brush him off?\n\n\n ", "action_results": [null, {"action": "Brush him off. Things are risky enough, thanks.", "result": "You decide to get off at Terminal D, since that seems to be physically the closest to C. Maybe they won't be waiting for you.\n\n\n \n\nWhen it slows, you look out the windows. They don't seem to be there.\n\n\n \n\nYou pull your hood up and walk out. You go up the escalator.\n\n\n \n\nThey're waiting at the top. Three of them this time.\n\n\n \n\nYou try to turn around, but there is a solid wall of people behind you. They yank you away from the crowd--no one seems to notice, it's like you're completely alone, it's so unfair-- and push you so hard against the wall that you're out before the first bite sinks into your skin. As dying goes, it's pretty painless, but it's still dying--alone, with no one to help you.\n\n\n ", "action_results": []}]}, {"action": "Fight!", "result": " \n\nOkay, what will you use as a weapon? You have your new tote bag, (which is pretty heavy with a phone, bottle of water, and iPad). Also, there is a wheelchair that has been left at the foot of the escalator.", "action_results": [{"action": "Bash with bag.", "result": " \n\nHeavy crap or not, it’s still just a bag, and there are two of them. It makes one dizzy, the other bites you, and you go down. No one notices you dying.", "action_results": []}, {"action": "Use the wheelchair.", "result": " \n\nThe metal of the chair is light enough to swing but hard enough to hurt them. You send one sprawling into the now-moving tram and the other into the path of the crowd getting off the escalator. A few people seem to stumble over their own feet as they step on the goblin, but they--especially a woman in stilettos--injure him badly. Both lie there, bleeding yellow blood. They’re not dead, but both injuries look fatal.  Neither of them is going to be in any condition to chase you for the next three hours. \n\n\nYou probably shouldn't feel that triumphant. Sure, there were two of them, but they're three feet tall.\n\n\nBut you do. You've never fought with anyone (or, in this case, anything) in your life. And you won.", "action_results": [{"action": "Get on the tram.", "result": " \n\nYou hurry onto the tram just as the doors close.  \n\n\nYou aren’t stupid--no way is this hell over with. But at least you’re safe for now.\n\n\nThe tram slows at B Gate. Will any of them get on? You edge near the doors, ready to leap out, but none do, and the tram ambles onward.\n\n\nA guy about your age, tall and skinny with a t-shirt advertising a Dropkick Murphys show from eight years ago gets on. He notices you.\n\n\nHuh. Come to think of it, not many people have done that since you found the first postcard. You’re no Megan Fox, but you are a reasonably attractive twenty-year-old girl, and you’re used to a moderate amount of male perusal while in public. And yet, for the most part, people’s eyes have been sliding past you all day. Only airport employees have acknowledged your existence. Weird.\n\n\nAnd yet this guy sees you.\n\n\nThat’s probably not good.\n\n\nYou edge a little closer to the doors. What if he’s one of them? A normal college-age boy outside, a goblin inside? Maybe that’s the next level of this--at first the monsters are easy to spot, and then they’re in the form of fairly cute guys.\n\n\nHe walks up to you. “Hi.”\n\n\nThis close he looks familiar. Familiar like a human I’ve seen before, or familiar like a goblin?\n\n\n“I think we went to camp together.”\n\n\nHis eyes are a yellow-striped green--what color were theirs? You can’t remember. You were too panicked to notice.\n\n\n“Guess not,” he says. You must look pretty freaked out, because he starts backing away.\n\n\nAnd then his face clicks into place. Triple R Ranch. Summer before fourth grade. His name is Dmitri, and the reason you still know that is that he was almost your first kiss. (Instead it was this loser named Jason in sixth grade. He told everyone you tasted like bubble gum--which doesn’t seem that bad, but somehow he made it sound absolutely disgusting. What a prick.)\n\n\n“Wait,” you say. “Dmitri, right?”\n\n\n“Yeah. You’re Claire.”\n\n\n“Clara, actually. That’s my real name.” You like Claire better, but it was too hard to keep telling everyone to call you Claire. They kept forgetting, and finally you just gave up and went with it.\n\n\nHe asks where you’re going, and you tell him. He says he’s going to Philadelphia to spend Christmas with his dad--he’s headed to the same terminal you are.\n\n\nHis eyes move over you, but not in a flirtatious way. “Are you okay?”\n\n\nYou look down. One of the goblins has ripped your jeans from knee to ankle. Also you are sweating profusely. “It’s been...a stressful trip,” you finish lamely.\n\n\n“How so?”\n\n\nHe seems to know there’s a deeper meaning to that--which isn’t itself strange, Dmitri's always been able to read people pretty well--but you can’t shake the feeling that running into him is a little too coincidental. Should you trust him enough to tell him you’re being stalked, or just politely brush him off?\n\n\n ", "action_results": [{"action": "Trust him...well, a little.", "result": " \n\nYou make up a story about an old boyfriend who is following you and has threatened to kill you. The authorities won’t do anything because the threats are all verbal, and there’s no evidence, and he has a perfect record. Dmitri is skeptical of this at first, but when he sees your fear is real, he starts to believe you.\n\n\n“So what are you going to do?” he asks.\n\n\n“Get off at Terminal D, I guess. He's got to be watching Terminal C, since he knows my itinerary.”\n\n\n“Yeah, but he’s watching for you, right?”\n\n\n“Yes…”\n\n\n“So let’s be a couple. He’ll be looking for someone alone, and that terminal should be pretty crowded since it’s a Delta one.”\n\n\nShould you agree to this, or continue with your original plan?", "action_results": [null, null]}, {"action": "Brush him off. Things are risky enough, thanks.", "result": " \n\nYou decide to get off at Terminal D, since that seems to be physically the closest to C. Maybe they won't be waiting for you.\n\n\n \n\nWhen it slows, you look out the windows. They don't seem to be there.\n\n\n \n\nYou pull your hood up and walk out. You go up the escalator.\n\n\n \n\nThey're waiting at the top. Three of them this time.\n\n\n \n\nYou try to turn around, but there is a solid wall of people behind you. They yank you away from the crowd--no one seems to notice, it's like you're completely alone, it's so unfair-- and push you so hard against the wall that you're out before the first bite sinks into your skin. As dying goes, it's pretty painless, but it's still dying--alone, with no one to help you.\n\n\n ", "action_results": []}]}]}]}]}]}, null]}, {"action": "Um, it said not to tell. You're just going to sit quietly and then start running when you get off the plane.", "result": "You run for a few hundred feet. No one seems to be coming behind you. Everything seems normal. Just another chaotic airport.\n\n\nYou keep running. Maybe--maybe--this is all a sick joke. Well, probably not. But it could be an idle threat. After all, you’re in public. It shouldn’t be too hard to stay around plenty of witnesses--you’re in a friggin’ airport at Christmastime. This is fine. You can handle this.\n\n\nYou dart into a gift shop. You browse behind a high shelf, waiting to see if anyone (or anything) is following you. Nothing looks suspicious, and no one seems to be paying you any attention.\n\n\nJust to be safe, you buy a dark blue Atlanta Braves sweatshirt and pull it over the cashmere J Crew sweater you got from the thrift shop in order to impress your boyfriend’s parents.\n\n\nWhat else will make you stand out? You're carrying a bright red purse.\n\n\nAfter checking your surroundings, you walk over and find a tote bag that says Hotlanta! And buy it (the clerk is, by now, looking at you like you’re a freak). You step behind the shelf and transfer everything in your large purse into the tote bag.\n\n\nSuddenly you see them. Two. They’re about half your height, with green scales and large yellow teeth. They walk on two feet like a person, but they move like lizards. They look like the bad buys in a fairy tale. Goblins, or something. \n\n\nAnd no one notices.\n\n\nPeople move around them automatically, like they do for plants or luggage, but their eyes never focus on them.  \n\n\nThe goblins' eyes are small, soulless, but peering everywhere. Their little nostrils--their snouts are shaped like an alligator’s, but shorter--are twitching. Sniffing for you.\n\n\nYou step back, trying to move gradually in case fast movement kicks your scent into the air. Sweat pricks your underarms--a result, no doubt, of both your nervousness and the extra layer you’ve put on.\n\n\nBut when you peek again, they’ve passed by.\n\n\nYou pull off the sweater under your sweatshirt and manage to yank it off through the neck.\n\n\nMaybe the smartest thing would be to keep them in front of you. After all, your gate is all the way on the other side of the airport, and you only have four hours to get there. The only way out of this nightmare is to get on that plane to New York.\n\n\nYou wait for them to get about fifty feet ahead, peek out of the store, and, seeing nothing amiss, begin following them. You begin walking toward the center of the airport. Along the way, you throw away the purse and sweater, and stop in the bathroom and cover yourself with sickly-sweet strawberry soap--anything to hide your natural scent.After a few minutes, you reach an escalator, which will take you down to the tram area, where you will get a ride to your terminal.\n\n\nAs you near the bottom, suddenly there is a slap-slapping on the marble floor, like someone in thin wet socks.\n\n\nYou turn. Creatures are behind you, weaving around the people at the top of the escalator.\n\n\nYou hurry down the escalator. The tram to Gate C has arrived. Should you try to catch it, hoping the doors will close before they can follow you (or if they do, that you can hop out before they can do the same) or turn and fight?  \n\n\n ", "action_results": [{"action": "Fight!", "result": " \n\nOkay, what will you use as a weapon? You have your new tote bag, (which, though soft on the outside, is pretty heavy with a phone, bottle of water, and iPad). Also, there is a wheelchair that has been left at the foot of the escalator.\n\n\n \n\n ", "action_results": [{"action": "Bash with bag.", "result": " \n\nHeavy or not, it’s still just a bag, and there are two of them. It makes one goblin dizzy, the other bites you, and you go down. Strangely, no one notices you dying.", "action_results": []}, {"action": "Pick up the wheelchair.", "result": " \n\nThe metal of the chair is light enough to swing but hard enough to hurt them. You send one sprawling into the now-moving tram and the other into the path of the crowd getting off the escalator. A few people seem to stumble over their own feet as they step on the goblin, but they--especially a woman in stilettos--injure him badly. Both lie there, bleeding yellow blood.\n\n\nThey’re not dead, but both injuries look fatal.  Neither of them is going to be in any condition to chase you for the next three hours.", "action_results": [{"action": "Board the tram, victorious one!", "result": " \n\nYou hurry onto the tram just as the doors close.  \n\n\nYou aren’t stupid--no way is this hell over with. But at least you’re safe for now.\n\n\nThe tram slows at B Gate. Will any of them get on? You edge near the doors, ready to leap out, but none do, and the tram ambles onward.\n\n\nA guy about your age, tall and skinny with a t-shirt advertising a Dropkick Murphys show from eight years ago gets on. He notices you.\n\n\nHuh. Come to think of it, not many people have done that since you found the first postcard. You’re no Megan Fox, but you are a reasonably attractive twenty-year-old girl, and you’re used to a moderate amount of male perusal while in public. And yet, for the most part, people’s eyes have been sliding past you all day. Only airport employees have acknowledged your existence. Weird.\n\n\nAnd yet this guy sees you.\n\n\nThat’s probably not good.\n\n\nYou edge a little closer to the doors. What if he’s one of them? A normal college-age boy outside, a goblin inside? Maybe that’s the next level of this--at first the monsters are easy to spot, and then they come in the form of fairly cute guys.\n\n\nHe walks up to you. “Hi.”\n\n\nThis close he looks familiar. Familiar like a human I’ve seen before, or familiar like a goblin?\n\n\n“I think we went to camp together.”\n\n\nHis eyes are a yellow-striped green--what color were theirs? You can’t remember. You were too panicked to notice.\n\n\n“Guess not,” he says. You must look pretty freaked out, because he starts backing away.\n\n\nAnd then his face clicks into place. Triple R Ranch. Summer before fourth grade. His name is Dmitri, and the reason you still know that is that he was almost your first kiss. (Instead it was this loser named Jason in sixth grade. He told everyone you tasted like bubble gum--which doesn’t seem that bad, but somehow he made it sound absolutely disgusting. What a prick.)\n\n\n“Wait,” you say. \"Dmitri, right?”\n\n\n“Yeah. You’re Claire.”\n\n\n“Clara, actually. That’s my real name.” You like Claire better, but it was too hard to keep telling everyone to call you Claire. They kept forgetting, and finally you just gave up and went with it.\n\n\nHe asks where you’re going, and you tell him. He says he’s going to Philadelphia to spend Christmas with his dad--he’s headed to the same terminal you are.\n\n\nHis eyes move over you, but not in a flirtatious way. “Are you okay?”\n\n\nYou look down. During the fight, one of the goblins apparently ripped your jeans from knee to ankle. Also you are sweating profusely. “It’s been...a stressful trip,” you finish lamely.\n\n\n“How so?”\n\n\nHe seems to know there’s a deeper meaning to that--which isn’t itself strange, Dmitri has always been able to read people pretty well--but you can’t shake the feeling that running into him is a little too coincidental. Should you trust him enough to tell him you’re being stalked, or just politely brush him off?\n\n\n ", "action_results": [null, null]}]}]}, {"action": "Run for the tram.", "result": " \n\nYou hurry onto the tram just as the doors close.  \n\n\n \n\nYou aren’t stupid--no way is this hell over with. But at least you’re safe for now.\n\n\n \n\nThe tram slows at B Gate. Will any of them get on? You edge toward the doors, ready to leap out, but it's just a group of middle schoolers in matching sweatshirts and their chaperone. The tram ambles forward.\n\n\n \n\nAt the next stop, a guy about your age, tall and skinny with a t-shirt advertising a Dropkick Murphys show from eight years ago, gets on. He notices you.\n\n\n \n\nHuh. Come to think of it, not many people have done that since you found the first postcard. You’re no Megan Fox, but you are a reasonably attractive twenty-year-old girl, and you’re accustomed to a moderate amount of male perusal while in public. And yet people’s eyes have been sliding past you all day. Only airport employees have acknowledged your existence. Weird.\n\n\n \n\nThis guy, however, sees you.\n\n\n \n\nProbably not good.\n\n\n \n\nYou edge a little closer to the doors. What if he’s one of them? A normal college-age boy outside, a goblin inside? Maybe that’s the next level--at first the monsters are easy to spot, and then they’re in the form of fairly cute guys.\n\n\n \n\nHe walks up to you. “Hi.”\n\n\n \n\nThis close he looks familiar. Familiar like a human I’ve seen before, or familiar like a goblin?\n\n\n \n\n“I think we went to camp together.”\n\n\n \n\nHis eyes are a yellow-striped green--what color were theirs? Damn. You were too panicked to notice.\n\n\n \n\n“Guess not,” he says. You must look pretty freaked out, because he starts backing away slowly.\n\n\n \n\nAnd then his face clicks into place. Triple R Ranch. Summer before fourth grade. His name is Dmitri, and the reason you still know that is that he was almost your first kiss. (Instead it was this loser named Jason in sixth grade. He told everyone you tasted like bubble gum--which doesn’t seem that bad, but somehow he made it sound absolutely disgusting. What a prick.)\n\n\n \n\n“Wait,” you say. “Dmitri, right?”\n\n\n \n\n“Yeah. You’re Claire.”\n\n\n \n\n“Clara, actually. That’s my real name.” You like Claire better, but it was too hard to keep telling everyone to call you Claire. They kept forgetting, and finally you just gave up and went with it.\n\n\n \n\nHe asks where you’re going, and you tell him. He says he’s going to Philadelphia to spend Christmas with his dad--he’s headed to the same terminal you are.\n\n\n \n\nHis eyes move over you, but not in a flirtatious way. “Are you okay?”\n\n\n \n\nYou look down. In addition to the sloppy-looking sweatshirt, you are sweating profusely. “It’s been...a stressful trip,” you finish lamely.\n\n\n \n\n“How so?”\n\n\n \n\nHe seems to know there’s a deeper meaning to that--which isn’t itself strange, Dmitri has always been able to read people pretty well--but you can’t shake the feeling that running into him is a little too coincidental. Should you trust him enough to tell him you’re being stalked, or just politely brush him off?\n\n\n ", "action_results": [null, null]}]}, null]}, {"action": "Don't Tell", "result": " \n\nThe plane lands.\n\n\n \n\nWhat should you do--go to the TSA and tell them what’s going on, or just run and hope the killer doesn’t find you?\n\n\n ", "action_results": [null, null]}]}]}, null]}, {"action": "Take the postcard from the board.", "result": " \n\nIn thick black Sharpie, it says\n\n\n“Dear Clara,\n\n\nIf you leave, I’ll go too. So I can kill you.”\n\n\nNo exclamation point. Like it’s a fact. \n\n\nSo, um...that happened. You aren't real big on taking risks...but then again, is this a risk or a weird joke? ", "action_results": [{"action": "Why take chances? Stay and watch Netflix.", "result": " \n\nWhy take chances? You were nervous about meeting his family anyway. You don’t go.\n\n\nYour boyfriend is mad at you for about a month afterward, and you start to regret how cowardly you were--both about the note and meeting his parents. You clearly don’t have the capacity to think for yourself--and you’re selfish.\n\n\nIn May, Keith gets a middle-management job at his dad’s company, which was always the unspoken plan (though Keith told people at parties that he was an aspiring writer.) He moves to New York City, and you are so bent on redeeming yourself for not coming to see him at Christmas that you follow him out there without really considering that you aren't in love with him anymore.\n\n\nA year later, you're engaged, and a year after that, you marry him. His father’s company promotes him quickly (so quickly his colleagues secretly hate him).You have two kids. You suspect he’s cheating, but you don’t really think about it until he comes home just before your twentieth anniversary. He tells you he’s in love with his secretary.\n\n\nGoblins haunt your dreams.\n\n\nAfter a two-year divorce battle over alimony and custody, you are angry, exhausted, and consumed with the need for vengeance. As the years go by, nothing much changes. You resent Keith for the way he controlled your life, but at this point you're too lazy to be proactive. This attitude remains basically unchanged until you die--which happens when you're an old woman, but jeez, what a pointless life.", "action_results": []}, {"action": "Go anyway. It's obviously a joke.", "result": " \n\nUm, this is clearly a joke--and since you don’t get it, it’s probably for your roommate. Obviously you aren’t going to screw up your holiday plans and waste the $900 ticket Keith generously got for you.\n\n\nYou finish packing. As you roll your suitcase down the deserted hallway, you see something disappearing around a corner: a figure about three feet tall, with green skin.\n\n\nShould you follow it, or ignore your obviously delusional and sleep-deprived mind?", "action_results": [null, null]}]}]}