{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=38774", "context": "", "first_story_block": "Your name is Leo Trapa (which you have had legally changed from Cleo Trapa to sound more manly) and you have recently gained great fame after sailing your ship Adventurer completely around your world of Magellan from north to south. The Adventurer is a tough little ship, large enough for a Crew of 30 and with enough space to hold 30 days worth of supplies. Though you are only twenty years old you have already received the rank of Commander in recognition of your superb ability and are widely respected as one of the greatest sailors of your homeland, The Kingdom of the Three Islands.\n\n\nThe World of Magellan on which you live is mostly water and for this reason the people of The Three Islands have a rich naval tradition. Gunpowder is a recent invention and though your ship is armed with four cannons and all of your crew carry muskets these are slow to load and highly inaccurate when fired making the sword your crew's primary weapon. A dozen Colonies have been established on Islands beyond your people's borders but these vary from well-organized and thriving settlements to frequently-massacred outposts of civilization.\n\n\nYour ship can only carry a maximum amount of Food for 30 days, which will make finding and obtaining sources of Food your top priority. If you ever run out of Food (your Food number reaches 0) then you and all your Crew will starve to death and die. You will almost certainly lose Crew members on this military expedition and you must take care that your Crew number never falls to 0: that will mean that you and all your Crew are dead.\n\n\nThough not as important as during your previous voyage you will still want to make your journeys in the shortest number of Days possible. Queen Anne-Marie is keen to encourage efficiency and rewards those Captains who complete their voyages swiftly with additional Crew and Food. You are sailing as one of the ten Ships in the War Fleet, commanded by Queen Anne-Marie, and you will find details of your fellow Captains and Commanders in the List of War Fleet Officers provided below.\n\n\nSurviving this voyage will not be as easy as it may appear... those who do will receive 1 Score Point while those who run out of Crew or Food during their voyage and die win no Score Points. Your Score will be shown if you leave a comment when you have finished this story. As in previous adventures you might find it useful to make a map as you sail as the information might be useful for future voyages and adventures in these waters...\n\n\nSo good luck reader, make wise and strategically sound choices and with a little luck, a good course and a fair wind you might live to see your homeland again!", "action_results": [{"action": "Click here to begin your adventure (pick up the List of War Fleet Officers first!)", "result": "Queen Anne-Marie looks round at you and her other assembled Officers with a steely gaze, as if measuring each officer's worth.\n\n\n\"Your voyages so far have accomplished great things\", she announces. \"Many Islands have been colonized, many more islands discovered and I am confident that with sailors such as you under my command many more will be found. We do however have a problem: the Lapau as they call themselves. A vast confederation of allied tribes by force or reason we must come to a favorable treaty with them and establish where the border between their lands and ours lies. To do this we must explore their islands, see where they are, how strong they are and how wealthy they may be.\"\n\n\nYou glance round at the other officers, both those you know and those you don't. Grey-bearded and softly-spoken Commander Cuthrew is gazing intently at Queen Anne-Marie as she speaks, nearby Donald Trevers is cleaning his spectacles nervously. Your friend Esme Hale, the attractive fire-haired maiden of the sea, catches your eye and winks at you. You smile back but quickly pay attention as Queen Anne-Marie gives you a disapproving glance.\n\n\n\"During The Great Race and The Second Race most of our problems were caused by lack of Food,\" she declares. \"I have had those of our Colonies which lie in our path well-stocked with food and my vessel, the Monarch of the Sea, has been specially constructed to carry vast amounts of Food which I will allocate among you all based on your performance and speed during this voyage. We must try to learn from our past experiences.\"\n\n\nAnne-Marie pauses again and you quickly glance round at those Officers you are not personally familiar with. Thomas Finch and Richard Quarrel stand behind the Queen, Finch is straight-backed and hard-looking while Quarrel has the face and manner of a pickpocket. More impressive are the cousins Swift and Mason, both fair-haired and smart-looking young ladies. Standing aloof to one side and scowling at something is the tomboyish Eva Freer. With her short purple hair and wiry, slender figure she's quite good looking you think...\n\n\n\"The first leg of our voyage will be south through the Southern Passage, past Trever's Island and we will rendezvous on Burnt Island,\" Queen Anne-Marie declares. \"We will sail at dawn tomorrow morning and woe betide you if ten Days from now we are not all anchored off Burnt Island. I know you are all good Sailors and if you serve me well then together we can make this world ours... very well. See to your ships Commanders and we will sail on the dawn tide.\"\n\n\nThe next day the early morning fog is just clearing as you order the anchor raised aboard the Adventurer in readiness to sail out of Golden Sands. The packed crowds on the quay remind you of when you set sail on The Great Race around the world but then the crowds were cheering while today they are oddly subdued and silent... you sense that deep down everyone knows the War Fleet has not been assembled for diplomatic reasons and there are many husbands and fathers aboard it's ships that will not come home again.\n\n\nSome individual ships are still capable of raising a cheer, your Adventurer is one and when Hale's Merry Company sets sail the cheers and shouts are deafening. The Sea Ghost rapidly pulls away from the harbor, vanishing to the south, followed in a group by The Royal Escort, Indefatigable and The Monarch of the Seas. The cousins Swift and Mason are sailing together and you watch with a smile as Trever's Lucky nearly collides with Freer's Gambler prompting a string of imaginative and and biologically detailed insults from that colorful Commander. With a sigh you watch your homeland vanish from sight as you sail the Adventurer once more into the unknown.", "action_results": [{"action": "Sailing South", "result": "Sailing South for three days you soon come to the Southern Passage, a channel mined and blasted through The Great Reef which surrounds The Three Islands, which together with the Northern Passage and the newer Eastern and Western Passages allow access to the outside world. As you approach the Passage you see the Explorer and Maverick sailing through, not being personally familiar with either Commander Swift or Mason you hang back until they are clear before guiding the Adventurer through. On a relatively flat corral shelf a wooden watchtower and cabin has been built, above the tower flies the royal emblem of Queen Anne-Marie. A soldier in the tower waves cheerfully at you and you remember Anne-Marie's claim she'd had the colonies and outposts along the War Fleet's route supplied with large caches of food. You could drop anchor and try to beg for food but it would cost you 1 Day.", "action_results": [{"action": "Drop anchor and try to claim fresh Supplies", "result": "Anchoring in the Passage you lead a party of sailors ashore to meet the two friendly soldiers who garrison the watchtower, each working 12 hour shifts.\n\n\n\"Expedition is underway then?\" one asks you cheerfully. \"I have to say Commander Trapa I don't envy you. I served in the Colony on Burnt Island I've seen those Lapaw come out in those little canoes to inspect us. They look a tough bunch, even with ten ships and three hundred men behind me I wouldn't like to go against them.\"\n\n\n\"Have you any food to spare?\" you ask politely.\n\n\nThe guards cheerfully supply you with a barrel of salted pork which you take back to your ship and thaking them you sail on.", "action_results": [{"action": "South to Trevers Island", "result": "Leaving The Southern Passage behind you continue on your course, occasionally sighting the sails of your fellow officers on the horizon. At one point you overtake Donald Trever's Lucky, which is zig-zagging erratically. \"Rudder broke off on some corral\" Trevers shouts across to you when you sail closer but waves you off when you ask if he needs some help. He is still in sight when you reach the island that was named after him after he spent some time marooned there after one of his previous ship's caught fire and sank. The pleasant tropical island is now inhabited by a small village of colonists who grow crops and fish. You are pleased to see Esme Hale's Merry Company is already anchored there, her crew loading barrels of fish aboard her ship.\n\n\n\"Esme, you will never reach Burnt Island if you stop for food every time you are hungry,\" you shout to her when the Adventurer pulls alongside. Hale laughs.\n\n\n\"What's the point of rushing?\" she asks. \"I'd rather get there in good shape than rush and miss out on all this nice fresh fish. Why don't you come ashore, we're having a goat hunt tomorrow!\"\n\n\nAs you consider your answer you catch your crew looking at you with hopeful eyes, clearly keen to spend a day larking about with Hale's sailors.", "action_results": [{"action": "Drop anchor off Trever's Island", "result": "Dropping anchor you and your Crew go ashore the next morning and join Hale's hunt. Esme is a fine shot and goat after goat falls to her deadly musket balls. The local Colonists don't get too many visitors and are glad to make you welcome though while resting at their village at lunch time you notice work is underway to build a small wooden fort nearby.\n\n\n\"A dozen of them came in canoes one night and killed one of our fishermen,\" one of the colonists explains nervously. \"We had to pluck seventeen arrows out of him.\"\n\n\nYou and Esme exchange frowns and decide it is time to get moving. Loading your fresh goat carcasses on board you both sail on South to the rendezvous at Burnt Island.", "action_results": [{"action": "Burnt Island", "result": "Your short voyage comes to an end when you drop anchor off the island Donald Trevers managed to so thoroughly destroy with fire during his last voyage here. You arrive at almost exactly the same time as Esme Hales's Merry Company and drop anchor near where the wreck of Trevers's previous ship Lady Fortune is still visible beneath the waves. The Sea Ghost is already there and over the next few hours most of the other ships arrive until finally the last one arrives after dark: Trevers's Lucky, still zig-zagging wildly thanks to it's broken rudder. There is a small colony on the island and Queen Anne-Marie arranges for the colonists to supply all of the ships of the War Fleet with a few supplies while her Officers attend a Council aboard her ship the next morning.", "action_results": [{"action": "Burnt Island", "result": "One by one the Commanders of the War Fleet row up to the towering sides of the Monarch of the Sea and ascend rickety ladders up to it's deck. Arriving on deck you find Cuthrew already there, looking more elderly and pale than you remember. Brisk and business-like Finch leads you down to Queen Anne-Marie's cabin where Quarrel, an unpleasant-looking man with a mocking smile is already waiting. You are soon joined by the cousins Mason and Swift and up close you can tell they are related as both have fair hair and pale complexions. Hale, Trevers and finally Freer arrive, up close she is even more attractive than she was in Golden Sands. When you are all assembled Queen Anne-Marie enters and the Council begins.\n\n\n\"The closest Lapau-inhabited island that we know of lies directly Southeast of here,\" she declares. \"The first thing we need to do is sail there and see if the Natives are willing and able to discuss the relations between our two Nations in a meaningful way. When we anchor offshore I will go ashore with one hundred men and humble these hut-dwellers into submission. Commander Cuthrew will command the Fleet during my absence but any of the rest of you who wish to come ashore with me can... remember at all times that we are superior to these Lapau and we must prove it to them.\"\n\n\nFollowing Anne-Marie's speech you are all sent back to your ships and the resupplied War Fleet sails Southeast as one group towards the lands of the Lapau.", "action_results": [{"action": "Meeting the Lapau", "result": "For three days the War Fleet follows a Southeast course until dusk on the third day when they drop anchor offshore.The small tropical island has a large village of wooden huts on a beach and in the dusk you watch the tall and strong-looking semi-clothed Natives gathering on the shoreline to silently inspect you. The next morning a well-crewed longboat containing Queen Anne-Marie sets out from the Monarch of the Sea, as you watch four more boats containing Commanders Quarrel, Swift, Mason and Freer also set off for the shore.", "action_results": [{"action": "Go ashore with the diplomatic mission", "result": "Taking a dozen Sailors into your Longboat you join Queen Anne-Marie and the other Commanders as they lead their men ashore to where a crowd of Natives stand silently waiting. Anne-Marie, dressed in her best clothes with a sword and two new-fangled single-shot \"pistols\" at her belt leads the way in confident strides up the beach. A small group of men move forward to meet her, their elaborately tatoed bodies are naked except for loin cloths and they carry spears and shields. Richard Quarrel calls out a warning to Anne-Marie but she strides on towards them regardless.\n\n\nIt is quickly recognized that neither you nor the Lapau understand one another's language: the Lapau speak in deep, rich, musical voices and though Anne-Marie attempts to use sign language this just seems to cause confusion. Anne-Marie tries presenting gifts like expensive jewellery to the Lapau but after examining them briefly they hand them back. The Lapau offer no gifts in return and as the meeting drags on without either side able to understand the other they mutter among themselves and give you all unfriendly looks. Finally giving up Anne-Marie leads you all back to the boats.\n\n\nReturning to your ships Queen Anne-Marie seems unsure what to do next. She issues no orders except to remain on alert and going down into your cabin in the Adventurer you stay awake for a long time, wondering what will happen next. Finally you drift into an uneasy sleep...", "action_results": [{"action": "A rude awakening", "result": "You are woken in the middle of the night by a scene from the depths of your nightmares.\n\n\nHundreds of screams and shouts fill the air all at once followed by the muffled bangs of musket shots and springing to your feet you race up to deck to find utter pandemonium has engulfed the War Fleet. Hundreds of little one-man canoes surround the Fleet's ten ships like ants around sandwiches and brightly-painted figures are rapidly climbing up onto the decks, jabbing their spears through the sides of the ships or firing arrows up at them. Aboard all the ships men are grappling as spears thrust, swords swing, muskets fire and men are cut down screaming and gurgling to fall to the decks or into the sea.\n\n\nThe Adventurer was not anchored close to the Island and consequently seems to have received little attention but still a dozen Lapau Natives have hauled themselves on deck and are grappling with your Crew, three of your men already lie motionless on the deck. Drawing your sword you order your men to fire their muskets and as guns bang the Lapau Warriors are killed or dive from the ship to the safety of the sea. With the Adventurer secure at least you look round and find things are worse for most of the other ships in the Fleet.\n\n\nA lot worse.\n\n\nCommander Trever's ship Lucky is on fire: blazing fiercely and sinking as the flickering flames light up the silhouettes of men grappling and fighting on her decks. Commander Freer's ship Gambler is also sinking fast: pierced by dozens of spears it's sailors are diving from it's decks into the sea all around. Commander Hale's Merry Company is being swarmed by so many Lapau it seems impossible the ship does not sink under it's wait. A row of several cannons aboard the Monarch of the Sea boom into life but it too is heavily overrun and trying to get to her aid the Indefatigable has also come under heavy attack and a small fire has broken out amidships.\n\n\nNot all is chaos however: the Sea Ghost is under sail and gliding smoothly through the chaos delivering organized volleys of musket fire at the thickest groups of Lapau and the Royal Escort, though still at anchor is also delivering volleys of musket and cannon fire. Anchored nearby, like you the Explorer and Maverick have also only been lightly attacked and are trying to clear their decks for action. As your sailors manage to hoist the anchor the wind fills your sails and the Adventurer glides forward.\n\n\nYou can scarcely believe it: the whole War Fleet has fallen victim to a night attack from hundreds, perhaps even thousands, of deadly spear and bow-armed Lapau Warriors in canoes! Aboard the Adventurer you know your must go to the aid of one of your fellow Commanders: the Monarch of the Sea, Indefatigable and Merry Company are all in need of immediate help and the Lucky and Gambler are sinking already.", "action_results": [{"action": "Sail towards Queen Anne-Marie's embattled ship Monarch of the Sea", "result": "Feeling that the protection of your Queen is your first priority you steer your ship straight towards the towering Monarch of the Sea. Cannons explode madly in the darkness and as you get closer you can see the ship's crew have been driven back to the stern where they are fighting desperately back against their attackers with musket shots and sword points. You spot the distinctively-dressed figure of Anne-Marie calmly aiming and firing muskets at the attackers, which are being loaded and passed to her by two of her sailors.\n\n\nAs you pull alongside your men fire a volley of musket and cannon shots into the Lapau that cuts down most of the great crowd on the main deck. With a cheer Anne-Marie's crew counter-attack and the surviving Lapau abandon the ship, diving back into the sea all around. As you spin the wheel to avoid a collision with Anne-Marie's ship a deafening burst of fire lights up the night. The Lucky has just exploded spectacularly, launching scraps of wood and bodies high into the air. The explosion has completely destroyed the ship and a few moments later the Gambler sinks beneath the waves too. With cheers the Lapu abandon their attack and returning to their canoes they paddle back to their island to celebrate their victory.", "action_results": [{"action": "The Aftermath...", "result": "Dawn illuminates the horrors caused during the night.\n\n\nBodies bob slowly up and down on the gentle waves in all directions as far as the eye can see while wreckage from the sunken Lucky and Gambler litter the ocean. The Monarch of the Sea, Indefatigable and Merry Company have all been seriously damaged and aboard all the ships of the fleet bodies of sailors and Lapau alike are being pitched into the ocean. Occasionally a musket shot rings out as a wounded Lapau is discovered and killed. At noon you and the other surviving officers are summoned to a Council of War aboard the Monarch of the Sea.\n\n\nCommander Donald Trevers is dead, killed along with the rest of his Crew when the Lucky's gunpowder store exploded. Esme Hale is devastated: two thirds of her crew have been killed in the fighting and sitting there white-faced with a bloodied bandage wrapped around a hip wound she looks the very picture of misery. Eva Freer has been wounded too, stabbed in the shoulder as she swam to safety from the sinking Gambler, only a handful of Crew have survived. Anne-Marie and Quarrel have also suffered heavy losses amongst their crew: altogether nearly one hundred men or a third of the War Fleet's manpower have been killed. The fact that the Lapau suffered similar casualties is small consolation.\n\n\n\"None of us expected this attack,\" Anne-Marie says grimly when you have all gathered. \"The Lapau have declared war on us and from now until they surrender we will show them no mercy. We need to make new plans though: this Fleet has been badly damaged and needs to refit and reinforce itself. There is not a danger that the Lapau will attack our colonies. These savages have proven more dangerous than we expected and another battle like last night's fight might destroy our Fleet.\"\n\n\nAnne-Marie pauses for a moment. \"I am dividing this Fleet up. Commander Hale and myself will sail back to Golden Sands to get more men and supplies and to have Commander Hale's wound treated. We will be gone about three weeks. In our absence I want you Commander Cuthrew to sail east pst this island and locate other Lapau-occupied islands near here. We must know where their settlements are so we can attack them. There is no one but you I would entrust this mission to.\"\n\n\nAnne-Marie glances round at the rest of you. \"Commander Finch, I want you and Commander Quarrel to co-ordinate an attack to destroy all Lapau resistance on this island and convert it into a base from which we can launch our assault on other Lapau Islands. Rely on musket and cannon fire, keep a safe distance and the Natives here will be destroyed. Commanders Swift and Mason, I want you to ensure our colonies are safe: sail with me and Commander Hale as far as Trever's Island and then when he turn north sail west to Sandy Island and then back to here where you will render Commanders Finch and Quarrel any assistance they might need.\"\n\n\nFinally Anne-Marie turns to you and Freer. \"Commander Freer, you will join Commander Trapa aboard the Adventurer, your remaining Crew will be assigned to Commander Hale's ship. You will assist Commander Trapa in any way he sees fit.\"\n\n\nFreer starts to protest angrily but Anne-Marie cuts her short with an angry clap of her hands.\n\n\n\"I have given you an order Commander. It will be obeyed. Commander Trapa... the absence of myself and Commander Cuthrew you will command the Fleet until either myself ot Commander Cuthrew return. Commander Freer will assist you. You can either remain here and co-ordinate the assault on this island with Finch and Quarrel or you can accompany Swift and Mason on their voyage to ensure our Colonies are safe. I am giving you that discretion and I trust you will not let me down.\"\n\n\nFeeling pride at your promotion you promise Anne-Marie she can rely on you.", "action_results": [{"action": "Stay here and co-ordinate Finch and Quarrel's attack on the island", "result": "After the Council the other five ships of the War Fleet sail off in different directions leaving the Adventurer, Royal Escort and Indefatigable alone off a hostile shore. Between your three crews you have less than eighty men while there are many times that number of Lapau on the island. After a few days of repairing the Indefatigable and ponder the problem you invite the other Commanders aboard to discuss a plan to conquer the island. Finch, Quarrel and Freer all join you in your cabin.\n\n\n\"Our main advantage we have here is our muskets and cannon fire,\" you tell them. \"If we land and keep in disciplined ranks then we can advance on the village using musket and cannon fire to keep the enemy at a distance. After taking the village we can clear the whole island\n\n\n\"That won't help us if they take to their canoes\" Finch points out. \"They could easily escape or even make an attempt to capture our ships.\"\n\n\n\"We can use the ships to surround the island at three points and cut off any escape. If one ship is attacked the other two can sail to help them.\"\n\n\n\"Will you be commanding the land or the sea force?\" Quarrel asks.", "action_results": [{"action": "The land force", "result": "It takes a few days for your Crew to complete all the preparations necessary to make the landing on Village Island. On the day of the assault you, Finch and Quarrel lead your sailors ashore in three longboats. The moment you hit the sand your men quickly form into three ranks, loaded muskets held ready as you advance cautiously on the village. It is eerily quiet. You find the village deserted and move past it into the jungle. You search the whole island for hours but don't find a single Lapau. At some earlier date they must have completely evacuated the island, taking with them all the food they could carry. You do find a small amount which is taken back to your ships.\n\n\nWhen you all lead your Crews back to your ships Captain Freer can't stop laughing when she learns you have painstakingly surrounded and captured a totally uninhabited island. You ignore her because you have still fulfilled your orders and for the next few days your men keep busy knocking down the villager's huts and building a small wooden fort and jetty while you wait for the other ships of the War Fleet to return.", "action_results": [{"action": "Cuthrew's Return", "result": "After a few days of waiting and working on the Fort the War Fleet begins to reassemble, starting with Commander Cuthrew's Sea Ghost which sails up from the Southeast. When she anchors alongside you Cuthrew comes aboard the Adventurer and resumes command of the Fleet.\n\n\n\"Did you find any land?\" you ask the old sailor who nods.\n\n\n\"Some. There's an island to the south which I've seen before full of giant lizards. Southeast of here there's a barren rocky island which contains a village of Lapau. I did not want to sail too far into hostile waters so I guess that rocky island will be our next target.\"\n\n\nYou agree and settle down to wait for the rest of the Fleet.", "action_results": [{"action": "Swift and Mason return", "result": "You are beginning to get concerned about the Supply situation by the time Commanders Swift and Mason return. Having visited all four of your country's Colonies in these waters they report the situation is safe: the Lapau have not attacked any of them which supports your belief that they have withdrawn away to the south. You are keen to continue the attack against the Lapay and all you need now is for Anne-Marie and Hale to arrive and after a few more days they do.", "action_results": [{"action": "Anne-Marie and Hale's Return", "result": "Having made excellent time Queen Anne-Marie and Commander Hale rejoin the War Fleet, restoring it to it's full strength of eight ships. As it turns out they didn't sail all the way back to Golden Sands, only as far as The Southern Passage where ample supplies were waiting for them, Anne-Marie quickly distributes them among the Fleet. With repairs finished to all ships, Hale and Freer's wounds healing nicely and two-hundred strong remaining members of the expedition feeling confident Anne-Marie orders you all aboard the Monarch of the Sea for another Council of War.\n\n\n\"We are ready to take the fight to the enemy now,\" Anne-Marie declares with satisfaction. \"Commander Cuthrew has discovered a Lapau-occupied island to the Southeast so there we shall sail and destroy all the settlements we find there. We will kill all the male warriors and take the women and children prisoner. We must learn from them the locations of their islands and settlements so we can destroy them until they submit to our authority.\"\n\n\nThat evening the War Fleet weighs anchor and sails Southeast to war.", "action_results": [{"action": "To Battle", "result": "The War Fleet sails Southeast for three days and the island sighted by Cuthrew soon comes into sight: it is nothing more than a barren Hill with a few huts nestling on the top; like the Lapau settlement on Village Island it has been abandoned. Queen Anne-Marie summons all her officers to another Council of War, which irritates your companion Eva Freer.\n\n\n\"We might as well sleep in a corner of her cabin she gives us so many orders,\" she grumbles.\n\n\n\"I think it is likely that a Lapau fleet is waiting to fight us,\" Anne-Marie announces when you and the other officers have assembled. \"I intend to lure them into a trap of my own. I will send one or two ships ahead to locate the Lapau islands. If they are attacked they will withdraw back to here, meanwhile our Fleet will wait hidden from sight behind this island. If our decoy ship is pursued we will attack them and use musket and cannon fire to kill the Lapau before they can board us or use their spears... who is willing to be the decoy?\"\n\n\nThere is a moment of silence then Naomi Swift speaks up.\n\n\n\"Bermuda and myself can do it,\" she says and for some reason glances in your direction. \"Our crews are at full strength and our ships are undamaged and ready for action.\n\n\n\"Good. Excellent, the two of you shall sail directly South from here and try to lead any Lapau after you,\" Anne-Marie announces. \"Do any other Officers wish to join you?\"\n\n\nEva nudges your side. \"We should volunteer,\" she whispers.", "action_results": [{"action": "Offer to serve as a decoy alongside Swift and Mason", "result": "Your offer to be a decoy is gladly accepted and the next day the Adventurer, Explorer and Maverick all sail south. By the second day the Hill has faded from sight and a great mass of brown with patches of blue fill the horizon: hundreds and hundreds of canoes are sailing towards you, so many canoes in fact that they almost hide the sea from sight and each one contains a spear or bow-armed Lapau Native. Immediately you change direction and begin sailing back north towards the rest of the Fleet.\n\n\nUnfortunately the wind is against you and the canoes are faster.\n\n\nBy the third day the canoes have come within bow shot range and sailors in the stern fire muskets at them as the faster Lapau rain arrows down on you. The Barren Hill is back in sight and as you and your companions approach the other five ships of the War Fleet sail into sight. This doesn't seem to make the slightest impression on the Lapau, who if anything increase their efforts to catch up with your ships. For every Lapau your men shoot another ten overtake their fallen countryman to gain on you. Inevitably your enemies catch up to the Adventurer.\n\n\nAs well as bombarding your Crew with arrows Lapau warriors now stab their spears into your ship's hull below the waterline to try and sink it or threw their spears up at your crew. Three of your men have been killed and seawater is soon pouring into your ship from dozens of tiny holes stabbed below the waterline. The Explorer and Maverick are under similar attack and a chill goes through you as you see the Maverick list to starboard and start to sink.\n\n\n \n\nTrying to help her cousin Naomi Swift steers the Explorer towards the Maverick, driving straight through a vast crowd of canoes but the Maverick is sinking fast now. Though they are making good speed the rest of the War Fleet is still out of musket range though the Monarch of the Sea is firing her bow cannons.\n\n\n\"We should help them,\" Freer tells you, pointing at the sinking ship.", "action_results": [{"action": "Join Commander Swift in trying to rescue the Crew of the Maverick", "result": "Turning towards the Maverick in a sudden burst of speed you push the Adventurer as fast as she will go to try to reach her in time. Before you can get their the ship's deck suddenly slips below the waves leaving a crazy wreckage of wooden debris, swimming men and dozens of canoes. The crew never have a chance: the Lapau stab and hack mercilessly at them in the water and though your men fire a volley of musket shots it only serves to make you a target. The ocean is soon red with blood and floating bodies.\n\n\nThe destruction of the Maverick does at least draw attention away from the Explorer and though taking on water she is able to win her way clear of most of the canoes. Under heavy arrow fire which kills three of your Crew and wound more you turn the Adventurer around and use her to try and protect the damaged ship.with your own vessel. Finally the rest of the War Fleet join the battle and sailing between the Royal Escort and Merry Company you finally reach safety. Joining the rest of the Fleet both you and Naomi Swift turn your ships around to join the advance: like every other Sailor on the Fleet you want revenge for the loss of the Maverick.", "action_results": [{"action": "No Mercy", "result": "The disciplined line of the seven ships of the War Fleet bear down on the hundreds of canoes and the Lapau simply aren't strong enough to overwhelm the prepared and disciplined fire of the Fleet, it's sailors fired up by anger at witnessing the slaughter of Commander Bermuda Mason and her Crew. Over one hundred musket shots cuts down the canoes and as the Lapau flotilla breaks in two to try to outflank and surround the Fleet Anne-Marie orders the ships to drop anchor. More musket volleys decimate the Lapau trying to sail around the Fleet and with a trumpet blast the signal to retreat is given. With at least half their number slaughtered and hundreds of Lapau lying dead or dying in their boats or in the sea the survivors retreat amidst the mocking cheers of your countrymen.\n\n\nCanoes and corpses lie in every direction, the greater part of the Lapau flotilla has been destroyed and there is a real feeling that this victory has given your Fleet the advantage in this War but the casualties have been heavy. Fifty sailors have been killed: all the crew of the Maverick as well as a dozen sailors aboard the Explorer and other casualties throughout the Fleet. Bermuda Mason's mutilated body is fished from the water and her cousin Naomi Swift, who was herself hit in the left arm by an arrow is almost inconsolable with grief. At the Council of War aboard the Monarch of the Sea following the battle she sits shaking like a leaf with tears flooding silently down her face.\n\n\n\"We have lost half our strength so far in this expedition but we have no intention of giving up,\" Anne-Marie declares. \"The power of the Lapau has been broken. From wounded prisoners recovered from the water by Commander Cuthrew we have learnt where the Lapau settlements are: they control a string of nine islands in these waters, two of which we have already secured. It seems this Fleet was a gathering of all the Lapau's strength, we will never again face such odds as we did here today.\"\n\n\nAnne-Marie produces a hastily-drawn map. \"Our prisoners inform us that the closest two islands lie south of here. We will proceed in that direction at once. I believe destroying their settlements and capturing their women and children is the best way to force the Lapau to submit and recognize our authority. We will not give up this War until we have forced them to submit or the deaths of our sailors and Commanders Trevers and Mason will count for nothing.\"\n\n\nGrimly the battered Fleet continues south.", "action_results": [{"action": "Onwards", "result": "Continuing south you soon sight a small island covered in thick forest. At least one hundred canoes leave the island traveling south carrying what is clearly the island's population: they easily outrace your much slower ships. With a telescope you can see a few Lapau still moving about onshore so clearly the island has not been completely abandoned. Anchoring offshore Anne-Marie holds another Council of War to discuss the situation.\n\n\n\"There is no question: we must take this island,\" Anne-Marie declares. \"Our prisoners tell us the next island lies to the Southeast. To save time I will take Commanders Hale and Quarrel to capture that place while Commander Cuthrew will co-ordinate Commanders Finch and Swift to secure this island. We will then rendezvous off this island to continue our voyage south. Commander Trapa, you may join whichever half of the Fleet you think would most benefit from your assistance.", "action_results": [{"action": "Join Anne-Marie, Hale and Quarrel in sailing east to take the further island", "result": "Parting ways with the Sea Ghost, Royal Escort and Explorer you glide across the sparkling waves with your three companions until you come upon a tropical island, very similar to the previous with a village of huts by the shore. There are no canoes in sight but with a telescope you can see a few Lapau warriors moving near the shoreline. You, Freer, Hale and Quarrel join Anne-Marie in her cabin as she lays out her battle plan.\n\n\n\"We will waste no time with reconnaissance but will land immediately and kill every Lapau warrior we see,\" she declares. \"This Fleet cannot spare the food needed to feed prisoners. Me and Commander Quarrel will land with our crews while Commanders Hale and Freer will remain about the ships to ensure no Lapau escape by sea. I intend to conquer this island swiftly and then rejoin the rest of our fleet. Commander Trapa, you may accompany the land or sea force as you prefer.\"", "action_results": [{"action": "Join the land assault with Anne-Marie and Quarrel", "result": "Immediately after the Council you, Anne-Marie and Quarrel land your Crews on the southern edge of the island, quickly forming a line of soldiers on the beach with muskets held ready. Together you advance cautiously towards the village, it is eerily quiet. The Warriors you saw earlier have vanished into the jungle. Taking possession of the unoccupied village you reluctantly advance together into the jungle to secure the island.\n\n\nYou have not gone far into the thicket when one of your men suddenly yells a warning and fires his musket. A dozen armed warriors spring from the undergrowth, throwing their spears. An explosion of musket fire booms out and the warriors are cut down. \"Kill them,\" Anne-Marie shouts and your sailors run wild, stabbing the warriors to death. A few of your men have been mortally wounded by spears, as have a few of Anne-Marie and Quarrel's crew but the island has been taken.\n\n\nWhen the slaughter is over Anne-Marie leads you all back to the village. \"It seems the Lapau evacuated the island and left these men as a rearguard,\" she muses to you and Quarrel. \"They may be gathering their strength for another attack. We will rejoin the rest of the fleet - in honor of my loyal companion Commander Quarrel I will name this Quarrel Island.\" Quarrel drops down on one knee and with an extravagant gesture kisses Anne-Marie's hand. You turn away in disgust. By that evening you are under sail and on your way to rejoin the rest of the Fleet.", "action_results": [{"action": "Reunion", "result": "The two halves of the Fleet reunite off Forrest Island, both having been successful in their efforts to capture Forrest Island and Quarrel Island. On both small bands of Lapau Warriors waited to ambush the invaders, apparently having been left there solely for that purpose. All the Lapau were killed along with about a dozen of your countrymen altogether and Anne-Marie's feeling at her latest Council of War is that the Lapau are gathering their remaining strength to continue opposing you.\n\n\n\"According to Commander Cuthrew's prisoners there still remain five Lapau islands ahead and the closest is a mountain of snow due south of here. Although we have been reduced to seven ships and less than half our manpower the Fleet is still in good condition and we will make for this snow mountain. However low supplies is starting to become an issue and we need to obtain more if we are to continue safely. Commander Hale believes she has a partial answer to our problem.\"\n\n\nHale clears her throat and speaks. \"During my voyage around the world me and my Crew landed on a snow-covered island which was populated by many penguins which we hunted and used to replenish our food stores. If we sail southwest we should encounter this snowy island where we can hunt and bring back lots of food for the rest of the fleet. After that by turning east should be able to rendezvous with the War Fleet near this snowy mountain.\"\n\n\nAnne-Marie nods. \"Very well, any ships who wish to can accompany you.\" Commander Swift volunteers to accompany Hale but everyone else opts to remain with the War Fleet.\n\n\n ", "action_results": [{"action": "Sail Southwest with Hale and Swift to hunt penguins", "result": "Breaking off from the rest of the Fleet, the Adventurer, Merry Company and Explorer sail Southwest. You notice the temperature drop the further south you can go but despite the decreasing voyage this is a pleasant part of the voyage because every evening you have Esme Hale, Naomi Swift and Taylor Freer join you in your cabin for dinner. The three attractive adventurers are good company but you can't help noticing Swift seems to glance at you a lot when she thinks you aren't looking. One evening Hale takes you to one side with a smile.\n\n\n\"You know I think Commander Swift might like you,\" she tells you. You laugh but Hale shakes her head. \"No, it's true. Clever ladies like me can tell these things. And another thing, is it just me or do you seem just a little sweet on Eva Freer?\"\n\n\nFor some reason you don't feel like laughing anymore. \"I don't know what you mean.\"\n\n\nHale shrugs. \"I'll tell you another secret too, my island is a bit further south than I might have led Anne-Marie to believe. I just wanted to get away from her, Quarrel and the others for a while. We'll change our course due South now and should arrive there in a few days.\"\n\n\nAdjusting course you glide on towards your destination.", "action_results": [{"action": "The Land of the Penguins", "result": "As particles of snow drift through the air a snowy island comes into sight. \"This is it,\" Hale declares triumphantly and in a great hurry you go ashore but it quickly becomes clear something is very wrong. Hundreds of penguins lie all across the island, all slain by arrows or spears: clear evidence that the Lapau have been here and recently to destroy any possible food supplies for your Fleet. Fortunately because the low temperature has frozen the meat much of it is still edible and you are able to replenish some of the Food you have consumed so far in this voyage but the butchery of the penguins is a bitter blow when you were relying on their meat. Leaving the island behind you sail due East to report the bad news to Anne-Marie.", "action_results": [{"action": "The Snow Mountain", "result": "When the two halves of the War Fleet rejoin beneath the icy pinnacle of a great Snow Mountain there is bad news on both sides. Anne-Marie's half of the Fleet were attacked by Lapau warriors who braved the icy waters to swim out and ambush the ships, killing a dozen sailors throughout the Fleet before being repulsed. Hale's expedition successfully rediscovered the island she had visited previously only to find Lapau had already slaughtered the penguin population. Some of the frozen meat is still edible and is distributed throughout the Fleet but the War Fleet as a whole is now facing serious supply and manpower shortages.\n\n\n\"The Lapau appear to be conducting a scorched earth policy,\" Anne-Marie declares, \"whittling down our numbers with ambushes while stripping the islands ahead of all edible foods and supplies. Only four hostile islands remain ahead so if we move as fast as we can we can still conquer and subdue these remaining islands and reach our nearest supply cache on the Corral Cabin Island before this Fleet is destroyed. But we will prevail!\"\n\n\nAnne-Marie pauses. \"According to Commander Cuthrew's prisoners a triangle of three islands lie before us. To the Southwest is a small tropical island and to the Southeast is a low rocky island, both are just a few days sail away. About a week's voyage directly south is a Corral Mountain, this will be our rendezvous point. I am dividing the Fleet again: Commander Cuthrew will take Commanders Hale and Swift Southwest to attack the tropical island while I shall take Commanders Finch and Quarrel Southeast to attack the rocky island. We will rendezvous at the Corral Mountain directly south of here. Officers: be wary of ambushes. The Lapau are withdrawing south, gathering their strength as they go and they surely intend to weaken us further before destroying us in one final attack so be careful! Commander Trapa, you can accompany whichever force you prefer.", "action_results": [{"action": "Join Cuthrew, Hale and Swift in attacking the tropical island", "result": "Once again the fleet divides and you sail Southwest towards the tropical island. It soon comes into sight and as expected it appears deserted. One unusual thing is noticeable though: a burnt wreck of a ship lies sunk just offshore.Startled you recognize her as the Hope, a vessel commanded by a trader called Ann Lovett, one of your rival competitors during The Great Race to circumnavigate Magellan. She vanished during the voyage and from the looks of it she stumbled upon the Lapau who killed her and burnt her ship.\n\n\nCuthrew looks as weary as ever as you Hale, Swift and Freer join him in his cabin aboard the Sea Ghost. \"Commanders Hale and Swift, you will take your crews ashore to ensure this island is unoccupied. Be wary of ambushes and if you can see if you can discover some trace of what befell Captain Lovett and her crew. Commander Freer and myself will remain offshore. Commander Trapa, you may accompany who you choose.\"", "action_results": [{"action": "Join the landing party", "result": "Going ashore you and your Crew together with Hale and Swift advance cautiously across the beach towards the village. You expect an ambush to come from the jungle but when it does it comes in an astonishing form: musket shots ring out knocking down several men including three of yours. Naomi Swift is hit in the right leg and falls to the ground near you. \"Return fire,\" you shout as a musket ball whizzes past your head and your men fire a return volley. \"Reload, reload,\" you shout but as you do you see a dozen figures fleeing from the trees. You and Hale lead your crews in pursuit but they dive into the sea. Using bamboo tubes lashed together with grass as breathing tubes they vanish under the waves and escape.\n\n\nYou are startled by the evolving tactics of your adversary and have suffered more casualties in securing another island. Naomi Swift's wound is serious and she is unable to walk. Taken back aboard the Explorer she has the musket ball removed. In agony with pain and confined to her bunk she is unable to command her ship so Eva Freer assumes temporary command, you feel a strange and painful twinge in your chest as she leaves your ship. Convincing yourself it is only because you have become to used to seeing her every day you obey Cuthrew's orders to weigh anchor and steer the Adventurer Southeast towards the rendezvous. By now the hold is almost bare of provisions.", "action_results": [{"action": "The expedition continues", "result": "When the War Fleet reunites in the shadow of The Corral Mountain there is much news to share, most of it's bad. Cuthrew's expedition captured the island but were attacked by musket-wielding Lapau which suggests that somehow the Lapau have gotten ahold of some of your countrymen's weapons and learnt how to use them. Anne-Marie's expedition also succeeded in capturing the island after some fierce cave-based fighting. Casualties are high now: Naomi Swift has been shot through the leg and can't walk forcing Eva Freer to take command of the Explorer while Thomas Finch has been speared through the arm and is also in great pain. The Fleet is down to just over one hundred men, a third of it's starting strength, and only has enough food left for another week or so.\n\n\nThe sight of The Corral Mountain also causes your sprits to plunge. The Lapau seem to have finally dug in, fortifying themselves on the Mountain's steep slopes and hundreds of warriors are moving among the natural cover of the corral crags. The Mountain is so tall you cannot even elevate your ship's cannons to fire more than a quarter of the way up the slope and an assault by your sailors, even with covering musket fire, will surely trigger a rain of spears and arrows from above. Despite it all Anne-Marie remains confident.\n\n\n\"The Lapau have clearly gathered their last remaining strength here to fortify this place,\" she announces. \"After we capture this place they have only one more island to shelter in, one more bolt hole. Once we take this Mountain an end to the war is in sight. This mountain must be taken in one assault, one swift charge to overrun their position. My Commanders, you have all fought with tremendous ability and courage so far in this voyage, now I ask who will lead this attack?\"\n\n\nShe looks round at her officers, at Naomi Swift who has her arm in a sling and her leg in bandages and had to be hauled aboard the Monarch of the Sea in a canvas bag to attend this council, at Thomas Finch who also has his arm in a sling and at Esme Hale and Eva Freer who have also been wounded so far in this voyage. The sycophantic Richard Quarrel remains silent and finally it is the ailing and grey-bearded Tobias Cuthrew who speaks.\n\n\n\"My Crew is the strongest of those that remain,\" he declares. \"If this mountain must be taken then I will lead the attack.\"\n\n\nAnne-Marie looks at her deputy with great respect. \"One half of our men must advance up the Mountain while the other half give them covering fire. Who else will charge these slopes?\"\n\n\n\"If it shortens this war and saves our lives me and my Crew will advance though I'd rather do anything other than this,\" Hale says reluctantly.\n\n\n\"I will go too,\" Freer announces. \"I don't expect this assault will succeed unless I am there.\"\n\n\nYou feel a sudden jolt inside you as you realize the tomboyish adventuress who you have grown so close to will deliberately be putting herself in harm's way.\n\n\n\"Is there no one else?\" Anne-Marie asks glancing pointedly at Quarrel who looks at", "action_results": [{"action": "Volunteer to join the assault on the slopes", "result": "At dusk you, Tobias Cuthrew, Esme Hale and Eva Freer and your Crews row ashore amidst a hail of spears. Moving with a speed you did not think you were capable of you scramble up the steep slope. Muskets flash behind you as Anne-Marie, Thomas Finch and Richard Quarrel lead the second wave ashore to give you covering fire. A spear plunges down in front of you and chunks of corral break off in your hands as you scramble up the steepest parts of the slope on all fours. All around you men are falling screaming and as some Lapau begin firing muskets the assault grounds to a halt, sailors seeking shelter in whatever cover they can find.\n\n\nSeeing that the assault has halted Esme Hale springs to her feet and stands tall amidst the storm of flying spears and musket balls. \"Come on my boys,\" she shouts. \"Let's take the top!\" A moment later a spear strikes her full in the center of her chest, the bloodied point emerging from her back. Time seems to stand still as she falls slowly backwards, her body skidding down the mountainside. There seems to be a moment of stunned silence and then with a collective roar of rage sailors spring to their feet.\n\n\nIf anything could have electrified you and your countrymen it was the death of the most popular officer in the Fleet. Screaming with rage like the rest of your countrymen you can think of nothing but getting up the mountain and tearing apart with your bare hands the men who have murdered your friend. Eva Freer is springing up the slope ahead of you when she spins on the spot and goes down: shot through the right shoulder. You falter momentarily to check she is ok but she has fallen behind the shelter of a rock and impatiently gestures for you to get moving.\n\n\nA musket ball knocks your sword flying from your hand and bare-handed you spring on up the slope. Incredibly, despite his age, Cuthrew is ahead of you and he leads his sailors in slaughtering the Lapau warriors. As they flee from their positions they are pursued and butchered without mercy by the vengeful sailors. With the Mountain won and sickened by the sight of the slaughter you turn away and stagger down the slope to where Hale is lying motionless on her back, her eyes staring sightlessly at the sky.\n\n\n\"We can't do anything for her,\" a voice tells you nearby and you see Freer is dragging herself over, trailing blood. The sight of Freer immediately drives other thoughts from your mind and against her protests you hurry over and lift her up in your hands. You carry her down to where the wounded are gathering on the shore near a beaming Anne-Marie who stares up at the mountain top where Cuthrew has ordered your country's banner to be raised.\n\n\n\"Now we have won this War,\" she tells you triumphantly.\n\n\n\"Esme Hale is dead,\" you tell her bluntly. \"So I couldn't care less.\"\n\n\nAnne-Marie stares at you as you walk past her and carry Freer to the safety of a boat back to the Adventurer. Casualties are remarkably light and only three of your Crew have been killed in the fighting, though many more are injured.", "action_results": [{"action": "A Friend's Funeral", "result": "That night the mood aboard the Fleet is mutinous as the bodies of those who died during the day's battle are consigned to the deep. Only twenty or so men died but three quarters of those who sailed with the Fleet are now dead. When Esme Hale's body, still beautiful in death, is dropped into the ocean a fierce outcry goes up, many men are crying and cries of \"murderer\" and \"tyrant\" are shouted at Anne-Marie. Quarrel tries to calm the crowd but someone fires a musket at him which fortunately (for him) wasn't loaded. Taking the hint Anne-Marie retreats to her cabin with you and her other remaining officers.\n\n\nHere the mood is scarcely better. Eva Freer and Naomi Swift are staring at her with real hatred, white-faced from the pain of their wounds. Thomas Finch is sitting to one side grimly staring out of a window. Even Richard Quarrel seems to have nothing to say as he nervously fidgets with a ring in his hands. It falls to Tobias Cuthrew, white-bearded like Old Father Time and with his face still blackened from musket smoke to say what you are all thinking.\n\n\n\"My Queen three of us are now dead and three of us wounded. This Fleet has lost three ships, has less than a week's worth of food and has lost three quarters of it's men. One more battle will destroy this Fleet. If you keep going this Fleet will come apart. You must seek terms with the Lapau.\"\n\n\n\"Who are you to talk to your Queen like this?\" Anne-Marie snaps. \"We will keep going until the Lapau surrender. We have not come this far and suffered so much to roll over and beg when we are on the verge of victory.\"\n\n\n\"No we will not,\" you tell her quietly and look up at her. \"Will you continue until we are all dead? If you do not seek terms of peace when we arrive at the Lapau's last island then all will be well. But me and my Crew will not fight.\"\n\n\n\"Mine neither,\" Freer says. \"Nor mine,\" Swift adds. \"I am finished fighting,\" Finch agrees. Quarrel glances round the group looking like a rat caught in a trap and quickly shakes his head. \"Queen, you have heard your officers,\" Cuthrew says quietly.\n\n\n\"You fools,\" Anne-Marie says with icy venom. \"None of you appreciate what I am trying to do. I am establishing an empire that will last for hundreds of years to come. What are a few lives now compared to greatness in the future? Safety and security cost lives: if we do not take lands the Lapau will take them and one day be so numerous they sill snuff us out like a finger crushes an ant! Do you want to see our small Kingdom of Three Islands surrounded by vicious war-loving Lapau? I know the road is difficult and we will lose many friends on the way but we must be strong! One more week, that is all I ask.\"\n\n\n\"My Queen, you must realize not everyone is like you,\" Freer tells her.\n\n\nThe next morning you sail south from the scene of such terrible fighting.", "action_results": [{"action": "The Homeland of the Lapau", "result": "Starving and short-handed the War Fleet limps on. Perhaps as a bribe Anne-Marie places Eva Freer in command of Hale's ship Merry Company where mutiny is thickest. Freer promptly changes the ship's name to Esme's Joy and despite moving with a painful limp she provides the perfect leadership the five remaining sailors on that ship need, telling them their only chance is to get home alive is to keep heading south and reminding them they are approaching waters she and they have sailed before. Naomi Swift has herself carried up in a chair to the quarterdeck of the Explorer to resume command of her ship.\n\n\nFinally you reach the last island of the Lapau, their Capital which they call Matan. A terrible sight awaits you: hundreds of canoes wait silently before the island filled with warriors ready for one last battle to save their homeland. Anne-Marie remains out of sight in her cabin as to the relief of you and every sailor on the ship Commander Quarrel and a few sailors row a boat towards the waiting fleet waving a white flag. A canoe so big it holds a dozen warriors comes out to meet him and accompanies him back to the Monarch of the Sea. You and the other officers hurry aboard to meet your adversaries.\n\n\nThe first Lapau aboard after Quarrel is a blond-haired lady who looks vaguely familiar to you. She is followed by a handsome young man in war paint and a grey-haired tough old warrior whose bare chest is covered in old scars. Anne-Marie has finally emerged from her cabin in her finest clothes and waits surrounded by you and her other officers. The blond-haired woman's eyes take in Finch, Swift and Freer's wounds before her eyes settle on Anne-Marie.\n\n\n\"Greetings to you Queen Anne-Marie,\" she says, speaking your language perfectly. \"I am Ann Lovett, formerly Captain of the Hope and now honored to serve the Royal House of the Lapau.\"\n\n\nYou start, as does Anne-Marie and Cuthrew. The three of you recognize her as one of your fellow rivals in The Great Race to sail around the world of Magellan some five months ago. She was presumed lost but now it seems she has been found and adopted by the Lapau.\n\n\n\"I have come here to translate the words of Al-Capu, King of the Lapau and of his son Al-Balu,\" she says gesturing to the tough old warrior and his handsome son. The King of the Lapau speaks in the deep ponderous tones of his people while Lovett provides a translation.\n\n\n\"Al-Capu knows your heart Queen. He is tired of fighting. Many of his warriors are killed. You have taken all his villages and all his lands but Matan. Al-Capu is tired of the war you have waged upon him and his heart is sad. If you leave him in peace he will fight with you no more.\"\n\n\n\"Al-Capu promises not to attack our islands if we do not attack his?\" Anne-Marie asks.\n\n\n\"It was never the intention of Al-Capu to harrass your colonies,\" Lovett replies. \"Those were the actions of ambitious petty chiefs and young warriors. If you leave the Lapau alone they will leave you alone.\"\n\n\n\"That is not enough,\" Anne-Marie replies. \"I too have lost too many warriors. We demand land as recompense.\"\n\n\nAl-Capu considers this when Lovett translates and gestures to his fleet of canoes.\n\n\n\"If they fight with you perhaps you will win or perhaps the Lapau will triumph,\" Lovett translates. \"Either way many will die and both of us will lose. But if you sail away we will have a lasting peace which will be sweeter than any victory in battle. Trade routes can be established and our people can learn much from each other.\"\n\n\nAnne-Marie tries one last time. \"Your warriors attacked our Fleet without warning when we first visited you in peace,\" she insists. \"We deserve something at least for that.\"\n\n\nAl-Capu and Al-Balu talk rapidly among themselves for some time before Lovett what they say.\n\n\n\"Prince Al-Balu was leading his annual tour of his kingdom with his escort when he learned of your ships off his father's lands. Perhaps his attack on you was over hasty but he feared you meant to attack his father's lands. To ensure a lasting peace between our two peoples King Al-Capu will give his son Al-Balu and myself to you as hostages to live for one year and will now provide your Fleet with food to help you return to your own lands. In this way we hope to ensure a lasting peace.\"\n\n\nAnne-Marie hesitates, glances around at the unfriendly faces of you and her other Commanders and finally nods and sighs.\n\n\n\"Let it be so.\"", "action_results": [{"action": "Matan", "result": "When news that peace has been agreed spreads throughout the War Fleet the cheering is continous and quickly prompts Anne-Marie to retreat to her cabin, quickly followed by Quarrel. Ann Lovett remains aboard the ship and chats affably with you and Cuthrew while Prince Al-Balu stands awkwardly by while his father returns to Matan to tell his own people of the peace agreement. The Lapau break into song, stamp their feet and wave their spears and within an hour dozens of canoes are speeding out from the island, conveying welcome supplies to the Fleet. All the food the Lapau took from their islands has been gathered here and is swiftly shared out among the ships of the Fleet. You make sure the Adventurer receives as much food as her holds can contain.\n\n\nAnne-Marie emerges from her cabin that afternoon and using the shaky premise of her hostages and the food delivery claims this war has ended in victory while Lovett later tells you in private the Lapau regard it as a victory because the War Fleet is leaving their lands never to return and a lasting peace has been established - despite their fierce appearence Lovett insists, slightly unconvincingly, that the Lapau are basically a peaceful people. Either way no one seems to have won in this war which has cost many good lives, foremost among them Donald Trevers, Bermuda Mason and Esme Hale.\n\n\nThat evening over a dinner aboard the Monarch of the Sea Lovett tells how she was captured by the Lapau on the tropical island where Swift was shot and kept by the Lapau so they could learn about your culture. The next morning the War Fleet is resupplied and ready to return to The Kingdom of the Three Islands and Anne-Marie summons you and the other officers aboard her ship for one last Council.\n\n\n\"The voyage home is safe,\" she announces. \"The waters south and west of here are mostly known to us and it will take approximately two weeks to return to Golden Sands. I propose that the Fleet splits up and returns to The Three Islands on separate to ensure we explore this area as much as possible, the first of us to bring his ship safely home will have the honor of bringing news of our success to our people. I recommend following a Southwest course for one week and then turning South but I have absolute trust in your skills.\"\n\n\nAfter such a long voyage you have little enthusiasm for more risks but as you are leaving the cabin Naomi Swift hobbles after you awkwardly on crutches. \"Cleo?\" she calls out to you. \"There is something I would like to talk to you about. Can you please sail South of here so no one else is around and I can come aboard the Adventurer and have a private talk with you?\" Wondering what the talk could be about you give a non-committal answer. Returning aboard the Adventurer you watch the War Fleet start to break up as it leaves Matan and most of the ships turn Southwest except for the Explorer and Freer's Esme's Joy which turn South.", "action_results": [{"action": "Sail Southwards to talk to Swift", "result": "Traveling south across the sparkling water you are pleased to have finally escaped Anne-Marie's dictatorial command and you soon catch up with the Explorer and Esme's Joy and pull alongside so their Commanders can join you for dinner. Naomi and Eva come aboard looking like the outpatients of a hospital: Eva is still limping and Naomi still needs crutches to get about but all of you are glad the voyage is nearly over.\n\n\n\"We should not have gone so far,\" Eva says firmly. \"Queen Anne-Marie is a tyrant.\"\n\n\nYou are captivated by the attractive tomboy's conversation throughout the dinner and it is only when the meal is over that you realize Naomi has hardly said a word. When you ask if she is ok she nods distractedly. Later when Eva has returned to her ship Naomi hangs back waiting nervously. When you open your mouth to ask her what is wrong the strong-willed adventuress suddenly hobbles closer and kisses you wion the mouth!\n\n\n\"I care for you and you care for Eva so that is that,\" she declares suddenly pulling away. \"After Bermuda died I thought I would never know happiness again and then I got to know you! I just wanted you to know how much I cared and how I know we can never be together.\" She turns and hobbles out of the room leaving you stunned. It takes you a minute or two to recover your wits and follow her out onto deck but she has already left. You hear someone call your name and turn startled to find Eva is still on board the Adventurer.\n\n\n\"Are you alright Leo?\" she asks you looking amused. \"You look shaken.\"\n\n\n\"Naomi... er\" you mumble trying to work out how to phrase this.\n\n\n\"Kissed you did she?\" Eva asks, still with that mocking grin. \"I thought she might. She looked like she wanted to. Did you tell her you didn't care for her because you were so in love with me?\"\n\n\n\"Eva!\" you exclaim. Everyone seems to know your own heart better than you!\n\n\n\"Isn't it obvious?\" Eva asks. \"You probably haven't even noticed but most everything you do is with one eye on my reaction. You're a good friend Leo but let's not get stupid about things alright?\"\n\n\nWith that she turns and walks away towards the gangplank back to her ship leaving you standing open-mouthed on the deck. Later during a sleepless night you reflect on what you have learned tonight and realize that perhaps during the voyage you could have been a little kinder towards Naomi.By dawn there is no sign of the Explorer or Esme's Joy so you turn the Adventurer Southwest towards the Northern Passage and home.", "action_results": [{"action": "Food for Thought", "result": "As the Adventurer skims across the sparkling water you notice pieces of corral floating in the sea occasionally, a sure sign you are approaching The Great Reef and your homeland! You also haul something even more unusual from the ocean: a net full of struggling fish! The net must have been lost by a fishing vessel somewhere nearby, surely belonging to one of your countrymen. Your men are thrilled and enjoy a fish fry as well as outfitting the Adventurer with enough food for several days but you reflect bitterly there were times in the past when this food would have been much more welcome rather than now when you have plenty to eat. Continuing Southwest you finally arrive at The Northern Passage.", "action_results": [{"action": "The Northern Passage", "result": "You feel a great sense of relief as you sail through the narrow breach in The Great Reef called The Northern Passage, the real border of your homeland, The Three Islands.On your last voyage you were attacked by a treacherous Captain as you sail in the opposite direction but that man is now dead and this is your gateway home. On the Reef a small watchtower has been built and if you want you can halt here and request supplies, alternatively two of your home islands Amethyst and Onyx lie to the Southwest and Southeast respectively.", "action_results": [{"action": "Stop and request supplies", "result": "Dropping anchor you go ashore to be greeted by the men at the watchtower.\n\n\n\"Fleet's returning home then?\" one asks cheerfully. \"Where's the rest of you?\"\n\n\n\"We're some of it,\" you tell him wearily. \"What's left of the rest is coming along soon.\"\n\n\n\"Many new lands been conquered?\" the man asks, determined to be cheerful.\n\n\n\"None. We have got two new friends thought.\"\n\n\nThe man frowns. \"What happened on this voyage Commander Trapa?\"\n\n\n\"You'll soon find out when Anne-Marie tells you all,\" you tell him wearily. \"Please load what supplies you can aboard my ship.\"\n\n\nWith fresh supplies on board you sail on.", "action_results": [{"action": "Southwest to Amethyst", "result": "It is nice to see Amethyst again, a busy little port that builds ships for your country. Your arrival provokes a surge of activity along the waterfront but anchoring offshore you do not visit the island; so close to home and with ample provisions you have no intention to stop and meet the widows of your sailors who are not returning on the quay. The next morning a gentle breeze fills your sails and turning Southeast you continue on towards Golden Sands and home.", "action_results": [{"action": "Going home", "result": "Finally as the beautiful shores of Golden Sands come into sight you feel an indescribable relief at coming home tempered with the grim certainty that in the future you will have to embark on more dangerous and difficult voyages into the unknown. You have made good time but are you the first Commander of the War Fleet to bring their ship back to Golden Sands?", "action_results": [{"action": "Click here to find out", "result": "Swift and speedy throughout the voyage it is no surprise that you and the Adventurer are the first to return to Golden Sands. A silent crowd waits on the quay as you descend as you go ashore and putting the best possible spin on the War declare that the War Fleet has been victorious in eight out of nine battles and skirmishes with the Lapau earning valuable hostages and recognition of trade routes and national boundaries. The people cheer as you mutter in an unheard undertone that over two hundred of the Fleet's sailors lost their lives including three of the Fleet's most likable officers. Over the next few days Anne-Marie and the others return until within a week all the surviving ships of the War Fleet are back in Golden Sands.\n\n\nYou have earned 1 Score Point.", "action_results": [{"action": "And at the end...", "result": "When the last ship (Captain Quarrel's Indefatigable) has returned to Golden Sands on Day 85 Anne-Marie gives a victory feast in honor of all the survivors of the War Fleet. Fresh promotions are conferred: Ann Lovett and Prince Al-Balu are given the honorary rank of Commander while you, Finch, Swift, Freer, Quarrel, Cuthrew and Anne-Marie herself are all promoted to the rank of Commodore. As a Commodore with royal approval all of you can now independently command fleets of ships.\n\n\nAt the Victory Feast Anne-Marie spends most of her time talking to Lovett and Al-Balu leaving you free to make awkward but stilted conversation with Swift, Freer and Cuthrew, the memory of your rebellion against Anne-Marie on the high seas still fresh in your minds. Cuthrew is unusually talkative.\n\n\n\"I have been talking to Prince Al-Balu with Commander Lovett's assistance,\" he tells you all in an undertone. \"It seems the Lapau and ourselves are not the only great civilization in these waters. There is apparently a third, a nation the Lapau claim are also armed with muskets and appear as technologically advanced as ourselves.\"\n\n\n\"Well no doubt Anne-Marie won't rest until they are all dead,\" you comment bitterly.\n\n\nCuthrew sighs. \"That's the problem with exploration Leo,\" he tells you. \"It is like opening a door at a zoo where you only get to find out what animal is inside the room after you've opened the door permanently. If you are not lucky the animal might prove to be much stronger than you.\"\n\n\nHe glances nervously at Anne-Marie and suddenly hisses. \"Don't trust that woman for a moment. She means to have the whole world of Magellan by force or not at all. The time for peaceful sailors like me are passing.\"\n\n\n\"What's all the whispering about?\" Anne-Marie asks suddenly. \"We should be cheerful for we return victorious. You must not become too comfortable though! My friend Saphia Dancer informs me that voyages to the west have uncovered some interesting communications with a previously unknown nation. More uncharted waters await for us to explore! Enjoy your rest now my officers for you have earned it but I expect I will be needing your services again very soon.\"\n\n\nYou roll your eyes and glance across the table. Eva Freer is staring at Anne-Marie with such venom that if looks could kill Anne-Marie would be dead already. Looking away you meet the eyes of Naomi Swift who is watching you sadly. She glances away briefly then looks back and smiles. Raising her fingers to her lips she kisses them softly, reaches across the table and takes your cold hand in her warm one. Your grip tightens as you realize in the future you will need the help of friends like her and Eva more than ever now that Esme is gone.\n\n\nFor it is certain that very soon you and the crew of the Adventurer will sail again...", "action_results": []}]}]}]}, {"action": "Southeast to Onyx", "result": "Reaching the peaceful little agricultural island of Onyx for some reason you feel strangely guilty that you have survived to return home when so many of your men didn't. It feels strange spending a night peacefully at anchor offshore without having to worry about spear-armed blood-thirsty warriors climbing aboard and killing everyone they find. The next morning you raise the anchor without landing and turn Southwest towards Golden Sands and home.", "action_results": [null]}]}, null, null]}]}]}, {"action": "Follow the rest of the Fleet Southwest", "result": "Sailing Southwest you keep most of the rest of the War Fleet in sight for a few days until most of them slip but of sight. The only one still in sight when you sight a low sandy island after a few days is Anne-Marie's Monarch of the Sea. She gives the island an extremely wide berth before continuing her voyage to the Southwest. Coming closer you see the island is completely bare except for several ominous-looking wooden crosses sticking up out of the sand.", "action_results": [{"action": "Spend a day landing to investigate these crosses", "result": "Dropping anchor you lead a party of sailors ashore to investigate the strange crosses. Almost immediately you learn you have made a dangerous mistake: you and your companions plunge through the sand into a thick gloop lying just beneath the surface! You and most of your companions struggle out but three of your men are sucked beneath the sands never to be seen again. Cursing bitterly to have lost men after the fighting has ended you return to the Adventurer and continue on Southwest.", "action_results": [{"action": "Corral Cabin", "result": "As the Adventurer glides across the blue expanse of the ocean a familiar shape comes into sight: a stack of corral jutting up from the sea with a small cabin perched atop it, the flag of The Three Islands dancing in the breeze above it. This is the first colony founded by your people beyond the Great Reef and you know for a fact that the cabin atop it is permanently manned by four of your countrymen who will almost certainly have a surplus of food. They also guard a small book inside the cabin which is signed by the Captain of every ship that sails by, if you wanted you could land here and pick up more supplies.", "action_results": [{"action": "Spend a day landing at the Corral Cabin", "result": "Anchoring off the Corral Cabin you go ashore and are met by the four settlers there, all anxious to hear about your adventures. You give them a brief account before going inside the Cabin itself while the settlers transport surplus food to your ship. You glance through the book on the table which was originally the idea of a Captain called John Dancer to record the names of all those who sailed into the great unknown. Flicking to the front page you find some familiar signatures of Captains who raced against you during The Great Race: Dancer himself, Anne-Marie back when she was still a Princess, Esme Hale (that signature causes a painful pang), Rosemary Cleaver and Jack Spratt. Apart from Anne-Marie all those Captains are dead now. Feeling somewhat saddened you return to your ship and continue south.", "action_results": [null]}, null]}]}, null]}]}]}]}]}, {"action": "Remain below to provide covering fire", "result": "You elect to be among those who stay at the base of the mountain and provide covering fire. At dusk the assault begins with Tobias Cuthrew, Esme Hale and Eva Freer leading the first wave of attackers ashore while you, Anne-Marie, Thomas Finch and Richard Quarrel lead the second wave to provide covering fire. Your Crew spread out to form a line at the base of the mountain but your men are in almost as much danger as those charging up the slope as spears rain down by the hundreds, musket balls blast sailors's skulls to pieces and occasionally countrymen fall from the steep slopes above, breaking their bodies on the sharp corral.\n\n\nIt is a terrible sight and you see your countrymen charging up the slope halt and begin to waver and for a terrible moment you are certain that this attack will be thrown back. At that moment a figure you recognize as Esme Hale springs to her feet and stands tall amidst the chaos all around her. A spear hits her in the chest and she topples backwards. You give an animalistic cry of rage which is echoed by every one of your countrymen on the Mountain. Unstoppable as a rising tide your countrymen resume their surge up the mountainside.\n\n\nYou watch as your comrades hack their way upwards, slaughtering Lapau left, right and center until their line breaks and a party of sailors led by Tobias Cuthrew reach the summit. You beam and join the cheering but your grin fades from your face as you see Eva Freer being carried down the mountainside by two of her sailors, her right shoulder shattered by a musket ball. As you hurry towards her she waves you away and assures you she's fine.\n\n\nMoments later she is followed by a somber procession of six sailors bearing Esme Hale's body between them. Your friend's head hangs back, her beautiful long hair skimming over the jagged corral and blood drips from the spear in her chest. You sit on a rock and watch as the procession passes Anne-Marie, Quarrel and Finch. Anne-Marie lowers her head, Quarrel looks away and Finch draws his sword, casts it into the sea and silently walks away.\n\n\nThe battle has been won but at this cost. Remarkably casualties have been extremely light and only a few of your men have been killed but one has died who can never be replaced.", "action_results": [null]}]}]}, {"action": "Remain offshore", "result": "You remain aboard the Adventurer with Eva Freer watching as Swift and Hale lead their crews ashore. \"Here it comes,\" Freer mutters and a moment later a volley of musket shots ring out but to your surprise they come not from the advancing sailors but from Lapau warriors hidden in the trees. You see a dozen figures break cover and race towards the sea and immediately turn the Adventurer towards them and shout for your crew to be ready with their muskets but this time the Lapau outwit you: using long tubes of bamboo lashed together end to end with grass they vanish under the waves, their breathing tubes almost impossible to find.\n\n\nThe island has been captured but at the cost of another dozen casualties including Naomi Swift who has been hit by a musket ball in the right thigh. She is taken back aboard the Explorer where she is operated on but she is so badly wounded she cannot walk and is unable to command her ship. Eva Freer temporarily assumes command and you feel strangely clenched up inside as she leaves the Adventurer, you have got used to having her around and feel very sad to see her leave. Cuthrew orders his four-ship half of the fleet to sail Southeast and you obediently sail towards the Corral Mountain, your supplies running dangerously low.", "action_results": [null]}]}, {"action": "Join Anne-Marie, Quarrel and Finch in attacking the rocky island", "result": "With a distinct feeling of deja vu you sail Southeast with Anne-Marie, Freer, Finch and Quarrel and soon catch sight of rocky island. It has a grim and desolate look about it and as you approach you see spear-armed warriors darting in and out of caves on the island, which may well be connected with each other. You don't like the look of the island at all and judging from the faces of your companions when you assemble in Anne-Marie's cabin they don't either.\n\n\n\"We need to take this island which means we'll have to clear out each cave systematically,\" she announces. \"Commanders Quarrel and Finch, you will take your crews ashore and carefully scour the caves, killing all you find within, while Commander Freer and I will remain offshore with the ships to prevent escape.\"\n\n\n\"Why don't we just ignore this island and sail on?\" Freer asks wearily. \"That way more of our countrymen won't need to die.\"\n\n\nAnne-Marie gives Freer a cold glare. \"The Lapau would take that as a sign of weakness,\" she declares. \"As would I. Commander Trapa, who will you accompany?\"", "action_results": [{"action": "Join the landing force", "result": "You, Quarrel, Finch and nearly forty sailors land on the island and begin working your way through the caves. The fighting is bloody: frequently spears fly out of dark openings and return fire rarely hits a target. Your sailors take to sticking their muskets around cave entrances and firing blindly inside in an effort to kill anyone who might be hiding within. More than once a hidden warrior will spring forward and run a startled sailor through with a spear. Finally the last warrior on the island is killed but a dozen sailors lie dead including three of your men.\n\n\nAmong the many casualties is Thomas Finch, speared through the right arm by a hidden warrior and though in great pain he insists on retaining command of the Royal Escort. In recognition of his sacrifice Anne-Marie names the island in his honor, which seems to bring him scant consolation for his wounded limb, and with another island secured she orders the Fleet to sail Southwest towards the Corral Mountain and your rendezvous.", "action_results": [null]}, {"action": "Remain offshore", "result": "Knowing better than to risk your remaining sailors' lives in what will surely be dangerous cave fighting you remain offshore and watch the ensuing action from the deck of the Monarch of the Sea with Anne-Marie and Eva Freer. Much of the fighting is hidden but musket shots ring out frequently and a steady stream of bodies are conveyed to the shore. At your side Freer is drumming her fingers impatiently on the rail and you're not surprised when she suddenly snaps at Anne-Marie.\n\n\n\"Is it worth it?\" she demands. \"Lives for land? Or the fact it isn't even our land to begin with?\"\n\n\n\"You don't know what you're talking about,\" Anne-Marie says indifferently. \"Yes, we might lose one or two sailors here but then we have this island for all of time and think how much greater our population will be if we have more farmland to feed them and more land to house them? The idea of ownership is the idea of weaklings, the strongest take and deserve what they get. So it has always been in Nature, so it is now.\"\n\n\nFreer and you exchange glances, neither of you are quite sure how to respond to this. By dusk the fighting is over, the Lapau all killed and the island won at the cost of another dozen sailors but Thomas Finch is among the casualties, speared through the right arm and in great pain. In his honor Anne-Marie names the island after him and seemingly content with the day's fighting orders her four ships to turn Southwest and sail towards the rendezvous at the Corral Mountain.", "action_results": [null]}]}]}]}]}, {"action": "Sail South with the rest of the Fleet", "result": "The Merry Company and Explorer split off from the Fleet while the rest of you sail south. The temperature begins to drop noticeably and to try to keep sprits high Anne-Marie begins inviting her officers to her cabin for dinner every evening. It is not a very happy gathering: Cuthrew never attends and there is clear tension between Freer and Anne-Marie. Finch rarely speaks and Quarrel only does so in support of anything Anne-Marie has to say. One evening as you return aboard the Adventurer with Eva Freer she suddenly turns to you.\n\n\n\"Have you noticed Quarrel has started spending his nights aboard the Monarch of the Sea,\" she asks you nonchalantly. You admit that you hadn't and Freer sighs. \"I hate that woman,\" she confesses to you. \"She has all the qualities I hate and I will be very glad when this voyage is over.\" As you put your hand on your arm to help her onto the Adventurer's deck it suddenly brushes against her breasts and an unexpected thrill goes through you. Freer doesn't seem to notice anything as she bids you goodnight but for some reason that night you can't get her face out of your mind.", "action_results": [{"action": "Further South", "result": "The Snow Mountain soon comes into sight and with a telescope you can spot a huddle of huts perched precariously on a flat plateau at it's base. Anne-Marie takes on look and declares you will all attack tomorrow. Aware of earlier ambushes she issues orders for all ships to post night sentries to keep a close watch on the water that night and it is a good thing she does this.\n\n\nYou are woken from your sleep by the sound of a gunshot. Springing to your feet with memories of the earlier ambush that destroyed the Lucky and Gambler running through your head you rush out onto deck to find most of your Crew doing likewise and firing muskets down into the water as spears arc upwards. To your amazement there is no sign of canoes: the Lapau have actually swam through the near-freezing water from the mountain in an effort to surprise the War Fleet. Their tactics are evolving.\n\n\nFortunately the attack was detected in time and the Lapau are not numerous enough to truly press home their advantage and your battle-hardened Crew soon drive them back, killing many who try to climb aboard the ships but some of your Crew and a few aboard the other ships are slain by thrown spears. The next morning you see the surviving Lapau take to their canoes and paddle south allowing you to take possession of the Snow Mountain. A few days later the Merry Company and Explorer rejoin the Fleet with bad news.", "action_results": [null]}]}]}]}, {"action": "Remain offshore with Hale and Freer", "result": "While the others go ashore you, Hale and Freer wait on the quarterdeck, the usually-cheerful Hale frowning as she absent-mindedly rubs her healed wound in her hip while Freer watches intently as Anne-Marie and Quarrel lead their men across the beach, through the deserted village and into the jungle. Moments later there is the crackling pops of musket shots and Freer sighs wearily. \"Well the Orphan and Widows Club has some new members,\" she says unhappily. \"What are we even doing here? If we'd left them alone the Lapau would have been no threat to us. This expedition is solely to steal their lands.\"\n\n\nHale says nothing but continues to frown and chews her bottom lip, drawing blood. Soon after the sound of gunfire Anne-Marie and Quarrel's crews return triumphantly having killed a dozen Lapau warriors still on the island and claimed it for your country, Anne-Marie chooses to rename it Quarrel Island after her loyal servant. Raising anchor you put the island behind you and sail due west to rejoin the rest of the Fleet.", "action_results": [null]}]}, {"action": "Join Cuthrew, Finch and Swift in capturing this island", "result": "The Monarch of the Sea, Merry Company and Indefatigable vanish over the horizon leaving the rest of you anchored offshore. To your surprise Commander Cuthrew doesn't launch his attack straight away but instead waits to consider the situation so it is not until a few days later that you, Freer, Finch and Swift (the latter still with her arm in a sling) are invited to his cabin. Cuthrew looks like he has been ill and does not rise from his chair when you enter. In a tired voice he outlines the plan of attack.\n\n\n\"Commander Finch, I want you to lead your Crew and Commander Swift's crew ashore. Try to force any Lapau you encounter to surrender and only fire your muskets if you need to defend yourselves. Commander Swift, I know you have more reason than any of us to hate the Lapau but please do not let this cloud your judgement... Commanders Freer and myself will remain with the Fleet to block off any escape attempts they make. Commander Trapa, you can join the land assault or remain with the sea force as you prefer.", "action_results": [{"action": "Join the land assault with Finch and Swift", "result": "Dropping anchor you, Swift and Finch cautiously lead your men ashore, Swift looking grim and holding a sword in her good hand. Keeping in close order with muskets loaded and ready you and your men advance, occupy the abandoned village and move into the jungle. Before you can reach it a war cry fills the air and arrows whiz out of the trees, cutting down several men including three of yours. A volley of muskets boom out in response and with a cheer your sailors break ranks and charge into the jungle. The surviving Lapau are swiftly cut down.\n\n\nAfter the short battle is over Finch orders the borders of both sides buried. It is grim work but the island is yours: your countrymen's individual graves stand as testament to that. The dozen dead Lapau warriors are buried under one mound and that evening you are surprised to see Swift standing alone by the mound crying that evening. Feeling she'd rather be left alone you return to the Adventurer with your surviving Crew and wait for the rest of the Fleet to rejoin you.", "action_results": [null]}, {"action": "Remain offshore with Cuthrew and Freer", "result": "You remain offshore while Finch and Swift land. Because Cuthrew remains in his cabin you only have Eva Freer for company as you stand on the quarterdeck of the Adventurer watching the distant sailors move up the beach to capture the unoccupied village. As they approach the jungle there is a volley of gunshots and Freer groans. \"We should not be doing this,\" she tells you unhappily. \"This is murder but because the Queen says it is ok our sailors are happy to do it.\" You glance at her thoughtfully. That evening Finch and Swift's crews return to their ships having killed a dozen Lapau warriors and taken possession of the island; now all you can do is wait for the rest of the Fleet to rejoin you.", "action_results": [null]}]}]}]}]}, {"action": "Sail directly towards the rest of the Fleet", "result": "Knowing the Maverick is doomed you hold your course and in the safety of the War Fleet adjust your course and advance with the line of ships towards the hundreds of Lapau canoes. Before your eyes the Maverick sinks beneath the waves and her crew are slaughtered in the water by the dozens of canoes which converge on the spot: in moments the seas are red with blood and bodies float on the waves all around. The Explorer reaches the safety of the Fleet before turning around, like you and every other sailor aboard the Fleet Naomi Swift wants revenge.", "action_results": [null]}]}, {"action": "Remain with the rest of the Fleet", "result": "You remain with the rest of the War Fleet, hidden from sight behind the Barren Hill while the Explorer and Maverick sail south. Anne-Marie establishes an observation post manned by two sailors atop the Hill and after just a few days you spot them waving a red blanket, the pre-arranged signal that the decoys are returning. Along with the rest of the Fleet you weigh anchor and steer the Adventurer out from behind the Hill to see a chilling sight: the Explorer and Maverick are sailing straight towards you surrounded by hundreds upon hundreds of canoes, more than you have ever seen in your lifetime.\n\n\nWith your telescope you can see the Natives are viciously stabbing their spears through the hulls of the two ships in an effort to sink them, archers are firing arrows up at the ships' decks and warriors are trying to climb aboard. \"Stay together\" Queen Anne-Marie shouts to you across the space between your ship and the Monarch of the Sea as on your other side the Sea Ghost begins to edge ahead. \"We must attack them together!\"\n\n\n\"That's a stupid order,\" Eva Freer tells you angrily. \"We should go and help them.\" The Monarch of the Sea fires her bow cannons but she is still out of range. A collective cry of dismay rises from the Fleet as you see the Maverick suddenly list to starboard and start to sink.", "action_results": [null, null]}]}]}]}]}]}, {"action": "The sea force", "result": "It takes a few days for you to get your Crews ready to launch the assault but finally all the preparations have been made. Leaving Commander Finch to lead the attack on the island you sail the Adventurer round to the south side of the island and watch the other ships move into their positions to block any escape attempts. You watch with a telescope as Finch and Quarrel lead the land force across the island, expecting the sounds of combat to reach your ears at any time but no fighting breaks out.\n\n\nAfter lots of waiting curiosity gets the better of you and you go ashore with Captain Freer.\n\n\n\"The island is deserted Commander,\" Finch reports to you. \"The Lapau have already left.\"\n\n\n\"Excellent,\" Freer declares with a grin. \"All this time we have been planning how to capture a deserted island.\"\n\n\nIgnoring her you order your men to tear down the villager's huts and use them to build a small wooden fort and a jetty. There is nothing left to do now but sit tight and wait for the other ships of the War Fleet to return here.", "action_results": [null]}]}, {"action": "Sail Northwest and co-ordinate Swift and Mason's voyage to ensure the safety of the Colonies", "result": "After the Council five ships split off from the rest of the War Fleet and sail Northwest back to Burnt Island. It is a swift voyage and to your relief the small Colony ashore shows no sign of being attacked. When you drop anchor offshore you are surprised when Commanders Naomi Swift and Bermuda Mason come aboard the Adventurer. Both are fair and attractive but efficiently they come straight to the point.\n\n\n\"To save time Commander Trapa I think it might be better if we split up,\" Mason says. \"If I sail west I can reach Sandy Island, turn back Southeast to the Colony on Jungle Island and return east to rejoin Commanders Quarrel and Finch. At the same time Naomi can sail north to Trevers Island, back south to here at Burnt Island and southeast back to Quarrel and Finch, by splitting up this way we check all of the Colonies twice as fast as if we stayed together.\"\n\n\nIt is an intelligent plan and you nod thoughtfully wondering which one to join. Eva Freer who is standing by shows no particular preference.\n\n\n\"I am not very familiar with the waters around Trevers Island,\" Swift tells you. \"It might be helpful if you could accompany me Commander.\"", "action_results": [{"action": "Sail North with Swift to Trevers Island", "result": "You continue north while Commander Mason's Maverick turns off to the West. Every evening Commander Swift comes aboard the Adventurer to join you and Commander Freer for dinner: she turns out to be an interesting individual and good company.\n\n\n\"Given that it took some sixty days to sail around the world wouldn't it be better to spend six hundred or so visiting every part of it?\" she asks you. \"Based on the number of islands discovered already me and Bermuda calculated there must be about one hundred islands out there, all waiting to be found. Do you think one day someone will be able to visit them all?\"\n\n\n\"I doubt it,\" Freer says with a smile. \"I don't know anyone with that much free time.\"\n\n\nReaching Trevers Island you are pleased to see that the Colony here has also escaped attack. The Colonists are shocked to hear news of the Battle of the Fleets and quickly row out to help resupply your ships with supplies. While Anne-Marie and Hale sail North back towards your homeland you order the Adventurer and Explorer to turn about and sail back south to Burnt Island.", "action_results": [{"action": "Southward", "result": "Returning to Burnt Island you find the Colonists here are still safe and even row out Supplies to your vessels. That evening while anchored offshore the conversation turns to the likely course of the war against the Lapau and what will happen next.\n\n\n\"I think this expedition has now turned into one of self-defense,\" Swift says. \"If we don't attack and defeat the Lapau what's to stop them becoming bold, coming out, massacring our settlers and plundering our Colonies?\"\n\n\n\"I think the Lapau only attacked us because we invaded what they consider their lands to begin with,\" Freer says. \"I think they thought we would give up and go home after they destroyed the Lucky and the Gambler but instead it has just made our Queen determined to destroy them... we will probably win this War but neither side will be better off because of it.\"\n\n\nYou stay silent and the next morning alter your course Southwest to rejoin your companions at Village Island.", "action_results": [{"action": "Rendezvous", "result": "The Adventurer, Explorer and Maverick return to Village Island within hours of each other to find the Royal Escort, Sea Ghost and Indefatigable already waiting for you. All the news is good news: the Colonies are safe, Quarrel and Finch bloodlessly captured the Island after the Lapau evacuated during the night and Cuthrew has discovered the Lapau's next closest inhabited island just off to the Southeast. The only worry is the low Supply situation in the Fleet and this is soon remedied when Anne-Marie and Hale rejoin the Fleet.", "action_results": [null]}]}]}, {"action": "Sail West with Mason to Sandy Island", "result": "You sail West with Commander Mason to Sandy Island, a featureless outcrop of sand where three Colonists have built tents simply to establish it as part of your country's lands. Bored beyond belief with nothing to do except fish they are overjoyed to see you and quickly row out in a small boat to help resupply your vessels. At their insistence you host a dinner on board the Adventurer, Mason says very little but Eva Freer unwinds enough to talk about her childhood of growing up on the streets of Golden Sands. Pleased to find the Colony is safe you turn Southeast towards Jungle Island.", "action_results": [{"action": "Southeast", "result": "Reaching Jungle Island, a thickly-covered tropical paradise you are pleased to find the Colonists here, the most exposed of all your Colonies, have also escaped attack, though they have lost men to a deadly tiger that lives in the jungle somewhere in the interior. They are kind enough to bring Supplies out to your ships and feeling reinforced you turn your two vessels Southeast to rejoin your companions at Village Island, comforted by the knowledge that all your country's Colonies are safe.", "action_results": [null]}]}]}]}]}, {"action": "Sail towards Commander Hale's embattled ship Merry Company", "result": "Your loyalty to your friend Esme prompts you to steer the Adventurer towards the Merry Company, whose decks are swarming with grappling figures. As you pull your ship alongside your Crew spring across the gap cheering with swords in their hands and quickly help turn the tide of battle. Lashing the wheel into place you follow your crew onto the Merry Company's blood-stained decks which are literally carpeted with bodies. As your men help drive the Lapau from the ship Hale staggers towards you, a blood-covered sword in her hand and the other clasped to her left side which is wet with blood. She has tears in her eyes.\n\n\n\"They've killed my boys!\" she cries out to you. \"Look at them! They've killed my boys!\"\n\n\nYou glance around: the decks of the ship are indeed so thickly covered with bodies you could walk from prow to stern without once setting foot on the deck. Before you can say a word a spectacular explosion deafens you and knocks both you and Hale to the deck. The Lucky has just blown up, vanishing from sight in an instant as pieces of wood and bodies fly through the air. A moment later the Gambler sinks too. Amidst cheers and war cries the Lapau abandon their attack, take to their canoes and return to their island to celebrate their victory.", "action_results": [null]}, {"action": "Sail towards Commander Quarrel's embattled ship Indefatigable", "result": "Sailing towards the Indefatigable you turn the Adventurer to port so your crew can fire your cannons at the Lapau crowded on the assailed ship's deck. Drawing alongside your men fire muskets at the crowd of Lapau warriors allowing Quarrel's men to counter-attack and drive them from the ship.\n\n\n\"Commander Trapa, turn your ship around,\" Quarrel shouts up at you angrily from the quarterdeck. \"What are you doing? Your first duty should be to protect the Queen!\"\n\n\nAnnoyed at this lack of gratitude you shout back a reply which Quarrel fortunately does not hear and leaving his men to extinguish the fire on board you steer your ship towards the Monarch of the Sea. By the time you draw alongside the battle is already over: aided by the Sea Ghost Anne-Marie's crew have driven their attackers from the deck. As you stare at the blood-soaked decks a deafening explosion behind you makes you turn around: the Lucky has just blown up and disintegrated into a cloud of flying debris. The Gambler sinks too and amidst a tumult of war cries and cheers the Lapau return to their canoes and paddle back to their island to celebrate their victory.", "action_results": [null]}, {"action": "Sail towards Commander Trever's sinking ship Lucky", "result": "Spinning your ship's wheel you guide the Adventurer towards the Lucky but before you can reach it she dramatically explodes in a burst of light and sound. Your ship is covered in wooden debris and bits of bodies, a severed and thumps into your face and falls to the deck in front of you. A short way off the Gambler sinks beneath the waves as well. You stare in silent horror as the cheers and whoops of the Lapau fill the night air as returning to their canoes they paddle back to their island to celebrate their victory.", "action_results": [null]}, {"action": "Sail towards Commander Freer's sinking ship Gambler", "result": "Sailing towards the Gambler you can see dozens of sailors diving from the deck of the sinking ship only to be speared in the water by the dozens of Lapau warriors in canoes all around. Unwilling to risk the water a handful remain on deck tugging frantically at the ship's lifeboat. Something akin to a sun rising bursts out to your left: in a spectacular explosion the Lucky bursts into a million pieces. A moment later the Gambler sinks beneath the ocean's waves as well.\n\n\nWith your men giving covering fire from the decks with their muskets you order the Adventurer's longboat lowered and are able to rescue a few survivors from the Gambler. Among those you pull from the water is the Gambler's Captain Eva Freer, bleeding heavily from a serious shoulder wound but still full of passion. \"Those damned curs have sunk my ship and they'll be hell to pay!\" she snarls at you when she arrives aboard the deck of the Adventurer. You nod silently as you stare around at the ruins of the Fleet.", "action_results": [null]}]}]}, {"action": "Remain at sea with the War Fleet", "result": "While the other Officers go ashore you, Cuthrew, Hale, Trevers and Finch gather on the quaterdeck of the Sea Ghost to co-ordinate the fleet's actions from there. Cuthrew looks tired, Finch is silent, Trevers is nervous and even Hale's usual cheerfulness seems to have waned slightly.\n\n\n\"Do you think the Lapau will negotiate?\" she asks you nervously.\n\n\n\"I don't know,\" you reply thoughtfully, squinting at the distant figures on the beach.\n\n\n\"They will not,\" Finch says confidently and you glance at him in surprise. \"All the reports from our Colonists suggest theirs is a proud and strong culture that reacts violently against intrusion into lands they consider their own. The cultural differences between us and them are so vast it would take a great deal of time to even begin to bridge them. I don't think the Queen can wait that long and the sight of this great Fleet might trigger them into action.\"\n\n\n\"I hope there is no fighting,\" Trevers says unhappily. \"I don't think I'd do very well in a War.\"\n\n\nThat evening Queen Anne-Marie and the other Commanders return after a fruitless day spent trying to understand and interact with the Lapau. No orders are issued to the Fleet except to be on alert and returning to your cabin aboard the Adventurer you slip into an uneasy sleep...", "action_results": [null]}]}]}]}]}, null]}]}, null]}]}]}