{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=14899", "context": "", "first_story_block": "Welcome to the Insanity Complex.  We hope you enjoy your stay (or not...). \n\n\n(Remember to save your game frequently.)\n\n\nShall we begin?", "action_results": [{"action": "Yes! Let's begin!", "result": "The sun shining through the small window above you wakes you up. You are lying on the soft bed in what appears to be a small room. You sit up suddenly, shocked by what you see around you. You don't remember how you got here or ever being in this place before. How did you get here? \n\n\nNext to your bed is a chest of drawers on the left and some shelves on the right. Maybe these could give you a clue.", "action_results": [{"action": "Have a closer look at the shelves.", "result": " \n\n\n\nYou check the shelves. They are bolted to the wall. You see three pairs of clothing on the top shelf. These are made up of a shirt and a pair of  trousers. One pair is purple, one is pink and one is blue.\n\n\nYou know these aren't your clothes. You look at yourself. You are wearing what appears to be pyjamas. What do you do next?", "action_results": [{"action": "Put on the purple clothes.", "result": "Right, that's better. Even though it's not your clothing it feels fresher than those pyjamas. You have a look at the bottom shelf. There is a bottle. You read it.\n\n\nQuitiapine 400mg\n\n\nMISS TINA OWENS\n\n\nTake one twice daily. \n\n\nRight. Now at least you can remember your name. Quitiapine? That's an antipsychotic! Your heart begins to race. You decide not to take it before you figure out what's going on. You put it in your pocket.\n\n\n ", "action_results": [null, {"action": "Go back.", "result": " \n\n\n\nNext to your bed is a chest of drawers on the left and some shelves on the right. Maybe these could give you a clue.", "action_results": [{"action": "Check the chest of drawers", "result": "You have a look a the chest of drawers. It seems old and rickety. It is shoddily bolted to the wall and the floor.\n\n\nWhy is everything bolted down?\n\n\n ", "action_results": [{"action": "Open the drawers.", "result": "All the drawers are empty except the bottom one. It contains a notebook and pencil. You take them.", "action_results": [null, {"action": "Go back.", "result": "Next to your bed is a chest of drawers on the left and some shelves on the right. Maybe these could give you a clue.", "action_results": [{"action": "Check the window.", "result": "You check the window. The sun is bright and hurts your eyes. You squint as you take a look at the window and its frame.\n\n\nIt seems to be made from triple glazed reinforced glass which is bolted to the window frame. What do you do next?\n\n\n ", "action_results": [{"action": "Hit the window.", "result": "The window doesn't even rattle. Are you locked in? How are you going to get out? You don't want to spend the rest of your life in this place.", "action_results": [{"action": "Try to open the door.", "result": "You push on the door. It doesn't budge. Maybe it's a pull door. You pull on the door. It doesn't budge. \n\n\nYou are locked in. Your heart races. How are you going to get out? Why are you here? What's going on?  \n\n\nIn your frustration you keep hitting the door. You hear a mechanical noise behind you.", "action_results": [{"action": "Stop hitting the door and turn around.", "result": "You turn around. You dont see anything. You look around carefully again. Your thoughts are racing. How are you going to get out?", "action_results": [{"action": "The window must break sometime! In your frustration you go over to the window and hit it repeatedly.", "result": " \n\nThe mechanical noise was a CCTV Camera. The doctors see you banging the window as a desire to kill yourself by jumping out of the window or using broken glass.\n\n\nPeople in white coats have come to take you away. They  prepare the sedation. You see one holding a big needle and syringe. Your heart races. You scream. They hold you down and inject you in the neck. \n\n\nYou stop struggling as they put you in a straight jacket. The world slowly fades to black.\n\n\n ", "action_results": [{"action": "Next>>", "result": "You wake up in a cell where the walls and floor are padded. Everything is padded including the bed. Fortunately for you they've taken off the straight jacket.\n\n\nYou are alone and desperate. You need to get out of this place. Your thoughts start to race. You are paralysed as thoughts of the past bombard your mind. \n\n\nThoughts of the world trying to hurt you, thoughts of your worthlessness, and mainly, most strongly, most importantly, thoughts of your death. These thoughts race around your head at the speed of light, burning away in your head, eating away at your decaying heart. \n\n\nSuddenly you realise that you are screaming and bashing your head against the soft padded wall. You try to stop, but you cant. Something, someone else is controling your body. You scream in frustration, the voice telling you you must excape. You must escape. \n\n\nIt stops. \n\n\nYou decide maybe it's best to take your medication now. Or maybe not?", "action_results": [{"action": "You'll do anything to feel better. Take your medication.", "result": "You take your medication. You take one tablet as directed hoping this will hold off the darkness inside you for a while, making it easier for you to escape. \n\n\nYou wait for what you think is an hour for the medication to take effect and then you decide it's time for you to begin your escape.", "action_results": [{"action": "Right. I'm ready.", "result": "You start to search all around the room, which looks irritatingly bare. You still have a pain in your forehead, which makes it quite difficult to concentrate, but you still carry on. \n\n\nYou see nothing. It's a good thing that  it's starting to get slightly easier to concentrate. \n\n\nIntuition tells you to check the padded pockets in the walls and floor. You feel the pockets around the room but you don't feel anything. \n\n\nYou start getting increasingly anxious.\n\n\n ", "action_results": [{"action": "Keep searching.", "result": "You continue your search, frantically feeling the walls to see if there is anything hidden, your thoughts and heartbeat racing... Suddenly you feel something inside one of the padded pockets in the corner where two walls meet. Your heart skips a beat as you pull out a note with someone's handwriting on it, a map and an ID card. You take them. [have a look at them before continuing]", "action_results": [null, null, null, {"action": "Continue.", "result": "Before you can gather your thoughts, suddenly the door creaks open and two men and a woman walks in. It's the woman who's picture is on the ID Card.\n\n\n\"Good afternoon, Miss Owens. How are you feeling?\" The woman asks you.\n\n\n ", "action_results": [{"action": "\"How am I feeling? How am I feeling? I'm in a padded cell and you ask how i'm feeling?\"", "result": "They look at each other, worried. The woman speaks again.\n\n\n\"I'm sorry, Miss Owens. I was just enquiring if you were feeling better than before.. You were having a psychotic episode, so we had to restrain you and put you in here. Are you feeling better?\"", "action_results": [{"action": "\"I guess so...\"", "result": "She seems to relax a little. She smiles. \n\n\n\"Alright then.  You can leave this room now. We'll take you back to your room. Did you take your medication?\" She asks.", "action_results": [{"action": "\"Yeah. I did.\"", "result": "\"Good, good...Well come with me.\"\n\n\nShe gestures for you to follow and you do so tentatively.  The two men walk behind you to make sure you do not escape. You think maybe now is the time to escape, but then think better of it...if it doesn't work....well, let's just say that you want a realistic chance at this.\n\n\nNo, you have the ID card so you can get out easily, as long as no one spots you. You'll try once you get back into your room.", "action_results": [{"action": "Next >>", "result": "You are back inside your room, locked in again. This is starting to make you extremely irritated, but you take a deep breath and decide it's worth the effort to escape. \n\n\nAt least you now know that they can watch you using that camera, which seems to detects noise at certain decibels (you know this because it only activated when you started hitting the door) so you have to be very, very careful with what you do in here. ", "action_results": [{"action": "Look closely, but quitely around the room.", "result": " \n\n\n\nYou sneak over to the door to check to see if there is any way you can unlock it...", "action_results": [null]}, {"action": "Do nothing.", "result": "You do nothing. Time passes. Nothing happens...", "action_results": [null]}]}]}]}, {"action": "\"Better? Better? YOU GET AWAY FROM ME!\"", "result": "They look at each other again. One of the men shakes his head in pity for you.\n\n\n\"Miss Owens?\" the woman inquires. \"Are they still after you?\" \n\n\nThere's a long pause. You stand very, very still...worryingly still.\n\n\n\"Are they still hurting you? It's very important you tell us....\" she continues.", "action_results": [{"action": "\"LEAVE ME ALONE!\" You scream as you rush towards her.", "result": "You decide to punish the woman for all her bad deeds.\n\n\nYou attack the woman. Your hands land comfortably around her throat. You start to squeeze.\n\n\nThe men were trained for this. Within seconds they're on you, restraining you. One calls for backup. Sirens are going off all around you.\n\n\nYou've been caught in one psychotic episode too many and the hospital staff decide you are too dangerous.", "action_results": [{"action": "It's too late...", "result": " \n\nThey held you down again and injected you with that needle. Them and the police put you in a straight jacket and put you in a high security padded police van and took you to the maximum security hospital/prison called Broadmore for the most dangerous of people. This is where you are to spend the rest of your days, as you are deemed as too dangerous to ever be in society ever again.\n\n\nYou slowly get worse until you are too ill to escape.", "action_results": []}]}, null]}]}, null, {"action": "Stare right through her.", "result": "They look at each other, worried. The woman speaks again.\n\n\n\n\"Miss Owens? I am just enquiring if you are feeling better than before.. You were having a psychotic episode, so we had to restrain you and put you in here. Are you feeling better?\"\n\n\n\n ", "action_results": [{"action": "You stay unnaturally still and stare right through her.", "result": "They look at each other again. One man shakes his head, obviously upset about the plight of some his fellow humans.\n\n\n\"We'll come back later, okay?\" She says.\n\n\nYou don't reply. She sighs and then they walk out, closing the door behind them.", "action_results": [null]}, null]}]}]}, {"action": "rest", "result": "You take a rest from searching for a while. You lie back on the bed and relax for a while...", "action_results": [null]}]}]}, {"action": "No, it's probably a conspiracy to slowly poison you. Don't take your medication.", "result": "You decide there is no way that you are going to take your medication as you don't trust anything that you've been given in this place. Anyways, the thing that was controlling you is gone. You won the fight. You feel good about that.\n\n\nRight, you decide it's time to make your escape.", "action_results": [{"action": "I'm ready.", "result": "You start to search all around the room, which looks irritatingly bare. You still have a pain in your forehead, which makes is quite difficult to concentrate, but you still carry on. \n\n\nYou see nothing. It's is becoming increasingly difficult. You decide maybe it's time to take a break from searching and you lie on the bed.\n\n\nThe voice comes back, shouting at you to get out of this room, you breathe frantically as the walls seem to begin to close in. You do not know what is real and what is imagined. You sit up and scream and scream and scream.\n\n\n ", "action_results": [{"action": "You've got no choice but to search again.", "result": "You continue your search, frantically feeling the walls to see if there is anything hidden, your thoughts racing... Suddenly you feel something inside one of the padded pockets in the corner where two walls meet. Your head suddenly feels like it's contracting and you scream and fall to the floor.\n\n\nSuddenly the door creaks open and two men and a woman walks in stands above you. They see you fighting what they cannot see and put you in a straight jacket. You hear the woman speaking. \n\n\n\"No space here...can't deal with this...too many...too frequently...psychotic episodes...transfer....maximum security.\"\n\n\n ", "action_results": [{"action": "No, please no...", "result": "They held you down again and injected you with that needle. Them and the police put you in a straight jacket and put you in a high security padded police van and took you to the maximum security hospital/prison called Broadmore for the most dangerous of people. This is where you are to spend the rest of your days, as you are deemed as too dangerous to ever be in society ever again.\n\n\nYou are too ill to escape.\n\n\n ", "action_results": []}]}]}]}]}]}, {"action": "Someone must hear you. In your frustration you return to the door and hit it repeatedly.", "result": " \n\nYep! Someone hears you alright!\n\n\nThe doctors hear you screaming \"HEEEELLLLP!\" and banging the door. You are upsetting the other patients and they need to put a stop to it.\n\n\nPeople in white coats have come to take you away. They prepare the sedation. You see one holding a big needle and syringe. Your heart races. You scream. They hold you down and inject you in the neck. \n\n\nYou stop struggling as they put you in a straight jacket. The world slowly fades to black.\n\n\n ", "action_results": [null]}, {"action": "You'll never get out. You repeatedly bang your head against the wall.", "result": "The mechanical noise was a CCTV Camera. The doctors see you hurting yourself. \n\n\nPeople in white coats have come to take you away. They prepare the sedation. You see one holding a big needle and syringe. Your heart races. You scream. They hold you down and inject you in the neck. \n\n\nYou stop struggling as they put you in a straight jacket. The world slowly fades to black.\n\n\n ", "action_results": [null]}]}, null]}]}, null]}]}]}]}]}]}, null, null]}, {"action": "Have a closer look at the chest of drawers.", "result": "You have a look a the chest of drawers. It seems old and rickety. It is shoddily bolted to the wall and the floor.\n\n\nWhy is everything bolted down?", "action_results": [null]}, {"action": "Do Nothing.", "result": "You do nothing. Time passes. Nothing happens.", "action_results": [null]}]}]}