{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=27234", "context": "", "first_story_block": "You are an immigrant travelling along the Oregon Trail to California, joining the thousands of settlers who are crossing America to the rich fertile lands of Oregon and California. Three months of journeying alone finds you in Fort Bridger, the last outpost on the Oregon Trail until you come to California. An explorer named Lansford Hastings recommends that settlers travelling to California leave the Oregon Trail here and follow a route known as Hasting’s Cut-Off, a shortcut across the Salt Lake Desert and Sierra Nevada Mountains that will save hundreds of miles of travelling.\n\n\nJim Bridger, a legendary explorer and owner of the trading post Fort Bridger, also recommends the route to the last party of settlers to arrive before you: a group of eighty-seven people led by two brothers called George and Jacob Donner. Hastings left Fort Bridger a week ago, escorting another party through Hastings Cut-Off and though you are disappointed to have missed him you decide to join the Donner Party who are also taking the route.\n\n\nIt will prove to be the worst decision of your life.\n\n\nOn the last day of July the Donner Party leaves Fort Bridger and you leave with them, driving your wagon piled high with provisions. You travel over the hills and valleys of the Wasatch Mountains until after a week a letter is discovered tied to a sage bush at the mouth of a canyon. It is from Hastings and advises against going down the canyon as it is rocky and might damage the wagons. He suggests that any immigrants following should send some people on fast horses to catch up with him so he can give specific directions about the route ahead.\n\n\nThree men: James Reed (a man with a strong personality and one of the most respected members of the party), Charles Stanton (Another strong personality in the party who is travelling to California on his own initiative) and William Pike (An engineer and one of the cleverest men in the group) are chosen to perform the dangerous task of travelling across unfamiliar country to try and catch up with Hastings. You can either volunteer to accompany them or remain camped with the Donner Party.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Ride ahead", "result": "Riding hard for three days with your companions you cover a great deal of distance before finally catching up with Hastings and a large wagon party of a few hundred settlers on the shores of the great Salt Lake. By the time the four of you catch up with him you are all exhausted and your horses are close to collapse. Lansford Hastings is a strong-jawed man with a rapidly receding hairline and despite his note he is surprised to see you.\n\n\nWhile Charles Stanton and William Pike rest their horses you and James Reed trade your horses for two fresh ones from some of the settlers with Hastings and ride with him to the summit of a nearby mountain where Hastings explains the best direction to travel across the Canyon’s wooded slopes and promises to continue leaving messages. Reed is keen to ride ahead and get back to the Donner Party to get them moving along this but both Pike and Stanton’s horses are tired. Reed proposes to split up: he’ll ride ahead back to the Party while Stanton and Pike follow behind.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Ride ahead with Reed", "result": "It took three days to reach Stanton but by riding with incredible speed and determination it takes just one for you and James Reed to return to the Donner Party. There Reed boastfully describes meeting with Lansford Hastings and how they worked out the route the Donner Party should take. Unfortunately it turns out to be a not very good route and you have to cut a road through the thick trees that line the Canyon’s sides and haul the wagons up some steep inclines to make it. Charles Stanton and William Pike become lost on their return journey and arrive twelve days after you, extremely hungry and very relieved to re-discover the Party. The jubilation of their safe return and finally reaching the Salt Lake Desert is marred by a tragedy that happens the next day.\n\n\n ", "action_results": [{"action": "The first death...", "result": "Just outside Fort Bridger a young man called Luke Halloran joined your group: dying of tuberculosis he was taken in by George and Jacob Donner and allowed to ride in their wagon. On the shores of the Salt Lake he collapses and dies suddenly of his illness. There was nothing anyone could have done but his death casts a bleak mood of the Party. He is buried the next day on the shores of Salt Lake next to the grave of another settler who died on his way to California.\n\n\nPressing on you enter the Salt Desert in September, a place of skin-blistering heat and dry humidity. The wagons struggle to cross the Desert, the cattle pulling them consume enormous amounts of water as they struggle to pull the wagons. James Reed is forced to abandon two of his wagons and George Donner and another settler, a fierce man called Louis Keseberg, both have to abandon one of their wagons. The whole wagon train becomes strung out over many miles and the cattle herds with the wagons become separated, many of them dying. Somehow you manage to keep your wagon moving and your cattle alive but the experience is nightmarish.\n\n\nFinally you and your companions make it across the Desert and camp at a spring for several days which are spent rounding up lost cattle, recovering things from the abandoned wagons and it is not until nearly the middle of September that the Party is ready to continue. The crossing through the Desert killed many cattle and also cost the Party many supplies. Most of the settlers, especially James Reed, are now concerned they might not have enough food to make it all the way to California.\n\n\nA plan is soon made: Charles Stanton and another settler called William McCutchen (a giant of a man who is travelling to California with his wife and baby daughter) volunteer to go ahead on fast horses to Fort Sutter, the first trading post in California, collect fresh supplies and bring them back to the Party. Moving fast they could be back in as little as a month. If you want you can ride ahead with them to California or you can remain travelling with the Donner Party.\n\n\nWhat do you do?\n\n\n \n\n ", "action_results": [{"action": "Stay with the Donner Party", "result": "After Charles Stanton and William McCutchen leave things get no better. Though you are out of the Desert Indians now begin to steal horses from the Party at night and tempers become very short. Arguments begin to break out between the settlers as food becomes scarce and hunger begins to set in. The situation inevitably culminates in violence in October when two wagons become stuck while climbing a difficult hill.\n\n\nYour wagon becomes stuck in the rocks while climbing the hill, forcing James Reed’s wagon and another belonging to Franklin Graves (a friendly man travelling with his wife, seven children and son-in-law) to collide. Reed loses his temper and snarls “Move you damn fool, you have no business being in my way!” “Shut your mouth trash or I‘ll shut it for you” barks back John Snyder, a hot-tempered driver working for Graves.\n\n\nAt this Reed completely loses his temper and springing from his wagon he strides across towards Snyder who drops to the ground to meet him. You are startled to see a long-bladed butcher’s knife gleaming in Reed’s hand and there is murder in his eyes.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Rush forward to intervene", "result": "You drop from your wagon and race forward as Reed plunges his blade deep into Snyder’s chest. Snyder staggers backwards clutching his wound and falls to the ground. As you run up Reed whirls and slashes his knife across your throat, opening a savage wound. You step back and clutch your throat, stunned. Immediately Reed drops the knife and looks horrified. “My God, what have I done?” he cries but it is too late. The world turns black and you collapse lifeless to the ground.\n\n\n ", "action_results": []}, {"action": "Fetch your pistol from your wagon", "result": "You find your pistol and cocking it you jump from the wagon. You are just in time to see Snyder staggering towards you, his eyes wide in shock and the handle of Reed’s knife sticking out of the centre of his chest. Reed stands shocked by what he has done and as you stare at him several other men including the Donner brothers come running up. Before your eyes Snyder collapses to the ground and breathes his last breath.\n\n\nThe men of the Donner Party quickly gather and Reed is surrounded, giving in without a fight. He is placed under armed guard while a quick discussion ensues over what to do with him. Franklin Graves is furious that Reed has murdered his employee while his wife and children are crying hysterically. “Hang him” Louis Keseberg urges, looking fiercely among you. “No” replies William Eddy (a friend of Reed’s and a skilled marksman). “Mr Reed should leave the camp.”\n\n\nThere is a great deal of arguing for a while and eventually it is agreed that Reed should take some food and be sent away to make his own way to California. One of Reed’s teamsters called Walter Herron volunteers to accompany him and Reed, still in a state of shock, says a brief farewell to his wife and children. Snyder is buried; the Graves Family are inconsolable and the whole Party is stunned by this sudden outbreak of violence. William Eddy is worried about Reed and Herron’s chances of making it to California on their own and mutters to you that perhaps others should go with them.\n\n\nWhat do you do?\n\n\n \n\n ", "action_results": [{"action": "Stay with the Donner Party", "result": "After Reed and Herron leave the Donner Party’s situation continues to deteriorate. Indians shoot arrows at William Eddy and William Pike when they are hunting away from the main party and both are lucky to escape unhurt. Louis Keseberg irritated by his elderly wagon-driver Hardcoop’s increasing complaints orders him out of his wagon and snaps at him to walk. Hardcoop manages keeps up for the first day but increasingly begins to lag behind. Without James the Reed family have to abandon another wagon and now many of the Party are on foot: a dangerous situation to be in with so many hostile Indians about. At noon you see Hardcoop, now a long way behind, collapse and crawl under the shade of some bushes.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Go back to help him", "result": "Unable to turn your wagon around you abandon it and carrying two canteens of water you walk back to where you saw Hardcoop fall. By the time you reach him you can see you are too late: the old man is dead. By now the Donner Party have vanished from sight and you hurry back as fast as you can, drinking all your water. You don’t even see the Indian hiding behind a rock until it is too late, with deadly accuracy he shoots you through the head, ending your journey and life in an instant.\n\n\n ", "action_results": []}, {"action": "Grit your teeth and press on", "result": "That day’s journey is a difficult one and that night Hardcoop fails to rejoin the group, William Eddy and another man do go out to look for him but return without him after a few hours. Without food and water and surrounded by hostile Indians there is little chance that the old man is still alive. Louis Keseberg is criticised by most of the group for forcing Hardcoop out of his wagon and Keseberg responds by angrily challenging anyone who doesn’t like him to a fight. The Party is beginning to tear itself apart.\n\n\nMoving on the next day you come across the skeleton of a settler killed by Indians, more horses are stolen and that night nineteen cattle vanish, stolen by Indians who occasionally fire arrows at your group from hiding in the rocks all around. Keseberg steps on a spiked tree stump and seriously injures his foot, making him more disagreeable, Indians make off with no less than twenty-one oxen the next day and William Eddy is forced to abandon his wagon.\n\n\nA week after Hardcoop’s death another wagon owned by a German called Wolfinger falls behind. Two other Germans called Joseph Reinhardt and Augustus Spitzer go back to help him. They are mean-looking fellows and for some reason both take their rifles with them when they go back. You don’t like the look of this but the other members of the Party appear not to see and continue struggling to get their remaining wagons to the Humboldt River.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Go back to help Wolfinger", "result": "Leaving your wagon you walk back on foot towards Wolfinger’s wagon. As you approach you hear the boom of a gunshot and see Wolfinger fall from his wagon to the ground. You cry out and both Reinhardt and Spitzer, their rifles raised, turn and see you. As you turn to run they both open fire with deadly accuracy. A bullet hits you in the back of the head, killing you instantly and you fall to the ground, murdered like Wolfinger for your money.\n\n\n \n\n \n\n ", "action_results": []}, {"action": "Keep moving", "result": "You keep going and that night Reinhardt and Spitzer rejoin the Party without Wolfinger. In grim tones and with lowered eyes they tell the group, which includes Wolfinger’s young wife Doris, that Wolfinger was killed by Indians who pilfered his wagon. Many in the group quietly express doubts among themselves that the pair are lying but no one is willing to go back and investigate so the matter is dropped but the mood in the group plunges even more.\n\n\nThe next day William Eddy and Patrick Breen (a wealthy settler and dedicated Catholic travelling with his large family) nearly get into a fight when Breen refuses to give Eddy any water for his thirsty children and Eddy threatens to kill him, the matter is only resolved when the Donner Brothers intervene and persuade Breen to give up some of his water. As the Donner Party struggles slowly on, suffering now from lack of provisions along with everything else.\n\n\nYou reach Truckee Meadows near the Humboldt River and here the Party halts for a rest. A small hunting group is prepared by William Pike and William Foster (a tough young man travelling with his wife and infant child). They are loading various weapons and drying wet gunpowder packets near the fire when William Eddy walks up to you and suggests that you join the pair in trying to shoot some animals for food.\n\n\nWhat do you do?\n\n\n \n\n \n\n ", "action_results": [{"action": "Join Pike and Foster's hunting expedition", "result": "You join Pike and Foster by the fire where they are loading their pistols. Someone yells for Foster to put some more wood on the fire. “Here hold this for me” he says passing you his pistol. As you seize the weapon it accidentally fires, the bullet piercing your heart and killing you instantly, victim of a tragic accident.\n\n\n ", "action_results": []}, {"action": "Stay with the rest of the Party", "result": "You decline to join the group and it is just as well. William Foster is loading his pistol when it accidentally goes off, hitting his brother-in-law William Pike in the back and killing him instantly. This accident, the latest to befall the Party, is an especially great tragedy as the two men were the closest of friends, Pike was a popular member of the group and he leaves behind a wife and two infant children. Foster is horrified by the accident and inconsolable for weeks.\n\n\nThree days later Charles Stanton returns to the Donner Party bringing with him seven mules loaded down with food being driven by two Indians called Luis and Salvador. Everyone is overjoyed to see him return and Stanton quickly fills you in on a few details. He says William McCutchen has fallen ill and is back at Fort Sutter in California. He met James Reed and Walter Herron on his way over the mountains and though on the verge of starvation both men made it to California safely. He reports it took him just eight days to travel from Johnson’s Ranch, the furthest outpost of civilization in California, to the Donner Party. One last push will get you over the Sierra Nevada Mountains to California and safety.\n\n\nAs soon as the Donner Party sets off the troubles begin again. An Indian shoots nineteen oxen with arrows until William Eddy shoots him with his rifle and kills him. George Donner cuts his hand very badly trying to repair his wagon and the Donner Brothers, who are not young men, begin to lag behind. Even worse it starts to snow on the last day of October, which threatens to make the journey over the Sierra Nevada Mountains practically impossible. Charles Stanton, Patrick Breen and a few other families press ahead, climbing near vertical slopes while the Donner Brothers fall increasingly behind, slowed by George’s injury.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Press on ahead", "result": "Determined to press on over the mountains before the passes become impassable you join a small group that includes Patrick Breen, William Eddy, Louis Keseberg, Charles Stanton, Patrick Dolan (a friend of Breen’s) and the two Indians Luis and Salvador in pushing on towards the summit. It is not to be however: the snow begins to fall more thickly and the pass below is impassable. You cannot go forward or backwards.\n\n\nYou are trapped in the Sierra Nevada Mountains until the snow melts in the spring.\n\n\nWearily you turn back to re-join the women and the children who have stopped on the edge of a frozen lake. The Donner Brothers did not even make it this far: snowbound down at Alder Creek eight miles further down the mountain they have halted there. As November goes on all the settlers begin to build cabins: at Truckee Lake the Breen and Murphy families build a cabin each while the Reeds and Graves Families share a cabin. Louis Keseberg builds a strange sort of lean-to against the Breen Cabin for his wife and their children. William Eddy and his family move in with the Murphy’s while Charles Stanton and the two Indians move in with the Graves and Reeds.\n\n\nDown at Alder Creek the Donner’s build two cabins, one for the Donner family and the other for various wagon drivers and others, including Mrs Wolfinger who has been with the Donner’s since the death of her husband. In all there are twenty-one people staying at the Donner’s camp at Alder Creek and sixty living up by Truckee Lake. For your part you had better move into one of the two camps and make yourself comfortable: the snow won’t melt until Spring and the supplies are not going to last nearly that long.\n\n\nWhich camp do you move into?\n\n\n ", "action_results": [{"action": "The Alder Creek Camp", "result": "Finding room in the tent that holds the Donner Brother’s wagon drivers you make yourself as comfortable as you can in a corner with blankets and hunker down. There is little you can do: a strange lethargy seems to have come over the camp at Alder Creek: George Donner is still suffering badly from his wounded hand and Jacob Donner is looking more ill by the day. Both brothers, especially Jacob, keep themselves busy writing letters that various wagon drivers run up to the camp at Truckee Lake promising generous amounts of money for any food, no matter how small. All the cattle have already been slaughtered and everyone is cold and hungry.\n\n\nIn mid-December you visit the camp at Truckee Lake and return with an interesting note from Charles Stanton addressed to George Donner at “Donnersville”. It mentions that he and Franklin Graves have been making snow shoes to try and cross the snow into California and asks for Donner’s compass and some tobacco. Travelling up to Truckee Lake with Donner’s compass you find that seventeen volunteers have been equipped with snowshoes to attempt the dangerous crossing of the snow-filled passes.\n\n\nThis group consists of William Eddy, Franklin Graves, Patrick Dolan (Patrick Breen‘s friend), Jay Fosdick (Grave’s son-in-law), William Foster (the man who accidentally shot William Pike), Donner teamsters Dutch Charley Burger and Antonio, Sarah Fosdick (Jay Fosdick’s wife), Sarah Foster (William Foster’s wife), Mary Graves (Franklin’s adult daughter), Amanda McCutchen (William McCutchen’s wife), Harriet Pike (William Pike’s widow), Lemuel Murphy (who is twelve) and William Murphy (who is ten). The journey will be dangerous and extremely risky but you can either volunteer or sit tight in the camp.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Volunteer yourself", "result": "Each member of the Snowshoes Party is given enough food for six days (at least enough for a few bites each day) and a pair of snowshoes. It is quickly discovered that William Murphy cannot keep up and he is sent back to the camp with Dutch Charley Burger, a little chunky man who is not built for this sort of activity. If you want to turn back now this is your last chance, otherwise you’ll have to risk the dangers of the snow-filled passes.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Press on", "result": "Pressing on you initially make good progress, reaching the summit of the Sierra Nevada Mountains after one day’s travel. Charles Stanton who has been exerting himself a great deal in making the snowshoes begins to suffer from snow blindness and fall behind. By the fifth day there is very little food left and everyone is exhausted. Stanton declares he is unable to walk and sitting by the fire calmly smoking his pipe he tells the rest of your group to go on without him. After a few moments hesitation the group resume their journey.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Stay with Stanton", "result": "Remembering everything Stanton has done to help the group you know that you can’t leave him behind. Sitting next to him the pair of you enjoy a last smoke and as the wind begins to whip the snow up all around you lose sight of each other. A wave of tiredness overcomes you and you find you can neither get up nor do you want to try. The pair of you die there in the snowy pass.\n\n\n ", "action_results": []}, {"action": "Head on with the others", "result": "Charles Stanton is left behind and you continue to resolutely press on for another three days, William Eddy finds his wife has secretly packed some bear meat in his bag and shares it with the rest of you. After that there is nothing to eat and soon the talk is becoming increasingly wild, people proposing that some members of the group be killed for food or that they turn back to the camp. All the women and William Eddy are determined to keep going but all the rest want to stop.\n\n\nAs you are arguing a snowstorm catches you all out in the open. Immediately you and your companions gather together for warmth and wrap yourselves in blankets but it is no good. The young Mexican teamster Antonio dies first, perishing without a sound. Franklin Gardner, in his late fifties, succumbs next. He lies very still, barely moving and Eddy tells him he is dying. Gardner replies he does not care and urges his daughters Sarah and Mary to eat his body after he dies. He expires soon after. As the cold increases you feel an increasingly irrational urge to run out into the snowstorm and hunt for food.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Leave the group to search for something to kill", "result": "There is nothing you can do. Losing all control of yourself you race out into the snow. Immediately you lose sight of your companions and never find them again. You stagger on until you collapse and half-buried by the fast-falling snow you never get up again.\n\n\n ", "action_results": []}, {"action": "Sit tight", "result": "It is a miserable Christmas. All day the snowstorm rages and you are convinced that all of you will die out here. Patrick Breen’s friend Patrick Dolan goes next. He becomes delirious with hunger, tearing off his clothes and racing out into the storm: it is with great difficulty that William Eddy gets him under control and physically forces him back. He is held down until he becomes increasingly quiet and eventually dies. Poor Lemuel Murphy dies next: he showed great courage and endurance for a boy of twelve. Like Dolan he becomes delirious and his sister Sarah Foster tries to distract him with a story about the moon, tears in her eyes. Eventually he too slips away into the endless night.\n\n\nThe cold is overwhelming you and you want to do nothing but shut your eyes. It occurs to you that if you can just get some sleep you will feel stronger when you wake up and better able to handle the cold, which is piercing your bones like a knife.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Shut your eyes", "result": "The darkness overwhelms you but you couldn’t care less. Everything is numb, faded and blurred and all you want to do is sleep. So you shut your eyes and drift down, down into the darkness and escape from this world of pain and terror.\n\n\n ", "action_results": []}, {"action": "Force them to remain open", "result": "Finally the snow storm at Camp Death dies down and you and the other survivors emerge from the snow-covered blankets, moving stiffly and more dead than alive. You join the remaining men in setting fire to a pine tree and you all lie around it, so utterly indifferent to the heat that William Eddy, Sarah Foster and Amanda McCutchen all get burned. You spend three days in the camp, drying the bodies of the dead which you then carve up with a knife and begin to eat. The meat you dry on the fire and without thinking about it you just eat. Some of the men and women have tears frozen on their faces, each being careful not to eat a family member.\n\n\nFinally you resume your journey, packaging the human flesh you have not yet eaten so you can take it with you. Struggling on you clamber over rocks, your feet numbed and bleeding as your snowshoes begin to fall apart. When all the flesh is eaten a week later someone proposes you kill the two Indians who are with you. As the suggestion gains favour in the group the Indians, understandably terrified, flee from the rest of you. The next day Jay Fosdick collapses and his wife Sarah stays with him. Eddy causes unrestrained joy when he manages to shoot down a skeletal deer which is quickly butchered for food. You have stayed back with Jay and like Sarah you try to tell him to hold on, that Eddy has just shot a deer, but it is no good. Jay expires and Sarah, telling you she wishes to die too, lies next to him. The rest of the group walks away.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Try to persuade Sarah to rejoin the group", "result": "With a broken voice you whisper at Sarah to hold on but seeing her lying there tranquil make you want to rest too. You lie down near the couple and remain still. Slowly the coldness creeps through you, overwhelming you with weariness and almost gently you slip out of this world.\n\n\n ", "action_results": []}, {"action": "Keep walking", "result": "Despite her wishes Sarah Fosdick does not die. Her sister Mary Graves returns for her and the pair cut up Jay Fosdick’s body for food. Somehow Mary helps her sister rejoin the rest of the group and you silently eat the cold meat, the dead man’s wife watching with tears in her eyes before silently accepting some flesh and chewing. Jay Fosdick’s death means you, William Eddy and William Foster are the last surviving men along with the five women and Foster is beginning to show alarming signs of derangement. Drawing you and Eddy to one side he quietly whispers that at least one of the women must be killed to feed the others.\n\n\nWilliam Eddy’s temper snaps and throwing a large stick to Foster he draws his knife and barks “defend yourself Foster!” You restrain Eddy while Foster stands motionless staring at Eddy before quietly walking away. For the moment danger is averted but the next day you come across the two Indians, Luis and Salvador, lying near death in the snow. Foster declares that the two Indians must die. When Eddy protests against this Foster draws his pistol and calmly shoots Luis in the head.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Intervene to stop Foster killing Salvador", "result": "As you step forward to stop William Foster killing Salvador he turns the pistol on you. The first shot hits you in the throat and you fall to the ground, stepping forward Foster fires twice more into your head, his eyes wide with hunger and madness.\n\n\n ", "action_results": []}, {"action": "Stand back", "result": "You step back as Foster shoots Salvador in the head as well before dropping the pistol. The Indians are quickly carved up and a fire lit to cook their flesh. Foster sits silently by the flames, staring into their depths and not even his wife Sarah can trigger a reaction. Wearily you stumble on and three days later you meet with a small group of Indians who are so horrified by your skeletal appearance that they give you all some acorns to eat. The Indians are friendly and indicate for you to follow them. The women and Foster are too exhausted to walk so you and William Eddy follow the Indians and finally reach Johnson’s Ranch, the first settlement in California.\n\n\nWhen you arrive, leaving a trail of blood, Eddy knocks on the door which is answered by a young lady. In a broken voice you ask for a little bread. The girl takes one look at the pair of you, bursts into tears and you are both hurried inside. Oh the wonder of it! Hot tea, food, warm beds and all the comforts you could want are provided! Supplies are hastily sent to the other six survivors. You set out with seventeen people a month ago: two turned back, eight died and only seven survived.\n\n\nFor now you don’t care: you are safe. Your terrible ordeal is over, thank god!\n\n\n ", "action_results": [{"action": "You get some much-needed rest", "result": "It doesn’t take long for two familiar faces to turn up at Johnson’s Ranch: James Reed and William McCutchen who both made it over the mountains ahead of the Donner Party. You and Eddy give them tell them what happened in the mountains and you are not surprised to learn Reed is putting together an expedition to rescue survivors. Another expedition is already ready at Fort Sutter and Eddy, despite the ordeal you have already been through is determined to lead it back to the Donner Party. It is up to you which you join: Eddy’s is leaving quicker but his health is broken while Reed’s and McCutchen’s is leaving later but both are healthy.\n\n\nWhich expedition party do you want to accompany?\n\n\n ", "action_results": [{"action": "Eddy's First Relief", "result": "The journey out to where the Donner Party is stranded is a nightmare, despite the fact you have plenty of food the snow has begun to thaw a little. There are fourteen of you in this rescue party but halfway through the journey William Eddy, still weakened by his earlier ordeal, is forced to turn back. Two more men are left behind with some of the provisions while the rest of you struggle on towards the Donner Party. The group becomes very discouraged and when three more men turn back, the rest begin muttering that they’ll be trapped in the snow like the Donner Party and die too.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Press on", "result": "Pressing on bravely you and the others stumble over the mountains and three days later you reach a huddle of cabins on the shore of Truckee Lake late in the evening. Here you find less than forty emaciated survivors, mostly women and children. The first that you meet is a gaunt woman with a hollowed face who asks if you have come from California or heaven. Apparently your companions have been dying on an almost daily basis and your arrival prompts a great many tears of joy and prayers to God.\n\n\nPatrick Breen is one of the healthiest remaining alive and though he has not lost any of his children he tells you a dozen have died since the Snowshoe Party left and that the Donner Brothers and others are further down the mountain at Alder Creek. It is perhaps fortunate that William Eddy did not accompany the expedition all this way as his wife Eleanor and youngest child Margaret are dead, the other child James is practically all bone. It is a terrible sight.\n\n\nPushing on ahead to Alder Creek you get there to find Jacob Donner and three others have died and those that remain are in a poor condition: George Donner has an infected hand from an earlier injury and there are many starving women and children there. Of the two remaining teamsters alive with the Donner’s one, Noah James, is too weak to help and though the other, Jean Baptiste is in better health he does not want to stay and it takes a great deal of persuasion to get him to look after the Donner’s. Returning to the Truckee Lake Camp you discover that in your absence another settler has died, the infant Catherine Pike.\n\n\nFinally those settlers strong enough to get down the mountain are assembled: twenty-one of them. The rest will have to wait for James Reed’s Second Relief. The settlers you are taking down with you are the weak teamsters John Denton and Noah James, women Margret Reed, Philippe Keseberg, Doris Wolfinger and Eliza Williams and fifteen children. With such a weakened party of settlers the return journey will be far worse than the one there.\n\n\n ", "action_results": [{"action": "Back to California...", "result": "The return journey with the survivors is a difficult one. Teamster John Denton gives out and is left behind to die. The child Ada Keseberg dies of cold and another child, William Hook dies after over-gorging on supplies. You pass James Reed, William McCutchen and the Second Relief party going up into the mountains. Reed is overjoyed to see most of his family safe while McCutchen is devastated to learn of his infant daughter Harriet’s death. They press on.\n\n\nNearing California you pass a Third Relief party going the other way led by William Eddy and William Foster. Both eagerly seek out news of their families: Eddy is devastated to learn that his wife and daughter died in the mountains. Parting ways the next day you reach Johnson’s Ranch with your remaining eighteen survivors. There you rest. Reed and McCutchen come in a few days later with just three survivors, two of them Reed’s children, having abandoned the rest in the mountains. A brave man called John Stark later brings in the eleven survivors from this group, Eddy and Foster return soon after with five survivors and state that they do not think there will be any more. George Donner, his wife Tamzene, their nephew Samuel, Levinah Jackson and Louis Keseberg remain alive in the mountains, having resorted to cannibalism to survive. In the first half of April William Foster organises a final Relief party to search for survivors. You can either accompany this group of if you have had enough of the business remain at Sutter’s Fort with the other survivors.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Accompany Foster's expedition", "result": "You join William Foster’s expedition, which is hopeful of finding at least Tamzene Donner or Louis Keseberg still alive as they were in the best health. It takes you less than a week to reach the camps in the mountains, the snow melting fast all around you as spring descends and what you find is terrible. At Truckee Lake human limbs and bones lie in every direction. Moving on to the Alder Creek camp you find more horrors including the body of George Donner torn apart with pieces of his brain in a kettle. Returning to the Truckee Lake camp you are surprised to discover Louis Keseberg, skeletal but alive.\n\n\nAs Keseberg ate Foster’s child the two are not on the best of terms and the fact that Keseberg has clearly been stealing things from the Donner Camp and using them as his own does not improve things. When large amounts of money are found on him Foster accuses him of murdering Tamzene Donner and threatens to hang him and it is only with some reluctance that the group agree to take him back to California. Before leaving the camp, the last of the Donner Party to be rescued, Keseberg looks back at the cabins and mutters “I hope God will forgive me for what I’ve done.” It takes just five days to get down the mountain and back to Johnson’s Ranch. Along the way Keseberg discovers the corpse of his dead daughter Ada in the snow.\n\n\n ", "action_results": [{"action": "Back to California...", "result": "Foster’s Fourth Relief discovers Louis Keseberg still alive and that last survivor of the Donner Party is brought out of the mountains and into California. Altogether of the 90 members of the Donner Party (including you) 43 died, including infants Jonathon and Elizabeth Graves who die that summer from their sufferings in the mountains. Of those that survive some like Louis Keseberg are branded as cannibals and murderers. You were lucky to survive this truly terrible experience: a story that will go down in American History as a tale of cannibalism and death in the Sierra Mountains.\n\n\n ", "action_results": []}]}, null]}]}, {"action": "Turn back with Eddy", "result": "Unable to keep up you turn back with William Eddy and rest for close to a month at Johnson’s Ranch, recovering your strength. There you are joined by William Foster, still gaunt but able to travel and together you prepare a Third Relief to rescue those trapped in the mountains. You set out near the start of March, travelling rapidly. On the first day you meet members of the First Relief returning to Johnson’s Ranch with eighteen survivors, three having died on the way. They give you mixed news: though Eddy’s wife Eleanor and youngest child Margaret are dead his second child James still lives. Foster’s baby boy Jeremiah is still alive too. Eddy is broken by the news but his anguish is replaced by a desire to get into the mountains and rescue his remaining child.\n\n\nTwo days later you encounter James Reed and William McCutchen returning down the mountain with three survivors, two of which are Reed’s own children. Another twelve you learn are further up the mountain, having been abandoned for lack of food and exhaustion with the bodies of another two that have already died, one of which was Franklin Graves’s widow Elizabeth. Moving on into the mountains you come across the body of wagon-driver John Denton, who died while returning with the First Relief and is found in a sitting position with a poem he wrote as he lay dying about memories of a happier past.\n\n\nThat evening you reach the place where Reed left the survivors to find they are just eleven in number now, another having died. Like you they have survived by eating the bodies of those that died. The remaining survivors are Patrick Breen, his wife Margaret, their five children, three of the orphaned Graves children and one of the Donner children. The decision is made by a brave member of the party called John Stark that he will guide this group down to safety while the rest of you go onto the camps. Two days later you reach the remaining survivors in the mountains.\n\n\n ", "action_results": [{"action": "Into the mountains...", "result": "When you reach the Truckee Lake Camp what you find shocks all of you. There are just three people left alive there: Louis Keseberg, Lavinah Jackson and her son Samuel. You find the remains of William Eddy’s son James and William Foster’s son Jeremiah. Both children have died very recently and been partially eaten by the others as a means of staying alive. For a time it looks like murder will happen, finally Eddy declares that if he ever meets Louis Keseberg again in California he will kill him. You help calm the rescuers enough that they agree to take Simon Murphy to safety.\n\n\nAt the Donner camp at Alder Creek you find George Donner bed-ridden with an infected hand, though his wife Tamzene is in good health. They ask you to take their daughters Eliza, Georgia and Frances with you as well as the teamster Jean Baptiste and another man called Nicholas Clark who was left by one of the earlier expeditions to help look after them. Another child is at the Donner Ranch but he is dying and too weak to travel. Collecting the five survivors and Clark together you set off back down the mountain. By now the snows are melting rapidly with the onset of spring and it takes just a week to make it from the camps to Jonson’s Ranch. Soon after returning William Foster begins putting together a final rescue mission to recover Donner, his wife and infant nephew, Keseberg and Jackson from the hills. You can either accompany this last mission or stay at Sutter’s Fort.\n\n\nWhat do you do?\n\n\n ", "action_results": [null, null]}]}]}, {"action": "Reed and McCutchen's Second Relief", "result": "James Reed is nothing if not thorough in his preparations and it is not until the second half of February that a dozen men, including you, Reed and William McCutchen set off from Johnson’s Ranch into the mountains. Making fairly good progress thanks to the fact the snow is beginning to thaw you encounter the First Relief returning down the mountain. Reed gives a cry of joy when he sees his wife Margret and several of their children and races forward to embrace them.\n\n\nYou swiftly learn some very worrying things: at the camps in the mountains the remaining members of the Donner Party are dying steadily from hunger, just coming down the mountain wagon-driver John Denton and child, Ada Keseberg, died while travelling with the First Relief. Nineteen survivors remain with the First Relief but many more are still in the mountains, including two of Reed’s children. William McCutchen learns that his infant daughter Harriet died in the mountains and takes the news hard.\n\n\nWhen you reach a huddle of cabins in the snow-covered wilderness on the first day of March the first person you meet is Reed’s daughter Patty, sprinting towards her father they embrace with shouts of joy. A few other figures emerge from the cabins including Patrick Breen and Louis Keseberg, altogether there are nineteen people still living in the cabins around Truckee Lake and about a dozen down at Alder Creek including George Donner. Staying only a day you gather together seventeen survivors, all you can take out. There is some discussion and it is agreed to leave a man or two to help the thirteen being left behind, especially those at Alder Creek.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Leave with the rest of the Second Relief", "result": "You choose to accompany the Second Relief and its seventeen settlers on the long and difficult journey back to Sutter’s Fort. It gets off to a bad start when a storm traps you all in open ground and Isaac Donner dies. James Reed and William McCutchen decide that because supplies are so low they must keep going but the majority of the settlers are too weak to move. Taking two of Reed’s children and a third child along you keep moving, unable to stay with the others.\n\n\nA few days later you meet William Eddy and William Foster leading their relief party up the mountains. Reed directs them to where you left the survivors and by the middle of March you make it back to Johnson’s Ranch. Eleven of the settlers you left make it in two days later, two of their number having died. Soon after Eddy and Foster return with another five survivors and report there are unlikely to be any more. George Donner, his wife Tamzene and nephew Samuel, Louis Keseberg and Lavaniah Jackson are still in the mountains, having resorted to cannibalism to survive. At the beginning of April William Foster begins forming a final rescue party to search for the last of the Donner Party still trapped. You can either accompany him or remain safely in Sutter’s Fort.\n\n\nWhat do you do?\n\n\n ", "action_results": [null, null]}, {"action": "Volunteer to stay behind and help the remaining survivors", "result": "Staying with George Donner, his wife Tamzene, their daughters Georgia, Frances and Eliza as well as Jacob Donner’s widow Elizabeth and her sons Lewis and Samuel you help Nicholas Clark and Jean Baptiste look after them. Clark, like you, is a fellow rescuer and in good health but Baptiste is weakening. The whole party are in desperate danger, in one day both Elizabeth and her son Lewis die and to your horror pieces of flesh are cut off them and eaten by the starving children and adults.\n\n\nFortunately days later a third rescue party arrives led by William Eddy and William Foster. They inform you just three people remain alive up at the Truckee Lake camp and they have come to help those who can walk leave. Though Mrs Donner is in good health George Donner is bed-ridden with an infected hand and Tamzene refuses to leave him. Instead she asks the group to take her three daughters to safety. Jean Baptiste and Nicholas Clark take this opportunity to leave too, the latter carrying a backpack of goods purloined from the Donner’s. A fourth child, Simon Murphy, complete your little party (Samuel Donner is too weak to be carried down) and you set off. The last thing you hear is Tamzene Donner calling out to you to make sure her children reach safety.\n\n\n ", "action_results": [{"action": "To safety...", "result": "You join the Relief and exhausted and weary you stumble down through the mountains with the relief party, relieved to have survived for such a long time in the mountains. The snow is melting all around you and it takes just a week to make it to Johnson’s Ranch, the start of civilization in California. There you find most of the other survivors of the Donner Party and rest and recover your strength for a few weeks. At the start of April William Foster begins organising a final rescue mission to go into the mountains and try to bring down those five people: George Donner, his wife Tamzene, their nephew Samuel, Lavaniah Jackson and Louis Keseberg. You are not keen to return to the mountains so soon after escaping but if you are willing you can join the expedition or remain at Johnson’s Ranch.\n\n\nWhat do you do?\n\n\n ", "action_results": [null, null]}]}]}]}]}]}]}]}]}]}, {"action": "Turn back to the Alder Creek Camp", "result": "You make yourself as comfortable as you can in the Teamsters Tent but it is very crowded there: not only are there too manypeople in too small a space but one of the Reed’s Teamsters Milt Elliott is visiting you as well. A snowstorm blows over the Mountains and it brings death with it. Jacob Donner is the first to succumb. He dies while sitting at a table, his head bowed in his hands, the very picture of despair. Donner’s death is just the beginning.\n\n\nSamuel Shoemaker, a teamster for the Donner’s dies next and he is soon followed by Joseph Reinhardt. Knowing he is dying Reinhardt confesses in front of you, Doris Wolfinger and George Donner that he shot and killed Mr Wolfinger but that he regrets it. He never explains why and the confession is of little comfort to the poor widow. James Smith, a teamster who actually works for the Reeds but has somehow wound up at the Donner Camp dies of the cold too. That night with the winter breeze piercing your body to the core you are struck by the urge to walk out into the cold and end it all rather than suffer this slow and lingering demise.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Walk out into the cold", "result": "There is a fifth victim of this snowstorm. Numb with cold, pale with hunger and wrapped in your blankets you stagger out into the snow. Quickly the relentlessly falling white ice overwhelms you: cold permeates every part of your body and your body is found the next morning.\n\n\n ", "action_results": []}, {"action": "Summon all the strength you have to remain in the teamsterâ€™s tent", "result": "You survive the initial series of deaths which leave George Donner and the teamsters Noah James and Jean Baptiste as the only healthy men in a camp full of women and children. For the next two months you survive. Several people die at the Truckee Lake Camp but for some reason no one else at the Alder Creek camp dies, perhaps because the Donner’s have slightly more food than everyone else. Finally in the second half of February three healthy-looking men arrive at the camp. They are rescuers from California, having made contact with members of the Snowshoe Party they have travelled out to bring people back.\n\n\nIt quickly becomes apparent that there are too few of them to take everyone to California with them, George Donner’s hand has become infected and many of the others are too weak to go. It is agreed that the men will take Elitha, Lenna and George Donner and William Hook (the weakest children) with them as well as Doris Wolfinger and wagon-driver Noah James, who is in very bad shape. Wagon-driver Jean Baptiste wants to leave too but the settlers persuade him to stay and help look after the Donner’s. At both Alder Creek and Truckee Lake the remaining men (George Donner, Patrick Breen, Louis Keseberg and Donner wagon-driver Jean Trudeau) have chosen to stay so that the women and children can leave in safety. More help is on it’s way to rescue them but if you truly insist you will be allowed to accompany the First Relief down.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Demand that the rescuers take you too", "result": "After much begging the members of the First Relief let you join them in travelling on to California and safety but the going is hard. Most of the children are so weak the rescuers have to take turns carrying them while you and the other adults stagger on as best you can. One morning John Denton, an English wagon-driver who has been of great assistance around the camps, is unable to continue and insists that he is left behind at the fire. Finding him unable to walk the other settlers agree and he is left behind.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Stay behind and try to persuade him to keep moving", "result": "You sit down next to John and try to get him to keep going but he just shakes his head and sings out a poem: “I look on scenes of past delight, without my wonted pleasures, as a mister on the bed of death looks coldly on his treasures.“ Your bodies are found a few weeks later.\n\n\n ", "action_results": []}, {"action": "Press on with the others", "result": "Leaving John Denton behind you keep going but things continue to worsen. In particular Phillippe Keseberg’s infant daughter Ada is almost unresponsive and her mother desperately offers a gold watch and money to anyone who will help her keep her child alive but it is no good. By nightfall the infant is dead and her crying mother buries her in the ground. The wind that night is relentless and chills you to the bone, you are tempted to move away from the camp and try to find a better spot.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Search for a warmer location", "result": "Rising to your feet you stagger away from the camp. In the flurrying snow you lose sight of the camp completely and wander round helplessly calling out names. Finally you can walk no more and have to lie down where you gently expire.\n\n\n ", "action_results": []}, {"action": "Sit tight and make the best of it", "result": "Finally you make it over the Sierra Nevada Mountains and begin to descend the far side. On the way you meet the Second Relief travelling out to those of the Donner Party still stranded in the mountains, this group is led by James Reed and William McCutchen. When Reed’s wife Margret sees him she gives a cry of sheer amazement and collapses in the snow. The reunion is a moving occasion and Reed’s children cry as they embrace their father. But one person’s joy is another person’s sorrow: McCutchen learns that his baby daughter Harriet died at Truckee Lake. Reed still has two children in the camps and is anxious to rescue them.\n\n\nYou part ways, the Second Relief going on up into the mountains while you and the others go down: coming to where a large stash of provisions has been placed. You are overjoyed to taste good food again and eat. One of your companions, William Hook (Jacob Donner’s stepson) eats and eats until he can eat no more. You are tempted to stuff yourself too.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Eat everything that you can", "result": "You over-indulge and that night your stomach is wracked by swift agonising pains. Moaning in agony this last pain is too much for your weakened nervous system. You die that night just a few miles from safety.\n\n\n ", "action_results": []}, {"action": "Eat moderately", "result": "You are lucky you are able to resist over-indulging (William Hook is found dead the next morning) and a week later you reach Johnson’s Ranch, having passed a third rescue party led by William Eddy and William Foster going the other way. You thank them for warning the people of California of your plight but regrettably have to tell Eddy his wife and youngest child have died. The parties separate and soon after you are overjoyed to reach Johnson’s Ranch, a place of supplies and safety. There you rest for a month.\n\n\nMeanwhile the relief parties continue to bring survivors in. James Reed and William McCutchen return with just three having abandoned more further up the trail. Another man called John Stark brings eleven of these in himself. Finally Eddy and Foster return with five more. They report that the remaining survivors in the mountains: George Donner, his wife Tamzene, their nephew Samuel, Louis Keseberg and Levinah Jackson, have resorted to cannibalism to stay alive. At the start of April William Foster begins organising a final Relief Party to bring in these survivors, if they are still alive. You can either accompany this group or remain safely at Sutter’s Fort.\n\n\nWhat do you do?\n\n\n ", "action_results": [null, null]}]}]}]}, {"action": "Wait for more help", "result": "You choose to remain with George Donner and his family at Alder Creek, helping Jean Baptiste look after the two women and seven children there. There is some talk about eating human flesh but fortunately you manage to resist the urge to do that and in the first days of March a second rescue party arrives at Alder Creek led by James Reed and William McCutchen. They bring a little more food and offer to take three of the Donner children out but intend to leave a man behind to help Jean Baptiste look after the Donner family until the next rescue mission arrives.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Insist on leaving with the Second Relief", "result": "You are incredibly relieved to join the other survivors who are leaving, which consists of Elizabeth Graves (Franklin Graves’s widow), her four children, Patrick Breen, his wife Margaret and their five children, two of James Reed’s children and three of the Donner’s children. Your group sets off and initially makes good progress before disaster strikes.\n\n\nJust a few days into the journey you are struck by a fierce snowstorm on open ground and are forced to huddle down below blankets: James Reed nearly collapses from the effort of making sure everyone is safe. Huddling together against the fierce cold you do your best. At one point during the storm it is discovered that Isaac Donner has died, slipping away so silently that the two girls huddled either side of him did not notice his death. In the midst of the cold the thought strikes you that the child must be buried.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Dig a grave for Isaac Donner", "result": "Against Breen and Reed’s protests you carry the Donner boy’s body out of the group and try to dig a grave in the snow. It is hopeless in the midst of a blizzard and the grave becomes your own when you collapse into it and do not move again.\n\n\n ", "action_results": []}, {"action": "Stay with everyone else in the huddle", "result": "By the time the storm ends you and virtually all the survivors are too exhausted to continue. James Reed makes the decision to press on anyway, carrying his children Patty and Thomas with him while Solomon Hook is strong enough to continue. The remaining thirteen of you are abandoned by Reed, who promises to go ahead, get supplies and send them back. Soon after they leave the storm kicks up again. Elizabeth Graves succumbs, turning on her side she flings her arm out in one last effort and lies still as the life leaves her. The rest of you huddle together and try to endure. Mrs Graves’s four (now orphaned) children can’t stop crying and beg you to drag their mother’s body away from them.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Move Mrs Graves's body", "result": "You move Mrs Graves’s body but the effort proves too much for you. Returning to the others you lie down with a sigh and do not get up again. Like the other dead your body will be cannibalised by the survivors.\n\n\n ", "action_results": []}, {"action": "Remain where you are", "result": "For three days the storm rages and you all lie there without food and living on melted snow. It is a miracle any of you survive: even Patrick Breen begins to pray for death. The child Franklin Graves dies next, so cold he feels like he is almost frozen solid. His orphaned siblings Nancy, Jonathon and Elizabeth huddle round the body, too exhausted to even cry. The cold gets worst and to your astonishment you see Patrick Breen begin to carve up the bodies of the dead and pass the flesh around which is eaten cold.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Refuse to touch it", "result": "You refuse to touch the human flesh while the others eat. Devoid of strength you sink into a sleep from which you do not wake and like the other dead your body too is cut up to provide nourishment for the remaining survivors.\n\n\n ", "action_results": []}, {"action": "Accept some of the offered flesh", "result": "Reluctantly you eat the flesh which ensures your survival. Tearing the cold flesh from the bones you feast on the bodies of the dead, doing anything to restore some strength into your weakened frames. Even Patrick Breen and his wife put aside their religious beliefs to feast. The meat saves your lives for a few days until a third rescue party led by William Eddy and William Foster reach you. They share some provisions with you and a brave man called John Stark volunteers to lead you all to safety. After more than a week of agonising walking the eleven of you miraculously make it to Johnson’s Ranch.\n\n\nHere you rest and eat for a time. Eddy and Foster return soon after you with another five survivors and report that George Donner, his wife Tamzene, their nephew Samuel, Louis Keseberg and Levinah Jackson are still in the mountains. At the start of April William Foster begins to put together a final search party to go and look for them. Though still weakened from your recent experiences you are strong enough to join them or if, understandably, you don’t want to go back into the mountains you can remain at Sutter’s Fort.\n\n\nWhat do you do?\n\n\n ", "action_results": [null, null]}]}]}]}, {"action": "Stay with those that are left", "result": "You are certain that you are strong enough to stay and help Nicholas Clark and Jean Baptiste look after George Donner, his wife Tamzene and their children Georgia, Frances and Eliza as well as Jacob Donner’s widow Elizabeth and her children Lewis and Samuel. Though you are all weakening the efforts of you, Clark and Baptiste keep the others alive and at one point Clark is even able to shoot a bear. It is too late though: Elizabeth walks into George Donner’s tent and without a word lays the dead body of her son Lewis on Tamzene’s lap. Stumbling away she is found dead herself soon after. George Donner cuts up both bodies, cooks the meat on a fire and feeds it to the remaining children.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Refuse to eat the human flesh", "result": "Refusing to eat any human flesh you return to your tent by yourself and lie under a blanket. That night as the snow piles up outside you succumb to your hunger and die.\n\n\n ", "action_results": []}, {"action": "Eat the meat", "result": "Reluctantly you eat the flesh which ensures your survival. Days after the double-deaths and the beginning of cannibalism a rescue party arrives led by William Eddy and William Foster. They talk to George Donner about who can be rescued: Donner’s daughters Frances, Georgia and Eliza are quickly volunteered and both Jean Baptiste and Nicholas Clark choose to leave as well. Though Tamzene Donner is in good health she refuses to leave her bed-ridden husband George Donner and their nephew Samuel is too weak to be carried and near death. The rescuers prepare to leave with the four members of the Donner Party from Alder Creek and a boy called Simon Murphy from the Truckee Lake camp. You can ask them to take you as well or stay and help George, Tamzene and Samuel Donner.\n\n\nWhat do you do?\n\n\n ", "action_results": [null, {"action": "Stay with the Donner's", "result": "After the rescuers leave there is nothing you can do. Samuel Donner dies first, the infant fades into silence but by now you are barely aware of him. George Donner, the leader of this ill-fated expedition continues to worsen and despite an incredible struggle he too finally succumbs to death. The only other person left at the cabins with you is Tamzene and she is anxious that you should both leave and travel up to the camp at Tuckee Lake before you give in to your hunger and begin to eat her husband. She begs you to join her.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Stay at the Alder Creek camp", "result": "You remain at Alder Creek alone with just the dead bodies all around for company. That night you finally accept that you will not survive and lying down you die. A month later rescuers find your body and bury it.\n\n\n ", "action_results": []}, {"action": "Accompany Mrs Donner to Truckee Lake", "result": "Late that night you return from a futile hunting trip to the cabins at Ttuckee Lake to find Louis Keseberg and Tazmene Donner there, the other survivors having died. Tazmene is talking wildly about setting off across the mountains and is determined to see her children. She is freezing and her skin is cold to touch. You and Keseberg make her as comfortable as you can but she dies in the night. You strip her body of flesh and eat it as best you can. With just the two of you left it now seems a question of who will die first. You seriously consider murdering Keseberg for food.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Get your pistol and shoot Keseberg", "result": "You go to your cabin to get your weapon but Keseberg guesses your intention. Fetching his own weapon first he shoots you through the chest as you approach him. He finishes you off with a second shot, bringing an end to your suffering.\n\n\n ", "action_results": []}, {"action": "Resist the temptation", "result": "The snow is melting all around you and birds are beginning to fly overhead and spring takes hold of the mountains but all of that brings you little comfort. What does bring you comfort is you and Keseberg travelling out to the camp at Alder Creek and looting the cabins there of money and supplies, especially tobacco. You find some remains of human flesh there and split open George Donner’s head so that you can eat his brains, those you have learnt being the tastiest part of the human body.\n\n\nSoon after you are startled when a group of men, including William Foster arrive at the cabins. They are horrified to see the body parts that are scattered around the camp and it doesn’t help that Foster doesn’t like you two anyway for eating his child and he accuses you of stealing from the Donner’s which in a way is true. The party are good enough to help you down the valley to Johnson’s Ranch, the first outpost in California. There is virtually no snow on the trail and the journey takes just five days. Along the way Keseberg discovers the corpse of his daughter Ada in the snow. Up until that moment he had not known she was dead.\n\n\n ", "action_results": [null]}]}]}]}]}]}]}]}, {"action": "Turn back to the Truckee Lake Camp", "result": "Soon after setting off Dutch Charley Burger and young William Murphy return, having decided they cannot keep up with the Snowshoe Party. Reed Teamster Milt Elliott returns from a visit to Alder Creek with the terrible news that Jacob Donner, Samuel Shoemaker, Joseph Reinhardt and James Smith have all died. Dutch Charley, a chubby individual is the next one: weakening steadily he dies in Louis Keseberg’s lean-to soon after his return. You are all suffering now.\n\n\nThe cold is permeating every part of you. Every moment of every day you are hungry and at night the cold numbs your body. It is like being on fire and unable to put it out, one night it is worse than ever and you find all you want to do is give in, to walk out into the howling snow and die rather than go on suffering like this. Your companions are mere skeletons of themselves and despair is etched on every face.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Venture out into the cold", "result": "You too do not survive the year. Rising from your thin blanket you stumble out into the cold. What you are searching for you do not know and never find out. Your body is found the next morning, half buried in snow.\n\n\n ", "action_results": []}, {"action": "Continue suffering", "result": "The New Year brings no fresh joys with it. Those in the cabins around Truckee Lake remain cold and starving and those at Alder Creek are little better off. After the initial wave of six deaths people are adjusting to the terrible conditions but that doesn’t make it any easier. The babies and young children cry continually and it is hellish for the adults. You have heard nothing of the Snowshoes Party and have no idea if any of them have made it to civilization. Things continue to worsen and near the end of January Louis Keseberg’s infant son, also called Louis, dies in the Murphy Cabin. Keseberg is grief-stricken and one night he stumbles into your cabin with his dead baby in his arms and asks you to help bury him in the snow.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Help Louis bury his son", "result": "You stumble out into the snow with Louis and scrabble around in the snow trying to dig a shallow grave. The infant is finally laid to rest but when you return to your cabin you find you cannot see. The world is darkness. Lying down makes it better and during the night you slip away.\n\n\n ", "action_results": []}, {"action": "Try to get him to wait until morning", "result": "You manage to persuade Louis to wait until morning when a group of the remaining men help bury his son. The death of Louis Keseberg’s child is just the first of the year. John Murphy, a strapping sixteen-year-old who looks after his mother and extended family of younger children worsens steadily. His mother, Levinah Jackson, tries to revive him by placing a little piece of meat in his mouth and John swallows it, goes to sleep with a weak gurgling snore and dies. His mother asks you for your blanket to bury the child.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Let him have it", "result": "Without your blanket you have no chance of surviving the bitter cold. Lying in the corner you too go to sleep, a deep sleep from which you do not wake.\n\n\n ", "action_results": []}, {"action": "Refuse to surrender your blanket", "result": "You hold onto your blanket, despite Mrs Jackson’s pleas. The deaths continue: the next to go is Margaret Eddy, the absent William Eddy’s infant daughter. She died one night in the arms of her mother Eleanor and her mother is inconsolable. Margaret’s death means that apart from you there are just forty other people remaining in the camps at Truckee Lake and less than half that at Alder Creek.\n\n\nPatrick Breen and Louis Keseberg want to make sure the Donner group at Alder Ceek are ok and being too weak themselves ask you to travel down to their camp.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Agree to go and visit the Donner's", "result": "You set off on the eight mile journey that morning but your weakened state soon becomes apparent. You get less than halfway before you have to lie down in the snow and rest. You never get up again, your strength simply slips away from you.\n\n\n ", "action_results": []}, {"action": "Sunday 7 February 1847: Truckee Lake, California", "result": "You refuse to make the difficult journey and a few nights later a pair of deaths shake the camp. Harriet McCutchen, an infant both of whose parents have left the Donner Party and who was being looked after by the Graves family dies. The infant had spent most of her waking hours crying and death must have been a release for it. Eleanor Eddy dies too: since her husband left with the Snowshoe Party she has been looked after by the Murphy family. Since her daughter Margaret died she lost the will to live, those she does leave a son James who is a toddler. Their deaths make the mood even more grim, that night as the wind whistles around the huddled cabins you are struck by an urge to go out and find something to shoot and eat.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Go outside", "result": "You set out on your journey but do not return: losing sight of the camp you are hurled to the ground by the freezing blizzard and do not get up again.\n\n\n ", "action_results": []}, {"action": "Monday 8 February 1847: Truckee Lake, California", "result": "The day after the double deaths there is another death: at this rate there will be no one left by the end of the month. A Teamster called Augustus Spitzer collapsed in the Breen house two months ago and has been on the verge of death since. Today he finally dies, imploring Margaret Breen to put just a little meat in his mouth so he might remember the taste of it. There is none to give him and death soon follows. The Breen children are upset by his death and Patrick Breen asks you to help him move the body outside.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Help Breen move Spitzer's corpse", "result": "You help Breen carry Spritzer outside but when you come back inside you find you cannot stop shake in. Lying down you force yourself to go into an uneasy sleep but it is one that you do not awake from.\n\n\n ", "action_results": []}, {"action": "Refuse", "result": "You refuse to go outside and remain in the cabin. The next day is Reed Teamster Milt Elliott’s last dawn. Lacking the strength to even get out of bed he lies muttering to himself and shaking all day before finally slipping away. The girls of the Reed family, some of whom were very fond of Elliott, bury him in the snow. That night Levinah Jackson approaches you and slips $100 into your hand. “I need meat so badly” she whispers to you. “Go and cut Milt’s hand off and the money is yours.”\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Go and hack up Milt", "result": "You go out into the cold and begin digging around for Milt’s body. Instead you find your strength fading from you and slowly sink into the snow. You are found there the next morning, frozen stiff and very dead.\n\n\n ", "action_results": []}, {"action": "Give Mrs Jackson's money back to her", "result": "You refuse to desecrate the dead and give Mrs Jackson’s money back to her, she returns silently to her cabin. Almost stubbornly you continue to survive, holding yourself together and then, finally, a wonderful thing happens. A party of seven men, backpacks bulging with food, reach the camp at Truckee Lake. They have been sent from California: it seems that at least some members of the Snowshoe Party made it through and now rescue missions are being mounted. While some of the settlers travel down to visit the Donner Brothers the others remain at Truckee Lake and provide what medical treatment they can. It is too late for little Catherine Pike, an infant child in the care of her grandmother Levinah Jackson. Unable to even cry the child had been reduced to moaning feebly until one day it just passes away.\n\n\nThe rescuers re-gather and prepare to leave. They have decided they can take twenty-one people with them: weak teamsters Noah James and John Denton, women Margret Reed, Philippe Keseberg, Doris Wolfinger and Eliza Williams and fifteen children. The remaining men (George Donner, Patrick Breen, Louis Keseberg and Donner wagon-driver Jean Trudeau) have chosen to stay so that the women and children can leave in safety. More help is on it’s way to rescue them but if you truly insist you will be allowed to accompany the First Relief down.\n\n\nWhat do you do?\n\n\n ", "action_results": [null, {"action": "Wait for more help", "result": "You are considered healthy enough to remain behind along with Louis Keseberg, Patrick Breen, Elizabeth Graves, Levinah Jackson and a multitude of fifteen children. The First Relief leaves some food which does help see you all through to the end of February without any more deaths, though some alarming things do occur: Mrs Jackson tells you and Breen that she is considering digging up Milt Elliott and eating him. You have heard that George Donner said a few days ago he intends to eat the dead if no more help arrives soon. On the bright side an Indian randomly wanders into the camp, gives out a few edible roots before walking off, a comforting sign that the snow is indeed melting and the passes are becoming passable.\n\n\nThis is confirmed when a second party of rescuers led by James Reed and William McCutchen arrive at the cabins on the first day of March, reuniting Reed with two of his children. You learn that they met the First Relief going down the mountain, by which point two of those rescued (John Denton and Ada Keseberg) had already died. Now the rescuers gather together seventeen of the most ill-looking survivors (including Patrick Breen) from both Truckee Lake and Alder Creek, leaving a few men behind to look after the thirteen being left behind.\n\n\nWhat do you do?\n\n\n ", "action_results": [null, {"action": "Stay with those that are left", "result": "After the Second Relief leaves you are left at Truckee Lake with Louis Keseberg, Levinah Jackson, her son Simon, Jeremiah Foster (an infant whose parents left with the Snowshoe Party) and James Eddy (an infant whose father left and mother has died). You are occasionally visited by Nicholas Clark, a rescuer left behind to help but there is little he can do as you have no food and are starving. One night Keseberg takes the Foster child to his lean-to for the night, wrapped in blankets, but by the next morning he is dead. Hysterical Mrs Jackson accuses Keseberg of murdering the infant. The Eddy infant dies soon after too and both babies are cut up and eaten by Keseberg and the others.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Refuse to eat the human flesh", "result": "You refuse to eat any human flesh whatsoever and your determination costs you your life. You expire that very night of hunger, cold and despair.\n\n\n ", "action_results": []}, {"action": "Eat the meat", "result": "Reluctantly you eat the flesh which ensures your survival. The deaths of the infants mean there are just the four of you left at Truckee Lake when a third rescue party led by William Eddy and William Foster arrives. As you have recently eaten both of their children the meeting is more violent than is necessary: in fact Eddy threatens to kill Louis Keseberg if he ever meets him again in California. The two men calm down sufficiently to agree to take Lavinah Jackson’s young son Simon with them back to safety before going down to visit the Donner’s. They return with George Donner’s three daughters Eliza, Georgia and Frances, the teamster Jean Baptiste and the rescuer Nicholas Clark and prepare to leave. To get Eddy and Foster to agree to take you to California you will have to beg them or stay and wait for more help.\n\n\nWhat do you do?\n\n\n ", "action_results": [null, {"action": "Stay with Louis Keseberg and Lavinah Jackson", "result": "When the last relief party leaves you are left with Louis Keseberg and Lavinah Jackson and the latter is not good. Recently she has been hysterical, laughing and weeping, but when the rescuers leave with her last child she lays in her bed, lies down and faces the wall. She moves little for the next few days and though you and Keseberg try to keep her alive there is nothing you can do. She dies one night and Keseberg cuts her up and begins to eat her.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Refuse to eat any more flesh", "result": "You refuse to eat any more human flesh and that night you too go to bed and do not wake up.\n\n\n ", "action_results": []}, null]}]}]}]}]}]}]}]}]}]}]}]}]}, null]}, {"action": "The Truckee Lake Camp", "result": "Building a lean-to on the other side of the Breen Cabin to the Keseberg’s you make yourself as comfortable as you can with blankets. Most of the settlers slaughter their remaining cattle and William Eddy takes his rifle with him most days on hunting trips, killing wolves, owls, ducks, squirrels and even a skeletal bear, the last nearly tearing him to pieces. Patrick Breen entertains himself by keeping a diary. Various efforts are made to cross the mountains but they all fail as it is impossible to battle through the snow.\n\n\nFinally Franklin Graves has the idea to make snowshoes to enable people to walk on the snow and with the help of Charles Stanton they begin manufacturing pairs at the start of December, a slow process. Everyone is hungry and cold now and every night you are chilled to the bone. Baylis Williams, one of the Reed’s wagon drivers is particularly suffering and one night he asks if he can have your blanket, promising to give you his to sleep under tomorrow night.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Let Williams have your blanket", "result": "You let Williams have your blanket and that night your body goes completely numb with cold, despite all the clothes you are wearing. You feel so tired that all you want to do is sleep. Your mind drifts, dwelling on images of hot food and warm baths until you unknowingly slip into a hypothermic state and expire.\n\n\n ", "action_results": []}, {"action": "Refuse", "result": "You refuse to let Williams have your blanket and the next morning he is found to have died in the night of cold. His death sends shock waves through the camp as everyone realises you may all die of cold if no help is fetched. By now twenty pairs of snowshoes have been made and no less than seven volunteers put themselves forward to attempt the perilous journey over the frozen passes to try and get help.\n\n\nThis group consists of William Eddy, Franklin Graves, Patrick Dolan (Patrick Breen‘s friend), Jay Fosdick (Grave’s son-in-law), William Foster (the man who accidentally shot William Pike), Donner teamsters Dutch Charley Burger and Antonio, Sarah Fosdick (Jay Fosdick’s wife), Sarah Foster (William Foster’s wife), Mary Graves (Franklin’s adult daughter), Amanda McCutchen (William McCutchen’s wife), Harriet Pike (William Pike’s widow), Lemuel Murphy (who is twelve) and William Murphy (who is ten). The journey will be dangerous and extremely risky but you can either volunteer or sit tight in the camp.\n\n\nWhat do you do?\n\n\n ", "action_results": [null, null]}]}]}, {"action": "Stay behind to help the Donner brothers", "result": "You go back to try and help the Donner Brothers get up the pass before the snow traps you but it is no good: it is hard work to get anywhere and as the snow gets heavier you are forced to halt at Alder Creek. There the Donner Brothers and their assortment of teamsters begin building tents to protect you from the snow. The Donner Family live in the first one while their teamsters and Doris Wolfinger, who the Donner Brothers have looked after since the death of her husband, live in the second. Soon word comes down the mountain that an effort by the others to get across the summit has failed: the passes are impassable and you are trapped by the snow in the Mountains, unable to move forward or backwards.\n\n\nYour fellow settlers settle at a lake eight miles further up the slope and begin building cabins. The Breen family have their own cabin while the Murphy and Eddy families share a cabin while the Reeds and Graves family share a cabin with Charles Stanton and his two Indians. The Keseberg’s live in a lean-to against the Breen Cabin. Altogether sixty people live at Truckee Lake while twenty-one people live in the Donner’s camp at Alder Creek. For your part you had better move into one of the two camps and make yourself comfortable: the snow won’t melt until Spring and the supplies are not going to last nearly that long.\n\n\nWhich camp do you move into?\n\n\n ", "action_results": [null, null]}]}]}]}]}, {"action": "Volunteer to accompany Reed and Herron", "result": "Your decision to accompany James Reed and Walter Herron raises some eyebrows but you are glad to get away from the increasingly slow-moving group and press on ahead. Unfortunately the journey turns out to be very difficult: you are all unsuccessful at hunting and by the time you reach the Sierra Nevada Mountains you have eaten all your supplies and are surviving chiefly on wild onions and beans. Herron wants to kill the horses for food but you and Reed persuade him that you need them.\n\n\nFinally you make it across the Mountains and in Bear Valley where you have the wonderful fortune of meeting a party of settlers near Johnson’s Ranch, the beginning of civilization in California. They share some food with you and while you are there you meet Charles Stanton, who is on his way back to the Donner Party with seven mules of provisions and two Indians guides. Stanton is delighted to see the three of you and you quickly exchange news.\n\n\nReed tactfully explains that you three were sent ahead of get supplies, leaving out the part about him murdering John Snyder. Stanton tells you that William McCutchen has fallen ill and is resting at Fort Sutter. Reed decides to press onto Fort Sutter with Herron to get more supplies. Stanton suggests that you accompany him back to the Donner Party.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Join Stanton in going back to the Donner Party", "result": "Setting off from California with Charles Stanton and the two Indians Luis and Salvador you initially make good progress. James Reed and Walter Herron are both at Johnson‘s Ranch, both in poor shape but keen to get more supplies from Fort Sutter and follow Stanton back to the Donner Party. Making a swift journey, thanks to your Indian guides‘ expert knowledge of the route you re-cross the Sierra Nevada Mountains and find the Donner Party camped at Truckee Meadows near the Humboldt River in a very bad state.\n\n\nYou are shocked to learn of four fatalities in your absence. Reed stabbed and killed the Graves Family’s wagon-driver John Snyder in an argument which led to his being banished. Louis Keseberg (A German settler with a fierce temper) abandoned his wagon-driver, an elderly Belgian man called Hardcoop, who fell behind and was never seen again. Another settler called Wolfinger was allegedly killed by Indians, though no one saw it except his friends Joseph Reinhardt and August Spitzer who many in the party suspect murdered him. Finally William Pike was accidentally shot and killed by his brother-in-law William Foster (a determined and able man).\n\n\nThe whole Donner Party are on the verge of running out of food, making the extra supplies extremely welcome, and immediately resume their journey after you and Stanton join them. You get a taste of what they have been experiencing when on the first day of the journey nineteen oxen are shot with arrows by an Indian who William Eddy (a first-rate marksman and teller of tall stories) shoots and kills. Soon afterwards George Donner badly injures his hand trying to repair a wagon and the Donner Brothers lag behind the rest of the group.\n\n\nBy the end of October you have reached the Sierra Nevada Mountains but on the last day of October it begins to snow. This is very serious because heavy snow will leave you trapped in the mountains and unable to continue. Patrick Breen (a staunch Catholic who is travelling with his large family), Stanton and a few others press on to try and clear the valley but others like the Donner Brothers are lagging behind and obviously in need of assistance.\n\n\nWhat do you do?\n\n\n ", "action_results": [null, null]}, {"action": "Travel onto Sutters Fort with Reed and Herron", "result": "You travel on to Fort Sutter and there you reunite with William McCutchen. He is recovering well with your illness and as with Stanton, James Reed tells him that he was sent on for supplies with you and Walter Herron. Herron learns that war has just broken out between the USA and Mexico decides to go off and fight but Reed and McCutchen intend to gather a few mules of supplies together and set off back to the Donner Party.\n\n\nUnfortunately just a few days after Reed’s arrival on the last day of the month it starts to snow, lightly around Fort Sutter but heavily in in the Sierra Nevada Mountains. This is very bad as it will mean that the Donner Party, which incidentally includes both Reed and McCutchen’s wives and children, will be unable to cross the Sierra Nevada Mountains. In Fort Sutter there is nothing you can do but watch as snow completely seals the valley, making it virtually impossible to cross. Despite this you, Reed and McCutchen soon set out on a mission to try and reach the stranded settlers.\n\n\n ", "action_results": [{"action": "Back into the Mountains...", "result": "Despite the unlikelihood of making it across the mountains you, James Reed and William McCutchen, the latter still suffering slightly from his illness, set off from Sutter’s Fort to try to reach the Donner Party. Reaching Johnson’s Ranch you are warned by the owner that it is impossible to cross the Sierra Nevada Mountains when the passes are blocked by snow but feeling that you have to at least try you journey on. Unfortunately the owner is right.\n\n\nReaching the Sierra Nevada Mountain Pass with difficult you and your companions discover the snow does indeed makes crossing the mountains completely impossible. Nothing can force its way through it and after several days of struggling you are forced to turn back: there is nothing you can do now but wait until the spring when the snow melts and the Donner Party can be rescued. You can only hope their food supplies hold out until then and as you return to Sutter’s Fort you can’t help but feel relieved you aren’t up there in the mountains with them.\n\n\n ", "action_results": [{"action": "Now you wait...", "result": "For three months you, James Reed and William McCutchen find ways to keep yourselves busy in California. Reed joins in the war against Mexico while you stay with McCutchen in Sutter’s Fort. Near the end of January incredible news arrives: seven members of the Donner Party (William Eddy, William Foster, Sarah Foster, Sarah Fosdick, Mary Graves, Amanda McCutchen and Harriet Pike) have somehow managed to cross the mountains despite the snow and made it to Johnson’s Ranch.\n\n\nMcCutchen is overjoyed to learn his wife has made it and you hasten to Johnson’s Ranch. There you are shocked by what you see: the survivors are skeletal and so weak they can do nothing but eat and sleep. Eddy is the healthiest of them and he mutters a terrible story about blizzards, the deaths of eight of their companions and being forced to eat the bodies of the dead to survive. He is certain it is the same up in the mountains where the rest of the Donner Party is stranded.\n\n\nAs McCutchen’s two young children and Reed’s entire family are still up in the mountains the three of you immediately begin planning an expedition to rescue them. Another rescue effort called the First Relief is being prepared at Sutter’s Fort that will be ready sooner but Reed and McCutchen have the advantage that both of them already know the route. Eddy is determined to accompany the First Relief but he is still weak from his terrible journey out of the mountains.\n\n\nWhich expedition party do you want to accompany?\n\n\n ", "action_results": [null, null]}]}]}]}]}]}, {"action": "Ride ahead", "result": "Though it takes more than a month you manage to make the long and difficult journey to Sutter’s Fort in California, crossing the Sierra Nevada Mountains along the way. William McCutchen and Charles Stanton prove to be good company though by the time you reach Johnson’s Ranch, the first outpost of civilization in California, McCutchen has come down with a fever. It is not life-threatening but he needs to rest.\n\n\nAt Sutter’s Fort Captain Sutter is glad to provide you with seven mules and provisions (accounts will be settled when the Donner Party arrives) and even loans you and Stanton two Indians called Luis and Salvador to help you guide the mules back to the Donner Party. Stanton plans to leave in a few days but McCutchen is no better and you wonder if it might not be better if you stay with him. On the other hand the Donner Party are still out there somewhere and doubtless struggling too.\n\n\nWhat do you do?\n\n\n ", "action_results": [null, {"action": "Stay in Sutters Fort", "result": "Bidding Charles Stanton farewell you remain at Fort Sutter helping to look after William McCutchen. Less than two weeks after Stanton leaves James Reed turns up unexpectedly at the Fort, looking a bit gaunt but in relatively good health. He explains he was sent ahead by the Donner Party to get supplies with his teamster Walter Herron but ran low on food. Herron who has learned that war has just broken out between the USA and Mexico decides to go off and fight but Reed and McCutchen intend to gather a few mules of supplies together and set off back to the Donner Party.\n\n\nUnfortunately just a few days after Reed’s arrival on the last day of the month it starts to snow, lightly around Fort Sutter but heavily in in the Sierra Nevada Mountains. This is very bad as it will mean that the Donner Party, which incidentally includes both Reed and McCutchen’s wives and children, will be unable to cross the Sierra Nevada Mountains. In Fort Sutter there is nothing you can do but watch as snow completely seals the valley, making it virtually impossible to cross. Despite this you, Reed and McCutchen soon set out on a mission to try and reach the stranded settlers.\n\n\n ", "action_results": [null]}]}]}]}, {"action": "Ride with Stanton and Pike", "result": "Staying with Charles Stanton and William Pike you attempt to follow James Reed back to the Donner Party but unfortunately the three of you become lost in the Wasatch Mountains. For twelve days you wander through steep forested hills becoming increasingly worried as your food runs out until finally, when you are on the verge of killing your horses and eating them you encounter the wagons of the Donner Party and are enormously relieved. They have struggled to get across the Wasatch Mountains but have finally reached the Salt Lake Desert; as you and your companions feared you would run out of food in the mountains and starve you, Stanton and Pike are overjoyed to be back. Your odyssey was a sign of how dangerous it can be in the mountains. A few days after you return a tragedy befalls the group.\n\n\n ", "action_results": [null]}]}, {"action": "Remain camped", "result": "Staying with the camp you spend much of your time talking to the Party’s leaders George and Jacob Donner. Both brothers are easy-going: Jacob is in poor health and doesn’t seem to be enjoying the journey very much but George is cheerful and affable: he was chosen over James Reed to lead the Donner Party because Reed can be over-bearing and pompous at times. Sure enough after four days Reed returns to camp alone, having gone on ahead of Charles Stanton and William Pike and boastfully describes how he met with Lansford Hastings and between the two of them worked out the route the Donner Party should take, travelling along the Canyon’s wooded slopes instead of down it.\n\n\nThe route is not a good one however and it takes two weeks to cut a road through a forest of trees, the wagons having a lot of difficulty navigating the steep incline. Stanton and Pike become lost on their return journey and turn up after twelve days spent wandering the Wasatch Mountains, getting so low on food that when they are found they are on the verge of shooting their horses for food. The jubilation of their safe return and finally reaching the Salt Lake Desert is marred by a tragedy that happens the next day.\n\n\n ", "action_results": [null]}]}