{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=45375", "context": "", "first_story_block": "All around you is the smell of warfare. Acrid smoke from the campfires, piss and refuse from the latrines, sweat from the men.\n\n\nAnd fear. You smell that too.\n\n\nThese men have reason to be afraid. You have spent the last few months fighting King Harold's enemies, only to march double-time to confront his most dangerous yet; William of Normandy. His army is camped below, twelve thousand men strong, in comparison to your eight thousand. There is reason to be afraid. Are you afraid? No, you affirm decisively in your mind. You are not afraid. You are Lord Aethelwulf, The Lord In The North, King Harold's most trusted advisor, and the veteran of a hundred battles. Why should you be afraid of an army of ragtag Normans who come to die on your sword?\n\n\nShaking such doubts from your mind, you stride purposefully through the bustle of the camp, intent on checking on the forward defenses. A pair of giggling urchins weave nimbly around you and a staggering drunk lurches out in front of you, notices your sparkling chainmail armor and backs away, apologizing profusely. Striding onward towards the edge of the English camp you pass the watchful gaze of the sentries unchallenged and stand at the upper slope of the hill.\n\n\nYou are not alone. Another man sits on the hill, wreathed in the shadow of the setting sun. Drawing closer you recognize him as Acwellen, a minor lord, but stalwart fighter. His face is stone, his jaw grimly set and his eyes staring out at the horizon. Looking over his shoulder you see the black smoke smearing the red evening sky. In the distance the town of Hastings burns. In the blurry uncertainty of the setting sun, you cannot tell if the glisten at his eyes is tears or just the sparkle of dying sunlight. Acwellen's son, you remember, was put in command of Hasting's garrison.\n\n\nAbove the treeline you can just make out the crackle of flames. Hastings burns.", "action_results": [{"action": "Offer your condolences", "result": "Gently, you place your hand on his shoulder and speak softly\n\n\n\"I'm sorry for your loss. I cannot imagine the pain of losing a son, but I am sure he looks down on you from heaven.\"\n\n\nAcwellen's gaze remains fixed on the burning town, and his face is still set in a mask of stone, but his cheeks are streaked.\n\n\n\"Thank you\"\n\n\nHe exhales shakily, opens his mouth to say something else, then closes it and remains silent, yet the words are plainly on his mind, trying to slip free like hounds on a leash. At last he speaks, grim and quiet, little more than a whisper.\n\n\n\"Can we win this battle?\"\n\n\nThe question hangs there for an eternity, all the fear and anxiety of the English army expressed in the musings of one broken man.", "action_results": [{"action": "Yes", "result": "\"Yes!\"\n\n\nYou bark, with a sudden harshness that surprises both Acwellen and yourself.\n\n\n\"Yes\"\n\n\nYou continue in a softer tone.\n\n\n\"We can win. This is not the end.\"\n\n\nIn your mind there is no room for doubt. You cannot afford it.\n\n\nBehind the screen of trees the town of Hastings roils with flames and the Norman William's horde assembles.", "action_results": [{"action": "Leave", "result": "Acwellen continues to stare into the flickering glow of the burning town. His face is stony, unfathomable. You turn to leave, picking your way through a patch of muck gingerly. Pressing down with your foot, you assess the ground. Certain patches are dry, but the soil is perilously loose. All it will take is a night of rain to turn the battlefield into a muddy hell. Well, you think to yourself, at least the mud will hurt the Normans worse than us.\n\n\n\"Aethelwulf!\"\n\n\nA voice interrupts your musings.\n\n\nA very familiar voice, deep and booming. It is the voice of Harold, your king.\n\n\nAt just under six feet, he stands a head taller than most, and is just on par with yourself. Both his beard and hair are a fiery orange, and both are thick and wild. His chest is broad and his body muscular, but you notice a distinct bulge in the leather jerkin around his midriff; his infamous love of revelry has not gone unpunished.\n\n\n\"Aethelwulf, you canny bastard!\"\n\n\nHe bellows, grinning and thumping you on the back.", "action_results": [{"action": "\"Harold!\"", "result": "Grinning, you embrace your boyhood friend.\n\n\n\"Harold, good to see you, as always.\"\n\n\nHarold grins. \"I know it is! Everyone says the same exact damn thing!\"\n\n\nHe chuckles, long and low.\n\n\n\"But come, I haven't seen you since our last battle! That was two bloody months ago, near as! Where've you been! Avoiding me, have you?\"\n\n\nYou laugh\n\n\n\"If I went to another feast of yours, I wouldn't fit into my mail\"\n\n\nHe shakes his head ruefully\n\n\n\"You should learn to unwind more! Live your life, you know? Speaking of, how's your wife?\"\n\n\nYou nod solemnly\n\n\n\"She fares well, and yours?\"\n\n\nHarold snorts derisively\n\n\n\"Fat and ugly, as always. Ah well, that's what tavern girls are for, eh?\"\n\n\nHe grins and nudges you with his shoulder; you shrug. Harold notices your expression and laughs again\n\n\n\"As chaste as a damned priest! Ah well, we'll break you in eventually.\"\n\n\nAgain you shrug. You and Harold have very different views on the matter, he won't change, nor will you. The best course, you decide, is to skate around the issue altogether. Nodding towards the hill, you speak seriously\n\n\n\"What do you make of our defenses?\"\n\n\nHarold frowns, his earlier humor gone. He throws up his hands irritably.\n\n\n\"My Kingdom depends on a hill and five thousand farmers\"\n\n\nYou shake your head\n\n\n\"Five thousand farmers and three thousand warriors\"\n\n\nHarold nods\n\n\n\"Aye. True enough. We'll make this William pay for every inch, if nothing else\"\n\n\nHe squints at the hill in the fading light\n\n\n\"The scouts say William has four thousand cavalry\"\n\n\nYou shake your head decisively\n\n\n\"No cavalry in the world can break a strong shieldwall\"\n\n\nHarold laughs bitterly\n\n\n\"Our shieldwall isn't strong! It's weak! Half of the bloody farmers don't even own shields! Goddamned useless bastards!\"\n\n\nSurveying the hill thoughtfully, two plans come to mind;\n\n\nYou could craft wooden stakes and plant them along the hill, disorganizing the horse charge.\n\n\nOr you could create makeshift shields for the conscripts, to help them hold the line.\n\n\nThe carpenters will only have enough time to do one of the two tasks, you must choose which you value most. ", "action_results": [{"action": "Craft stakes", "result": "You nod towards the hill\n\n\n\"We should put our carpenters to work, set up some wood stakes along the hill. With any luck, that'll break up most of his cavalry\"\n\n\nHarold grins wickedly\n\n\n\"And a rider on a lamed horse is a dead rider. This is good!\"\n\n\nHe claps you on the shoulder\n\n\n\"I'll have my carpenters start working right away! Let's turn this battlefield into a hell!\"\n\n\nHe laughs, and you see the fire in his eyes. This is what King Harold does best. Strategy and rule he manages, but it's the fighting he loves. You understand the feeling all too well. How many times have you knelt before a cross, armor bloody and gore speckled, thinking back with revulsion and guilt at how you loved it.\n\n\nLoved every bit of it.\n\n\nLoved the blades flashing, reflecting the rays of the sun. Loved the sound of shields splintering, cracking open.\n\n\nLoved the bloody chaos of the shieldwall.\n\n\nIn the clash of the shieldwall it is where men like you, and Harold, and no doubt William too, come alive.\n\n\nThis world has molded you.\n\n\nMolded you into a warrior.\n\n\nYou are bred for this.", "action_results": [{"action": "Sleep", "result": "A warhorn sounds, long and low, dragging you from your sleep.\n\n\nThrowing off your thick fur sheets, you fumble about in the darkness of your tent, feeling for your clothes. Finally grasping your leather trousers, you slip them on and pull the woolen drawstrings closed. Next you retrieve your blue linen tunic and pull the stinking garment over your head. Beside the opening of the tent you find your boots, which you pull on, the well-worn leather forming around the contours of your legs. Fully clothed, you stretch and prepare to leave the comparative comfort of your tent.\n\n\nRising stiffly, you undo the tent flap with dull fingers and step out into hell. The sky is a deep red, and clouds roil overhead. The ground is slick with mud, squelching underfoot. The air itself is inhospitable; it is thick with moisture and clings in the throat.\n\n\nThe warhorn bellows a second time, the sound rolling through the forest of tents.\n\n\nThe Normans are coming.", "action_results": [{"action": "Prepare for battle", "result": "Your squire, an orange-haired young farm boy with a pox-scarred face and an easy smile, drags your chest of armor to where you wait impatiently, listening for the sounds of a Norman advance above the chaos of the camp's preparations. Like a stirred anthill, the English encampment is abuzz with activity, men fetching spears and armor, running to and fro, assembling into companies. Opening the chest, your squire first removes a thick jacket of hardened leather, which you will wear under your mailshirt.\n\n\n\"Thank you, Hugh\"\n\n\nYou say to your squire and tousle his curly orange hair absent-mindedly. Hugh grins shyly and then proceeds to bring forth the next piece of armor, the mailshirt itself.\n\n\nBeautifully forged, the chain links shimmer in the dawn light. As the light bounces of the metal, thousands of scratches can be seen, sanded down but still visible; the marks left behind by thousands of blades. This mailshirt has been in your family for generations, stretching back through hundreds of years of bloodshed and war. Slipping into the metal garment, you feel your squire tug at the leather lacings in the back, tightening the mailshirt around your body. You breathe in deeply, and as your chest expands, so too does the mailshirt, acting with the familiarity of a second skin.\n\n\nNext come the metal strips, a personal favorite of yours. Each strip is made of tough iron, and each is covered in serrations and scratches. These you slip under your trousers and Hugh helps lace them tight to your legs. If an enemy were to try and stab at your seemingly unprotected legs their sword would merely slide off the hidden plating, unbalancing them and allowing you to slip under their defenses.\n\n\nWith your shin-plates cleverly hidden, Hugh unwraps the last piece of armor; your helmet. Masterfully crafted, it gleams in the sun. Complete with cheek-guards, a nosepiece, and spectacle-rings to protect the eyes. Surmounting the front is a snarling metal wolf's head, which stares proudly forward. Slipping the helmet on and tightening the chinstrap, you grin, canines showing.\n\n\nTime to kill some Normans.", "action_results": [{"action": "Find your men", "result": "Orvyn meets you at the edge of camp. A priest and a warrior, an Eriu and a Christian, Orvyn has been your stalwart follower and friend for nearly two decades.\n\n\nYou both clasp hands firmly and grin, filled with pre-battle adrenaline. Although Orvyn is not technically in command of your men, you have left your normal commander, Garyn, back at home to guard your wife and children with a skeleton crew.\n\n\nWith Garyn away, Orvyn is stepping in. He is a good commander for battles; he is amicable and courageous, but also capable and firm. In peacetime he would lack the rigid authoritarianism necessary for drilling the men, but right now they need a man to keep them confident. Orvyn inspires confidence; he isn't especially tall, but he is solidly built and a force to be reckoned with.\n\n\nHis beard and hair are both jet black, and both are kept in place by various bone rings. That, and his sparkling green eyes, give him a look of mad fanaticism that men are all too happy to follow.\n\n\nYou provide the encouragement, and Orvyn provides the fire. Together you are a killing force. Orvyn fingers the axe at his belt restlessly.\n\n\n\"Should we go to the shieldline?\"\n\n\nThere is still probably an hour or more before the two armies actually meet, as men are ever reluctant to face a shieldwall, but being early couldn't hurt.", "action_results": [{"action": "Go to the Shieldwall", "result": "Most men are already at the edge of the camp, loosely organized into their respective groups. You find your soldiers lounging in the grass to the left of king Harold's men. Some laugh and cajole with each other. Some sharpen their weapons idly. Others play dice with Harold's Housecarls. One has undone his breeches and is calmly urinating in the direction of William's army. In short, of the seventy warriors under your command, not a single one looks concerned or frightened.\n\n\nThat makes you proud. Most of these men you trained since boyhood, and for many you serve as a father figure. When they stand beside you at a shieldwall you have absolute confidence in your safety. They would risk their lives to save yours, and you would do the same for any of them.\n\n\nYou only wish you could say the same for your fyrdmen. Nearly a hundred and fifty, and every single one looks terrified. You can hardly blame them. In the clash of a shieldwall, it is the fyrdmen who bear the brunt of the assault. To break a shieldwall, aiming for its weakest combatants is a common strategy. With Harold outnumbered to begin with, more fyrdmen than normal will be forced into the front ranks. The continued success of the English nation could well depend on their spirits.\n\n\nApproaching some of your men, who greet you amicably but respectfully, you instruct them to spread some of your ale reserves amongst the fyrd. Although you always fight sober, many of your men prefer to battle under the comforting haze of ale, and so long as they remain sharp enough you permit it. Some men just aren't capable of facing the sheer brutality of a shieldwall sober.\n\n\nSomeone calls your name. Turning, you see Harold waving to you from the midst of his group of Housecarls. He grins excitably, filled with the same mad energy that bubbles inside of you. His armor is expertly wrought, fine mail links that shine red under the ominous clouds. At his belt a gold-hilted sword rests in its sheath, and slung across his back is a heavy Daneaxe. His roundshield is thick and red, and is emblazoned with his personal banner; the Fighting Man. A symbol as legendary as King Harold himself, the Fighting Man depicts a golden warrior, wielding a Daneaxe and roundshield. His face is filled with the mad joy of battle, and under his watchful gaze the forces of England will stand against the Norman tide.\n\n\nMoving closer, Harold clasps your forearm with his free hand\n\n\n\"Ready?\"\n\n\nYou nod fiercely\n\n\n\"Always\"\n\n\nHe smiles, but for a moment you see a flicker of emotion cross his face. Tiredness? He opens his mouth slowly, mulling his words\n\n\n\"Once this war is over, I think I'll-\"\n\n\nOne of Harold's Housecarls interrupts the conversation\n\n\n\"My liege, the Normans are advancing!\"\n\n\nInstantly, Harold leaps back into action. Waving his shield, he calls not just to his own men, but also to all the men across the English line\n\n\n\"To arms! To arms! Form a shieldwall!\"\n\n\nThe cry of \"shieldwall\" is taken up across the line, as men rush to the front, each shield overlapping with the one to the left, forming an impenetrable wall. In theory. Calling to your men, you order them to form up beside Harold's.\n\n\nThe fight for England has begun.", "action_results": [{"action": "Ready your weapons", "result": "\"Shields!\"\n\n\nBellows a Housecarl standing to Harold's right.\n\n\nThe English line reverberates with the clacking sound of wood on wood as men rattle their shields, making sure they overlap with their neighbors'. Leaning forward, Harold waves at you from his position on the shieldwall and grins, his teeth shining in the dawn light.\n\n\nBehind the king, the great Dragon Banners of Wessex fly. Enormous and red, they flap and flutter in the gentle morning breeze, snarling at the approaching Normans. Looking down the hill you watch the Norman advance.\n\n\nIt is simply incredible. At least a thousand horses have lined up at the base of the hill. Their riders wear good mail army, which glints in the light, and long blue Norman kite shields, which provide good full body protection, but are slower and less flexible than your English roundshields. For armaments they carry long lances and spears, as well as longswords. To protect their heads they wear the classic Norman helmets, conical and tall with comically long nasal plates.\n\n\nThe whole situation is laughable. You turn to Orvyn, who stands beside you and is also grinning\n\n\n\"How stupid can these Normans be?\"\n\n\nOrvyn shrugs\n\n\n\"They're not used to facing real warriors. Killing fleeing peasants is one thing. Riding down a shieldwall, especially uphill? Well-\"\n\n\nHe fails to suppress a chuckle\n\n\n\"Let's hope they're slow learners!\"\n\n\nThe men around you laugh, and that laughter drifts up and down the shieldwall. The mood begins to lighten. Still grinning, you sheathe your short sword and draw your long sword from across your back.\n\n\nThe greater reach will make it easier to kill the horses.\n\n\nEasier to kill the fools.", "action_results": [{"action": "Prepare to face the cavalry", "result": "Despite your amusement at the Normans' lack of strategy, the charge impresses you. The sound of a thousand horses' hooves pounding the mud and churning the soil, is thunderous. The vibrations shudder under your feet.\n\n\nOut of the corner of your eye, you see some of your fyrdmen begin to back away, and you bark at them to get back into line. They comply gingerly.\n\n\nYou can almost smell their fear.\n\n\nYou watch keenly as the Norman horses near the stakes. During the night, Harold's carpenters cut a great number of them, and they litter the hill in uneven clusters, about three quarters up. Most of the riders edge their horses through the gaps, but a few are careless and their horses fall screaming, dragging down other riders with them. The spikes catch no more than fifty, but every bit counts.\n\n\nThe horses are fast approaching the top of the hill. Harold barks out an order to his Housecarls, and one in every two sheathes sword and shield in favor of a Daneaxe. Held two-handed, their reach, in the hands of a capable warrior, is more than enough to counter the reach of a man on horseback.\n\n\nYou take a quick look at the faces of your men. Some are scared, but none show it. Your shieldwall is as solid as a palisade, an impenetrable barrier of wood and steel. The horses are very close now, and the drumbeat of their hooves beats in frantic time with your heart.\n\n\nYou size up the mounted warrior barreling towards you. His horse is a chestnut hue, with a dark black mane. The rider wears a mailshirt and Norman helmet, as well as the customary blue kite shield and a long thin lance.\n\n\nMaking sure your stance is good and firm, you prepare to take on your adversary.", "action_results": [{"action": "Hold firm", "result": "The rider thunders towards you, his horse kicking up thick clods of mud. Drawing close, he plunges his lance forward, but you slash sideways with your longsword and knock the spear into the ground. The thin lance bends and then breaks, splintering along its core.\n\n\nDisgustedly, the Norman tosses the broken lance aside and moves to draw his sword, but you are already counterattacking. Twisting your wrist, you backswing the blade into the horse's mouth, lacerating its cheeks and splintering its teeth. The wounded animal screams, wide eyed, and collapses on the ground, trapping its rider.\n\n\nAs the Norman struggles to free himself you slip your blade neatly down his mailshirt and thrust deep, driving a foot of steel into his body. The Norman gasps pitifully and lolls sideways, dead.\n\n\nThe horse is still screaming, kicking up clods of earth. One of its flailing hooves strikes Orvyn's shield, knocking him back a pace. Recovering, he ducks under the flurry of hooves and swings his axe down, hard, crushing the poor beast's spine. Its long legs stop moving.\n\n\nSatisfied, Orvyn returns to his position on the shieldwall. Across the line, William's horsemen meet similar fates. To your right, you watch one of King Harold's Housecarls fully behead a horse with his Daneaxe, mid-charge. Spurting blood, the headless beast collapses to the ground, and before its rider can regain his footing he meets a similar fate at the hands of the grisly Daneaxe. On the far left, a horse actually breaks through, the rider spearing a man through the neck and then creating an opening by hacking wildly with his sword. His act of valor is short-lived. The fyrdmen swarm the rider from all sides, butchering him with their axes and scythes. The breach in the line quickly closes.\n\n\nThe Norman horsemen who are still alive turn tail and ride their horses back down the hill. The top of the hill is spattered with the corpses of horses and their riders. Perhaps a full three quarters of the charge were vanquished. Orvyn, his face slick with horse blood, grins at you. You grin back.\n\n\nThe shield line has held.", "action_results": [{"action": "Keep the line steady", "result": "For almost half an hour, you wait. At the bottom of the hill, the Norman forces swarm, but make no attempt to push forward.\n\n\nBy now, your heavy linden shield is weighing your arm down, and your muscles are beginning to tire. Loosening the straps, you place it carefully on the muddy soil, and motion for your men to do the same. They all sigh with relief, and there is much muscle rubbing and idle chatter. So long as they stay in their positions, you allow them to relax.\n\n\nWith forces of this size, the battle could easily take all day. Idly, you watch the Norman forces. They don't appear to be doing anything of interest. You are about to strike a conversation with Orvyn, when a portion of the Norman line surges forward. Some of the men stumble to their feet, but you wave them down. The hill is at least three hundred feet, and the Normans appear to be on foot. You stare at the mass of men in a state of bewilderment. All of them seem to be fairly lightly armored, none of them sparkle, like the men in mail shirts do. Suddenly, the advance stops, not even halfway up the hill. Why they would just stop seems ridiculous, unless-\n\n\nYou leap up and call out frantically, not just to your men, but to everyone else across the line\n\n\n\"Shields! Shields!\"\n\n\nYou tear yours from its resting place, fasten it to your arm, and then hold it above your head. Other men follow your lead.\n\n\nJust in time. A dark cloud wafts from the Norman advance to the English line. Arrows. Thousands and thousands of arrows.\n\n\nThey whistle through the air like a swarm of enraged wasps, raining down upon the English line. Three arrows strike your shield, each one slamming into the thick wood with hammer blows. Across the line men fall to the deadly barrage, clutching at feathered shafts protruding from throats and chests.\n\n\nThe fyrd are hit by far the worst, devoid of protection, they die where they stand, too tightly packed too dodge. For a brief moment many seem on the point of breaking, but warriors in the rear quickly push them back into line and try to protect them with their shields, the effort is mostly futile, but it helps reassure them.\n\n\nIn all the commotion; the screaming and shouting, the whistling of arrows, you almost miss the noise. That unmistakable drumbeat of horse hooves.\n\n\nBy now the horses are quite close, and the arrow rain has stopped, as the Norman archers are wary of killing their own riders. You drop your shield down and heft your longsword.\n\n\n\"Shields forward! Shields forward! Hold the line!\"\n\n\nYour warriors respond instantly, as do Harold's Housecarls. Shields drop forward and interlock, forming a solid barrier to thwart the Norman riders. You focus on the rider charging towards you, he has his lance couched under his arm and pointed directly at your shield.\n\n\nSuddenly, as he approaches the line a javelin, thrown by a man behind you, pierces the horse's chest. The animal screams and froths blood. It drops to its knees and pitches forward, you take a half-step closer and thrust your longsword straight into the Norman's throat. He chokes hot blood and keels over, falling on top of his dead steed.\n\n\nYou nod in satisfaction. In front of you there now lies a barrier of two dead horses. Looking left and right, you survey the battle-line. As expected, your men and the Housecarls have fared fine, killing or throwing back their attackers.\n\n\nThe same cannot be said for other places on the line. In some places, the Norman riders were able to break through, and although the Normans were quickly killed or driven off, many of the bodies strewn across the field are English.\n\n\nThe shieldwall has held, but barely.", "action_results": [{"action": "Hold the line", "result": "The sun is now high in the sky. You have lost track of the hours, and the number of Norman attempts. Every attack is the same. First comes the barrage, then the charge of cavalry. The fyrd has been decimated, perhaps a third have either died or run away. The toll on the warriors has been lighter, but no less serious. Because of your proximity to the King, your soldiers have been hit hard, and many of their bodies lie limp along the battle-line. You and Orvyn are still in fit shape, although you are both tired, and your arm aches from holding your shield, which has been gnawed to splinters by the constant rain of arrows.\n\n\nA painfully familiar whistling fills your ears. Groaning, you lift up your shield to ward off the barrage. You're just so, so tired...", "action_results": [{"action": "Keep holding the line...", "result": "You have no idea what time it is, but the sun is beginning to lap at the treetops, and a blissfully cool evening breeze wafts around you.\n\n\nYou crouch in the blood-soaked mud, behind the shadow of a horse corpse. The blood is everywhere. It coats your sword. It is spattered across your mailshirt. It is smeared across your face. For the first time in a long while, you want to throw up.\n\n\nThe battlefield is littered with corpses, human and animal. Mostly human. Mostly English. Only a quarter of the fyrd are still alive. No, that's not right. You look around briefly. Maybe a sixth. No one has remained unscathed, not even Harold's legendary Housecarls. The shieldwall has been effectively broken, men huddle in small groups behind the cover of dead horses, each spattered with arrows. To stand out in the open is to die.\n\n\nYou peer over the top of your horse carcass. You have done grave damage to William's forces, but they are still numerous.\n\n\nIn fact, as you watch, you see men advancing. Your hand twitches, an instinctive raising of the shield hammered into your brain by years of training. However, you pause briefly. The masses of Normans aren’t archers, or cavalry. They are infantry. Thousands and thousands of foot soldiers.\n\n\nThroughout the day, William has sent them at you, but never in these numbers. You grip your sword.\n\n\nThe end is near.", "action_results": [{"action": "Fight", "result": "The Normans advance, neat and orderly. Their armaments are very similar to that of their riders. Most wear mailshirts, and those bizarre conical helmets. Some carry axes, most carry swords, but all heft the customary Norman blue kite shield. That, at least, is some consolation. Whereas you English fight as a cohesive team, the Norman's tend to fight as individuals, because the kite shield, although effective, cannot interlock with that of a neighbor's. Despite your weakened state, a lone Norman is still a dead one.\n\n\nYou crouch low behind the horse corpse and wait. The familiar jingle of mailshirts heralds their arrival. Beside you, Orvyn bristles, but you put a cautionary hand on his shoulder. You want them close.\n\n\nYou wait a moment more, then leap out. Your longsword snakes forward, lashing out at a Norman's face. He raises his kite shield to deflect the blow, but as he does one of the men on your right sweeps his blade down and cuts into the Norman's ankle. The man screams and drops to one knee, Orvyn's axe crushes his jaw.\n\n\nYou press into the gap and push the Normans towards Harold's Housecarls, whose bloody Daneaxes make short work of the thin kite shields. Ducking under a Norman sword thrust, you stab forwards and gut the man. Kicking him aside, you search for your next opponent...\n\n\nAnd find no one. The Normans are retreating. To your left, you notice King Harold. He waves madly with his axe, and men are surging forward alongside him. With a sudden shock you realize he is trying to rally the men and charge downhill, towards William's retreating infantry.", "action_results": [{"action": "Follow Harold", "result": "Adding your voice to the English battle cries, you advance on the fleeing Norman foot soldiers. In front of you, one stumbles as his boot slides through a patch of reddened mud. He only falters a moment, but it is enough. Your longsword lances forward, piercing the fleeing Norman's calf. He screams and falls, holding up his arms to futilely ward off your blade.\n\n\nYou keep moving forward, using your heavy shield to shove the wounded Norman out of your way. Behind you, Orvyn's axe resonates with a heavy crunch as he finishes off the crippled soldier.\n\n\nAhead of you, another Norman stumbles forward, a heavy javelin slamming into his shoulder. He manages one strangled yelp before your blade connects with his neck, a heavy swing that severs his jugular and jars against his spine. You wrench the sword free and keep moving. This charge has filled you with fresh energy, filling your mind with bloody courage, but now it is starting to ebb and your mind is working more clearly.\n\n\nThere is something very wrong here. This retreat is far too organized, too simultaneous. The Norman foot soldiers are increasing the distance between themselves and the beleaguered English soldiers, the pounding of their feet grows fainter, but another pounding grows louder. Horse hooves.\n\n\nYou turn to your left, Harold has thrown off his battered shield and carries only a Daneaxe, which he wields two-handed. He is completely out in the open.\n\n\nYou turn and race towards him.", "action_results": [{"action": "\"Harold!\"", "result": "\"Harold!\"\n\n\nYou call out, sprinting towards him. He half turns towards you, and flashes one of his charismatic bright smiles.\n\n\nThe single arrow that flies through the air surprises you more than Harold. Curving gently, it hisses downward and slams into Harold's eye.\n\n\nHe lets out a startled cough and staggers backward. You keep running towards your king, but a Norman rider cuts in front of you.\n\n\nTurning his horse neatly, the Norman swings his blade and opens your King's throat, spraying blood.\n\n\nHarold falls to the ground, dead.\n\n\nYou falter indecisively, filled with wordless horror and remorse.", "action_results": [{"action": "Fall back and gather your men", "result": "You back away, slowly at first, then swiftly.\n\n\n\"Back! Back to the horses!\"\n\n\nYou repeat your message, shouting as loud as your worn throat will allow. Men begin to gather around you. You look to your left; Norman horsemen have obliterated the line, fyrdmen and warriors alike are being hacked down as they run. The right flank has suffered the same fate. Wordlessly, you turn your back to the men of the flanks and retreat to the center.\n\n\nAround you stand perhaps a hundred men, the last of Harold's great army. The horses ride towards you from all sides.\n\n\n\"Shields!\"\n\n\nOrvyn echoes the cry. Men embrace briefly, and then turn to lock shields. Someone calls out \"For Harold!” No one cheers. Even the Housecarls are wearied by the prospect of an imminent death. The horses draw close. You whisper a prayer for your family.\n\n\nYou fight with cold fury, sword flashing. Horses crash through your shieldline, circling, wheeling, killing left and right. You refuse to break.\n\n\nAt some point the Norman infantry joined the fight. That was shortly after you lost your shield. Or was it shortly before? You can't remember.\n\n\nYour world is blood and steel, screams and death.\n\n\nPerhaps it is a horse's hoof, perhaps a soldier's mace, maybe even a Norman shield. You're not sure what it is, but it strikes the back of your skull with tremendous force, knocking you into the mud and blurring your vision.\n\n\nYou try to rise but the mud grabs you and drags you into the abyss.", "action_results": [{"action": "Blackness...", "result": "The small, cramped room is dark, but your eyes have long since adjusted to the dimness.\n\n\nFor nearly a month you have languished here, confined under what was once the seat of England's power; the ancient city of London.\n\n\nYou yawn tiredly and stretch, your hand strikes the hard stone wall on your left, which is slick with fungus. Beside you, others stir. The prison cell holds a grand total of twenty-two men; of the seventy soldiers you brought, only they remain. Beside you, Orvyn mutters prayers in his native Irish tongue. You lie quiet amongst the molded straw, conserving your strength.\n\n\nA searing flare of light illuminates your surroundings. Shielding your eyes, you stare groggily through the iron bars of your cell at the sharp outline of a man holding a torch, flanked by two guards. The man rattles at the iron bars with the flaming head of his torch, casting sparks which smolder in the wet straw.\n\n\n\"Lord Aethelwulf, you have been summoned to meet with King William. You will come with us immediately.\"\n\n\nHis English is heavily accented, but understandable, you struggle to rise, but Orvyn gets up first\n\n\n\"Lord Aethelwulf does not leave without me.\"\n\n\nThe two guards look expectantly at the torch-bearer. He looks bored.\n\n\n\"Very well, Lord Aethelwulf may have his retinue\"\n\n\nHe leans in menacingly, glaring at Orvyn\n\n\n\"Try anything, and you die\"\n\n\nHe shoves the torch deeper into the cell, illuminating the huddled masses of your soldiers\n\n\n\"The same applies to you lot\"\n\n\nWithout another word, the torch-bearer withdraws a thick metal key and unlocks the prison door. The guards level their spears threateningly.\n\n\nYou and Orvyn leave the prison and follow the torch-bearer into the light.", "action_results": [{"action": "Follow the Normans", "result": "As you exit the dungeon, the torch-bearer leaves his torch in a wall bracket and continues to walk up a set of sharp flagstone stairs. For the first time in a month you see true, pure sunlight. Your weakened eyes strain to adjust, but they quickly regain their vitality and the world returns to its former luster.\n\n\nBehind you, Orvyn catches his foot on one of the flagstones. He plunges forward, and as he grabs hold of you for support, he whispers in your ear\n\n\n\"Just say the word.\"\n\n\nYou keep your face emotionless. Up ahead, a long corridor leads toward a huge set of wooden doors, flanked by two taciturn guards, and within those doors lies the throne room.", "action_results": [{"action": "The Throneroom", "result": "Your jailor steps up to the guards and speaks to them in French. They salute hastily and step aside.\n\n\nThe Norman grasps two iron facets on the doors and pulls back, drawing open the wooden doors with an aching creak.\n\n\nInside, a woven blue rug leads inward. The guards press you forward from behind, and two more from within the room keep pace adjacent to you. You keep walking.", "action_results": [{"action": "Walk forwards", "result": "You remember what this room was like a year ago. Men and women laughed and cajoled, children played with the great wolfhounds that were always on the hunt for table scraps, and bards echoed melodies that filled the rafters with pleasant music.\n\n\nBut that was a different time, under a different king.\n\n\nThe throne room is empty, other than a handful of guards and a few servants milling idly, the throne room is devoid of people. It is silent too, the place is blanketed by an austere noiselessness, so that every footstep makes a clattering echo. Residing over it all, William sits in the throne, glaring at you thoughtfully.\n\n\nWith just a handful of meters separating you and the king, your guards stop you. William looks at you expectantly.", "action_results": [{"action": "Kneel", "result": "With a bitter taste in your mouth, you kneel. Orvyn looks openly disgusted, but he too gets down on one knee. William smiles contemptuously, he speaks softly, in an English that is only faintly accented.\n\n\n\"Ah, this one knows his manners. Good.\"", "action_results": [{"action": "Thank him", "result": "\"Thank you\"\n\n\nYou snarl through gritted teeth. Anger wells up inside of you like a storm, like an enraged beast trapped inside a frail cage of flesh and bone. Beside you, Orvyn notices your anger and tenses up, every muscle in his body is ready to spring into action. Even William notices the tension and waves discreetly to the Norman soldiers behind you. You feel cold steel pricking at your back. William glares icily, he leans forward.\n\n\n\"You might be wondering why you are still alive, no?\"\n\n\nYou shrug sardonically. William pretends not to notice your insolence.\n\n\n\"The North has proven especially difficult to pacify. I could have you executed, and place a Norman in charge, however I believe the peasants would disapprove, and I would prefer to keep them alive\"\n\n\nHe pauses briefly, mentally collecting his words\n\n\n\"As such, I am reinstating you as lord in the North, providing you swear fealty to me\"\n\n\nHe leans even closer\n\n\n\"Make no mistake. You will be closely watched by one of my men, whom you will take orders from. This is not an offer. Swear to me, or die. Your choice.\"", "action_results": [{"action": "Take the Oath", "result": "You swallow your pride, and your anger. You think of your family; your wife and children. It still feels like cowardice.\n\n\nA Norman page timidly places a worn copper cross in your chapped fingers. You grip it limply and speak the same oath that you gave to Harold not a year earlier.\n\n\nAt the end William smirks, and you drop the copper cross disgustedly. With a casual wave of his hand, William dismisses you from the throneroom.\n\n\nYour audience is over.", "action_results": [{"action": "Leave", "result": "Although the sun is high, the frigid December air pierces your bones, and you draw your tattered cloak tighter around your shivering form.\n\n\nOnce outside of the city walls, the Normans give you back your weapons and your horse. Your men are released, however their weapons are not returned to them and the horses they are given are lame swaybacked farm horses.\n\n\nYour own horse is a magnificent charger named Thunder, a black stallion measuring fifteen hands at his withers. He has been trained as a war horse, and his gnashing teeth are strong enough to snap bone, yet when he nuzzles up against your hand his eyes are soft and his lips are gently. You pat him affectionately on the cheek and then swing into his saddle, feeling the leather's familiar curves.\n\n\nYour breath floats foglike in the cold air, you wait impatiently for your men to get mounted, your hands are beginning to burn.\n\n\nOnce your men mount their horses you ride North; homeward bound.", "action_results": [{"action": "Ride", "result": "You ride all through the day, as fast as your horses can manage. Everywhere you go you see the devastation of William's invasion. Parts of the countryside appear normal, but others are burnt husks, farms and fields replaced with ash and bones. The roads are thick with mounted Normans, they glare at you suspiciously, but one of your men carries the Norman flag, and they let you pass.\n\n\nThe sun is beginning to set, and the cold is becoming too much. Even Orvyn, a man who can walk barefoot through snow without a qualm, looks uncomfortable.\n\n\nYou stop at an abandoned farmhouse, there are large holes in the roof, but your men cut swathes of dead grasses and stuff them in the crevasses. Someone starts a fire in the buildings dilapidated mud-daub chimney, which snakes up the back wall and protrudes through the messy thatch roofing. Normally supper is a time for boisterous laughing and cajoling, but today you eat in silence.\n\n\nAfterwards, you bring several of the horses inside and curl up to them for warmth. Despite the uncomfortable ground and chilly temperatures, Thunder's flank is soft and the methodical rhythm of his heartbeat is oddly calming.\n\n\nYou drift off into a dark, dreamless sleep.", "action_results": [{"action": "Wake up", "result": "You wake up stiff and smelling distinctly of horse. Getting up, you strap on your swords and get your men moving, Orvyn kicks some of the stragglers into action. Your own horse seems reluctant to get up, and it takes all of your coaxing to convince him to get up.\n\n\nYour own muscles are aching from the cold, but a few hours of riding help warm them up somewhat.\n\n\nThe next few days develop a sort of routine; ride, find shelter, sleep, and ride again. As you journey further northward the scenery begins to change. The roads become smaller and more rugged, little more than oxen paths. The Norman presence decreases too; you pass only a few tired looking patrols. The lack of Norman occupation manifests itself in the land too, the devastation seen in the south is not present here, plenty of farms lie abandoned, but few have been burned. Many northern men gave their lives at Hastings, but their families have yet to suffer from Norman vengeance.\n\n\nIt feels good to know that your people are still present, still unified.\n\n\nAt last, you see the banks of the river Ouse.\n\n\nBeyond it lies your home; the ancient city of York.", "action_results": [{"action": "Head to the banks of the river Ouse", "result": "An old roman bridge of crumbling stone fords the Ouse. As you urge your horses towards the edge of the bridge, a dozen mounted men materialize from the treeline on the other side. The riders approach the bridge and halt at its mouth.\n\n\nYour hand reaches for the sword at your sheathe, but you quickly relax. You recognize the man leading the mounted force; his name is Garyn, and he is the captain of your guard.", "action_results": [{"action": "Go meet Garyn", "result": "You dismount and hand the reins of your horse to one of your men. Moving briskly, you cross the old stone bridge.\n\n\nOn the other side, Garyn dismounts and hurries to meet you. It has been several months since you last saw him, however he hasn't changed a bit.\n\n\nHe wears a mail hauberk, and his shield -emblazoned with your snarling wolf sigil- is slung over his back. On his left he wears a thick fighting sword, shorter than your longsword but almost twice as thick. On his right he carries a vicious looking seaxe, a heavy stabbing dagger perfect for thrusting through mail links. His face, like much of his body, is scarred by a lifetime of fighting. He is bald, and his hooked nose gives him a predatory, reptilian look. His eyes are hard, flinty; the eyes of a soldier.\n\n\nYou meet in the middle of the bridge and he clasps your forearm warmly, his face shows relief.\n\n\n\"Our scouts saw you coming, I came as soon as I could. The Lady Catheryn will be overjoyed to hear that you are back\"\n\n\nCatheryn. You feel your heartbeat rise. These months without her have been far too long. You can almost see her, like an apparition drawing you homewards. Footsteps echo on the bridge behind you; Orvyn has joined you. He speaks to you, but his eyes are fixed on Garyn\n\n\n\"We should ride to the villages first. As their lord, you owe them an explanation. Everyone there has a relative who served in your fyrd. They deserve an audience\"\n\n\nGaryn glares contemptuously at Orvyn\n\n\n\"A lord does not serve at the beck and call of his peasants. Maybe if the useless sods had held the line, we wouldn't be in this predicament\"\n\n\nOrvyn takes a step towards Garyn, Garyn's hand drops closer to the lethal looking dagger at his hip. Orvyn keeps his hands well away from his weapons, in an open show of contempt\n\n\n\"Do you want the commonfolk to rebel against us? What harm can it do to delay Aethelwulf's homecoming by a few hours!\"\n\n\nBoth of them turn expectantly towards you, waiting for you to settle their dispute.", "action_results": [{"action": "Agree with Garyn", "result": "\"I want to see my family again.\"\n\n\nYou say it plain and quiet, but Orvyn recognizes the tone of command in your voice. He looks hurt, but relents, shooting Garyn a final angry stare. Garyn smiles and signals to the his men at the bridge\n\n\n\"Come on boys! We're escorting lord Aethelwulf home!\"", "action_results": [{"action": "Go Home", "result": "Between the banks of the rivers Ouse and Foss sits a finger of land, atop which rests the ancient walled city of York. Created by the Romans, its old stone walls have been mostly replaced by wooden palisades, but in some sections they remain; impenetrable rock formations three feet thick and fifteen feet high. Waving methodically in the slow December wind, your snarling wolf banners fly proudly.\n\n\nSurrounding the outside of the city walls, thin huts of mud and thatch lean precariously, using the palisades for support. You curse irritably; those huts will provide excellent cover for any attacker who wishes to besiege your city. Picking its way through the thin cobble street, your horse passes by the frail mud-and-thatch houses beside the walls. From within their shallow depths, grimy faces peer outwards suspiciously.\n\n\nFrom atop the walls, a young man in an ill-fitting mailshirt challenges you\n\n\n\"Go no farther! Who are you?\"\n\n\nA grizzled veteran with a scarred face and grey hair cuffs the younger man over the head\n\n\n\"Open the gate you idiot, it's lord Aethelwulf!\"\n\n\nThe young soldier blanches fearfully, stammers a pardon, and practically leaps off the palisade's platform to unbar the gate; a massive four meter structure of wood and iron.\n\n\nThe gate opens inward with a heavy groan and the young soldier- still looking suitably embarrassed- waves you inside.\n\n\nAs you pass, you grin at him good-naturedly.\n\n\nYou are home.", "action_results": [{"action": "Enter the Courtyard", "result": "The courtyard is a chaos of raised voices and the neighing of horses and the splashing of mud, which coats the ground; it has been churned loose from the frosty ground and warmed by the trampling of hundreds of feet.\n\n\nAcross the courtyard from you is the inner keep, a building made from Roman stone and patched with Anglo-Saxon woodwork. It is where you host your warriors and organize meetings, and it also functions as your personal quarters.\n\n\nYou should organize a meeting soon, but it would be wise to meet with your family first.", "action_results": [{"action": "Find your wife", "result": "Moving with dreamlike purpose, you navigate the halls and passageways within your home. Standing outside the door to your quarters, you fingers feel the familiar shape of the door handle, which opens at your touch. The room is plain, in one corner is a chest of clothes and in the other is a fur bed. On the bed sits your wife, Catheryn. She is angelic in form, swathed in a pale white dress with her long golden hair flowing effortlessly down her shoulders. Her face transitions from shock to delight; her perfect mouth smiles and her bright blue eyes sparkle. Vaulting into your arms, she embraces you, long slender arms twined around your body. Her lips caress your cheek, and she whispers quietly in your ear\n\n\n\"I missed you\"\n\n\nYou kiss her back\n\n\n\"I missed you too\"\n\n\nYour eyes settle to the door in your room opposing the one through which you entered; it is the entrance to your daughter's room. Catheryn's eyes follow yours\n\n\n\"She's sleeping\"\n\n\nShe grins coyly, kissing you passionately", "action_results": [{"action": "Kiss her back", "result": "She tastes so sweet, like spring.\n\n\nHer eyes sparkle and she draws you closer, your hands move down to her thighs, clutching at the gossamer white fabric around her knees.\n\n\nHer own hands, slender and smooth, trace their way down your chest.\n\n\nYou both slip out of your clothes, and slip under the fur bed sheets.\n\n\nFor the first time in nearly a month, you feel warm.\n\n\nFor the first time in nearly a month, you feel happy.", "action_results": [null]}, {"action": "\"I should see our daughter\"", "result": "You return her kiss, but when her hands move down your body, you hold them still\n\n\n\"I want to see our daughter\"\n\n\nCatheryn looks hurt for a moment, but recovers quickly, she flashes you a sympathetic smile\n\n\n\"I'm sorry, I don't mean to be selfish, go in and wake Laila, but-\"\n\n\nShe slips by you and whispers in your ear flirtatiously\n\n\n\"Just don't keep me waiting\"\n\n\nYou kiss her once more before grasping the copper handle of your daughter's door and pushing it open softly. Like your own, your daughter's room is plain, just a bed and chest of drawers, but you notice someone has placed an earthenware jug of flowers on top of the pine chest.\n\n\nLaila is sleeping curled up on her bed, head partially obscured by the thick fur blankets. Her long golden hair, silken smooth like her mother's, cascades over the blanket's contours.\n\n\nYou nudge her shoulder gently\n\n\n\"Laila, wake up\"\n\n\nThe young girl snuffles in her sleep, but otherwise makes no move to wake.\n\n\nWhen you left several months ago, Laila was five and enjoyed sleeping through the day. She is six now, but clearly her sleeping habits have not changed. You shake her again, still delicately, but with an added firmness\n\n\n\"Laila, wake up\"\n\n\nLaila yawns groggily\n\n\n\"Wha-?\"\n\n\nYou wait patiently for her eyes to open, when they do she shrieks with happiness, diamond blue eyes widening with surprise. Wrapping her arms around your midriff with a surprisingly strong grip, she practically squeals with delight\n\n\n\"Father!\"\n\n\nYou tossle her hair fondly, which bunches together briefly but then almost instantly resumes its waterfall-smoothness. She looks at you seriously\n\n\n\"How long are you staying, father?\"\n\n\nYou smile reassuringly\n\n\n\"With any luck, the rest of the winter, past that, I can't say\"\n\n\nWith you now firmly secured in her life, Laila decides to inform you about all the wonderful things she has seen and done while you've been away. You are all too happy to listen; you talk for hours, laughing and cajoling, strengthening the bond that had grown all too tenuous during the long months you were absent.", "action_results": [null]}]}, {"action": "Find your son", "result": "In the courtyard, you grab a passing servant girl by the arm\n\n\n\"Have you seen my son?\"\n\n\nThe servant seems unsurprised at your arrival; evidently news travels fast. She bites her lip nervously\n\n\n\"Ah... yes, yes I have, but-\"\n\n\n\"Where is he?\"\n\n\nYou inquire incredulously. The servant blushes\n\n\n\"He's in the stables my lord, but I really don't think you should-\"\n\n\nWaving off her concerns, you thank her and depart towards the stables.\n\n\nThe stables are large and ornate, a mix of carved wood and interlocking wicker. The smell is heavy of stale hay and horse manure, but the atmosphere is pleasant nonetheless.\n\n\nAt least three-dozen horses of various shades rest in the shade of the stable's long awning, but your son is nowhere to be found.\n\n\nOn a hunch, you decide to check the stable master’s quarters, at the rear of the stable.\n\n\nAs you approach the door you hear a muffled laugh through the porous wood of the door. Undoing the latch, you throw open the door and enter the dimly lit room.\n\n\nInside, you son Eamon, a long-haired blond boy of seventeen lies under an old cotton blanket alongside a freckled girl of similar age. The pair are twined together, moving rythmically, and apparently neither noticed you open the door.\n\n\nYou clear your throat politely. The girl gives a shriek of surprise, and covers herself with a fold of the tattered blanket. Your son looks equally surprised, but emits only a startled cough. You grin\n\n\n\"Hello Eamon\"\n\n\nYou turn your attention to the girl lying beside him.", "action_results": [{"action": "\"Get out\"", "result": "\"Get out\"\n\n\nYou snap idly, sparing her hardly a second glance. Blushing profusely, the young servant girl slips a threadbare tunic over her freckled body and hurries out of sight. Your son stares after her longingly, he sighs exasperatedly\n\n\n\"You didn’t have to do that father\"\n\n\nYou fix him with a hard stare\n\n\n\"I'm sorry, I merely assumed you would prefer to see your father rather than rut in the muck with some servant girl. Apparently I was mistaken.\"\n\n\nYour son mutters something under his breath, you stare him down, daring him to argue with you\n\n\n\"What did you say?\"\n\n\nYour son returns your glare\n\n\n\"Her name is Lynette\"", "action_results": [{"action": "\"You shouldn't get too attached to her.\"", "result": "You bite your lip awkwardly\n\n\n\"You shouldn't do this\"\n\n\nYour son stares at you incredulously\n\n\n\"I shouldn’t love someone?\"\n\n\n\"You are only making this harder for yourself\"\n\n\nYour son glares back at you\n\n\n\"I don't want to marry just anyone. I want to marry someone I care about\"\n\n\nYou grab your son viciously by his shoulders\n\n\n\"Are you insinuating that I don't care about Catheryn!\"\n\n\n Your son backpedals hurriedly\n\n\n\"Of course not, father you know I wouldn't-\"\n\n\nHe searches for words\n\n\n\"I- I just... what if it doesn't work out for me? What if I don't love my wife?\"\n\n\nYou let go of his shoulders limply\n\n\n\"I'm sure you'll love her\"\n\n\nYour son doesn't seem so convinced. He slips on his trousers and shirt and departs the stable master’s quarters in silence, brushing past you on the way out.\n\n\nYou sigh tiredly and depart the stables alone.", "action_results": [null]}]}, {"action": "\"Would you mind if I spoke to my son, alone?\"", "result": "You flash the young girl a warm smile\n\n\n\"If you wouldn't mind, I would prefer to speak to my son alone\"\n\n\nBlushing profusely, the young servant girl slips a threadbare tunic over her freckled body and scurries towards the door, executing a clumsy curtsy as she passes you. Your son stares after her longingly, he sighs\n\n\n\"You didn’t have to do that father\"\n\n\nYou fix him with an amused stare\n\n\n\"I'm sorry, I merely assumed you would prefer to see your father rather than rut in the muck with some servant girl. Apparently I was mistaken.\"\n\n\nYour son mutters something under his breath, you grin\n\n\n\"What did you say?\"\n\n\nYour son returns tries to frown at you, but smiles\n\n\n\"I said her name is Lynette\"\n\n\nYou nod\n\n\n\"Is she a favorite of yours?\"\n\n\nYour son looks shocked\n\n\n\"I love her, father\"", "action_results": [null, {"action": "\"You should\"", "result": "You exhale quietly, you remember all too well the pangs of young love, and with any luck your son will come to his senses eventually. You force a smile\n\n\n\"I'm sure she feels the same way, and I'm glad you've found someone to occupy your time with\"\n\n\nYour son smiles; relieved. Pulling on his trousers and tunic, he embraces you warmly. You hug him back; holding him close to your chest like you did when he was just a little boy\n\n\n\"It's good to see you, father\"\n\n\nTears prickle your eyes\n\n\n\"It's good to see you too, Eamon\"\n\n\n Before your son can notice the dampness around your eyes, you slap him gruffly on the back\n\n\n\"Alright, get yourself cleaned up, I'm organizing a meeting soon and I want you there\"\n\n\nYour son nods happily and exits the stable master’s quarters. Your thoughts turn to Lynette, and you have an uncanny worry that your son's infatuation will not ebb any time soon. Or maybe it will, you think; with young love, it's always so hard to tell.", "action_results": [null]}]}, {"action": "\"What's your name?\"", "result": "You flash the young girl a warm smile\n\n\n\"Hello there, what's your name?\"\n\n\nThe girl stammers out an answer\n\n\n\"L-lynette, milord\"\n\n\nYou nod solemnly\n\n\n\"A very pretty name. Who gave it to you?\"\n\n\nWhile you spoke, Lynette had slipped on her threadbare tunic, in her panic she has managed to entangle the fabric around her face, and the cloth muffles her voice\n\n\n\"My mother works in the kitchen, milord\"\n\n\n\"And the father?\"\n\n\nYou inquire\n\n\n\"I don't know, milord\"\n\n\nShe replies quietly, having finally wrestled her tunic into its proper position. With her attention switched from her tunic back to you, her embarrassment returns\n\n\n\"If milord will excuse me, I should be getting back to the kitchens\"\n\n\n\"Of course\"\n\n\nBlushing profusely, the young servant girl scurries towards the door, executing a clumsy curtsy as she passes you. Your son stares after her longingly, he sighs, and you nod knowingly\n\n\n\"Is she a favorite of yours?\"\n\n\nYour son looks shocked\n\n\n\"I love her, father\"", "action_results": [null, null]}]}, {"action": "Speak to Orvyn", "result": "Orvyn stands with a group of other men, all holding ale cups. As you approach he waves you a jaunty salute, but you sense a sullen undertone. You motion for him to follow you. Walking purposefully, you wait until there is no one in the general vicinity before speaking.", "action_results": [{"action": "\"We should be wary of Garyn\"", "result": "\"I'm worried about Garyn\"\n\n\nOrvyn nods vigorously\n\n\n\"I know exactly what you mean; bloody idiot will get us all killed with his recklessness\"\n\n\nAgain making sure no one is listening, you put a hand on Orvyn's shoulder\n\n\n\"Can I trust you?'\n\n\nOrvyn affirms loyally\n\n\n\"Of course Aethelwulf!\"\n\n\nYou clap him on the shoulder\n\n\n\"I know, old friend, I know\"\n\n\nYou lean in\n\n\n\"I want you to keep an eye on Garyn, make sure he doesn't blunder our men into a trap\"\n\n\nOrvyn checks over his shoulder suspiciously, as though he expects Garyn to materialize from thin air\n\n\n\"Don't worry, I'll watch him like a hawk\"\n\n\n\"Excellent, let me know if he does anything foolish\"\n\n\nOrvyn salutes amicably and departs; you walk in the opposite direction, towards the main courtyard.", "action_results": [null]}, {"action": "\"You need to cooperate with Garyn\"", "result": "You wonder how to put this in a way Orvyn will comprehend; he is not, after all, a man who enjoys playing nice. You decide to start cautiously\n\n\n\"You know, of course, that I do, and always will, trust you with my life\"\n\n\nOrvyn nods slowly, you continue\n\n\n\"You also know that I rely on you to maintain order and discipline amongst the men\"\n\n\nAgain, Orvyn nods, his bright green eyes watching you carefully. You press on\n\n\n\"I need you to be an example to the men, be something they can look up to\"\n\n\nOrvyn runs a hand through his jet-black hair distractedly\n\n\n\"Aethelwulf, I've always done th-\"\n\n\nYou wave him off, and cut to the point\n\n\n\"I can't have you arguing with Garyn. It's bad for moral, and it makes the men lose confidence in their leaders\"\n\n\nOrvyn's pale cheeks are tinged pink, he stares determinedly at his feet\n\n\n\"If my lord would rather put his trust in me then Garyn, he need only say so\"\n\n\nThe coldness of his tone shocks you. You open your mouth to apologize, but Orvyn has already stalked off.", "action_results": [null]}]}, {"action": "Speak to Father Wilfrid", "result": "You decide to pay father Wilfrid a visit. The man has served your family for nearly forty years, and he has served you personally as teacher, mentor, and adviser. As a person, you harbor a vague dislike for him, and the feeling is mutual. However, you can trust him to give good advice, and for that reason you set off in the direction of the huge stone church that towers above every other building within York's walls.\n\n\nThe church, St. Peters, was built nearly three hundred years ago, and it has stood against the tides of half a hundred bloody wars. Staring at the immense building of hard cut stone, you are overcome with a sudden monumental certainty; that one way or another, the church will outlive you, and everyone else. Something about its towering austerity lends to its aura of chilling weariness, like the pressure of an invisible hand.\n\n\nYou never really liked churches, and a career as a soldier has done little to improve the situation. When you enter the building, you can feel the judgment, the guilt, bearing down on you. You have defended your kin and country with the ruthless efficiency of a trained warrior, and for that you have been condemned, deemed impure. No one says this, of course; the priests are always tactful and subservient, listening to your confessions with dull faces, but you sense their fear. They watch you like a caged animal, one that could at any minute turn on its companions. Whenever you touch one of the priests, you see the undeniable flicker of disgust that bolts across their faces for the briefest of instances.\n\n\nTo them, you will always reek of blood.\n\n\nShouldering your emotions, you push open the thick oaken doors that bar your entry to the church.", "action_results": [{"action": "Enter the Church", "result": "Father Wilfrid kneels at the far end of the church, prostrate before a towering sculpture of Jesus upon a cross. He is dressed in a plain woolen robe that drapes loosely across his skeletal form. His hands are spotted with age, and his left shakes incessantly. His lips are thin and chapped, and they move loosely, muttering prayers in Latin. As he whispers, his head bobs slightly, shaking the wisps of white hair that sparsely cover his head.\n\n\nYou wait patiently for him to finish, ignoring the suspicious glances of the other priests. Your eyes drift upwards, where a lengthy tapestry occupies the farthest wall. You spend the next five minutes perusing it idly, watching grotesque caricatures of heathens smolder in the depths of woolen flames.\n\n\nAt last, father Wilfrid finishes his prayers and struggles to rise, heaving awkwardly against a weathered can that shudders under his minute weight. You offer a hand, and he regards it with unhidden distaste, as though you had presented him with a human heart as opposed to an offer of aid. You withdraw the hand tactfully and Wilfrid gets shakily to his feet.\n\n\nHe looks you up and down, as though he expects you to suddenly dematerialize.\n\n\n\"You're back\"\n\n\nYou nod, trying not to think back on your less pleasant schooling days.\n\n\n\"How fare the people?\"\n\n\nFather Wilfrid looks at you with grudging respect. His teachings of angels and gospels have long since faded from memory, but his teachings on the importance of a lord's people have remained steadfast in your mind.\n\n\n\"They fare as well as one might expect. They grieve, and you cannot deny that their grief is largely your fault\"\n\n\nYou exhale tiredly, Wilfrid grabs your arm\n\n\n\"We have our differences, you and I, but we agree on one thing; a lord should never forget about his people\"\n\n\nYou nod and begin to speak, but Wilfrid cuts you off\n\n\n\"I know you must hate the Normans, but if you rebel, you will lose, and it will be the people, your people, who will suffer because of it. You cannot rebel against King William\"\n\n\nThe old priest coughs harshly, his battered lungs quivering. He spits out the last sentence\n\n\n\"If you rebel, we will all die\"", "action_results": [{"action": "\"I won't rebel\"", "result": "You laugh bitterly\n\n\n\"If I wanted to rebel, I would have done it in the throneroom. It's too late now.\"\n\n\nFather Wilfrid looks at you strangely, overcoming a momentary hesitation; he places a scrawny arm on your shoulder\n\n\n\"You are making a wise choice, lord Aethelwulf\"\n\n\nYou want to say something, and for a moment you just stand there, staring at your old tutor. Father Wilfrid breaks the silence\n\n\n\"You should go, doubtless you have work to do\"\n\n\nYou nod and turn to depart, as you leave Father Wilfrid offers one last comment\n\n\n\"I am proud of you, Aethelwulf, even if it doesn't seem like it\"\n\n\nYou push open the heavy church doors and step out into the crisp December air.", "action_results": [null]}, {"action": "\"I will rebel\"", "result": "You lean in, forcing the old priest to take a half step backward\n\n\n\"Who do you give your loyalty to?\"\n\n\nHis answer is immediate and unequivocal\n\n\n\"God\"\n\n\nYour snarl, taking another step forward\n\n\n\"Well, my loyalties lie with England. Always. You would be wise to develop a similar mindset\"\n\n\nFather Wilfrid watches you coldly\n\n\n\"Get out of my church\"\n\n\nLivid with anger, you storm out of the church, pushing open the heavy oaken doors and breathing in the calming December air. ", "action_results": [null]}]}]}]}]}]}, {"action": "Agree with Orvyn", "result": "Thoughts of your wife and children burn inside of you, but a good lord's first priority should always be to his people. You nod to Orvyn\n\n\n\"I will ride down to the villages. Garyn, send us some of your men as an escort.\"\n\n\nGaryn obeys, but his lips are curled in an ugly sneer and he refuses to even look at Orvyn, who wears a distinctly smug expression. Following Orvyn, you turn your back temporarily on thoughts of homecoming. A good lord's duty is to his people, after all. You mount your horse and ride towards the town of Wichestun.", "action_results": [{"action": "Head into town", "result": "You smell the town before you see it. A horrid combination of sewage and rotting thatch permeates the crisp December air. The town has perhaps a hundred homes at most, with most people living in farmsteads around the surrounding area.\n\n\nNormally, the town would be fairly quiet, however today is Wednesday, marketday, and the town is filled with crowds of villagers from the farthest corners of your realm.\n\n\nAs your horses move through the center street, villagers hurry to make room. Some cheer, but others eye you with suspicion or even fear.\n\n\nAt the center of the town, you hold up your fist and your party draws to a halt. A crowd quickly gathers, all eyes are on you. Pausing to gather your words, you address your people.", "action_results": [{"action": "\"We stand together!\"", "result": "You raise your hand and silence falls like a blanket over the crowd of people. Your eyes flick from face, some meet your gaze, others stare at their feet.\n\n\n\"We have been through hell, all of us. You have all lost people to the fyrd; fathers, brothers, sons. I understand your pain. But know this; they died with me, beside me, because we are the north! We live, we fight, and we die together! They say a warrior is only as strong as the shield held by his neighbor, they say this because it is the united who are strong, and we are the united!\"\n\n\nYour escort applauds, rattling swords on shields and roaring.\n\n\nSome of the villagers clap nervously, but others remain still; one, a young woman with a grim face raises her hand.                                                                                                                            \"Why was the fyrd so undersupplied? Why was it not provided with shields?\"                                          One of your men barks at her to be silent, but she snarls back, tears bead her eyes                            \"I lost my husband and my son! Don't you dare tell me to be silent!\"                                               She stabs her finger at you, sobbing                                                                                            \"Answer me! Answer me!\"                                                                                                              One of your men reaches for his sword, but you wave him off. Looking the determined young woman in the eye, you give her an answer.", "action_results": [{"action": "\"War is brutal\"", "result": "You exhale tiredly and spread your hands sympathetically\n\n\n\"I am sorry, truly I am. By joining my fyrd your husband and son were put in a dangerous position, and regrettably they were killed. I can never ask you to forget, but I can ask you to forgive. Will you do that?\"\n\n\nThe woman says nothing; her cheeks are streaked with tears. Bowing her head, she pushes through the crowd, away from the market square, people make way respectfully. Tugging at your horses reins, you turn homeward, and your escort silently follows you.\n\n\nThe crowd remains silent, watching.", "action_results": [null]}, {"action": "\"If I could have saved them, I would have\"", "result": "You sigh, an angry rush of air escapes your mouth. You lean in, and the woman recoils momentarily; mounted on your horse with gleaming steel at your waist, you look like an imposing figure. Sensing your tense emotions, Thunder bares his thick teeth, but you quiet him.\n\n\n\"If I could bring your husband and son back from the dead, I would. Truly. I do feel every fyrdmen lost under my service to be a terrible tra-\"\n\n\nThe woman glares at you angrily, stepping forward\n\n\n\"Do you think I care? Do you think I want your condolences? My son, my husban-\"\n\n\n\"I have lost people too!\"\n\n\nYou snap irritably, and she backs off carefully. The crowd is tense, and your guards place hands on swordhilts. You wave them down and continue talking.\n\n\n\"I have lost family too. Every soldier dead in my service is a brother whose death I mourn. You lost two people, and I know their deaths will haunt you. But I am haunted too. I am haunted too; I am haunted by the deaths of not only the forty-eight warriors I commanded, many of whom I knew since they were boys, but also the deaths amongst the fyrdmen who died alongside me. We were all brothers; me, the fyrdmen, my warriors, all of us. those men who died were my brothers, and I mourn them like any other would. So know this; you do not grieve alone\"\n\n\nThe woman meets your eyes for a long moment, and then turns away, the crowd lets her pass. Did those eyes hold forgiveness? Maybe. The crowd is equally divided; some seem unmoved, but many others look at you with a new appraisal.\n\n\nSatisfied, you turn your horse homewards, and your escort follows.", "action_results": [null]}, {"action": "\"I am sorry for your losses\"", "result": "What can you say? The truth, you suppose.\n\n\n\"War is brutal, it is horrific and ungodly. It is savage and barbaric. That your son and husband died is tragic, but it is also a reality, and it is a reality that we fast approach. William will come here, and the killing will continue, because that is war. And in the world of today; war is life. It is terrible and tragic, but it is the life we live and I cannot shield you from that.\"\n\n\nYou search for more words, but none come. None are necessary. The woman exhales heavily, fixes you with a mixed stare, and then departs, melting into the crowd. Did those eyes hold forgiveness? Maybe. The crowd is equally divided; some seem unmoved, but many others look at you with a new appraisal.\n\n\nSatisfied, you turn your horse homewards, and your escort follows.", "action_results": [null]}]}, {"action": "\"You must be strong!\"", "result": "You raise your hand and silence falls like a blanket over the crowd of people. Your eyes flick from face, some meet your gaze, others stare at their feet.\n\n\n\"As a husband and father, I can understand the devotion one feels for a family member, and therefore cannot even comprehend the pain of your losses. I wish I could tell you that they died honorably, but in truth they were butchered! William slaughtered them, mercilessly. What happened at Hastings cannot be repeated, and to ensure that I need your support. If not for my sake, or England's, then for the sake of avenging your loved ones. William must pay!\"\n\n\nYour escort applauds, rattling swords on shields and roaring.\n\n\nSome of the villagers clap nervously, but others remain still; one, a young woman with a grim face raises her hand.                                                                                                                            \"Why was the fyrd so undersupplied? Why was it not provided with shields?\"                                          One of your men barks at her to be silent, but she snarls back, tears bead her eyes                            \"I lost my husband and my son! Don't you dare tell me to be silent!\"                                               She stabs her finger at you, sobbing                                                                                            \"Answer me! Answer me!\"                                                                                                              One of your men reaches for his sword, but you wave him off. Looking the determined young woman in the eye, you give her an answer.", "action_results": [null, null, null]}, {"action": "\"I am truly sorry for your losses\"", "result": "You raise your hand and silence falls like a blanket over the crowd of people. Your eyes flick from face, some meet your gaze, others stare at their feet.\n\n\n\"I know the losses you have experienced have hurt you all deeply, but you must remain strong. William's butchery of your loved ones cannot go unanswered, we hurt him at Hastings, and those you lost were a part of that. Do not let them die in vain! William must pay, and we will bring justice to him!\"\n\n\nYour escort applauds, rattling swords on shields and roaring.\n\n\nSome of the villagers clap nervously, but others remain still; one, a young woman with a grim face raises her hand.                                                                                                                            \"Why was the fyrd so undersupplied? Why was it not provided with shields?\"                                          One of your men barks at her to be silent, but she snarls back, tears bead her eyes                            \"I lost my husband and my son! Don't you dare tell me to be silent!\"                                               She stabs her finger at you, sobbing                                                                                            \"Answer me! Answer me!\"                                                                                                              One of your men reaches for his sword, but you wave him off. Looking the determined young woman in the eye, you give her an answer.", "action_results": [null, null, null]}]}]}]}]}]}]}]}]}, {"action": "Attack King William", "result": "With a short, deft movement, you leap to your left and crack a guard's knee with your boot. He gasps and collapses on the floor, cradling his injured leg.\n\n\nFrom his limp hands you tear his spear and whip around. The guard behind you parries with his sword, but you twirl your spear around his blade and plunge it into his gut. Leaving it there, you tear the sword from his grip.\n\n\nBehind you, Orvyn has also managed to acquire a weapon and is dueling with the remaining guard and the jailor. With his free hand, he waves to you\n\n\n\"Go, Aethelwulf, go! Kill him!\"\n\n\nYou press onwards toward the throne. William's two guards stand ready for you. Taking a massive lunge to your right, you drive your sword at a guard's face. He deflects the blow easily with his heavy Norman kite shield, but the shield momentarily blinds him and allows you to cut past him.\n\n\nWilliam, seeing you in front of him, reaches for an ornate gilded sword at his side.\n\n\nYou don't give him a chance. Channeling all your strength, you drive the blade deep into his gut. Behind you, footsteps resonate, and shortly after you feel sharp steel driving into your back. It no longer matters. You keep pushing, driving the blade upwards. William's eyes roll back and his features curl into an insane grimace.\n\n\nMore men enter the room.\n\n\nOrvyn dies.\n\n\nYour hand, up to your arm, is covered in blood.\n\n\nAnother blade pierces you.\n\n\nYour grip weakens.\n\n\nYou fall over, and your vision turns red.\n\n\nBlood pours from your mouth, but you manage to spit out two words\n\n\n\"For England\"", "action_results": [{"action": "The Aftermath...", "result": "With William dead, the Norman occupation crumbles. Multiple uprisings drive the Norman force out of London.\n\n\nIn 1067 the Normans rally briefly under William's son, who is also named William.\n\n\nIn an act of vengeance, he makes his last stand in Northumbria, your home. While he waits for the impending arrival of a unified English army, he makes Northumbria bleed. Entire villages are put to the sword, and your home is no exception. Your entire family is wiped out; an ancient bloodline extinguished.\n\n\nThe English forces catch William II in a deft pincer; most of his army is killed during the battle. Those who are captured are put to the sword. William II is taken prisoner, he is brought to London and found guilty of numerous charges by a completely unanimous jury.\n\n\nOn August 18, 1067, William II, at nineteen years of age, is executed. In the next four years a wave of bloodshed rips through England. Normans in hiding are methodically sought out and killed.\n\n\nBy 1071, there are none left. Meanwhile, many English lords vie for the throne.\n\n\nIn 1072, an English lord named Ryce takes the throne, and the English monarchy is preserved.\n\n\nAlthough you will be remembered as the man who saved England, your actions resulted in your people being massacred and your family being killed.\n\n\nAs history progresses, facts will fade into legend, but you will always remain.\n\n\nYour name will be lost to history, but you will be remembered instead by your posthumous nickname;\n\n\nThe Bloody Wolf.", "action_results": []}]}]}, {"action": "Remain silent", "result": "You hold your tongue, but anger wells up inside of you like a storm, like an enraged beast trapped inside a frail cage of flesh and bone. Beside you, Orvyn notices your anger and tenses up, every muscle in his body is ready to spring into action. Even William notices the tension and waves discreetly to the Norman soldiers behind you. You feel cold steel pricking at your back. William glares icily, he leans forward.\n\n\n\"You might be wondering why you are still alive, no?\"\n\n\nYou shrug sardonically. William pretends not to notice your insolence.\n\n\n\"The North has proven especially difficult to pacify. I could have you executed, and place a Norman in charge, however I believe the peasants would disapprove, and I would prefer to keep them alive\"\n\n\nHe pauses briefly, mentally collecting his words\n\n\n\"As such, I am reinstating you as lord in the North, providing you swear fealty to me\"\n\n\nHe leans even closer\n\n\n\"Make no mistake. You will be closely watched by one of my men, whom you will take orders from. This is not an offer. Swear to me, or die. Your choice.\"", "action_results": [null, null]}, null]}, {"action": "Remain standing", "result": "You remain stonily silent, and stiff as iron. William sneers and barks a command in French, the two guards behind you force you and Orvyn to your knees. William smiles patronizingly, he speaks softly, in an English that is only faintly accented.\n\n\n\"I cannot imagine how tiring it must be to stand all the time. I thought you might appreciate a break\"  ", "action_results": [null, null, null]}, null]}]}]}]}]}, {"action": "Kill the bastard", "result": "You sprint full tilt at the Norman rider.\n\n\nYour shield feels heavy on your arm, so you toss it aside.\n\n\nSeeing your approach, the Norman wheels his horse around to face you. He knees his horse into a canter, driving it straight for you.\n\n\nAt the last moment you drop down and slide along the mud of the hill, under the belly of the horse. Thrusting upward, you plunge your blade deep into the horse's gut, drenching yourself in thick blood.\n\n\nThe horse collapses, but you roll out from under it.\n\n\nYou leap to your feet quickly; the Norman rider is slower to rise. From under the horse carcass, you see the hilt of your longsword protruding.", "action_results": [{"action": "Go for your longsword", "result": "The Norman struggles to rise, his leg is broken. He stabs at you feebly with his sword. You knock it aside and retrieve you own, pulling it from the horse's stomach with a sickening wrench.\n\n\nShoving the rider onto his back, you stand over him with your sword raised high.\n\n\n\"For Harold\"\n\n\nYou breathe, and then plunge the blade into his chest, shattering the mail links and piercing his heart.\n\n\nYou stand there awhile, alone in the middle of a slaughter. Orvyn reaches you, and tugs urgently at your shoulder, he is yelling something, but you cannot understand him. The words sound far away; small.\n\n\nYou see a Norman on horseback charge towards you, he wields a cudgel.\n\n\nYou make no attempt to dodge. You just stand there, frozen. It is Orvyn who saves you, he ducks under the cudgel swing and drives his axe into the horseman's chest. The cudgel blow loses force and changes direction, clipping your helmet as opposed to killing you. Your vision fades and you feel the ground rush towards you, feel the mud leeching through your mailshirt.\n\n\nYour vision blackens.", "action_results": [null]}, {"action": "Attack the Norman unarmed", "result": "The Norman struggles to rise, you ignore your sword and instead dive for him. Knocking him down, you press him down with your legs and drive blow after blow into his face, cracking your knuckles and snapping his nose.\n\n\nThe Norman writhes, and as you try and secure him he drives a fist into your gut. As you recover, gasping, he draws a dagger and stabs it at your neck. Twisting out of the way, you avoid most of his strike, but feel the blade cut up across your jaw.\n\n\nHis momentum throws him off-guard, and in an instant you are both clutching the knife's hilt. He fights hard, but his strength is the hot struggle for survival, and yours is the cold power of vengeance. You force the dagger down and plunge it into his chest, splintering his mailshirt and piercing his heart.\n\n\nYou stand there awhile, alone in the middle of a slaughter. Orvyn reaches you, and tugs urgently at your shoulder, he is yelling something, but you cannot understand him. The words sound far away; small.\n\n\nYou see a Norman on horseback charge towards you, he wields a cudgel. You make no attempt to dodge. You just stand there, frozen. It is Orvyn who saves you, he ducks under the cudgel swing and drives his axe into the horseman's chest. The cudgel blow loses force and changes direction, clipping your helmet as opposed to killing you.\n\n\nYour vision fades and you feel the ground rush towards you, feel the mud leeching through your mailshirt.\n\n\nYour vision blackens.", "action_results": [null]}]}]}, {"action": "\"Protect the King!\"", "result": "\"Protect the King!\"\n\n\nYou cry, and several weary Housecarls bound into action, following your lead. You sprint towards him.\n\n\nHe half turns towards you, and flashes one of his charismatic bright smiles.\n\n\nThe single arrow that flies through the air surprises you more than Harold. Curving gently, it hisses downward and slams into his eye. He lets out a startled cough and staggers backward.\n\n\nYou keep running towards your king, but a Norman rider canters in front of you, blocking your way.\n\n\nTurning his horse neatly, the Norman swings his blade and opens your King's throat, spraying blood.\n\n\nHarold falls to the ground, dead.\n\n\nYou falter indecisively, filled with wordless horror and remorse.", "action_results": [null, null]}]}, {"action": "Stay back", "result": "Some of your men are beginning to join this mad charge. Waving frantically, you call them back to your position. Most capitulate, somewhat reluctantly.\n\n\nWith your men beside you, you pause to get a better look at the retreating Normans. There is something very wrong here. This retreat is far too organized, too simultaneous. The Norman foot soldiers are increasing the distance between themselves and the beleaguered English soldiers, the pounding of their feet grows fainter, but another pounding grows louder. Horse hooves.\n\n\nYou stare with horror, Harold has thrown off his battered shield and carries only a Daneaxe, which he wields two-handed. He is completely out in the open.\n\n\nInstinctively, you turn and race towards him.", "action_results": [null, null]}]}]}]}]}]}]}]}]}, {"action": "We have some time, let's talk", "result": "You shrug\n\n\n\"We still have some time.\"\n\n\nYou find a moist log and sit down. Orvyn follows your lead and seats himself on a campstool taken from a nearby firepit. He cracks his knuckles\n\n\n\"So?\"\n\n\nYou stretch, mailshirt shimmering\n\n\n\"I just wanted to talk\"\n\n\n\"About?\"\n\n\n\"The weather of course\"\n\n\nOrvyn looks at you quizically, and you roll your eyes\n\n\n\"I meant the battle. I wanted to talk about the battle\"\n\n\nOrvyn touches the hilt of his axe\n\n\n\"Mm. I might have preferred a conversation on the weather\"\n\n\nYou spread your palms\n\n\n\"Sorry, just this; do you think that we can win?\"\n\n\nOrvyn shrugs\n\n\n\"Do you?\"\n\n\nFor a while you sit in silence. Neither one of you is willing to speak. You grit your teeth angrily\n\n\n\"I was hoping for some encouragement. This is definitely not helping either of us. Come on, let's go to the front.\"\n\n\nOrvyn nods, and helps you up from your log\n\n\n\"Alright, let's go then\"", "action_results": [null]}]}]}]}]}, {"action": "Craft makeshift shields", "result": "You look back at the camp, where five thousand farmers, butchers, bakers, and other citizens huddle in their cloaks for warmth, or sit by a fire and listen in awe as soldiers tell them tales of battles in faraway lands. None of them are ready for this, and most will not have the courage to face the prospect of shieldwall combat willingly. Giving them a slight advantage is the least you can do, really.\n\n\n\"If your carpenters can hew some fresh wood, they could make shields for the conscripts. Nothing fancy, just a wood board with a grip. Something to keep them alive. To keep them from breaking.\"\n\n\nHarold claps you on the shoulder\n\n\n\"I'll have my carpenters start working right away! Let's turn these farmers into proper soldiers!\"\n\n\nHe laughs, and you see the fire in his eyes. This is what King Harold does best. Strategy and rule he manages, but it's the fighting he loves. You understand the feeling all too well. How many times have you knelt before a cross, armor bloody and gore speckled, thinking back with revulsion and guilt at how you loved it.\n\n\nLoved every bit of it.\n\n\nLoved the blades flashing, reflecting the rays of the sun. Loved the sound of shields splintering, cracking open.\n\n\nLoved the bloody chaos of the shieldwall.\n\n\nIn the clash of the shieldwall it is where men like you, and Harold, and no doubt William too, come alive.\n\n\nThis world has molded you.\n\n\nMolded you into a warrior.\n\n\nYou are bred for this.", "action_results": [null]}]}, {"action": "\"My liege\"", "result": "Inclining your head respectfully, you murmur solemnly\n\n\n\"My liege\"\n\n\nKing Harold laughs madly, and then punches you light-heartedly on the shoulder\n\n\n\"You always were a mannerful bastard, Aethelwulf!\"\n\n\nHe chuckles, long and low.\n\n\n\"But come, I haven't seen you since our last battle! That was two bloody months ago, near as! Where've you been! Avoiding me, have you?\"\n\n\nYou laugh, your respectful tone undone by his amicable nature.\n\n\n\"If I went to another feast of yours, I wouldn't fit into my mail\"\n\n\nHe shakes his head ruefully\n\n\n\"You should learn to unwind more! Live your life, you know? Speaking of, how's your wife?\"\n\n\nYou nod solemnly\n\n\n\"She fares well, and yours?\"\n\n\nHarold snorts derisively\n\n\n\"Fat and ugly, as always. Ah well, that's what tavern girls are for, eh?\"\n\n\nHe grins and nudges you with his shoulder; you shrug. Harold notices your expression and laughs again\n\n\n\"As chaste as a damned priest! Ah well, we'll break you in eventually.\"\n\n\nAgain you shrug. You and Harold have very different views on the matter, he won't change, nor will you. The best course, you decide, is to skate around the issue altogether. Nodding towards the hill, you speak seriously\n\n\n\"What do you make of our defenses?\"\n\n\nHarold frowns, his earlier humor gone. He throws up his hands irritably.\n\n\n\"My Kingdom depends on a hill and five thousand farmers\"\n\n\nYou shake your head\n\n\n\"Five thousand farmers and three thousand warriors\"\n\n\nHarold nods\n\n\n\"Aye. True enough. We'll make this William pay for every inch, if nothing else\"\n\n\nHe squints at the hill in the fading light\n\n\n\"The scouts say William has four thousand cavalry\"\n\n\nYou shake your head decisively\n\n\n\"No cavalry in the world can break a strong shieldwall\"\n\n\nHarold laughs bitterly\n\n\n\"Our shieldwall isn't strong! It's weak! Half of the bloody farmers don't even own shields! Goddamned useless bastards!\"\n\n\nSurveying the hill thoughtfully, two plans come to mind;\n\n\nYou could craft wooden stakes and plant them along the hill, disorganizing the horse charge.\n\n\nOr you could create makeshift shields for the conscripts, to help them hold the line.\n\n\nThe carpenters will only have enough time to do one of the two tasks, you must choose which one you believe is more strategic. ", "action_results": [null, null]}, {"action": "Kneel", "result": "Kneeling in the muck, you incline you head towards your king\n\n\n\"My liege, I am honored-\"\n\n\nKing Harold bellows with great peals of laughter. Reaching down, he grabs you under the armpit and yanks you to your feet\n\n\n\"You always were a mannerful bastard, Aethelwulf!\"\n\n\nHe chuckles, long and low.\n\n\n\"But come, I haven't seen you since we set up camp here! That was two bloody months ago, near as! Where've you been! Avoiding me, have you?\"\n\n\nYou laugh, your respectful tone undone by his amicable nature.\n\n\n\"If I went to another feast of yours, I wouldn't fit into my mail\"\n\n\nHe shakes his head ruefully\n\n\n\"You should learn to unwind more! Live your life, you know? Speaking of, how's your wife?\"\n\n\nYou nod solemnly\n\n\n\"She fares well, and yours?\"\n\n\nHarold snorts derisively\n\n\n\"Fat and ugly, as always. Ah well, that's what tavern girls are for, eh?\"\n\n\nHe grins and nudges you with his shoulder; you shrug. Harold notices your expression and laughs again\n\n\n\"As chaste as a damned priest! Ah well, we'll break you in eventually.\"\n\n\nAgain you shrug. You and Harold have very different views on the matter, he won't change, nor will you. The best course, you decide, is to skate around the issue altogether. Nodding towards the hill, you speak seriously\n\n\n\"What do you make of our defenses?\"\n\n\nHarold frowns, his earlier humor gone. He throws up his hands irritably.\n\n\n\"My Kingdom depends on a hill and five thousand farmers\"\n\n\nYou shake your head\n\n\n\"Five thousand farmers and three thousand warriors\"\n\n\nHarold nods\n\n\n\"Aye. True enough. We'll make this William pay for every inch, if nothing else\"\n\n\nHe squints at the hill in the fading light\n\n\n\"The scouts say William has four thousand cavalry\"\n\n\nYou shake your head decisively\n\n\n\"No cavalry in the world can break a strong shieldwall\"\n\n\nHarold laughs bitterly\n\n\n\"Our shieldwall isn't strong! It's weak! Half of the bloody farmers don't even own shields! Goddamned useless bastards!\"\n\n\nSurveying the hill thoughtfully, two plans come to mind;\n\n\nYou could craft wooden stakes and plant them along the hill, disorganizing the horse charge.\n\n\nOr you could create makeshift shields for the conscripts, to help them hold the line.\n\n\nThe carpenters will only have enough time to do one, you must choose which is more beneficial.", "action_results": [null, null]}]}]}, {"action": "No", "result": "Hidden by the dense screen of trees, twelve thousand Norman warriors wait. Each one is battle ready, and battle hardened; professional killers. Within your camp waits fewer than eight thousand men, but of those eight thousand only three thousand can be trusted. The rest are just farmers, weary and ill-disciplined. Even with the high ground, these numbers are far too slanted.\n\n\nYou know it with a dull certainty; only death awaits you here.\n\n\nAcwellen is still looking at you, waiting for a response. Your mouth moves of its own accord, the words escaping in a wisp of breath.\n\n\n\"No.\"", "action_results": [null]}, {"action": "I don't know", "result": "Hidden by the dense screen of trees, twelve thousand Norman warriors wait. Each one is battle ready, and battle hardened; professional killers. Within your camp waits fewer than eight thousand men, but of those eight thousand only three thousand can be trusted. The rest are just farmers, weary and ill-disciplined. These are long odds, and even with the high ground, this will be no easy victory. Acwellen is still looking at you, waiting for a response. You shrug grimly.\n\n\n\"I don't know Acwellen. I don't know.\"\n\n\nBehind the screen of trees the town of Hastings roils with flames and the Norman William's horde assembles.", "action_results": [null]}]}, {"action": "Remind him his son could be alive", "result": "Adamantly, you grip him by the shoulder and turn him to face you. Kneeling, you look him in the eyes, grasping his shoulders with sudden ferocity.\n\n\n\"Listen to me Acwellen! Your son may not be dead. Every hour men from the garrison at Hastings enter our camp. There are survivors. Do not give up hope so soon\"\n\n\nAcwellen sighs raggedly, and seems about to disagree, but instead nods fiercely.\n\n\n\"Yes. You're right. I cannot give up hope, my son... my son could still be out there\"\n\n\nHis conviction appears slight, but at least you have gotten his attention away from the blaze of Hastings' buildings. Acwellen exhales shakily, opens his mouth to say something else, then closes it and remains silent, yet the words are plainly on his mind, trying to slip free like hounds on a leash. At last he speaks, grim and quiet, little more than a whisper.\n\n\n\"Can we win this battle?\"\n\n\nThe question hangs there for an eternity, all the fear and anxiety of the English army expressed in the musings of one broken man.", "action_results": [null, null, null]}, {"action": "\"...\"", "result": "You have no words. Perhaps Acwellen's son is alive, even now rallying survivors and waiting for the cover of night to slip into the safety of the English camp, yet more likely he is dead, cleaved open by a Norman axe, or gutted by a Norman blade, or shot by a Norman arrow. Lying there, consumed by the inferno that lights the evening sky in the distance. You cannot offer false consolation. Instead you stand by him, silently sharing in his grief. Acwellen exhales shakily, opens his mouth to say something, then closes it and remains silent, yet the words are plainly on his mind, trying to slip free like hounds on a leash. At last he speaks, grim and quiet, little more than a whisper.\n\n\n\"Can we win this battle?\"\n\n\nThe question hangs there for an eternity, all the fear and anxiety of the English army expressed in the musings of one broken man.", "action_results": [null, null, null]}]}