{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=38025", "context": "", "first_story_block": "Dad's told you three things about Dawnwood: It's a small town with less than a thousand people, it's a friendly, closed-knit community and it's in the Deep South, between the middle of nowhere and some godforsaken shithole you've never been to. You sit in the back of Dad's Ford, staring out the window at shitty fields and forests.\n\n\n\"It's beautiful, isn't it?\" your dad says, cheerfully looking out the window.\n\n\n\"Dad, I don't have bars on my phone. I genuinely didn't know there were places outside of Alaska in this country where that was possible.\"\n\n\n\"Well, maybe it'll encourage you to spend more time actually talking to people, or read. Hunter loves reading.\"\n\n\nYou look at your nine year old brother sitting next to your, his eyes glued to the screen of a Kindle.\n\n\n\"He's not reading; he's playing games. I told you he shouldn't have gotten a Kindle.\"\n\n\n\"Shut up, Hazel!\" he says.\n\n\nYou quickly thump him in the arm.\n\n\n\"Hey! Hazel hit me!\" Hunter whines.\n\n\n\"Hazel! What have I told you about hitting your brother?\"\n\n\n\"Do it when you're not looking?\" you ask sarcastically.\n\n\n\"For God's sake, Hazel, you're sixteen, act your age! I'm sick of your acting like a spoilt brat because of the move!\"\n\n\n\"You're dragging me from my home to the middle of bumfuck nowhere, of course I'm pissed!\"\n\n\nDad angrily slams his hands on the wheel, losing his cool once again.\n\n\n\"Stop swearing! I had to move here, I wasn't given a choice! The firm...\"\n\n\n\"There's plenty of other law firms! It's New York, there's not such a lack of crime you can't find work!\"\n\n\n\"That's another reason! New York was dangerous and full of crime. The only thing people die of where we're going is old age or eating too much fries!\"\n\n\n\"Fine, pick your job over us again!\"\n\n\nDad sighs as you pull out your headphones and put them in. You stare out the window as you pass through endless fields.", "action_results": [{"action": "One Hour Later...", "result": "An hour later, you pull into Dawnbrook, and find you were far too optimistic. The town is a shitty series of low buildings. Hunter looks up from his Kindle briefly, before shrugging and looking back down. You pull up to one of the many, generic looking houses pulling into the driveway.You can already see faces peeking out from windows at the new arrivals. Dad opens the car door and lugs two suitcases up to the door and fishes through his pocket for his keys and opens the door.\n\n\n\"Here we are! Home!\" he says cheerfully, obviously trying to raise his children's spirits.\n\n\nYou follow Dad inside, dropping your backpack on the floor.\n\n\n\"I'll begin unpacking, you guys can get settled in or go meet the neighbors or explore,\" Dad says.", "action_results": [{"action": "Go to your room", "result": "You pick up your backpack again and walk up to your new room. It has a large wardrobe, a large double bed, a desk and chair and two dressers. You sit on the bed, taking out your laptop, and go on Facebook. Thankfully, the WiFi's already set up, so you can go on. You go down your Timeline, seeing all your friends having fun. Fiona had a party, Dan's now dating Leone and a bunch of other shit's going on that you wish you could take part in. You sigh, and continue flicking through pictures and posts. After an hour or two, Dad calls you down again. You close your laptop and go downstairs, finding Dad waiting there in the kitchen.\n\n\n\"Hey, sweetie. The house is pretty barren, so we're going to go out to eat and I'll pick up groceries in the morning. I saw a pizza place in town. Do you want to go?\"", "action_results": [{"action": "\"Sure.\"", "result": "\"Oh, good! Come on, let's go!\"\n\n\nYou follow Dad to the car, and climb in the passenger seat. You don't even need to turn your head to know your brother's in the backseat, hearing the opening tune of Angry Birds: Stalin's Show Trials or whatever the fuck version they have now. You lie back in your seat and stare out the window as you go through the town. Eventually, you arrive at some shitty, greasy pizza joint, and get out of the car. You walk inside, and find yourself in a Chucky Cheese knock-off. You walk up to the counter and find yourself faced with a girl your age with long brown hair and a massive zit that looks like a red dot sight in the middle of her forehead.\n\n\n\"Hello, welcome to Pizza Corner, can I take your order?\" she asks.\n\n\n\"Yeah, can we have a large Pepperoni Pizza and three Cokes?\"\n\n\n\"Sure thing. Small, Medium or Large?\"\n\n\n\"Medium.\"\n\n\nThe girl begins pouring the drinks as another, far prettier blond girl appears from the kitchen, holding a large piece of dough. She glances briefly at you, before grabbing a cloth with her spare hand and disappearing back again.\n\n\n\"So, are you new here?\" the cashier asks.\n\n\n\"Yeah, I just moved in.\"\n\n\n\"I'm Lucy.\"\n\n\n\"I'm Hazel.\"\n\n\n“Oh, really? Well, it’s a good town. You can’t find much work except in a dull pizza joint, but there ain’t much here to even spend the money on. Some old clothes stores and a cinema, and that’s about it.”\n\n\n“Do you work here full time?”\n\n\n“Jesus no. If I got to the point where I was working here full time I’d dip my head in the deep fat… well, I wouldn’t be happy. Im still in school.”\n\n\n“What grade?”\n\n\n“10th.”\n\n\n“Oh, I’m starting there tomorrow. I guess I’ll see you there.”\n\n\n“”Sure. If you want, I can always get you a job here. Becca, the blond girl, has literally done shit all since we started. She’s only working so her daddy an think she’s learning real-life experience and still feel justified buying whatever she…”\n\n\n“I can hear you!” a voice calls out from the kitchen.\n\n\n“I know, Becca, I’m getting a point across!”\n\n\nDad appears standing next to you, grinning.\n\n\n\"Look who's already making friends!\" he smiles.\n\n\nYou roll your eyes.\n\n\n\"Yeah, sure. Let's just sit down,\" you say, pulling Dad towards a booth to sit in.", "action_results": [{"action": "Two Days Later...", "result": "The school is a shitty building filled with no good kids who are learning about geography and Shakespeare despite the fact that they’ll almost certainly end up in the shitty jobs that are needed to keep this town running. You walk through the doors, a backpack slung over your shoulder.\n\n\n“OK, it’s not so bad,” you mutter, walking past a row of lockers down the hall. \"I just have to find my classes and…\"\n\n\n“Hey, Hazel!” a voice cries.\n\n\nYou turn to find the familiar, zit stricken face of the pizza cashier, Lucy.\n\n\n“Hey,” you reply.\n\n\n“So, it’s your first day, huh? Do you know what classes you’re in?\"\n\n\nYou search your pockets and pull out a crumpled class schedule, handing it to her.\n\n\n“OK, we have the same Spanish, English, Math, History… you do Chemistry? Gay! That’s the hardest class!”\n\n\n“Well other than that we seem to share a suspicious amount of classes.”\n\n\n“Yeah, I talked to the principal and begged him to put you in my classes… it’s a tiny school, what do you think would happen? Of course we share most classes. Oh look, Carter’s here.”\n\n\nYou turn to see a tall kid with neat, combed hair and an awkward grin bounding over. His clothes are all too small and his teeth are messed up and chipped, which becomes more obvious as his grin widens.\n\n\n“P-p-pleased to meet y-you. I’m Carter,” the boy stutters awkwardly.\n\n\n“This is Carter. He’s one of my best friends here.”\n\n\n“It’s a t-tiny town. You di-didn’t exactly h-have a lot to choose from.”\n\n\n“Yeah, I guess not. If you want, we can both show you around. Between the two of us, we should share pretty much every class.”\n\n\n“Except Chem… Chemistry,” Carter points out.\n\n\n“Yeah, you’re pretty much fucked for that, but that’s your problem. Now we have double Math and English, and Miss Loaves is genuinely the easiest Math teacher to have to deal with. She’s the only one who lets you get books from your locker when you forget them rather than giving a write-out or detention or just yelling for ten minutes. Come on, we’ll show you around.”", "action_results": [{"action": "Two Hours Later...", "result": "The first few classes are easy. You've always been good at Math and Miss Loaves is quite eager to have a student who actually works hard. Of the class, it's mostly kids messing and doodling with the exception of you, the blond girl, Becca, who worked with Lucy in the pizza joint and a tiny kid sitting at the back of the class who looks as young as Hunter. English is similar, with you being among the few who can spell \"Immediately\". In the short space of three classes, you cement your position as a nerd in the class. When the bell rings for first lunch, you find Lucy smirking at you.\n\n\n\"You could've given us a heads up you were a nerd,\" she says.\n\n\n\"I'm not a nerd!\" you protest.\n\n\n\"You were doing half the sums in your head!\"\n\n\n\"I...!\"\n\n\n\"Calm it, new girl. Shit, I didn't think you'd make such a big deal about it. Come on, I'll introduce you to the gang.\"\n\n\nYou follow Lucy to the cafeteria, where she sits down at a table. You recognize a few faces of those sitting there. Carter sits there, eagerly tearing into a sandwich. The nerdy, small kid is also there, as well as the blond girl, Becca, from the pizza place. The only others are a large, bulky kid who you don't recognize but seems unusually close to Becca.\n\n\n\"Alright, everyone, this is Hazel, she's new here. You know Carter.\"\n\n\n\"I'm Becca,\" Becca says, looking up at you.\n\n\n\"Hey, I'm Anthony,\" the small kid says.\n\n\n\"He's Ant,\" Becca buts in.\n\n\n\"Anthony, you prick!\" Ant says again, but you resolve that Ant is a way better name for the tiny kid.\n\n\n\"I'm Kyle,\" the big kid says.\n\n\nYou sit down, and Kyle immediately continues telling a story he was apparently telling.\n\n\n\"So there I was, just walking into this shitty pet store that I genuinely think half the animals in were either dead or had a few hours to live, because I wanted to buy Becca a goldfish for our anniversary.\"\n\n\n\"It's not anniversary. Anniversary is yearly, not five monthly,\" Ant points out.\n\n\n\"Whatever, stop being a dick and interrupting the story. So I was trying to get a goldfish, when the manager or owner or whatever just stares blankly at me. After about a minute, he says \"Buy something or get out\", and I ask him what his problem is, and he says, no word of a lie, \"All you Negroes is stealin' my cat food\". I'm not even offended by that. I'm curious as to how much cat food has he had stolen by black kids to make that a stereotype in his head.\"\n\n\n\"Nah, s-sounds like b-b-bullshit. I bet you w-weren't r-r-really buying Bec... Becca an anniversary gift. You w-were going to... to steal c-cat food,\" Carter points out.\n\n\n\"Fuck you, Carter. Where was I?\"\n\n\n\"You just finished,\" Becca says.\n\n\n\"Well, shit, I'm outta things to say. Where's Mason? He usually has something to say.\"\n\n\n\"There he is,\" Lucy says.\n\n\nYou turn your head slightly to see what could be the hottest boy you've ever seen. He stands tall with muscles that ripple under his t-shirt. He has short, straight black hair that looks really cute... shit, he's here. Say something! For God's sake, don't screw this up! USE THE RIGHT GREETING!", "action_results": [{"action": "\"Hello.\"", "result": "\"Hey,\" he smiles, extending a hand to shake. \"I'm Mason.\"\n\n\nHe speaks with a sexy, thick Southern drawl that immediately... Shit, he's staring at you.\n\n\n\"I'm Hazel,\" you smile, shaking his hand.\n\n\n\"Where were you, Mason?\" Lucy asks.\n\n\n\"I was talking to Drake about tonight.\"\n\n\n\"Who's Drake?\" you ask.\n\n\n\"Lucy's older b-brother,\" Carter answers.\n\n\n\"Did you tell him I was going to be there?\"\n\n\n\"Of course not. Can't you just trust me? Everything'll be fine. Hey, I forgot to say, I'm going to need you all to chip. Drake's got a heavy mark up.\"\n\n\n\"What's tonight?\" you ask. \n\n\n\"We're all going out drinking in the woods,\" Lucy explains. \"You can come, if you want. You don't even need to drink or anything, it's just a bit of fun.\"\n\n\n\"I don't know if my dad will let me,\"\n\n\n\"Well, sneak out,\" Ant says.\n\n\n\"Well, I can try,\" you say.\n\n\n\"Cool, I'll save you some cans just in case,\" Mason smiles.\n\n\nThe bell rings, and Kyle and Ant swear in unison.\n\n\n\"What class is now?\" Mason asks.\n\n\n\"Spanish,\" Carter replies.\n\n\nYou grab your bag and follow your new friends to Spanish class.", "action_results": [{"action": "Six Hours Later...", "result": "The rest of the school day is easy. You learn about the history of the town in History Class, the history teacher eagerly abandoning the notion of McCarthyism to explain what appears to be her favorite topic. Apparently, the town was once home to a large tribe of Native Americans, who were promptly wiped out by Colonists. The town rose to prominence due to its large number of cattle farms, before falling into obscurity as the modern age dawned. Eventually, it became the shithole it is today. After school, you take the bus home and say goodbye to your friends. Dad's still at work, so you collapse in front of the TV for a barrage of nearly identical Crime Shows. One features a team of guys who just kind of stereotype criminals, one features some guys who look at glowing stains, one features a guy who knows when you're lying and one features a modern day Sherlock Holmes.\n\n\nJust as the team find a new bit of information about how the clown's car is full of some... particularly dirty stains, you hear the familiar whine.\n\n\n\"HAZEL! Can I watch TV!?!\"\n\n\n\"No! I'm watching. Go play your games.\"\n\n\n\"But It's out battery!\" he whines.", "action_results": [{"action": "Let the whining, snivelling brat watch TV", "result": "\"Fine!\" you sigh, as your brother gleefully snatches the remote and switches to the latest cartoon that's far too old for him. \n\n\nYou jump up from the couch, and grab your laptop, binge-watching Youtube until you hear Dad come through the door. \n\n\n\"Hello! I'm home!\" he calls.\n\n\n\"Hey Dad!\" you yell from the kitchen.\n\n\nHe walks in, smiling.\n\n\n\"You're not fighting. That's pretty impressive,\" he smiles, referring to you and your brother. \"I'll put on dinner. We have chicken curry.\"\n\n\nHe begins to turn on the stove and start cooking.\n\n\n\"How was school, honey?\"", "action_results": [{"action": "\"Shitty.\"", "result": "\"Well, honey, I'm sure it will get better. No, I swear it will. Don't worry, it just takes some time to get used to things.\"\n\n\nYou shrug and turn on your phone. After about an hour, Dad begins serving dinner.", "action_results": [{"action": "Sit down for dinner", "result": "You sit down.\n\n\n\"So Hunter, how was school?\"\n\n\n\"Good,\" Hunter mumbles.\n\n\n\"Hey, Dad...\" you ask.\n\n\n\"Yes?\"\n\n\nNow's the perfect time to ask him whether you can go or not... or you can just sneak out later.", "action_results": [{"action": "\"Can I go out with some friends to the woods?\"", "result": "\"Into the woods? Hazel, it's late, you're not going to the woods,\" Dad says.\n\n\n\"OK,\" you say dejectedly, already planning how to sneak out.\n\n\nYou quickly eat most of your dinner before faking a stomach ache and disappearing into your room.", "action_results": [{"action": "Several Hours Later...", "result": "An hour before you're supposed to be meeting your newfound friends, you go out to Dad.\n\n\n\"Dad, I don't feel great,\" you moan. \"I'm going to bed.\"\n\n\n\"Are you sure?\"\n\n\n\"Yeah. I need rest. I'm just going to sleep. Don't wake me any earlier than you need to.\"\n\n\n\"Sure, sweetie.\"\n\n\nYou disappear to your room, and immediately fill your bed will pillows even though it's a bit generic, and open your window. There's a small ledge you sit on, before you go to drop down. You hit the soil with a soft thud, and quickly break into a jog away from the house before Dad chooses to look out a window. You quickly rush away from the house and pull out your phone and call Lucy for directions.", "action_results": [{"action": "Ten Minutes Later...", "result": "After a long walk, getting lost on several occasions and using McDonalds as the landmark to navigate from, you end up trompsing through the woods, you feet softly landing on the soil that’s neither dry earth or wet mud, but a combination of both. After ten minutes walking, you come across the site your friends were talking off. A fire built from moss dry leaves and branches struggles to stay alight as two rusted pick-ups sit on either side. You see the group immediately. Mason, Lucy and Carter sit on the roof of one of the trucks, passing a large bottle of what looks like vodka between them. Kyle and Becca sit on the other sharing a strange mixture of various liquids that’s ended up a pale brownish color. Ant sits by the fire, letting out cursewords so dirty they’d make a sailor blush as he pours a can of lighter fluid among the flames in a desperate attempt to give the fire some self-sufficiency by setting alight one of the larger branches.\n\n\n“Oh, you’re h-h-here,” Carter says.\n\n\n“Oh, Hazel! I’m glad you could come! Shit, I half expectected you to get lost, give up and end up getting a McFlurry and going come,” Lucy admits.\n\n\nAs the sun begins to hit the horizon, illuminating the entire forest golden and orange, you sit at the edge of one of the pick up’s.\n\n\n“You bring anything to drink?” Ant asks, turning a pile of leaves over to give the fire some air.\n\n\nYou shake your head, and Ant sighs.\n\n\n“Figures. I’ve been telling half these guys to bring their own drinks since I knew ‘em, but the only ones who do is me.”\n\n\nMason holds up his hands in offene.\n\n\n“And Mason,”\n\n\n“I always bring drinks!” Lucy says.\n\n\n“Your brother does, and he takes more than a pound of flesh in payment. Somebody ring him, anyway.”\n\n\nJust as Ant finishes talking, you hear a rustle among the leaves. Mason immediately puts his drink under his coat before a tall boy with messy hair that looks to be in his early twenties appears.\n\n\n“Hey!” he says sternly. “Underage drinking is illegal, unhealthy and can act as a gateway drug to the very dangerous Marijuana!”\n\n\n“We don’t have time for your bullshit, Drake,” Ant complains.\n\n\n“Why do have to spoil everything, short-round?” I was trying to scare the new girl,” the boy says, tossing a small grocery bag of cans of alcohol in front of Ant.\n\n\n“Fantastic!” Mason sasys, immediately grabbing the bag as Ant gives Drake a wad of crumpled bills.\n\n\n“I’m Drake, by the way,” he says to you. “Lucy’s brother.”\n\n\n“Hazel. You buy your sister alcohol?” you ask in surprise.\n\n\n“Shit, I was drinking when I was twelve and a quarter. I reckon she’s old enough to make her own decisions. Fuck, in some countries she’d be makin’ babies and runnin’ a household by now.”\n\n\n“Thanks, Drake,” Lucy says, breaking the tab of a can of off-brand supermarket beer.\n\n\n“No problem. Right, I gotta go, me and Ed are going out to do a few jobs. I’ll see you all around. Good meetin’ you, Hazel.”\n\n\nDrake turns and walks off through the forest as the kids around you begin tearing through the bag.\n\n\n“This all tastes like someone drank shitty liquor and pissed into a can,” Ant complains.\n\n\n“Oh, b-b-because you brought o-only the f-f-finest of wines and c-cham-champagnes, Ant,” Carter says.\n\n\nMason pops the tab of another can, and looks at you expectantly.\n\n\n“Hey, Hazel,” he asks. “Do you want some?”", "action_results": [{"action": "\"No thanks.\"", "result": "“Are you sure?” Lucy asks. “A bit of drink never hurt anyone.”\n\n\n“Plus, you’ll be really bland and we’lll be annoying to each other if you’re sober,” Ant adds. “Oh, and… peer pressure. We’re peers who are pressuring you, because that’s a thing that really happens.\"", "action_results": [{"action": "\"OK.\"", "result": "\"Cool,\" Mason grins, passing you the bottle of alcohol.\n\n\nYou take a long drink, downing much of the bottle. Ant is right, it does taste like piss. Still, you manage to gulp down half the can, before passing it on.\n\n\n\"Shit. The new girl can drink,\" Ant smiles.\n\n\nYou continue sitting around the campfire, which is really a lot closer to a glorified candle sitting in a pile of leaves. Mason grabs the bottle of vodka and sits down next to you and your heart flutters. A large part of you knows that this is just infatuation and a childhood crush, mixed in with a fair bit of hormonal lust, but still… he’s really, really cute. The others seem bored, with Kyle downing what seems like more than his weight in booze.\n\n\n“Well, this is boring,” Lucy complains, tossing a bottle in the middle. “Let’s play spin the bottle.”\n\n\n“No way!” Ant complains. “I’m the odd guy out. Kyle and Becca go together, you and Carter and then Mason and the new girl.”\n\n\nYou blush at that comment as Carter nods in agreement.\n\n\n“I agree. I d-don’t w-want to play spin the bo-bottle,” Carter says.\n\n\nBriefly glancing at the indifferent Mason, you feel a twinge of annoyance of all possibilities of spin the bottle disappears as Ant suggests a new game.\n\n\n“Truth or Dare!” Ant suggests, to the groans of Kyle and Becca.\n\n\n“Remember what happened last time?” Becca points out.\n\n\n“That’s not fair! That wasn’t my fault! You should’ve protected your dad’s stuff. How was I do know that that painting was worth a fortune?”\n\n\n“You shouldn’t have been drawing over paintings in the first place, Ant!”\n\n\n“It wasn’t skin off your dad’s nose! That rich bastard can handle a loss! Jesus, we all know his ancestors made his money off the backs of Kyle’s ancestors!”\n\n\n“Fuck you, Ant!” Kyle shouts, slurring from his drink.\n\n\n“Gentlemen, gentlemen, calm down,” Mason says. “There ain’t no issues! We’re all friends here! I say a game of truth and dare would calm us all down.”\n\n\n“Fine,” Becca says.\n\n\nMason downs the rest of his drink, and tosses the glass bottle in the middle. He drops to his knees and spins it, landing on Carter, who lies in the back of the pick-up.\n\n\n“Truth or dare, Carter?”\n\n\n“If I p-pick dare, will you… will you make me st-stand up?” Carter says lazily.\n\n\n“Maybe,” Mason says slyly.\n\n\n“Truth, t-then.”\n\n\nMason grins, glancing at him and Lucy.\n\n\n“Have you ever kissed Lucy?” he asks.\n\n\n“Nope. Sorry to disa-disa-disappoint.”\n\n\n“Damn. I was certain,” Mason sighs, pulling out his wallet and tossing Kyle a crumpled bill. “You just cost me twenty bucks, Carter.”\n\n\nAnt leans over, spinning the bottle. It slows to a stop, pointing off into the woods.\n\n\n“Is that closer to Becca or Hazel?” he asks.\n\n\n“Becca,” Carter says.\n\n\n“Oh, fantastic. Truth or dare?”\n\n\n“Truth.”\n\n\n“Dammit, Becca. Fine, I’ll make this awkward. How far has Kyle got with you?”\n\n\n“Shut up, Ant!” Becca hisses.\n\n\n“Hey, you gotta answer!” Lucy says.\n\n\n“Oh come on! That’s private!”\n\n\n“We’re all friends here,” Mason says.\n\n\n“Fine! We’ve… you know. Done it.”\n\n\n“Respect, Kyle,” Ant smiles, holding back a giggle.\n\n\nBecca goes red, grabbing the bottle and twirling it. Through pure luck or skill, it points directly at Ant.\n\n\n“Shit,” Ant sighs.\n\n\n“Truth or dare. I have a lot of embarrassing questions to ask.”\n\n\n“Dare,” Ant grimaces.\n\n\n“Well, you have a lot more balls than I though. You’ll suffer from it. I dare you to go into Herr Eichel’s basement.”\n\n\n“No!” Ant replies.\n\n\n“Come on, Becca! Herr Eichel’s tear out his throat if he caught him!” Lucy complains.\n\n\n“Who’s Herr EIchel?” you ask.\n\n\n“Oh, I’ll tell her. I’ve been practicing this story for my little brother,” Mason says, before clearing his throat. “During World War II, a young soldier rose through the ranks of the SS. He had a habit of hunting Jews and personally escorting them to the Camps. He would hunt men, women, children, and torture them all for information. He showed no mercy. Eventually, when the Russians invaded, he escaped by pretending to be a civilian, fleeing from Berlin to France to Britain to the US. He hid right here in Dawnwood, hunting down any Jews he could find. His name is Herr Eichel.”\n\n\n“That’s the biggest load of shit!” Lucy complains. “Everyone knows that any Jew in Dawnwood would be scared off by Carter Sr. and his white power bullshit.”\n\n\n“He doesn’t w-w-want white pow-power!” Carter says. “He wants white p-pride. There’s… a difference.”\n\n\n“No there isn’t, Carter, now stop ruining the story. Where was I?” Mason asks.\n\n\n“You just finished,” you point out.\n\n\n“Oh. Well, now Herr Eichel’s going to kill Ant.”\n\n\n“Becca, I’m sorry! Please change the dare!”\n\n\n“Fine. You have to go into the Dead Man’s Barn and go up to the attic.”\n\n\n“That’s even worse!” Ant complains.\n\n\n“Nah, that ain’t bad,” Mason says. “Nazis are real and will kill you. Ghosts aren’t.”\n\n\nYou raise an eyebrow, and Mason smiles.\n\n\n“OK, story time. Once, there was a Sheriff back in the Western times who used his power to wipe out any competition of the big ranchers of the town. One of the small time ranchers, Daniel Edwards, stood up and told the Sheriff he wouldn’t sell his farm to his competition despite threats. The Sheriff led a posse to bring him down, and Edwards tried to fight back. He killed two dozen men and took near a hundred bullets before he went down. They tortured him for a few days, even cutting his face wide open to give him... what'd ya call it, a Glasgow Grin. Eventually, you just hung him to finish him off. Rumor is he still haunts the barn where they strung him up. It’s a historical building so it can’t be torn down, so the owner just leaves it vacant.”\n\n\n“I’m not going!”\n\n\n“Don’t pussy out, Ant.”\n\n\n“Will one of you go with me?” Ant pleads.\n\n\n“Spin the bottle, and whoever it lands on has to go with you,” Lucy suggests. “I hope it’s Becca. That’d be ironic.”\n\n\n“Sure,” Carter says. “Let’s do that.”\n\n\nAnt thanks Lucy and spins the bottle. It wobbles and slows to a halt, pointing directly at you.\n\n\n“Well, I guess Hazel’s going to Dead Man’s Barn,” Mason says.\n\n\n“No, she can go to Herr Eichel’s if she wants. Eichel’s just an old, slow dude. The Dead Man’s a supernatural murderer,” Lucy says.\n\n\n“Let Hazel pick,” Kyle says, trying to stand before stumbling and leaning back on the truck.\n\n\n“Yeah. Go ahead Hazel. Ghost or Nazi.”", "action_results": [{"action": "Go with Ant to Dead Man's Barn", "result": "\"Dead Man's Barn.\"\n\n\n\"If you think so,\" Lucy says as Mason nods encouragingly.\n\n\nAnt nods nervously.\n\n\n\"Good choice,\" Mason says.\n\n\nYou nod. The group begins to stand, and starts walking towards Dead Man's Barn.\n\n\n\"I'll... I'll stay here!\" Kyle slurs, collapsing into the back of the pick-up truck.\n\n\nLucy shrugs, and continues leading the group out of the forest. The group drops the various empty cans among the shrubs as you emerge in yet a bland, empty field with an old, clearly abandoned and boarded up barn in the center. It's a particularly large barn, but other than that it's just an old, boring barn.. The sun's fallen, so Lucy brings out her phone and turns on the flashlight. She leads you to the barn, and Mason grabs the edge of a piece of plywood and pulls it back.\n\n\n\"This is stupid guys,\" Ant says.\n\n\n\"What, scared of a ghost?\" Mason chuckles.\n\n\n\"No! I'm just scared of tripping and getting tetanus from a rusty nail!\"\n\n\n\"Pussy,\" Mason says, rolling his eyes.\n\n\nMason pulls the plywood back further, creating a large enough gap for you to step through. \n\n\n\"Thank you,\" you say as you step through.\n\n\n\"Of course, Ma'am,\" Mason smiles. \n\n\nAs you step through, you enter complete darkness penetrated by a single beam of pale moonlight coming from the gap. Ant steps in afterwards, looking around nervously.\n\n\n\"OK, we've went inside, dare's over,\" Ant says.\n\n\nMason sighs, pushing the plywood back in place. You hear his muffled voice a few seconds later.\n\n\n\"Go upstairs and open the boards at the window. Then we'll let you out, Ant,\" Lucy says.\n\n\n\"You're a bitch!\" Ant says, thumping on the plywood, before turning to you.\n\n\n\"Let's explore,\" he says nervously.\n\n\nYou pull out your phone, turning on the flashlight. The inside of the barn is immediately illuminated. Several horse stalls made of rotten wood takes up most  of the barn, with the floor covered in dried, rotten hay. \n\n\n\"It smells like shit in here,\" Ant complains.\n\n\n\"Hush,\" you reply.\n\n\nYou spot a partially rotted out stairs leading to the upper floor. You walk over to it. You put your foot on the first stair and put some weight on it to make sure it'll hold. You slowly make your way up the stairwell, reaching the upper-floor. There's a dead silence inside, even the wind dying as complete silence consumes you. You scan the room with your flashlight. You wince as you notice a blood-stained noose hanging from the ceiling.\n\n\n\"Jesus. Is that what I think it is?\"\n\n\n\"No, Hazel, it's a fucking... I can't even think of a mocking example. Of course it's a...!\"\n\n\nThere's a creaking of the floorboards behind you, and you quickly turn to find... nothing.\n\n\n\"Hazel, please. If you're trying to freak me out, just... don't.\"\n\n\n\"I'm not doing...\"\n\n\nYou feel something knock into your back and you fall forward with a yelp. Your phone flies from your hands. It falls forward down the stairs, thudding before it lands on it's back, obscuring the flashlight and plunging you into total darkness.\n\n\n\"What the fuck, Ant?\"\n\n\n\"I swear to god, that wasn't me!\" Ant says. \"Let's get out of here, fuck the window.\"\n\n\nYou hear haggard, wet breathing in at the stairwell, and you freeze.\n\n\n\"What...?\"\n\n\n\"Shut up!\" you hiss.\n\n\nThe breathing continues, before turning to a wet, squelching chuckle. Ant whimpers, as you begin to back away from the stairwell.\n\n\n\"It ain't your night tonight, kids,\" a deep voice says, each word interspersed with the wet squelching you've heard before. \"What the fuck makes two dumbass, chicken shit kids come into a place you don't belong?\"\n\n\n\"What the fuck...?\" Ant says, half whimpering and half shrieking.\n\n\n\"Sssh... save your breath. I ain't even given you a reason to start hollering... yet.\"", "action_results": [{"action": "Charge the figure", "result": "You charge forward, and the figure grabs you. It's arms grab your wrist and pin you to the wall. You hear the soft thudding of Ant's fists on the creatures back, but the figure doesn't even seem to notice.\n\n\n\"Oh, you're going to regret that, darlin'.\" The figure laughs. \n\n\nYou feel the cold metal of a blade press against your cheek. He laughs as he begins to carve your face apart, and all you can do is scream.", "action_results": []}, {"action": "Run", "result": "You turn and start running the other way. In the darkness, you see nothing, and your foot hits a rotten plank that gives way. You scream as you wall, flying through the air before you hit the hard ground with a thud. You scream as you feel your arm break. Ant screams, before falling silence, as you struggle to pull yourself to your feet. You hear frantic yelling outside the barn as your friends realize something's happened, but not before the figure appears above you again.\n\n\n\"Ah, shit kid. You ain't even one of the old bloods. Some immigrant or Northerner or some shit. Well, can't have you telling the city to have this place torn down, though looking at the condition you're in, this'll be a mercy.\"\n\n\nYou start to beg as he slashes the cold steel along your throat as it mingles with a fresh stream of hot blood.", "action_results": []}, {"action": "Attempt to converse with the figure", "result": "\"Please... I don't want to die.\"\n\n\n\"I didn't either, kid. It ain't so bad. Tell your grandparents I said \"Fuck you.\", ok?\"\n\n\n\"Please!\" you say, breaking into a sob.\n\n\n\"HEY! Mason shouts from outside. \"Are you OK in there?\"\n\n\nYou feel cold metal touch your throat.\n\n\n\"Tell him you're fine, darlin'.\"", "action_results": [{"action": "Tell Mason you're fine", "result": "\"I'm fine! There was a rat!\" you shout.\n\n\n\"OK!\" Mason replies.\n\n\nAnt continues whimpering, as a gloved hand runs through your hair.\n\n\n\"Good girl... I don't recognize you in the dark. Let's see who you are... don't scream, by the way.\"\n\n\nYour hear the flick of a lighter before a flame splutters to life in front of you, illuminating all three of you. Then, you get the first sight of the Dead Man. His skin is grey and dead, his eyes cold, lifeless and pure black. His mouth has been carved open, the cuts carving upwards into a smile. Blood stains his rotting skin and his shirt. He wears a classic cowboy hat and leather duster, and his neck is covered in the deep bruises caused by a noose. Ant tries to scream, but can't find the air to do so. You freeze, immobilized in terror, as the Dead Man grin.\n\n\n\"Well look who we have here. A Ceder and a wanderer.\"\n\n\nYou stare at him as he caresses the side of Ant's face.\"\n\n\n\"What's your name, boy?\"\n\n\n\"Anthony Ceder.\"\n\n\n\"I remember you. I remember your people. I remember seeing your great-great-grand mama. A little Jewish girl who ran the store and didn't have shit. You're one of the few families that didn't string me up in this town. I ain't got no feud with you.\"\n\n\nHe turns to you, and presses the knife to your lips.\n\n\n\"Darlin', you should smile more. It'd make you a hell of a lot prettier.\"\n\n\nHe traces the path of a smile along your face with the cold blade.\n\n\n\"Don't hurt me.\"\n\n\n\"Ah, I'd never hurt a woman 'less I had a reason. I don't recognize you. You're a wanderer, ain't ya? You ain't from Dawnwoods originally,\"\n\n\n\"I'm from New York.\"\n\n\n\"Hell, might cut you up for that if I weren't as nice a guy as I am.\"\n\n\n\"Are you sure you're OK?\" Becca shouts, and the Dead Man presses the knife to your throat.\n\n\n\"What's her name?\" he hisses.\n\n\n\"Becca,\" you whimper.\n\n\n\"I fuckin' know that voice! I fuckin' know that voice! I fuckin'... Becca Montgomery. The great-great however fuckin' many greats grand daughter of Horton J. Montgomery. That bitch...\"\n\n\nThe Dead Man is clearly quite distracted by his vengeful rant. If there's a time to do anything, it's now.", "action_results": [{"action": "Wait patiently", "result": "\"...that goddamn bitch, I'll... Call her.\"\n\n\n\"What?\" you ask.\n\n\n\"I said call her, you yankee bitch! Tell that Mongomery whore to come in!\"", "action_results": [{"action": "Tell Becca to come into the barn", "result": "\"Becca! Can you come in here, please? We need a hand. Ant got his leg stuck!\"\n\n\n\"Sure, we'll come in!\" Mason shouts.\n\n\nFuck, you didn't mean for them all to come.\n\n\n\"Good job, darlin'. Sorry 'bout this, but I can't let any of you kids get out. God, I'm bagging a Montgomery tonight!\"\n\n\nYou scream as his blade slices open your throat, cold steel mixing with warm blood.", "action_results": []}, {"action": "Refuse", "result": "\"Fuck you! Becca, don't...!\"\n\n\nThe cold metal of a blade slices open your throat as before you can get out another word as cold steel mingles with hot blood.\n\n\n\"Dumb bitch.\"", "action_results": []}]}, {"action": "Elbow him and run", "result": "You slam your elbow into his face and he drops you with a grunt.\n\n\n\"Fuckin' bitch!\" he grunts.\n\n\nYou grab Ant's arm and yank him down the stairs, you turn, yelling at Mason to move the plywood as you sprint towards it. The Dead Man appears in front of you.\n\n\n\"Hiya, darlin',\" he chuckles, blood spurting out of his throat.\n\n\nHe begins walking towards you, as Ant lets out a whimper. The Dead Man grins, his skin tearing open as blood trickles down his chin.\n\n\n\"I'm going to...\" he says, before pausing.\n\n\nThere's a crunch as a large piece of plywood is pulled away by Mason. A beam of moonlight comes in, hitting the boot of the Dead Man. There's a sizzle as he boot begins to fade, and the Dead Man snarls. In the blink of an eye, he's gone. You don't know where he's gone, but you're not waiting around to find out.\n\n\n\"Come on!\" you shout, grabbing Ant running towards the gap in the boards.\n\n\nYou scamper through, collapsing on the cool grass outside.\n\n\n\"What the fuck happened?\" Mason asks.\n\n\n\"The Dead Man was there! He was there, and he was so mad, and he...\"\n\n\n\"Ant, calm the fuck down!\" Lucy shouts, grabbing Ant and shaking him. \n\n\n\"You're d-d-drunk as fuck, Ant. You d-don't know w-what you saw,\" Carter says.\n\n\n\"I did! Ask Hazel!!\"\n\n\nThe group turns to you, and you nod.\n\n\n\"There was a ghost in there. It had it's throat slit and...!\" you say in a nervous panic.\n\n\n\"Alright, calm down,\" Mason says, pulling you in and squeezing you in a hug.\n\n\nYou feel your heart flutter as you take deep breaths, your head nestled in your chest.\n\n\n\"G-get a room,\" Carter says.\n\n\nYou blush as Mason lets go of you.\n\n\n\"In fairness, you've drunk a fair bit as well. You're more pissed than I am. Maybe you were just seeing things in the shadows that weren't there,\" Mason suggests.\n\n\nYou shrug whilst shaking your head.\n\n\n\"I don't know.\"\n\n\n\"Come on, let's head back to Kyle,\" Becca says.\n\n\nYou walk back through the field and back into the woods, heading towards the trucks.\n\n\n\"S-s-so, this w-was a bad id-idea,\" Carter says. \"We just p-panicked Ant and H-Ha-Hazel.\"\n\n\n\"We risked our lives to annoy what could have been a harmless old man,\" Ant says.\n\n\nYou arrive at the camp, and Mason swears loudly.\n\n\n\"FUCK! Where the hell is Kyle?\" he asks.\n\n\nThe camp is empty, with no one in sight.\n\n\n\"R-r-remember last time we lost Kyle when he was drunk?\"\n\n\n\"Oh dear God, he ended up pissing in my garden. He wasn't pissing into the garden. He was standing in the garden, pissing on my house,\" Becca says.\n\n\n\"That was funny,\" Ant says, still shaken up from his experience.\n\n\n\"We need to find him. Is anyone not sober enough to find this place again?\" Mason says.\n\n\nThere's silence.\n\n\n\"Good. We'll split up and try find him. Ant, you head towards the Rotten Trees, Lucy, go towards our old tree house, Becca, towards the old drinking point, Carter, back towards town. Hazel, you're new here. There's a stream just over there,\" Mason says, pointing. \"Just walk along there, and keep your phone on. If you can't find him, follow the stream back here.\"\n\n\nYou nod. Time to find Kyle.", "action_results": [{"action": "Walk along the stream", "result": "You walk alongside the stream, your shoes squelching in the wet mud. You walk along to the drier earth, but they're already ruined.\n\n\n\"Fuck,\" you sigh, walking along. \"Kyle! Kyle! Are you there?!?\"\n\n\nYou hear what sounds like twigs breaking behind you, and quickly twirl around. Must've been your imagination. You continue walking along the stream.\n\n\n\"Kyle! Kyle! I don't care how drunk you are, do something! I'm getting sick of looking for you!\"\n\n\nYou hear the rustle as leaves as the wind picks up, and what was earlier a hot, humid night is now turning bitterly cold, as the light that the moon was provided dims considerably. For the first time, you realize that you're walking in the middle of  a place you've never been, late at night, with no one around. You consider turning around and heading back, but you know if Kyle's passed out somewhere, you need to find him.\n\n\n\"Hello!\" you call.\n\n\nYour voice carries out across the trees. Then, the silence resumes. There's a silence so deadly quiet it's painful. There's no birds, no small mammals scurrying among the trees or undergrowth, not even a cricket. You take deep breaths in an attempt to calm yourself down, before you here a low growl. You turn around, flicking your head around desperately to find the source of the noise, desperately wanting to run but not knowing which direction to do so.\n\n\n\"Kyle? Is that you?\" you whimper.\n\n\nThe growl stops, and the silence resumes. You stand perfectly still, not wanting to disturb whatever's out there. Then, it lets out a roar. The roar's incredibly loud and you scream in pain as the sound like shattering glass as concrete scrapes against each other. You feel pure, unadulterated terror, which is amplified when you spot the beast. \n\n\nThe Beast stands on four legs, the shape of a bear but the size of a large truck, covered in thick fur that's so dark it consumes what little moonlight makes it through the trees. It's eyes are pure red, the all-consuming crimson of fresh blood that peer through your eyes and bore into your soul. As it roars, it revels a mouth filled with hundreds of teeth the size of daggers, pure white and sharp enough to drill through solid steel. It stands, blocking the route back towards your friends. You need to do something, now.", "action_results": [{"action": "Run", "result": "You turn, and run as fast as your legs will carry you. Trees are torn up and sent flying away behind you as the beast gives chase. Thankfully, its size means that navigating past the trees is impossible, so it needs to tear them up and throw them away to follow you. You have enough of a lead to know you have two options: You could head towards town, getting help from the many armed residents of Dawnwood who have enough combined firepower to invade a small nation, which would easily be enough to scare away or kill the beast. Hell, the need for that is unlikely, as since there's been a lack of reports about this creature, it probably wouldn't venture out and follow you if you escape the confines of the trees. On the other hand, if you head towards the caves, you might be able to find a place to hide and escape this terrible beast.", "action_results": [{"action": "Run towards the town", "result": "You run towards the town, letting out a desperate scream for help. It charges towards you, the gap between the pair of you lowering. It sprints towards you faster than a truck, and finally manages to catch you, batting you with its paw with incredible strength. Your bones break and crack as you're sent spiraling through the air. You land in a heap by the soft earth and let out a shriek as your limbs twist at incredible angles that they're definitely not meant to go. The creature walks slowly towards you, and you try to crawl away but find yourself unable to move. You see the flash of the beast's teeth and a spurt of crimson before it finishes off its prey.", "action_results": []}, {"action": "Head toward the caves", "result": "You change direction, bursting towards the few caves that these woods have. You can here the beast right behind you, feeling its hot breath on the back of your neck, blowing your hair out of the way. You spot two caves you think... well, hope you can reach before it catches you. One is a small crack in stone that you think you can dive through that's definitely far too small for the beast to follow you that leads into a tunnel further in. The other is an opening to a large cavern that's also too small for the beast to follow you and that widens considerably further down.", "action_results": [{"action": "Go through the small tunnel", "result": "You dart through the small crack, heading quickly down the tunnel. As you're emerged in complete darkness you stop walking, your deep breaths echoing off the cave walls creating an eery sound. You pull out your phone and turn on the flashlight, illuminating the area. Then, you let out a petrified scream. The walls are covered with vivid symbols of red, sharp and alien characters you don't recognize. But that's not what makes you scream. Three bound figures lie on the ground, their bodies now a scene of horrific cruelty. They're naked, but their skin has been torn off to let you see the wet muscles that glisten underneath. You let out a sob as they begin to writhe. They're not dead, you realize in terror. The figures writhe, and you begin sobbing as you back away in terror. You run with a scream to the opening of the tunnel. You don't dare venturing out in case you're sighted by the beast, so you sit by the opening, sobbing. You begin to smell a strange smell coming from further down the tunnel, this one different from the rotting flesh. Soon, your wretched, sobbing and broken body finds sleep.", "action_results": [{"action": "Awaken", "result": "\"We found her!\" a voice cries, awakening you from her slumber. \n\n\nYou open your eyes, spotting a young man you vaguely recognize as the town mechanic.\n\n\n\"It's ok,\" he says. \"You're going to be alright.\"\n\n\nThe images of the writhing corpses fill your mind as more of the town's residence arrive.\n\n\n\"Jesus, what the fuck happened her?\" someone asks.\n\n\n\"God, is she OK?\"\n\n\n\"Does she need a doctor?\"\n\n\n\"Hazel! Where's my baby girl!?!\"\n\n\nYou hear Dad's voice and spot him among the growing crowd.\n\n\n\"Dad!\" you cry, as he leans in and hug him.\n\n\n\"Oh Hazel, thank God I've found you. What the hell were you thinking, sneaking out like that? It’s OK, I found you. You’re safe. What happened?”\n\n\nYou sob, and attempt to recount your story to Dad, to his confusion.\n\n\n“Your friends said that you had been looking for Kyle. They found him, but then they couldn’t find you. You… you smell of drink. What were you thinking, Hazel? You must’ve got drunk and seen a bear. I’ll tell the sheriff and have a hunting party sent out to kill it.”\n\n\n“It wasn’t a bear, Dad! And there were bodies! They’re in the cave!”\n\n\n“Sweetie, you were drunk!”\n\n\nThe Sheriff appears, emerging from the crowd. He stops by Dad, squeezing his shoulder.\n\n\n“I’m glad you found your gal, Malcolm. We’ll talk later,\" he says, before pausing. \"She smells of drink. I've always believed in the father disciplining the kid, so I'll leave that to you, Malcolm.\"\n\n\n “Come on, sweetie!” Dad says. “I’m getting you home.”\n\n\n“No wait, check the cave! There’s bodies in there!”\n\n\nDad sighs, and the Sheriff heads in. He appears a minute later, shrugging.\n\n\n“There ain’t nothing in there. There's a few rabbit carcasses that look to be infected, but that's it,” he says.\n\n\n“What…?” you ask in confusion. \"I need to go down there and check...!\"\n\n\n\"Calm down, darling. Those animal corpses could give you an infection. You might've seen them wrong in the dark. I'll have someone clear them out later. Come on, everyone, head on home.\"\n\n\nThe Sheriff stands by the entrance to the tunnel, motioning for people to leave as the search and rescue party heads out towards the town as Dad thanks them.\n\n\n“Come on, Hazel, let’s get home,\" Dad says.\n\n\nYou follow Dad out as he leads you back home.", "action_results": [{"action": "Go home", "result": "The ride home is long and quiet. Dad can clearly tell you don't want to talk, so he leaves you alone. Eventually, you pull into the driveway.\n\n\n\"I've told your teacher you won't be coming in today. Go upstairs and have a shower, you can have the day to relax. I'm staying home to look after you today.\"\n\n\nYou nod, and walk inside. You pull off your mud-covered shoes, and walk upstairs, leaving a trail of muddy water behind you. You walk into the bathroom, and slowly get undressed. You unbutton and pull off your jeans, then step out of your underwater. You pull off your jumper, than your shirt. As you go to unclasp your bra, you freeze as you notice yourself in the mirror. One of the strange, alien symbols you saw covering the cave walls above the disgusting, shuddering, skinless bodies, is carved into your stomach, just below your belly button. You shriek, and you hear Dad call up to you.\n\n\n\"Hazel? Are you OK?\"", "action_results": [{"action": "\"I'm fine!\"", "result": "\"OK, honey.\"\n\n\nYou stare at the symbol in horror, before taking a deep breath. You open your bathroom cabinet, and pull out some bandages, applying it to the wound. The wound's shallow and small, nothing really to worry about medically, although it terrifies you. Whoever did that to the corpses had access to you while you slept. You shudder at the sight. You decide to shower to feel some bit cleaner.", "action_results": [{"action": "Shower", "result": "You walk into the shower, and set the temperature as hot as you can without scalding yourself. You step under the water, feeling your hair grow in weight as the water soaks it through. The water warms you and helps clean the layer of dirt and mud from your body. To your absolute embarrassment, you notice the water pooling yellowish beneath you before it goes down the drain and you realize in the terror of last night you must have wet yourself at some point. You blush, both from embarrassment and the scalding water, and finish cleaning yourself. You turn off the shower and grab a towel, tossing your dirty clothes into the wash basket. You dry yourself off and get dressed, before collapsing on your bed. You grab your laptop and turn it on, finding comfort in the endless terrible comedies that Netflix provides. Dad brings you breakfast, then lunch, leaving you in a cocoon of blankets in front of the latest episode of Some random crime show about a police division that doesn't do nearly as much in real life, finding comfort about the stereotypical characters and massively contrived murder methods used to kill people. Eventually, you hear a knock on the door.\n\n\n\"Hazel!\" Dad shouts. \"Your friends are here.\"\n\n\nYou wiggle out of bed and jump up, walking down the stairs. Standing there are Mason, Carter, Lucy, Ant, Becca and Kyle. \n\n\n\"Hey, Hazel. You feeling alright?\" Lucy asks.\n\n\n\"Yeah,\" you reply.\n\n\n\"I'm so sorry, I just got drunk and wandered off to find a place to go to the bathroom. I didn't think anything would happen to you because of it!\" Kyle says apologetically.\n\n\n\"It's fine,\" you say.\n\n\n\"Well, we were only stopping by to see if you're OK, and if you wanted to go down to town and get a bite to eat.\"\n\n\nDad stares at you.\n\n\n\"Do you remember what happened last time you went out? Only last night, remember?\"\n\n\n\"We'll have her back before sundown. We're only going into town, and I'll take good care of her,\" Mason says.\n\n\n\"I'm sure you will,\" Dad says skeptically, looking Mason over. \"Hazel, keep your phone on and be back by eight. Not half eight, not quarter past eight, not a single minute past eight. Got it?\"\n\n\n\"Yes, Dad.\"\n\n\nYou walk out the door with your friends out towards town.", "action_results": [{"action": "One Hour Later...", "result": "An hour later, you sit in the pizza place Lucy and Becca work in, with two other unfortunate teenagers working behind the counter, a large pepperoni pizza in the middle of the group.\n\n\n\"So... you were attacked by a monster... who then led you into a trio of undead dead people?\" Ant asks. \"No offense, but that sounds like complete and utter bullshit.\"\n\n\nYou stare at Ant incredulously.\n\n\n\"Do you not recall less than an hour before that what happened? You nearly pissed yourself!\"\n\n\nAnt looks down, ashen faced.\n\n\n\"There were no ghosts. You're just fucking with us,\" Lucy complains.\n\n\n\"Fine, I believe you.\"\n\n\n\"I believe her,\" Kyle says.\n\n\n\"You d-don't have a c-c-choice, Kyle. You n-nearly got her kill-killed,\" Carter says.\n\n\nKyle shrugs.\n\n\n\"Fine, say we believe you,\" Becca says. \"What are we going to do about it?\"\n\n\n\"What do you mean?\"\n\n\n\"Well, there's a monster in Dawnwoods.. That's a problem, also the monster's too big to go in the cave you were in or else it would've caught you, so that means the body skinning thing is separate, so we got a monster and at least one Satanist.\"\n\n\n\"How do you know it was Satanism?\" Ant asks.\n\n\n\"Well, it wasn't Christians, hence, it must've been Satanists,\" Becca says.\n\n\n\"Why c-couldn't it b-b-be any other r-r-religions?\"\n\n\n\"Carter, this is the whitest, most Christian town that has ever existed. There was one Sikh family, and they had a cross burned on their lawn and were forced out of town after 9/11. There's no other religions here.\"\n\n\n\"OK, fine.\"\n\n\n\"So, what are we going to do about...?\"\n\n\nYou groan as a sharp pain hits your stomach. It intensifies, and you let out a yelp.\n\n\n\"Are you OK, Hazel?\" Mason asks.\n\n\n\"Yeah, I'm...\" you groan, and Lucy helps you to your feet.\n\n\n\"I think I'm going to be sick,\" you groan.\n\n\n\"Come on, I'll take you,\" Lucy says, dragging you into the bathroom.\n\n\nYou're pulled past the urinals and into one of the stalls, and drop to your knees, letting out a torrent of puke. You groan in pain as you begin to puke, filling the bowl.\n\n\n\"Thank Christ I'm not on shift now. I'd hate to have to clean up this again,\" Lucy says.\n\n\nYou puke again, before the pain starts to recede.\n\n\n\"Don't worry, Hazel, we'll get you home soon,\" Lucy says.\n\n\n\"Hey, Lucy?\"\n\n\n\"Yeah?\"\n\n\n\"Did you drag me into the guy's bathroom?\"\n\n\n\"Oh, oops. Sorry, Hazel. I clean both toilets, so I'm used to entering them both, and this one was closer...\"\n\n\nYou sigh, and stand, ready to go home.", "action_results": [{"action": "Go home", "result": "You friends drag you home, where your father waits.\n\n\n\"Hazel! Are you OK? Carter called and told me you were throwing up.\"\n\n\n\"I'm fine,\" you groan, as Dad helps you inside.\n\n\n\"Go upstairs, sweetheart. I'll get you a flat Seven-Up to help settle your stomach and a hot water bottle. Thanks for helping get her home, guys,\" Dad says.\n\n\n\"No bother,\" Mason replies. \"See you later, Hazel.\"\n\n\nDad helps you up to bed, and you collapse onto your mattress. You fall asleep before Dad even gets into the ktichen.", "action_results": [{"action": "Six Hours Later...", "result": "When you wake up six hours later, you panic. You're lying in a rusted, iron cage, surrounded by pitch darkness. You stand slowly, finding yourself in the middle of the woods. You look around desperately for a way out, but it seems you're stuck in here. The wind blows through the trees, rustling leaves and giving you a cold chill as you realize you're in your underwear. You look around, spotting a large RV next to the cage. Two figures step out and begin walking towards you. They both wear ski masks, hoodies and baggy black pants, with one carrying a doctor's bag. A third appears, pushing a gurney towards you. You scream for help and back away to the back of the cage. One of them steps forward and unlocks the cage door, and they enter the cage.\n\n\n\"Hands behind your head, don't move,\" one of the figures said.", "action_results": [{"action": "Attack", "result": "You charge forward, swinging at the first man. You hit him with some force in the jaw, and he grabs your arm. He slaps you hard across the face, knocking you to the ground. The men grab you, and force you into the gurney. They strap your hands up my your head and your feet together, leaving you stretched out on the gurney. A ball gag is stuffed in your mouth and strapped tightly. You wince one off them puts surgical gloves on, before drawing a thermometer that's pushed into your ear. He checks it, before placing a cold hand on your stomach. He pushes gently, before squeezing.\n\n\n\"I'm right. Get the injections ready.\"\n\n\nYou shake and try to scream as one of the men takes out a needle that's almost comically large and sharp. He jabs it into your stomach and you scream into your gag and presses down, releasing the liquid into your stomach. You begin to tear up as he repeats the process with several more needles, and by the end your eyes are obscured with tears. He smiles at you through the ski mask, before another man arrives with a large burlap sack. He opens it, pulling out a small mammal like a rat or a ferret, and a large knife. You watch in horror as he slices the mammal's throat open, letting blood flow out onto your stomach. He tosses the carcass aside, and begins to use his fingers to draw various patterns along your belly as you wince and shake. He sighs, and slaps you hard across the face.\n\n\n\"Stop shaking,\" he says, before turning to one of the other men. \"Tomorrow night.\"\n\n\nHe finishes drawing his patterns, before taking out a small black notebook. He begins to read from it in an insane language you don't understand, like the spluttering of a madman. The pain in your stomach intensifies greatly as you let out a petrified scream as you feel yourself being torn apart. Finally, he stops, as does the pain.\n\n\n\"Ah, good. Get the chloroform and untie her. Then, bring the kids back from their walk.\"\n\n\nThey free you from your straps, and you notice the door's still open.", "action_results": [{"action": "Run for the gate", "result": "You leap up and run for the gate. Clearly the men weren't prepared for your newfound strength, so you charge out of the cage and begin sprinting towards the trees. As you hear the men loudly swearing behind you, you break through the trees. You run through the darkness as you avoid trees, before knocking into something. You fall to the ground, painfully scraping your knee on a tree root. You look up, and scream in terror as you see them. A half dozen figures slowly surround you, giving you a view of them. The... creatures are all children, but they're so deformed, so mutated, they barely qualify. One is missing both it's arms, replaced with long, thin, slimy tentacles that reach forward to touch you. A second is missing most of its face, a gaping hole in its place filled with tiny, wiggling tentacles from the walls, back, roof and floor of the mouth. A third looks like a cute, perfectly normal girl of around four years old, except her mouth hangs open and her eyes are completely black. Another, one of the worst, looks like a cross between a schoolgirl, a fetus and an octopus, and stands wiggling above you as it reaches out towards you. You scream, and crawl backwards, terrified. They advance slowly, tentacles extending to rub you, slick goo wiping across your face and hair. You sob as you try to stand, before being yanked up by a man in a mask. He takes out a large rag and a glass bottle. He soaks the rag, before holding it to your mouth. You try not to breath, but after about a minute you take a gasp for breath, inhaling the fumes.", "action_results": [{"action": "Lose Consciousness", "result": "You awaken in your bed, terrified and curled up in your blankets. You briefly wonder if you dreamed everything, but know that that's impossible. Your knee hurts where you scraped it, your window is still open, and you know your mind couldn't conjure up everything you saw last night.\n\n\n\"Honey? Are you OK?\" Dad calls.\n\n\nYou pause, wondering if you should tell him, before realizing he'd never believe you.\n\n\n\"Yeah, I'm fine,\" you reply, wondering what you should do. \n\n\nIt's Saturday, so you could visit your friends and explain the situation. If you're more optimistic, you could go through the normal, legal means, although you're almost certain that will be complete and utter bullshit.", "action_results": [{"action": "Visit your friends", "result": "You shower, noticing the same mark still under your belly button, and head off to meet your friends after a quick breakfast with Dad who remarks how \"You look like you haven't slept\". He gives you something to help settle your stomach, and you head out, texting your friends. They're already at Ant's house, so you head over there, carefully following their directions. Eventually, you find yourself at a house that's not even worth describing as it's identical to every other house in this shitty town. You knock on the door, which is opened by a short, balding man in a cheap suit.\n\n\n\"Hello?\" he asks, peering at you.\n\n\n\"Hi. I'm Hazel, I'm a friend of Ant's.\"\n\n\n\"Hmmm... Of course you are. I'll admit, it was my mistake calling him Anthony. I wish I had went with something nicer. It was his mother, god rest her, who wanted to give him a nice name like Connor, but I wanted Anthony. Ah, I'm rambling. He's in the games room, last left.\"\n\n\nYou nod and thank him, heading down towards the last left and going inside, finding a pool table, several beanbags with your friends spread out among them, and an Xbox.\n\n\n\"Hey Hazel. F-f-feeling better?\" Carter asks.\n\n\n\"Yeah, I... I need to talk to you about that.\"\n\n\nAnt looks up at you, raising an eyebrow.\n\n\n\"Have you... put on weight?\" he asks, staring at your belly through your t-shirt.\n\n\n\"Hey Ant: Stop being such a prick. You don't ask a girl that,\" Lucy says.\n\n\n\"What do you need to talk about?\" Mason asks, looking away from the console to look at you, which Ant quickly takes advantage of and both screen peaks and starts heading towards his location for an easy kill.\n\n\nYou explain your situation to the group, and they stare in either disbelief or horror.\n\n\n\"There's no such thing as monsters,\" Lucy says as you end your tale.\n\n\n\"Hang on,\" Mason says. \"There's a rusted out cage from the old freak show in the woods. How else would she know about it?\"\n\n\n\"Maybe she saw it when she was lost.\"\n\n\n\"I didn't,\" you say.\n\n\n\"Fine. We have to do something about this, then,\" Becca suggests.\n\n\n\"She's right,\" Kyle says.\n\n\n\"Y-You're only agreeing because you f-f-feel bad about getting her l-lost,\" Carter points out.\n\n\n\"Shut it, Carter!\" Kyle hisses.\n\n\n\"Have you called the police?\" Ant asks.\n\n\n\"I told the Sheriff, he didn't believe a word I said when he found me.\"\n\n\nMason nods.\n\n\n\"Sheriff's an idiot. We have to check out the spot,\" he says.\n\n\nYou shake your head nervously.\n\n\n\"I'm not going back there. There's that beast and those Satanists...\"\n\n\n\"If you want, I could get my brother to drive us out there in his pick-up,\" Lucy suggests.\n\n\n\"Will Drake really take us out to the woods?\" Becca asks in surprise.\n\n\n\"He owes me. I covered him when he was caught doing business with some kids at school.\"\n\n\n\"Doing business?\" you ask.\n\n\n\"Drug dealing,\" Lucy explains, eerily matter of factly.\n\n\n\"Oh.\" \n\n\n\"I'll give him a ring,\" she says, disappearing off into a side room.\n\n\nYou sigh, nervous at the thought of heading back to the cage, but you know it needs to be done. You wait for Lucy to return, which she does after a few minutes.\n\n\n\"Good news and bad news!\" he says cheerfully.\n\n\n\"Go on.\" Carter says.\n\n\n\"My brother will drive us into the woods and help us look around... but not until eight.\"\n\n\n\"It'll be dark by then!\" you say hysterically.\n\n\n\"It's OK, you'll be safe with all of us! I'll have Drake bring the biggest, most powerful flashlights he can, and a gun or two,\" Lucy says, smiling.\n\n\n\"I don't... I mean, I can''t...\"\n\n\nMason grabs you and smiles.\n\n\n\"It's OK, Hazel. I'll keep you safe.\"\n\n\nYou have to admit, you do feel safer in his arms. Damn his charm.\n\n\n\"Fine, we'll do it,\" you say.\n\n\n\"Great. I'd feel bad if you were killed by evil cultists because we didn't do anything.\"\n\n\nHe smiles cheekily, and you begin to regret this decision.", "action_results": [{"action": "Nine Hours Later...", "result": "Nine hours later, you're ready to go. You've somehow convinced Dad to let you go out, not daring to tell him your actual destination and instead claiming you're staying at Lucy's house. You meet up at the Lucy's house with the group, and walk into the living room, where they're all sitting around.\n\n\n\"Are we ready?\" you ask.\n\n\n\"Damn straight!\" Ant smiles, holding up a large backpack. \"Spare food, water bottles, lighters, matches, rope, fireworks, some knives and flashlights. What'd you guys bring?\"\n\n\nCarter holds up half a chocolate bar he's been chewing on.\n\n\n\"Half a M-Mars bar,\" he says, before taking another bite. \"A q-quart-quarter of a Mars b-bar.\"\n\n\n\"I brought a penknife and a lighter,\" you shrug, and Ant looks around disappointedly.\n\n\n\"No one brought anything?\" he pouts. \"You guys suck.\"\n\n\nYou hear a horn outside, and look outside. A large RV drives up the driveway, stopping outside. Lucy skips out the door, before running up to him, and you follow her outside.\n\n\n\"Hey, Hazel,\" Drake says.\n\n\n\"Drake's friend, Ed, has the pick-up, so we're driving to the woods, meeting him and switching vehicle,\" Lucy tells you.\n\n\n\"OK,\" you say, walking into the RV. You raise an eyebrow as you notice that the RV's windows are covered with shutters and bin bags, and the actual interior looks like a scene from Breaking Bad, covered with beakers, test tubes, Bunsen burners and other Chemistry gear.\n\n\n\"Well, you're blatant,\" you say.\n\n\n\"Hey, it's effective.\"\n\n\n\"I mean, yeah, but Breaking Bad made this a trope. Don't police search RV's for this.\"\n\n\n\"Breaking Bad helped my sales enough that I'm bribing the deputy. You'll be surprised how much extra meth heads are willing to pay for a product when you add some blue dye.\"\n\n\nYou shrug, and take a seat in the RV, as your friends pack in.\n\n\n\"Be careful back there. Knock one thing over and this place could blow.\"\n\n\n\"Really?\" you ask.\n\n\nDrake grins and shrugs, and begins driving.\n\n\n\"Maybe. I mean, there's a distillery back there as well as the lab. I'd imagine one speed bump and boom!\"\n\n\n\"That's unnerving,\" Ant says.\n\n\n\"I guess. So, why the hell am I dragging all your friends into the middle of the woods to the old freakshow cage?\"\n\n\n\"I told you already,\" Lucy reveals.\n\n\n\"That nightmare bull isn't convincing me. What's the real reason?\"\n\n\n\"That is the real reason.\"\n\n\nDrake turns around to stare at you in annoyance.\n\n\n\"What...?\"\n\n\n\"Eyes on the road, Drake,\" Kyle says.\n\n\n\"Fine,\" Drake says, turning around. \"Still, I want an explanation why I'm driving into the woods because the new girl had a nightmare.\"\n\n\n\"It wasn't a nightmare!\" you say.\n\n\n\"Sure,\" Drake says.\n\n\nYou all sit in awkward silence until you reach the outskirts of the woods. Drake pulls over, and you stand and head out the door. Although you couldn't tell because of the shutters and blacked out windows of the RV, you can now see that night has fallen. An empty red pick-up truck with four seats sits next to the woods. Drake strides forward, pulling out his phone.\n\n\n\"Ah, shit,\" Drake says. \"Of course Ed left the truck here and went off on his quad rather than just take back the RV like he was supposed to.\"\n\n\nHe locks the RV and hides the keys in the wheel well.\n\n\n\"I'll text my friend and get him to pick up the RV. Come on, get inside. Let's go drive to a dumbass cage in the woods.\"\n\n\nDrake, Lucy, Carter and Ant go in the seats while you, Mason, Becca and Kyle sit in the back of the pick-up. You sit, half-lying on Mason who wraps one arm around you. The emotional part of your brain momentarily forgets all fears in favor of a childish infatuation and hormonal lust towards Mason that causes you to blush and your heart to flutter, the rational part of your brain reminds you to stay vigilant in case the cultists or that beast do show up. You and the rest of your friends pull out flashlights and fire the beams off into the darkness, illuminating trees and undergrowth.\n\n\n\"We're nearly there,\" Drake shouts. \"It's a hell of a lot easier to get here because a path's been made.\"\n\n\nYour ears perk up at that.\n\n\n\"What do you mean?\" you ask, as Drake rolls down his window fully.\n\n\n\"What'd you say?\"\n\n\n\"I said what do you mean? You said there's a path.\"\n\n\n\"Yeah. It's like a big RV drove over the undergrowth and knocked a dirt path along.\"\n\n\n\"What, you think Ed's been driving out here to work in the RV?\" Lucy asks.\n\n\n\"Nah, Ed's terrified of the woods. Said something about a monster or something.\"\n\n\nYou feel a flash of fear as you remember the RV from last night. You stare outwards, illuminating every shadow, both hoping to and terrified of seeing something hiding in the dark.\n\n\n\"Here it is! The old freak show's cage!\" Drake says dramatically.\n\n\nAs Drake pulls the pick-up into the clearing in the woods, you see the massive, rusted cage, although there's no RV. You shiver in fear, and Drake steps out of the truck.\n\n\n\"Let's investigate and get home,\" Drake says, firing his flashlight beam towards the cage. \n\n\nThe flashlight beam illuminates the cage and its insides. The old rusted gurney sits there, now encrusted with dried blood.\n\n\n\"Well, that's new,\" Drake mentions.\n\n\nYou step back nervously.\n\n\n\"Hazel said there was a gurney in her dre... when she was abducted,\" Ant points out. \n\n\n\"Fuck, this is some creepy shit. I'm calling the sheriff,\" Drake says.\n\n\nDrake takes out his phone, and makes a call. \n\n\n\"Hello, Sheriff Buckly? I just found a gurney in the middle of the cage in the woods covered in dried blood. I think some weird... oh, really? OK, you know where the cage from the... oh, great.. Cool, see you in a few minutes, or an hour, or whatever.\"\n\n\n\"What was that?\"\n\n\n\"The sheriff said he'll come here straight away.\"\n\n\n\"Good,\" you sigh in relief.\n\n\nYou really can't imagine having to deal with this without the help of the law. Now, it's out of your hands. You wait patiently for Sheriff Buckly to arrive. Eventually, you spot a flashlight heading towards you.\n\n\n\"There he is,\" Drake says.\n\n\nYou shine your light ahead, illuminating the figure of Sheriff Buckly. He swears, and holds his hands to block his eyes.\n\n\n\"Turn that off!\" he says, and you do.\n\n\n\"Fuck, how'd you even get the truck out here? I can barely walk through the undergrowth,\" he says. \"Where this bloody gurney?\"\n\n\nYou point at the cage, and Sheriff Buckly walks over and looks at it. \n\n\n\"Jesus... who else saw this? I'm going to need to gather all the witnesses and find out what was going on,\" he says.\n\n\n\"We're the only people who've seen this, although Hazel got a bit of a closer encounter.\"\n\n\n\"So you didn't tell you pa about this?\" Sheriff Buckly asks.\n\n\nYou shake your head, and Sheriff Buckly nods.\n\n\n\"Good,\" Sheriff Buckly says.\n\n\nSheriff Buckly draws his revolver, and quickly aims at Drake's head and fires. Drake's head snaps back as it explodes partially, sending chunks of gray brain matter, pale skull and pieces of red flesh at you. You scream as Lucy runs over to Drake as his body collapses backwards. Mason runs for the truck, before the Sheriff barks an order.\n\n\n\"Stop! Move another muscle and I'll blow the brain out of everyone of you!\"\n\n\nMason stops, raising his hands. Sheriff Buckly points his gun at all of you, forcing you to raise your hands into the air.\n\n\n\"Everyone, calm down. Nobody needs to get hurt,\" Sheriff Buckly says.\n\n\n\"Fuck you!\" Lucy screams. \"You killed him! You killed him you piece of...\"\n\n\nSheriff Buckly steps forward and cracks her across the head wit his revolver.\n\n\n\"Shut up! Carter, Mason, Ant, Kyle, get in the fucking cage!\" he shouts.\n\n\nMason, Ant, Kyle and Carter slowly walk into the cage.\n\n\n\"Now, back the fuck up to the end of the cage!\"\n\n\nThe boys comply, and the Sheriff draws a set of keys from his pocket, locking the cage door. He turns to you, Lucy and Becca.\n\n\n\"Just don't move. They'll be here in a minute.\"\n\n\nYou stand in silence, the cold wind blowing, the silence only broken by the occasional soft sob by Lucy as she stands over Drake. After about half an hour of waiting, you see the RV pull up along the path. It stops, and four masked men step out.\n\n\n\"Anyone escape?\" one asks.\n\n\n\"No,\" Sheriff Buckly responds. \"Fuck, I didn't even know they were coming out here. You said whatever the fuck you injected the girl with would make her forget everything.\"\n\n\n\"I said it probably would. Her phone's bugged. How didn't you find out?\"\n\n\n\"She didn't make any calls saying she was going to do it!\"\n\n\n\"Well, at least no one escaped,\" the masked man says, pulling off his mask.\n\n\nThe group remove their masks. You vaguely recognize them, one being the mechanic who found you, one being the town doctor, Doctor Kessel, another being a German teacher from school and the final one being the bartender of the local bar.\n\n\n\"What are you going to do with...?\" Becca asks, before Sheriff Buckley lets out a bark.\n\n\n\"Hey! Shut the fuck...\"\n\n\n\"No, Jake, let the girl ask her question,\" Doctor Kessel says. \n\n\n\"What are you going to do with us? Who are you? Why did you send a monster to hunt me?\"\n\n\n\"What are we going to do with you? Nothing, ideally. We only need to borrow you. Who are we? Well, surely you must recognize us. Louis, Sheriff Buckly, Mrs Jordan, Alison and me, Doctor Kessel. \"As for the monster, I assume you're referring to the Black Beast. That's not an issue, I assure you. Although I'm not sure of its origins, if you look at town records, it actually kills most of the bears in the area, which reduces the amount of attacks so much it's saving lives. If I was in your situation, I'd be much more worried about us.\"\n\n\n\"What do you want? Are you going to sacrifice us to Satan?\" Becca asks again.\n\n\nDoctor Kessel lets out a chuckle. \n\n\n\"No, Rebecca, we're not. We're not satanists. Real satanists don't even believe in Satan. We're... researchers. We're humanitarians. We're explorers. When we were little kids, we used to be the best of friends. We played in these very woods. When we were little, we found... a book in one of the caves. We took it and read it, and we found out the most amazing things. Do you know how insignificant not only we are, but this planet, this solar system, this galaxy and this universe is? There are so many amazing things we learned about these beings that we can't even comprehend, but compared to what's out there, we learned so little. So we kept reading. The book included some instructions to summon them, to summon these beings that are stronger than any gods we've ever imagined, more alien that any alien we've created in fiction, more incredible than anything you could experience here. If we create a Key-Bearer, we can create a portal to these beings.\"\n\n\n\"That's insane! How do you know they won't wipe us out, or enslave us all, or worse!\" you cry.\n\n\n\"I don't,\" Doctor Kessel admits.\n\n\n\"It could destroy everything!\"\n\n\n\"You just need to calm down and listen!\" he hisses. \"Imagine you're stuck in a room. There is a small tap for water, a toilet and a small machine that creates a nutritious yet tasteless paste. You have everything you need to survive and continue your blank, boring existence. Now, one day, a door appears in the room. It's unlocked. Do you go through?\"\n\n\n\"What the fuck does...?\"\n\n\n\"We are trying to open that door. Just as the person in the room doesn't know what's on the other side, anything is better than the bland, boring existence of the room. We're trying to open the world up to experiences unknown to man, good or bad, because it has to be better than this meaningless existence.\"\n\n\n\"What are yuo even talking about? What the fuck's a Key-Bearer?\" Mason shouts, as Sheriff Buckly aims his gun at his head once again. \n\n\n\"Shut up,\" Sheriff Buckly grunts.\n\n\n\"Ah yes, the Key-Bearer. That part's the worst for you guys. A Key-Bearer is a creature birthed of the beings' power of a human womb. We've had several attempts at this, but every time we failed. Instead of creating a Key-Bearer, we created half-human, half-monster children who aged rapidly. Finally, we settled the problem. The mother of the Key-Bearer had to be a virgin, post-puberty, below 21 and to have AB Negative Blood. You'd imagine my luck when I found one such target walking around the cave where I was sacrificing some former mothers to keep the beings' interested in our world. I simply pumped out some gas I had on hand to help knock her out, and voila! I got to work.\"\n\n\nYou stare at him in horror, putting a hand on your stomach. There's a series of gasps and shouts from the group, before Sheriff Buckly fires his gun in the air.\n\n\n\"SHUT IT!\" he roars.\n\n\n\"I'm sorry, Hazel. It'll be over in a few hours.\"\n\n\n\"A few hours? It's only been two days, how...?\" you ask in horror.\n\n\n\"The Key-Bearer grows incredibly quickly. It should be able to be birthed within a day at most.\"\n\n\nYou feel something wiggle in your stomach, in your womb, and a pain shoots through you.\n\n\n\"Listen, Hazel, it'll be OK,\" Doctor Kessel says. \"In a few hours, you'll be fine, and we'll be in a whole new world.\"", "action_results": [{"action": "Agree to birth the Key-Bearer", "result": "\"Fine,\" you say. \"I'll do it.\"\n\n\n\"Fantastic!\" Doctor Kessel says eagerly. \"I promise, you're helping save humanity.\"\n\n\nDoctor Kessel takes your hand, and leads you towards the RV, where a second, newer gurney awaits. You climb up in it and are strapped down. Doctor Kessel stabs a needle into your neck, hushing you.\n\n\n\"Don't worry, I'm going to help you sleep for the next few hours. When you wake up, it'll be all over...\"\n\n\nYou begin to feel sleepy, before closing your mouth. Your heavy eyelids close, as the needle presses into your veins, sending you into a deep sleep.", "action_results": [{"action": "Awaken", "result": "Mother of the Apocalypse\n\n\nYou awaken, lying in a small bed. Sheriff Buckly stands above you, looking eerily joy-filled.\n\n\n\"You're awake! Good, we can begin!\" he says.\n\n\nYou stand, looking down. Your legs are covered in dried blood and other liquids, and your body immediately runs out of strength. You're helped along, out of the RV. Your friends are gone, but you only look for a second before you see the preparations for the portal. A large circle of stones lies, each stained with a drop of blood. Standing around the circle are the six cultists; Louis, Doctor Kessel,Mrs Jordan and Alison. Standing around them are a half dozen monster-children that make you want to vomit, the failed attempts at rearing a Key Bearer. They're so deformed, so mutated, they barely qualify as children. One is missing both it's arms, replaced with long, thin, slimy tentacles like pasta. A second is missing most of its face, a gaping hole in its place filled with tiny, wiggling tentacles from the walls, back, roof and floor of the mouth. A third looks like a cute, perfectly normal girl of around four years old, except her mouth hangs open and her eyes are completely black. Another, one of the worst, looks like a cross between a schoolgirl, a fetus and an octopus, and stands wiggling. Still, that's nothing compared to what sits in the middle of the circle. Sitting in the middle, wiggling, is your child. The Key-Bearer is nothing but a seething mass of tentacles that whip around, seemingly drawing lines of purple lightning around itself in the symbol that was carved into you.\n\n\n\"Ah, you're here!\" Doctor Kessel says eagerly.\n\n\n\"Where are my friends?\" you ask.\n\n\n\"It doesn't matter now! Now, we begin! We will witness the glory of Crexiciliatanian's creation!\"\n\n\nThe Key-Bearer speeds up, painting the symbol across the very fabric of reality. The ground begins to crumble away, turning in pure blackness. Suddenly, there's a flash, and the portal opens.\n\n\nThen, it begins.", "action_results": []}]}, {"action": "Get the Key-Bearer out of you", "result": "You desperately search your pockets, finding it after a few seconds, pulling your switchblade out. You pull up our jumper and t-shirt slightly, revealing your stomach. You can see it is slightly extended, and if you take a deep breath and stay still, you can very vaguely feel something moving around in there, which begins to increase as you feel a sharp pain hit.\n\n\n\"Drop the knife. I'll put a bullet between your eyes before you get near any of us,\" Sheriff Buckly says.\n\n\nYou raise the knife, and plunge it into your stomach, towards the center mass of the movement.\n\n\n\"NO! For fuck's sake, stop her!\" Doctor Kessel screams.\n\n\nSheriff Buckly charges towards you, knocking you in the side of the head with his gun. Your head snaps backwards, and you quickly lose consciousness.", "action_results": [{"action": "Awaken", "result": "You awaken strapped to a gurney, covered in blood, wearing a hospital gown. You're in the RV, and the lights are turned off. You can't see anything, but you can here a someone whimpering.\n\n\n\"Hello?\" you ask.\n\n\nThe whimpering stops, and you begin to hear a deep, guttural panting.\n\n\n\"Hello?\" you ask again.\n\n\nAs your eyes begin to adjust to the darkness, you make out two figures in the darkness. One sits in the corner, the other stands above them, rubbing them with a long coil of rope that moves like a snake.\n\n\n\"Mason? Becca? Kyle? Carter?\" you ask, staring towards the figures.\n\n\nThe standing one turns, and you see the sitting one quickly flick on a light switch, brightening the RV. In the light, you notice that the sitting figure is Becca, whose eyes are red with tears and seems terrified. Your eyes scan, and see the second figure, slowly approaching you. The figure is one of the monster-children. It has long brown hair, but her face is nothing but a mucus-encrusted, lipless mouth and two nostrils. It wears a tattered, blood-stained blue dress, with a long, red tentacle coming from it's stomach and wrapping around its body. The tip of the tentacle slowly moves towards you, and you spot a yellow eye poking out from the end of the tentacle slowly edging towards you, staring into your eyes. You scream, and struggle against your bonds, before the tentacles begins to wrap around your leg, leaving a long lane of sticky pus that oozes out of the tentacle. You scream as it continues to edge towards you, heading towards your face. The tentacle snakes up your chest, before intertwining around your neck, before stopping inches from your face.\n\n\n\"Hello...\" the monster-child rasps. \n\n\nYou stare at the eye, seeing a mixture of pain and child-like curiosity in the eyes. Then, you hear a yell. Out of the corner of your eye, you see Becca charge forward with a long, thin knife, stabbing the monster-child through the neck. The creature howls, gargling blood, before Becca draws her knife and begins slashing at it's face and neck, before finally running the knife through it's skull. It collapses, and the tentacle in front of you falls on your face, wiggling like a dying fish. You whimper, and Becca comes over to you and begins cutting you free of both your restraints and the tentacle that intertwines around you. You eagerly get up, pulling the bits of tentacle off you as you struggle not to vomit.\n\n\n\"What happened?\" you ask, shivering.\n\n\nYou feel a dull pain in your stomach, pulling it up slightly slightly to reveal you're thankfully still in your underwear, although you see your stomach is heavily bandaged.\n\n\n\"They cut you open and pulled... something out of you. It was alive, and wiggling, and...\" Becca says, before shivering in terror. \"We need to get our friends and get out of here.\"\n\n\nYou hear a thumping from the bathroom door, and quickly go to listen.\n\n\n\"Hello?\"\n\n\n\"Hazel? Get me out of here!\" Lucy screams from inside.\n\n\nYou unlock the door, finding Lucy.\n\n\n\"Thank God. They locked us in here and put the guys in the cage. We need to get out of here and stop them.\"\n\n\nYou nod, and head to the kitchen, finding a large butcher knife. The door to the RV opens, and Lucy and Becca quickly hide behind the counter with you.\n\n\n\"Iris? Are you finished playing with your new friends? I hope you didn't hurt them. We're going to need them if this newborn isn't the Key-Bearer. I haven't even got to see the k... Iris?\"\n\n\nLouis the Mechanic walks in, looking around.\n\n\n\"Hello?\"\n\n\nHe takes a few steps forward, walking into the kitchen towards you.", "action_results": [{"action": "Attack", "result": "You wait until he's closer, take a deep breath, feel the adrenaline coursing through your veins, and charge. You turn around the counter and in a single bound reach him. His eyes widen in panic before you stab your blade, slicing through skin and flesh, straight through the neck. You pull your blade out and stab again, and again, until his neck is nothing but a hunk of meat that falls to the floor, blood spilling into a puddle on the floor. You stand over him as he dies, watching as the life goes out of his eyes. As a result of an adrenaline rush and primal instincts taking over, you try not to focus on the pathetic, dying man in front of you, and head to the door. You open it to a crack, peering out. Mason, Kyle, Carter and Ant sit in the rusted cage, with Sheriff Buckly watching over them. Mrs Jordan and Alison are placing blood-stained stones in a circle. Doctor Kesel stands with something cradled in his arms, although it's too dark for you to see.", "action_results": [{"action": "Escape to formulate a plan", "result": "You slowly open the door, and begin creeping out of the camp. You slowly tiptoe away, staying low and staying wrapped in the shadows. As you edge away from camp, you freeze as you hear a shout.\n\n\n\"Shit, they're escaping!\" Sheriff Buckly roars.\n\n\nYou break into a sprint, heading away from the camp. You manage to make it to the trees, but you hear gunfire behind you. You turn your head slightly, seeing a spurt off blood go from the back of Lucy's leg as she collapses forward, skidding along the earth to a halt. Becca makes it to the trees next to you and stops.\n\n\n\"Shit, do we go back?\" she asks in a terrified panic.\n\n\nYou look back. In the darkness, you might be able to get to Lucy and help her disappear into the trees. If you both reach the tree line, it'll be almost impossible for Sheriff Buckly to track you.", "action_results": [{"action": "Try rescue her", "result": "\"We have to,\" you say, determined.\n\n\nBecca nods and you turn and burst into a sprint towards Lucy. You see Sheriff Buckly heading towards you, aiming his gun. You grab Lucy, yanking her up.\n\n\n\"Come on!\" you shout.\n\n\nAs you begin to help pull Lucy towards the trees, Sheriff Buckly takes his shoot. You feel a bullet thud through your chest, and you collapse forward. You cough up blood, before closing your eyes for the last time.", "action_results": []}, {"action": "Head off into the trees", "result": "\"We have to go!\" you say, and Becca nods.\n\n\nYou break off into a sprint heading into the shadows and darkness, escaping into the trees. You run for several minutes, before you stop, bending over and panting.\n\n\n\"Jesus, what do we do now?\"", "action_results": [{"action": "Think", "result": "OK, you need to act fast, before the cultists do whatever they're planning.you could call the police. Although Sheriff Buckly is one of the only cops in town, if you called the State Troopers, there's a good chance they'd be able to arrive and clear this place out.\n\n\nYou could also sneak back to the trucks and steal some of the weapons that Drake brought, and force a confrontation and end this.\n\n\nThen again, you know where the location of Drake's keys are for the RV. You know the RV's highly explosive, and with that you could easily disrupt the ritual and do a lot more.\n\n\nThen, there are the more... dangerous solutions. You could use the Dead Man. That terrifying spirit no doubt has some rage toward the town locals such as the cultists. Perhaps he could be bartered with.", "action_results": [{"action": "Call the State Troopers", "result": "\"So what do we do?\" Becca asks.\n\n\n\"Call the State Troopers.\"\n\n\n\"Are you sure that'll work?\"\n\n\n\"I don't know,\" you admit. \"Just... it's worth a try.\"\n\n\nYou ring the number, and immediately get an automated voice in your ear. You wait as they go through the numbers, before you hear a shout.\n\n\n\"HANDS UP!\" a voice screams.\n\n\nYou turn, and see Sheriff Buckly walking out from the trees.\n\n\n\"Jesus fucking Christ, Alison suggested I track your phones, but I told her it'd be insane for you to use it after I told you I had the equipment to track it. Jesus Christ. Come on, girls. I'm taking you back to camp. I'm going to hurt you, hurt you so, so bad for what you did to Louis.\"", "action_results": [{"action": "Attack", "result": "You take a deep breath as adrenaline surges through you, and charge forward with the knife. As soon as you near Sheriff Buckly, he quickly backpedals and aims, before blowing your brains out.", "action_results": []}, {"action": "Surrender", "result": "Apocalypse\n\n\nYou raise your hands and drop your knife. Sheriff Buckly binds your hands with rope and ties a rag around your eyes as a blindfold, before marching you both off back towards camp. You walk for several minutes, before you're dragged within earshot of your friends, who let out disappointed groans and swears at your capture. Then, your blindfold is torn off. A large circle of stones lies, each stained with a drop of blood. Standing around the circle are the five remaining cultists. Standing around them are a half dozen monster-children that make you want to vomit, the failed attempts at rearing a Key Bearer. They're so deformed, so mutated, they barely qualify as children. One is missing both it's arms, replaced with long, thin, slimy tentacles like pasta. A second is missing most of its face, a gaping hole in its place filled with tiny, wiggling tentacles from the walls, back, roof and floor of the mouth. A third looks like a cute, perfectly normal girl of around four years old, except her mouth hangs open and her eyes are completely black. Another, one of the worst, looks like a cross between a schoolgirl, a fetus and an octopus, and stands wiggling. Still, that's nothing compared to what sits in the middle of the circle. Sitting in the middle, wiggling, is your child. The Key-Bearer is the size of a cat, and is nothing but a seething mass of tentacles that whip around, seemingly drawing lines of purple lightning around itself in the symbol that was carved into you.\n\n\n\"Ah, you're here!\" Doctor Kessel says eagerly. \"I wanted you to see this!\"\n\n\n\"You're insane!\"\n\n\n\"I don't care! Now, we begin!\"\n\n\nThe Key-Bearer speeds up, painting the symbol across the very fabric of reality. The ground begins to crumble away, turning in pure blackness. Suddenly, there's a flash, and the portal opens.\n\n\nThen, it begins.", "action_results": []}]}, {"action": "Steal weapons from Drake's truck and confront the cultists", "result": "\"We need to get the weapons in Drake's truck. We get them and use the advantage of surprise to fend off the rest of the group.\"\n\n\nBecca nods with determination, and you swivel around in the darkness, heading back towards the truck. As you head towards the camp, you can hear the sound of Sheriff Buckly berating Lucy.\n\n\n\"You fucking bitch! Louis was a good friend of mine!\"\n\n\nYou sneak forward, staying low and moving as quickly as you can, avoiding stepping on anything that would make noise and disturb the cultists. Eventually, you reach the pick-up truck, Drake''s lifeless body lying alongside it. You lean in through the window, grabbing one of the large revolvers Drake brought. You pull it out, pulling the hammer back and flicking the safety off. Thankfully, many years of FPS games have given you some help in this. You take a deep breath, and stand, aiming your weapon at Sheriff Buckly. He turns, and grins.\n\n\n\"Hiya. Why don't you just drop the weapon, darlin'?\"\n\n\n\"Fuck you.\"\n\n\nYuo fire your revolver, but the hollow click eats into your soul as you realize it's empty. Lucy fires her gun, and realizes it's the same thing.\n\n\n\"Taking the ammo from the guns was one of the first things I did. I'm the only one who gets to have a gun.\"\n\n\nHe grins, raising his gun, and fires, the bullet embedding itself in your skull.", "action_results": []}, {"action": "Steal Drake's RV Meth Lab", "result": "“What are you thinking?”\n\n\n“Drake’s RV.”\n\n\n“What about it?”\n\n\n“We get the keys, and drive it straight into the cultists’s camp and hop out.”\n\n\n“What? Like ram them.”\n\n\n“No, we make it explode. I’m pretty good at Chemistry and I watch a lot of crime shows. I should know what to mix to make it go up in a fireball.”\n\n\nBecca stares at you nervously, before nodding.\n\n\n“Yeah, OK. Let’s do that.”\n\n\n“Do you remember which way the truck is?”\n\n\nBecca nods, and you begin following her through the dead night. The silence is only broken by the trudging of your feet and the occassional hoot from an owl. Eventually, you near the edge of the woods. Sure enough, the massive RV sits by the trees at the edge of the forest.\n\n\n“Do you know how to drive?” you ask.\n\n\n“I guess. I’ve never drove an RV, nad I sure as hell haven’t driven one through the woods, avoiding trees and… whatever.”\n\n\n“You’re going to have to,” you say.\n\n\nBecca retrieves the keys from their hiding spots, and you enter the RV. Becca goes to start it up, while you head to the back and start looking at the various pieces of equipment and chemicals at your disposal. You find a few choice substances from the distilerry Drake had set up, including plenty of flammible alcohol. As you struggle to remember your many science classes, you work with the chemicals for several minutes, before you’ve made the RV into a jury-rigged bomb.\n\n\n“Hey, Hazel, is it ready?”\n\n\n“Yes.”\n\n\n“Should we have waited until we were a little closer and not going through bumpy terrain before we made this into a bomb?”\n\n\nYou shrug, and Becca begins driving. Although she finds it considerably harder to navigate the trees unlike the others who did so with ease, she manages to keep you on track and alive. After a while, you begin to near the camp.\n\n\n“So, what do we do?” Becca asks.\n\n\n“We ram them,” you say. “You get out now. I’ll ram it.”\n\n\n“You don’t know how to drive!”\n\n\n“I have a straight line to the camp. Just press down on the accerator, I suppose. Which one’s the accelrator?”\n\n\nBecca shows you, and you nod.\n\n\n“OK, get out.”\n\n\n“Are you sure?”\n\n\n“Yeah, I’ll just speed it up and dive out. Easy,” you reply.\n\n\nYou take a deep breath, before Becca gets out of the RV. She stands to the side, staring nervously ahead. You take another deep breath, hoping the oxygen will calm you, and hit the accelerator. The vehicle quickly begins to speed up, as the RV bumps you around in your seat. You enter the clearing, and get your site. You see slithering, monsterous and malformed children in the RV as the rest of the cultists lay stones in a massive circle. Doctor Kessel cradles a bundle in his arms, and looks up at you in shock.\n\n\n“What the hell…?”\n\n\n“Stop her!” Alison yells, as Sheriff Buckly fumbles for his gun in a panic.\n\n\nYou point your RV at theirs’, and quickly drop a large piece of equipment on the accelerator. As the wheels begin to spin and start speeding toward RV. You jump out of your seat and rush to the door. You dive out of it, hitting the dirt, as you watch one RV speeding towards the other. Doctor Kessel screams in a panic, and the Meth Lab rams into the RV. They impact with incredible force,  knocking them both onto their sides as they flip through the air. After a few seconds, they slow down, and land in a mangled heap. You hear horrible growls, shrieks and hisses from inside the metal as the seemingly unharmed monsters inside begin to pull themselves out by hands, claws or tentacles. The wreckage begins to leak, a large puddle of alcohol, fuel and various other chemicals forming. Doctor Kessel looks at it and laughs.\n\n\n\"I thought would've exploded...\" Doctor Kessel says.\n\n\nHe begins walking towards you, and you see what he's holding: a wiggling mass of tentacles, flying around the air and stroking his face. The long, thin tentacles, covered with a thin veneer of slime, begin stretching out, stroking your face and you scream.\n\n\n\"Ssssh...\" Doctor Kessel whispers. \"This is your child. Isn't he beautiful?\"\n\n\nYou stare at the center mass of the tentacles, and see a light blue, incredibly human eye in the center. An eye just like yours. You let out a terrified cry, as you hear a shout from Sheriff Buckly.\n\n\n\"STUPID BITCH!\" he screams.\n\n\nYou look up, and see Becca has snuck up and is trying to open the rusted cage. Doctor Kessel looks up, and you have a moment to act.", "action_results": [{"action": "Kill the Key-Bearer with your switchblade", "result": "You grab your switchblade and stab it into the center mass of the Key-Bearer. Doctor Kessel notices and lets out a petrified scream, grabbing at your throat. The Key-Bearer's tentacles intertwine around your hand as a green-yellowish pus comes out and begins sticking to your hand. You feel a sharp prick, and then another, and then another, as bone teeth begin to grow slowly out of the tentacles, digging deeply into you. You scream as a black liquid begins to steep out of the teeth and out of your wound as your veins begin to turn black. You scream as your arm goes number, before the numbness begins to spread throughout your body. You let out a mangled cry before it reaches your chest, and finally the darkness consumes you as it stops your heart.", "action_results": []}, {"action": "Crawl away from them", "result": "You crawl desperately backwards, away from Doctor Kessel. You hands touch the puddle of fuel, and you have an idea. You fumble through your pants, pulling out your lighter. Doctor Kessel charges forward, pressing his foot on your chest with a swift stomp.\n\n\n\"Stop fighting, girl!\" he growls.", "action_results": [{"action": "Light the puddle", "result": "You flick your lighter on, and ignite the puddle. Flames burst out as the liquid sets alight. The flames lap at your side, but Doctor Kessel desperately backs away in a panic, allowing you to roll away from the fire. The flames race along, igniting the puddle, before it reaches the RV. As flames reach the insides where the lab and make-shift explosive are hit. Then, it explodes. A wave of heat and shrapnel tear through the air as a thunderous boom goes off. Your ears ring as a fireball explodes into the night with tremendous force. Chunks of metal go off in all directions, and you collapse on the ground. After a few seconds you manage to look up and survey the carnage. Miraculously, you're safe, and all your friends in the cage as well as Becca and Sheriff Buckly seem mostly unharmed. You can hear the sizzling of the monsters' corpses in the burning skeleton of the two intertwined RVs. Alison and Mrs Jordan were closest to the RV and consumed in the wall of fire and barrage of shrapnel, their burned and torn apart bodies now lying on the earth. Doctor Kessel lies, badly burned with the scorched remains of the Key-Bearer lying on top of him.\n\n\n\"NO! NO!\" Sheriff Buckly screams, staring at the wreckage in abject horror.\n\n\nBecca raises her knife and stabs Sheriff Buckly in the neck with a scream and he yelps in pain. She pulls it out, and Sheriff Buckly collapses to the floor.\n\n\n\"You... you've taken everything... from me,\" Doctor Kessel pants.\n\n\nYou look at him, burns going across his face and across his smoldering chest. The Key-Bearer moves slightly, but you quickly finish it off with a few stomps, wincing at every squelch.\n\n\n\"No...!\" Doctor Kessel pants. \"You've... doomed man... to nothingness.\"\n\n\nYou stare down at him as his breathing slows, before the rise and fall of his chest ceases. You walk over to Becca, who's pulling a pair of keys out of Sheriff Buckly's pocket. She unlocks the rusted cage, and your friends spill out. Carter and Mason help Lucy hobble out, followed by Kyle who eagerly hugs Becca, and finally Ant.\n\n\n\"Holy shit. You just blew up an evil cult. I'm impressed,\" Ant says.\n\n\n\"Holy shit, I don't... what the fuck just happened?\" Kyle asks.\n\n\n\"I don't know. We should probably leave,\" Mason says. \"Thanks, Hazel, thanks, Becca, you saved our asses here.\n\n\n\"We n-need t-to get out of here and g-g-get Lucy help f-for her le-leg,\" Carter says.\n\n\nYou nod, and begin to walk away from the burnt out ashes of the camp, just as the sky begins to rise.", "action_results": [{"action": "One Year Later...", "result": "After the Bang\n\n\nYou're surprised how quickly and eagerly the media pick up on this. A tale of a bunch of kids discovering what a cult and driving a meth lab into it and blowing it up entirely. Of course, the story gets botched considerably. The cult is said to be Satanist, the monster-children are claimed to be simply malformed or mutilated, and any and all super-natural presence is rationalized. Still, it does turn Dawnwood into a media hotspot for some time and turns you into somewhat of a celebrity some time. Still, it doesn't take long for the media to move on. With celebrity pregnancies, terrorist attacks in the Middle East and an endless amount of mass shootings, things move on. You continue living in Dawnwood, staying with your friends. There's a special type of unbreakable bound that arises when a group of people face death together, and because of that you stay as a tight-knit group of friends. Time passes, you settle down in the town and for the first time you're glad you moved to the town. Sure, you still have many unanswered questions about what happened and still wake up with phantom pains in your stomach and nightmares of that night, but for the most part you're able to move past it. You're looking forward to your future in Dawnwood.", "action_results": []}]}]}]}, {"action": "Attempt to barter with the Dead Man", "result": "\"So what's our plan?\"\n\n\n\"The Dead Man.\"\n\n\n\"What? The ghost?\"\n\n\n\"Yeah. We could use him.\"\n\n\n\"Ghosts aren't real, Hazel. Maybe you should sit down.\"\n\n\n\"I saw him.\"\n\n\n\"Ghosts aren't...\"\n\n\n\"Becca, our friends have been kidnapped by demon-summoning cultists, and you don't belief in ghosts at the moment?\"\n\n\n\"I... I guess.\"\n\n\n\"Yeah. Let's go pay him a visit.\"\n\n\nYou turn and lead Becca off towards the Dead Man's Barn. After about five minutes of jogging, you reach the empty field that's brightened in the moonlight, with the large, old abandoned barn standing there.\n\n\n\"Come on!\" you say.\n\n\nYou reach the barn, and begin prying plywood out of the way. You pause, remembering the Dead Man's hatred of Becca, pause.\n\n\n\"I'll go inside alone,\" you say.\n\n\n\"Are you sure?\"\n\n\n\"Yeah,\" you say.\n\n\nBecca shrugs, pulling the plywood out of the way and clambering inside. You are immediately engulfed in darkness. The soft rustle of the grass ceases as the entire barn is filled with a silence. Then, a whistle breaks out. The Dead Man begins whistling a slow, soft tune, the only thing that breaks the silence. Each note is mixed with the wet squelching you heard the last time. You see him leaning on a large wooden beam, his long, cut open grin staring back at you. The whistling stops as shadows seem to enrapture him. He disappears from his position leaning on the beam, and you feel hot breath on the back of your neck.\n\n\n\"I didn't think you'd come around here, darlin'. I was certain you'd be smarter,\" you hear him whisper from directly behind you.\n\n\nA gloved hand begins to stroke your hair as you feel a metal blade press against your throat.\n\n\n\"No bother. I won't mind cutting you up a little.\"\n\n\n\"Wait! I want to make a deal with you!\"\n\n\nThe blade stops and twists so that the flat of the blade is rubbing your neck.\n\n\n\"Alright... you bought yourself a minute. Explain.\"\n\n\n\"I want to help you get revenge.\"\n\n\n\"No you don't.You want something that coincides with me getting my revenge. What?\"\n\n\n\"I need Mrs Jordan, Alison, Sheriff Buckly and Doctor Kessel.\"\n\n\n\"Alison. What's her last name.\"\n\n\n\"Parker.\"\n\n\n\"Oh yeah, Parker... Damn right I want my revenge. But it seems you're far more desperate than I am.\"\n\n\n\"I...\"\n\n\n\"I want something. The Montgomery girl.\"\n\n\n\"What?\"\n\n\n\"I want you to bring me her.\"\n\n\n\"I don't have her. She left...\"\n\n\nThe Dead Man smiles as his grin is elongated once again because of the cuts as a wave of blood spills down his cheeks. He leans forward, running a hand against your cheek and down your neck.\n\n\n\"Bring me the girl... and I will help you kill every last person you want dead.\"", "action_results": [{"action": "Agree", "result": "You take a deep breath, and nod.\n\n\n“OK. Fine,” you say.\n\n\nIt’s for the best. It’s the only way to safe your friends. If you don’t sacrifice one, you all die.\n\n\n\"Call her, then.\"\n\n\n\"Becca!\" you shout.\n\n\n\"Yes?\"\n\n\n\"Come in here!\"\n\n\n\"I though you said...\"\n\n\n\"Just do it!\"\n\n\nYou see the Dead Man disappear, and seconds later, Becca climbs through the hole in the wall. \n\n\n\"What do you need?\"\n\n\n\"I'm so, so sorry,\" you whimper.\n\n\n\"What...?\"\n\n\nThe Dead Man is formed from the shadows directly behind Becca, leaning against the wall. He raises an old-fashioned revolver, and points it at the back of her head.\n\n\n\"Tell your ancestors I sent you,\" he says.\n\n\nThe Dead Man fires his gun and the revolver explodes with a thunderous roar, as does Becca's face. The front of her face explodes, sending blood, bits of flesh and grey matter onto the floor. You scream in horror as your friend collapses on the floor as all the life flows from her eyes and her face takes a dull expression.\n\n\n\"Ah... you can't imagine how good that felt.\"\n\n\nYou choke back a cry, as tears stream down your face.\n\n\n\"You have to kill everyone I mentioned.\"\n\n\n\"How the fuck am I supposed to do that?\"\n\n\n\"What? You said you could! You promised.\"\n\n\n\"I promised I would try. You bring those people into this barn, I'll kill 'em all and leave you alive.\"\n\n\n\"How the fuck am I supposed to do that?\" you shout, echoing the Dead Man's complaint.\n\n\nThe Dead Man grins, and fades into the background and is absorbed by shadows once again. You sigh, and walk out. You climb out of the barn, your mind racing. Then, you have an idea. The one thing any of them care about is the Key-Bearer. If you can get that,or it, or whatever the fuck the creature is, you can lure them into the barn. You begin walking back towards the camp.", "action_results": [{"action": "Five Minutes Later...", "result": "You stare at the camp, watching the cultists work.They all pile stones in a large circle. You hear horrified moans from inside the RV, and you can vaguely see the horrified shapes of the failed attempts to birth a Key-Bearer inside the RV, the monstrous, contorting shapes howling desperately. Still, you see what you're looking for. Doctor Kessel holds a large bundle of contorting tentacles You look around the earthen floor of the woods, finding a large tree branch with suitable weight and length. You pick it up, and begin creeping towards Doctor Kessel. You silently creep forward, aas he watches the circle being formed, oblivious to anything else. You take a deep breath, and raise the tree branch. You swing it with as much strength as you can muster, and it smacks into the back of his head. It slams into his head and he collapses forward, the Key-Bearer flying onto the floor. You spot your friends in the cage, Sheriff Buckly watching over you, but know you don't have time to rescue them. You grab the Key-Bearer and get your first real look at it. A seething mass of tentacles, with at the base a small, spherical body. You shiver in terror as you notice the creature has a single, bright blue eye, the same color as yours. You grab it, wrapping in the blanket Doctor Kessel has been coddling it, and turn.\n\n\n\"Fuck! Get her!\" Doctor Kessel screams.\n\n\nSheriff Buckly turns and raises his gun, but Doctor Kessel screams at him to stop.\n\n\n\"No, no! For god's sake, don't fire! You could hit the key-bearer and ruin everything!\" Doctor Kessel screams later.\n\n\nYou break into a run, as you see Alison open the RV.\n\n\n\"Children! Go, go track down your brother and the girl!\"\n\n\nYou see demented figures emerge from the RV. There's a pair of small legs that waddle forward, although everything above the waist is a seething mass of tentacles. There's an armless child who's eyes are just two empty caverns that are blacker the pure darkness. There's a small girl, each limb replaced with a long coil of muscles that it uses to crawl along the ground. They all see you, eyes filled with pain and angst, and begin to follow you. You turn and begin running as fast as you can towards the Dead Man's barn. You run as fast as your feet will carry you for several minutes, hearing the howls of the monsters behind you grow louder as the cultists follow just behind you.\n\n\n\"Stop running! We won't hurt you!\" Doctor Kessel screams.\n\n\nYou feel the Key-Bearer writhe under the blanket in your arms and you wince, but don't dare stop runnign. Eventually, you break free from the trees, into the field under the moonlight. You spot the hole in the boarded up barn, and begin desperately running towards it. After a minute of running as fast as you can, you dive through it, into the darkness of the barn. Seconds later, you hear a slithering, shivering sound as those monsters enter. You stay perfectly quiet, and begin crawling under a small gap in the fence, into a horse stall.\n\n\n\"Hazel... you better come out now...\" Sheriff Buckly whispers. \"It's better we find you then one of the kids...\"\n\n\nYou try not to breath and stay perfectly silent as you hear figures wandering around the room.\n\n\n\"Oh, there you ar... what's this?\"\n\n\n\"Ah, look who it is. A Buckly... I always did know your family was a generation of snakes and government cocksuckers...\"\n\n\n\"How... what the fuck are yo...?\"\n\n\n\"I'm the Grim fuckin' Reaper.\"\n\n\n\"No! Wait! Please, don't!\"\n\n\n\"Tell ol' grandaddy Buckly you died beggin' me!\"\n\n\nThere's a gunshot, and Sheriff Buckly falls silent.\n\n\n\"Well, look at this... the Kessel family's newest generation are all pig-fuck ugly monsters. See ya, kids.\"\n\n\nThere's a series of gun shots as you hear the knife whistle through the air.\n\n\n\"Jesus fuck! What's...?\"\n\n\n\"A Parker. Your gran' daddy had the dumbest horse grin I'd ever seen.\"\n\n\nThere's the noise of a knife, slicing through the air and the squelching sound of blood.\n\n\n\"Oops, there goes a Jordan and a O'Riley. Huh, your grand daddies on your mom and dad's sides were fiddling, only makes sense their kids would have kids.\"\n\n\nThere's a series of gunshots and squelches from knife stabs, before you hear a single, solitary voice.\n\n\n\"Hazel? Whatever you've done, stop this... please...\" Doctor Kessel whimpers.\n\n\nYou hear a gunshot, and the thud of a body hitting the floor. Then, silence. Suddenly, the Dead Man stands, staring at you.\n\n\n\"Alright, darling. You never said there'd be a dozen monsters in tow.\"\n\n\n\"I didn't think they'd release them.\"\n\n\n\"Alright. Well, I reckon we're about even.\" \n\n\nYou nod, before the bundle wiggles in your arms again. The Dead Man raises his gun and shoots the wiggling bundle twice. You scream as blood flies up, before throwing the dying monster off you.\n\n\n\"There. Now we're sure as fuck even.\"\n\n\nThe Dead Man is absorbed by the darkness once more, and you're left alone in the darkness. You stand, walking out into the carnage. Corpses lie everywhere, shriveled tentacles and bleeding bodies around the room. You find Sheriff Buckly, lying on the floor in a growing puddle of blood. You search his pockets, pulling out the keys to the rusted cage. You leave the barn, and begin walking off to rescue your friends,  just as the sky begins to rise.", "action_results": [{"action": "One Year Later...", "result": "Death and Vengeance\n\n\nYou're surprised how quickly and eagerly the media pick up on this. A tale of a bunch of kids discovering what a cult. Of course, the story gets botched considerably. The cult is said to be Satanist, the monster-children are claimed to be simply malformed or mutilated, any and all super-natural presence is rationalized, and its claimed that you and Becca made a stand against the cultists, leading to Becca's death in the fire fight. You don't disagree with them, because you know you'd come off as crazy. The Dead Man is happy to stay hidden every time they investigate the barn, knowing the difference between picking off a few trespassers and ambushing a police investigation, and not wanting his barn covered in police tape for any longer than needs be. Still, it does turn Dawnwood into a media hotspot for some time and turns you into somewhat of a celebrity some time. Still, it doesn't take long for the media to move on. With celebrity pregnancies, terrorist attacks in the Middle East and an endless amount of mass shootings, things move on. You continue living in Dawnwood, staying with your friends. You still have serious guilt over what happened to Becca, and any and all attempts to rationalize it lead to you just wallowing in self-depreciation and depression. Time passes, you settle down in the town and for the first time you're glad you moved to the town. Sure, you still have many unanswered questions about what happened and still wake up with phantom pains in your stomach and nightmares of that night, and nightmares of Becca's corpse slumped over in front of you, but you're able to move past it somewhat. You're looking forward to your future in Dawnwood.", "action_results": []}]}]}, null, {"action": "Lie and escape while claiming to be luring Becca in", "result": "\"OK. I'll go get her.\"\n\n\n\"Oh, I can't let you leave until you Becca's here.\"\n\n\n\"She's not going to come wander into the darkness just because I'm calling. I need to go out there personally.\"\n\n\n\"...Hmm... Alright. Go get her.\"\n\n\nYou nod, and head out of the barn slowly. Each step you expect to feel the steel blade slicing through you, but you keep walking, trying to appear calm and collected. You reach the ray of moonlight, and climb out of the barn, finding Becca.\n\n\n\"What happened?\"\n\n\n\"We... we need to go. Come on.\"\n\n\nYou grab Becca's arm and quickly pull her quickly away from barn, heading back into the field.\n\n\n\"What happened there?\"\n\n\n\"It doesn't matter. Just make sure to never go inside that barn.\"\n\n\n\"What do we do now? How will we rescue our friends?\"\n\n\n\"I had a few more ideas.\"", "action_results": [null, null, null]}]}]}]}]}, {"action": "Pick them off one by one", "result": "\"We need to attack,\" you whisper.  \"What?\" Lucy asks in surprise. \"They have a gun!\"  \"It's dark, we can sneak up on the sheriff and take him out with our knives, and get the gun. Then, we stop this and free our friends.\"   Lucy nods, and you edge out of the door, heading towards Sheriff Buckly. You stay low, immersed in the darkness. You slowly edge forward, before you're less than a dozen feet away from him. Then, Sheriff Buckly turns, noticing you.  \"Ah, shit...\" he sighs, raising his gun.", "action_results": [{"action": "Charge him", "result": "You charge forward, slashing your knife. Sheriff Buckly backs up with a yelp, firing randomly. Although he's firing without thinking or aiming, the amount of lead he puts in the air makes it sure that one finds it's way through your skull, killing you instantly.", "action_results": []}, {"action": "Run", "result": "\"They're escaping!\" Sheriff Buckly roars at his allies.\n\n\nYou break into a sprint, heading away from the camp. You manage to make it to the trees, but you hear gunfire behind you. You turn your head slightly, seeing a spurt off blood go from the back of Lucy's leg as she collapses forward, skidding along the earth to a halt. Becca makes it to the trees next to you and stops.\n\n\n\"Shit, do we go back?\" she asks in a terrified panic.\n\n\nYou look back. In the darkness, you might be able to get to Lucy and help her disappear into the trees. If you both reach the tree line, it'll be almost impossible for Sheriff Buckly to track you.", "action_results": [null, null]}]}]}, {"action": "Stay hidden", "result": "You stay hidden, and Louis walks over. He leans over the counter, his head just over you. Then, he spots the edge of Lucy's foot.\n\n\n\"Shit!\" he shouts, turning and running out of the RV.\n\n\n\"Hey! The girls got loose! Where's the gun?\"\n\n\nWithin seconds, Sheriff Buckly is standing by the doorway, aiming his gun.\n\n\n\"Come out or I'll blow your brains out!\" he roars.", "action_results": [{"action": "Surrender", "result": "You raise your hands in surrender, and step forward. Sheriff Buckly grins.\n\n\n\"Come on, there you go, drop the knife.\"\n\n\nYou drop the knife, and step forward. He swings his gun, smacking into the side of your head and sending you spiraling into unconsciousness.", "action_results": [{"action": "Awaken", "result": "Apocalypse\n\n\nYou lie in the rusted gurney, at the edge of a large circle. Your friends are gone, but you only look for a second before you see the preparations for the portal. A large circle of stones lies, each stained with a drop of blood. Standing around the circle are the cultists. Standing around them are a half dozen monster-children that make you want to vomit, the failed attempts at rearing a Key Bearer. They're so deformed, so mutated, they barely qualify as children. One is missing both it's arms, replaced with long, thin, slimy tentacles like pasta. A second is missing most of its face, a gaping hole in its place filled with tiny, wiggling tentacles from the walls, back, roof and floor of the mouth. A third looks like a cute, perfectly normal girl of around four years old, except her mouth hangs open and her eyes are completely black. Another, one of the worst, looks like a cross between a schoolgirl, a fetus and an octopus, and stands wiggling. Still, that's nothing compared to what sits in the middle of the circle. Sitting in the middle, wiggling, is your child. The Key-Bearer is the size of a cat, and is nothing but a seething mass of tentacles that whip around, seemingly drawing lines of purple lightning around itself in the symbol that was carved into you.\n\n\n\"Ah, you're here!\" Doctor Kessel says eagerly.\n\n\n\"Where are my friends?\" you scream, terrified of the creatures that surround you.\n\n\n\"It doesn't matter now! Now, we begin! We will witness the glories of Crexiciliatanian's creation!\"\n\n\nThe Key-Bearer speeds up, painting the symbol across the very fabric of reality. The ground begins to crumble away, turning in pure blackness. Suddenly, there's a flash, and the portal opens.\n\n\nThen, it begins.", "action_results": []}]}, null]}]}]}, {"action": "Run", "result": "You try to run, but Doctor Kessel is faster, sprinting forward and grabbing you. You scream, as a needle enters your neck.\n\n\n\"Don't worry, I'm going to help you sleep for the next few hours. When you wake up, it'll be all over...\"\n\n\nYou scream as you begin to feel sleepy, before closing your mouth. Your heavy eyelids close, as the needle presses into your veins, sending you into a deep sleep. Knowing what they're planning to do, you hope you overdose on this rather than waking up...", "action_results": [null]}, {"action": "Break down", "result": "You drop to your knees and begin sobbing, as Doctor Kessel walks over, grabbing you. You scream, as a needle enters your neck.\n\n\n\"Don't worry, I'm going to help you sleep for the next few hours. When you wake up, it'll be all over...\"\n\n\nYou scream as you begin to feel sleepy, before closing your mouth. Your heavy eyelids close, as the needle presses into your veins, sending you into a deep  sleep. Knowing what they're planning to do, you hope you overdose on this rather than waking up...", "action_results": [null]}]}]}, {"action": "Go through legal means", "result": "You take out your phone and make a call to the police department. You immediately reach the Sheriff, who answers. You quickly explain your situation, only to have him chide you.\n\n\n\"Now, Hazel, I get you're still scared after the last night, but you can't be calling the sheriff's office over a little nightmare!\"\n\n\nWith that, he hangs up. What a cunt.", "action_results": [{"action": "Try again", "result": "You make another call, and get the police voicemail. You go through the normal bullshit, asking you what you want to report, and you notice there's not exactly a number to press for your complaint, and the \"Other\" button will lead you back to the Sheriff. The automated voice does tell you there's a police website where you can make an official report.", "action_results": [null, {"action": "Go to the website and file an official request", "result": "You open your laptop and get onto the police website, making a long and detailed request about what happened to you. After a few minutes of typing, you send it. You let out a sigh and hope it's taken seriously. You refresh the page and notice a new number, underneath the Police Department's, Hospitals's and Fire Department, at the bottom of the page. This one is listed simply as \"SPECIAL\".", "action_results": [null, {"action": "Call the number", "result": "You shrug, and call the number. Almost immediately, the voice of a woman picks up.\n\n\n\"Hello. How may I help you?\"\n\n\n\"I'd like to report an incident in the...\"\n\n\n\"Is this a Ms Hazel August?\"\n\n\n\"What? How did you...?\"\n\n\n\"It doesn't matter, Miss. I need to ask something from you.\"\n\n\n\"What?\"\n\n\n\"I need you to say, as clearly as you can into the phone, that everything you said in the report you just made is true.\"\n\n\nYou raise and eyebrow, before shrugging.\n\n\n\"Everything I said in the report I just made it true.\"\n\n\nThere's a beep in the background.\n\n\n\"Thank you, Miss. Please take the time to memorize our number. Thank you for calling. Have a good day.\"\n\n\nThe woman hangs up, leaving you in silence. Huh. While you wonder what that was, it was probably some police department who don't believe a word of what you just said. Still, you memorize the number, even though it doesn't matter. They definitely won't do anything about it. You should probably go out to meet your friends.", "action_results": [null]}]}]}, null]}]}]}, {"action": "Stay still", "result": "You stay still, as one of them takes out a large rag and a glass bottle. He soaks the rag, before holding it to your mouth. You try not to breath, but after about a minute you take a gasp for breath, inhaling the fumes.", "action_results": [null]}]}, {"action": "Make a run for the door", "result": "You run towards the gate, but the men are faster and bigger then you. The men grab you, and force you into the gurney. They strap your hands up my your head and your feet together, leaving you stretched out on the gurney. A ball gag is stuffed in your mouth and strapped tightly. You wince one off them puts surgical gloves on, before drawing a thermometer that's pushed into your ear. He checks it, before placing a cold hand on your stomach. He pushes gently, before squeezing.\n\n\n\"I'm right. Get the injections ready.\"\n\n\nYou shake and try to scream as one of the men takes out a needle that's almost comically large and sharp. He jabs it into your stomach and you scream into your gag and presses down, releasing the liquid into your stomach. You begin to tear up as he repeats the process with several more needles, and by the end your eyes are obscured with tears. He smiles at you through the ski mask, before another man arrives with a large burlap sack. He opens it, pulling out a small mammal like a rat or a ferret, and a large knife. You watch in horror as he slices the mammal's throat open, letting blood flow out onto your stomach. He tosses the carcass aside, and begins to use his fingers to draw various patterns along your belly as you wince and shake. He sighs, and slaps you hard across the face.\n\n\n\"Stop shaking,\" he says, before turning to one of the other men. \"Tomorrow night.\"\n\n\nHe finishes drawing his patterns, before taking out a small black notebook. He begins to read from it in an insane language you don't understand, like the spluttering of a madman. The pain in your stomach intensifies greatly as you let out a petrified scream as you feel yourself being torn apart. Finally, he stops, as does the pain.\n\n\n\"Ah, good. Get the chloroform and untie her. Then, bring the kids back from their walk.\"\n\n\nThey free you from your straps, and you notice the door's still open.", "action_results": [null, null]}, {"action": "Comply", "result": "You put your hands behind your head. The men grab you, and force you into the gurney. They strap your hands up my your head and your feet together, leaving you stretched out on the gurney.\n\n\n\"Good girl,\" one of them says, before placing a ball gag in your mouth and strapping it around your head.\n\n\nYou wince one off them puts surgical gloves on, before drawing a thermometer that's pushed into your ear. He checks it, before placing a cold hand on your stomach. He pushes gently, before squeezing.\n\n\n\"I'm right. Get the injections ready.\"\n\n\nYou shake and try to scream as one of the men takes out a needle that's almost comically large and sharp. He jabs it into your stomach and you scream into your gag and presses down, releasing the liquid into your stomach. You begin to tear up as he repeats the process with several more needles, and by the end your eyes are obscured with tears. He smiles at you through the ski mask, before another man arrives with a large burlap sack. He opens it, pulling out a small mammal like a rat or a ferret, and a large knife. You watch in horror as he slices the mammal's throat open, letting blood flow out onto your stomach. He tosses the carcass aside, and begins to use his fingers to draw various patterns along your belly as you wince and shake. He sighs, and slaps you hard across the face.\n\n\n\"Stop shaking,\" he says, before turning to one of the other men. \"Tomorrow night.\"\n\n\nHe finishes drawing his patterns, before taking out a small black notebook. He begins to read from it in an insane language you don't understand, like the spluttering of a madman. The pain in your stomach intensifies greatly as you let out a petrified scream as you feel yourself being torn apart. Finally, he stops, as does the pain.\n\n\n\"Ah, good. Get the chloroform and untie her. Then, bring the kids back from their walk.\"\n\n\nThey free you from your straps, and you notice the door's still open.", "action_results": [null, null]}]}]}]}]}]}, {"action": "\"There's... something carved into me!\"", "result": "\"What?\"\n\n\n\"There's... just come here!\"\n\n\nDad quickly comes up as you grab a pair of towels to cover yourself. Dad knocks on the door.\n\n\n\"Can I come in?\"\n\n\n\"Yeah,\" you reply.\n\n\nDad enters, and winces as he sees your wound.\n\n\n\"God... what happened?\"\n\n\n\"I think someone carved it into me while I was sleeping,\" you say. \n\n\n\"Don't be ridiculous!\" he says. \"You must've fell and cut yourself last night.\"\n\n\nOver the next few minutes, Dad bandages up your wound.\n\n\n\"Good. It's a very shallow wound, you'll be fine. Now, go shower.\"\n\n\nYou nod, and walk off to the shower, frustrated at Dad's naivety.", "action_results": [null]}]}]}]}, {"action": "Go through the opening to the cavern", "result": "You sprint as fast as you can, the rush of adrenaline overtaking you as you mind fixes on its one and only purpose: SURVIVE! With several bounds you manage to make it to the cavern, barreling down the cave. The beast stops just before it would've gotten itself stuck in the opening, and stares at you. There's no emotion behind the crimson pools that stare at you like giant rubies without their sparkle, only pure, animalistic hunger. You turn, and begin heading further into the cave. You walk down into the larger cavern. You pull out your phone and turn on the flashlight and only now learn its purpose. The entire cavern seems to have turned into what is a massive animal den. The tattered furs and skins of creatures ranging from rabbits to deer to even bears lie around, with an endless number of deep red stains and piles of crushed and shattered animal bones. You whimper at the sight of this, before noticing what looks like man-made creations. Wooden idols and necklaces lie, spread around the cavern, while under the bloodstains that cover the walls you notice images, with a large oak staff lying among them. You lean in to get a better look, noticing pictures of stickmen surrounding what appears to be a badly painted picture of the beast that chased you. The pictures continue, beginning to tell a story. There's images of the beast massacring stickmen, before you see a picture a tall stickmen wearing several necklaces like the ones scattered around the floor holding a large staff standing in front of the beast. The next picture shows the beast retreating. You stare in confusion, trying to make out what the other images obscured by blood show. You give up, looking around again. Then you see it. At the other end of the cavern stands the beast. You only notice now that the cavern's ceiling is partially caved away, revealing a path for the beast to enter. It's slowly approaching, although now that you've been noticed it's sure to speed up.", "action_results": [{"action": "Charge the beast in an attempt to slip past", "result": "You charge towards the beast, and it bats its paw. The paw slams into you, sending you headfirst into the stone wall. Thankfully, your skull breaks open and shatters, saving you from the painful death of being torn apart and devoured.", "action_results": []}, {"action": "Run back the way you came", "result": "You turn, and sprint back towards the opening. You dart through it, although you know the beast has your scent. With your head start, you might make it back to town, although you could head down the smaller tunnel to escape the beast.", "action_results": [null, null]}]}]}]}, {"action": "Stay perfectly still", "result": "You stand perfectly still, hoping its vision is based on movement. It lets out a rumbling growl that shakes you to your core. As you wince in terror, it charges. It sprints towards you faster than a truck, and barrels into you. Your bones break and crack as you're sent spiraling through the air. You land in a heap by the soft mud by the stream and let out a shriek as your limbs twist at incredible angles that they're definitely not meant to go. The creature walks slowly towards you, and you try to crawl away but find yourself unable to move. You see the flash of the beast's teeth and a spurt of crimson before it finishes off its prey.", "action_results": []}, {"action": "Approach the beast", "result": "For some reason, perhaps entranced by the creatures eyes, you take a step forward towards it. It stands still, perhaps confused, as you take another step. It lets out a rumbling growl that shakes you to your core. As you take your third step, it charges. It sprints towards you faster than a truck, and barrels into you. Your bones break and crack as you're sent spiraling through the air. You land in a heap by the soft mud by the stream and let out a shriek as your limbs twist at incredible angles that they're definitely not meant to go. The creature walks slowly towards you, and you try to crawl away but find yourself unable to move. You see the flash of the beast's teeth and a spurt of crimson before it finishes off its prey.", "action_results": []}]}]}]}, {"action": "Ask Mason for help", "result": "\"Mason! I...!\"\n\n\nThe cold metal of a blade slices open your throat as before you can get out another word as cold steel mingles with hot blood.\n\n\n\"Dumb bitch.\"", "action_results": []}]}]}, {"action": "Go with Ant to Herr Eichel's Basement", "result": "\"Fine, we'll go to the Nazis.\"\n\n\nAnt nods nervously as Mason winces.\n\n\n\"If... if you think so,\" Mason says.\n\n\nYou nod. The group begins to stand, and starts walking towards Herr Eichel's house.\n\n\n\"I'll... I'll stay here!\" Kyle slurs, collapsing into the back of the pick-up truck.\n\n\nLucy shrugs, and continues leading the group out of the forest. The group drops the various empty cans among the shrubs as you emerge in yet another one of the bland, boring suburbs that make up Dawnwood. The sun's fallen, so Lucy brings out her phone and turns on the flashlight. She leads you to a house that looks identical to every single house on the street.\n\n\n“Is this it?” you ask.\n\n\n“Yeah,” Lucy says.\n\n\n“Well. I expected swastika banners hanging from the roof or something.”\n\n\n“The closest thing to a swastika here is the one on Carter’s dad’s arm.”\n\n\n“Fuck you!” Carter says, “H-he’s not a naz-naz-nazi!”\n\n\n“Yes he is, Carter.”\n\n\n“We’re not arguing now. Quiet down, we don’t want to wake Herr Eichel. Ant, take Hazel ‘round back, there’s always an open window to the basement. We'll stay here. The ruckus of half a dozen kids 'round back would wake the Nazi,\" Mason says.\n\n\n“Probably to air out the smell,” Becca says. “You know, of his victims.”\n\n\nYou begin to sweat nervously, and you follow Ant around the back. Like Mason said, the basement window is wide open. Ant looks at you, nodding.\n\n\n\"Uh... ladies first,\" he says nervously.\n\n\n\"Coward,\" you spit, before dropping to your knees.\n\n\nYou crawl forward on your hands and knees, turning around and sliding through the window. You wiggle, taking a good minute to squeeze through, before dropping into the darkness of the basement. You lose sight of everything, and are left in complete and utter darkness that even the light of the moon can not penetrate. You listen, and the silence is broken by the quiet yelp and thud of Ant falling through the window.\n\n\n\"Ssssh!\" you hiss.\n\n\n\"Fine,\" Ant says.\n\n\nYou hear him fumble around in the darkness, before silence resumes. A tiny light flickers as Ant lights his cigarette lighter, his face being the only thing illuminated in the darkness. You draw your phone, turning on the flashlight, a more modern solution to the darkness. A workshop table is illuminated, with several... pieces of bone and flesh covering the tables.\n\n\n\"What the fuck...?\" Ant says, stepping back. \"It was only supposed to be a rumor. I was nervous, but I didn't actually... I...\"\n\n\n\"What the hell is this place?\"\n\n\n\"We need to get out of here,\" Ant hisses.\n\n\nYou stare at the table in pure horror. You turn your phone over, making out several more of these workshop tables covered in gristle and pieces of former victims. A large tool rack covered in blood stained knives, some deadly sharp, some serrated, some large enough to easily carve through bone as if through butter.\n\n\n\"Hazel, snap out of it!\"\n\n\n\"OK, OK,\" you say, shaking your head. \"I'll boost you out the window, you pull me up afterwards, got it?\" you say.\n\n\nAnt nods, and you hurry to the basement window. He puts his foot in your cupped hands and you give him a boost. He grabs the window frame, and begins to pull himself through the door. You push him as he wiggles through the door. It takes a good two minutes for him to squeeze back through, before turning to grab your hand.\n\n\n\"Come on, let's go!\" you say.\n\n\nYou hear a creaking. You turn off your phone as a beam of light from an opening door bursts in.\n\n\n\"Hide!\" Ant whisper loudly. \"He's coming!\"\n\n\nYou look around. In the darkness, you see only two eligible options for hiding place: Under the workshop table or behind the \"tool\" rack. Then again, you could always try to squeeze through the window, although even with Ant's help, Herr Eichel might get you first.", "action_results": [{"action": "Hide behind the tool rack", "result": "You drop to your knees and quickly crawl behind the tool rack, curling up as you wrap your arms around your knees and curl up in a ball, trying not to move or make a noise. You hear an old voice begin to hum as the stairs begin to creak.\n\n\n\"Muss i denn, Muss i denn, zum stadtele hinaus...\" the old man sings. \"...stadtele hinaus...\"\n\n\nYou wince as you hear him draw near.\n\n\n\"Und du, mein schatz, bleibst hier?\" he sings, as you hear the clank of metal as he grabs a blade from the tool rack, right in front of you. \"Wenn i komm', wenn i komm', wenn i wiedrum komm'...\"\n\n\nYou let out a sigh of relief as he walks away, heading to the workshop. You hear the squelch as blades slicken as they slice through flesh. There's a thud and you gasp, before another thud, before a thud and a crack as Herr Eichel breaks open a bone with a hammer. Herr Eichel stops, pausing for a second.\n\n\n\"Is there someone there?\" he asks, his eery sing-song voice giving way to an elderly' grandfather's with a thick German accent. \"I promise, if you come out now, there... won't be a problem.\"", "action_results": [{"action": "Continue hiding", "result": "You stay hidden, trying not to breath as Herr Eichel begins moving around the room, singing all the while.\n\n\n\"Kehr' i ein, mein Schatz, bei dir. Kann i glei net allweil bei dir sein...\" he sings.\n\n\nYou hear a chime as the doorbell rings, and the room falls silent as Herr Eichel stops singing.\n\n\n\"Ah. Guests,\" he says.\n\n\nYou hear his boots thud away as the stairs begin to creak as he climbs them. You hear the door shut, and immediately get out of your hiding place. You head to the window, and leap up through it. You grab the window pane and begin to pull yourself through, wiggling to help you move on through. You pull yourself through and collapse onto the grass, and begin running around to the front. You freeze as you notice Herr Eichel standing directly in front of you.\n\n\n\"Hello,\" he says in a thick German accent. \"I am Mr Eichel.\"\n\n\n\"I know.\"\n\n\n\"Ah, so you've heard of me. Tell me, what are the current rumors. Am I said to be the assistant to Josef Mengele? The personal aid of Adolf Hitler? A camp doctor as the Concentration Camp?\"\n\n\nYou stare at him in silence.\n\n\n\"Well, the rumors are completely untrue. I am simply an immigrant and a taxidermist. I came here when I was a boy. Sure, I served my country during the war in the Werhmacht, but I surrendered first chance I got. It's simple fear of foreigners that makes children think I'm so terrible boogeyman, not any real facts. Did you take any... souvenirs from my basement?\"\n\n\nYou shake yor head.\n\n\n\"Good, although I warn you, my dear, that if you and your friends break into my house again I will be calling the Sheriff. And tell... give me a sec, my vision isn't great... Mason, Rebecca, Anthony and Carter that there's better things to waste your time on then bothering old men. Quite ironic that Carter's here to see a nazi with the family he has... Now, please leave me alone to my work, dear.\"\n\n\nYou nod, and run out towards the trees. You find the group, with Mason standing terrified, waiting for you.\n\n\n\"What happened? Why'd he just let you go? Carter says he was carving up a body!\"\n\n\n\"He said he's just an old immigrant and a taxidermist, and to leave him alone or he'd call the sheriff.\"\n\n\n\"He was cutting up a person!\" Ant shrieks.\n\n\n\"That was probably a deer!\" Lucy says. \"You're drunk as fuck, Ant.\"\n\n\n\"It was a person,\" Ant says, stubbornly.\n\n\n\"Well, we probably just annoyed an old man. Let's get the fuck out of here and go find Kyle.\"", "action_results": [{"action": "Head back into the woods", "result": "You walk back through the woods, heading towards the trucks.\n\n\n\"S-s-so, this w-was a bad id-idea,\" Carter says.\n\n\n\"Yeah, it was. I risked my life to annoy a harmless old man,\" you say.\n\n\n\"We risked our lives to annoy what could have been a harmless old man,\" Ant says.\n\n\nYou arrive at the camp, and Mason swears loudly.\n\n\n\"FUCK! Where the hell is Kyle?\" he asks.\n\n\nThe camp is empty, with no one in sight.\n\n\n\"R-r-remember last time we lost Kyle when he was drunk?\"\n\n\n\"Oh dear God, he ended up pissing in my garden. He wasn't pissing into the garden. He was standing in the garden, pissing on my house,\" Becca says. \n\n\n\"We need to find him. Is anyone not sober enough to find this place again?\" Mason says.\n\n\nThere's silence.\n\n\n\"Good. We'll split up and try find him. Ant, you head towards the Rotten Trees, Lucy, go towards our old tree house, Becca, towards the old drinking point, Carter, back towards town. Hazel, you're new here. There's a stream just over there,\" Mason says, pointing. \"Just walk along there, and keep your phone on. If you can't find him, follow the stream back here.\"\n\n\nYou nod. Time to find Kyle.", "action_results": [null]}]}, {"action": "Reveal yourself", "result": "You slowly leave your hiding spot, and are faced with Herr Eichel. His face is gaunt and haggard, wrinkles covering everything that was once smooth. His hair is all but gone, a few snow white pieces clinging onto his scalp. With how weak and feeble he looks, you're impressed he can stand. A pair of wire frame glasses sit on his nose as he looks you over.\n\n\n\"Hello,\" he says in a thick German accent. \"I am Mr Eichel.\"\n\n\n\"I know.\"\n\n\n\"Ah, so you've heard of me. Tell me, what are the current rumors. Am I said to be the assistant to Josef Mengele? The personal aid of Adolf Hitler? A camp doctor as the Concentration Camp?\"\n\n\nYou stare at him in silence.\n\n\n\"Well, the rumors are completely untrue. I am simply an immigrant and a taxidermist. I came here when I was a boy. Sure, I served my country during the war in the Werhmacht, but I surrendered first chance I got. It's simple fear of foreigners that makes children think I'm so terrible boogeyman, not any real facts. Shall I escort you to the front door?\"\n\n\nYou nod, and follow him up the stairs. He walks you through an old, dust covered house, stopping at the front door to open it for you.\n\n\n\"I warn you, my dear, that if you and your friends break into my house again I will be calling the Sheriff. And tell... give me a sec, my vision isn't great... Mason, Rebecca, Anthony and Carter that there's better things to waste your time on then bothering old men. Quite ironic that Carter's here to see a nazi with the family he has... Now, please leave me alone to my work, dear.\"\n\n\nYou nod, and run out towards the trees. You find the group, with Mason standing terrified, waiting for you.\n\n\n\"What happened? Why'd he just let you go? Carter says he was carving up a body!\"\n\n\n\"He said he's just an old immigrant and a taxidermist, and to leave him alone or he'd call the sheriff.\"\n\n\n\"He was cutting up a person!\" Ant shrieks.\n\n\n\"That was probably a deer!\" Lucy says. \"You're drunk as fuck, Ant.\"\n\n\n\"It was a person,\" Ant says, stubbornly.\n\n\n\"Well, we probably just annoyed an old man. Let's get the fuck out of here and go find Kyle.\"", "action_results": [null]}]}, {"action": "Hide under the workshop", "result": "You drop to your knees and quickly crawl under the workshop, curling up as you wrap your arms around your knees and curl up in a ball, trying not to move or make a noise. You hear an old voice begin to hum as the stairs begin to creak.\n\n\n\"Muss i denn, Muss i denn, zum stadtele hinaus...\" the old man sings. \"...stadtele hinaus...\"\n\n\nYou wince as you hear him draw near. You see his old, mud covered boots stomp down right next to you as he walks past. \n\n\n\"Und du, mein schatz, bleibst hier?\" he sings, as you hear the clank of metal as he grabs a blade from the tool rack. \"Wenn i komm', wenn i komm', wenn i wiedrum komm'...\"\n\n\nYou wince as he stands at the end of the workshop, right by you. You hear the squelch as blades slicken as they slice through flesh. There's a thud right above you and you gasp, before another thud, before a thud and a crack as Herr Eichel breaks open a bone with a hammer. Herr Eichel stops, pausing for a second.\n\n\n\"Is there someone there?\" he asks, his eery sing-song voice giving way to an elderly' grandfather's with a thick German accent. \"I promise, if you come out now, there... won't be a problem.\"", "action_results": [null, null]}, {"action": "Try to get out the window", "result": "You shake your head and jump up. Ant pulls desperately as you use your spare hand to pull yourself through the window. You wiggle as Ant pulls with all his strength. You slide through the window as your hear a sigh behind you. You turn your head, seeing Herr Eichel, an old, wrinkled man with metal spectacles and a balding head staring at you. You shriek when you see him and jump to his feet, grabbing Ant and pulling him after you. You run around to the front, where the rest of your friends are waiting.\n\n\n\"Let's go! Ant shouts, as you burst towards the woods.\n\n\nYou run through the trees, slowing down as you make reasonable distance from Herr Eichel's house.\n\n\n\"What the fuck happened?\" Mason asks.\n\n\n\"Guts... flesh... cutting people up...\" Ant asks.\n\n\n\"Shit. Did he see you?\"\n\n\n\"He saw Hazel.\"\n\n\n\"That's OK. That's fine,\" Mason says.\n\n\n\"Do we go to the police?\" you ask.\n\n\n\"Shit, no. W-we can't g-g-go to the p-police,\" Carter says. \"Just l-leave an anon-anonymous tip.\"\n\n\nMason pulls out his phone and makes a brief call to 911, trying to disguise his voice all the while. After a few minutes of him trying to explain the situation, he ends the call.\n\n\n\"So... this might've been our bad.\"\n\n\n\"What?\" you ask.\n\n\n\"So... the cops have been to Eichel's house many times before. He's not a murderer. He's a taxidermist, and he was probably cutting up an animal.\"\n\n\n\"That was definitely a person!\" Ant says.\n\n\n\"It could've been a deer,\" you admit.\n\n\n\"What, so the police aren't coming?\" Ant asks.\n\n\n\"I guess not.\"\n\n\n\"That's bullshit! I saw a person in there!\" Ant yells.\n\n\n\"Well, you are more than a little drunk,\" Lucy says. \"Hazel is too, and she said she it might'a been a deer.\"\n\n\n\"Well, I guess we just harassed an old man. Let's go back to Kyle, he's probably passed out in the back of a pick-up trucks,\" Mason says.", "action_results": [null]}]}, {"action": "Refuse to go", "result": "\"I'm not going!\" you proclaim loudly.\n\n\n\"Come on! You have to, it's a dare!\" Lucy says.\n\n\n\"Don't p-p-pussy out on... us,\" Carter says.\n\n\n\"No, I'm not doing,\"\n\n\nThere's a collective sigh from the group as you're hit by a barrage of complaints, sighs and insults, before the group settles down. You sit back onto the ground, noticing Mason has shied away from you slightly. Well shit. The group resumes their activities, which all consist of various ways of drinking.", "action_results": [{"action": "Keep drinking", "result": "You continue drinking and hours go past. The group constantly shifts positions, before Mason realizes something.\n\n\n\"Hey guys, where's Kyle?\" he asks.\n\n\n\"I think he went to go pee,\" Lucy shrugs.\n\n\n\"When was that?\"\n\n\n\"About an hour ago,\" Becca says.\n\n\n\"FUCK! Where the hell is Kyle?\" he asks.\n\n\n\"R-r-remember last time we lost Kyle when he was drunk?\"\n\n\n\"Oh dear God, he ended up pissing in my garden. He wasn't pissing into the garden. He was standing in the garden, pissing on my house,\" Becca says. \n\n\n\"We need to find him. Is anyone not sober enough to find this place again?\" Mason says.\n\n\nThere's silence.\n\n\n\"Good. We'll split up and try find him. Ant, you head towards the Rotten Trees, Lucy, go towards our old tree house, Becca, towards the old drinking point, Carter, back towards town. Hazel, you're new here. There's a stream just over there,\" Mason says, pointing. \"Just walk along there, and keep your phone on. If you can't find him, follow the stream back here.\"\n\n\nYou nod. Time to find Kyle.", "action_results": [null]}]}]}, {"action": "\"No, really, I'm fine.\"", "result": "\"Sure thing. Your loss.\"\n\n\nYou continue sitting around the campfire, which is really a lot closer to a glorified candle sitting in a pile of leaves. Mason grabs the bottle of vodka and sits down next to you and your heart flutters. A large part of you knows that this is just infatuation and a childhood crush, mixed in with a fair bit of hormonal lust, but still… he’s really, really cute. The others seem bored, with Kyle downing what seems like more than his weight in booze.\n\n\n“Well, this is boring,” Lucy complains, tossing a bottle in the middle. “Let’s play spin the bottle.”\n\n\n“No way!” Ant complains. “I’m the odd guy out. Kyle and Becca go together, you and Carter and then Mason and the new girl.”\n\n\nYou blush at that comment as Carter nods in agreement.\n\n\n“I agree. I d-don’t w-want to play spin the bo-bottle,” Carter says.\n\n\nBriefly glancing at the indifferent Mason, you feel a twinge of annoyance of all possibilities of spin the bottle disappears as Ant suggests a new game.\n\n\n“Truth or Dare!” Ant suggests, to the groans of Kyle and Becca.\n\n\n“Remember what happened last time?” Becca points out.\n\n\n“That’s not fair! That wasn’t my fault! You should’ve protected your dad’s stuff. How was I do know that that painting was worth a fortune?”\n\n\n“You shouldn’t have been drawing over paintings in the first place, Ant!”\n\n\n“It wasn’t skin off your dad’s nose! That rich bastard can handle a loss! Jesus, we all know his ancestors made his money off the backs of Kyle’s ancestors!”\n\n\n“Fuck you, Ant!” Kyle shouts, slurring from his drink.\n\n\n“Gentlemen, gentlemen, calm down,” Mason says. “There ain’t no issues! We’re all friends here! I say a game of truth and dare would calm us all down.”\n\n\n“Fine,” Becca says.\n\n\nMason downs the rest of his drink, and tosses the glass bottle in the middle. He drops to his knees and spins it, landing on Carter, who lies in the back of the pick-up.\n\n\n“Truth or dare, Carter?”\n\n\n“If I p-pick dare, will you… will you make me st-stand up?” Carter says lazily.\n\n\n“Maybe,” Mason says slyly.\n\n\n“Truth, t-then.”\n\n\nMason grins, glancing at him and Lucy.\n\n\n“Have you ever kissed Lucy?” he asks.\n\n\n“Nope. Sorry to disa-disa-disappoint.”\n\n\n“Damn. I was certain,” Mason sighs, pulling out his wallet and tossing Kyle a crumpled bill. “You just cost me twenty bucks, Carter.”\n\n\nAnt leans over, spinning the bottle. It slows to a stop, pointing off into the woods.\n\n\n“Is that closer to Becca or Hazel?” he asks.\n\n\n“Becca,” Carter says.\n\n\n“Oh, fantastic. Truth or dare?”\n\n\n“Truth.”\n\n\n“Dammit, Becca. Fine, I’ll make this awkward. How far has Kyle got with you?”\n\n\n“Shut up, Ant!” Becca hisses.\n\n\n“Hey, you gotta answer!” Lucy says.\n\n\n“Oh come on! That’s private!”\n\n\n“We’re all friends here,” Mason says.\n\n\n“Fine! We’ve… you know. Done it.”\n\n\n“Respect, Kyle,” Ant smiles, holding back a giggle.\n\n\nBecca goes red, grabbing the bottle and twirling it. Through pure luck or skill, it points directly at Ant.\n\n\n“Shit,” Ant sighs.\n\n\n“Truth or dare. I have a lot of embarrassing questions to ask.”\n\n\n“Dare,” Ant grimaces.\n\n\n“Well, you have a lot more balls than I though. You’ll suffer from it. I dare you to go into Herr Eichel’s basement.”\n\n\n“No!” Ant replies.\n\n\n“Come on, Becca! Herr Eichel’s tear out his throat if he caught him!” Lucy complains.\n\n\n“Who’s Herr EIchel?” you ask.\n\n\n“Oh, I’ll tell her. I’ve been practising this story for my little brother,” Mason says, before clearing his throat. “During World War II, a young soldier rose through the ranks of the SS. He had a habit of hunting Jews and personally escorting them to the Camps. He would hunt men, women, children, and torture them all for information. He showed no mercy. Eventually, when the Russians invaded, he escaped by pretending to be a civilian, fleeing from Berlin to France to Britain to the US. He hid right here in Dawnwood, hunting down any Jews he could find. His name is Herr Eichel.”\n\n\n“That’s the biggest load of shit!” Lucy complains. “Everyone knows that any Jew in Dawnwood would be scared off by Carter Sr. and his white power bullshit.”\n\n\n“He doesn’t w-w-want white pow-power!” Carter says. “He wants white p-pride. There’s… a difference.”\n\n\n“No there isn’t, Carter, now stop ruining the story. Where was I?” Mason asks.\n\n\n“You just finished,” you point out.\n\n\n“Oh. Well, now Herr Eichel’s going to kill Ant.”\n\n\n“Becca, I’m sorry! Please change the dare!”\n\n\n“Fine. You have to go into the Dead Man’s Barn and go up to the attic.”\n\n\n“That’s even worse!” Ant complains.\n\n\n“Nah, that ain’t bad,” Mason says. “Nazis are real and will kill you. Ghosts aren’t.”\n\n\nYou raise an eyebrow, and Mason smiles.\n\n\n“OK, story time. Once, there was a Sheriff back in the Western times who used his power to wipe out any competition of the big ranchers of the town. One of the small time ranchers, Daniel Edwards, stood up and told the Sheriff he wouldn’t sell his farm to his competition despite threats. The Sheriff led a posse to bring him down, and Edwards tried to fight back. He killed two dozen men and took near a hundred bullets before he went down. They tortured him for a few days, even cutting his face wide open to give him... what'd ya call it, a Glasgow Grin. Eventually, you just hung him to finish him off. Rumor is he still haunts the barn where they strung him up. It’s a historical building so it can’t be torn down, so the owner just leaves it vacant.”\n\n\n“I’m not going!”\n\n\n“Don’t pussy out, Ant.”\n\n\n“Will one of you go with me?” Ant pleads.\n\n\n“Spin the bottle, and whoever it lands on has to go with you,” Lucy suggests. “I hope it’s Becca. That’d be ironic.”\n\n\n“Sure,” Carter says. “Let’s do that.”\n\n\nAnt thanks Lucy and spins the bottle. It wobbles and slows to a halt, pointing directly at you.\n\n\n“Well, I guess Hazel’s going to Dead Man’s Barn,” Mason says.\n\n\n“No, she can go to Herr Eichel’s if she wants. Eichel’s just an old, slow dude. The Dead Man’s a supernatural murderer,” Lucy says.\n\n\n“Let Hazel pick,” Kyle says, trying to stand before stumbling and leaning back on the truck.\n\n\n“Yeah. Go ahead Hazel. Ghost or Nazi.”", "action_results": [null, null, null]}]}, null]}]}]}, {"action": "\"Can I go to a friend's house?\"", "result": "\"Hazel, it's your first day knowing these people. You don't know anyone here well enough to trust them,\" Dad says.\n\n\n\"OK,\" you say dejectedly, already planning how to sneak out.\n\n\nYou quickly eat most of your dinner before faking a stomach ache and disappearing into your room.", "action_results": [null]}, {"action": "\"Nothing.\"", "result": "\"Uh... OK,\" Dad replies.\n\n\nYou eat your dinner quietly, before faking a stomach ache and disappearing into your room.", "action_results": [null]}]}]}, {"action": "\"OK.\"", "result": "\"Well, honey, that's pretty good.\"\n\n\n\"Yeah, I guess.\"\n\n\nYou shrug and turn on your phone. After about an hour, Dad begins serving dinner.", "action_results": [null]}, {"action": "\"Pretty good.\"", "result": "\"That's fantastic honey! I'm sure you've made lots of friends.\"\n\n\nYou smile and turn on your phone. After about an hour, Dad begins serving dinner.", "action_results": [null]}]}, {"action": "Don't let him watch TV, for he is a whining, snivelling brat", "result": "\"Screw off!\" you say, flinging a cushion at Hunter.\n\n\n\"Fine!\" Hunter shouts, storming off.\n\n\nYou continue watching your show (the clown was being blackmailed by the mother about his time in jail so she could get the insurance money), until eventually you hear the slamming door that signifies Dad's home.\n\n\n\"Hello! I'm home!\" he calls.\n\n\n\"Hey Dad!\" you yell.\n\n\nHe walks in, smiling. Immediately, Hunter starts to whine.\n\n\n\"Dad! Hazel won't let me watch TV!\"\n\n\n\"Who was watching first?\"\n\n\nHunter falls silence as you follow Dad into the kitchen.\n\n\n\"God, you're at each others throats,\" he smiles. \"I'll put on dinner. We have chicken curry.\"\n\n\nHe begins to turn on the stove and start cooking.\n\n\n\"How was school, honey?\"", "action_results": [null, null, null]}]}]}, null, null, null]}]}, {"action": "Two Days Later...", "result": "The school is a shitty building filled with no good kids who are learning about geography and Shakespeare despite the fact that they’ll almost certainly end up in the shitty jobs that are needed to keep this town running. You walk through the doors, a backpack slung over your shoulder.\n\n\n“OK, it’s not so bad,” you mutter, walking past a row of lockers down the hall. \"I just have to find my classes and…”\n\n\n“Hey, Hazel!” a voice cries.\n\n\nYou turn to find the familiar, zit stricken face of the pizza cashier, Lucy.\n\n\n“Hey,” you reply.\n\n\n“So, it’s your first day, huh? Do you know what classes you’re in?”\n\n\nYou search your pockets and pull out a crumpled class schedule, handing it to her.\n\n\n“OK, we have the same Spanish, English, Math, History… you do Chemistry? Gay! That’s the hardest class!”\n\n\n“Well other than that we seem to share a suspicious amount of classes.”\n\n\n“Yeah, I talked to the principal and begged him to put you in my classes… it’s a tiny school, what do you think would happen? Of course we share most classes. Oh look, Carter’s here.”\n\n\nYou turn to see Carter, the kid from the day before, bounding over.\n\n\n“I know,” you say. “We met the day before yesterday.”\n\n\n“Y-yeah. How’ve y-you been?”\n\n\n“Good.”\n\n\n“Well, you made friends without me? I feel left out. Anyway, if you want, we can both show you around. Between the two of us, we should share pretty much every class.”\n\n\n“Except Chem… Chemistry,” Carter points out.\n\n\n“Yeah, you’re pretty much fucked for that, but that’s your problem. Now we have double Math and English, and Miss Loaves is genuinely the easiest Math teacher to have to deal with. She’s the only one who lets you get books from your locker when you forget them rather than giving a write-out or detention or just yelling for ten minutes. Come on, we’ll show you around.”", "action_results": [null]}]}, {"action": "\"No.\"", "result": "\"For God's sake, Haze! This isn't fair! You can't punish me forever because of the mood! I'm sick of this bitchy behavior! Now, get in the car!\"\n\n\nYou follow Dad to the car, and climb in the passenger seat. You don't even need to turn your head to know your brother's in the backseat, hearing the opening tune of Angry Birds: Stalin's Show Trials or whatever the fuck version they have now. You lie back in your seat and stare out the window as you go through the town. Eventually, you arrive at some shitty, greasy pizza joint, and get out of the car. You walk inside, and find yourself in a Chucky Cheese knock-off. You walk up to the counter and find yourself faced with a girl your age with long brown hair and a massive zit that looks like a red dot sight in the middle of her forehead.\n\n\n\"Hello, welcome to Pizza Corner, can I take your order?\" she asks.\n\n\n\"Yeah, can we have a large Pepperoni Pizza and three Cokes?\"\n\n\n\"Sure thing. Small, Medium or Large?\"\n\n\n\"Medium.\"\n\n\nThe girl begins pouring the drinks as another, far prettier blond girl appears from the kitchen, holding a large piece of dough. She glances briefly at you, before grabbing a cloth with her spare hand and disappearing back again.\n\n\n\"So, are you new here?\" the cashier asks.\n\n\n\"Yeah, I just moved in.\"\n\n\n\"I'm Lucy.\"\n\n\n\"I'm Hazel.\"\n\n\n“Oh, really? Well, it’s a good town. You can’t find much work except in a dull pizza joint, but there ain’t much here to even spend the money on. Some old clothes stores and a cinema, and that’s about it.”\n\n\n“Do you work here full time?”\n\n\n“Jesus no. If I got to the point where I was working here full time I’d dip my head in the deep fat… well, I wouldn’t be happy. Im still in school.”\n\n\n“What grade?”\n\n\n“10th.”\n\n\n“Oh, I’m starting there tomorrow. I guess I’ll see you there.”\n\n\n“”Sure. If you want, I can always get you a job here. Becca, the blond girl, has literally done shit all since we started. She’s only working so her daddy an think she’s learning real-life experience and still feel justified buying whatever she…”\n\n\n“I can hear you!” a voice calls out from the kitchen.\n\n\n“I know, Becca, I’m getting a point across!”\n\n\nDad appears standing next to you, grinning.\n\n\n\"Look who's already making friends!\" he smiles.\n\n\nYou roll your eyes.\n\n\n\"Yeah, sure. Let's just sit down,\" you say, pulling Dad towards a booth to sit in. ", "action_results": [null, null]}]}, {"action": "Go outside", "result": "You walk outside, and two snot-nosed, dirty kids with long, uncombed brown hair appear, staring blankly at you. They both have shoulder-length hair and wear mud-stained clothes, a boy and a girl.\n\n\n\"Who are you?\" one asks as she begins to pick her nose.\n\n\n\"Hazel. I'm new here.\"\n\n\n\"Where you from?\"\n\n\n\"New York.\"\n\n\n\"My dad says New York's only full of greedy Jews and angry Negroes.\"\n\n\n\"Jesus Christ, kid, maybe your dad's a prick,\" you say aghast, staring at the pair.\n\n\nA tall boy who seems to be your age jogs over, grabbing the two children. He has short brown hair and wears shorts and a t-shirt, both of which are far too small for him, as well as an awkward smile that stares at you.\n\n\n\"Hi. S-S-Sorry if these t-two were bothering y-you. TJ, Emma, go b-b-back inside,\" the boy stutters.\n\n\nThe pair of kids shrug and run off. The boy extends a hand, which you grasp and shake.\n\n\n\"I'm Carter,\" he says, smiling.\n\n\n\"I'm Hazel.\"\n\n\n\"So, d-did you just-m-m-move in?\"\n\n\n\"Yeah, I did.\"\n\n\n\"Cool. What g-grade are you i-in?\"\n\n\n\"10th.\"\n\n\n\"Oh! Me too! W-when are you star... starting?\"\n\n\n\"Day after tomorrow.\"\n\n\n\"Cool. I guess I'll s-see you then. It was a... a pleasure to meet you,\" he smiles.\n\n\nCarter rushes after his siblings, and you watch as he jogs off. You hear Dad yell from your house, and turn to see him.\n\n\n\"Hey, sweetie. The house is pretty barren, so we're going to go out to eat and I'll pick up groceries in the morning. I saw a pizza place in town. Do you want to go?\"", "action_results": [null, null]}]}]}