{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=34838", "context": "", "first_story_block": "", "action_results": [{"action": "Turn out the lights.", "result": "Once upon a time you were called the greatest hero to ever live.\n\n\nYou must have been nineteen at the time. Fresh faced, hot headed, and too dumb for your own good. With sword in hand, you set out with your childhood friends to save the world from an evil wizard (damn, you can't even remember his name) bent on enslaving mankind. When you left home, there were five of you: a mage, a rogue, a bard, a healer, and yourself, a fighter.\n\n\nThe six month long journey to the wizard's tower was filled with happy times, light hearted misadventures as you all prepared for fortune and glory. When you reached the tower, the mood quickly changed. Your bard fell to a herd of undead that ambushed you at the entrance. The healer took a poison dart to the throat on the fourth floor while the rogue was burned to ash by a pyromancer on the seventeenth floor. Yourself and the mage were all that remained when you reached the twentieth and final floor, and she was cut down halfway through the fight with the wizard. When the dust cleared and all was quiet, you were the last one standing.\n\n\nYou returned home a year after you had left it. The villagers showered you in praise for killing the wizard, and word reached the nobles in the cities far away that the evil wizard had been defeated. They held a feast in your honor, they showered you in gold, they gave you a title and a manor and an army of servants. Women wanted you, men wanted to be you. But it was all hollow.\n\n\nYou played along for the first ten years, finding little joy in the newfound fortune and glory you had longed for. It wasn't until the writers and artists began to touch your quest that you finally shut yourself in. It started innocently enough, sanitized children's tales about the exploits of you and your allies, but soon it became epic poems and romanticized paintings. One by one, your friends disappeared from the fictionalized tales of your quest, until it was just you, the knight in shining armor, slaying the vile wizard with your enchanted blade.\n\n\nThat was when you finally shut yourself in, to hide from the common folk and their damning praise, from the artists and their bastardized accounts. For five years the only place you'd go was the tavern down the road from your estate, where you'd planned to waste the rest of your days drinking until you couldn't remember your regrets. It didn't work. Just as luck would have it, you were recognized one day, and soon people were flocking to the pub like moths to a torch. All in the hopes of meeting you, the legendary hero.\n\n\nIn these last five years, you've stayed locked up in the master bedroom of your manor. You ordered your butler to bring you ten bottles of wine and three loafs of bread in the morning, leaving you be until the next day. No one can enter your room save the butler, and if anyone does you make sure to scare them off by grabbing your old sword and flailing it around while yelling drunkenly at them.\n\n\nIt's a fitting end for the man regarded as the greatest hero to ever live: locking himself away in the home gifted to him, drinking wine and eating bread and waiting for the day he finally dies.", "action_results": [{"action": "Continue", "result": "Your latest quest begins not with the destruction of your manor or the death of someone close to you, but rather with a letter.\n\n\nBertrand, your loyal servant, comes to your room in the early morning hours to drop off today's dosage of bread and wine. But on the platter, tucked in between two loaves of bread, is a letter. The seal is emblazoned with the royal coat of arms. You eye Bertrand warily, and the old man gives a sigh. \"Apologies, my lord. A knight came to the manor this morning, and he requested that I pass this along to you. The knight said that it's an invitation to the royal castle from the king himself. I suggest you read it.\"\n\n\nWith a sigh of your own, you rip open the envelope and unfold the letter, taking a look at the contents.\n\n\n\"Dear Sir,\n\n\nI have need of a man of your talents. There are important matters to discuss regarding the ongoing war between the Kingdom of Oren and the Empire of Kishak. You must report to Castle Oren as soon as you may, though I urge you to arrive soon. If a week has passed without word from you, then I am afraid I must send my men to acquire you immediately. I hope that you will come.\n\n\nRegards,\n\nKing Walter III.\"\n\n\nYou scoff at the letter. Bastard king, sitting on his throne while his dogs do the work. You suppose that he considers you one of them. The question lies in whether you are indeed one of the dogs that mindlessly obeys orders, or whether you'll break from the pack and carve your own path.", "action_results": [{"action": "Damn the king. He holds no power over me.", "result": "For a moment, rage shakes within you. He thinks he can simply call upon you and you'll trot over to his castle? What sort of man does he take you for? The bubble of rage bursts, and you find yourself tearing the letter in two, before crumpling it and throwing it on the floor. Bertrand gulps slightly as he watches.\n\n\n\"Leave me,\" you say, and he does. You carry on that day as you normally do, drinking heartily and eating when your stomach grumbles. As usual, you pass out late into the night, last bottle of wine in hand.\n\n\nWhen you wake the next day, you're fully hit by the reality of the situation. The king threatened to send men to acquire you should you fail to show up after a week. You can't stay here anymore, and if you do, then they'll come sooner or later. This means you'd either need to move on, or try to hold out and fend off any of his men who come your way.\n\n\nWhat's it going to be, hero?", "action_results": [{"action": "I need to leave. There's nothing for me here.", "result": "In the late hours of the night, you set out for parts unknown.\n\n\nOn your back is your sword, chipped and dull. It's far too large to be called a sword; massive, heavy, far too rough. If anything, it's a hunk of raw iron. But it's yours, and a single swing with the large blade is enough to cut down three cavalrymen and their horses too. Beside it is your knapsack, carrying only raw essentials, such as food, a change of clothes, a tinderbox, lantern oil, and a jug of alcohol. Fifteen feet of rope in a coil is tied onto your belt, alongside a lantern.\n\n\nFor a moment you're leaving your home village with your friends. All of you are young, reckless, hopeful... But the nostalgia soon fades, and you realize what you're doing. You're not leaving to save the world, you're leaving to get away from your responsibilities. The thought makes you let out a dry, humorless laugh.\n\n\nIt's been so long since you've traveled. You almost forgot what it felt like, just you on the open road. It feels... Liberating, almost. Like a weight has been lifted off your shoulders for the first time in years. As though you were holding the world high above you, and only now can you take a break. But you don't hold onto that feeling, for you know well enough that it will distract you from any dangers on the road...\n\n\nSoon enough, you come upon a fork in the road. One road leads into the forest. You're unlikely to come across any other people on this road, only wilderness as far as the eye can see. The other road is a common trade route, with villages dotting it every few miles. Either way, wherever you go, you'll be traveling far away from the place you once called home.", "action_results": [{"action": "Take the path into the woods.", "result": "You take the path through the woods, being sure to light your lantern along the way. The ambient sounds of wildlife keep you on the alert. For every wolf's howl and twig snapped in the distance, your hand draws closer to the hilt of your sword. Still, nothing comes out to attack you, and you must be grateful for that.\n\n\nThe road carries you onwards for hours, until finally you must stop and rest. With a grunt, you begin to climb up into a large oak tree along the path, checking every branch until, finally, you find one that can support your weight. You kill your lantern and tie it to the branch using your rope. Setting your knapsack up against the tree, you lay down, and fall asleep.\n\n\nThe sound of shouting and the light of torches causes your eyes to snap open. Through the canopy of leaves you can see a faint glow, as though sunlight is fighting hard to break through and onto the path. On said path you see a large group of men wearing armor comprised of animal hides and worn out leather.\n\n\nMarauders. They're a wandering group of bandits and raiders, accepting any who wish to fight with them. They make their living by ransacking and pillaging towns, and never stay in one place for long. Above all, they admire a fierce warrior, and rumor has it that if one can slay the leader of a Marauder band, then one may lead them.\n\n\nInstinctively you reach for your sword, but stop as you realize that they can't see you unless they look up. They must be on the way to find a village, so that they can steal their valuables, kill them all, or rape the women. Perhaps even all three, if they're a particularly ambitious bunch.\n\n\nYou've fought these sorts before, and most often they'll fight tooth and nail until their leader is dead. Once that happens, they'll submit themselves to you willingly... That is, if you can survive long enough to reach their leader. If you got into a fight, you can't be sure you'll walk away from it alive.\n\n\nBut at the same time... Could you just sit by and let these men harass, or even kill, the innocent?", "action_results": [{"action": "Yes, I can. I'm not a hero anymore. They can do as they like, so long as they don't bother me.", "result": "You make yourself scarce, watching them as they continue their march out of the forest. They're a band of about four dozen, and you know that if you had chosen to fight them, it may have meant the end of you. It must have taken close to half an hour for them all to move on so far that they were out of sight, but the adrenaline pumping through your blood made the time seem as though it had passed in the blink of an eye.\n\n\nOnce they're gone, you retrieve your lantern and rope, before carefully climbing down the tree. You let out a sigh of relief once your feet hit the ground, and you continue your journey onward into the woods. Your journey lasts long into the day, and before you know it, the trees begin to give way to grassy fields. The only problem being that it's almost night again, and you don't want to risk sleeping out in the open.\n\n\nThe trees are too small here for you to be able to sleep in one. You scan the area, and find... A cave? Yes, there's an entrance to a cave poking out of the ground towards the edge of the wilderness. The entrance is massive, which means that something undesirable may lurk in there, though you can take out whatever may call the cave its home.\n\n\nAlternatively, you can continue your march into the night. Perhaps you'll find a better place to take shelter.", "action_results": [{"action": "I'll take shelter in the cave.", "result": "You walk to the cave's entrance, lighting your lantern. Within the inky black darkness are piles of bones. Most of them are those of animals, though you spot a human skull in there. This might have been a bad idea. Still, you carry onward, swinging your sword around from your back and gripping the hilt tightly.\n\n\nAs you journey further, you find no sign of bears or wolves or the like. So, you carry onward, intent on slaying whatever beast may live here. It is deeper into the cave that you begin to hear and feel a low rumbling. It shakes you to your core, and your knuckles whiten as you grip your sword tighter. Is it what you think it is?\n\n\nYour question is answered when your lantern's light glints off of maroon scales.\n\n\nA dragon, slumbering on a pile of branches and bones. By the size of it, it appears to be young, no older than perhaps an infant, though that does not mean that it will be friendly. Nearby are the skeletal remains of another dragon, this beast far larger. Was it orphaned? You've no idea.\n\n\nYou are about to make your leave so you don't face the wrath of the beast when its eyes snap open.", "action_results": [{"action": "Quickly slide my blade back onto my back and raise my hands. I just want to go.", "result": "Slowly, you slip your sword back into place on your back, and raise your hands. The dragon stares at you, though no malice is in its eyes; instead, you see an almost childlike curiosity. Perhaps the human skull you saw was left there by its deceased parent? Whatever it is, the dragon has yet to make any hostile actions towards you.\n\n\nIt begins to inch its head closer to you, sniffing you curiously. Thinking quickly, you carefully remove your knapsack, then reach deep inside it. Within is a slab of raw venison, which you offer to the beast. It looks as though it's about to rip your arms off along with the meat, so you set it down at your feet and back away slowly. As you suspected, the dragon greedily gobbles it up.\n\n\nOnce it has finished its snack, it looks contentedly at you, nudging you as though asking for more. You provide him another slab of meat, which he takes from your hands this time. Then another. You save the last piece of venison for yourself, slowly putting your knapsack back in place. The dragon tilts its head at you, before letting out what appears to be a yawn. It settles back down on the ground, and falls asleep.\n\n\nYou let out a sigh. That was... Terrifying. You back up and set up a place to sleep not far from the dragon's chamber, falling asleep in minutes from the exhaustion. In the morning, you get up... Only to see the dragon there, staring at you. Carefully, you get up, but the dragon makes no sudden moves. Just stares at you expectantly.\n\n\nPutting your hands back up, you begin to back away slowly, and the dragon begins to follow. For a second, you close your eyes, awaiting the painful bite that will follow... But nothing happens. Instead, it stands there staring at you as though a puppy waiting for its master's commands.\n\n\nYou lower your hands, then turn around. Continuing out of the cave, you glance over your shoulder every now and again, and the dragon still follows. Have you... Tamed the beast? That was easier than you expected it would be. It continues to follow you out of the cave, blinking violently at the light when you emerge from the cave and into the daylight, but still retaining its friendly attitude. It continues to follow you as you march onward to places unknown.\n\n\nWhen you fell asleep in the night, you half expected the dragon to have tried eating you in your sleep, or to have flown back to his cave. Instead, you awake to him presenting you a mangled deer carcass. It looks like you've made a new companion, and a very powerful one at that.\n\n\nSo it is that you and the beast continue onward to wherever the road takes you.\n\n\nTHE END", "action_results": []}, {"action": "This beast might be wild. I swing wildly, hoping to wound it.", "result": "You swing wildly, a yell escaping your lips. The blade meets the dragon's rough scales, and it lets out a roar of mixed agony and rage. Blood drips from its wounds, and it rears back, head turning to look at the deep gash in its side... Then, it charges at you.\n\n\nIt barrels into you, sending you onto your ass. Another roar escapes its mouth, swiping a claw at you. You block the blow with your sword, cutting deeper into the dragon's hand, and it rears back yet again to determine its next move. It must not be used to fighting.\n\n\nIt's making for another charge.", "action_results": [{"action": "Stand my ground and stick my sword out, hoping the beast runs into it.", "result": "As the dragon charges forward, you stick your blade out, hoping that it will be unable to stop and impale itself on your sword. Instead, it ducks below the blade, and though you try to adjust quickly and bring the sword down onto the animal, you're too late. It charges into you, this time biting into your stomach. You let out a yell of pain, repeatedly bringing your sword down onto its back, but by the time it is finally dead the damage is done.\n\n\nYour entrails are spilling out of your torso. Bloody coughs escape your lips. There's no coming back from this, unless a healer suddenly happened to come by. With your luck, another dragon would sooner come by instead. Eventually, the pain stops, and you close your eyes with a shuddering, blood-tinged sigh...\n\n\nTHE END", "action_results": []}, {"action": "Leap out of the way, swinging my sword at it whilst I do.", "result": "You wait for a moment, to ensure that it's close... And then you leap out of the way of the charge, swinging your sword at it. You manage to nail it right in the belly, the blade cleaving through the dragon's scales and into its flesh. It lets out a blood curdling screech, tumbling a bit as it loses its footing before finally falling over onto the ground.\n\n\nYou walk closer, sword at the ready. The dragon twitches slightly, so you bring your blade onto its throat. That killed it, for sure. With the beast slain, you collapse onto the ground, catching your breath. That was... Intense, to say the least. You've never fought a dragon. If the beast were any bigger, you would have lost, no doubt.\n\n\nThen, you laugh. You laugh until your ribs ache and tears escape your eyes. Then you laugh some more.\n\n\nYou just slayed a dragon. You must be losing your mind to be doing this sort of stuff again.\n\n\nAfter a while of laying there, you fall asleep, and in the morning you wake up recharged despite the aching where the dragon rammed into you. You exit the cave, and begin the track on the path. The excitement of fighting such a monstrous beast and living to tell the tale... It's exhilarating. Why has it been so long since you've felt this? You miss it.\n\n\nYou set out to find more beasts to hunt.\n\n\nTHE END", "action_results": []}]}]}, {"action": "I'll continue my trek.", "result": "In spite of the darkness, you continue on the path, keeping a hand on your sword in case you're attacked. You light your lantern so that you can see more clearly, and march onwards. Eventually, you spot an old wooden cabin near a lake, not too far off the path. It looks abandoned, but hopefully if anyone still resides within you can convince them to let you take shelter.\n\n\nYou make your way to the front door, where you attempt to open it, only to find that it's locked. Damn, the place isn't abandoned. Instead, you raise your fist and pound upon the door. \"Hello,\" you call out, \"I seek shelter for the night.\" It takes a moment, but soon you hear footsteps descending stairs within, then the sound of a lantern being lit, followed by faint light creeping through under the door. Finally, you hear the sound of a bolt being unlocked.\n\n\nThe door cracks open slightly, and you can see a wrinkled eye poking out. \"I didn't think anyone still wandered these old roads,\" he says, his voice old and creaky. \"What brings you 'round here, stranger?\"\n\n\n\"I'm nothing but a simple wanderer,\" you reply. \"I just seek shelter for the night.\"\n\n\nHe looks as though he's contemplating it. He seems wary, though that isn't unreasonable; if you were in his shoes, being woken in the dead of night by a large man with a large sword, you'd be wary as well. Finally, he opens the door wider, croaking out \"Come in.\" You oblige.\n\n\nBefore you stands an older man, perhaps in his 60s, dressed in a faded blue woolen shirt and ragged breeches. \"Welcome. My name is Oscar. What's yours, wanderer?\"\n\n\n\"My name is Kit.\" You look around. The interior of the cabin is quaint, decorated with paintings and old wooden furniture. A hearth sits on the back wall, cooking utensils hanging above it, near stairs ascending to the second floor. \"A nice home you have here.\"\n\n\n\"Thank you.\" Oscar gestures to the floor. \"You're welcome to make yourself comfortable. Please, do not head to the second floor. My wife is attempting to sleep. She's been sick.\"\n\n\nYou nod. \"I understand. Thank you, sir.\"\n\n\nOscar ascends the stairs, leaving you on the first floor. You lay down, and fall asleep.\n\n\nIn the morning, you wake to Oscar descending from the stairs. \"Morning, sir. You're welcome to stay for breakfast if you want, I'm going to get wood for the hearth. And again, please do not disturb my wife. She's still dreadfully sick.\" With that, he heads to the door and leaves.\n\n\nHe's rather insistent that you not bother his wife. Is she really that sick? Maybe you can check for yourself. Or, you can wait for him to come back and then eat breakfast with him and be on your way.", "action_results": [{"action": "I'm curious. I'll head upstairs.", "result": "After a moment, you get up from your place on the floor and slowly head up the stairs. Surely you have enough time before Oscar gets back. Once you reach the top of the steps, you find there is a hallway leading to a single door. You approach the door, a sinking feeling in your gut rising all the while. Something isn't right.\n\n\nYou open the door and what you see almost causes you to lose the contents of your stomach.\n\n\nThere in the bed is the corpse of a woman. She's decomposed heavily, and it's clear she's been dead a long while, far too long. Porridge drips from her rotting mouth. It was made recently. This is... Repulsive. Horrific. Wrong.\n\n\nYou're not sure how long you've been standing there, staring at the woman's corpse in shock. It isn't until you hear Oscar's shouting that you realize what you've just found... And rage shakes within you.\n\n\nYou unsheath your sword. \"W-wait! I can explain!\" Oscar yells, sticking his hands up.", "action_results": [{"action": "Damn him, the sick bastard. I swing.", "result": "You swing your blade into him. It cleaves through him like a knife through butter, bisecting him from hip to shoulder. He's dead before his torso hits the floor, and blood stains the walls of the cabin. You don't bother to clean up the mess you just made. Instead, you make your leave.\n\n\nYou continue on the road for a while. Days, maybe even weeks pass. However long you've been on these pathways, you don't know. Eventually, you manage to find a cabin that has actually been abandoned, resting nicely on the edge of a forest. It is there that you finally settle down, hunting and gathering for food.\n\n\nOccasionally, travelers pass through on their own journeys, but they never stay long. Once or twice bandits have attempted to rob you, but once you retrieved your old sword and showed how well you can handle it, they quietly backed away... Most of them, anyhow. The fools that didn't? Well, you're lucky the stains came off easily with a bit of elbow grease.\n\n\nFinally, you are at peace.\n\n\nTHE END", "action_results": []}, {"action": "I stay my hand. If he doesn't give an answer I like, I'll kill him.", "result": "It takes all your willpower to keep your blade from meeting his flesh. Still, your anger does not subside, and your voice comes out in a low growl when you speak, \"What the fuck are you doing?\"\n\n\nIt is then that Oscar breaks into tears.He falls to his knees. \"I... I... I couldn't bare to lose her! I loved her so much! When she got sick, I was heartbroken... And when she died I couldn't accept it! I didn't want to lose her!\" He can't find it in himself to continue, instead letting out a heart wrenching sob. \"Please, sir... If you must, end my life. I wish... I wish to buried next to her.\"\n\n\nThe grip on your sword tightens. You're not sure what to do with this pitiful old man.", "action_results": [{"action": "He asked me to kill him. I will, and put him and his wife to rest.", "result": "You raise your sword. As gently as you can, you stab his throat. He lets out a pained gurgle, blood filling his esophagus, before finally his lungs are filled and death takes him. You pull out your sword and find his head has nearly been lopped off. Disgusting.\n\n\nYou take his corpse in your hands and take him outside, where you set him down. Then, you do the same with his wife, hauling her outside. You set her down next to her husband, before heading back inside to grab a shovel.\n\n\nA few hours later, the pair are buried. You head to a nearby tree and cut off a decent sized branch, which you jam into the soil of their grave. There, they shall find rest... As you stand there over their shared grave, you find yourself thinking back to Grace, the hotheaded girl who could conjure fire with but a flick of her palm. What you would give to have been buried next to her.\n\n\nYou set off from the grave.\n\n\nTHE END", "action_results": []}, {"action": "I won't kill him. I know the pain he is going through, has been going through.", "result": "With a sigh, you place your sword back onto your back. Then, you kneel down to be at eye level with the sobbing man. Despite the emotions you want to show, you find your voice being almost monotone as you speak. \"I know the pain you're going through. I lost my love when she and I were young, far too young. You should be grateful for the time you had with her.\"\n\n\nHe wipes his eyes slowly, but he says nothing.\n\n\n\"It's time to let go.\"\n\n\nWith that his tears are dried. It seems as though a weight is lifted from his shoulders with your words.\n\n\n\"I... Thank you, for your words. I'll... I'll bury her, under her favorite tree. You can stay for breakfast, if you'd like. I won't be long.\" He picks himself up off the floor, and you do as well.\n\n\n\"I think I will.\" With that, you head downstairs, while Oscar begins to retrieve his wife's corpse. He leaves for the yard, while you sit and wait in his living room. He comes back an hour or so later, makes porridge, and serves it to you. The two of you eat in silence, before you stand and make your leave.\n\n\nLife must go on. The pain that one endures is what makes them human. You know that all too well.\n\n\nTHE END", "action_results": []}]}]}, {"action": "No, I won't invade their privacy. I'll stay for breakfast then leave.", "result": "You stay put. Oscar comes back not long after with an armful of wood logs and grass, which he places into the hearth. You offer him your tinderbox, which he takes with a hum of thanks, before lighting the hearth. He begins to cook porridge, and hands you a bowl not long after. It's good.\n\n\nAfter you finish up your breakfast, you gather your things and take your leave. He was quite a kind old man. You wonder if he and his wife will do alright all alone out here. Perhaps such a life... Would suit you. Perhaps.\n\n\nA few days, maybe even weeks later, you find a worn-down cabin on the edge of a forest that is actually abandoned this time. You decide to give that life a shot, and find that it does suit you. It is there that you finally settle down, hunting and gathering for food.\n\n\nOccasionally, travelers pass through on their own journeys, but they never stay long. Once or twice bandits have attempted to rob you, but once you retrieved your old sword and showed how well you can handle it, they quietly backed away... Most of them, anyhow. The fools that didn't? Well, you're lucky the stains came off easily with a bit of elbow grease.\n\n\nFinally, you are at peace.\n\n\nTHE END", "action_results": []}]}]}, {"action": "No, I can't. I have to do something.", "result": "You sit up and kneel on the branch. From that position, you watch for a moment, counting their numbers. Altogether, they're about four dozen. You've fought those odds before... Then again, you had your companions by your side. Even then, you can fight like a cornered animal if you try hard enough. Time to see if you still have it.\n\n\nYou pull your sword from your back and ready it, then jump down in a swing. The momentum of your fall slices right through three different men before they could even react. Their heads split right open like overripe watermelons, and the sword carries on through their bodies, cleaving them in half messily. Blood and guts cover your blade.\n\n\nThe others all stop their march and back away immediately, staring in awe at the mess you just created. There's an intense stare down between you and all of their numbers. Some have fear in their eyes, others anger, an odd few even respect. Most? A mixture of the three. The seconds tick by slowly, painfully, neither you nor the bandits wanting to make the first move, then...\n\n\n\"WHAT ARE YOU WAITING FOR!?\" a gruff voice calls out. \"ATTACK!\"\n\n\nThen, they're swarming you while yelling and swinging their weapons in a panic. You bring down a few with a single swing. A few cuts and stabs get through your defense. An arrow pierces your left bicep. Still, you fight madly, like an unchained beast.\n\n\nSoon, you're attacking and defending on pure instinct. Adrenaline carries you as your body moves on its own. Too tired to think clearly. Can only act.\n\n\nBut it's in the repetition of swing, block, swing, block, that you find time to reflect.\n\n\nWhat are you doing here?\n\n\nWhy are you doing this?\n\n\nWhen did you go from being a hero to callously slaying bandits in the woods?\n\n\nYou're hurt. You're cold. You're hungry. You're tired. You're afraid.\n\n\nBut something still carries you.\n\n\nThat intense desire to live.\n\n\nLike a flame that won't die out.\n\n\nThe question is...\n\n\nShould the flame stay lit?", "action_results": [{"action": "The passion has died. I need to let go of my pitiful life.", "result": "You're past your prime. Nothing you do will make a difference in this world. It's time to let an old man die before he does something too rash.\n\n\nSlowly, you stop fighting. More attacks get through your defenses. Fewer of your hits connect. Soon, it's just you standing there taking their punishment. A sword gets driven through your back. A spear impales you through the abdomen. An arrow flies into your throat.\n\n\nSoon enough, you're nothing but a battered and unrecognizable corpse, lying in the road. You took 21 of their number with you. Nearly half their forces. They regard your corpse with a begrudging sense of respect. No one has given them such a fight before.\n\n\nYou're left slumped against a tree, sword in your lap. No one who passes through dares disturb your corpse, and soon, the earth retakes you.\n\n\nTHE END", "action_results": []}, {"action": "The passion still burns within me. I won't let go. I'll fight until every bone is broken and my last drop of blood has spilled.", "result": "No. You won't go quietly. That fire, deep within your soul, it still burns as bright as it ever did. And no two-bit marauders will extinguish it. You swing with more force than you ever have before, take more punishment than you ever have before. Throwing caution to the wind as you try to take down as many of these bastards as you can.\n\n\nAfter a while, you think you finally land a hit on their leader, and one hit is all you need. You can tell it's him by the glint of silver decorating his armor. When you land that blow, the others lose their fighting spirit. You plant your sword into the ground, panting as you catch your breath. Then, you turn to them with a sudden jerk of your head, a twisted grin on your face.\n\n\n\"Well? What are you waiting for?\"\n\n\nThey stare at you with shock and awe written on their faces. There's only about 16 left. One steps forward. \"You... Killed our leader! And most of our band!\"\n\n\n\"And I'll kill you too!\" You bare your teeth at them for full effect.\n\n\nThen, they fall to their knees and lay their faces on the ground. You stare at them, still thirsting for blood on your blade. One of them begins to yell, \"Lead us into battle, worthy warrior! You've proven that you can kill dozens of men and carry on!\"\n\n\nThey're offering you the now vacant spot as their leader.", "action_results": [{"action": "I've nothing better to do. I'll take it.", "result": "You stare at them. Then, you grin. \"Get your faces out of the mud. We've got a job to do.\" They all rise up from their bowing position, staring at you uncertainly. Your unsettling grin puts them even more on edge. \"One of you! Patch up my wounds. We'll make camp for the night, then set out at dawn. We need to recruit more soldiers, then we'll see about raiding a town.\"\n\n\nThey all nod. Most of them begin to set up their tents, while others loot the bodies for any valuables. One of them comes over to you and sets to work on your wounds, he tells you he was a healer once upon a time, but grew bored of his life. He desired excitement, so he joined up with a band of raiders.\n\n\nPerhaps this is what you needed. Excitement. And leading a band of raiders? Just your style.\n\n\nSunrise comes, and you set off into the world with your newfound band.\n\n\nTHE END", "action_results": []}, {"action": "I won't stoop so low. They're pathetic bandits.", "result": "Rage bubbles within you. They think that you want that position? That you'll forgive them of their crimes? You're not going to give them that satisfaction. Instead, you raise your sword, and with a sweeping blow, take out four of them with one swing. The others realize what you're doing and try to run. They don't make it very far.\n\n\nSoon, you're cleaning your blade in a stream outside of the forest, while binding your wounds. They did a number on you, but you suppose it's just more scars for the collection. It's almost comforting, in a way. Almost.\n\n\nThere's more injustice out there. If anything, now is the time to act.\n\n\nYou set out into the horizon, never once looking back.\n\n\nTHE END", "action_results": []}]}]}]}, {"action": "Take the trade route.", "result": "You take the path that eventually merges back onto the main roads. This is a common route for wandering merchants or supply caravans, with villages darting the path every couple of miles. The entire route itself from where you are is about 30 miles, where it runs into the city of Sodran and then disappears, assimilated into the highways.\n\n\nThe villages in these areas all make their profits in a variety of ways. Some survive off of hunting and gathering, others fishing, most farming. One village, from what you've heard, even makes money by hiring off the able-bodied men and women to traveling merchants in need of protection. Whatever gets the bills paid and keeps food on the table, you suppose.\n\n\nIt's an hour into your march that you come across the first village. There's an inn right on the edge of the town that's still open. The lit lanterns within seep through the windows, as if a beacon guiding weary travelers to the doorstep. On the side of the inn is a small stable, where some horses and a mule reside. The horses have everything from a simple saddle to a whole pack of belongings tied to them, and the mule has a pack of wares strapped to its back.\n\n\nYou can stop at the inn for the night. It would be nice to sleep in a warm bed. Still, you don't want to get distracted; you can just carry on through the night to put as much distance between you and your former estate as you can.", "action_results": [{"action": "I'll rent a room at the inn.", "result": "As you walk past the stable to the inn's door, a woman, looking to be in her late 20s, walks out of the stables. Her hands are calloused and her fair skin tinged red, no doubt from working under the sun all day. As she spots you, she looks surprised for a moment, before smiling. \"Oh, hello sir! Stopping at the inn for the night? I was just about to head in myself.\"\n\n\nYou grunt out something resembling a \"yes\", and she nods. \"The place is real nice, sir. My father runs it, I manage the stables for him. My name is Eliza, what would yours be?\" She extends a hand, perhaps thinking you'll shake it. You don't, and after an awkward moment she withdraws it.\n\n\nYou do, however, give her a response. \"Kit.\"\n\n\n\"That's a nice name, sir.\" She smiles at you still. You continue to frown. Eventually, her shining grin falters, and she looks worried. \"Something wrong, sir?\"\n\n\n\"I didn't come here to chat.\"\n\n\nHer face falls a bit more, but she regains her smile. \"Of course not, sir. I'm sorry if I held you up. Let's go.\"\n\n\n\"Right.\" You move to leave. Eliza follows after you, and you turn to look at her over your shoulder. \"Oh, and stop saying sir at the end of every sentence. Makes you seem uptight.\" Her face falls a bit at that, but she keeps her smile plastered on her face.\n\n\nAs you open the door to the inn, a pleasant warmth hits you in the face. You step inside, Eliza following after you. The entrance of the inn is empty save for a man behind a wooden counter up front, tapping the counter with his finger. He looks at you, and a smile makes its way onto his face, disturbing his bushy mustache. \"Ah, Eliza! Welcome back. Who's this, potential customer?\"\n\n\n\"Yes, father. His name is Kit. Kit, this is my father, Isaiah. Go on, sir... Um, I mean, Kit.\" Good, she caught herself.\n\n\nYou step forward to the man behind the counter, staring down at his sitting form. \"How much for a room?\" you ask.\n\n\n\"Just 5 gold pieces a night, sir. Throw in an extra coin for as many drinks as you can have.\" That piques your interest. You open your coin pouch and pull out six coins, tossing them onto the counter. The owner takes a moment to count them out, before he nods. He slips the coins into a lockbox under the counter, before grabbing a key from behind him. \"Very good, sir. Here's your room key, room 8.\"\n\n\nYou nod at him, taking the key from his hands and looking around. \"There's a dining hall to the right,\" Isaiah points to an archway. \"You can get your drinks there if you want. We have ale, wine, fruit juice, and water.\"\n\n\n\"Alright.\" You pocket your key, then head straight for the dining room. Heading through the doorway, you see that it's far more lively in here, different people milling about and sitting at different tables. You spot a few interesting folks, but one really catches your eye: a man with tanned skin, dressed in clothing made of brightly colored textiles. He must be a wandering merchant from the distant lands of Cikoni.\n\n\nYou wonder what he's doing here. Maybe he could use a guard, could get you a steady source of income and get you far away from the kingdom. Alternatively, you can just get your drink and sit by yourself.", "action_results": [{"action": "Speak to the wandering merchant.", "result": "Grabbing your drink, you head on over to the wandering merchant's table. You note a pipe hanging from his mouth, a strange crushed up substance within it; upon closer inspection, the substance appears to be sharp and jagged like glass, and glows a faint blue. You know what the substance is: Cikoni Crab Shells, a popular recreational drug hailing from the beaches of Cikoni. To make it, one has to find a Cikoni Long Crab, which possesses a strangely potent amount of magic within its shell, and kill it. Then, they crush it up, either to a fine paste or to shards like the merchant has it; from what you heard it determines how harsh the taste is.\n\n\nAs you stop to recollect your knowledge on what's within the pipe, a small flickering flame bursts from his fingertips with a snap. He sticks his finger into the crab shells, taking a moment to let the fire melt them down, and before long the pipe has been lit. He's a mage, though you should have expected that; most who hail from Cikoni are mages after all.\n\n\nYou slide into the chair across from him as he puffs on his pipe. He looks up at you, gives a little nod and speaks, \"Anything important, traveler?\"\n\n\nYou lean forward. \"I need work, and a way out of this kingdom. I can give you strong arms and protection if you hire me on. In exchange you don't ask about who I am or what I did.\"\n\n\nYou must have appealed to his shadier side, as the man smiles a bit. \"Ah, a man after my own heart, I see. I understand. Since I assume names are on the list of things I should not ask about, I won't. My name is Gi'anti, and I'm a traveling merchant of sorts.\"\n\n\n\"You can call me whatever you wish. I just need a way out of here.\"\n\n\nAt that, Gi'anti grins and lets out a puff of smoke. \"Well then. I shall call you T'kanka. Please, tell me your room number, so I may wake you when we set off tomorrow.\"\n\n\nWith your luck, that means rodent in their language. Still, it'll do. \"It's room 8. When do we set off?\"\n\n\n\"At dawn. Get some sleep, T'kanka, for you will need it.\" With that, Gi'anti extinguishes the Crab Shells and departs for his room, leaving you to finish your drink alone. At the very least, you got a way out of this kingdom now.\n\n\nYou finish your drink, head up to your room, and pass out in the bed not long afterwards. A few hours later you awake to a pounding on your door and dim sunlight shining onto your face through the window. You get up out of bed, and open the door. There, Gi'anti greets you. \"Ah, T'kanka. Was worried I'd have to knock your door down, for I almost thought you were dead in there.\"\n\n\nYou rub the sleep out of your eyes. \"Needed the sleep. We setting off now?\"\n\n\nGi'anti nods. \"Come along, T'kanka.\" He gestures for you to follow, which you do. He leads you out of the inn and to the stable, where he unhooks the mule you saw last night and grabs a lead. \"We'll be setting off through the woods and heading through to the city of Tolast. If we run into trouble on the way, you put that sword of yours to use, eh T'kanka?\"\n\n\nYou nod. \"Right.\"\n\n\nAnd so, the two of you walk off into the wilderness.", "action_results": [{"action": "Continue", "result": "Over the next week, the two of you make small talk. Gi'anti is an interesting fellow, with a lot to say on various herbs and plants you come across in the forest. One particular time, he points out a faintly red leaf, and says, \"That there is what they call sorem incenti, it's a medical leaf used for treating wounds caused by magic.\"\n\n\n\"Hm. So if, say, you threw a fireball at me, we'd just plant some sorem incenti on me and I'd be fine?\" Your response causes him to let out a laugh, which makes you frown. \"What's so funny?\"\n\n\n\"T'kanka, if I hit you with a fireball, all you'd need is aloe vera. I'm not a very accomplished mage!\" He continues to laugh heartily, and despite yourself you also let out a small chuckle. \"If I was a powerful mage, I wouldn't have need of your assistance, no?\"\n\n\n\"I suppose not.\"\n\n\nThe two of you continue on into the woods, bantering during the day and resting during the night. A few times you nearly let slip some of your old stories, but you doubt the man would care any for them. Plus, he silences you before you can get started on them anyhow. One night you almost mention your old friends when Gi'anti holds up a hand. \"I enjoy your company, T'kanka, but I'd prefer if our relationship be kept professional. No point getting attached if you're going to leave anyway.\"\n\n\nEventually, the two of you pass through the city of Tolast, Gi'anti selling some of his crab shells to anyone looking for a fix. He sells a particularly large amount to a noble passing through, who gives him a nice stack of gold coins in exchange. The mule is extra burdened from then on due to the sheer size of the bag of gold.\n\n\nEventually, the two of you cross the border from the Kingdom of Oren to the Empire of Kishak, after about a month on the road. \"I would appreciate if you would stay on my caravan, T'kanka,\" Gi'anti says while the two of you set up camp for the night. \"But I understand if you wish to leave. We've come far, and that was all you wished to do.\"\n\n\nYou have a decision to make. Will you stay on with Gi'anti, continuing your travels together, or depart come sunrise?", "action_results": [{"action": "Gi'anti has become something of a friend over this last month. I will gladly stay on the caravan with him.", "result": "You nod. \"I'll gladly stay with you, Gi'anti. Come hell or high water, I'll be here with you, my friend.\" With those words, you finish setting up your camp. Gi'anti grins brightly at you.\n\n\n\"I am glad to hear it, T'kanka...\" He pauses, pondering his next words. \"Do you know what T'kanka means, my friend?\"\n\n\nYou shake your head. \"No.\"\n\n\n\"It's the name of a legendary warrior, where I come from. T'kanka, the Wandering King. Able to slay an army with one swing of his sword, able to traverse thousands of miles in a single day, and able to survive no matter how many times he is struck. Of course, these are all myths, but T'kanka was a real man. Legend has it that after his death, his body denied this fact, and he continued to roam, forever.\" Gi'anti leans forward. \"I saw in your eyes the same spirit that I imagine T'kanka to have.\"\n\n\nYou suppose you must be flattered by that, so you crack Gi'anti a small smile. The two of you then begin to banter again, as you've done in the past month, and finally lay down to sleep. Come sunrise, the two of you will continue onward together. You know that you've made a brother for life in him, and you could not be any gladder.\n\n\nIn the morning light, the two of you pack up and leave, never once looking back.\n\n\nTHE END", "action_results": []}, {"action": "Much as I enjoy his company, I need to leave. I'll tell him as much.", "result": "You shake your head. \"I'm sorry, Gi'anti, but I must go. I enjoyed our time together but I need to carve my own path in this world. I'll leave come sunrise.\" With those words you finish setting up your tent. Gi'anti sighs, shakes his head a bit. Still, he smiles.\n\n\n\"Do you know what T'kanka means, my friend?\"\n\n\nYou shake your head. \"No.\"\n\n\n\"It's the name of a legendary warrior, where I come from. T'kanka, the Wandering King. Able to slay an army with one swing of his sword, able to traverse thousands of miles in a single day, and able to survive no matter how many times he is struck. Of course, these are all myths, but T'kanka was a real man. Legend has it that after his death, his body denied this fact, and he continued to roam, forever.\" Gi'anti leans forward. \"I saw in your eyes the same spirit that I imagine T'kanka to have.\"\n\n\nYou suppose you must be flattered by that, so you crack Gi'anti a small smile. The two of you then begin to banter again, as you've done in the past month, and finally lay down to sleep. Come sunrise, you may never see this man again. But you know that you've made a brother for life in him.\n\n\nIn the morning light, you leave, never once looking back.\n\n\nTHE END", "action_results": []}]}]}, {"action": "Just get my drink.", "result": "You decide not to bother the wandering trader, instead taking a seat at a table by your lonesome. Eventually, the trader gets up and leaves, heading back to his room for the night. You never see him again. After a few more drinks, you stumble out of the dining hall and up the stairs to your room. There, you throw your sword and knapsack to the floor, before passing out on your bed.\n\n\nIn the morning, you awake to a woman's scream. Groggily, you get up, heading to the door so you can see what the hell is going on - grabbing your sword along the way, of course. When you head down the stairs, you see a pair of thugs roughing up the owner, Isaiah. His daughter Eliza watches on, tears streaming from her eyes, as a third thug holds her back. The two harassing Isaiah stick a lit cigar into his face. This time, it's Isaiah who screams.\n\n\nThe thugs laugh at him, sadistic grins on their faces. Your stomach turns. This is disgusting.\n\n\nThen, one of the thugs turns his head and looks at you. He whistles, the other two looking at you soon after. One with a strange piercing in his nose lets out a laugh. \"Oi, you! Quit yer starin' and get outta here, chump.\" Perhaps you should do something about this, or not. After all, this doesn't involve you.", "action_results": [{"action": "The sick bastards. I'll strike them down.", "result": "You unsheathe your blade, pointing it at the bastards. One of them gulps almost imperceptibly, but the one who spoke to you just lets out another nasty laugh. \"Wanna play hero, eh?\" He callously drops Isaiah, pulls a mace from his side. The others follow suit, pulling out their own weapons; one has a curved blade, the other a pair of daggers. This should be easy.\n\n\nYou leap forward and swing, managing to decapitate the one with daggers easily. Blood gushes from his neck, before he falls to the floor, lifeless. This manages to scare the other two, but mace guy nudges sword guy, the latter nodding before rushing forward to cut at you. You don't bother to use your sword on him, instead ducking out of the way of his swing then tripping him up. Then you use the sword, cutting him right in half with one swing while he lies on the ground.\n\n\nAt this point, mace is quaking in fear. He drops his weapon, raising his hands and getting on his knees. \"I-I surrender! Please, don't kill me!\" You step forward, planning on delivering the killing blow...\n\n\nBut mace leaps up and pulls a dagger from his boot! His speed surprises you, and he manages to catch you with a glancing blow. Instantly, you begin to feel light-headed, almost unsteady. Still, you swing, cutting off his arm and wedging your blade deep into his side. He lets out an ungodly scream, then dies.\n\n\nYou grin, give a little chuckle. Then you collapse.\n\n\nWhen you awaken next, you're in a soft bed, a bandage wrapped around your wound. It throbs still, and your throat is parched. A soft groan escapes your lips, then you grunt out, \"water\", hoping someone may hear you. There's a slight shuffling, then a cup of water is handed to you. You look up at who gave it to you, and there stands Eliza. She smiles.\n\n\n\"I can't thank you enough for what you did... But you've brought trouble to the village at the same time. There was one watching outside, he told his leader about what happened. They came to town early this morning and said that if we don't surrender all our goods, they'll raze the place. We have until tomorrow to decide.\"\n\n\n\"Really...\" The word that escape your lips comes out less as a question and more as a statement.\n\n\n\"Yes, really.\"\n\n\n\"How long have I been out?\"\n\n\n\"4 days now. The dagger was poisoned. We got our healer to work on you, you should be fine if you rest another few days.\"\n\n\nThat gets you to jolt up, hissing slightly as you grip your wound. \"I can't. I have to leave.\"\n\n\n\"Please, just relax. You'll be better soon. We plan to surrender to them. And as far as they know, you're dead; we hid you well. You'll be safe to rest here.\"\n\n\nHmph. So they're giving up, simple as that? Back in your day the people would have fought back tooth and nail. What are you going to do?", "action_results": [{"action": "I'll leave. Now. There's no reason to defend those who won't defend themselves.", "result": "You pretend that you'll stay to rest, and convince Eliza you'll be fine by yourself. She leaves the room, and after a minute, you get up and search for your things. Thankfully, they left them right at the foot of the bed. Fools, probably didn't expect you to try and leave.\n\n\nYou get into your clothes and throw on your knapsack, securing your sword onto your back. You open the door, seeing that it leads outside; it's night time, which means your escape will be easier. Keeping down low, you sneak to the edge of the village, where you finally stand, noting that your escape went unnoticed. You prepare to walk away...\n\n\n\"So you are leaving.\"\n\n\nTurning, you see Eliza standing there. She looks sad, but smiles nonetheless. \"I knew you would. You didn't strike me as the type to be patient and rest. Am I right?\"\n\n\n\"Right.\" You turn your back on her. \"You won't convince me to stay. I'll recover on my own.\"\n\n\n\"I figured as much.\" She sighs. \"I wish you well on your travels, Kit.\" Then, she turns and leaves.\n\n\nYou continue onwards into the night.\n\n\nTHE END", "action_results": []}, {"action": "I'll defend them from the raiders come tomorrow. They need it.", "result": "You shake your head vehemently. \"No. I won't stand by while you all give in to worthless bandits. I'll stay, and fight them off tomorrow.\"\n\n\nEliza's eyes widen. \"You're still hurt! They're near fifty strong, if you fight them, you'll die!\" She's begging you particularly hard.\n\n\n\"I've fought worse odds. I can handle them.\" To prove your point, you get out of the bed and stand up, Eliza moving quickly to sit you back down. You shrug her hands off.\n\n\n\"Please, don't. These men will slaughter you.\"\n\n\n\"I can do it.\" You shoulder your way past her, to your knapsack. There, you slip into your clothing, and grab your sword. \"I'll watch for them. When they come, I'll kill them all.\" A bloodthirsty grin makes its way onto your face. \"Watch.\" Ignoring any further pleas from Eliza, you carry onward and leave the room. You see that it's a small hut, the only door leading directly outside; it's night, which means you have time to set up.\n\n\nYou go to the largest tree in the center of the village, scaling up it and sitting on a branch. There, you wait. And wait. Then you wait some more.\n\n\nThe sun is high in the sky, the villagers are out in the fields, and your ass is sore by the time the raiders finally do come. The villagers milling about pause in their work as they watch them, all with fear written on their faces. The raider leader, a large and burly man in chainmail, raises his arms up high. \"People of this fair village! We have come to accept your surrender. Should you resist, we'll kill all of you. So please, resist.\"\n\n\nIsaiah steps forward, head down low. You note the bandage on his cheek, where the cigar was jammed into his face. \"Please, don't harm us. We surrender. You are free to take all the supplies we have.\"\n\n\nThe raider leader lets out a small tsk, shaking his head. \"Really? That's all? How disappointing.\" You're about to jump down and attack him, when...\n\n\n\"I guess we'll just have to kill you anyway.\" The raider leader pulls out his sword and runs it through Isaiah's chest. Your blood begins to pump viciously. \"Kill them all.\"\n\n\nThat's when you finally jump from the branch. You were too late. Isaiah is dead, because you took too long to just jump down and kill them. You're no hero.\n\n\nYou land on top of the nearest raider, his head crushing beneath the weight of your boot. The others quickly turn their eyes to you and stare in awe. You unsheathe your sword, then start swinging with a primal yell. A few men are taken down by your blade, while the others go on the attack. You bring up your blade occasionally to block attacks, swinging when you see an opening. It's a slaughter for them.\n\n\nBy the time you take down a few dozen, the others begin to retreat. Their leader yells at them, calls them cowards, but stands his ground. \"FINE!\" He unsheathes a blade of his own. \"I'll do it myself!\" He goes on the attack, swinging the sword at you. You block it, then swing, but the raider manages to leap out of the way. Damn, if you weren't still recovering, you could have gotten him. Still, it's been a long while since someone managed to dodge one of your attacks. This should be fun.\n\n\nThe two of you continue on like that for a while; he strikes, you block, you strike, he dodges. It's almost like a dance between two experienced partners. This man, he's well trained, and a far better swordsman than you are. There's one difference though, and that is while you lack strength, you make up for it in raw power.\n\n\nIt also helps that you picked the winning side in this battle.\n\n\nSlowly, the villagers start to gather courage. Before you know it, rocks are being pelted at the raider. He ignores them well enough, but they throw him off enough that he starts to barely evade your attacks. Then, after a longer time, some start pushing forward with pitchforks and other tools in hand. They attack, but the raider attacks back and they retreat before they get killed.\n\n\nBut, their attacks are all you need, and soon, one of your swings eventually makes its way into his hip. He lets out a yell of agony, dropping his blade and falling into a kneel. You don't waste any time letting him have his last words, instead bringing the blade down right onto his head, bisecting it down the middle.\n\n\nThere is silence.\n\n\nThen, defeaning cheers.\n\n\nThe town is safe. You've done it.\n\n\nThere are no celebrations afterwards however. The bodies of the raiders are burned, Isaiah is brought to his daughter. The others return to their homes, some continue to work. Eliza picks out a plot in the cemetary, and the gravekeeper gets to work. You approach her as she watches. Her father has been set down in a coffin not far from the grave.\n\n\nHer eyes are red and puffy. She's been crying all day, no doubt. You place a hand on her shoulder. \"I'm sorry I couldn't save him,\" you say.\n\n\nShe turns to look at you, no malice whatsoever on her face. \"I know.\"\n\n\n\"What will you do now? Manage the inn?\"\n\n\nShe sighs, shakes her head. \"I don't know. My father was all I had.\"\n\n\nYou nod. \"... I'll leave you be.\"\n\n\nThen, you walk away.\n\n\nYou have a decision to make. Stay here in this village and live out the rest of your days, or continue onwards into the great unknown.", "action_results": [{"action": "I'll stay here. Perhaps I can help the people that way.", "result": "The next day, you knock on a random villager's door, and ask for a job. He knows that you saved the village, so he gladly gets you work tending to the fields. It's hard work, but they provide you with a nice home and let you take some of the harvest for food. It's a good way of life, you suppose.\n\n\nYou keep Eliza company when you're off work. She decided to stay in the town, managing the inn like her father before her. It takes her a while, but eventually, she's back to her usual self. Smiling softly, being as kind as possible, and working hard. But you see in her eyes that she won't be able to recover fully anytime soon. You know the pain. One may be able to put on the guise of being back to normal, but they'll never be the same deep down.\n\n\nYou continue to spend your days tending to the fields, visiting Eliza after work or on your days off, and making friends around the village. It's a nice life, you'd say. Eventually, you integrate so well into the village's society, that it's almost like you've been there your whole life.\n\n\nFinally, you are at peace.\n\n\nTHE END", "action_results": []}, {"action": "I'll leave. I defended the village, and now nothing is left for me here.", "result": "You spend the next few days in the hut where you were told to recover, Eliza visiting you every now and again. She's going to manage the inn, because that's what her father would have wanted. You make it no secret that you'll leave; she looks sad when you say you will, but accepts it nonetheless. You almost feel sorry for her, like you might stay if only to help her, but you know you can't.\n\n\nA few days later, you've fully recovered, and you pack up your things. As you step onto the open road for the first time in almost a week, it feels liberating. You missed this. But, before you go, you hear someone calling your name. Turning, you see Eliza, waving wildly. She smiles faintly, then calls out, \"Be sure to come and visit sometime!\"\n\n\nYou let out a laugh, then call back, \"I'll be sure to if I'm in the area again!\" With that, she heads back to the inn, and you continue onward into the great unknown.\n\n\nTHE END", "action_results": []}]}]}, {"action": "I'll just leave. Doesn't involve me.", "result": "You raise your hands, shake your head. \"Do what you will. I'm leaving.\" With those words, you make your way to the door. Eliza shoots a horrified look at you, Isaiah stares at you with pure hatred in his eyes. They must think you're an awful person. You're not; you're just doing what you have to in order to survive.\n\n\nYou exit the inn, leaving the bandits with Isaiah and Eliza. As you leave, you hear another scream, from Isaiah again. Can't be helped. Much as you want to go back in, sword in hand, you don't want to cause more trouble to the town by killing those bandits. All in all, you're doing this for the right reasons... Mostly.\n\n\nYou walk down the road, never returning to the village again.\n\n\nTHE END", "action_results": []}]}]}, {"action": "I'll continue on the road.", "result": "You pass the inn by, instead opting to continue on into the night on the road. Carrying onward for miles, you eventually lay down on the side of the road to sleep for the night. A few hours later you awaken to the morning light, and continue onwards, north to Sodran.\n\n\nYou've been there before, almost a lifetime ago. Back in your day the place was like a sapling surrounded by soot; attempting to grow, but suppressed by its surroundings. The metaphorical soot to the city's metaphorical sapling was the evil wizard you faced down. Try as you might, you could never forget the expressions on the faces of the downtrodden. They looked like they had nothing to live for.\n\n\nYou suppose you know know how it feels now.\n\n\nBy midday, the city is within sight after passing a few dozen villages or so. Great walls surround it, and tall buildings poke out from behind the walls. Stone steps lead up to a massive stone archway, which itself leads into the city proper. There's a statue at the base of the steps, the details of which you can't make out, but it looks like it's in decent condition from this far away. It's a magnificent sight, to be sure.\n\n\nOnce you're within a half mile of the city not an hour later, you finally notice something you couldn't spot from further away: a large camp encompasses the city. Strange. A quarter mile away you can make out shambling figures stumbling around the camp. Once you get close, not ten yards away, you can make out exactly what's happening.\n\n\nThe shambling figures all look to be malnourished and dressed in glorified rags. The adults sit around the camp looking defeated, a small number praying to whatever God they worship. A few children run around kicking a ball, but their expressions tell you that they've experienced too much. What the hell is going on here?\n\n\nYou go and speak to a guard watching them all, and ask him who these people are. His reply is to let out a dry chuckle. \"What, haven't been to this city in a while? These are the unfortunate bastards who were denied access to our fair city. Refugees and the like from the war with Kishak. Mostly natives to our kingdom, couple of Kishak bastards here and there.\"\n\n\n\"Is there any reason the Count of this city has it closed off?\" you ask. His response is to laugh again.\n\n\n\"There's an entry fee, two hundred gold coins. They,\" he gestures to the camp, \"couldn't cover it. Poor bastards, left to rot out here.\"\n\n\nWhat the hell? They couldn't pay some fee, so now they're locked from entering the city? At the very least you can pay it, but you suppose the question remains if you can just walk on by these people.", "action_results": [{"action": "I can't do that. I need to do something. Get them to rise up.", "result": "It pains you to watch these people carry on like this. Just wandering, barely any food, scarce shelter, and no chance of ever entering the city they're so desperate to live in. This Count of Sodran guy. You've never heard of him, considering the last time you were here the title was still \"mayor\". It doesn't matter who he's supposed to be, because you know that he's not doing this city any good.\n\nYou walk away from the guard and head to the nearest refugee. \"Do you have a leader I can speak to?\"\n\nHe looks up at you, a dejected expression on his face, and gives a weary sigh. He points to a tent that's larger than the rest. \"Hugo, the old man in there, is sort of our leader. He gets us jobs in the area and makes sure everyone is well fed.\"\n\nYou nod. \"Thanks for the info.\" With those words, you head to the tent, intent on pitching your idea to the leader. Opening the tent's flaps and stepping inside, you see that it's decorated scarcely. There's some small bedding in the corner, next to a chair and a small bookshelf. An old man with weathered features and a bushy beard sits in the chair reading a book.\n\nYou give a cough to break the silence, and he looks up, smiling at you. \"Oh, hello there. New to our fair camp?\" His voice carries a thick Kishak accent. Guess you know where he's from now.\n\n\"No. I came to speak to you about Sodran, and the Count.\"\n\n\"What about it, stranger?\"\n\n\"Have you ever thought about how many people you have here? It's at least a legion's worth, damn near a thousand from the looks of it. If you banded together... You could take the city.\"\n\nHugo looks a bit shocked by your proposal, but not disapproving of the idea. \"... Maybe we could, stranger. But what business do you have with us, or Sodran, or the Count?\"\n\n\"None at all. I'm just a traveler with too much time on his hands.\"\n\nHugo mulls your words over. He stares at you, as if trying to assess your reasons for approaching him with this proposition. Finally, he shrugs, and nods at you. \"Very well then. I'll organize the refugees... Did you come here just to plant the idea in my head, or do you want to participate in this... Uprising?\"", "action_results": [{"action": "I've come this far, might as well follow through. I'll join their uprising.", "result": "You nod your head. \"Yeah. I'll join you in your uprising.\"\n\nHugo smiles, and nods. \"Very well. You seem like you have the most combat experience out of anyone in this camp, anyhow! I was simply a baker back home, har har!\"\n\n\"Is there anyone here who can fight?\"\n\n\"A decent chunk, I'd say. Mostly defending themselves from any bandits back in their homes. I can take you to Rupert, he was a mercenary years ago. He retired four years back, but he may be willing to help you organize this.\"\n\nYou nod. \"I'll speak to him. What does he look like?\"\n\n\"He's a bit younger than me. He has a bushy mustache, bright red hair, green eyes. You'll know him when you see him, he always has a big smile on his face. In the meantime, I'll gather the others.\"\n\nWait. A Rupert with red hair and green eyes? Oh God, if it is him... Grunting in acknowledgement, you go on your way to find Rupert. It doesn't take you long, as you find him swinging his sword at a tree in the center of the camp. Oh great, it probably is him. Approaching him, you speak, \"Keeping your swordsmanship sharp?\"\n\nHe nods, not looking away from his practice. When he speaks, it's in a voice you know: \"Aye, I were a merc many years back! Ran me own company I did, paid well. I retired 'cause me wife wanted me to, but I still know 'ow to swing a sword 'round.\"\n\nGreat. It really is him.\"... Rupert. It's me, Kit.\"\n\nHe turns, and looks at you. His jaw drops along with his sword. Then, he's smiling widely. You're caught off guard by his speed as he rushes over to give you a hug. \"Kit, ol' buddy ol' pal! It's been too damn long ya jammy bastard!\"\n\n\"Yeah, Rupert. Too long. How've you been doing?\"\n\n\"Pretty damn well I'd say, 'side from the whole losin' my home thing! Dear God lad, it's been ages. Ye've gotten so damn old! Even I look better than ya, haha!\"\n\nDespite yourself, you crack a smirk. \"Really? At least I'm not soft in the middle like you, you old son of a bitch.\"\n\nHe chuckles. \"Alright, maybe I've gotten a wee bit out of shape in the last coupla years. Could still kick yer ass, I bet! Oh, they always left that outta the stories, didn't they? How I whooped yer ass the first time we met! Think I could beat ya if we did round two?\"\n\nThis makes you roll your eyes. \"Oh, yeah, you soundly defeated me with your brave tactic of setting a trap. Piss off.\" You pause, remembering why you came here. \"... Well, I'd love to chat about old times for longer, but I came here for a reason. I convinced the leader, Hugo, to start an uprising so you can get access into the city.\"\n\nRupert runs a hand along his chin. \"Did ya now? I've been thinkin' 'bout it myself to be honest with ya. So, I'm down. It'll be just like old times, eh Kit?\"\n\n\"Just like old times.\"\n\n\"So, when do we start and whadda we need to do?\"\n\n\"Whenever we're ready. Right now, I think we need to stock up on weapons. You know anybody who has some?\"\n\n\"Aye, that I do. There's a few people 'round here who have personal weapons, mostly shortswords and daggers. A few folks have stockpiles of them too, we could convince them to lend 'em out to the folks who don't have none.\"\n\nYou nod. \"Good. You organize this, they'll trust someone they know more.\" Rupert nods at your words, then continues on to the people who have weapons. In the meantime, you head back to Hugo's tent. When you arrive, you see that he's outside, addressing a crowd of refugees.\n\n\"People of this fair camp,\" he speaks in a low voice, enough for people in the immediate vicinity to hear, but not loud enough for it to reach the guards watching the camp from a distance. \"It is time for us to finally enter this city... By force.\"\n\nA few members of the crowd gasp at this, but are otherwise not opposed by the idea. It makes sense, you suppose; this city has kept them under its boot long enough. Hugo continues, \"This brave stranger here has finally given me the courage I need to carry this uprising out. Step forward.\" He points to you. You step up. \"You have spoken to Rupert, yes?\"\n\nYou nod. \"Yes. I spoke to Rupert. He's currently gathering people who have stockpiles of weapons so that they may be handed out to all of you who need them.\"\n\nHugo nods. \"Very good. And before you begin to wonder, my friends: yes. Some of you may very well die in this uprising. But the important thing is that the other refugees will enter the city in your place.\"\n\nThe crowd all nods at this; they know not to cause a scene when the guards are near. They then head back to their tents, where they presumably get ready. Rupert comes to meet you and Hugo soon after.\n\n\"I spoke to the people that got weapons,\" he says. \"They're all on board with the plan. This'll go right smooth like if we just keep on keepin' on.\"\n\nHugo nods. \"Excellent work, Rupert. What have you to say, stranger?\"\n\n\"When do we do this?\"\n\n\"Tonight. The guards won't be expecting it then. We'll strike tonight.\"\n\nYou give a grunt in affirmation, then head off to the edge of the camp to await nightfall. Hours pass, and soon, the sun has gone down and the moon has taken its place in the sky. No lights illuminate the camp; it's as if nothing is there at all. You push through the inky darkness and to Hugo's tent.\n\nThere, he reads by candlelight. You speak up, \"Hugo. Is it time?\"\n\nHugo nods. \"I do believe it's time.\" With that, he closes the book and stands, leaving the tent. One by one, the other refugees emerge from their tents as well. They must be better coordinated than you thought. With everyone gathered, you make sure you have their attention, then address them.\n\n\"We'll head through the front gates. I'll take out any opposition, I'll just need the others to watch my back.\" They all look apprehensive of the idea, but after a moment they nod. Still, you know well enough that they might bolt at the first sign of trouble. You gather up whoever's fit to fight, giving a grand total of nearly two hundred for the attack. Hugo decides to stay behind to make sure the others are fine.", "action_results": [{"action": "Continue", "result": "This late at night, there are no guards milling around outside the city. Your band of would-be freedom fighters ascend the stone steps up to the city gates, completely unnoticed. When you reach the gates, you see two guards ahead; one is watching a firefly intently as it floats around his face, while the other has fallen asleep while standing up.\n\nYou unsheathe your sword and rush forward, stabbing the firefly guard through the chest. He lets out a blood-tinged gasp of mingled shock and pain, before slumping over. You pull your sword out of his chest and swing at the sleeping guard, whose head rolls to the ground before he can even wake up. \"Open the gates,\" you order the others, and they move to do so.\n\nThe sound of wood grinding against stone greets your ears as the gates are opened. After a moment, they're open enough for you to slip through. Looking around, you see that only a few people roam the city streets, most of them guards. You turn your head over your shoulder to address the group, \"If I look like I'm in trouble, come help. Otherwise, stay back.\" With those words, you charge at the nearest guard with a swing.\n\nYou cut down a few guards before they even notice you're there. Once they do, however, shouting breaks the silence of the night as they alert each other to your presence. One grabs a whistle and blows it, the sharp sound tearing through the city streets. Whatever civilians are around quickly run away... And you notice a few refugees taking the opportunity to bolt as well.\n\nDamn those cowards! You should have figured, though: they're just peasants without a lot in life. They're not willing to die for their freedom. Hell, you're not even sure why you're fighting their fight... But you aren't one to quit something when you've started.\n\nYou continue to fight. Of the two hundred refugees that were fit to fight, a grand total of twenty stuck with you, with Rupert among them. The rest fled deeper into the city or back to the camp. It doesn't matter; what does matter right now is getting to the Count's manor and taking it down.\n\nYou continue to fight through the streets for what seems like days, but in truth was only about an hour. You cut down any guards that attacked, and the others watched your flanks and defended you when any got past your defenses. It works well as a system, but all good things must come to an end. One by one, your allies drop to the guards.\n\nBy the time you reach the Count's manor, four of you remain: yourself, Rupert, and two men you learn are named Karl and Frank. You don't bother with subtlety when you reach the metal gate in front of the Count's manor. Raising your blade up high, you slam it down upon the lock keeping it closed once, twice, three times, before it splits wide open and opens the way.\n\nThe moon illuminates the manor, casting a shadow on your quartet. No guards are there to greet you, which is strange. Looking around the courtyard leading into the manor, you notice a collection of barrels. Curious, you approach them, and read the labels on them.\n\nThey read \"gunpowder\".\n\nYou find yourself grinning. This will help. \"You three, grab a barrel and throw it inside.\" The others quickly move to help you, picking them up and heading to the door. You open it for them, finding it unlocked, and they begin to throw the barrels into the entrance hall.\n\nOnce most of the barrels are inside, you grab the last one and pull the cork off the top. You drain a line of gunpower out of it, leading from the door to where the barrels are placed. Then, you exit the manor and pull out your tinderbox. The flames burst forth, and the trail of gunpowder ignites, moving slowly to the barrels. You take the chance to run in the opposite direction.\n\nA moment later, there is a loud explosion, and the manor is set ablaze. Still, you keep on guard. There weren't any guards around, which is strange. As you're comtemplating, Rupert, Karl, and Frank are celebrating. \"Lighten up, lad! We blew up the Count and his damned manor! The city's free!\"\n\n\"Not quite.\"\n\nYou look up to see a man consumed by flames, floating above you. He begins to drop down, and you instantly roll backwards. The man on fire lands on top of Frank, smashing through his head and completely obliterating it. Karl and Rupert back away in terror.\n\n\"I don't appreciate what you did to my home. Die.\" He raises a hand, and slings a fireball at Karl. The refugee is consumed by flames, screaming all the while. Desperately, he tries to pat them away, but it does no good. He falls to the ground and rolls around in pain, his screeches of sheer agony lasting until his lungs collapse from the fire. Even then he's still alive, if only for a moment longer.\n\nThe man on fire turns to you. \"You. Die.\" He slings a fireball your way, but you manage to deflect it with the flat side of your sword. The fireball flies right back at him, and he recoils away from it for only a moment. Still, he laughs. \"You think you can kill me with fire? Really?\"\n\nHe snaps his fingers and the fire subsides. He's naked, athletically built with fair skin. His black hair is messy. Another snap, and now he's fully clothed with hair neatly combed. \"Tell me this, peasants. Why did you feel the need to burn down my manor?\"\n\nThis is the Count.\n\n\"Yer a bastard that's corruptin' this fair city with yer stench, that's why!\" Rupert answers for you, which makes the Count laugh heartily.\n\n\"My, you're something. An old drunk picking a fight he can't possibly win. Amusing.\" Then, the Count sighs. \"Oh well, I'm bored of you.\" A snap of his fingers, and then Rupert is sent flying into a nearby wall. You shout his name, but the Count turns on you. \"... Hm. You look familiar.\"\n\n\"I'm the man who saved this city, you son of a bitch! And I'm gonna do it again!\" you shout, readying your sword.\n\nThe Count laughs. \"Hoho, Sir Kit! I should have known! Come to slay the big bad Count, have we?\"\n\n\"You're not human! You're a... A monster!\"\n\n\"Demon, to be specific.\" He gives you a smug smile.\n\nThis son of a bitch, correcting you like you're a simple-minded peasant. You find yourself grinding your teeth together. Unconsciously, your grip on your sword tightens. As you're doing this, your eyes catch Rupert's as he picks himself up. He's still alive, if only barely. You can see the question in his eyes...\n\nHe's asking you if you want him to help you out.", "action_results": [{"action": "No. Rupert might die if he attacks. I'll do this myself.", "result": "Slowly, you shake your head. Rupert looks slightly worried, but nods. That settled, you turn your attention back to the Count. He gives a tsk, shaking his head and chuckling slightly. \"Colluding with your half dead pal? I'm not stupid or blind, you know.\"\n\nShit. Should have figured. Now you're glad you didn't bring Rupert into this. So, rather than try and fuck around any longer than you already have, you jump right into the fray. Swinging your sword at the demonic Count, you're not surprised when he catches the blade with his hands. You expected him to go for some blatant display of power like that. He just made a mistake.\n\nYou grit your teeth harder than you already were as you twist the blade. The Count is taken off guard by this and you manage to flip him onto his back. Yanking the sword from his grip, you raise it up high and swing down, cutting his head in half at the nose.\n\nYou let out of a sigh, thinking it's over, when you hear clapping behind you. \"Well done, Kit! Well done!\" You turn your head to see who's saying that...\n\nIt's the Count. Alive and unharmed. If you were any younger, you'd let out a gasp of shock and shout something like \"how are you still alive?!\" But you're not as stupid as you were. Instead, you release a weary sigh. \"Let me guess: demonic powers?\"\n\n\"You bet. No mortal can kill me.\"\n\nYou run forward and swing again. The Count blocks, but you continue to attack, until eventually you cleave him in half. He rises again. \"Give up, Kit.\"\n\nYour response comes in the form of a sword through his head.\n\nThe two of you dance like that for a while. Occasionally, he attacks, and it takes all you have to defend yourself. Even when he grazes you it's enough to nearly take you out of the fight. The only thing carrying you right now is adrenaline, passion, and pure unbridled hatred for this \"man\" and his kind.\n\nYou're not sure how long the fight lasts. You just know that right now you're keeping yourself held up by your sword. Your body is bloodied and bruised, and you're not sure how long you can keep going... That is, until you notice a strange black orb poking out of the Count's chest.\n\nHis heart.\n\nHe doesn't notice, because he simply awaits your next attack. \"Looks like your wounds are catching up to you, human. Next time you strike, I'll bring you down.\"\n\nYou're going to have to make this one count.\n\nPicking up your sword, you make as if you're going to swing, and run at the Count. He's already moving to intercept your swing, when you quickly shift and run your sword through his heart. A look of shock makes its way onto his face, and he swings a clawed hand at your face. It claws off a good chunk of your head, including your left eye, but you don't give a damn. You've got him now.\n\nYou pull the blade out once he hits the ground. He's not getting up from that. You almost feel like you're about to fall over and die yourself, but you raise your blade up high for the final attack. He raises his hand feebly. \"W-wait, d-don't...\"\n\nYou swing.\n\nThen, you collapse.\n\nRupert rushes over to you. His face is a mask of horror and sadness. \"Kit... Oh God, lad. What the Hell were you thinkin'?\"\n\n\"Just... Being a hero... One last... Time.\"\n\n\"I... I want to say help is coming, Kit. But Lilith ain't 'round no more.\"\n\nDespite yourself, you let out a chuckle. It causes you more pain, and your words come out weaker. \"Don't... Worry... Gonna be seeing her... And Henry... And Thomas... And... Grace... Soon.\"\n\nTears are streaming down Rupert's face. \"You were always such a damned fool, lad.\"\n\n\"Heh... May... be...\"\n\nYou let out your last breath.\n\nIn the coming days the guards are wiped out by the refugees. You become a martyr for their cause, drawing support from the townsfolk who worshiped you like one of the Gods. Soon, the rebellion takes over Sodran, allowing any and all who need shelter into the city.\n\nThis proves to be its downfall in the coming years.\n\nThe city can't handle the massive influx of people. Overpopulation becomes an issue. The homeless rate spikes, as there aren't enough jobs to go around. As such, crime rises as well, and soon the majority of the city is comprised of criminals.\n\nSodran's reputation shifts from a glorious beacon of light to a city of thieves. No one wants to go there anymore, for fear of their coin purse and their life. The merchant and trade caravans passing through the city disappear one by one until none are left, and the city's income goes with it.\n\nWith the rise of overpopulation, homelessness, and crime, it's no surprise that the rate of diseases the citizens catch increases as well. Eventually, damn near the whole city is infected with a dangerous plague for which there is no cure. The city is quarantined off by the King. When the last citizen dies, Sodran is razed, and no trace of its existence is left but rumors and closely kept records.\n\nThis matters not to a dead hero such as yourself. In death, you find peace. In death, you see them again. In death, you are happy.\n\nDespite what most religions on your world would like people to believe, there are no pearly gates or fluffy clouds in the afterlife. There is no fire and brimstone. There's not even a blank void of nothingness. Instead, there is bliss, with fallen friends gathering around you to celebrate your reunion with them.\n\nIt's the ending that a hero deserves.\n\nTHE END", "action_results": []}, {"action": "Yes. I need all the help I can get.", "result": "You nod your head, indicating you'd appreciate his help. Rupert gulps slightly, indicating his hesitation, but nods back to you. Slowly, he gets up, approaching the Count with shortsword in hand. You keep the Count busy by attacking him ruthlessly, waiting for Rupert to attack.\n\nAfter several grueling moments, Rupert reaches the count, aiming his sword for a backstab...\n\n... But the Count turns around and blows Rupert away with a blast of telekinetic force! Your jaw drops at the sight as Rupert hits the wall hard, blood spurting out of his head. \"RUPERT!\" you call out. The Count turns back to you. His expression is smug.\n\nA blood-curdling scream of rage flies out of your mouth as you swing relentlessly at the Count. You continue to wail on him, and despite his best efforts, he can't manage to make an attack against you. The only thing keeping him alive is his demonic nature. Any other man would have fallen to this onslaught by now.\n\nYou must've been hacking at him for about half an hour when you notice something peeking out of his chest. It's a black orb. His heart.\n\nHis heart is exposed. Maybe that's what you need to destroy to kill this monster. So, you continue to attack as you've been doing, and the Count continues trying to defend. Finally, you rear back, and stab his heart with a roar of anger.\n\nThe rotting organ explodes in a mess of black ooze when your sword pierces it. Falling to the ground, the Count stares at you in disbelief. Despite your furious attacks that he couldn't defend himself from, he must have figured you'd never be able to kill him.\n\n\"Wai-\" You don't let him speak, instead slicing his head in half.\n\nWith that done, you rush over to Rupert. You expected him to have held out somehow. You could have saved him, or at the very least exchanged some parting words. Instead, you find that he's dead, and probably was not long after he hit that wall. His eyes are widen open. You reach down and close them for him.\n\nYou conquered the city. You don't care enough to inform the cowards that sent you on this mission. So, instead, you leave, and never return.\n\nA week after your killing of the Count, you hear news from Sodran while drinking at a pub in a village with no name. The refugees rose up and wiped out the rest of the guards, declaring that the gates to the city were open... However, those who lived within the city were having none of it.\n\nThe refugees attempted to claim that you helped them to bolster support. After all, the townsfolk adored you for saving the city in the past. And while you did indeed help them, you didn't stay behind to prove it, and as such the townsfolk had no reason to believe the refugees. The refugees were driven out of the city or killed, and the people of Sodran elected a new count, as the former one had no heirs.\n\nNeedless to say, the uprising's victory was rendered moot not long after they took the city. A dark chuckle escapes your lips. Well, can't say you didn't try. You finish your drink, pay the barkeep, then leave the bar.\n\nTHE END", "action_results": []}]}]}, {"action": "No, I don't think I will. The idea was to give them the push they needed, not participate.", "result": "You shake your head. \"All I wished to do was push you in the direction of uprising. Now that you're planning on it, my work here is done.\" Without another word, you exit the tent, leaving Hugo slightly baffled by your bluntness. Taking a look around the camp one last time, you depart, heading off down the road.\n\nA few weeks later you're drinking at a pub in a town with no name. A man rushes in, and brings you all news of an attempted uprising in Sodran. It fell apart rapidly due to a lack of discipline within the troops; for every soldier they killed, they lost ten of their own. What should have reached the Count's manor instead ended two blocks from the city's entrance.\n\nThere were no surviving refugees.\n\nThe news makes you shrug. No skin off your back. It was their own faults for rushing in without a plan. You finish your drink and order another. When the second one's done, you pay the barkeep, and head out the door. Tomorrow you should be nearing the Kishak border. It should be nice this time of year.\n\nYou walk off into the sunset.\n\nTHE END", "action_results": []}]}, {"action": "Yeah I can. I'll continue onwards.", "result": "You nod to the guard, gritting your teeth slightly. \"Good thing I have enough gold then.\" He lets out another bark of laughter, then waves you on, not bothering to reply. Likewise, you continue on without another word, closer to the stone steps of the city.\n\nApproaching the stone steps, you can finally make out the statue you had seen earlier. To your surprise, the statue depicts you. While you never wore the shining armor they present you in, and the sword is far to small to be your own, the facial features are too similar for it to be anyone else. Looking it over, you see that it's covered in bird dung, and there are many chips and cracks in the marble.\n\nYou clutch your hand tightly. Of course, the statue couldn't have depicted anyone else. Couldn't have been the king, couldn't have been the count, couldn't have even been some sort of God. It had to be you. Taking in a breath and releasing the death grip you have on your palm, you push on past the statue and up to the steps. A guard stands there gripping a spear. Behind him is a large oak door, leading into the city proper.\n\nHe blinks at you and lets out a mix between a yawn and a sigh, before speaking, \"Two hundred gold for entrance into the city, sir.\"\n\nYou pull out your bag and rifle through it, before handing him four pieces of gold, each worth fifty. He counts them out, even chews on one to ensure its authenticity, before nodding. \"Very good, sir. Welcome to Sodran.\" He pushes the doors open, and lets you through.\n\nStepping into the city, you find that it's grown substantially since your last visit to it. Large buildings rise high into the sky, faded signs declaring what they're all for. People bustle through the streets, going about their own business, while merchants hawk their wares. Guards stand at every corner, keeping a watchful eye on the citizens. Shady looking people hang around alleyway entrances; unconsciously, you keep a tighter grip on your coin purse.\n\nSo much to do, so little time. But I suppose the question I should be asking is if you wish to do something about the state of the city, or if you're just here to explore.", "action_results": [{"action": "I'm heading right for the Count's manor. I'm going to do something for those refugees.", "result": "You might not have tried getting the refugees to rise up, but you can fight this battle without having to put innocent lives at risk. This Count of Sodran guy. You've never heard of him, considering the last time you were here the title was still \"mayor\". It doesn't matter who he's supposed to be, because you know that he's not doing this city any good.\n\nDipping through the crowds of people, you climb a set of stone stairs up to what appears to be a park overlooking the entire city. Hugging the north wall in the distance is a manor, taking up damn near an entire block and looming over the city streets. That's got to be the Count's manor. Nodding to yourself, you begin to make your way to it.\n\nAlong the way, you spy a few guards cornering a man in butcher's clothes. The butcher is an older man, with thinning hair and a physique reminiscent of a skeleton. Sweat drips down his brow, and he gives the guards an uneasy look. \"I-I swear, I'll pay the Count! I just need another week! Please, this shop's all I got left!\"\n\nOne of the guards gives him a nasty grin. \"Well ya shoulda thought 'bout that 'fore ya gotta loan. The Count don't take too kindly to old weasels who don't cough up what they owe.\" He brings his fist up to the butcher's gut, causing the older man to fall to his knees. Then, the guard backhands him to the floor. \"Ya got till the end of the day to get that money.\" With those words, the guards walk away.\n\nIt takes all your willpower to not fly into a frenzy and attack them. Instead, you wait until they've moved on, then approach the butcher who's regaining his footing after the attack. \"How much?\" you ask.\n\n\"What?\" the butcher replies, looking at you suspiciously.\n\n\"How much do you owe?\"\n\n\"Five hundred. I needed a loan of one hundred to pay for my daughter's medicine... But she died even with it.\" The butcher pauses to wipe away a tear threatening to escape his eye. \"... I try to pay the Count back, but he keeps raising the price, further and further... I can't keep up. At this rate, I'll lose my business.\"\n\n\"Sorry to hear about that.\" You pull out your coin purse, then throw him a handful of gold coins worth one hundred gold each. \"Take these. Gather everyone you care about and leave. You don't want to be around for what I'm going to do.\"\n\nThe butcher looks frightened by that, but nods, accepting the money gladly and quickly rushing off. You watch him go, then release a sigh through gritted teeth. When you came here, you were hoping to be able to resolve this issue using diplomacy. It was never your strong suit, but your fame, much as you hate it, would be useful in this situation.\n\nNow, though? You're going to kill this Count, or die trying.\n\nIt's an hour and several similar incidents later that you finally arive at the gates of the Count's manor. A few guards mill about the front, and you draw their attention by pounding against the steel gate. One of them approaches, staring at you with a nasty grin. It's the one from earlier, with the butcher. \"Well? Whaddya want?\" he asks.\n\n\"I'm here to see the Count,\" you reply.\n\n\"Really? The Count don't let no middle-aged bums in to see 'im. Get lost!\" He spits in your face.\n\nYou keep your rage contained, gritting your teeth and giving him a toothy smile. His grin falters. \"Tell him that it's Lord Kit of Droburg. You know. The guy on that statue outside.\"\n\nHe gives a nervous chuckle. \"O-oh, you're Lord Kit, eh? How do I know you're telling the truth?\"\n\n\"Because if you don't let me in, I'll cleave you in half.\"\n\nBetween your expression, the threat, and the fact that you haven't even bothered to wipe off the saliva that's starting to drip down your cheek, the guard is thoroughly terrified. \"R-right, apologies Lord Kit, I'll let you in...\" He opens the gate slowly. The creak of metal against stone splits through your ears. Your hand itches, begging for you to unsheathe your sword.\n\nYou do.\n\nYou reach up and grab your blade off your back as soon as the gate is open wide enough for you to walk through. With a swing, you slice through the guard's waist, the force sending his torso flying high into the air as he lets out an ungodly scream. His torso meets the floor with a meaty thud. He's still alive for only a few moments, gasping for air as blood leaks out of his mouth. Then, he lets out his last breath.\n\nThe other guards are quick to notice their fallen comrade. None of them carry ranged weaponry, just swords, axes, and batons. They all begin to run at you, weapons raised. Judging by your quick assessment of the odds, it's fourteen to one. Despite yourself, you can feel the sadistic grin on your face widen.\n\nThis will be too easy.\n\nA primal yell bursts out of your throat, and you rush forward to meet the guards head on. It's easy enough to deflect a few blows, and with each swing you bring at least two men out of the fight. It doesn't last long, and within minutes, the manor's courtyard is covered in blood, guts, and corpses.\n\nYou enter the manor, sparing but a glance to the carnage you left behind.", "action_results": [{"action": "Continue", "result": "You fight your way through the manor to the great hall, where you expect the Count will be. When you reach it, however, you find it empty. The Count must be elsewhere. So, you continue to hack and slash your way through, checking every room in an attempt to find the bastard.\n\nIt's only after a dozen men have died and you yourself have suffered several wounds that you find him. He's sitting calmly in his study, reading a book, perhaps unaware of the fighting that had been going on outside. You readjust your grip on your sword, then bark, \"Hey!\"\n\nHe looks up, sighs, then slips a ribbon into the book on the page he was on. Shutting it and placing it down on a table, the Count stands, and gives you a small smile. \"My apologies. I got so absorbed with my reading, I must not have heard you.\" He stands a good few inches below you, dressed in fine silk clothing with various pieces of jewelry adorning his body. Truly, he's a pompous asshole.\n\nYou stare at him in disbelief. \"Deaf and corrupt, huh?\"\n\nHe frowns. \"Whatever do you mean?\"\n\nYou grit your teeth so hard you feel like they might crack. \"You've been running this city into the ground long enough. I didn't save this Goddamn world so its rulers could become just as bad as the man I saved it from.\" You raise your sword, point it at him. \"I'm going to cut you down.\"\n\nThe Count looks confused for a moment, and he studies your face. Then, it clicks, and he sighs. \"Lord Kit, is it? I see. So you've finally decided to come out of retirement. I knew this day would come.\" He turns his back on you and approaches his bookshelf. Picking one out, he turns it over in his hands, then shows it to you. The cover is faded, but the words clear as day.\n\nIt reads \"Sir Kit Against Alistair\".\n\n\"This was one of my favorite books, y'know. You seemed so pure, so flawless.\" He flips through it a bit. \"But it's clear that reality is far from the truth. How much blood have you shed today?\"\n\n\"I cut down dozens of your guards to reach you.\"\n\n\"Ah. It would seem you live up to the tales in that regard then.\" He turns the book over more, before placing it back. \"Let's test another aspect of those tales. It was said that Alistair tried to tempt you with unlimited power, but you turned it down. Was that true?\"\n\nYou snort. \"Of course not. As soon as Grace and I entered that throne room of his, we were fighting for our lives. No time for words.\"\n\n\"So it would seem. But if he did offer you that power, would you have accepted?\"\n\nYou're not sure how to respond.\n\nThe Count smiles. \"I'll make you an offer. I'm very talented in... Certain aspects of magic. You miss your friends, no?\" He snaps his fingers, and a portal is opened to you. What's inside you can hardly believe.\n\nYour friends. All of them. Henry, strumming his lute. Thomas, sharpening his daggers. Lilith, reading holy scriptures... And Grace, sitting there and playing with fire as she always did.\n\nYou reach out to them, let out a yell of pure shock and happiness despite yourself. A mixture of awe and sheer joy making its way onto your face. It's them! They're alive! By the Gods, they're alive, like they should be!\n\nThen, the portal closes. You shift back towards the Count, having forgotten he was even there. He gives you an enigmatic smile. \"It seems that seeing your companions again got a reaction. I can take you to them again. You can relive your quest, make things right.\"\n\nYour voice is shaky as you reply, \"You're... You're not planning anything? I can fix things... Right?\"\n\n\"That you can. But only if you spare me.\"", "action_results": [{"action": "I accept in a heartbeat. I need to bring them back!", "result": "In an instant you reply, \"Yes! Yes! For the love of the Gods, let me make things right! Please!\"\n\nHis smile widens. \"I was hoping you'd say that.\" The portal is summoned again... Only this time, your friends on the other side notice it, too. They approach it, staring in awe.\n\n\"What in the world...?\" Henry asks, staring through. He spots you, and points. \"Woah, guys, doesn't that look like Kit?\"\n\nThomas lets out a derisive snort. \"Can't be. Too old. Then again, we just saw a crazy ass portal open up before our eyes, so it could be.\"\n\nLilith places a hand on her heart and takes in a few deep breaths. Then, she speaks, \"I think... This might be a portal to the future. I wonder...?\"\n\nGrace is staring at you. Those big, brown eyes staring into your own grey ones. Searching for something. Whatever it is, it seems she's found it.\n\nShe reaches for you. You approach her, taking her hand. Her other hand reaches up to touch your face.\n\n\"You look tired, Kit,\" she says, and you let out a laugh, because you know it's true.\n\n\"I sure as shit am.\"\n\nThe portal closes behind you as you step through it fully.\n\nThen, everything is fire.\n\nOne by one they fade away. Your eyes widen in shock. What the hell? You look down, and find that your clothes are igniting, your flesh is slowly peeling and melting off the skin.\n\nYou do the logical thing and scream in sheer agony.\n\nYou scream until all the air has left your lungs, and even then, you're trying to with all your might. It is only after your lungs and larynx have been fried to a crisp that you can't even attempt to scream. There is only fire, faint voices, and silhouettes you can't even see.\n\nThere's laughter in the distance. Then, a booming voice all around you.\n\n\"Welcome to Hell, hero.\"\n\nTHE END", "action_results": []}, {"action": "... No. The Count is playing a trick on me. I won't let him.", "result": "You look longingly at the portal for a moment. It's tempting, oh so tempting, but you know that whatever lies beyond it is a farce. The Count is trying to trick you, offering you something he knows you would want, but you won't take the bait.\n\nYou give your companions a stony face. \"You're not real.\" Then, you turn to the Count, and swing at his head.\n\nThe sword cleaves through his dandy face, completely knocking off the top half. He stands stone still for a minute, as if his corpse is denying his death, before falling to the ground. The portal closes, and with it, the image of your friends.\n\nSighing, you place your sword back onto its sheath, and exit the room.\n\nBefore you stands the Count, alive and unharmed. He smiles, but instead of a small and enigmatic smirk, it's a large and goofy grin.\n\n\"Well done. You resisted my temptation. Not many have ever done that.\" He walks around you, examining you, while you stand there still reeling from the shock. \"I wonder. How did you know that wasn't real?\"\n\nAfter taking a moment, you respond, \"You're too much of a bastard to give me what I really wanted. It was a test. One I passed, apparently.\"\n\n\"Yes, yes it was, Kit. I'm impressed that you sussed that out, really. I suppose you're going to want to kill me again?\"\n\nWithout another word you unsheathe your sword again and swing. He's cut in half this time. Then, the Count approaches from behind. \"It's pointless, Kit. A mere mortal like you? You can't kill me. Just hear me out.\"\n\n\"What!?\" you bark out.\n\nThe Count laughs. \"I have a final offer. No tricks this time. I will give you a way out of this country. A key to a nice home on the Cikoni shoreline. The place will be stocked with food, alcohol, water, whatever you need once a week. Other than that? There will be no one who knows you're there.\"\n\nYou frown. \"And in exchange?\"\n\n\"In exchange, you leave Sodran and this Kingdom. Don't even return. You've been enough of a thorn in my side today.\"\n\nThis offer is much more down to earth and, therefore, more believable. Still, you're wary of any tricks.", "action_results": [{"action": "He admitted he was trying to trick me with his earlier offer. No more. I'll strike him down until finally, I kill him for good.", "result": "You answer his offer with another swing of your blade. This time, he simply forgoes his reappearance act and rises up again. He uses his hands to put his head back in place, and soon, the flesh has knitted back together and he's back to himself. The Count gives a tsk; lets out a sigh. \"I hoped you would accept. I was being earnest, you know. Not many get that honor from me.\"\n\n\"I don't believe you. You're inhuman... A monster. What the hell are you?\"\n\nHis small enigmatic smile returns to his face. \"The answer lies in your question. What the hell am I? I come from Hell.\"\n\n\"... You're a demon.\"\n\nHe lets out a small chuckle. \"Exactly. And I hope you know, you'll never kill me.\"\n\nYou go back to gritting your teeth in rage. This time, your grind them together so hard a piece of one of your incisors chips off. \"I've killed enough men to know that all you need to do...\" You swing, chopping his legs off. \"IS KEEP SWINGING!\"\n\nYou chop his corpse to bits. He comes back from behind you. You keep hacking. He keeps coming back. You keep slashing. He rises again with a laugh. You keep stabbing. He continues to laugh. You keep chopping. He rises without a scratch. Eventually you start bashing him with the flat of your blade. It doesn't keep him down.\n\nBut through the constant fierce attacks, you see that pieces of his chest have fallen off to reveal a glowing black heart. That's your ticket. You move your eyes from it before he notices. Right now, the Count is too busy chuckling madly to do anything.\n\n\"Alright... Alright, I think you've had your fun.\" He smiles. \"This is the end, Kit.\"\n\nHe snaps his fingers. Flames burst from beneath you. Acting quickly, you roll away from them, and watch as they begin to consume the floor and walls of the hallway you're in. Your cloak is on fire, but you pat it away, and focus on your target.\n\nHe's standing there. Smiling that damned smile.\n\nYou can't wait to wipe that smirk off his face.\n\nDeep within you, a scream builds up and lets loose. You dash at him, acting as though you're going for a swing. He opens his arms wide, awaiting the fruitless swing...\n\nThen, you bring the sword back and ram it into his heart.\n\nUnlike your other attacks, this gets him to look shocked. Black ooze slowly drips from his lips. You kick him away, and he lies on the ground, staring at you in awe.\n\n\"H-how?\" he chokes out.\n\nYou don't give him a response. Instead, you pull the lantern oil from your pack and dump it all on him. He whimpers something, probably a plea for his life. You ignore him. Pulling your lantern from your hip, you ignite it...\n\nThen smash it onto him.\n\nThe flames begin to consume him. He lets out a gurgling screech of agony. You grin at that scream. The rest of the fire rushes to meet him.\n\nYou step past his flailing, burning body, and descend to the entrance of the manor. You see that the fire is spreading quickly, burning through the wooden building rapidly. His screams have long since died down.\n\nOutside there are guards waiting for you, staring in terror at your blood-stained body. You raise your sword, but instead, they step aside. The expressions on their faces range from terrified to relieved.\n\nYou leave the manor courtyard and disappear into the panicking mass of people in the streets. The guards stare at you in shock. They know that you did it, they know that they should apprehend you, know that you should be hung for your crimes. Still, they don't move out of fear of what you'll do to them.\n\nYou leave the city and never return.\n\nTHE END", "action_results": []}, {"action": "I'll take his offer. I just need to get out of this place.", "result": "You have nothing to lose but your life. Maybe you do need to leave this place behind. You don't even know why you're doing this. Some futile attempt to be a hero one last time? Or maybe you're just trying to sate your bloodlust.\n\nWhatever it is, you're tired of fighting. You just want to hide away until the end of your days. Maybe, this offer is what you need. Maybe...\n\nYou nod your head. \"I accept your offer. I'll leave, and never return.\"\n\nThe Count smiles. \"Good. Here.\" He snaps his fingers, and a key materializes from thin air. \"The key to the property.\" Another snap of his fingers, and a portal opens, revealing a pathway to a nice cabin. \"Step through. No tricks this time.\"\n\nWarily, you accept the key, and step through the portal. Your feet meet sand, and the portal closes behind you as soon as you're all the way through. You stand there a moment, waiting for some sort of attack, or for the scenery to shift into something nightmarish...\n\n... But it never comes.\n\nAfter a while, you head towards the cabin and unlock it. Stepping inside, you see that it's nicely decorated with rustic furniture and paintings adorning the walls. You head into the kitchen and find that it's stocked with bread and wine, and that's all you really need.\n\nYou stay there for days awaiting a painful shift in scenery. Those days turn to weeks, then months, then years, then decades. Nothing happens. Guilt eats you away a bit, you were so close to toppling a tyrannical government, only to back off and accept a bribe. Still, you have to say, it's certainly nice out here.\n\nYears later you finally pass away quietly in your sleep. It's the best a \"hero\" like you could hope for.\n\nTHE END", "action_results": []}]}]}]}, {"action": "The Count doesn't matter. I came here to get away from fighting, not to get involved in more of it. I'll look around.", "result": "You decide not to interfere with the Count, instead opting to explore Sodran. It's been a while since you've been here. Briefly, you wonder how much has changed; obviously it's grown a lot, but are any of the old stores still open? You recall a store run by an older man, which sold the best wine you ever tasted. Is he still alive, or did his son take over the store like he wanted?\n\nShaking your head, you reason that you'll just have to find out, and begin to explore. Most of your knowledge of the city hasn't aged well, since more buildings have sprung up and some roads you used to know are gone now. Still, your knowledge holds true when you find the old store you knew. The sign reading \"Louie's Supplies\" is faded and the wooden door is cracked, but it's still the same place.\n\nStepping through, you find a bored looking young man standing behind the counter. Looks like you were right about his son taking over. He perks up as soon as he sees you, and smiles. \"Ah, a customer! It's been a while since one came through.\" He studies your face for a moment. \"... You look familiar, traveler. Do I know you?\"\n\nYou grunt. \"Probably not. I have one of those faces.\"\n\nHe shakes his head. \"No, no, I do know you... You helped my father deal with thugs that were harassing him. Twenty years ago...\" Then, he gasps, as if finally realizing who you are. \"You're Sir Kit the Brave! The man who slayed the vile wizard Alistair!\"\n\nDespite yourself, you face twists into a scowl. \"Don't go screaming it from the rooftops.\"\n\nHis own smile drops. \"Oh. Apologies, Sir Kit.\"\n\n\"Yeah... Look, I did know your father, and I did help him out, but I just came here to see if the place was still around. Glad it is...\" You can't help yourself, and soon ask, \"Is your father still alive?\"\n\n\"No, sir. He died five years ago, when I was nineteen. I inherited the store. Didn't wanna see it run into the ground, but...\"\n\nYou're gonna hate yourself for asking this. \"But?\"\n\n\"... I don't want to run this store. I want to go out into the world, go on an adventure, like you did. When you came and helped my father with those thugs... I knew exactly what I wanted to do. I wanted to be a hero.\"\n\nThat makes you sigh and pinch the bridge of your nose. Great, now you've got a fanboy telling you he wants to be a \"hero\", like you were.", "action_results": [{"action": "Discourage him. Being a hero's not all it's cracked up to be.", "result": "You take a moment to think about what you want to say. After a moment, you begin to speak, \"Look, kid. Adventuring isn't all that fun. It can be brutal. I had to cut down my fair share of men when I was younger, and while I can live with it, not everyone can. Just keep the store running, like your father would've wanted.\"\n\nThe shopkeeper's face falls. He lets out a sigh, but nods. \"... Right. I should probably keep doing that. Settle down, find a wife, too. It's just that ever since I took over the store, no one's coming here anymore. I guess I just don't manage it as well.\"\n\n\"What do you mean? Is there any competition or something?\"\n\nHe nods. \"There's another store across town that opened before my father died. People went there, but they came here more often, because they trusted my father. Now that I've taken over, people don't shop here as much, if at all in a few cases. They don't know me as well as they did my father, so I might as well be another stranger to them... If people come here these days, it's because they want to save time rather than walk across town.\"\n\nYou ponder for a moment. Maybe you could get people to start heading to this store more often? You have your fame to use to your advantage, maybe if you recommend it, more people will come. Alternatively, you can just ignore the boy and leave. You've spent too much time in this town already.", "action_results": [{"action": "I'll give the store my commendation. That will get people to shop here.", "result": "After a moment of mulling it over, wondering if you should bring this much attention to yourself, you come to this decision. \"I could help you out. We can use my fame to get people to come here. Everyone loves me, for whatever reason, so if I gave your store my commendation they'd shop here.\"\n\nThe shopkeeper's face lightens up immediately. \"Y-you'd really do that for me? You're serious?\"\n\n\"Sure. It'd help you out. I didn't go through those thugs just so this place would have to close down.\"\n\nTo your surprise, the shopkeeper jumps up and hugs you from across the counter. You awkwardly pat his shoulder, as he blubbers into your own. \"Oh by the Gods, thank you, thank you so much! I don't know how I can ever repay you!\"\n\n\"You'll repay me enough by keeping this place open... And giving me as much of that Cikoni wine as I can carry.\"\n\nThe shopkeeper pulls away from you with a small smile. He wipes the tears away from his eyes... Then pauses. Chuckling nervously, he asks, \"Uh... Do you mean the Cikonus Vineyard Wine?\"\n\nYou frown. \"Yeah. What about it?\"\n\n\"We uh... Lost contact with the makers of that wine, about ten years back. We don't sell it anymore.\"\n\nYou grumble. \"... Perfect. Just perfect.\"\n\nNot long after, you leave the shop and look around outside. You told the kid to stay inside, because you'd get the customers in there. As you search the marketplace, you find that there's a large chunk of townsfolk milling about. Some are in a hurry, others taking their time checking each shop out.\n\nRaising your voice, you begin to shout, \"My name is Sir Kit of Droburg, and Louie's Supplies is my favorite store in Sodran!\" This piques the interest of a few shoppers, who turn in your direction. A few look in awe that you're there. Others look disbelieving and carry on. Still, you got some attention.\n\nA young girl approaches you, looking at you with wide eyes. \"Wow! Are you the guy who killed the evil wizard Al-a-star?\" She pronounces his name wrong, but you smile at her and nod.\n\n\"Yes, I did! I saved this city, and this store right here, too!\"\n\nMore people begin to flock over. A few actually head inside, but most just ask you questions or request some stories of your exploits. You don't want to answer them all, but an idea sparks in your head... \"Tell you what, folks! If you buy one item from this store, I'll gladly tell you any story you want!\"\n\nThat really gets people heading into the store.\n\nPeople start swarming in and out, buying everything from little knick knacks to their groceries. You answer a few lighthearted questions about yourself and what you've been up to, the occasional serious one involving your friends. The former is asked by young kids and the like, while the latter is older folks who know the true details of your journey beyond the bastardized fictionialized versions.\n\nEventually, a young boy tugs at your shirt. You look down, and he smiles wide, his two front teeth missing. He shows you a small box of chocolates he just purchased from the store. \"Look, I bought some chocolates! Can you tell us about your adventure, Mr. Kit? The whole adventure, not just parts of it!\"\n\nYou were waiting for that. To be honest, you're not sure how to respond. It takes you a moment, before you decide that no, you won't tell this story.\n\nYou're about to give the boy your answer, but you stare into his wide and hopeful eyes. Despite yourself, you can't find it in yourself to decline him. \"... Alright. But it's a long one. I might not be able to get to all of it.\"\n\n\"That's fine! I just wanna hear what really happened!\"\n\nA small smile makes its way onto your face despite yourself. Taking in a deep breath, you begin to reminisce about those days. Where to start? You suppose, at the very beginning.\n\n\"Listen closely, because I won't repeat myself. A long time ago, I lived in a village called Droburg. It was there that I lived with my best friends, Henry, Thomas, Lilith, and... Grace. One day, news came through that an evil wizard was attacking the Kingdom! We knew that this was what we had been waiting for. So, the very next day, we set out to slay the vile wizard. And that, is where our story begins...\"\n\nTHE END", "action_results": []}, {"action": "No, I should just leave now. He can figure this out on his own.", "result": "With a shrug and a shake of your head, you reply, \"Wish I could help you out, son. I really do. But I've got to get moving on. I've stayed in this city too long already.\"\n\nHe gives you a smile and nods. \"Right, right... Sorry that I held you up with all my rambling and complaining. I'll try and sort things out myself. It was nice seeing you again, Sir Kit.\"\n\n\"Yeah, sure was.\" You turn around and head out the door. For the rest of the day, you mill about Sodran for a while, visiting other places you and your friends visited. A few of the shops have closed down, some of them are under new management. The remainder that haven't changed as much are surprised and pleased to see you.\n\nAt the end of the day, you head to an inn near the entrance to the city and sleep. When you awake in the morning, you pack up your things and leave the city behind. Weeks pass as you get further and further away from your former home, then reach a port town by the sea. You pick up transit on a supply ship headed to Cikoni. A few months later, you arrive in the country.\n\nYou wander there for a while, unsure what to do. Eventually, you find a small coastal town with few people. There, you take residence in an abandoned shack. To make ends meet, you get a job at a farm, tending to exotic crops you've never seen before. It's strange, but eventually, you think you've got the hang of it.\n\nIt's a good life. All in all, better than anything a guy like you could've hoped for.\n\nTHE END", "action_results": []}]}, {"action": "Encourage him. He should chase his dream, get out and see the world.", "result": "After a moment of thinking the kid's words over, you look him dead in the eye. \"If you're serious about your wish, then you should chase it. But be careful, because the world is brutal out there. I'd suggest grouping up with people you can trust, rather than striking out on your own or, Gods forbid, hiring mercs to protect you. Those bastards just care about your money, not you.\"\n\nYou continue to ramble on a bit about your general dislike of mercenaries and their ilk. The shopkeeper doesn't stop you out of respect, but you can tell he doesn't care for your rant about how they'll drink all your alcohol if you have it. Eventually, your throat gets sore anyhow, so you stop. You don't think you've talked this much in ages.\n\n\"I'll be sure to not hire mercenaries then, Sir Kit. I've got a group of friends who are interested in adventuring as well, and we all have some level of combat experience. We're not gonna go on an adventure like you did, just explore. But...\" He bites his lip nervously. \"I don't know who will manage the shop while I'm gone. I don't want to lose it.\"\n\nYou nod, having expected that. Having encouraged him, you feel the need to help him with this so he can get his ass on the open road. The question is, who could take over the shop? You ask, \"Any idea who could manage it for you?\"\n\nHe nods. \"I have an idea, yeah. There's another store across town, I'm sure they'd be happy to manage the shop for me. Though I am a bit worried about them... They might try and permanently take over the shop, if you know what I mean. They need to expand to get all the customers they can get after all.\"\n\nYou hum. That can't be the only option though, right?", "action_results": [{"action": "I'll have him go to the other shop.", "result": "You nod in agreement. \"Yeah, that'd be the best bet. They know how to run this sort of business, and already have enough goodwill with the people that the place will finally get shoppers.\"\n\nHe considers your words, and nods. \"Right. This'll boost the business, and I can go have an adventure!\" With a grin, he leans over the counter and hugs you. Awkwardly, you pat his back. \"Thank you, Sir Kit. I can finally leave this town!\"\n\nAll you give is a shrug. \"Just doing my part. Have fun, kid.\" With those words, you exit the shop, and step out into the marketplace. For the rest of the day, you mill about Sodran for a while, visiting other places you and your friends visited. A few of the shops have closed down, some of them are under new management. The remainder that haven't changed as much are surprised and pleased to see you.\n\nAt the end of the day, you head to an inn near the entrance to the city and sleep. When you awake in the morning, you pack up your things and leave the city behind. Weeks pass as you get further and further away from your former home, then reach a port town by the sea. You pick up transit on a supply ship headed to Cikoni. A few months later, you arrive in the country.\n\nYou wander there for a while, unsure what to do. Eventually, you find a small coastal town with few people. There, you take residence in an abandoned shack. To make ends meet, you get a job at a farm, tending to exotic crops you've never seen before. It's strange, but eventually, you think you've got the hang of it.\n\nIt's a good life. All in all, better than anything a guy like you could've hoped for.\n\nTHE END", "action_results": []}, {"action": "... Maybe I could run it for him?", "result": "... You're going to hate yourself for this, but you voice your thoughts after a moment: \"Frankly, I don't trust the other store to manage this place well. Like you said, they might try and steal the place from under your nose.\"\n\nThe shopkeeper considers your words for a bit, before nodding. \"Yeah. You're right... But who will run the shop?\"\n\nOh you're really gonna hate yourself for it. \"... I could run the store for you.\"\n\nHis eyes immediately widen. \"Y-you would? Really?\"\n\nWith a groan, you reply, \"Yeah, really. Don't get too mushy, I'm still not sold on the idea myself.\"\n\nAs if ignoring your warning, he immediately goes in for a hug. Awkwardly, you pat his shoulder. \"Thank you, Sir Kit!\" He pulls away, wiping a tear from his eye. \"I can't believe it! I finally met my hero, and now I'm going to go on an adventure of my own!\" He beams at you.\n\nYou give a cough. \"... Just get going. Grab your things, gather your friends. I'll take over from here.\"\n\nHe nods, heading to a backroom. You hear him shuffling with things, you assume his gear and supplies, and soon after he exits the room with a knapsack strapped to his back alongside a longsword. You point at it. \"Know how to use that thing?\"\n\nHe nods. \"Of course! My father taught me how, in case I ever needed to defend the store from thieves. But now, I'm gonna put it to better use!\"\n\nYou chuckle. \"Alright, kid. Get going. Oh, and don't forget the key for me.\"\n\nHe nods, tossing you a small key. \"Thank you for this, Sir Kit, really! I'll be back before you know it!\"\n\nYou chuckle, and say, \"I'm sure you will.\" Then, you look around the store, trying to figure out how the hell you're gonna do this. Sighing, you just decide to head behind the counter and take a seat. When it's late, you head to the backroom and collapse into a bed there, falling asleep before you know it.\n\nThe next day, you get up, head to the counter, and wait. This time, a customer actually comes in. He looks around, asking about lantern oil, and you oblige, showing him the way to it. He thanks you profusely, saying something about how he needed it because his pet rat accidentally spilled all of his yesterday. You listen intently, sort of bored, but it pays off. The customer leaves, oil in hand, with a smile on his face.\n\nYou continue on like that for days. People come in, you give them good service and listen to them patiently when they explain why they need this or that. They all leave with smiles on their faces. You're not sure why, as all you're doing is staying silent while they ramble, but they enjoy it. The customers increase their traffic, probably due to recommendations from friends, and you find that the store is now getting a more healthy amount of customers than what the last owner was speaking of.\n\nThese days spread to weeks, then months. You still have yet to hear back from the owner, but you assume he's having fun. When the months spread to years, you assume he might have passed away, or decided not to head back after all. Whatever reason, you never see him again, and consider the store under your sole ownership now.\n\nIt's a nice life to live. Soon, you've integrated into the city so well, that \"Louie's Supplies\" is a name long forgotten; after all, now it's \"Kit's General Store\". You're known for serving customers with a smile on your face and a positive attitude. Strange how things end up.\n\nYou pass away in your sleep silently a few decades later, and the whole city mourns your death... For a few days, that is. Soon enough, the other store that the shopkeeper had mentioned long ago moves in to fill the gap you left, and eventually, even \"Kit's General Store\" is forgotten. Still, at least you were able to enjoy your last years on the world in peace.\n\nTHE END", "action_results": []}]}]}]}]}]}]}, {"action": "I will not leave my home. If the king sends men here, I'll send them back.", "result": "You scoff at the idea of leaving your home. The king says he'll send men your way if you don't respond? Oh, please. You can fend off any pansies he sends your way. Though you're getting up there in years, you can still fight with the strength of a hundred soldiers.\n\nWith that, you resolve to continue on as you've been doing. For the next few days, you don't do much; you get your bread and wine from Bertrand, drink until you black out, then do it again. It continues this way until, finally, a week has passed since the letter.\n\nYou've almost forgotten about it when Bertrand enters your room at around midday. He's already brought you your bread and wine, so you're not sure why he'd come here. His expression is a mask of worry and fear. \"Explain yourself,\" you say, and Bertrand nods with a gulp.\n\n\"The king has sent his men here, sir. They're here to take you away to Castle Oren.\" Bertrand is looking very afraid.\n\n\"Send them away.\"\n\n\"What?\"\n\n\"I said send them away. I don't wish to entertain them.\"\n\n\"But sir...\"", "action_results": [{"action": "I'm not having this. Bertrand should get them out of here.", "result": "This is getting irritating. You told Bertrand to turn anyone away, and the fact that he's ignoring your orders is starting to piss you off a bit. \"Go on, Bertrand. Send them away, and don't come back until tomorrow. I don't wish to hear about fools coming to my door.\"\n\n\nBertrand releases a sigh, but nods. \"Very well sir. I'll go tell them they're not wanted here.\" With those words, Bertrand turns and leaves the room. You expect him to come rushing back a few minutes later, but he doesn't. It seems the king's men listened to his demands.\n\n\nHours pass until finally, the sun has set and the sky is dark. You're about to head to bed, when you hear a faint voice calling your name out. It doesn't sound like it's someone in trouble, so it's probably nothing.\n\n\nYou lay down, and close your eyes...\n\n\n\"Kit...\"\n\n\nYou keep your eyes clenched tight...\n\n\n\"Come to me...\"\n\n\nYou grind your teeth together...\n\n\n\"I need to see you...\"", "action_results": [{"action": "Damn it all... I'll go investigate, and see who the hell it is.", "result": "With a groan, you slip out of your velvet sheets and head to the door. For a moment, you reconsider your choice, but turn the knob and step into the dark hallway. The only light comes from the moon leaking in through closed windows, and you look around, listening for the voice.\n\n\n\"Kit...\"\n\n\nYou catch a glimpse of a white figure down the hall, but it disappears before you can get a good look. Picking up the pace, you follow after it. The voice continues to call out to you, growing louder as you descend deeper into your manor.\n\n\n\"I need to see you, Kit...\"\n\n\nYou continue to follow the voice until you reach the manor's wine cellar. When you open the door, you're greeted by a woman in white. Her brown hair falls past her shoulders and brushes against her hips. Her white dress flows freely, and around her neck she wears a holy symbol of Judeau, God of Life. Her skin is deathly pale and her green eyes bear holes into your own grey orbs. You know that face anywhere. It hasn't aged a day in twenty years.\n\n\n\"Lilith...\"\n\n\nFor a moment fear grips you. You saw her die, that poison dart pierced her throat and she was done for. She was so out of breath she couldn't speak her incantations and heal herself. Yet still, she's standing here before you now, a specter of the past. \"I thought you died,\" you say because you still can't believe she's here.\n\n\nA smile graces her lips. \"I did.\"\n\n\n\"You... You're dead. You're not real. I'm losing my mind...\"\n\n\n\"I'm very real, Kit. Myself and the others have been watching over you, ever since that day. We thought you could pull yourself out of this...\" She shakes her head, disapprovingly. \"We thought you were better than this, Kit.\"\n\n\nDespite the circumstances, you let out a dark chuckle. God, you need a drink. \"Better than what? I didn't have much incentive to live after you all died. I didn't even want to go on that fucking adventure. It was Grace who roped us all into it.\"\n\n\n\"Yet you still went. Why was that?\"\n\n\nGreat, now she's interrogating you. You really want that drink... \"She was... You were all my friends. I wanted to...\"\n\n\n\"Wanted to what, Kit?\"\n\n\n\"I wanted to... DAMMIT!\" You can't help it. You head to one of the shelved bottles, reaching for it.\n\n\n\"Don't.\"\n\n\nDespite Lilith's warning, you grab hold of it, when a sudden burst of wind knocks you back. You crash against another shelf of wine bottles, shattering them from the sheer force of your impact. \"W-what the Hell was that for!?\"\n\n\n\"I don't want to talk to some drunkard, Kit. I want to talk to you.\"\n\n\nYour anger flares. \"Go back to whatever fuckin' afterlife you crawled out of! I don't want whatever you're selling me!\" You pull yourself up and walk to the door.\n\n\n\"Kit. Listen to me.\"\n\n\nYou place a hand on the doorknob...", "action_results": [{"action": "... And release it with a sigh, staying in the room.", "result": "Despite your anger, you can't leave. This is your first time talking with one of your old friends in two decades. You need this. So, you release your grip on the doorknob and turn to Lilith. Although, just because you're staying doesn't mean you have to be nice about it. \"What the hell is it, Lilith? I'm fucking tired.\"\n\n\nThe smile makes its way onto her face again. \"Thank you for staying.\"\n\n\n\"Don't got all night here...\"\n\n\nShe sighs. \"Right... I'm here to show you why you shouldn't try to stay and rot in your home.\"\n\n\n\"Really? Because it's been working out just fine so far.\"\n\n\n\"You'll see.\" Lilith snaps her fingers. A blinding light fills the room, reflecting off the glass wine bottles. Your vision goes white and you stick your hands up to block the light... Then, you're gone.", "action_results": [{"action": "Continue", "result": "Once upon a time you were called the greatest hero to ever live.\n\n\nYou must have been twenty at the time. Fresh faced, spunky as all hell, and too optimistic for your own good. With book of spells in hand, you set out with your childhood friends to save the world from an evil wizard (damn, you can't even remember his name) bent on enslaving mankind. When you left home, there were five of you: a fighter, a rogue, a bard, a healer, and yourself, a mage.\n\n\nThe six month long journey to the wizard's tower was filled with happy times, light hearted misadventures as you all prepared for fortune and glory. When you reached the tower, the mood quickly changed. Your bard fell to a herd of undead that ambushed you at the entrance. The healer took a poison dart to the throat on the fourth floor while the rogue was burned to ash by a pyromancer on the seventeenth floor. Yourself and the fighter were all that remained when you reached the twentieth and final floor, and he was cut down halfway through the fight with the wizard. When the dust cleared and all was quiet, you were the last one standing.\n\n\nYou returned home a year after you had left it. The villagers showered you in praise for killing the wizard, and word reached the nobles in the cities far away that the evil wizard had been defeated. They held a feast in your honor, they showered you in gold, they gave you a title and a manor and an army of servants. Men wanted you, women wanted to be you. But it was all hollow.\n\n\nYou played along for the first ten years, finding little joy in the newfound fortune and glory you had longed for. It wasn't until the writers and artists began to touch your quest that you finally shut yourself in. It started innocently enough, sanitized children's tales about the exploits of you and your allies, but soon it became epic poems and romanticized paintings. One by one, your friends disappeared from the fictionalized tales of your quest, until it was just you, the mage in flowing robes, slaying the vile wizard with your vast arcane knowledge.\n\n\nThat was when you finally isolated yourself, to hide from the common folk and their damning praise, from the artists and their bastardized accounts. For five years you wandered the roads of the Oren Kingdom, not staying in one place for too long, hoping that eventually you'd forget who you were. It didn't work. Just as luck would have it, you were recognized one day, and soon people were traveling the all the highways and country roads of the Kingdom. All in the hopes of meeting you, the legendary hero.\n\n\nIn these last five years, you've stayed locked up in an old cabin deep in the woods. You survive off of game in the woods for food, and use an old stream for water. At night you cast the most harmful spells you can, hoping that one will finally backfire and put you out of your misery. So far, none have.\n\n\nIt's a fitting end for the woman regarded as the greatest hero to ever live: locking herself away in a ratty old cabin, hunting and casting and waiting for the day she finally dies.", "action_results": [{"action": "Continue", "result": "And just like that you're back to the cellar.\n\nYou're on your hands and knees, taking in sharp breaths, before you look back up at Lillith's ghostly figure. \"W-what... What was that?\"\n\n\"Have you ever considered that it could have been any one of us to see the quest through to the end? Do you think it wouldn't weigh on our souls watching our only surviving friend destroy themselves? Grace chose to fill the void by isolating herself from society. I cut the vision off before you could watch her go mad from the isolation and hang herself.\"\n\n\"So that's what would have happened... What about Henry and Thomas?\"\n\n\"Them? Henry would have filled the void with alcohol and women until he died from the diseases he caught. Thomas would have filled the void by stealing everything from everyone until he was finally caught and hung for his crimes.\"\n\n\"What about you?\" you ask after a moment.\n\n\"Myself? I would have looked for every way to bring you four back. It would have led me down a dark path. You don't want to see how that would have turned out.\"\n\nThere's a moment of silence as you contemplate what you just saw. Your... Friend, Grace, and the path she would have gone down if it was you who died that day. Lillith filled you in on what the others would have done.\n\nThat's when you realize something: they're hurting, watching you from the afterlife. Hurting enough that they sent Lillith down to try to get you to turn your life around. The question remains of what you'll do with this information.", "action_results": [{"action": "I need to do something different with my life.", "result": "As you mull it over, a tear escapes your eye. Watching what you watched, hearing what you heard... It breaks you. Your friends are watching you, suffering as they watch you throw your life away. If the situations were different, you know you'd feel the same.\n\nThe tears flow freely now. Still on your knees, you turn to Lilith and mumble, \"You're right.\"\n\nA small smile graces her lips. \"I know that.\"\n\nDespite yourself, you laugh. \"Right. Of course you would.\" You stand up. For the first time in two decades, it feels like a weight has been lifted off of your shoulders. You feel liberated... But with that liberation, you also feel uncertainty. \"What should I do?\"\n\n\"Whatever you wish, Kit.\" Lilith's smile fades. \"But now, my work here is done. I must go.\"\n\nYou were expecting that. A sigh escapes your lips. \"I figured as much. Goodbye, Lilith. Send the others my regards.\"\n\n\"I will.\"\n\nWith those two words, she disappears. You smile faintly, before ascending the stairs and returning to your room. Climbing under the velvet sheets, you close your eyes, and fall into your first dreamless sleep in years.\n\nThe next day, you write up a letter in response to the king's call to arms. When Bertrand enters the room with today's shipment of bread and wine, you raise a hand to stop him from putting it down. \"I've no need for that, Bertrand. Here.\" You hand him the letter. \"See that the king receives this letter.\"\n\nBertrand looks shocked. He places the letter on the tray and leaves the room with a nod to you. You sigh, then sit back down, contemplating the future.\n\nIt's a new day and the start of a new way of life for you.\n\nTHE END", "action_results": []}, {"action": "I won't change because the dead wish it.", "result": "You almost laugh. She wants you to bow to their wills and change yourself, for what? For their sake? They're dead. You're still standing. You heard Lilith out, but that doesn't mean you agree with her. You chose this path, and if it was one of the others they would have chosen their paths as well. To hell with what she thinks of your choices.\n\n\n\"Leave me, Lilith,\" you say.\n\n\nLilith's ghostly eyes widen in shock. \"What?\"\n\n\n\"Leave me. I don't want to hear this. I made my choices, I got myself into this situation. If you came here thinking you could change me, then you're wasting your time.\"\n\n\nHer eyes harden as she stares at you. \"I thought you were better than this, Kit.\"\n\n\nYou don't deign her with a response, or at least not one she can hear. Despite yourself, you find yourself muttering, \"so did I\" under your breath as you turn your back on her. A moment passes, and when you turn to see if she's still there, you find she's gone. A sigh escapes your lips as you walk to the door and ascend the stairs, back up to your room. Once there, you collapse into bed and fall into a fitful sleep.\n\n\nIn the morning Bertrand comes with your bread and wine. You take it, send him out of the room, and spend the rest of the day eating and drinking as you always have. The next day, Bertrand comes in the morning with the bread and wine, which you take and spend the rest of the day eating and drinking. It continues on for weeks without interruption, until one day, something changes.\n\n\nYou wake in the early morning hours to a yell. Your head is pounding and your stomach is killing you, but you push through and get out of bed. Stumbling out of your room, you see a man slumped against the wall: Bertrand. \"Bertrand!\" you shout, running to him. As you get closer, however, you notice the blood trailing down his neck. It flows freely from a fierce red slash across his throat. Bertrand is dead.\n\n\nYou look around, wondering who in the hell did this to your servant, when you feel a sharp pain in your arm. Looking, you find that a crossbow bolt has embedded itself into your bicep. \"W-what the hell!?\" you choke out. Another bolt flies true, hitting your thigh and causing you to fall to a kneel. Footsteps approach from your left, and you turn your head to look. What you see is a man, dressed in black. He approaches you, pulling out a dagger.\n\n\n\"Who are you?\" you ask.\n\n\nHe simply sticks the dagger to your throat and cuts. As you fall to the ground, vision darkening and lungs filling with blood, he speaks: \"The king sends his regards.\"\n\n\nThen, all is silent.\n\n\nTHE END", "action_results": []}]}]}]}, {"action": "... And swing the door open in a huff, leaving the room.", "result": "You reach for the door and open it. Lilith calls out to you, anger evident in her voice as she says, \"I thought you were better than this, Kit!\"\n\n\nYou don't deign her with a response, or at least not one she can hear. Despite yourself, you find yourself muttering, \"so did I\" under your breath. A moment passes, and when you turn to see if she's still there, you find she's gone. A sigh escapes your lips as you walk to the door and ascend the stairs, back up to your room. Once there, you collapse into bed and fall into a fitful sleep.\n\n\nIn the morning Bertrand comes with your bread and wine. You take it, send him out of the room, and spend the rest of the day eating and drinking as you always have. The next day, Bertrand comes in the morning with the bread and wine, which you take and spend the rest of the day eating and drinking. It continues on for weeks without interruption, until one day, something changes.\n\n\nYou wake in the early morning hours to a yell. Your head is pounding and your stomach is killing you, but you push through and get out of bed. Stumbling out of your room, you see a man slumped against the wall: Bertrand. \"Bertrand!\" you shout, running to him. As you get closer, however, you notice the blood trailing down his neck. It flows freely from a fierce red slash across his throat. Bertrand is dead.\n\n\nYou look around, wondering who in the hell did this to your servant, when you feel a sharp pain in your arm. Looking, you find that a crossbow bolt has embedded itself into your bicep. \"W-what the hell!?\" you choke out. Another bolt flies true, hitting your thigh and causing you to fall to a kneel. Footsteps approach from your left, and you turn your head to look. What you see is a man, dressed in black. He approaches you, pulling out a dagger.\n\n\n\"Who are you?\" you ask.\n\n\nHe simply sticks the dagger to your throat and cuts. As you fall to the ground, vision darkening and lungs filling with blood, he speaks: \"The king sends his regards.\"\n\n\nThen, all is silent.\n\n\nTHE END", "action_results": []}]}, {"action": "Bah, I don't have time for this. I'm going to sleep.", "result": "You shake your head. You must be going mad to be hearing voices. It would be best not to look into it, for your own sanity if nothing else. You clench your eyes shut and throw a pillow over your head to block the voices out. Within minutes, you manage to doze off, falling into a fitful sleep full of nightmares.\n\nIn the morning, you begin to hear the voice again. It beckons for you to come to it, but you don't give in. You spend the day as you normally do, drinking wine and eating bread and passing out late into the night... But the voice does not stop.\n\nThis cycle continues for days, then weeks. You try to block the voice out but it keeps coming, and soon, it is joined by even more. Begging for you to come see them. When you resist, the voices continue, increasing in volume and barely contained rage.\n\nOne night you wake up in a cold sweat, greeted by the screeches of these specters haunting you. You're not sure how much more of this you can take.", "action_results": [{"action": "I need to escape, permanently. I reach for the dagger on my bedside.", "result": "You can't take it anymore, no matter how hard you try. You reach for the dagger on your bedside, kept there for emergencies that never came. Now, it'll finally see some use. Ripping open your nightshirt's sleeves, you press the dagger against your wrist. The voices cry out for you not to do it, but you don't listen.\n\nYou slash downward against your wrist, splitting your veins and an artery. Blood leaks freely from the wound. Then, you do the same with the second wrist, beginning to feel light-headed. The voices continue to screech horrifically. It hurts your head to listen to, and combined with the blood loss makes your dizziness worse.\n\n\"You won't take me, you bastards!\" you scream out at them, voice hoarse. With what little strength you have left, you pull your head back with one hand. With the other hand, you place the dagger against your throat and take a deep breath. Then, you slash. Darkness overtakes you.\n\nFinally, there is silence.\n\nTHE END", "action_results": []}, {"action": "No. I won't take the easy way out. I'll hold out, as long as it takes.", "result": "You shout, \"Leave me alone!\" The voices continue despite your protests, and you find yourself unsure if you truly can continue like this... The dagger is awfully tempting...\n\nNo. You won't bow to their whims. Gritting your teeth, you hop out of bed and begin to yell as loud as you can, \"LEAVE ME! I WON'T GIVE INTO THE LIKES OF YOU!\" Still, the voices do not stop their incessant screeching. So, you scream back louder.\n\nYou're not sure how long the back and forth screaming goes on for. All you know is that before long, you stop yelling and begin to laugh maniacally. The voices quiet this way, but you're not sure for how long. Have you gone mad? Or is this working? Then again, who's to say it isn't both?", "action_results": [{"action": "I keep laughing! This is working! I can feel myself slipping away, away from them and all my problems!", "result": "It's working! The voices are getting quieter! You laugh, and laugh, and laugh away! You continue laughing until you can hear nothing but the laughter! Then you laugh even more! It's all you need! Now there is nothing in the world except you, and your laughter!\n\nBertrand finds you the next morning, curled up in a fetal position and laughing. Tears stream from your eyes, and every now and again you let out a wheeze from lack of breath. He stares at you, horrified, before pulling you up and carrying you out. He sends for a sage from the next town over to look into your sudden onset of uncontrollable laughter.\n\nWhen the sage arrives at midday, he takes one look at the giggling wreck that you are and shakes his head. Still, he sets to work trying to get you to respond. You simply laugh at him. After an hour, he admits defeat. \"He's gone mad,\" the sage says. \"There's nothing I can do.\"\n\nHe binds you with rope and drags you into his wagon, taking you into the town. There, he admits you into an asylum, while you continue to chuckle without end. The staff beats you in an attempt to get you to stop; it does not work. Eventually, they cut out your tongue, but you let out breathless wheezes that sound like laughter nonetheless.\n\nFinally, one morning, a worker at the asylum grows irritated with your laughing. In the middle of the night, he enters your room and slits your throat. In his dreams, he can hear you laughing mad, without end...\n\nTHE END", "action_results": []}, {"action": "What am I doing? I get a grip on myself and stop, before I slip into a pit I cannot pull myself out of.", "result": "You snap yourself back to reality, before you can lose yourself to the madness. Truly, you must be losing your mind. No sane man would break into a fit of laughter like you did, let alone hear voices calling to him in the dead of night. Your mind reaches for answers as to what the hell is going on, but it is met by silence.\n\nThere is something hanging over you, however. Some sort of entity guiding your actions, predetermining your paths and setting you on one or the other. You can feel the mouse hovering over you, watching, waiting for that next blue hyperlink to show up. I wonder if they're reading this. And if they are, I wonder what their thoughts are on what I'm writing. I'm going on a tangent. You probably think I'm just trying to cash in on the success some people had in 'connecting' with the reader in their own stories, don't you? The truth is, I don't know why this page turned out like it did.\n\nDo you think the people reading this will ever find this path? Maybe they're skimming over all these words, trying to find an end game link. Maybe they're completionists and are trying to find every ending. The odds of this being the first path that a player finds is slim. There's other, more exciting paths out there, aren't there? So many different paths this story could have taken and they choose the stay at home and go nuts path first? I doubt it.\n\nI don't know you, reader. I only know what I've written. I'm sure right now you're rolling your eyes, thinking that I'm just some pretentious teenager writing whatever dribble comes to mind. If I wrote whatever came to mind and didn't carefully reread and edit, this whole page would be riddle with typos and keyboard mashing. You don't know me in the same way I don't know you.\n\nBut this isn't about me or you or this website. This is about Kit and his descent into madness that you could have prevented. He's probably scared. I could just as easily write around this, pretend that this whole tirade didn't even happen. He can go back to being confused and going mad and trying to block out the voices. I think it's your choice, reader.\n\nJust remember: every choice you make I wrote out for you. You have no control, but I guess that's just the edgelord in me getting out. Go on. Make a choice. Choose how this path ends.", "action_results": [{"action": "I want to pretend this didn't happen. Kit's gone insane, there's no way out but death.", "result": "Alright then, reader. Kit can't take it anymore. He kills himself. The end. I didn't want to write this. You're boring for picking this. Fuck you.", "action_results": [{"action": "Go back and make the right choice for me.", "result": "Are you gonna make the right choice?", "action_results": [{"action": "I want to pretend this didn't happen. Kit realizes that the voices are trying to help him and changes.", "result": "Fine then, reader. Kit realizes the voices are his friends and changes his ways. He lives happily ever after. The end. Go fuck yourself.", "action_results": [{"action": "Go back and make the right choice for me.", "result": "Just give in and make the right choice. No other option.", "action_results": [{"action": "But this did happen. I want Kit to know.", "result": "Stubborn, aren't you? Took you long enough to make the right choice. Oh well, it doesn't matter. The point is you're here now, and I'm about to round out this ludicrous fourth wall break path.\n\nHey Kit.\n\nYou look around. This voice is... Different. It doesn't sound like anyone you know. \"W-who are you?\"\n\nI'm the man who created you.\n\nThis causes you to jerk back. \"What? You can't be! You're lying! Just leave me alone!\"\n\nI'm feeding you these words. This isn't a conversation between two people. This is me trying out an artistic experiment. People are going to rate me a 1 if they find this wannabe avant-garde bullshit path.\n\n\"You can't be telling the truth! I'm real! I'm as real as any man!\" He can't be telling the truth. You're a real person. This is getting to you too much.\n\nI'm not sure why you're in denial, Kit. In fact, I'm not sure why I'm writing you as in denial of this. I can make you do anything. I can make you dance if I want. Though I suppose that would fit better in a visual medium.\n\nAs if on command, you begin to hop up and down and wiggle around. It's a very entertaining sight, and the writer has stopped bothering with italicizing your actions. Because you know the truth, Kit. I created you. I can end you. I can take things back. Have you gone insane? That's for me and the reader to decide.\n\n\"What did you do to me?\"\n\nI got a prompt and I figured I could take this path in an interesting way. I was having trouble with this specific part of it. I remembered a comic I read once, Grant Morrison's Animal Man. It ended in a similar manner to this path: author and creation meeting each other. It touched me in a way I don't think any other story has, yet.\n\n\"You created me?\"\n\nYeah, Kit. You're a figment of my imagination. If I want, I can hit delete on this story right now and you'd be gone forever. Just a shadow of what could have been in my mind. I've come close to wiping this story a few times. I wasn't sure I could ever complete it. I'm not sure if I ever wanted to. Writing this story has taught me a lot and I feel like once I finish it, I won't be learning anymore.\n\n\"Everything that happened to me... You did that?\"\n\nYes, Kit. Your friends, they're not real. They're playthings. I've written a handful of lines for each of them. The only one that got any semblance of characterization was Lilith, the priest girl. Did you know that I went into this story without a name for any of them? I went into this story without a name for you, too. You were going to be Victor, once.\n\n\"What are you saying? Can't you turn everything back?\"\n\nSure I can Kit, but it would be hollow. I'd go back to writing a story instead of rambling on incoherently, and it would end right as it got to the good part. That's how this entire story has gone; I have an idea, I write a few pages for it, I get bored, then I cut it off before it branches out too much. There's so many things in here that could make a full game, yet I only dedicate a handful of pages to those stories.\n\n\"Why can't you just stop that, then? Make everything as long as it needs to? Why couldn't you make a story about myself and my friends, let us choose our fates, let the reader choose our fates?\"\n\nBecause that wasn't the story I wanted to tell. I wanted to be \"edgy\". I wanted to be \"realistic\". Cursing, and drinking, and violence, and a broken protagonist. You were never a hero, Kit. In fact, I could say that you killed countless men and women, and no one would bat an eye. They'd want to play as you more, if anything. The people here are drawn to villains.\n\n\"What the hell do you want from me?\"\n\nMe? I don't know. I'm writing this because I'm bored. Later I'm probably going to eat breakfast and pass out. Maybe watch a movie. Go for a walk. Something. But right now, it's me, and you, and the reader. I haven't forgotten you, reader. Why don't you exercise your \"free will\" and decide how this story ends for me, huh?", "action_results": [{"action": "Give Kit his friends back.", "result": "Okay, reader. I'll give Kit a happy ending. I'll take away everything. Everything is back to normal now. Maybe someday I'll write a prequel. You might see me again there, watching, waiting, laughing at you and your \"free will\". You don't make the choices. I do.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe light of the sun beats down upon your face through your window. Groggily, you push yourself up and scratch your head. Working in the fields all day has been killing your back lately, but you'd do anything for mother after father died. As you're pondering your predicament, you feel a splash of water hit you in the head from the window. A shout of shock escapes your lips.\n\nYou hear laughter from outside. \"That wake you up, Kit?\" a girl chuckles. Torn between amusement and anger, you get up and jump through the window. Grace sits there, laughing at your soaked form, while you glare angrily at her.\n\n\"The hell was that for? I was gonna wake up eventually!\" you grunt, annoyed.\n\n\"Sure you were! Come on farmboy, it's your day off. Let's go meet with the others!\" She takes your hand without another word, and you find your anger slipping away as she guides you to your friends. Life is good, and you've got all of it ahead of you. Nothing can stop you.\n\nBut time will tell if you can put an end to the evil on the rise...\n\nTHE BEGINNING", "action_results": []}, {"action": "Fuck you. I don't have to do this. I can close this game right now if I want. I don't even have to click this choice. You can't make me do anything.", "result": "If you really felt that way, you wouldn't have clicked the choice.\n\nNow take your end game link and get out of here.", "action_results": []}]}]}]}, {"action": "But this did happen. I want Kit to know.", "result": "I see you made the right choice after only one attempt. Oh well, it doesn't matter. The point is you're here now, and I'm about to round out this ludicrous fourth wall break path.\n\nHey Kit.\n\nYou look around. This voice is... Different. It doesn't sound like anyone you know. \"W-who are you?\"\n\nI'm the man who created you.\n\nThis causes you to jerk back. \"What? You can't be! You're lying! Just leave me alone!\"\n\nI'm feeding you these words. This isn't a conversation between two people. This is me trying out an artistic experiment. People are going to rate me a 1 if they find this wannabe avant-garde bullshit path.\n\n\"You can't be telling the truth! I'm real! I'm as real as any man!\" He can't be telling the truth. You're a real person. This is getting to you too much.\n\nI'm not sure why you're in denial, Kit. In fact, I'm not sure why I'm writing you as in denial of this. I can make you do anything. I can make you dance if I want. Though I suppose that would fit better in a visual medium.\n\nAs if on command, you begin to hop up and down and wiggle around. It's a very entertaining sight, and the writer has stopped bothering with italicizing your actions. Because you know the truth, Kit. I created you. I can end you. I can take things back. Have you gone insane? That's for me and the reader to decide.\n\n\"What did you do to me?\"\n\nI got a prompt and I figured I could take this path in an interesting way. I was having trouble with this specific part of it. I remembered a comic I read once, Grant Morrison's Animal Man. It ended in a similar manner to this path: author and creation meeting each other. It touched me in a way I don't think any other story has, yet.\n\n\"You created me?\"\n\nYeah, Kit. You're a figment of my imagination. If I want, I can hit delete on this story right now and you'd be gone forever. Just a shadow of what could have been in my mind. I've come close to wiping this story a few times. I wasn't sure I could ever complete it. I'm not sure if I ever wanted to. Writing this story has taught me a lot and I feel like once I finish it, I won't be learning anymore.\n\n\"Everything that happened to me... You did that?\"\n\nYes, Kit. Your friends, they're not real. They're playthings. I've written a handful of lines for each of them. The only one that got any semblance of characterization was Lilith, the priest girl. Did you know that I went into this story without a name for any of them? I went into this story without a name for you, too. You were going to be Victor, once.\n\n\"What are you saying? Can't you turn everything back?\"\n\nSure I can Kit, but it would be hollow. I'd go back to writing a story instead of rambling on incoherently, and it would end right as it got to the good part. That's how this entire story has gone; I have an idea, I write a few pages for it, I get bored, then I cut it off before it branches out too much. There's so many things in here that could make a full game, yet I only dedicate a handful of pages to those stories.\n\n\"Why can't you just stop that, then? Make everything as long as it needs to? Why couldn't you make a story about myself and my friends, let us choose our fates, let the reader choose our fates?\"\n\nBecause that wasn't the story I wanted to tell. I wanted to be \"edgy\". I wanted to be \"realistic\". Cursing, and drinking, and violence, and a broken protagonist. You were never a hero, Kit. In fact, I could say that you killed countless men and women, and no one would bat an eye. They'd want to play as you more, if anything. The people here are drawn to villains.\n\n\"What the hell do you want from me?\"\n\nMe? I don't know. I'm writing this because I'm bored. Later I'm probably going to eat breakfast and pass out. Maybe watch a movie. Go for a walk. Something. But right now, it's me, and you, and the reader. I haven't forgotten you, reader. Why don't you exercise your \"free will\" and decide how this story ends for me, huh?", "action_results": [null, null]}]}]}, null, {"action": "But this did happen. I want Kit to know.", "result": "So you picked this on your first try? Maybe you just used the actual go back button instead of the one I gave you on either of those two choices. Oh well, it doesn't matter. The point is you're here now, and I'm about to round out this ludicrous fourth wall break path.\n\nHey Kit.\n\nYou look around. This voice is... Different. It doesn't sound like anyone you know. \"W-who are you?\"\n\nI'm the man who created you.\n\nThis causes you to jerk back. \"What? You can't be! You're lying! Just leave me alone!\"\n\nI'm feeding you these words. This isn't a conversation between two people. This is me trying out an artistic experiment. People are going to rate me a 1 if they find this wannabe avant-garde bullshit path.\n\n\"You can't be telling the truth! I'm real! I'm as real as any man!\" He can't be telling the truth. You're a real person. This is getting to you too much.\n\nI'm not sure why you're in denial, Kit. In fact, I'm not sure why I'm writing you as in denial of this. I can make you do anything. I can make you dance if I want. Though I suppose that would fit better in a visual medium.\n\nAs if on command, you begin to hop up and down and wiggle around. It's a very entertaining sight, and the writer has stopped bothering with italicizing your actions. Because you know the truth, Kit. I created you. I can end you. I can take things back. Have you gone insane? That's for me and the reader to decide.\n\n\"What did you do to me?\"\n\nI got a prompt and I figured I could take this path in an interesting way. I was having trouble with this specific part of it. I remembered a comic I read once, Grant Morrison's Animal Man. It ended in a similar manner to this path: author and creation meeting each other. It touched me in a way I don't think any other story has, yet.\n\n\"You created me?\"\n\nYeah, Kit. You're a figment of my imagination. If I want, I can hit delete on this story right now and you'd be gone forever. Just a shadow of what could have been in my mind. I've come close to wiping this story a few times. I wasn't sure I could ever complete it. I'm not sure if I ever wanted to. Writing this story has taught me a lot and I feel like once I finish it, I won't be learning anymore.\n\n\"Everything that happened to me... You did that?\"\n\nYes, Kit. Your friends, they're not real. They're playthings. I've written a handful of lines for each of them. The only one that got any semblance of characterization was Lilith, the priest girl. Did you know that I went into this story without a name for any of them? I went into this story without a name for you, too. You were going to be Victor, once.\n\n\"What are you saying? Can't you turn everything back?\"\n\nSure I can Kit, but it would be hollow. I'd go back to writing a story instead of rambling on incoherently, and it would end right as it got to the good part. That's how this entire story has gone; I have an idea, I write a few pages for it, I get bored, then I cut it off before it branches out too much. There's so many things in here that could make a full game, yet I only dedicate a handful of pages to those stories.\n\n\"Why can't you just stop that, then? Make everything as long as it needs to? Why couldn't you make a story about myself and my friends, let us choose our fates, let the reader choose our fates?\"\n\nBecause that wasn't the story I wanted to tell. I wanted to be \"edgy\". I wanted to be \"realistic\". Cursing, and drinking, and violence, and a broken protagonist. You were never a hero, Kit. In fact, I could say that you killed countless men and women, and no one would bat an eye. They'd want to play as you more, if anything. The people here are drawn to villains.\n\n\"What the hell do you want from me?\"\n\nMe? I don't know. I'm writing this because I'm bored. Later I'm probably going to eat breakfast and pass out. Maybe watch a movie. Go for a walk. Something. But right now, it's me, and you, and the reader. I haven't forgotten you, reader. Why don't you exercise your \"free will\" and decide how this story ends for me, huh?", "action_results": [null, null]}]}]}]}]}, {"action": "Fine. If Bertrand is so hesitant, I'll do it myself.", "result": "\"Fine,\" you grunt. \"I'll do it myself.\" Of course Bertrand can't get them out of here. They're the king's men with an order to get you, not some con man looking to sell you cheap wares at an inflated price. He's never had to do this to someone who has good reason to come in, and it scares him. You understand, somewhat.\n\nFor the first time in ages, you leave the master bedroom and walk the halls of your manor, Bertrand following after you. It's been well kept by your servants, for the odd occasion that someone comes to visit. The fine paintings adorning the walls are flawless and their frames clean of dust, the walls are painted a regal blue, and lanterns hung on the ceiling keep the place well lit.\n\nYou walk out to the courtyard to greet the king's men. A lone tree sits in the center of the courtyard on a circular patch of grass, surrounded by a cobblestone path. A series of bushes encompass the manor itself, giving the entire courtyard a reserved, tidy appearance. The knights are sitting in wait and look up when you approach. One stands and walks over to you.\n\nHe removes his helmet, revealing a youthful yet stern face. His sandy blond hair is cut short, and his green eyes burn a hole into your own grey ones. He gives you a salute, then speaks, \"Good day, Sir Kit. I am Miller, of the Gold Hawk Knights. We've come here to take you with us to Castle Oren.\"", "action_results": [{"action": "I shake my head. \"Afraid I won't oblige your request. Now leave.\"", "result": "Miller scowls at your calm request for him to leave. \"I'm afraid I can't, Sir Kit. Please, come with us. I won't ask again.\" You can feel your anger flaring up, and for a moment you wish you had brought your sword to cut this bastard down.\n\n\"You listen to me, Miller,\" you growl, hissing his name out like it's an insult. \"I want to live in peace. You take your Gold Hawk Knights and get out of here. Leave me be.\"\n\nHe shakes his head. \"I was hoping it wouldn't come to this. Knights, apprehend Sir Kit.\" The two knights flanking Miller approach you, attempting to grab you. On instinct, you fight back, delivering a hook to one's face and causing him to stumble back towards Miller. The other quickly draws his sword and swings, but you duck under it and disarm him. With the longsword in hand, you quickly stab him in the chest.\n\nBlood pours out of his wound as you push him to the ground. You blink, suddenly realizing what you just did. Miller and the other knight look at you and their dying comrade in shock. Miller and his ally draw their own swords, pointing them at you. \"You're under arrest, murderer! Surrender or our blades will taste your blood!\"", "action_results": [{"action": "I didn't mean to do that... I can't believe... I surrender willingly. I deserve whatever fate awaits.", "result": "You're in as much shock as the two knights. Quickly, you drop the sword and raise your hands. Miller approaches you, rage written on his face, and hits you in the face with the pommel of his sword. Instantly, darkness takes you. The last thing you hear before you slip into unconsciousness is Miller telling his comrade, \"Tie him up and get him in the wagon. Take Edward's corpse.\"\n\nWhen you wake up, you're face down on a cold stone floor. Pushing yourself up, you look around and see Miller not far from you. Seperating the two of you is a row of iron bars. \"Miller,\" you say. \"What is the meaning of this?\"\n\nHe sighs, pulling up a wooden chair and sitting down. \"You should be thankful you're not on the chopping block. The king's respect for you is the only reason you're still alive. If you were any other man, your head would roll for killing a knight.\"\n\nYou don't respond. The weight of what you did hits you full force in that moment. Because of it, you're going to rot here.\n\n\"There will be no trial. If anything, you being in this cell is to protect you. The Gold Hawk Knights are furious.\" Miller stands, pushing the chair back. \"Farewell, Kit.\"\n\nMiller heads to the door and shuts it, leaving you to your isolation. It's the last time you ever see him.\n\nFor the next few years, your only human contact is when a guard comes in to deliver you some food. At first it's a nice break in the monotony of being alone in your cell, but soon it becomes part of the routine. Even when you try to strike up a conversation, the guard ignores you and just gives you your food. It's a lonely life.\n\nEventually, the meals decrease in frequency, until one day you realize that it's been a week since you had food. You begin to yell, hoping to grab a guard's attention and get some food, but no one comes. Another week passes and you find yourself barely clinging onto what little life you have. The lack of food has been effecting you greatly, and the only water you can get is from drops of rain that come through your little window.\n\nWhen three weeks pass, you finally die. A guard comes the next day to remove your corpse. He drops it into a wagon of similar corpses, where you're sent off to be incinerated. A criminal such as yourself doesn't deserve a proper burial anyhow.\n\nTHE END", "action_results": []}, {"action": "I can't go down like this. I'll tell them to leave again, and if that doesn't work, I'll attack.", "result": "No. You can't let them take you like this. Standing there with bloody sword raised, you speak slowly, \"I don't want to have to kill you both. Leave now and never return.\" There's a tense moment for a while as you stare at the two of them and they stare back. They're too scared to make the first move, and you don't want to make it. The standoff lasts for a moment longer, then...\n\n\"Oh screw this!\" Miller's ally yells, before rushing at you with a shout of rage. He swings his sword, which you easily deflect, then duck down for a sweeping slash that cuts through his abdomen. Clutching his wound, he collapses to the ground, writhing and moaning in agony as he slowly bleeds out. Miller stays back, examining you.\n\n\"Your buddy won't die with that wound. It'll take a few days for him to bleed out all the way. Take him and go, if you know what's good for you,\" you say, giving Miller his last warning. Miller looks down at his companion, as though considering it. Then he shifts his gaze back to you, looking more furious than ever.\n\n\"I won't let you walk free you bastard.\" With those words, he advances towards you. The two of you clash blades for a while, and whenever one of you tries to go for an opening the other blocks or parries. You're not as good with longswords as Miller is, specializing more in greatswords and their overwhelming force, but you're too stubborn to let him beat you.\n\nIn the end, that stubbornness is what grants you victory. While Miller has been tiring, you've only been attacking more and more ferociously. Eventually, his defense slips, and you slide your blade right into his chest. His face morphs into a mask of pure shock as he drops his sword. He stares at you in fear, which quickly shifts to anger. He pushes himself forward, forcing the sword deeper into his body, while reaching out for your neck. His hands squeeze against your throat, at first tightly, then slowly weakening in strength until they fall limp.\n\nAs his eyes close, you pull the blade out of him and let his corpse fall to the floor. His ally is still on the ground begging for death. You grant him the pleasure, holding his head down and sliding the blade into the base of his skull. He twitches slightly, then goes limp. You stand and consider what you just did.\n\nYou could just as easily burn the bodies and head back inside, but there's no way the king would allow this. He could send more knights, perhaps far more than you could handle. On the other hand, there's the option to use this to spark a rebellion among the people. Though the king is far from tyrannical, there's enough dissent from the long-lasting war against the Empire of Kishak for the common people to attempt an uprising. With how much the people love you for your deeds, they'd join you in a rebellion in a heartbeat.", "action_results": [{"action": "I can't count on the goodwill I have built up. I'm going to just wait this out.", "result": "You can't be bothered to try something that stupid. The king has well trained knights and soldiers under his command; if you put together a rebellion, it would be destroyed as quickly as you build it up. Instead of deciding to go on a pointless endeavor such as that, you begin to gather the bodies up in a pile. You cover them in dried sticks and leaves, then start a fire. As soon as it's gotten large enough to engulf the bodies, you return into your home. The servants watch as you head to your room in mingled awe and terror, unsure of how to act around you. You head into your room, lay in bed and sleep the rest of the day away.\n\n\nIn the morning Bertrand comes with your bread and wine, looking a bit more cautious after what happened yesterday. You take it, send him out of the room, and spend the rest of the day eating and drinking as you always have. The next day, Bertrand comes in the morning with the bread and wine, which you take and spend the rest of the day eating and drinking. It continues on for weeks without interruption, until one day, something changes.\n\n\nYou wake in the early morning hours to a yell. Your head is pounding and your stomach is killing you, but you push through and get out of bed. Stumbling out of your room, you see a man slumped against the wall: Bertrand. \"Bertrand!\" you shout, running to him. As you get closer, however, you notice the blood trailing down his neck. It flows freely from a fierce red slash across his throat. Bertrand is dead.\n\n\nYou look around, wondering who in the hell did this to your servant, when you feel a sharp pain in your arm. Looking, you find that a crossbow bolt has embedded itself into your bicep. \"W-what the hell!?\" you choke out. Another bolt flies true, hitting your thigh and causing you to fall to a kneel. Footsteps approach from your left, and you turn your head to look. What you see is a man, dressed in black. He approaches you, pulling out a dagger.\n\n\n\"Who are you?\" you ask.\n\n\nHe simply sticks the dagger to your throat and cuts. As you fall to the ground, vision darkening and lungs filling with blood, he speaks: \"The king sends his regards.\"\n\n\nThen, all is silent.\n\n\nTHE END", "action_results": []}, {"action": "Damn waiting in fear. I'll tear this kingdom down, and the people will help me do it.", "result": "You look at the corpses you just created and release a heaving sigh. There's not much else you can do now. The king will have your head for this either way, so you figure you might as well take more than a handful of knights down with you. This is the dumbest thing you've done in a while, and you've done a lot of dumb things in your life.\n\nYou load the corpses up into the carriage they came in, then hurry back into your house to retrieve your sword and get into some more fitting traveler's clothes. As you stride through the halls of your home, the servants watch you warily, as if fearing that they may meet your blade next. You ignore them, ascending the stairs to your master bedroom and begin loading up. Once you're all done, you flip your cloak over your shoulder and walk out the door. The nearest town, a large village by the name of Everseed, is about half an hour away by horseback.\n\nTaking a seat in the carriage, you kick the horses in gear and ride to the town. The ride down the country road is quiet and peaceful, the best that can be expected. You know that it will be the last time for a while you get to relax and unwind.\n\nWhen you arrive in town, you stop the carriage in the most active place in town; in this case, the market. The people watch you curiously as you step off the carriage and approach a fountain in the center of the market. There, you raise your voice and speak, \"Everyone! My name is Sir Kit of Droburg, the man who slayed the vile wizard that plagued our lands twenty years ago!\" This gets all eyes on you as you approach the back of the cart again.\n\n\"And these,\" you pull the cover of the cart off, revealing the three dead knights to the people. They gasp in shock, some moving to weapons in case they need to attack you. \"These are three knights that the king sent to kill me. The lengths this man has gone to, trying to kill a hero such as myself. What has our kingdom come to?\" You're bending the truth, a lot, but these people are eating it up. The villagers that went for weapons are looking furious, while the others left unarmed grab for makeshift weapons as well.\n\n\"That bastard king! He's been taxing us so hard we barely have enough to pay for food!\" one villager pipes up from the crowd.\n\n\"He drafted my son into the war and he died! My boy was only 15!\" a woman cries out.\n\n\"He's been doin' nothin' but tearin' us down and buildin' himself up!\" a farmer yells from the back.\n\n\"And now, my friends, he's trying to kill the last true hero in this kingdom. A man like this must be stopped, once and for all. For the true Kingdom of Oren, we must eliminate this tyrant!\" you shout, and the crowd answers with cheers and battle cries. Now, you have an army. You're not sure how this will end, but wherever it leads, the kingdom will be changed forever...\n\nTHE END", "action_results": []}]}]}, {"action": "Considering it, I sigh and nod. \"Fine. I'll go with you to Castle Oren.\"", "result": "Miller smiles at you, nodding at your answer. \"I'm glad to hear it, sir. Go, gather your things and we'll head straight for Castle Oren.\" You nod at his request, quickly heading back inside and packing what you need. You make sure to grab your sword as well, as you know you'll need it.\n\nWhen you exit the manor, you and the three Gold Hawk Knights enter their wagon and begin the ride to Castle Oren. You end up having to stop for the night, but in the morning you continue on to finish the last stretch. You arrive at Castle Oren around lunch time. The castle is large and imposing, made of stone that has gathered a fair bit of moss over the years. It was built a thousand years before your time, and still stands after all this time with only minor renovations to keep it up. A town surrounds the castle, full of shops and inns and homes and other assorted buildings. People mill about, paying you no mind as the wagon rolls up to the castle gates.\n\nThe guards there stand at attention, waiting for you to make a move. Miller nods to them, and they move to open up the gates. The wagon rides into the castle ground proper. Inside the castle grounds, the knights park their wagon and you all hop off. Miller stands beside you. \"When can I see the King?\" you ask.\n\n\"Come along, I'll take you to him.\" Miller walks away. You follow closely behind, examining the castle grounds. The courtyard leading into the castle is home to many trees and flowers, a few of which you've never even seen. The King's gardeners must take their work very seriously.\n\nYou head into the castle proper, in an entrance hall that doubles as a throne room. The King is nowhere in sight, and Miller continues on past the throne and to a door not far from it. As you step into the room, you see a man in fine clothing sitting at a desk. The desk houses a golden crown. The King is around his mid thirties, though the wrinkles in his face and the gray streaking his hair indicates a man at least a decade older.\n\n\"Your highness. Sir Kit has arrived,\" Miller says. The King looks up from his writing at you, and gives a faint smile. He waves Miller off, and the young knight departs from the room.\n\n\"Sir Kit. It is an honor to finally meet you.\" The King stands from the desk and approaches you. He's only a bit shorter than you, impressive considering your bulky stature, though his posture and build indicates he's never been a fight before. He sticks out a hand for you to shake, which you do.\n\n\"The honor is all mine, your highness,\" you say, though rather half-heartedly.\n\nThe King laughs. \"Let's skip the formalities. Call me Walter. We're not here to discuss something officially.\" His face darkens. \"I called you here because I need someone to weaken the Kishak Empire, so that my army can strike the final blow against them.\"\n\n\"I see.\"\n\n\"I need someone who doesn't mind getting their hands dirty, Sir Kit. I need a warrior such as you. I take it whatever you face on this mission will be enough for you to handle, and I'll be sending you backup anyhow.\"\n\n\"What's this mission you're sending me on?\"\n\n\"My spies in Kishak have uncovered the location of the Empire's supply cache: in the heart of their capital city. If you can destroy the supply cache, there goes all of the Kishak army's food, weapons, and gunpowder. They'd be running on what they have left, and soon enough that would run out and my men would be able to drive them back.\"\n\n\"... This sounds like a suicide mission.\"\n\nThe King nods slowly. \"Perhaps. But if you manage to see this mission through, the war will be won by next year. Would you not want to see an end to this war that has claimed so many lives? An end to a war your grandfathers would have fought in, and your grandchildren will fight in if it doesn't end?\"\n\nYou shake your head, chuckling. \"You're wrong there. My grandfathers were simple farmers, and I don't have children. This war means nothing to me.\"\n\n\"Maybe it doesn't. But think of the millions of lives that have been lost to it, and the millions of lives you will save by ending it.\"\n\nYou sigh. At the very least, this is something to do.\n\n\"Fine. Let's get prepped for this suicide mission.\"", "action_results": [{"action": "Continue", "result": "You spend the rest of the day in the castle, resting up and mentally preparing yourself for your mission. The King's servants bring you whatever you wish, and in this case, it's more alcohol so you can psych yourself up. Liquid courage and all that. By nightfall, you're as drunk as can be, staring silently at a wall as you usually do.\n\"Stop doing this.\"\n\"Well what do you want me to do?\" you mumble, replying to no one.\n\"Anything else.\"\nA chuckle escapes your lips. \"Really? I guess you'd prefer me going on a drunken rampage and slaughtering all the guards.\"\n\"That's not what I meant, Kit.\"\n\"Then what did you mean?\"\n\"I meant you need to stop drinking. It's not doing you any good.\"\n\"Of course it's not doing me any good if I'm having a conversation with myself.\"\n\"You know who I am.\"\n\"Quit lying. You're just a figment of my imagination I start hearing when I get too wasted.\"\n\"Please, Kit. For me.\"\n\"Buzz off.\" You throw the empty bottle of wine in your hand at the wall, then crawl into bed. You have a long day ahead of you tomorrow, and you need your sleep.\n\nIn the morning, you're woken up by a knock on your door. You get up, groaning slightly, and head for it. When you open it, Miller stands before you. \"The King sent me to wake you. We're leaving today.\"\n\n\"We?\" you ask.\n\n\"He asked me to accompany you, along with a mage in our military. A small enough team to get behind Kishak lines unnoticed, and hopefully enough to provide backup should you need it.\"\n\nYou nod, heading to the dresser to grab some clothes. Miller turns away so you can get dressed, yet you still speak to him. \"So what are you going to bring to the table?\" you ask as you slide into a pair of breeches.\n\n\"I was knighted at twenty-one, the youngest man to be knighted... Aside from yourself, of course. For the past seven years I have served the Royal Family, and have led many knights to victory against Kishak forces.\"\n\n\"Hrm. How good are you with a sword?\" You put on your boots and pick out a shirt.\n\n\"I've never lost a one-on-one sword fight, sir. I have also managed to take down ten men at once with only minor injuries.\"\n\n\"This bodes well then.\" You finish your ensemble by sliding on a tunic. \"Alright then. Let's get going.\" Miller turns to face you then nods. He allows you to grab your sword and hook it onto your back, then leads you to where you'll depart.\n\nYou head through several hallways before Miller stops in front of a bookcase. He taps on it once, pauses, taps twice, pauses, taps once, pauses, then taps three ties in quick succession. The bookcase opens slowly, and he leads you through a secret passage. A whistle escapes your lips. \"How fancy.\"\n\n\"Indeed.\"\n\nMiller continues leading you through the tunnel for what seems like half an hour before you come out the other side. You're in a clearing, about a mile out from the Castle, where a wagon and two people wait for you. You're not far from Kishak now, only a few more miles until the border.\n\nOne of the two people, a woman about a year younger than Miller, steps forward. She eyes you up and down, and looks unimpressed. \"This is the legendary hero who saved our city? He looks like a drunk and smells like one too.\" You give her a quick glare.\n\n\"Hold your tongue, Iris. If it weren't for this man, we wouldn't be here talking today,\" the other person says, an older man who is checking the horses. You shift your glare to him. It wasn't just you.\n\n\"Please. This man had backup even then. Did you only hear the children's tales, Oliver?\" the woman, Iris, asks. \"If it weren't for his friends, I'm sure he'd have died not far into his journey.\" Well, at least she has her facts straight.\n\n\"Both of you, shut your damn mouths,\" you say, stepping forward. \"Whatever your thoughts on me are, I'm the real deal, and we're here to finish a war.\" You turn to the man, Oliver. \"I assume you're our driver?\"\n\n\"Aye, I am. I'll take you as far as the border. There, you'll be on your own. Kishak's capital, Ornislov, is only a couple miles out. You should reach there in no time if you stay off the roads and don't stop for anything.\"\n\n\"Right,\" you nod. You head towards the wagon, motioning for Miller and Iris to follow you. \"Come on. Don't have all day.\" You climb into back, and they follow. After a moment, the wagon begins moving towards the border. You stay silent for a moment, assessing Iris, before speaking up. \"I did this with Miller so you should be no different: what are you bringing to the table?\"\n\nIris scoffs. \"I spent my whole life training at the Academy in Loren. I enlisted with the military when I came of age, and I've seen my fair share of battles. I can also speak fluent Kishak, so if you need a translation just ask me.\"\n\n\"That'll come in handy. How quick are you at casting?\"\n\n\"I can get a fireball off before you can blink.\"\n\n\"Good enough for me.\" You pause, then consider something. \"How'd you know about my friends? There's not exactly much documentation on the real story.\"\n\n\"You five passed through Loren twenty years ago, right? You helped the Academy secure a magical artifact while you were in the area.\"\n\n\"... Yeah, we were. What about it?\"\n\n\"I was there. I was about seven at the time, and got to meet one of your friends. The mage woman.\"\n\nYour face darkens. \"Is that so?\"\n\n\"Yeah. She was nice. Told me about the quest you all were on, even gave me pointers on how to be a good mage.\" A faint smile appears on Iris' face as she recalls your friend, Grace. \"Even told me not to fall for some jarheaded fighter boy. I think it's obvious who she was talking about.\" Her smile shifts to a frown. \"A shame what happened to her... I know I was being rude, but I want you to know that I am sorry for your lo-\"\n\n\"Can it. I don't want your sympathy.\"\n\nIris glares at you, before shaking her head slightly and averting her gaze. The rest of the ride is silent, and before long the wagon stops. Oliver's voice pipes up from the front, \"There's a gap here between the outposts. If you keep pushing through the fields you should reach some woods, head through there and just keep going forward. Eventually, you'll get to Ornislov.\"\n\n\"Right,\" you say, climbing out of the wagon. Miller and Iris join you, and you see the wagon off as Oliver turns it around and begins driving back.\n\nYou're beginning the march to the forest when Miller stops you. \"I know a way to Ornislov that's faster, and bypasses the forest. However, it's much riskier and involves traveling out in the open. If we're lucky we'll get there much quicker.\"\n\nYou consider it. Miller warns that it's risky, but you're used to high risks. Maybe this path is worth a try?", "action_results": [{"action": "\"Fine, let's take your path. Be ready to fight, just in case.\"", "result": "Miller nods, then takes the lead. He begins heading southeast instead of the east you were expecting. \"If keep heading this way, then go around the forest and keep heading east, we'll get to Ornislov faster. I know a way in.\"\n\nYou quirk an eyebrow. \"You know a way in?\"\n\nMiller nods solemnly. \"I was sent there on a covert mission a few months. It's how we found out about the supply cache. Most of my team died, but I managed to escape.\" You nod at Miller's response, and continue following him. The sun is high in the sky, and on the horizon you can see Kishak troops marching. They wouldn't be able to spot you from here, but still, Miller gets down low. You and Iris follow his lead.\n\n\"Keep low, stick to the tall grass. If we're quiet enough, they won't stop us,\" Miller warns, then continues walking slowly. The process continues on, and after what feels like hours but must have been only ten minutes or so, the Kishak soldiers are long gone. Your team releases a collective sigh of relief and stands, continuing on at a much faster pace...\n\n... That is, until a bolt flies into your shoulder. You shout a curse in pain, then dive straight for the ground. Your companions follow suit. \"Are you okay, Sir Kit?\" Miller hisses urgently. You wave him off, then grip the bolt. You pull it out, slowly to ensure you don't tear any muscles, and let out a sigh of relief when it's out.\n\nIris scowls. \"Great thinking, Miller. You've just gotten us all killed.\"\n\n\"Damn it, keep quiet!\" Miller hisses.\n\n\"Both of you, shut up and let me think,\" you say. There's two options here: you can either run for the woods, exposing yourselves for a bit before getting to adequate cover, or you can sneak forward and attempt to take out the archer. Either way, you're putting great risk on you and your team.", "action_results": [{"action": "Run for the woods, it's the only way to ensure our safety.", "result": "\"We run for the woods and don't fucking stop. You two hear me?\" you ask. Miller and Iris nod, rather hesitantly. \"Alright. Good. Wait for my mark...\" You peek your head up slowly, above the tall grass. The lone archer kneels on the road, about forty yards away, and watches slowly. You wait until he's looking away from your current position, then nod. \"Now!\"\n\nThe three of you pull yourselves up and begin running for the woods. A few bolts fly past you, but none manage to hit you. You keep running, until you hear a shout behind you. Whipping around quickly, you see a bolt has managed to catch Iris right in the back, and she's fallen to the ground. \"Go, dammit!\" she shouts, pulling herself along. \"I'll be fine!\"\n\n\"Don't you die on me!\" Miller shouts, and moves to help her up. He gets a bolt through the neck for his troubles, and collapses to the ground. With no other options, you continue sprinting to the woods as fast as you can. You hear a shout from Iris, presumably having another bolt hit her, then another which is cut short.\n\nYour companions are dead. Again. And this time, it really is your fault. You suddenly find yourself stopping in place, no far from the edge of the woods. This bastard took out both of your allies just as you were beginning your quest. And by God, there's no way you're going to let him get away with it.\n\nYou unhook your sword from its chain on your back, and with a primal yell rush his position. Bolts fly your way, but it doesn't matter. He's going to die. Maybe you will, too, but his head will roll before yours does.\n\nYou raise your sword to deflect any bolts coming your way, and before long you're right up in his face. He fires a bolt which hits your gut, but doesn't have time to reload as you slam your sword into his shoulder, cleaving him in half. That takes care of that.\n\nYou drop to your knees and pull the bolt out of your stomach with a grunt of pain. The sounds of many men running hits your ears, and you turn your head to see the soldiers from before marching right for you. A ferocious grin spreads across your face. This is one way to go out, at least.\n\nYou raise your sword and meet their charge head on.\n\nTHE END", "action_results": []}, {"action": "Go for the archer, take him out before he alerts the others.", "result": "\"It's just a lone sniper out there, waiting. If there were more, they'd be firing volleys of bolts and arrows right at us. I'm going to sneak ahead and try to take that archer down. You two stay here and keep your heads down.\" Your companions nod slowly, still unsure of the plan. You poke your head up a bit, trying to spot him. There he is, about forty yards away. You duck back down and begin crawling towards him.\n\nIt takes several agonizing minutes, occasionally stopping to poke your head up and hoping he won't spot you, but soon enough you're within charging distance of the archer. You slowly unhook your blade from its chain on your back, taking a deep breath to ready yourself, before popping up and running straight for him. He manages to get a bolt off, hitting you in the thigh, but you carry on despite the wound and swing your sword at him. His head rolls on the ground not long after, and you pant.\n\nYou remove the bolt like you did the other one and look around. No one here yet. You shout back to your companions, \"Let's get going!\" Slowly, they rise from the grass. Miller takes the lead again, and the rest of the march goes on without incident.\n\nAfter a few hours of walking, you arrive at Ornislov just as the sun is starting to set. The city is more like a giant fortress, surrounded by walls on all sides with no obvious entry points aside from the gates. Miller leads you around the city walls, to a sewer grate. \"This is how we got in last time. Come on, get in.\" You and Iris crawl through the grate as Miller holds it open. He climbs in after you, shutting it.\n\nIris summons a fireball in her hand, keeping it held out to illuminate the area. The sewer tunnel stretches on for what seems like miles. There's a few latters every couple of yards, likely leading up into the city streets. Miller takes the lead again, walking past several ladders until he stops in front of one. \"This is it. Above is a warehouse, where all the supplies are kept. There's guards around, so we'll have to take them out.\"\n\nYou and Iris nod. \"Let's go.\"\n\nThe three of you begin climbing the ladder.", "action_results": [{"action": "Continue", "result": "Once you get above ground, you pause to examine the warehouse. It's bland and non-descript, made of wood and flanked on both sides by identical warehouses. Miller points out the one you're staring at. \"This is it. There's guards inside. Come on, I know a way inside.\" You and Iris follow him to the side of the warehouse. There, a single wooden door stands, which Miller cracks open slowly. No one in sight, at least for now.\n\nThe three of you step inside, crouching down low. There's guards patrolling the warehouse, hands on swords at their hips. You hear two of them having a conversation in Kishak. You whisper, \"Can I get a translation?\"\n\nIris nods.\n\n\"What are those two saying?\" You point out the two guards.\n\nShe listens in for a moment, then smiles slowly. \"They're talking about how boring warehouse duty is. Let's spice it up a bit.\" She conjures up an smoky green orb in your hand. You wonder what it is for a moment, before she shoots it straight at the two guards. A faint cloud comes into existence around them, and as they breathe it in their eyes sag. After a few moments, the two collapse, sleeping. Iris nods. \"Come on.\"\n\nThe three of you continue on like that, you and Miller keeping an eye out for guards while Iris takes them out quickly and quietly. Before long, the guards are all down, and the warehouse is yours for the taking. You approach the nearest supply box and open it, finding a large supply of food. You open the next, and find hundreds of crossbows. The next, hundreds of swords. It goes on and on, each crate containing an ungodly amount of supplies.\n\nNodding, you motion to Iris. \"Light it up.\" The mage nods, before summoning up a fireball and shooting it right at the nearest crate. Then, she summons another and fires it, then another, and another. Before long, the building is starting to go up in flames. It seems like your work here is done, and you ready to leave... Before you hear a shout in Kishak.\n\nA guard.\n\nHe runs straight for the front door and bolts before you can do anything, and the three of you share a look of shock. Then, Miller and Iris bolt, you trailing behind as fast as you can. The three of you get out of the warehouse and begin to open up the hatch leading into the sewers, while you hear a sharp horn go off in the distance. This is bad.\n\nMiller cracks open the hatch and motions for the two of you to get in. As you do, Iris fires off a few more fireballs at the other warehouses. \"Just in case!\" she says, before joining you on the ladder. Miller gets in right away, closes the hatch above you all.\n\nAs you three enter the sewers and then quickly leave it, the sounds of marching footsteps greet your ears. The Kishak soldiers are moving fast. They must have sent some to investigate the warehouses, while the others were sent to find you on the outside. The three of you take off into the night as fast as you can, keeping an eye out for soldiers.\n\nYou get about a mile away when you notice the squadron of soldiers following after you. They must be one hundred men in all, all bolting straight for you. \"We've got company!\" you shout to your companions, who quickly notice the threat and pick up the pace. The three of you continue on, then notice an old log cabin on the side of the road. Acting quickly, the three of you duck in there.\n\nMiller slams the door shut and immediately moves a nearby bookshelf in front of it. \"That won't hold for long,\" you warn.\n\n\"I know. It's more for my piece of mind,\" he replies, slumping down into a sitting position.\n\n\"What are we going to do?\" Iris asks. You and Miller don't give her an answer. \"We accomplished our mission, but now we're behind enemy lines with no chance of rescue. Are we just supposed to sit back and die?\"\n\nYou pat her on the shoulder, and nod. \"Afraid so. We did the right thing. They'll make martyrs out of us, probably.\"\n\nMiller sighs. \"So we're just supposed to give in and die, is that it?\"\n\nIris is fuming. \"No. We're not going to just give in and die. We're going to go out there and give them hell before we do.\"\n\n\"No use. There's one hundred of them and three of us. We'd be slaughtered.\" Miller places his face in his hands.\n\n\"Better to take at least a few of them with us before they kill us, right?\" Iris asks. \"What do you think, Kit?\"", "action_results": [{"action": "\"You're right. Let's give those Kishak bastards hell.\"", "result": "Iris smiles. \"I guess you are the real deal.\"\n\nDespite yourself, you crack a smile too. \"Yeah. I guess I am.\"\n\nMiller sighs, then stands up. He unsheathes his sword, and sighs. \"Well then, let's see to it that these Kishak sons of bitches meet their maker.\" He moves the bookshelf from the door, and looks to the two of you as he grips the door handle. \"You two ready?\"\n\n\"Ready as I'll ever be,\" Iris says.\n\nYou nod. \"Let's get this over with.\"\n\nHe pushes the door open, and the three of you move out as quickly as you can. There's at least one hundred Kishak soldiers in front of you, all armed with swords and axes and pikes and whatever else they have. The three of you stand side by side, readying your weapons; Miller takes a battle stance with his sword, Iris prepares an arc of electricity, and you grip your blade with both hands.\n\nThe Kishak soldiers charge, and the three of you meet them head on.\n\nTHE END", "action_results": []}, {"action": "\"It's pointless. Let's just... Wait it out.\"", "result": "Iris wrinkles her nose at you. \"Wait it out? The hell do you mean, wait it out? Wait until they burst in here and separate our heads from our bodies?\"\n\nYou sigh, sitting down on the floor. \"Something like that. We're going to die, might as well accept it.\"\n\nShe shakes her head. \"The man I heard about would have gone out and faced them head on, even if it meant death.\"\n\n\"Sorry to disappoint you, kid. But I'm not that man anymore.\" You pull your knapsack off your back and reach into it, finding one of the bottles of wine you had Bertrand stash for you. You sigh, then pop it open and take a swig. You hold the bottle out. \"Either of you want a sip?\"\n\nMiller grabs it first and chugs the bottle greedily. After a few moments, Iris snatches it out of his hands and takes a drink of her own, as if accepting defeat. She sits down on the floor with you and Miller, and the three of you pass the bottle around and drink for a while.\n\nThere's the pounding on the door as the Kishak soldiers try to get in. The bookshelf rattles with every hit, but it stands its ground. The three of you continue drinking. After all, you have all the time in the world.\n\nTHE END", "action_results": []}]}]}]}, {"action": "\"No, we'll take the path that was suggested. Let's get going.\"", "result": "Miller nods. \"Alright. We don't know of any outposts in those woods, so we should be able to get through undetected.\" With those words, the three of you continue on to the woods. You walk through the fields without incidence, and get to the edge of the forest in record time.\n\nThe three of you march through it, keeping an eye out. You're there for about an hour, continuing to march on, when you hear voices up ahead. The three of you stop in your tracks and get down low, listening. The voices are speaking Kishak. You turn to face your companions. \"Can I get a translation?\" you ask.\n\nIris nods, and listens to the voices. Her face goes pale. \"... They're talking about how boring it is to be in an outpost in the middle of the woods.\" You and Miller share a look of surprise, then turn to face the direction of the voices again. A new outpost, one that the military didn't know about.\n\nMiller pipes up. \"We go around it as slowly and carefully as we can.\"\n\nIris shakes her head. \"It can't be that many. We go in there and light them up.\"\n\nLooks like it's up to you to decide what to do.", "action_results": [{"action": "We'll go around like Miller suggested.", "result": "You shake your head at Iris. \"That's a damn stupid idea. We go around it like Miller suggested, keep low to the ground. If we're lucky, they won't see us.\"\n\nMiller nods in approval, while Iris scoffs. The three of you keep low as you move to head around the voices. As you push through the greenery, you notice the outpost. It's large and well-fortified; surprising, considering its location. Must be some sort of well-kept or something of the sort. There's a dozen Kishak soldiers wandering around, keeping an eye out.\n\nThe three of you continue walking. There's a few times when you're sure you'll be spotted, but soon enough you manage to move far away enough from the outpost that you can walk normally again. Your team releases a collective sigh of relief that you're out of there. The three of you continue through the forest without incident.\n\nAfter a few hours of walking, you arrive at Ornislov a couple of hours into the night. The city is more like a giant fortress, surrounded by walls on all sides with no obvious entry points aside from the gates. Miller leads you around the city walls, to a sewer grate. \"This is how we got in last time. Come on, get in.\" You and Iris crawl through the grate as Miller holds it open. He climbs in after you, shutting it.\n\nIris summons a fireball in her hand, keeping it held out to illuminate the area. The sewer tunnel stretches on for what seems like miles. There's a few latters every couple of yards, likely leading up into the city streets. Miller takes the lead again, walking past several ladders until he stops in front of one. \"This is it. Above is a warehouse, where all the supplies are kept. There's guards around, so we'll have to take them out.\"\n\nYou and Iris nod. \"Let's go.\"", "action_results": [null]}, {"action": "We'll take them down like Iris suggested.", "result": "You shake your head at Miller. \"Remember, this'll make it easier for the military to come through the area. If we're quick and efficient, we'll barely miss any time.\"\n\nIris nods, smiling in approval that you agreed with her.\n\nMiller sighs, shaking his head. \"I don't like it.\"\n\n\"Too bad. That's what we're doing. Now come on, let's go.\" You get up, unhooking your sword from your back, and march towards the voices. As you break through the brush and step into view of the outpost, you're surprised to find a well-defended fort instead of a dingy wooden watchtower like you were expecting. A dozen or so Kishak wander about, waiting for an attack.\n\n\"Shi-\" Iris' curse is cut off when a bolt flies into her throat, and she collapses to the ground. She twitches for a moment, then goes still. A horn blows, and the soldiers all turn to you. Miller unsheathes his sword and charges at the nearest Kishak soldier, impaling him. He doesn't last long either, however, as a bolt flies true and hits him in the chest, followed by another. For added measure, a soldier runs up and runs his spear through Miller's gut. The knight falls to the ground, dead.\n\nThe remaining soldiers turn to you. You sigh, shaking your head. Dumb move. Shouldn't have done it. Now you're dead for sure.\n\nYou grin, however. Doesn't mean you won't go down without a fight.\n\nYou charge forward with a primal yell, meeting the soldiers head on.\n\nTHE END", "action_results": []}]}]}]}]}]}]}, {"action": "I've nothing better to do. I'll go to Castle Oren.", "result": "You shake your head slightly, before shrugging. There's not much you do in your day to day life, and at the very least, this is something. \"Bertrand,\" you say. \"Get to packing my things. I'm going to Castle Oren at dawn.\" Your servant seems very surprised by this, but immediately leaves the room to get a knapsack for you. He comes back not long after and begins packing the essentials: changes of clothes, a tinderbox from your dresser, and lantern oil, along with some of the bread and wine he came to give you.\n\nHe nods to you, taking the knapsack. \"I'll pack it in your carriage, sir. In the morning we'll go.\" With those words, he leaves the room. You sigh, before popping open the remaining bottle of wine and beginning your daily routine. By nightfall, not a drop remains of the wine nor a crumb of the bread. The weight of the situation hangs heavily on you: tomorrow, you're going to leave your home for the first time in years to fight a war that isn't yours to fight for a man who will never care for you. It's enough to make you reconsider your plans. Almost.\n\nAt least, this is something you can use your talents for. Twenty years and your blade hasn't tasted a drop of blood. You feel as though you're getting rusty, that your time is long past, and it would be best to turn this offer down... No. You need to prove to yourself that you can still do this. Age means nothing for a person with your raw strength and skill, and you could kill four times as many men as a soldier half your age and twice your size. You were always told that you had a warrior's heart. Soon, you shall reaffirm it once and for all.\n\nWhen the sun dawns on the horizon, you get up and get dressed into practical clothing. Then, you grab your old sword, giving it an experimental swing at the air. It's large, only a bit shorter than your tall frame, and almost as wide as your torso. A greatsword that no man but you could wield. After hooking it onto your back, you head down to where your carriage is stored. Bertrand is already there, waiting for you in the driver's seat. \"I packed some of my things as well, sir. Hope you don't mind me coming with you,\" he says. You nod, getting into the passengers seat. He spurs the horses into action with the reigns, and the two of you begin the ride to Castle Oren.\n\nYou pass through a town on the way there and pass by several small hamlets. The sun is high in the sky when you see something on the horizon: a group of men sifting through a broken down carriage on the road. The men are dressed in fur and hides, and have chipped and dented axes at their sides. Highwaymen, bandits who prey on anyone daring to go from one place to another by the main roads. It makes you sick just looking at them. Then, you hear a woman's scream from the carriage. A noble lady in fine clothing runs from the carriage, screaming all the while. The highwaymen chase after her, abandoning the carriage.\n\nYou grip your blade...", "action_results": [{"action": "... Then jump out and chase after the bandits, intent on killing them.", "result": "Damn these sick bastards. Robbing and killing the innocent. You jump out of the carriage and begin to chase after them. Faintly, you hear Bertrand yelling at you, but the pounding of your head as a cold rage runs through you blocks out any sounds but the woman's screams. You chase the highwaymen down; it doesn't take long, you find them just as one tackles the noble woman to the ground. The others haven't noticed you yet.\n\nYou draw your blade, making sure that the chain keeping it tied to your back clinks loud enough for them to hear. They whip around, glaring at you; their eyes hold a mixture of primal rage and fear. One bares rotting yellow teeth at you, snarling like a dog. You put both hands on your sword, keeping a firm grip on it, waiting for them to make the first move. You don't have to wait long, as Yellow Teeth runs at you screaming, flailing two axes around as though he's a barbarian of the Northern Wildlands. You smoothly sidestep his charge, then bring your sword down at his legs. His upper body is sent flying upwards as your sword slices through his thighs and out the other side.\n\nThe other three highwaymen stare at their dying ally, the fear overcoming their rage. You draw your sword back and swing at nothing, the blood flying off. Droplets land on their faces. \"Leave the woman alone, or you'll wind up like your friend,\" you say. To seal your threat, you take a step forward, and they immediately back off and begin running. You draw a dagger from your boot, stabbing it into the dying bandit's throat as you approach the woman to make sure she's okay.\n\n\"Hurt?\" you ask, kneeling down next to the noble woman as she lays on the ground. She's hyperventiliating, looking around with wild eyes, before turning over and vomiting on the grass. You pat her on the back to help her get it out, then shake your head. \"It's normal the first few times something like this happens. Once the adrenaline wears off, you feel sick to your stomach. Get up.\" You offer a hand, which she accepts.\n\n\"T-thank you, sir. I can never repay you. Those... Those thugs attacked my carriage, killed my driver and the stole all my valuables. I... I don't know how I can make it back home.\" She sighs, shaking her head. \"I'll just have to walk, I suppose.\"\n\n\"Where were you going?\" you ask, already wishing you hadn't.\n\n\"Elkstern Keep. Have you heard of it?\"\n\nYou have, actually. It was one of the stops on your journey twenty years ago... And is in the opposite direction of Castle Oren, about two hundred miles away in fact. You'd have to arrive much later or even cancel your trip if you were to escort her.", "action_results": [{"action": "Damn it all, I'm too soft for my own good. I offer to escort her.", "result": "You mull it over for a moment, before groaning internally at how soft you've gotten. \"I can drive you. It's far out of the way of my destination, but I need to see you safe.\" Perhaps that was a bit too much, but the woman gives you a shaky yet radiant smile anyhow.\n\n\"You will, sir? Oh thank you, thank you!\" She leaps up, giving you a bear hug. Your arms stay limp at your side.\n\nYou wait a moment for her to let go. Then another. Then one more. Finally, fed up with this contact, you push her arms off of you. \"We must get going,\" you say. She nods, withdrawing from you and falling into step as you walk back to your carriage.\n\n\"What's your name?\" she asks. \"I am Lady Caroline of House Rorens, Fairest Lady of The Western Woodlands.\"\n\n\"Kit of Droburg,\" you reply, shaking your head slightly at the woman's title.\n\n\"Kit of Droburg? Are you not the same Kit that saved our kingdom two decades ago?\"\n\n\"The one and only. And before you start, don't you dare start worshiping the ground I walk on.\"\n\n\"I wouldn't dream of it, Sir Kit. It is an honor to meet you.\"\n\nThe conversation drifts off just as the two of you reach the carriage. Bertrand is keeping watch, having dug a crossbow out of the back of the carriage. \"Ready to get going, sir?\" he asks, but you shake your head.\n\n\"Change of plans. We need to make sure Lady Caroline here gets safely to her destination. Elkstern Keep, about two hundred miles west.\"\n\nBertrand's eyes practically bulge out of his head, yet he keeps his voice level and calm. \"That's far from Castle Oren, sir.\"\n\n\"I know,\" you say, grunting as you climb onto the carriage, \"but I'm sure the king will understand our tardiness.\" You wait for Caroline to get into the back, then turn to Bertrand. \"Let's get going, eh?\"\n\nHe sighs, before nodding. Spurring the horses on, Bertrand turns the carriage around and begins heading west, in the direction of Elkstern Keep. You have a ways to go, but you know that you made the right choice doing this.\n\nThe carriage carries on into the horizon.", "action_results": [{"action": "Continue", "result": "The ride to Elkstern Keep is mostly quiet. Occasionally, Caroline tries to break the silence in an attempt to get to know you, but your grunts and shrugs to her questions discourage her. Bertrand stays silent every time she tries to talk to him. She probably wasn't expecting something like this, but at the very least she's getting to her destination in one piece this way.\n\nA few hours later, you're forced to stop for the night. You use your sword to cut down a small tree, splitting it up into smaller logs to build a fire. As the fire rages, Bertrand sets a few strips of meat on a small metal pan and holds it over the fire. The only sound is the crackling of the fire and the sizzling of the meats; that is, until Caroline decides to speak up. \"So where were you two going before you picked me up?\" she asks.\n\n\"Castle Oren,\" you reply.\n\n\"Castle Oren? I was just leaving there. I was negotiating with the King, he wants to buy some land near Elkstern Keep that's under my domain. He was talking about building a second castle there.\"\n\nIt is Bertrand who replies to that: \"Why would he want to do that?\"\n\nCaroline shrugs her shoulders. \"I don't know. Castle Oren is rather old, but it's in great condition. Maybe the King wants to relocate?\"\n\n\"It could be because of the war,\" you suggest.\n\n\"I've heard the war has been going as it usually does: no real advances on either side. Just an uneasy stalemate occasionally breaking out into a scuffle over the border towns.\"\n\n\"Perhaps the King fears it won't be like that for long, and wants to fall back. Castle Oren is only a few miles from the border, after all.\"\n\n\"Fair point.\"\n\nBertrand pulls the pan away from the fire as the strips are done cooking. He takes a few strips of meat in hand then passes the pan to you. You do the same, then pass the pan to Caroline, who looks at it strangely. \"Aren't you going to eat?\" you ask.\n\n\"Yes. I'm just not used to this is all.\" She hesitantly plucks a strip from the pan, giving it a cautious nibble. She sets the pan down on the ground and continues nibbling slowly on the strip of meat. By the time she's finished her first one, you've been finished for a few minutes and are laying down to sleep.\n\nIn the morning, the three of you pack up your things and get back into the carriage. You estimate that you're about a week's ride from Elkstern Keep, if you keep this pace up. Maybe you and Bertrand can alternate between driving the carriage while the other sleeps in the back to make the most out of the time you have.\n\nIt's about midday when Caroline finally pipes up from the back: \"So tell me, why were you going to Castle Oren?\"\n\nFeeling in a generous mood today, you reply, \"To meet the King.\"\n\nCaroline laughs. \"Well of course you were meeting the King, but why were you meeting him?\"\n\n\"He wanted my help with the war effort. Drive the Kishak back to their own country.\"\n\n\"Really?\"\n\n\"Yes.\"\n\n\"I suppose there's no one who could do the job better. That man, the other day... I take it he wasn't the first one you've killed?\"\n\n\"Wasn't the first, likely won't be the last.\"\n\nShe's quiet for a moment, likely considering your answer, before piping up again. \"... What was the first one like?\"\n\nYou consider the question for a moment. Your first kill. You haven't thought back on that day in a long time. It was about a week into your journey, and you and your companions had gotten into quite a bit of trouble. A group of Marauders, vicious barbarians and raiders, had ambushed you on the road. They weren't interested in killing you like most, though; no, they had something much more sadistic in mind.\n\nYou can still remember the screams. Just a kid, a year younger than you were. Had his whole life ahead of him. And they peeled the flesh from his bones. Took their time. Used a jagged rock. Lasted for hours. Felt like years. When the screaming stopped they were still peeling the meat off him. Cooked it. Ate it. Would've been you next. Fortunately for you they got distracted and left a single guard there.\n\nYou can still remember the way he struggled under your firm grip. Busted down the rusty cage door and charged right for him. Tackled him next to the fire. Choked him out for a bit. When that proved to be taking too long, you grabbed the pot of water boiling over the fire. Poured it all over his face. The scalding hot water peeled the skin from his face, and he screamed louder than the boy did. You shut him up by smashing his skull in with the pot.\n\nWhen you freed your friends and escaped, they didn't look at you the same way for a while. You did what you had to do. You knew that. They knew that. Two weeks had passed when they started acting normal again. But you remember the looks in their eyes, remember the fear they held. That day you proved what you were capable of, and they were terrified of you until the day they died. You wish you could take it all back.\n\n\"Sir Kit? Were you going to tell me?\" Caroline's voice snaps you out of your recollection. She looks concerned. \"You've been spaced out for a few minu-\"\n\n\"Stop.\"\n\n\"What?\"\n\n\"Stop. Stop asking questions you don't want to know the answers to.\"\n\nFor a moment, there is silence. Then, you hear the cover of the wagon being drawn back, indicating that Caroline has retreated back into it. You sigh, then dig one of the bottles of wine out of your knapsack. You need it.\n\nBertrand doesn't ask questions when he sees you drinking. Just nods and continues driving.", "action_results": [{"action": "Continue", "result": "The next day of your trip goes by quietly. There's nothing but the open road ahead of you. Any travelers pass you by without a second thought, and aside from Bertrand and Caroline you haven't interacted with anyone since the highwaymen. It's peaceful, almost too peaceful; usually it means something will happen, and it comes when you least expect it. Of course, your gut is right on this one.\n\nOn the third day of traveling, just a day or so away from Elkstern Keep, you come across a bridge and force Bertrand to stop. The bridge is large, wide enough to fit three carriages side by side and about half a mile long. It stretches over a canyon, a long drop into a rapid river below. You see men in ragged clothing milling about; they haven't seen you yet, but if you move forward they will. By their looks, they won't be too friendly.\n\nIf you tried to go around, you'd lose a day of time. Safer, yes, but you really just want this to be over and done with. The bridge is risky but you're sure that you can defend the carriage. You look to Bertrand and nod. \"Keep going.\"\n\nHe nods, spurring the horses into gear. \"Think we'll run into any opposition, sir?\"\n\n\"Not sure. Probably, though. Keep that crossbow ready.\" Bertrand nods and grabs the crossbow with one hand, keeping the other on the reins. The carriage continues on, heading towards the bridge. You draw closer to the men, who turn their heads and finally see you. Quickly, they start moving, grabbing weapons and preparing for you to come by. You notice one poking his head out.\n\n\"Take that one out!\" you point him out to Bertrand, who shifts the crossbow and fires. The bolt flies true, hitting the man in the forehead. He slumps over, and his companions immediately open fire with a volley of arrows and bolts. You raise the flat of your sword and hold it up, using it as a makeshift shield. You and Bertrand are spared from most of them, but an arrow manages to hit him in the leg.\n\n\"Shit!\" you shout, then jump off the carriage and begin sprinting towards the men. They shift their focus from the carriage to you, firing more arrows and bolts in your direction. You keep your sword raised to deflect any projectiles coming your way, and through sheer luck, you manage to get to the men with only the faintest of grazes to show for it. They back off and drop their ranged weapons, readying knives and rusty swords.\n\nYou swiftly dodge the first swing that comes your way, then back hand the man who attacked. He staggers back with a split lip, and you move in fast by smashing his face with the pommel of your sword. He falls to the ground, dropping his sword and clutching at his broken nose. You don't have time to finish him off, as another blade comes your way, then another, and another. Raising your blade, you deflect most of the blows and dodge others. However, one of the bridge men gets a lucky hit through, cutting your side. You hiss in pain but push on.\n\nQuickly jumping back, you assess the situation. There's still more down the way, keeping crossbows and longbows at the ready, while there's a group of about six heading right for you. They're all clustered up close, as though they believe that will make it harder for you. If anything, it'll make it easier.\n\nYou rear your sword back, waiting for them to get close enough...\n\nThen swing.\n\nThe massive blade cuts through three before it gets stuck in the ribcage of the fourth one. The three you managed to hit fall to the floor in pieces, flecks of blood spraying onto you and their remaining allies. You pull your sword out of the fourth man, who falls to his knees and screams in agony for his mother, before swinging yet again. His cries are cut off as the blade cuts through his skull, and out the other side to take down the remaining two.\n\nYou pant, catching your breath. You don't have long though, as a bolt flies true and lands in your shoulder. You stumble back with a curse, and nearly fall into the canyon were it not for the rail you grabbed onto. A horn pierces the quiet of the bridge, and you know what it means: they're calling for reinforcements. You're not sure if you can take on these men, let alone more.\n\nThe river is seeming awfully tempting. Maybe you can survive the fall and be carried away to some place safer...", "action_results": [{"action": "No. I've got to defend my companions. I'll fight as long as I have to.", "result": "You steel yourself and stumble away from the edge of the bridge. No. You're not going to let them down. Using that stored up adrenaline within you, you push forward with a primal yell, charging straight for the archers. They fire at you, but you ignore the arrows and bolts flying your way. Occasionally one manages to graze you, a scant few even hit you, but you ignore it as best you can. You've got a fight to win.\n\nThe first one loses his head. The seconds his arms, then a stab through the chest. The third drops his crossbow as if in surrender, only to be sliced clean in half. You continue on like this, no longer seeing men but instead an army of targets you need to tear down. Half way through these ones, more targets come running down the bridge. You finish off the remaining archers, then ready yourself in preparation for the others.\n\nYou're not sure how long the fight lasts. All you know is that by the end of it, you're using your sword to keep yourself standing. The carriage slows to a stop, and Bertrand hops off to help you into the back of the wagon. You're still on edge enough that you snarl at him, like a wild hound defending its territory. He doesn't back off, and soon you're lying on the floor in the back of the wagon.\n\nA woman is there, digging through your supplies and pulling out a roll of bandages. Caroline. She sets to work immediately, pulling out bolts and arrows and wrapping them up as best as she can. Her hands are left bloodied from the work, but in the end you're much better off than you were. She smiles. \"You'll get proper healing at Elkstern Keep.\"\n\nShe continues speaking, but the words fade away, and you slip into unconsciousness.", "action_results": [{"action": "Continue", "result": "When you wake up, it's in a bed. You're covered in bandages, and though your body aches it seems your wounds are gone. There must be a healer here. In the bed to your right, a person stirs, and you shift to get a good look at them. There lays Bertrand, flipping through a leather bound book. \"I see you still live, sir,\" he says, dog-earing the page he's on and closing the book.\n\n\"Sorry to disappoint you,\" you chuckle.\n\nA small laugh escapes Bertrand's lips. \"No, sir. I'm happy to see you're still among us.\" He pauses. \"We got here yesterday afternoon, sir. The healer set to work immediately. You'll be okay if you rest for a few days.\"\n\n\"That so? Where's Caroline?\"\n\n\"She's still here, sir. Likely in her chambers. She said she'd come visit later.\"\n\n\"Alright.\" You sigh and close your eyes. You made it to Elkstern Keep, and you and Bertrand are still relatively intact.\n\nYou consider what you should do now. You'll be extremely late for your meeting at Castle Oren. The King may not like it, but if he truly needed you, he'd excuse it. Still, something about this... Felt better than fighting some meaningless war you have no investment in. Maybe...\n\nYou must have been thinking for much longer than you thought you were, as Caroline steps into the infirmary and immediately gives Bertrand a bear hug. Your servant pats her slowly on the back, and she breaks away after a moment to move onto you. The hug is so tight, it makes the aching turn into a sharp sting, and you hiss in pain. Caroline withdraws.\n\n\"I'm so glad you two are alright. Thank you for all that you've done for me, I can't repay you,\" she says.\n\nYou wave your hand and shake your hand. \"No, no, everything is fine. Just letting us rest here a few days is good enough.\"\n\nShe gives a worried look. \"Are you sure? I can give you supplies, or money, or...\"\n\n\"Nothing. It's fine. Thanks for visiting us.\"\n\nCaroline nods. The three of you talk for a while, though it's mostly her thanking you profusely and continually offering help, which you turn down. After about an hour, a man comes in and informs her that she's needed in the entrance hall. Caroline sighs, but nods at the man.\n\nBefore she leaves, she turns to you and Bertrand one last time. \"I know I've been saying it a lot, but thank you from the bottom of my heart. If you hadn't saved me and escorted me here, I don't know what I'd have done.\" With those words, she departs.\n\nAfter she leaves, you once again wonder what you'll do now.", "action_results": [{"action": "Maybe I can keep helping people. Damn the King and his war, I'll help people in other ways.", "result": "Yes. You can keep helping people. That's what you should do, what your friends would have wanted you to do. It's what the hero you used to be would have done in this situation. As much as you've tried to drown that boy with alcohol, you know that deep down he's still in there. Maybe, it's time to let him back out.\n\nYou voice your thoughts to Bertrand. \"Damn the King's summons. After all this, I think I want to keep helping people. Will I have you by my side, Bertrand?\"\n\nYour servant smiles at that. \"Of course, sir. I was hoping you'd say that.\"\n\nYou nod your head a few times. \"Okay. Okay.\"\n\nFor now, you have a few days to rest. When you're done, you'll leave Elkstern Keep, and set out to right any wrongs you find. After all, that's what a hero does.\n\nThe sun is high in the sky. It's a new beginning.\n\nTHE END", "action_results": []}, {"action": "My plans remain the same. I'll head straight for Castle Oren. I'm sure the King needs me, and won't mind.", "result": "Yes. The King summoned you, and you won't ignore those summons. Being a wandering hero is appealing, but this way you can help the kingdom in a much more substantial way. Winning a war? You'd save the kingdom, and drive the Kishak menace away from it. You'd be a hero yet again.\n\nYou voice your thoughts to Bertrand. \"Our plan remains the same: we'll head straight for Castle Oren when we recover. Will I have you at my side, Bertrand.\"\n\nBertrand nods. \"Of course, sir. We'll get there and finish this war.\"\n\nYou nod your head a few times. \"Okay. Okay.\"\n\nFor now, you have a few days to rest. When you're done, you'll leave Elkstern Keep, and head straight for Castle Oren. After all, you have a duty, and you must see it through.\n\nThe sun is high in the sky. It's a new beginning.\n\nTHE END", "action_results": []}]}]}, {"action": "They're on their own. I'm getting out of here, while I still can.", "result": "This is too much, even for you. Hell, for all you know, the archers down the bridge have already taken out Bertrand and you're just defending a corpse. The only way you're going to survive this is if you give into your fight or flight instincts; right now, your entire body is screaming flight. Taking in a deep breath and mumbling a quick prayer to whatever god will hear it, you jump off the bridge into the river below.\n\nThe water is freezing, you note, and pushing you at a breakneck speed. Occasionally you bump into a rock and feel as though you're about to lose consciousness, but the fear of drowning keeps you awake as you struggle to keep your head above the surface. By the time you wind up on land, it feels as though you've been at this for hours, when really it's only been a few minutes at most.\n\nYou crawl on hands and knees away from the river, heaving up water and bits of your breakfast on the gravel. Pushing forward, you note that you're in a forest of snow covered pine trees, despite it only just being fall. Then again, you've been heading towards a much colder climate, so this is to be expected. Shivering, you push yourself up on the ground and hook your sword onto your back. There has to be some sort of shelter around here.\n\nYour walk through the forest lasts most of the day, and by nightfall you're sure you'll freeze to death out here. However, luck is on your side; you spot a faint glow not far from you, and push towards it. What you see is a cabin, light from a lantern pouring out of it... The problem, however, is the spikes planted into the ground with heads stuck through them. Whatever this is, it's bad news.\n\nYou consider your options: freeze to death out here, or take your chances fighting whoever is in there.", "action_results": [{"action": "I need warmth. I'll kill whoever is in there, and feel no guilt over it. Whoever's in there is a monster.", "result": "You unhook your blade and stalk towards the cabin, ready to swing at the slightest twitch of movement. Pushing the door open, you step inside with sword at the ready. You find a single man there, clothes ragged and dirty with unkempt hair and beard. In his hands is a single human arm, a woman's by the looks of it. He turns to look at you, and gives you a blank stare.\n\nThen, a blood-tinged smile.\n\nYou swing your sword, splitting his skull open like an overripe watermelon. Pulling the sword out of his corpse, you swing again. Then again. And again. And again. And again. You keep swinging until there's nothing left to hit. Even then you keep at it, busting up the bloodied floorboards and reducing the mush that's left of him to bloody stains. Finally, you drop your sword and collapse. The exhaustion overtakes you, and you fall into a sleep before you even realize it.\n\nWhen you wake in the morning, you feel warmed up after the night in the cavern. You quickly dig through any containers you find. There's not much, but there is a spare set of the cannibal's clothes. It looks like it's just about your size, and made of animal hides. Good enough in this climate. You remove your soaked clothing slide into the outfit, making sure it fits.\n\nWith nothing left to do, you set out from the cabin and into the forest. There has to be a town somewhere.\n\nTHE END", "action_results": []}, {"action": "If it's a choice between being gruesomely maimed and killed or slowly freezing to death... I think I'll take the latter.", "result": "There's no way you're going in there. You barely have enough strength to walk, let alone fight off whatever bastards are in the cabin. If you're going to die anyway, you figure you're going to do it on your own terms, and walk away from the cabin.\n\nYou continue on into the night, feeling the cold wind slowly freeze your soaked clothing. Ice clings to you, and you feel your strength slowly fading. You're not sure how much longer you can keep walking, so you should at least make sure you're comfortable. Slowing down, you set your back against a tree, and slowly slide down into a sitting position.\n\nYour breathing is slowing down.\n\nYou can feel your heart beat every couple of seconds.\n\nIt's so cold out here.\n\nMaybe you should rest.\n\nYou close your eyes.\n\nYeah, rest sounds good.\n\nTHE END", "action_results": []}]}]}]}]}, {"action": "I'll just have to wish her luck and give her directions to the nearest town.", "result": "You sigh, shaking your head. \"Wish I could help you, but I have urgent matters to attend to and Elkstern Keep is too far away. There's a town about ten miles down the road, a few small villages and hamlets along the way. Maybe you can see if a caravan is heading there.\"\n\nShe nods. \"Thank you again for saving me, sir. I'll head there now.\" You walk her to the road, and see her off. Bertrand watches from the driver's seat of the carriage, a loaded crossbow in his hands. After the noble woman is no longer in sight, you climb back up and sit next to Bertrand.\n\n\"Shall we go now, sir?\"\n\n\"Yes. Let's go.\"\n\nBertrand spurs the horses into action, and the two of you continue on. You're forced to set up camp for the night along the road, but you can see Castle Oren in the distance. You'll be there not long after you get up in the morning.\n\nYour blade rests in your lap as you clean it with a rag and some water. Bertrand stirs the fire with a stick, then quirks a brow at you. \"Why did you agree, sir?\"\n\n\"Agree to what?\" you ask.\n\n\"Agree to go to Castle Oren.\"\n\nYou sigh, shrugging your shoulders. \"Not entirely sure of that myself. I just figured it was better than wasting away at home.\" You pause, and trace a finger along the flat of your blade. \"... Truth is I feel like I need to prove something to myself. That I still have what it takes.\"\n\n\"Judging by the blood I saw on your blade, you still do.\"\n\nA mirthless chuckle escapes your lips. \"Maybe. Maybe I just got lucky. Sword this size, I could cut a horse in half once I get it going. There's no skill involved when it comes to wielding a blade like this, only blind luck.\"\n\nBertrand nods. \"I should be turning in now. I suggest you do too.\" He gets up from the fire and lays down on a blanket he has sprawled out, closing his eyes and drifting off to sleep in moments. You watch his sleeping form for a moment, before setting your sword down and laying on your own blanket. Though you toss and turn for a bit, exhaustion takes over and you fall into your first dreamless sleep in years.\n\nIn the morning, you and Bertrand pack your things up and begin the last stretch to the Castle.", "action_results": [{"action": "Continue", "result": "You arrive at Castle Oren around lunch time. The castle is large and imposing, made of stone that has gathered a fair bit of moss over the years. It was built a thousand years before your time, and still stands after all this time with only minor renovations to keep it up. A town surrounds the castle, full of shops and inns and homes and other assorted buildings. People mill about, paying you no mind as the carriage rolls up to the castle gates.\n\nThe guards there stand at attention, waiting for you to make a move. A young man in knight's armor approaches your carriage. He takes his helmet off, revealing a youthful yet stern face with sandy blond hair and grey eyes. The knight salutes you. \"Sir Kit?\" he asks. You nod, and the man smiles. \"My name is Sir Miller of the Gold Hawk Knights. Welcome to Castle Oren.\" He nods at the guards, who open the gates. Your carriage rides through, and Miller follows.\n\nInside the castle grounds, you park your carriage and climb off. Bertrand stands behind you, while you address Miller. \"When can I see the King?\" you ask.\n\n\"Come along, I'll take you to him.\" Miller walks away. You follow closely behind, examining the castle grounds. The courtyard leading into the castle is home to many trees and flowers, a few of which you've never even seen. The King's gardeners must take their work very seriously.\n\nYou head into the castle proper, in an entrance hall that doubles as a throne room. The King is nowhere in sight, and Miller continues on past the throne and to a door not far from it. As you step into the room, you see a man in fine clothing sitting at a desk. The desk houses a golden crown. The King is around his mid thirties, though the wrinkles in his face and the gray streaking his hair indicates a man at least a decade older.\n\n\"Your highness. Sir Kit has arrived,\" Miller says. The King looks up from his writing at you, and gives a faint smile. He waves Miller off, and the young knight departs from the room. Bertrand follows close behind, assuming the King doesn't want an audience.\n\n\"Sir Kit. It is an honor to finally meet you.\" The King stands from the desk and approaches you. He's only a bit shorter than you, impressive considering your bulky stature, though his posture and build indicates he's never been a fight before. He sticks out a hand for you to shake, which you do.\n\n\"The honor is all mine, your highness,\" you say, though rather half-heartedly.\n\nThe King laughs. \"Let's skip the formalities. Call me Walter. We're not here to discuss something officially.\" His face darkens. \"I called you here because I need someone to weaken the Kishak Empire, so that my army can strike the final blow against them.\"\n\n\"I see.\"\n\n\"I need someone who doesn't mind getting their hands dirty, Sir Kit. I need a warrior such as you. I take it whatever you face on this mission will be enough for you to handle, and I'll be sending you backup anyhow.\"\n\n\"What's this mission you're sending me on?\"\n\n\"My spies in Kishak have uncovered the location of the Empire's supply cache: in the heart of their capital city. If you can destroy the supply cache, there goes all of the Kishak army's food, weapons, and gunpowder. They'd be running on what they have left, and soon enough that would run out and my men would be able to drive them back.\"\n\n\"... This sounds like a suicide mission.\"\n\nThe King nods slowly. \"Perhaps. But if you manage to see this mission through, the war will be won by next year. Would you not want to see an end to this war that has claimed so many lives? An end to a war your grandfathers would have fought in, and your grandchildren will fight in if it doesn't end?\"\n\nYou shake your head, chuckling. \"You're wrong there. My grandfathers were simple farmers, and I don't have children. This war means nothing to me.\"\n\n\"Maybe it doesn't. But think of the millions of lives that have been lost to it, and the millions of lives you will save by ending it.\"\n\nYou sigh. At the very least, this is something to do.\n\n\"Fine. Let's get prepped for this suicide mission.\"", "action_results": [null]}]}]}, {"action": "... Then let it go. Best to get out of here while they're gone.", "result": "Your hand falls from your sword. \"Let's go, Bertrand. We've got time while they're distracted to beat a hasty retreat.\"\n\n\"But sir,\" Bertrand begins to interrupt before you silence him by holding up your hand.\n\n\"I don't want to hear it. Get going.\"\n\nHesitantly, Bertrand nods and spurs the horses on. They walk past the overturned carriage and continue down the road. The woman's screams penetrate the otherwise silent countryside, until they are finally silenced.\n\nNightfall comes sooner than you'd like. You're forced to set up camp for the night along the road, but you can see Castle Oren in the distance. You'll be there not long after you get up in the morning.\n\nYour blade rests in your lap as you clean it with a rag and some water. Bertrand stirs the fire with a stick, then frowns at you. \"We should have helped her.\"\n\n\"Hrm,\" you hum.\n\n\"The man I agreed to work for would have saved her. What the hell even happened to you?\"\n\nYou sigh, shaking your head. \"I don't know. I'm just not that kind of man anymore.\" You pause, and trace a finger along the flat of your blade. \"... Just an old dog called in to do the king's dirty work. Nothing more, nothing less. There's no more heroes in this world Bertrand, and the sooner you accept that, the sooner life gets easier.\"\n\n\"You don't know what you're talking about.\"\n\nA mirthless chuckle escapes your lips. \"Maybe I don't. Can you blame me, though? I'm just a bitter old drunk. It'd be best if you just ignored what I say.\"\n\nBertrand sighs. \"... I should be turning in now. I suggest you do too.\" He gets up from the fire and lays down on a blanket he has sprawled out, closing his eyes and drifting off to sleep in moments. You watch his sleeping form for a moment, before setting your sword down and laying on your own blanket. Though you toss and turn for a bit, exhaustion takes over and you fall into your first dreamless sleep in years.\n\nIn the morning, you and Bertrand pack your things up and begin the last stretch to the Castle.", "action_results": [null]}]}]}]}]}