{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=23928", "context": "", "first_story_block": "The wintry winds howl a horrible wail, whipping white watery snow against the weathered watchtower’s westernmost wall. Yes, it is indeed a dark and stormy night, but darker and stormier and maybe just a tad more purple than your run-of-the-mill dark and stormy night.\n\n\nSomewhere deep in the forest a unicorn frolics in a magical glade, as elves watch and scamper amongst the trees, polishing their bows with the blood of dwarves.\n\n\n“Killed a big fat one today, Elfrond,” says Elfmoor. “Bastard was trying to chop down a cherry tree. Can you believe it, a fucking cherry tree? Sacrilege.”\n\n\n“Have you ever wondered why we hate the dwarves so much?” asks Elfrond.\n\n\n“What do you mean? They’re fucking dwarves! And this one chopped down a tree. A cherry tree. Only thing that rivals my love of trees are cherries. And music. And song. And like five other things.”\n\n\n“Yeah, I’ve just been thinking lately. How did we get these sweet bows, if we didn’t chop down a tree to shape them. And how do we burn fires without firewood? And why exactly do we hate the dwarves?”\n\n\n“It’s canon. Don’t ask questions.”\n\n\n“What’s a cannon?”\n\n\nSuddenly, the elves quit bickering. Something that only happens once in a thousand years occurs. The glade explodes with magical aura as the unicorn releases its legendary rainbow fart. Magical anomalies, such as this, signal only one thing: the birth of a hero.\n\n\nElfmoor takes a big whiff of the magical aroma. “B. E. A. Utiful. Times like this make life worth living.”\n\n\nElfrond shakes his head. “Elfmoor, we’re immortal. I’ve seen this like ten times already. And every time this happens, it means something evil is about to come afoot.\"\n\n\n“But the hero always wins.”\n\n\n“Have you ever heard the term collateral damage?”\n\n\n“Is that a sword?”\n\n\nAnd there you have it. The magical unicorn fart that marks your birth. How exciting! I wonder what type of hero you will grow up to be.", "action_results": [{"action": "Heroic knight, heroic knight!", "result": "Ah, the noble knight in shining armor. And they say chivalry is dead.\n\n\nYou are born into a loving but stern peasant family in the hamlet of Forest Hill. Your formative years are a medley of hardship, merriment, and hard work. While most of the other children in the hamlet are content to play ragamuffin children’s games and live out their lives in this quaint corner of the woods, you aspire to greatness, spending every evening selling turnips and every night mucking shit from the stables. With all this (paltry sum of) loot, you are able to afford sword and shield lessons from the guardsmen.\n\n\nOne fine autumn evening, you and your sword master Jon are finishing a sparring session.  Jon is bigger and faster than you are, but you have taken his lessons to heart. Training swords are blunted, but they hurt all the same when they whack you.\n\n\nJon’s sword arcs toward your shoulder. You raise your shield, and the wood splinters. With a quick twist of the wrist, you yank the shield downwards, catching Jon’s sword in the process. He is open; here is your chance. You swing your sword…\n\n\n“Dodge!” you shout, dropping to the ground. Jon’s fist sails an inch above your head. You toss your shield and lurch from your knees into Jon. The pair of you grapple on the ground. Dust flies. Both of your swords are lost in the ruckus.\n\n\nA fist catches you square in the gut. Once, twice, three times. You spit in Jon’s eyes and roll to the side, and stagger to your feet. A leg comes sweeping toward you.\n\n\n“Dodge!” you shout, jumping back. You avoid the leg, but tumble onto your ass. Before you can regain your feet, a boot hits your chest, shoving you back into the ground.\n\n\nJon stands above you and smirks. “You know what you forgot to do?”\n\n\nYou nod, knowing.\n\n\n“You forgot to DODGE!”\n\n\nYou share a hearty laugh. At first, Jon would shout ‘dodge’ to train you to avoid taking hits, now it is your job to shout it when you train. He even sends kids around to throw shit at you randomly during the day. That really sends the message home. You have come so far that the art of dodging has almost become a sixth sense. ‘If they can’t hit you, they can’t kill you,’ Jon had reasoned.\n\n\nThe pair of you head to the watch house to clean up. The building is small and reeks of sweat and mildew. The hamlet only has three guards, so upgrading their housing has not been a top concern of the local Baron. You are just thrilled the hamlet has guards at all.\n\n\n“You’re getting good, kid. Real good,” says Jon, stripping his leather armor. “I think you’re ready for some real patrol work. We just got a report the other night about some disappearances on the Baron’s Road. It’s probably just some bandits, but we need to take care of it. You in?”", "action_results": [{"action": "Hell yeah I'm in.", "result": "“Hell yeah I’m in.”\n\n\nJon nods. “Glad to hear it.”\n\n\nThis could be your big chance to finally prove yourself. You need to get your name out there if you want to have any chance of receiving a knighthood someday. They do not just hand those things out like… well, nobody has ever actually handed you anything except a nice big steaming pile of shit. Peasantry blows.\n\n\nUnder cover of darkness, you and the three guards head out along the Baron’s Road in the back of a covered wagon. No one has ever thought of ambushing bandits in a covered wagon while guised as merchants. Surely, the plan will go off without a hitch.\n\n\nSamwellington the Fat jitters in his seat. You are not sure if it is because he is scared or hungry. How Sam became a member of the guard is beyond your imagination. Jon trusts him for some reason, and that is good enough for you. “Nervous kid?” he asks.\n\n\nThat you might eat me. “No. If Jon says I’m ready, then I’m ready.”\n\n\nBowie bobs his head. “It’s best to trust Jon. I didn’t once and then my world went to shit. That draugr attack during the winter of ’69 was brutal… I still have nightmares.”\n\n\nJon rolls his eyes. “If you hadn’t st-”\n\n\n“Hey, let’s let bygones be bygones,” says Bowie.\n\n\n“Hey do you hear that?” you ask.\n\n\n“Sorry, my stomach rumbles when I travel,” says Samwellington.\n\n\n“No, not-”\n\n\nThe horses whinny and bolt. One of the wheels catches a snag in the road and topples over. Luckily, you land on Samwellington’s gut. Jon cuts a hole in the wagon covering and climbs out into the night, and you and Bowie follow.\n\n\n“Oh, fuck…” Jon clutches his sword in both hands and rushes.\n\n\nTwo trolls tower over the corpses of the horses and the wagon driver, tearing chunks of bloody flesh with the effort you would rip apart a boiled chicken.", "action_results": [{"action": "Help Jon.", "result": "In your eagerness to fight at Jon’s side, you forget the most important lesson of your training: always dodge.\n\n\nA troll whips a horse leg in your direction. Off balance and off guard, you cannot avoid the hurling limb as the hoof nails you in the shoulder, severing your sword arm. Blood spouts like a geyser from your body as you crumple to the road.\n\n\n“Bowie, help Jon!” Samwellington shrieks. “I’ve got the kid.” Samwellington stumbles to your side and rolls you onto your back. “Hang in there little buddy. It’s going to be alright.”\n\n\nBlood loss is making you delusional. It is the only way to explain what is happening. Samwellington draws his dagger and sticks himself in the gut. He drags the blade across his stomach, slips his hand into the incision, and pulls out a chunk of his own fat. He smacks the lard on your wound and it sticks in place, stemming the blood flow.\n\n\n“Can you walk?” asks Samwellington.\n\n\n“Can I walk? Can I walk! I just had my fucking arm cleaved off. What the fuck do you think?”\n\n\n“Yeah, an arm, not a leg. Don’t be a baby.”\n\n\n“Sam we could really use your fat ass over here,” shouts Bowie. “Any motherfucking time!”\n\n\nYou hear a gurgle and a gasp just before Bowie’s head goes sailing through the air. Samwellington gulps and scurries away to hide behind the wreckage of the wagon. What a coward. Oh well, at least he saved your life.\n\n\nLeaning against your sword, you stagger to your feet. One of the trolls ravages Bowie’s headless corpse. The crunching and snapping of bones sickens you, and you fight the urge to hurl as bile tickles your throat. Jon appears to be holding his ground against the other troll, but once his friend finishes devouring Bowie’s corpse, even Jon won’t be able to fend off their combined savagery. You have to do something quick or all of your worthless lives will be over.", "action_results": [{"action": "Throw your severed arm as a distraction.", "result": "You doubt you will be of much use as a combatant, so you may as well make yourself useful in some other fashion.\n\n\nYou grab your severed arm and wing it as hard you can toward the trolls. The troll feasting on Bowie ignores the bloody mess of flesh, but Jon’s troll clambers after it on all fours. A deep sadness seeps into your bones as you hear the troll crunch your arm in its jaws. Heroes are not supposed to be eaten.\n\n\nJon slices the back of the trolls’ knees, and the troll howls in agony as its legs buckle. Jon leaps onto its back and cleaves the head clean off with one swipe with your arm still clenched between its teeth.\n\n\n“Go Jon,” Samwellington cheers. The fat coward is still cowering behind wreckage from the wagon.\n\n\n“Why don’t you try and help?” you snarl.\n\n\n“I am helping. I’m providing emotional support.”\n\n\nYou roll your eyes and look back in time to see Jon finish off the second troll.\n\n\n“Wow, that was fast,” you say.\n\n\nJon shrugs. “A little emotional support can go a long way. Nice job yourself. You didn’t even need to have your sword arm attached to the rest of your body for it to be useful. Try dodging next time though.”\n\n\n“I don’t know if there will be a next time. How can I fight without a sword arm?”\n\n\nJon winks. “I know a guy: magic fellow and what not. He should be able to do something for you.” Jon raises his hand. “Hold on one second. I’ll be right back.”\n\n\nJon darts into the forest and you hear the lovely sound of steel biting into flesh and the accompanying screams.\n\n\n“Sam, why don’t you go back to the hamlet and draft the report,” says Jon, emerging from the forest, “add five dead bandits to it. I’ll take our buddy here to the hedge wizard.”\n\n\nWith that, you and Jon part ways with Samwellington and enjoy a relatively droll venture to the hedge wizard’s hut. You understand why he is only a hedge wizard. The hut is a ramshackle smattering of twigs and leaves that appear to be held together by nothing but mud and bird poop. The entire place smells worse than a popcorn fart. This may not have been the best idea, but before you can raise your concerns with Jon, he hollers out.\n\n\n“Hey, Osprey, get out here. I need a favor.”\n\n\n“Is that you Jon?” You hear weird pops and bangs from inside the bird poop hut. “Just a second.”\n\n\n“Take your time,” says Jon. “No hurry.”\n\n\nAfter a few minutes, a bent white-bearded man with smoldering eyebrows and a staff teeters out of the hut amidst a cloud of smoke. The smoke shrouds Osprey and follows him around. It smells of rancid cheese and burning bird shit.\n\n\n“Whew,” Jon attempts to wave the stink away, “what were you doing in there?”\n\n\nOsprey’s eyes light up. His lips twist into a smirk as he cackles. “Wizard things.”\n\n\n“Oh, Dear God.”\n\n\nOsprey’s smile vanishes as he notices you and totters over. He grabs your head in both hands, lifts your chin, peers into your eyes, and prods your chest with a bony finger. A chill courses through your bones. He proceeds to violate your personal space for several minutes while you do your best to avoid suffocating in the smoke.\n\n\n“Mmhmmm,” he says to himself. “Just as I thought. The boy is missing an arm.”\n\n\nYou roll your eyes. “How observant.”\n\n\nOsprey whacks you upside the head with the staff. “Mind your manners, boy, or I’ll turn you into a leprechaun.” He shakes his head. “Ain’t nothing sadder than a leprechaun.”\n\n\n“Not even a smelly old man living in a bird shit hut?”\n\n\nOsprey clobbers you with the staff again. “I’ll have respect from you boy. This is no joking matter. You ever see a leprechaun you give that poor bastard nothing but your sincerest sympathies.” He smacks you with the staff one more time for good measure. “Now about that arm. I can fix you right up. Get you a brand new ethereal arm. Those things are sweet: impervious to physical damage. Magic will fuck you up though.”\n\n\nOsprey begins nodding his head and drawing weird symbols in the ground with his staff while mumbling to himself.\n\n\n“Jon,” you whisper, “I really don’t think this is a good idea. This guy is cracked.”\n\n\nJon scoffs. “Posh. You want to be a knight, right? Well, a knight needs both arms.”", "action_results": [{"action": "Bring on the magic.", "result": "Truer words have never been said. Well, they probably have, but you cannot think of any at the moment.\n\n\n“Alright,” you nod, “bring on the magic.”\n\n\n“That’s the spirit.” Osprey bumbles around finishing his runes. He mutters some incantations, bops you on top of the head a few times with his staff and bursts into poetry.\n\n\nA wizard did it, a wizard bid it.\n\n\nAn arm grew, fresh and new.\n\n\nEthereal, but not imperial.\n\n\nAs we live in a realm, surrounded by elm.\n\n\nNature’s magic, is never tragic.\n\n\nMy rhymes are bad, but I’m not mad.\n\n\nThis spell worked, ‘cause Cyrus twerked.\n\n\nJust like that, a sprite and shiny ethereal arm appears from your shoulder. You clench your fist and feel the power pulsing through your… veins? Jon claps politely as Osprey bows.\n\n\nThe hedge wizard slaps you across the back, smiling. “Now don’t go committing sins of self-pleasure with that thing. You might rip something important off.”\n\n\nYou gulp.\n\n\nOsprey cackles and slaps you some more. He seems to like hitting you. “You can shoot magic energy blasts out of that thing too. I thought that might be useful for a hero.”\n\n\nJon shakes his head. “If you want to be a heroic knight, don’t do that. Knights aren’t magic. Only trouble can come of it. This isn’t a wizard’s tale.”\n\n\nOsprey shrugs and wanders back into his hut. The door creaks shut and you soon hear the calamity snap back to life. He pokes his head out to offer one last piece of advice. “You treat them leprechauns with respect, boy, you hear me?” He slams the door shut and that is that.\n\n\n“What do we do now?” you ask Jon.\n\n\n“Well, I’m going to go back to the hamlet and make sure everything’s in order. You should go try out your new arm and get used to it.”\n\n\nYou consider that a smashing idea and head off to the neighboring kingdom of Irelandshire to seek out one of these mystical leprechauns. With the help of several drunken and boisterous natives, you learn the not-so-secret location of the Valley of Rainbows where the leprechauns supposedly abound. They warn you not to go though because it is a sad and wretched place. Obviously, you ignore them.\n\n\nHundreds of rainbows dot the easy to access valley, and you have little difficulty tracking one down to its end. Naturally, a great pot of gold sits next to it, but no leprechaun.\n\n\nYou try calling for them, taunting them, begging them, praising them, but none appear.\n\n\n“Well at least I’m rich.”\n\n\nYou pack as much gold as you can onto your horse (which isn’t anywhere near the entire pot since gold is heavy, yet it’s still enough to buy a castle or two) and prepare to return home.\n\n\nAs you approach the precipice with the cave that leads out of the valley, a shrill cry booms from deep in the heart of the valley.", "action_results": [{"action": "I'm rich. I'm going home.", "result": "Where is your sense of adventure? Heroes aren’t supposed to be in the game just for the money!\n\n\nWhat about for princess bosom?\n\n\nPrincess bosom is nice, but even with that you are still only a cheap imitation of a true hero. Besides, I do not see any princess bosom in the area, and no, you cannot buy princess bosom. You must earn such luxuries.\n\n\nAre you telling me I don’t actually get to go home?\n\n\nNo, you can go home if you want. I’m merely giving you an opportunity to reconsider because I am a kind and kindred spirit. Eh, who am I kidding? I’m kind of a dick, but my offer still stands.", "action_results": [{"action": "Piss off, I'm going home with my booty.", "result": "You elect to go home with your wealthy horde of treasure, as you have every right to do so. I applaud your resolution. That takes cajones. Even divine intervention cannot derail you from your path.\n\n\nWith your newfound riches, you decide to take a luxury cruise on the C.Y.S.  Generic Heroine. She is truly a gallant vessel. You dine on raw oysters and baked clams, which you eat off the bare breasts of dashing dames. At night, mermaids sing scandalous songs as they swim along with the ship, attempting to lure foolish sailors and passengers into their clutches, but not you, no, you are too wise. You simply listen and enjoy the sweet melodies.\n\n\nThe seas stay smooth and calm and you enjoy a pleasurable sailing experience. Pirates only attack once, and with your bitchin’ ethereal arm, you smash and bash them to bits, claiming their brig as your own. You even remembered to heed Jon’s warning and not use the magical energy blasts to preserve your status as a heroic knight.\n\n\n“How was your trip?” Jon asks as you arrive in port.\n\n\n“Profitable.”\n\n\nSamwellington’s mouth waters as he sniffs the seafood on your breath. “Do you have any more clams?”\n\n\n“I hope so,” says Jon, ignoring Samwellington. “You missed the king’s tournament. Sooooooo much shit went down.”\n\n\n“Jon found a fire-crotch.” Samwellington beams gaily. “And killed a no good dirty evil wizard.”\n\n\nJon nods. “The future looks bright. That’s for damn certain.”\n\n\nThe three of you leave the docks and head into the city, ready to raise hell and fuck bitches make sweet tender love to beautiful maidens. What, did you think I would be spiteful and have you die of the Great Pox or be devoured by the kracken? ", "action_results": []}, {"action": "You convinced me, oh benevolent and mighty guardian angel.", "result": "No one likes a kiss ass. I'm more akin to a god than an angel anyway.\n\n\nTaking a deep whiff of air you can smell the magic. This place has more to it than abandoned pots of gold and rainbows after all. You order your horse to stay and guard your gold as you dart towards the disturbance, and he obeys, because that is what good horseys do.\n\n\nYou storm through the trees, snapping branches and scaring furry little forest critters. In your haste, you trample a chipmunk. The little fellow’s bones make a nice crunching noise.\n\n\n“Hey what’s the big idea!”\n\n\nYou whirl around but do not see anyone. You inspect the bottom of your boot, but the chipmunk is not the speaker. He is squashed like a rotten pumpkin all juicy and splattered.\n\n\n“Over here you idiot.” A giant of a man posing as a tree rumbles toward you. He has moss and vines for a beard and hair. His green eyes glimmer with malice. A bear and a wolf lumber along at his sides. “Why are you destroying my forest?”\n\n\n“Sorry, I was looking for whatever made that awful cry.”\n\n\n“That was a leprechaun bemoaning his sorry fate of being a leprechaun.”\n\n\n“Cool, can you show me where they are?”\n\n\n“You murder my friend and harm my trees and you ask me for help? Give me one reason why I shouldn’t bring you home to my wife and tickle you to death for her amusement while my children eat your toes!”\n\n\nWhat in the name of Pegasus is this thing? Oh, if only you had brought that book on mythical creatures Samwellington bought you for your birthday. At any rate, something tells you he does not belong in Irelandshire. You do not think you will be able to reason with him. If the chipmunk was his friend, honor would dictate that he avenge the cute little guy’s mushy corpse. How do you want to play this?", "action_results": [{"action": "Tell him, 'Everything I say is a lie.'", "result": "A smug smirk crosses your lips as you proudly declare, “Everything I say is a lie.”\n\n\nThe weird tree man thing stares at you then shakes his head in pity. “What did you think a paradox would do? Make my brain melt into soup?”\n\n\n“Yes, actually.”\n\n\n“I am a leshy. Not an imbecile.”\n\n\n“I have no idea what that is. Do you sing songs?”\n\n\n“You’ll see what I do.”\n\n\nThe leshy’s animal friends attack and pin you to the ground before you can react. You manage to strangle the bear to death with your ethereal arm, but this only enrages the leshy further. He plucks you from the ground as a princess would an eyelash and carries you off to his shanty with the wolf nipping at your feet.\n\n\nOnce inside his home, he binds you with vines and hangs you from the ceiling. His wife and children enter from kitchen.\n\n\n“Oh, wonderful,” his wife cries with glee, “you found a wanderer! We get so few in the Valley of Rainbows.”\n\n\n“The stupid leprechauns keep everyone away,” says one of the children. “No one wants to be near a leprechaun.”\n\n\nThe leshy’s wife smacks the child upside the head. “You treat the leprechauns with respect young man. They have enough misfortune without your drivel.”\n\n\n“That’s right. Behave yourself, or I won’t let you eat his toes,” says the leshy.\n\n\n“Yes Pa.”\n\n\nThe leshy begins tickling you as the children nibble on your toes. The wife shoves a hand down her dress and begins to moan and giggle. You shut your eyes and vomit between fits of laughter and screams of agony. Piss runs down your leg.\n\n\n“You evil bastard!” you scream.\n\n\n“I’m not evil. You’re just a failure and a murderer,” says the leshy as he proceeds to tickle you to death. “Chipper was one of my best friends. He will not be forgotten.”", "action_results": []}, {"action": "Turn your clothes inside out and put your shoes on the wrong feet.", "result": "You remember now! This creature is a leshy, and there is only one sure fire way to stop a leshy. You whip off your clothes, put them on inside out, kick off your shoes and slip them onto the opposite feet.\n\n\nThe leshy grimaces and his animal companions slink away. “I guess I have to show you the way out now.”\n\n\n“I know the way out. Can you take me to the leprechauns?”\n\n\n“You want to see the leprechauns? Are you dull in the head?”\n\n\n“I like bacon, yes.”\n\n\nThe leshy’s eyes twinkle with fear. “Clearly, you’re mentally unhinged. Just like those poor leprechauns. If I take you to them, promise you’ll leave me and my family alone.”\n\n\n“Sure.”\n\n\nYou follow the leshy into a glade, within a glen, within a gorge, within a holler, within a hollow, within a dell, within a dale, within a dingle, within a canyon, within a vale within the Valley of Rainbows. The trip is quite, shall I say, trippy.\n\n\nThe leshy points to a pool of water where all the rainbows spring forth. “I’m not getting any closer. Give the leprechauns my condolences, and please don’t murder rape my family. Good day.” The leshy leaves in a hurry without another word.\n\n\nYou approach the pool with eager enthusiasm and the leprechauns begin to appear from the surrounding trees…\n\n\n...\n\n\nWhy are you stopping?\n\n\nI’m sorry. It’s too depressing. Give the leprechauns my condolences as well, poor sorry bastards.", "action_results": []}]}]}, {"action": "Investigate the cry.", "result": "Taking a deep whiff of air you can smell the magic. This place has more to it than abandoned pots of gold and rainbows after all. You order your horse to stay and guard your gold as you dart towards the disturbance, and he obeys, because that is what good horseys do.\n\n\nYou storm through the trees, snapping branches and scaring furry little forest critters. In your haste, you trample a chipmunk. The little fellow’s bones make a nice crunching noise.\n\n\n“Hey what’s the big idea!”\n\n\nYou whirl around but do not see anyone. You inspect the bottom of your boot, but the chipmunk is not the speaker. He is squashed like a rotten pumpkin all juicy and splattered.\n\n\n“Over here you idiot.” A giant of a man posing as a tree rumbles toward you. He has moss and vines for a beard and hair. His green eyes glimmer with malice. A bear and a wolf lumber along at his sides. “Why are you destroying my forest?”\n\n\n“Sorry, I was looking for whatever made that awful cry.”\n\n\n“That was a leprechaun bemoaning his sorry fate of being a leprechaun.”\n\n\n“Cool, can you show me where they are?”\n\n\n“You murder my friend and harm my trees and you ask me for help? Give me one reason why I shouldn’t bring you home to my wife and tickle you to death for her amusement while my children eat your toes!”\n\n\nWhat in the name of Pegasus is this thing? Oh, if only you had brought that book on mythical creatures Samwellington bought you for your birthday. At any rate, something tells you he does not belong in Irelandshire. You also doubt you will be able to reason with him. If the chipmunk was his friend, honor would dictate that he avenge the cute little guy’s mushy corpse. How do you want to play this?", "action_results": [null, null]}]}, {"action": "Continue as a cripple.", "result": "There is no way you are about to let this bird-brained lunatic work any form of magic on you. Somehow, someway, you will adapt to your crippled state.\n\n\n“It’s just not happening, Jon,” you say and walk away.\n\n\n“Hey, get back here, kid!”\n\n\n“Let him go, Jon,” you hear Osprey say. “He’ll come back. They always do.”\n\n\nYou ignore them and keep walking. Left, right, left, you allow your mind to wander and just let your feet carry you where they will. How could this have happened? You are supposed to be a hero! A young knight in training, you had such a promising future…\n\n\nTime passes and the sky darkens as you continue to roam without purpose. Self-wallowing will certainly help you in your quest for glory. You meander deeper into the forest, down into a dell. A coyote’s howl jars you back to reality. You slump against a rock beside a bubbling stream and bury your head into your hand.\n\n\n“Everything I ever dreamed,” you scream, “ripped apart and devoured by some beast from hell.”\n\n\n“Oh, do tell,” whispers a soft voice from behind. “I love stories about fallen heroes.” The voice giggles. “Or, would-be heroes.”\n\n\nSlippery wet fingers trace your cheeks and run through your hair. A veil of mist seeps into the dell. Queer sensations stir in the pit of your gut. You think you are being enchanted, and you are not sure if that is necessarily a bad thing.\n\n\n“Who are you?”\n\n\n“I have many names,” sings the sweet voice. Her fingers caress your body. You feel at ease in her arms, as if all the aches in your body and pains in your mind wash away at her command. “But you may call me Organa Mel Fy.”\n\n\n“What are you?”\n\n\n“Ah, now that is a better question, but still not the right one.” You feel her teeth nibble at your neck. “I am an angel to some: demon to others. Last question my sweetness, make it count.”", "action_results": [{"action": "\"What happens next?\"", "result": "“What happens next?”\n\n\n“Now that, that is the question of the hour, isn’t it?” sings the sweet voice.\n\n\nThe mysterious creature’s slick fingers trace their way into your breeches and tickle your Johnson. An overwhelming sensation of euphoria courses through your veins. Blood surges through your body. You feel… invigorated, as if you have more energy than the sun itself.\n\n\n“I get ever so lonely here by myself,” the voice sings. “Won’t you… play with me?”", "action_results": [{"action": "Sexytime!", "result": "You have never felt so amazing in your life. How could you possibly let this sensation escape? You make sweet tender love to the mysterious creature. She looks human enough, except for the fact she can transform into water at will, which only serves to enhance the awesomeness of the experience. It just feels soooo damn good.\n\n\nA little too good. Blinded by euphoria, ecstasy, magic, hormones, and a fatal condition I like to call “being a goddamned idiot,” you fail to notice your lover drag you down into the deceptively deep depths of the stream where you drown in the throes of love-making. Oh, those pesky water sprites!", "action_results": []}, {"action": "It's a trap!", "result": "Shit, it’s a trap! Jon once gave you a book about just this situation. This magical sexy creature is none other than a water sprite, posing as the evil sorceress, Organa Mel Fy, probably one of her sultry minions. She’ll sex you up then drown you in the stream and feast on your corpse.\n\n\n“I want you to want me.” The water sprite moans and works magic on your body with her fingers.\n\n\nTry as you might you cannot resist her allure as she toys with you in her lap. The magical enchantment and sexual tension corrode the fibers of your mind, breaking the mental barriers you constructed for just such a situation.\n\n\nSaggy old nuns. Saggy old nuns. Saggy old nuns. Sally David. Mom. Oh shit, I’m still getting hard.\n\n\nHard as a brick in fact.\n\n\nHelp me!\n\n\nDo you have a sister?\n\n\nYes, but that won’t work.\n\n\nYou whacked it while watching her bathe in the river didn’t you, perv.\n\n\nMaybe…\n\n\nI suppose there is always self-castration.\n\n\nGo to hell.\n\n\n“Don’t be shy, baby,” sings the water sprite, “I just want to rock you like a hurricane, shake you all night long, twist and shout, scream a rebel yell, make you walk on water, take you down to the paradise city, administer rough justice, and get your rocks off.”\n\n\nLosing the battle of self-control your johnson twitches wildly. “Oh, sweet merciful God, that sounds orgasmic.”\n\n\nThe water sprite leans in close and whispers in your ear, “Let me take you home tonight so I can keep on loving you.”\n\n\nThe sultry songs of the water sprite prove too much for your feeble constitution. Your johnson explodes into a fountain of blood from a colossal aneurysm brought on by an overload of magical sexual tension. Since I’m not completely depraved, I’ll spare you the grisly details. Short agonizing story in brief: you bleed out.", "action_results": []}]}, {"action": "Kill it", "result": "When in doubt, flay ‘em like a trout. Swift as a cat hopped up on methamphetamines you draw your sword, spin around, and hack off Organa Mel Fy’s head. Magic may not be dope, but you sure are.\n\n\nWhat didn’t you know? Magic is a stimulating drug. That’s why even the best wizards are twitchy and half-cracked in the head. Shit’s addictive, man.\n\n\nWhoa, what the hell is going on? Organa Mel Fy’s body and freshly decapitated head melt into what appears to be water and seeps into the ground. That is not normal. Perhaps now would be a good time to get out of here. You are still feeling funny from the magic and can swear you are being watched as you clamber up out of the dell. In fact, your feet are moving in a flurry, but it does not seem like you are getting anywhere. You definitely passed that big ass maple like five times already.\n\n\nYou whirl around and brandish your sword. “Ok, what the fuck gives? Will the mysterious magic bitch or bastard please stand up?”\n\n\n“If you insist.” A mysterious magic bitch with bountiful breasts appears before you out of thin air wearing low-cut red robes. She reeks of magic and virility.\n\n\n“Listen, err, lady, my day’s been one odious load of shit, so unless you want me to wrap you up in the stink, I suggest you bugger off.”\n\n\nThe woman’s lips curl into a seductive smirk. “Aren’t you curious as to whom I am, or what I am going to offer you?”\n\n\n“At this point, I really don’t give a damn.”\n\n\n“Perhaps you should.”\n\n\n“Perhaps you should suck my dick.”\n\n\n“If that is what you truly desire, that may be arranged. But for now, you will listen to my proposal like a good puppy.” The woman raises her hand, immobilizing your body with her magic. “Now then-“", "action_results": [{"action": "Hear her out.", "result": "“If you agree to be my obedient and ever loyal servant, I will allow you to be my second in command and we shall rule the world with a magical fist! I’ll even fix up your arm for you, much better than that crackpot Osprey could do for you too.”\n\n\n“Can I be a Knight in Shining Armor?”\n\n\n“You can be a Black Knight.”\n\n\n“Awww, that’s not heroic at all.”\n\n\n“Well, you could just be my Dragon.”\n\n\n“You’ll turn me into a dragon! That’s awesome!”\n\n\n“No. A Dragon is a trope. Don’t you have the internet?”\n\n\n“What’s a trope? Or the internet? Is it like a cliché?”\n\n\nOrgana Mel Fy face palms. “Go here and waste countless hours of your life and educate yourself. http://tvtropes.org/pmwiki/pmwiki.php/Main/HomePage”\n\n\n“I don’t speak foreign. Just Common.”\n\n\n“I think I’ll just kill you.”\n\n\nAnd so she does. Now you are free to lose your soul in the vast voids of the internet.", "action_results": []}, {"action": "Spit in her face.", "result": "Spitting isn’t exactly heroic, unless you’re a cowboy. Unfortunately for you, you are not a cowboy.\n\n\nYou hack a glob of spittle onto the woman’s face. “I’ll cut your fucking heart out. Bitch.”\n\n\n“Interesting, I’d love to see you try.” The woman wipes your saliva from her face, as you remain helplessly immobilized. “Yes, that’s what I thought. Though I imagined you had a little more sense in you than that. You are not the vessel I am looking for. That is clear to me now. Still, I can use your corpse as a fine minion. And you gave me such a wonderful idea of how to kill you.”\n\n\nThe mysterious magic bitch magics up a dagger and proceeds to cut out your heart, which she then consumes. You watch in horror as the last moments of your life fade away. Perhaps, antagonizing your captor was not the best of ideas.\n\n\nSadly, you cannot even enjoy peace in death, as the mysterious magic bitch reanimates your corpse to do her bidding, trapping your soul within your decaying body. The tasks she orders you to perform are humiliating and degrading, but there is nothing you can do. You are hers, now and forever.", "action_results": []}, {"action": "Struggle to break the spell with sheer willpower.", "result": "Ah, yes, the only thing more powerful than the human spirit is the spirit of a hero. You dig deep inside yourself, channeling your energy into an explosion of heroism. Eww, gross, it smells… sticky.\n\n\n“- hey wait, what are you doing?” shrieks the mysterious magic bitch as you take a step forward. She doubles her efforts to paralyze you, but you are fixated on your goal and nothing is going to stand in your way. You cock your arm and deliver a vicious left hook. Crack. “Foolish mortal,” she screams as blood dribbles down into her frock, “that was most unwise.”\n\n\nIt really was, you think as you massage your broken hand against your thigh. Why didn’t I just hack off her head?\n\n\nGood question hero, how do you plan to kill her now with one arm and a broken hand?\n\n\nI dunno, but it was worth it. The blood glistens gorgeously on her bosom.\n\n\nMaybe. If you are into that kind of stuff. But the time for internal dialogue and wall shattering is over, you have a situation here.\n\n\nThe mysterious magic bitch hurls a poorly aimed fireball in your direction. “I bet you don’t even have it in you to kill a woman!”\n\n\n“Didn’t I just kill that water creature thingy? What was her name, Morgan Le Fay?”\n\n\n“Organa Mel Fy, you fool!” The mysterious magic bitch hurls another fireball, but once again, her aim is so dreadful you do not even have to dodge.\n\n\n“Oh, whatever.”\n\n\n“Did you really think that half-witted harpy was the real Organa Mel Fy, sorceress supreme?”\n\n\n“Kind of.”\n\n\n“Well she wasn’t! I am!”\n\n\nOrgana Mel Fy whips up a magic firestorm, igniting the forest in a blaze of light and charred forest critters. You have to respect her strategy. When you cannot hit the broad side of a barn, just fire a broadside and blow everything to hell.\n\n\n“I could have given you power beyond your wildest dreams! Sex the likes of which you have never known possible! We could have ruled the world together and ascended into the divine! Now DIE!”  \n\n\nFlames lick at you from all angles while smoldering branches and roasted birds tumble around you. Your stomach rumbles and mouth waters. Too bad you do not have time for a snack; a nice greasy roasted duck would really hit the spot right about now. One problem at a time though. You think you see a small avenue of escape, but you will have to bolt for it now. Of course, running away admits defeat.", "action_results": [{"action": "Fight", "result": "I didn’t know you were courting Death.\n\n\nI’m not. What the hell are you talking about?\n\n\nOh dear, this is awkward.\n\n\nWhat!?\n\n\nI just assumed you had a date with Death, how else to explain such an absolute act of pure, unadulterated retardation.\n\n\nCrashing through the inferno, you barrel toward Organa Mel Fy as the flames sear your skin. One armed and broken handed, I’m certain the fight would have been worthy to watch. Sadly, you collapse before you close even half the gap where the dancing fires consume your corpse.\n\n\nIt is a shame really. You came so close to discovering Organa Mel Fy’s secret. I actually thought you were going to make it. Instead, Organa Mel Fy did the world a service by culling a hero that just wasn’t cut out for the job.", "action_results": []}, {"action": "Flee", "result": "Sometimes you have to lose the battle to win the war. You seize your opportunity to escape and disappear in the smoky haze. That crazy loon must have set half the forest on fire. Things cannot get much worse at least, right?\n\n\nA gale pummels you from behind and knocks you down. Coals soar through the air. The force of the wind uproots entire trees, filling the air with splintering missiles of fire and death. Shit just got worse.\n\n\n“Oh come on,” you mutter, “the bitch has to have some limit to her magic.”\n\n\nYou stagger onto your feet and proceed to dodge the incredible amount of bullshit and debris flying through the air all the way back to Osprey’s ramshackle birdshit hut. Osprey and Jon are sitting on stumps around a bonfire drinking tea, completely ignoring the magic fire engulfing the forest.\n\n\nOsprey nudges Jon with his elbow. “See, I told ya he’d come back. They always come back.”\n\n\n“Never doubted you for a second Osprey. The boy is young. He’ll learn.”\n\n\nYou throw up your arms in exasperation. “In case you two didn’t notice, we have a situation here.”\n\n\n“You heroes today, always in such a hurry.” Osprey bops you on the head with his staff. “Never taking any time to stop and smell the pteguonias.” Osprey takes a deep whiff. “Putrid.”\n\n\n“That’s your birdshit hut burning up.”\n\n\nOsprey’s eyebrows shoot up, nearly off his forehead. “Damnit, Organa, you’ve gone too far this time. Show yourself! It ends now!”\n\n\nOrgana Mel Fy once again materializes out of thin air. She blasts an ice spike through Osprey’s heart without so much as a howdy-do. The cooky old hedge wizard voids his bowels and leaves this world once and for all. So much for getting a new arm.\n\n\nJon draws his sword. This battle may rest entirely on his blade now because you certainly do not appear to be in any condition to help. “Heartless harpy,” he growls.\n\n\nOrgana Mel Fy shrugs, which causes her bountiful breasts to bounce beautifully. “Well aren’t you a luscious lug. The world is a better place without the old fart stinking up half the forest. And I assure you, while I may be tart, I do have a heart. I know I just met you, and this may seem a tad crazy. But I’m ovulating, so would you like to make a baby?”  \n\n\n“Well, I am a sucker for gingers.”\n\n\n“Power, sex, and divinity, we could have it all.”\n\n\nJon lowers his sword. “That is tempting.”\n\n\n“Jon, what the hell!” You make a fist and drop to your knees in pain. Yep, still broke.\n\n\nJon stares at you with puppy dog eyes. “But she’s a ginger! I love gingers. Besides, heroes aren’t supposed to hit girls let alone kill them. That’s villainy right there.”\n\n\nThe man makes a strong argument. Are you really willing to begin the long dark descent down the path of debauchery and villainy just to stop one lone psychotic bitch with a magic addiction? Maybe it is not too late for you to get in on the action too. Organa Mel Fy does have a pretty sweet body and has a serious sexual appetite. There are probably some fantastic adventures awaiting the three of you in your potential sexcapades. ", "action_results": [{"action": "Grope Organa Mel Fy", "result": "Something has been off about Organa Mel Fy ever since you first took a whiff of her presence. Eureka, that’s it! You just have to get close enough to check and make sure.\n\n\n“Organa, I think I made a terrible mistake. Just think of all the sexy good times the three of us could have.”\n\n\n“Hmmm, maybe.” Organa’s eyes fall to your junk, judging you.\n\n\nYou saunter over to Organa Mel Fy, trying your best to look charming and horny. Yeah, she wants some of that. When you get in close, you shove your hand down her robes and clutch onto her naughty bits. Son of a peasant, you were right!\n\n\n“She’s packing heat Jon,” you shout as you simultaneously twist Organa Mel Fy’s genitals and headbutt her in the temple. “I knew I smelled the unmistakable musk of virility on you when we first met.”\n\n\nJon gawks stupidly. “You mean Organa Mel Fy is a transsexual?”\n\n\nYou mercilessly curb stomp Organa Mel Fy into the forest floor, not feeling the least bit bad about it. “Nope, she’s a hermaphrodite.”\n\n\n“Oh, wow. That could have got… kinky?”\n\n\n“Not the word I would have used, but you’re probably right.”\n\n\n“You’re still kind of beating up a woman you know.”\n\n\n“Eh, it’s got a penis. I think my hero’s soul is safe.”\n\n\n“You son of a whore!” Tears pour down Organa’s cheeks. “We could have achieved great things, the three of us, united as a triumvirate of power, glory, and sexual ecstasy.”\n\n\nThis is true. Do you want to give all of that up? I know it requires a new perspective on life and an open mind, but that sounds interesting if nothing else. You could shatter boundaries and usher in a new age of sexual exploration and understanding. Then again, she does want to take over the known world, so it is not like she’s a nice lady… gentleman... person. Or is (s)he just misunderstood?", "action_results": [{"action": "Heroes kill evil things. She's evil.", "result": "You don’t make the rules; you just follow them. Canon dictates you kill all evil things that cross your path. Open-mindedness is not canon. Therefore, it must be evil. When was the last time you read a cliché story about two homoerotic knights swordfighting their way through the kingdom, never.\n\n\nA few curb stomps later, Organa Mel Fy is dead. Congratulations, you rid the world of a great evil. Jon shoots a passing red herring. Ain’t nobody got time for that.\n\n\nJon slaps you on the back. “Well kid, turns out you had it in you to be a hero after all. You’ll earn a knighthood for this beautiful handiwork, no doubt. How do you feel?”\n\n\n“Dirty.”\n\n\n“Nothing a good bath won’t fix.”\n\n\n“So what happens next?”\n\n\n“Oh, I imagine you’ll have some titillating adventures over the years and wind up marrying a big bosomed princess with blond hair and blue eyes. She’ll give birth to a brood of little prince-lings and you’ll grow old in a nice big ass castle. Doubt you’ll ever get your arm fixed though. You proved today you don’t need it.”\n\n\n“That sounds fine by me.”\n\n\n“Amen. A cliché life is a happy life.”", "action_results": []}, {"action": "Heroes show compassion and understanding.", "result": "With time and love, you are convinced that Organa Mel Fy can be converted into a peaceful member of society. Perhaps she will even redeem herself and become a hero. As much as you would like to tell yourself that your actions are purely heroic, deep down you know what you really wanted. Don’t worry, I won’t judge you. After all, you are at that age of sexual hyperactivity where the only thing on your mind is sex, and sex, and sex, and sex.\n\n\nYou offer Organa Mel Fy an awkward hand of love and friendship, which she accepts, not that (s)he has much of a choice at this point. You, Jon and Organa Mel Fy consummate your union in the smoldering ruins of a once proud forest and Osprey’s birdshit hut. The sensations you experience are… unique.\n\n\nThe divine overseer in the eternal heavens is rather displeased with your choice. Canon dictates Organa Mel Fy is evil and deserving of a gruesome death. You cannot just spit in the face of canon and expect to come out unharmed. Consequently, the titles of knight and hero are beyond your grasp. Naturally, you turn to a life of villainy in retaliation.\n\n\nYears pass and your unholy union is on the verge of kingdom-wide conquest and savagery. The bedroom antics are as fierce and wild as ever. Organa Mel Fy didn’t lie about the sexual ecstasy. It’s amazing what a little magic can do in the bedroom. By the screams, one would swear the dead are cumming. But kingdom-wide devastation is not all sex games. Castles lay in ruin, cities burn, and famine and plague ravage the land. You personally hunted down and rape murdered every last unicorn to prevent the birth of another hero who may one day end your reign of terror. Fortunately, villains always get their comeuppance in the end.\n\n\nOne day while enjoying your depravity a rouge dragon from the nearby kingdom of Irelandshire flies overhead and roasts the three of you in a blast of dragonfire. The wyrm proceeds to eat you and utilize your energy as an aphrodisiac. The dragon is celebrated as a hero and he and his mate are pronounced king and queen of the kingdom. ", "action_results": []}]}, {"action": "Villain Smillain, I'm saving the day.", "result": "“I don’t give a damn if she is a woman, I’m kicking her ass.”\n\n\nJon sighs. “Fine, but you owe me a red-headed whore.”\n\n\n“Dude, Jon, man, you need therapy.”\n\n\n“No, I need a fire-crotch to melt the icy walls of my soul.”\n\n\nOrgana Mel Fy claps her hands together. “What a wonderful idea. Ice and fire! And in song form.” She claps her hands once more, and a snowstorm blizzards into existence. Ice, fire, and steam clash together while small mutant dwarf elves dance and sing in circles.\n\n\nA song and storm of ice and fire, while we strum on our lyre.\n\n\nHit the bong and throw ‘em in the fryer, while we drum by the funeral pyre.\n\n\nDum dee dee dum dum dum dum ho, dum dee dee dum dum dum dum wo,\n\n\nMagic in the morning.\n\n\nWatch them suffer hear them scream, while we make love by the bubbling stream.\n\n\nBotch the murder we die as a team, while we fuck in a collective dream.\n\n\nDum dee dee dum dum dum dum ho, dum dee dee dum dum dum dum wo,\n\n\nMagic in the morning.\n\n\nDrink blood red wine at a wedding on the river, hope we get to dine on someone’s liver.\n\n\nThe bread is fine honey don’t you shiver, hope we bet on the cruelest sinner.\n\n\nDum dee dee dum dum dum dum ho, dum dee dee dum dum dum dum wo,\n\n\nMagic in the morning.\n\n\nIf you suckle too long on Organa’s teat, we hope you find an extra treat.\n\n\nWe may chuckle ‘cause she’s packing heat, pray we don’t die for this beat.\n\n\nDum dee dee dum dum dum dum ho, dum dee dee dum dum dum dum wo,\n\n\nMagic in the morning.\n\n\nYou blink and rub your eyes. “Jon, I think I’m tripping. I inhaled a lot of smoke; there must be some wicked shrooms growing in the forest.”\n\n\n“Either that or the narrator isn’t even trying anymore.”\n\n\nA flaming chunk of ice crashes into the back of Jon’s skull. The poor bastard never saw it coming. He topples to the ground like a turd. You feel your emotions building up, too surreal to touch. They boil over and burst. You feel yourself nut, but it doesn’t matter it’s time to get rough.\n\n\n“Bam! Pow!” you shout.\n\n\nOrgana Mel Fy cocks her head and gawks at you. “Uhm, excuse me?”\n\n\n“Those are the sound effects about to go off upside your head, bitch.”\n\n\nBam. Pow.\n\n\nYour headbutt kick to the jaw combo work perfectly. Organa Mel Fy hits the ground, and the magical maladies plaguing the forest vanish. Tears well in her eyes as you end her miserable existence by stomping on her face.\n\n\n“Too bad so sad,” you say. “By choosing villainy over heroism you brought this on yourself.”\n\n\nWith one final stomp, the light in Organa Mel Fy’s eyes go out, hopefully for good. You never know with these magic types. They come back like cockroaches or supposedly dead G.R.R.M characters. Just playing homie, we love you.\n\n\nJon picks himself off the ground and massages the back of his head. “Eh, I’ve had worse.”\n\n\nYou nod. “Good to hear.”\n\n\nWell congratulations my noble crippled hero. You killed the evil Organa Mel Fy. Now go find Jon a fire-crotch like you owe him.", "action_results": []}]}]}]}]}]}, {"action": "Charge into the fray.", "result": "You throw caution and sanity to the wind and charge into the fray.\n\n\nWell, charge is a kind term. You mostly stagger along the blood-slicked road, swaying from side to side, until you topple over and slam your head against the cobblestones. Your sword flies from your grasp and slides beyond your reach. Adjusting to missing limbs takes time.\n\n\nBoth trolls look up, and in your blurred vision, you swear they are laughing at you.\n\n\nMocked by a troll, you think, how embarrassing.\n\n\nJon takes advantages of your momentary distraction and hacks his troll in the legs, sending the beast to its knees. The troll roars. Jon drives his blade into the troll’s open mouth and out the back of its throat. One down.\n\n\nThe second troll grabs the remnants of Bowie’s body and rushes toward you. The troll stands above you and squeezes the juices from what used to be Bowie, taking care to cover every inch of you in Bowie juice. The stink is agonizing.\n\n\n“Oh my god,” Samwellington cries, “He’s marinating you!”\n\n\n“Just kill me you son of a bitch,” you sputter as you spit some of the vile goop from your mouth.\n\n\nThe troll grips you by the shoulders and bares his teeth. The tip of a blade tears through the troll’s chest. Troll blood and the sweet smell of apples descend upon you. And the troll’s lifeless corpse… which crushes you.", "action_results": []}]}, {"action": "DODGE!!!", "result": "All of Jon’s training really pays off. Using your sixth sense, you see the attack coming leagues away. With all the grace of youth, you jump to the side as a horse leg soars past your ear. Quite unfortunate for Bowie, who takes the hoof straight in the face. You do not even look. The crack and thump tells you all you need to know.\n\n\nDodging more chunks of horse and human, you maneuver your way to Jon and the trolls. Master and apprentice stand back-to-back as you fend off the fearsome beasts. Dodge, parry, dodge, dodge, strike, dodge, parry, dodge, dodge, dodge, strike. And so the battle goes. Troll blood drenches you as you hack away. Surprisingly, it smells like apples.\n\n\n“Jon,” you say, while dodging another troll fist, “they keep regenerating when I dodge them. It’s a troll blood bath, but they aren’t going down.”\n\n\n“DODGE!” Jon shouts. “Always DODGE!”\n\n\n“Then RAM,” screams Samwellington, bulling into the fray. By the sound of the collision, you think Samwellington just tackled Jon’s troll. What an awful, squishy sound.\n\n\n“Where the fuck have you been?” you ask.\n\n\n“Cowering.”\n\n\nYour troll swings its long hairy arms wide and claps them together, aiming for your head. You dodge and slide along the blood slicked ground, slashing the beast’s legs as you slip between them. Hopping to your feet, you deliver the finishing blow as the beast drops to its knees before splashing face first into a puddle of its own blood.\n\n\nJon’s troll has met the same fate. Jon appears unwounded, though breathing heavily, leaning on his sword.\n\n\n“Oh, dear god! Samwellington!”\n\n\nSamwellington lies on the ground with a grisly gash on his robust gut that looks inches deep. “Oh don’t worry,” he says. “They just cut into the fat. I always knew eating all that pork lard would pay off one day.”\n\n\nJon smirks. “See, I told you. Dodge.”\n\n\n“I won’t question you again Jon. Too bad about Bowie though.”\n\n\n“Meh, he was a fucking dick anyway.”\n\n\nSam struggles to sit up. “I don’t think those trolls were the reason those people went disappearing.”\n\n\nYou nod. “Because all this blood and gore would have been pretty hard to miss.”\n\n\n“No. Because there are five guys with loaded crossbows behind you.”\n\n\n“Shit.”", "action_results": [{"action": "Turn and rush them.", "result": "Without a moment’s hesitation, you turn and rush the bandits. You are the fledgling hero of this story after all, and the hero always wins. The bandits either agree or are too shocked by your blazen stupidity and gawk at you as you close the gap.\n\n\nBy the time one of them gathers his wits, three of them are dead at your feet. A bolt grazes your cheek as you cut the fourth man down. The fifth man, who fired the bolt, turns to flee back into the forest. He does not make it. Jon skewers him from behind.\n\n\n“That’s going to be quite the scar,” says Jon. “It’s not so much a deforming scar as a handsome, charismatic scar. All great heroes get them. Chicks dig it.”\n\n\n“I don’t have one,” whines Samwellington.\n\n\nJon rolls his eyes. “Yeah, I wonder why.”\n\n\nThe three of you hobble back to the hamlet. You have one of the priests help draft a report of the incident and send a runner to deliver it to the baron. Some unimportant nobodies go clean up the mess while you kick back and relax. Not bad for a (k)night’s work.\n\n\n“Good work today kid, but don’t get ahead of yourself kid,” says Jon. “You still have a long way to go to be a true knight. It takes hard work to bang a princess and ride off into the sunset. Oh, and remember.”\n\n\n“Dodge,” you say in unison.\n\n\nThe baron is pleased with what he reads in the report. You become Bowie’s replacement in the hamlet guard and undertake some other minor missions with Jon and Samwellington. Soon you become a bit of a celebrity and inspiration, and your fame goes countywide. Priests take time out of their day to tutor you in your letters, and the baron invites you and Jon to take place in the next tournament he’s hosting. The king will even be there; it is supposed to be quite the shindig. Things are looking up. All you have to decide now is what event you are going to compete.", "action_results": [{"action": "Compete in the joust.", "result": "For reasons far beyond normal human comprehension, you elect to compete in the joust: never mind the fact that you do not own a horse and have never held a lance in your life. Remember, dodging is against the rules in a joust, so you are not exactly playing to your strengths.\n\n\nDuring a morning patrol, you and Jon discuss the upcoming tournament.\n\n\n“I still think you should participate in the melee with me instead,” says Jon. “But if you’re dead set on jousting, you’re going to need a horse.”\n\n\n“Any recommendations?” you ask.\n\n\n“Jousting horses are expensive. You’re either going to need a big loan or a big friend. And don’t forget, if you lose the joust, you lose your horse and your armor.”\n\n\n“Can I use a quarter-horse? I bet old man Nathaniel David would let me borrow Bessy.”\n\n\n“Sure. You can ride out naked too, but you’ll just embarrass yourself.” Jon smacks you upside the head. “If you aren’t going to take this seriously, don’t even bother showing up.”\n\n\nYou finish your patrol with Jon and head over to old man Nathaniel David’s orchard before you visiting the moneylender in the next town. You know it is not wise to ignore Jon’s advice, but you want to keep your options open. Old man Nathaniel David proves easy to find, he is humped over, shitting on a sapling when you arrive.\n\n\n“Um, what are you doing David?”\n\n\n“Fertilizing,” he says with a massive grin. “What can I do for you lad?” He sticks out his hand for you to shake, which you begrudgingly accept.\n\n\n“I decided to joust in the king’s tournament, but I don’t have a horse.”\n\n\n“Ah, well, I can’t imagine you’d want to use any of the horses in the hamlet. Plow horses ain’t going to win that for you, but I know you don’t have much money. So if you want Bessy, you can have her, on one condition.”\n\n\n“What’s that?”\n\n\n“If by some miracle you win, you name my lil’ pumpkin, Sally, Lady Fair of the Tournament. If you lose, you pay me back by marrying her. You’re a good lad, and you’d make a fine husband for my girl.”\n\n\nYou have seen Sally David before, strutting around. She has a fine body for a wench, but holy matrimony is her face hideous. It looks like someone took a rake and beat her bloody. You will have to mull this one over; these are high stakes. Even if you won, you could offend many important people.\n\n\n“Alright, David, I’ll keep the offer in mind,” you say as you wave goodbye.\n\n\nOld man Nathaniel David hitches up his trousers and nods. “You do that, boy.”\n\n\nThe Baron’s Road has been nice and calm ever since you took care of those trolls and bandits, and you arrive at the moneylender’s office without incident. The moneylender’s office is small and simple: one desk, two hard wooden chairs, and a few bookshelves. You have heard of these types before, and they are nothing but trouble. The moneylender skims over the pleasantries and bids you sit and begin your business.\n\n\n“What can I do for you, friend?” he asks. His hair is dark and oily, eyes small and beady. An unnecessarily pointy goatee graces his chin. Yep, slap the evil and unscrupulous label on him.\n\n\n“I need money for a horse to use in the joust. I’m one of the guys that killed those bandits and trolls on the Baron’s Road awhile back.”\n\n\n“I know who you are,” he snaps. “I also know you have no money and no experience jousting.”\n\n\n“How do you know that?”\n\n\n“Because.” He points at his goatee. “Now I will lend you the money if you agree to my terms.”\n\n\n“Which are?”\n\n\n“If you win, I get 50% of the ransom and prize money. You keep the horse. If you lose, you become my personal slave for a year.” The moneylender pulls, ink, quill and parchment from his desk. “We can get the contract signed right now.” ", "action_results": [{"action": "Done deal!", "result": "As you reach to sign the contract, the moneylender stabs your hand with the tip of the quill. He pops the end of the quill into his mouth and sucks the blood off with a loud slurp. Black and blood-red sparks shoot randomly from his body. Wings burst forth from his back and claws grow from his fingers.\n\n\n“First, I kill you. Then, I rule the kingdom. Finally, I get all the bitches.”\n\n\nYou blink in confusion. “What?”\n\n\n“That’s what is going to happen, and you can’t stop me.”\n\n\n“Why did you drink my blood? Are you a vampire? So help me Stephanie, if you're lurking around here, I'll kick your ass.”\n\n\n“There’s power in heroes blood.”\n\n\n“And?”\n\n\n“Actually, I have no idea what I am now. I was an evil sorcerer in disguise. Then I drank hero’s blood, and since I’m evil that would probably make me an anti-hero now.”\n\n\n“Would I become an anti-villain if I drank your blood?”\n\n\n“I don’t think it works like that.”\n\n\n“Why not?”\n\n\nBecause you’re dead. The evil monster rips your head off with his claws and devours your corpse. That will teach you to make dirty deals with shady characters.", "action_results": []}, {"action": "I'll just go with Bessy.", "result": "Probably not a great idea to borrow money from such an obviously evil character: you excuse yourself, leaving the moneylender fuming. He mutters something under his breath while stroking his goatee as you walk out the door. Perhaps you will cross paths with him again.\n\n\nYour heart is still set on riding in the joust, so you head back to old man Nathaniel David’s orchard and agree to his bargain. You spend the remainder of your free time preparing for the tournament. Jon coaches you as best he can, which is not very well since he has never jousted either, but you think you have the hang of it.\n\n\nBessy’s training has mixed results. She works hard and seems to appreciate the change of scenery. You figure being a plow horse is probably pretty dull. She has spirit, but the old girl does a lot more plodding than charging. At least, she does not shy away when the other horse speeds toward her.\n\n\nThe day of the tournament dawns cool and crisp. Sweaty with excitement, you try to relax in your pavilion before your first match. You have already made water five times this morning, and you think you have to go again. So many things ride on the outcome of today’s events, but you cannot think about that. The here and now is what is important. You watch squires scurry around the grounds, doing the bidding of Sir this or Sir that or some other random bastard. You fall into a daze and your thoughts wander.\n\n\nWhy don’t I have a squire? Crap, I think I need to piss again. Dear lord, please grant me the strength and will to win today. I don’t want to marry that troll Sally David. Have you seen her? Oh, is that who I think it is?\n\n\nSir Jamison Hill, The Iron Boar, approaches and shakes your hand: what an honor! Ser Jamison serves as the Baron’s champion and is renowned throughout the kingdom for his tourney skills.\n\n\n“I heard about how you helped take care of those bandits and trolls on the Baron’s Road,” he says. “The kingdom needs more fine young men like you. I expect to see great things from you today and in the future.”\n\n\n“Thank you, sir.”\n\n\nYou want to talk some more with him – he certainly has plenty he could teach you – but the herald calls you for your first bout. You wave farewell and enter the lists, wishing you had taken the time to make water one more time.\n\n\n“Are you ready girl?” you ask as you mount Bessy. Bessy snorts in reply. “That’s the spirit.”\n\n\nYour first match is against Lord Isaac Cleaver, The Cleaver. The man has a penchant for the flamboyant. The sun gleams off his silver gilded armor as he rides into position on his roan courser: his shield emblazoned with his house emblem, a silver cleaver beheading a golden goose.\n\n\nNot a very creative nickname, you think. Perhaps not, but it is the badassery of a nickname that is too be feared, not the cleverness.\n\n\nThe herald blows his trumpet, and you urge your horses on. Bessy hobbles along as fast as she can, but she is completely outmatched in speed by the roan courser. Everything else disappears as you focus on Lord Cleaver. The distance closes. You raise your lance and prepare to strike.", "action_results": [{"action": "Just hold the hell on", "result": "There is no way you have gained enough skill to make a precise aim. Your best bet is too just hold on with the fury of hell and hope for the best. You grit your teeth; here it comes.                                                                            \n\n\nCrack! Both of your lances splinter on contact. The collision jars you, but you manage to hang in the saddle. What a rush. Your heart hammers in your chest, and the world snaps back into focus. The crowd screams and cheers. Flags twirl in the wind and a herald’s trumpet booms. You turn around and see Lord Cleaver’s squire helping him to his feet while another attendant runs down his horse. You won!\n\n\nJon rushes forward to greet you. “Fantastic, I never thought you could win riding that old draft horse! It looked like you were moving in slow motion compared to Lord Cleaver.”\n\n\n“Bessy and I may not be a fast duo, but we’re tough as nails and hard as stone.”\n\n\nJon chuckles. “Interesting, we’ll have to have someone take care of that for you.”\n\n\n“What are you talking about?” you ask. Your face flushes red as you realization hits you. “Oh, damn it. You perverse bastard.”\n\n\nJon snatches the reins from you and snarls. “Never call me a bastard again. Got it?”\n\n\n“Uh, sure.”\n\n\nHe helps you off Bessy and slaps you on the back. “Good.”\n\n\nI wonder what that was all about?\n\n\nYou head back to your pavilion and bask in your glory. The road ahead is still long and perilous, but you took another step down the path of success. You kick back to relax when the flap of your tent opens. In steps a gorgeous lass, with gingersnap hair and vicious eyes. She looks wild and… hungry.\n\n\n“May I help you?” you ask.\n\n\n“The name is Bell. I’ve been sent to help you with a little problem.” She winks. “Your friend said you needed some refreshment before your next bout.” She shakes her breasts free from her loose shift and steps fully into the tent.\n\n\nBefore the tent flap falls, you see the shady moneylender prowling around Sir Jamison’s pavilion.\n\n\n“Come on hero,” she urges. “Don’t keep me waiting.”", "action_results": [{"action": "\"Jump on top of me, baby.\"", "result": "“Jump on top of me baby.”\n\n\nBell does as you say. Two beings disappear and reemerge as one as the pair of you become lost in the heat of passion. Funny thing about passion: it often comes and goes without warning. In this case forty-seven seconds.\n\n\nBell giggles. “First time?”\n\n\nYou groan. “First time.”\n\n\n“No shame in that, darling. I’ll be here when you get back. Practice makes perfect, am I right?”\n\n\nYou nod and step out of the tent.\n\n\n“Holy shit, what the hell happened!?”\n\n\nThe entire fairground is on fire. The air is rank with burning flesh and hair. Bodies are everywhere. Horses whinny in agony. Those not too injured to flee scramble about in sheer terror. High above you see the evil moneylender, floating on a black cloud, cackling and tossing lightning bolts.\n\n\nBessy plods toward you. A bolt catches her in the flank and explodes into a fireball. She collapses to the ground and shrieks. Another bolt pierces her neck and her and she lies silent.\n\n\nYou hear the tent flap jostle, and you wheel around. You clutch Bell by the throat and dive-tackle her into the tent. “What the fuck is this?” you scream.\n\n\nBell claws at your hand, gasping for breath. You relieve pressure, but keep her pinned to the ground.\n\n\n“I don’t know.” Tears well in her eyes.\n\n\n“Liar.”              \n\n\n“No, I swear. Your friend Jon sent me.”", "action_results": [{"action": "She's lying. Beat the truth out of her.", "result": "“You lying whore!” You bash her head into the ground and clobber her with your fist.\n\n\n“Stop, please. I don’t know anything.”\n\n\n“Tell me the truth!”\n\n\n“I am. Please, you’ve got to believe me.”\n\n\nHer pleas for mercy only anger you more. You know she is lying. “Last chance. Tell me what’s going on. Who are you? Who sent you? What the hell is that floating madman doing?”\n\n\n“I don’t know.”\n\n\nYou hit her again and again and again and again. You pummel the poor girl until her once fair face is a mask of blood and tears. The tent flap ruffles open and you spin around to see Jon step inside the tent.\n\n\nHe gapes. “What the hell are you doing?”\n\n\n“She distracted me while the lunatic set the world on fire.”\n\n\n“No she didn’t. I sent her to f-” he smacks his forehead. “Damn it all. What’s done is done. We can worry about this later. Right now, we have to stop this lunatic. Come on.”\n\n\nYou leave a broken Bell lying on the tent floor and follow Jon outside. Everything except your tent is in flames. The moneylender – perhaps it is time to start calling him a sorcerer – floats toward you on his cloud. You and Jon draw your swords.\n\n\n“Why didn’t he fry my tent too?”\n\n\n“How should I know?” says Jon. “Let’s just kill him and go into damage control mode.”", "action_results": [{"action": "Demand the sorcerer explain himself", "result": "No, this is too confusing and you have too many questions. You already stripped your honor by beating up an innocent whore. You can at least play the hero’s role and make the evil sorcerer reveal the details of his plans.\n\n\n“Explain yourself, fiend,” you say, brandishing your sword.\n\n\nThe sorcerer floats closer on his cloud and shrugs. “Sure, why the hell not?”\n\n\nJon sits and crosses his legs.\n\n\n“What are you doing?” you ask.\n\n\n“Preparing for a monologue.”\n\n\n“Comfy? Good,” says the sorcerer. “My name is Merek the Mad Mage of Misery. I pose as a moneylender to conceal my true operations as an evil wizard.”\n\n\nJon sighs. “A cover that is now blown.”\n\n\nMerek the Mad Mage of Misery ignores Jon. “Ever since you walked into my office, I knew you had the makings of a hero. I knew of the unicorn fart, and I knew a hero had been born. I knew he was somewhere in this area, but not exactly where. You are that hero. It’s in your eyes, your blood, your-”\n\n\n“Urine?” you ask.\n\n\n“Sure… The only person who could stop me was Sir Jamison and his magic sword and shield.”\n\n\n“I didn’t know he had a magic sword and shield.”\n\n\n“You just met him, and stop interrupting me!”\n\n\n“Sorry.”\n\n\n“As you can see, I have Sir Jamison’s magic sword and shield nice and safe up here with me.” Merek clinks the magical artifacts together. “I need to drink your blood to gain the power for my master plan to succeed. That is why I did not fry you and your tent. Once I extract your blood, I can complete my master plan.”\n\n\n“Which is?”\n\n\n“World domination.”\n\n\n“You seem to be doing pretty well without my blood.”\n\n\n“Shut up and prepare to die!”\n\n\nBolts appear in Merek’s hands as his cloud races toward you.\n\n\n“Jon wake up, he’s attacking.”\n\n\n“Huh, oh sure.” Jon leaps to his feet. “Let’s get this over with.”\n\n\nMerek hurls his bolts, which you and Jon dodge with ease. You slice Merek’s arm off as his cloud whizzes past. Jon leaps onto the cloud and stabs him in the back.\n\n\n“So that’s what doing that feels like,” says Jon as he yanks Merek off the cloud.\n\n\nBlack sparks shoot from Merek’s body as he slams into the ground. The sparks shoot and dance, stitching his arm back on. He rises to his feet and cackles at the sky.\n\n\n“Fools! Only a magic weapon can kill me. Ahhhhhhhhhargggggg”\n\n\nMerek slumps over and falls face down in the dirt.\n\n\nSir Jamison bends down and pulls a dagger from Merek’s back. “He forgot about my magic dagger.”\n\n\nJon shakes his head. “I hope this doesn’t become a thing.”\n\n\nThe three of you do your best at damage control. Jon kills Bell, and the two of you bury her in a shallow grave, pretending she never existed. Merek managed to kill literally everything else in a three mile radius, so the three of you take over ruling the kingdom. Sir Jamison becomes King Jamison. Jon becomes Warden of the North. And you receive the honor of knighthood, vowing to keep your whore murdering lifestyle in the past.\n\n\nYou marry a buxom wench – seeing as all the noble Ladies are dead – and, in a strange twist of fate, have seven daughters who all grow up to be fabulous whores.", "action_results": []}, {"action": "Attack", "result": "You don’t have the time to sit around and listen to a monologue. When evil rears its ugly mug, there is only one viable option: destroy it with extreme prejudice.\n\n\nWith swords in hand, you and Jon leap into action, literally. Unfortunately, the sorcerer is beyond your reach on his floating cloud. You and Jon jump as high as you can, but your best efforts are nowhere near good enough.\n\n\n“Well this is embarrassing,” says Jon after another failed leap.\n\n\n“A bow and arrow would really come in handy right about now.” You scan the bedlam for a projectile, but there is not much of anything to work with. “Well I’m stumped.”\n\n\n“Fools.” The sorcerer cackles as he tosses bolts of lightning toward you. “You should know better than to defy an all-powerful mage such as myself. Now perish!”\n\n\nYou successfully dodge the first couple bolts, but the sorcerer is throwing them around like candy and eventually one catches you in the leg. The bolt explodes on contact, obliterating muscle, tissue, ligaments, tendons, and bones. The intense heat cauterizes what little remains of your leg. The stink of your own charred flesh hits your nostrils and you gag. Crawling on hands and knee, you seek shelter in your tent, praying the smoke will conceal your movements. Jon will have to handle this on his own now.\n\n\nInside the tent, you pass out from the pain: never to awake again.\n\n\nWhat the hell happened?\n\n\nBell cut your throat with your own dagger while you were unconscious. If it is any consolation, Jon and Sir Jamison Hill managed to kill the sorcerer. When Jon found your lifeless corpse, he took it upon himself to brutally murder Bell.\n\n\nWhat happens now?\n\n\nWell, you were on the path to heroism, but you failed to kill the big baddie and fell into an act of villainy by beating the ever-loving life out of poor sweet Bell. So I imagine you’ll go to limbo where they’ll force you to play a never ending game of Monopoly for the next 1,000 years.", "action_results": []}]}, {"action": "Trust her.", "result": "Whether you trust Bell or not, a true knight never harms a lady… or a whore.\n\n\n“Alright,” you say pulling Bell to her feet, “help me save the day, and we can get back to putting a little baby hero in your belly.”\n\n\n“You think I want that after what you just did to me?”\n\n\n“Everyone wants the hero,” you deadpan. “So yes.”\n\n\nAnd you are right. Feminism is for spunky heroines, not the spunk covered ragtag sack ticklers of heroic knights. Bell grumbles a pithy supplication and follows you out of the tent into the inferno of the fairgrounds.\n\n\nThe evil moneylender stares at you from his floating cloud, with his face screwed up into a scowl of utter disgust and contempt. He leans over the edge of his cloud and vomits.\n\n\n“You,” he jabs an accusatory finger, “are a vile, putrid, scumbag of a hero. Have you no sense of decency?”\n\n\nYou hear a soft plop, plop behind you.\n\n\n“What are you talking about?” you ask, drawing your blade, preparing to pounce during the villain’s moment of weakness, but you hold off, curious of his ailment.\n\n\n“Your woman is naked before the world, dripping your seed! And the script says I’m the villain? What depraved fool green-lit this?”\n\n\n*Poof*\n\n\nThe narrator appears, riding a gigantic black German Shepherd, which is both ferocious and adorable. He wields a word processor and keyboard with a suspiciously sticky set of keys. He wields unadulterated badassery and lowbrow humor.\n\n\n“I’ll tolerate snark from the hero and the spirits that control him, but not the damn villain, and yes the script says you are the villain. So unless you want to be spontaneously transfigured into an elephant entering the initial stages of menopause, then I suggest you shut the fuck up and let his hoe decide if she’s being mistreated.” The narrator turns to Bell. “Are you being mistreated?”\n\n\n“Sort of, I guess.”\n\n\n“Would you like a pony?”\n\n\n“Yes?”\n\n\n“Done.”\n\n\nA pony wanders through the carnage, and Bell climbs on top, uncertain of what to do.\n\n\nThe narrator scowls at the villain. “Merek the Mad Mage of Misery, are you content with the current proceedings? Well are you?”\n\n\nThe villain tugs at the collar of his robes. “Yes, your godliness.”\n\n\n*Poof*\n\n\n“That was interesting,” you say. “Anyway, I’m making baby heroes. And that’s heroic. The naked human body is an art form to be admired, not scorned! Besides there’s no one left to ogle her since you killed them all. Except Jon, over there, staring at her burning bush. And I bet Sir Jamison is alive somewhere. He seems pretty badass.”\n\n\nJon smiles dumbly, sword in hand.\n\n\nMerek the Made Mage of Misery shrieks. “You perverted bastards! I’ll kill you all!” Lightning bolts sparkle in his hands, and he hurls them at you with the accuracy of a drunken Storm Trooper smoking black tar heroin.\n\n\nYou stand still, watching the blasts scorch the already scorched ground twenty yards away.\n\n\nJon lurches out of his stupor and rushes into battle, tucking away his playing sword and drawing his fighting one. “I’ll show you who the bastard is, you slut!”\n\n\nMerek the Mad Mage of Misery curses his incompetence and swings his attention toward Jon. The two engage in a very boring battle. Wild lightning blasts scatter the land while Jon meanders around and tries to jump onto the floating cloud, which always drifts beyond his reach.\n\n\nYou turn to Bell. “I have an idea.” You pull Bell from the pony’s back and make sweet love to her in the middle of the burning fairgrounds. Merek the Mad Mage of Misery catches sight and gawks in horror. This provides Jon the opening to leap onto his magic cloud and cut his throat with the magic dagger Sir Jamison conveniently just threw to him: because deus ex machina is beautiful and everyone knows only magic items can kill magic beings.\n\n\n…\n\n\nSweet, so what happens now?\n\n\nThe spirits guiding you probably leave mean comments because of the sexism and ridiculousness bomb we just exploded all over the place. At least we took it up to eleven.\n\n\nIt was rather ridiculous, but hey, I won, right! What should I do with the pony?\n\n\nBreed it with a unicorn and find out what manner of being is born when the abomination spawn spews magical flatulence.\n\n\nWicked. Do you have any parting words of advice for me or wrap-up narration?\n\n\nWhat the hell, is this twenty questions? I don’t know, go murder every sparkly vampire and warrior-cat that you see and you can’t go wrong. Shit, I just earned more hate comments.", "action_results": []}]}, {"action": "Ugh, I better go check out what that moneylender is doing.", "result": "Despite adamant protests from your little head, your big head wins the day, insisting you act responsibly and investigate what that shady character is up to: shenanigans no doubt.\n\n\n“I’m sorry, Bell. I have to take care of something quick.”\n\n\n“Oh, don’t leave me hero.” Bell wraps her arms around, drawing you in tight against her bare bosom.\n\n\nYou pull away from her enticing embrace before you change your mind. Now where did that moneylender run off? You don’t see him skulking around Sir Jamison’s tent anymore. Could your eyes have been playing tricks on you? The bad feeling in the pit of your gut says no.\n\n\nMuffled noises are coming from Sir Jamison’s tent. Not wanting to intrude on a living legend in the throes of lovemaking, you ruffle the flap of the tent to announce your presence. “Sir Jamison, are you in there? I noticed a shady character lingering around your tent a moment ago.”\n\n\nThe noise inside the tent ceases.\n\n\nOh, crap. Your dodge sense tingles.\n\n\nYou jump aside just in time to avoid incineration via fireball. Within the smoking remains of the tent, the shady moneylender stands poised to attack. Magic crackles in both of his hands. The shady moneylender is a sorcerer, who knew.\n\n\n“I knew you were up to no good,” you say, drawing your sword. “I don’t know what you’re up to, but I’m going to put a stop to it.”\n\n\n“Imbecile, you may have the skills, but you lack the tools to defeat me.”\n\n\n“We’ll just have to see about that!”\n\n\n“Is that really the best line you’ve got?”\n\n\n“I know you are but what am I?”\n\n\nThe sorcerer face-palms. “You’re an idiot aren’t you?”\n\n\n“Bring it on, bitch!”\n\n\nOnlookers scurry about to put out the fires the fireball ignited and to get a front row view of what is shaping up to be a good old-fashioned melee on magic standoff.\n\n\nThe sorcerer simultaneously hurls a fireball and casts a bolt of lightning. ", "action_results": [{"action": "Dodge the bolt; bat the fireball back at him with your sword", "result": "You dodge the bolt with ease and set your feet. You’re going to knock this fireball right out of the park. You step, swing, and… your sword melts as the fireball passes through and explodes amongst the crowd of onlookers.\n\n\nYou scream in agony as molten steel splatters across your body.\n\n\nThe sorcerer cackles. “Imbecile, only a magic artifact can repel a magical attack.”\n\n\nYou collapse to the ground, defeated. And dead. The sorcerer proceeds to extract your hero blood, which he uses to conquer the entire kingdom. A shame, you couldn't even save your friends.", "action_results": []}, {"action": "Double dodge!", "result": "Few living souls can successfully perform a double dodge, but you are a hero damn it. From the moment the unicorn farted, you were destined to accomplish great feats. You have the skill. You have the power. You have… ah, to hell with it. Just get on with it.\n\n\nYou avoid the bolt and the fireball, perfectly executing a textbook double dodge. The onlookers cheer and scream approval… except for the ones who got incinerated by the fireball you dodged. The bloodcurdling screams of the not quite dead but still severely burned could wake the dead. Way to not take one for the team, asshole.\n\n\n“Dodge all you want!” cries the sorcerer. “It won’t do you any good in the end. Your pathetic blade can’t kill me.”\n\n\nYou’re about to test that theory when a sparkly pulsating glow coming from behind the sorcerer catches your eye. The tantalizing and addicting flash of spectral lights can be only one thing: a magical artifact. The sorcerer must have been trying to steal it from Sir Jamison. If the sorcerer wants them, that must mean they can kill him. Or destroy the kingdom. One or the other.\n\n\n“We’ll see about that,” you shout as you charge ahead.\n\n\n“I’ll humor you, simpleton,” says the sorcerer. “Just try and strike me down. I’ll stand still.”\n\n\nThe sorcerer crosses his arms and smirks as you lumber toward him. His evil sneer disappears once you run past him. The magical artifact turns out to be a magic sword and shield combo. It’s on like a donkey’s hard on now.\n\n\n“No, you can’t!”\n\n\n“Sure I can,” you say as you bash and slash him with your magic weaponry. “By the way, if these things can kill you, why did you let me get so close to them?”\n\n\nThe world will never know the answer to that question. The sorcerer shrivels up and dies within a cloud of evaporated blood. His death screams awaken some of the recently deceased onlookers, which you swiftly put back in their graves unburied corpse state.\n\n\nFires rage throughout the fairgrounds and more bodies than you feel like counting litter the ground. Crows and ravens already flock to the feast. It looks like the tournament is going to have to be canceled. Oh well, there is always next year. You turn around and look to see if Bell is still alive and willing for a romp.", "action_results": []}]}]}, {"action": "Pinpoint your aim", "result": "If you can hit Lord Cleaver’s shield just right, then you can knock him right off of his horse. You can do this. This is what you spent all those hours training for. You pinpoint your target and adjust your aim. The horses draw closer. You can see the roan courser’s breath. Here it comes!\n\n\nCrack! Thud! Crack!\n\n\nWeightless, you are falling. A flash of pain. Blackness.\n\n\nI have good news, bad news and worse news, hero. Good news: you managed to hit your target. That first crack was both of your lances splintering. Bad news: the thud was you hitting the ground. Worse news: the second crack was your skull splitting in two when it bounced off a rock.", "action_results": []}]}, {"action": "I changed my mind; I'll fight in the melee like Jon said.", "result": "Wise decision: it is best to stick with your strong suits.\n\n\nYou excuse yourself and get up to leave. The moneylender, mutters something to himself while stroking his beard as you head toward the door. Something is really evil about this guy. You turn around and lop off his head before heading home. Yeah, that was probably a good idea.\n\n\nThe morning of the tournament dawns crisp and cool with a slight breeze, just enough to give the ladies’ skirts a nice billowing. You feel a familiar stirring in your loins, and it is driving you insane. As a fledgling hero, you have been saving yourself for your future princess bride, but dear God has it left you on edge, not that you have not had offers. Jon was right; your scar is a chick magnet. You practically have to beat them off.\n\n\nA gaggle of girls giggle as you walk past them. Bitches.\n\n\nWhoa, where did that come from? That is not very heroic. The proper term is ‘wenches.’ Remember that next time, fledgling hero.\n\n\nWith your minor slip into villainy over, you prepare for the melee and take your place in the fighting field. There appear to be fifty or so participants as you try to pick out some of the people the Baron told you about. You see Mad Moose McDoogle in his clumsy antlered helmet, Sir Richard Lionsmane with his shaggy locks, Sir Henry Williams a.k.a. The Rabid Fox, the Weasel brothers in their matching silver gilded armor, and Bucktooth Barry among others.\n\n\n“Save your energy,” says Jon. “Let the others wear themselves down. They’ll make a mistake eventually. Then you can strike when they’re weak and out of position. And stay by me. We might both be able to get knighthoods out of this.”\n\n\n“Don’t worry. I got your back Jon.”\n\n\nA blast from the bugle signals the start of the melee. The clamor of blunted steel on blunted steel rings through the fairgrounds. You and Jon fight back-to-back, just as you did against those trolls several years ago. You two are not the only ones fighting on teams. Out of the corner of your eye, you see the Weasel brothers and Mad Moose McDoogle charge The Rabid Fox.\n\n\nThe Rabid Fox looses ground as the trio attempt to surround him. He isn’t dodging. He’s parrying. He’s done for. The Rabid Fox’s and one of the Weasel brother’s swords shatter on impact. Mad Moose McDoogle peels off the attack and rounds on the Weasel brothers, catching them unaware. He knocks them both down and out just before The Rabid Fox charges him in turn.\n\n\nA sword slashes inches from your cheek, and you regain your focus. Dodge, slash, dodge, dodge, slash, dodge, trip, kick. Another one bites the dust.\n\n\nThe fighting continues until there is just you, Jon, The Rabid Fox, who has not only obtained a new sword but a horse as well, and Bucktooth Barry left.\n\n\nMaybe you should turn on Jon now?", "action_results": [{"action": "Fight with Jon.", "result": "Heroes fight with honor at all times. There is no way in hell you are going to betray Jon. How could you ever look him in the eyes again? Besides, he is pretty fucking awesome. If you are going to win this thing, you are going to do it the right way and beat him with pride, honor, dignity, and all the other bullshit that goes with being a hero.\n\n\n“I’ll distract him. You knock him off the horse,” says Jon.\n\n\n“What about Bucktooth Barry?”\n\n\n“Dodge.”\n\n\nJon darts off to run interference while you attempt to flank. The Rabid Fox is on to your plan though and outmaneuvers you while Bucktooth Barry hedges his position. This might go on for a while. What would a hero do?\n\n\nYou glance up at the spectators and catch sight of the princess. A blonde haired blue eyed bombshell with a bosom to die for. She flashes you a smile of perfect pearly whites. Did you expect anything else? Take a moment to picture all the ways you would love to chivalrously plow her into next Sunday. Just try not to ejaculate prematurely in your armor. That is not heroic. No, go ahead. I can wait.\n\n\nGot all that out of your system? Good. With the princess’s bosom in your mind to inspire you, you charge the mounted knight. He reels the horse around and barrels toward you, eager for the challenge. As you are about to collide, you dodge. The Rabid Fox brings the horse around for another pass. You feel the blood pumping through your veins. The air tastes sweet. Colors are brighter. The world slows down. This is what being a hero is all about.\n\n\nYou and The Rabid Fox rush each other once more. As you are about to collide, not only do you dodge, but you grab the reins as well and yank. Your arm feels like it is going to pop out of its socket, but you grit it out. The Rabid Fox flies through the air and thuds into the dirt. He stumbles to his feet and grabs a greatsword off the ground. Man, this motherfucker just does not give up.\n\n\nHe has the reach advantage, but he is hurt. Pretty bad, judging by the fact he just fell off a galloping horse decked out in mail while brandishing a sword. He should probably be dead: or at least broken. He uses his reach to keep you at a distance, but you bide your time. He will make a mistake. Dodge, backstep, yawn, dodge. A quick glance up at the princess’s bosom. With princess bosom lighting your fire, you see an opening and dive in and drive The Rabid Fox to the ground.\n\n\n“Well fought, friend. I yield,” says The Rabid Fox as you hold your sword tip over him.\n\n\nJon has finished off Bucktooth Barry. It is down to the two of you.", "action_results": [{"action": "For princess bosom!", "result": "There is only one way this story can unfold, and that is with you finally surpassing your master and claiming the princess as your own. For princess bosom! You charge.\n\n\nJon dodges your blow. You swing again. He dodges and counters with an upward thrust. No time to dodge, you catch his sword with your shield. The wood splinters, and you snap your wrist, catching his sword in the shield. Déjà vu?\n\n\nNot quite. A knee slams you in the groin, and you crumple to the ground. Fight through the pain hero! You lash you with your legs, catching Jon in the chest. Both of you regain your feet and slam into each other. Over and over you roll, grappling on the ground. Dust swirls around your heads. You throw blind punches. The crowd cheers.\n\n\nYou fight the good fight, but Jon wins in the end, catching you in a stellar headlock. The king congratulates you both and the crowd gives a standing ovation.\n\n\n“Best melee in years. I think the both of you earned a knighthood for such a fine display of chivalrous combat,” says the king. “Tonight there will be a feast for the ages... on the Baron’s tab of course.”\n\n\nYou are bummed you will not be getting princess bosom, but you feel proud of how you fought. Even heroes take their lumps from time to time.\n\n\nAs expected, Jon names the princess Lady Fair of the tournament. You see him whisper something in her ear and point in your direction. She is walking toward you! What the hell did he say?\n\n\n“Princess Anne.” You bow. “It is my pleasure.”\n\n\n“And mine. Would you care to walk with me in the gardens?”\n\n\nYou readily agree and spend much of the remainder of your time getting to know Princess Anne. She is everything you could hope for in a princess, blonde, blue eyed, fair skinned, sweet, charming, big bosomed, and all the works.\n\n\n“What did you say to her?” you ask Jon one evening.\n\n\nHe shrugs. “I love princesses as much as the next guy, but really, I’m in to redheads.” He smirks. “I think the farmboy turned knight getting the princess makes the better story. I’m nailing the Baron’s daughter. Wildfire hair on her.” He winks. “Just the way I like it.”\n\n\nMonths pass and you perform several fantastic heroic feats. Jon marries the Baron’s daughter and you become engaged to the princess. Some days it all seems so unreal, like just the other day you were selling turnips and mucking shit. Now you are a hero.", "action_results": [{"action": "Time to kill a motherfucking dragon.", "result": "That’s the spirit!\n\n\nEmissaries arrive at the capital from the neighboring kingdom of Irelandshire pleading for assistance with a dragon problem. It seems the fiend has been soaring around the country, torching towns, devouring livestock, looting treasuries and snatching young ladies from their bedchambers. Naturally, you don your shining armor and volunteer to help rid them of the menace once and for all. Princess Anne kisses you goodbye as you ride off to hunt down the winged beast.\n\n\nFinding the dragon’s lair – a cave high up a tall mountain with half the forest burnt to ashes – proves easier than you anticipated. No one ever said dragons were discreet. The march up the mountain presents more of a challenge. Far too steep for your steed, you hike up on foot. You soon learn hiking in full plate armor is not easy. Every step requires sheer willpower and brute strength. Sweat pores off you so fast you fear you are going to rust, so you strip down to your leathers and continue to the top light as feather, just like the old days when you first practiced with Jon in the yard. \n\n\n“Well at least you aren’t a knight in shining armor,” says the dragon as you enter his cave. The behemoth is resting on a hoard of gold, jewels, swords, cups, and other valuable crap because of course he is.\n\n\n“Pardon me?”\n\n\n“Do you have any idea how annoying it is fighting knights in shining armor? I just fry them with a nice blast of fire. They’re too heavy and clunky to dodge. No challenge at all. You should see the nice collection of armor I have though. I could outfit an entire empire.”\n\n\n“Actually, I stripped my armor coming up. I got sweaty.”\n\n\nThe dragon sighs. “Well you’re smarter than most at least.”\n\n\n“Your days are done dragon!” You prepare to make a heroic speech, but cut it off. “Wait, where are the noble ladies?”\n\n\n“Didn’t you see all the dung piles on the mountainside?”\n\n\n“You ate them!?”\n\n\n“What did you think I do with them? Keep them as company?”\n\n\n“You bastard!”\n\n\nYou draw your sword. Fate has finally arrived. Are you up to the task?", "action_results": [{"action": "Attack his eyes.", "result": "The eyes: go for the eyes. If you can blind the dragon, you can pounce in and end this while his guard his down.\n\n\nYou scoop a handful of ashes from the ground and fling them at the dragon’s eyes as you bound toward him. It’s not very effective… The dragon stares at you and shakes his head as you scuttle to a stop.\n\n\n“I burn entire cities and forests for a living,” says the dragon. “Do you have any idea how much ash is floating around in the air after I start lighting shit up?”\n\n\n“Uhm…”\n\n\n“Literally, a metric fuck ton.” The dragon blinks. “I have protective coverings over my eyes to keep all that crap out. How else would I be able to see with all that debris in the air? I’d be spending my entire fortune on eye-drops.”\n\n\n“Like a camel?” You sidle closer to the dragon.\n\n\n“Did you just compare me, a dragon, to a dirty, smelly, filthy, no good camel? You wannabe heroes have no resp-” the dragon sighs. “You know what? It’s not worth it. Sure, like a camel,” the dragon sighs.\n\n\n “So where’s your hump?” You continue to inch closer to the dragon.\n\n\n“Wh- what?”\n\n\n“Your hump. You said you’re like a camel, so where’s your hump?” You jump up and down, searching for a hump on the dragon’s back while closing distance.\n\n\n“You have got to be kidding.” The dragon slams his head into the cave wall. “Why do all the retarded heroes have to come fight me?”\n\n\nWhile the dragon wallows, you pitter-patter your way in close and drive your sword deep into his eye socket. The wyrm wails in agony as you wrench the sword free, clamber over his snout and shove the blade into his other eye. Before you can scurry away, the dragon whips his head around and snaps his massive jaws around you. You scream as your bones splinter and your innards trickle from your body. The world fades to black as the dragon swallows you down his gullet.\n\n\nThat seemed quite painful. If it is any consolation, you managed to both severely wound the dragon and piss him off before he ate you. The dragon goes on to burn the entire kingdom of Irelandshire to ashes in a blind rage before Jon and The Rabid Fox save the day and cut out his heart.\n\n\nPrincess Anne is heartbroken and goes on to become a sex addict and develops a dungeon porn fetish to cope with your untimely death.", "action_results": []}, {"action": "Attack his belly.", "result": "Everyone knows the underbelly of a dragon is vulnerable. If you get in close, your sword can rip through him like hot crocodile shears through flesh.\n\n\nYou charge the dragon with sword in hand. The dragon blasts fire. You have too much forward momentum; there is no way to dodge this one. The world slows to crawl and your entire life flashes before your eyes: all that time spent mucking shit and selling cabbages, long hours training in the yard with Jon, your sexless courting of Princess Anne. Wow, your life sucked.\n\n\nWell, maybe you can take the dragon with you: go out a hero and all that.\n\n\nYou grit your teeth and shut your eyes as you barrel into the firestorm. The stink of charred flesh and burning hair cloak you. Your blood boils, lips sear off, eyes burst and brain tingles as it begins to melt inside your skull. Somehow, you are still conscious as you storm through and plunge your sword through the dragon’s soft underbelly bounce your sword off the dragon’s rigid scales. Turns out those underbelly scales are just as tough as the rest of them. Who knew?\n\n\nThe dragon chuckles as you collapse to the cave floor in a smoldering heap. “Foolish bravery, mortal, is foolishness all the same.” The dragon admires you a moment longer before he devours you as a midday snack.\n\n\nIf it serves as any consolation, your remains go on to fertilize several small trees… which promptly get burnt down.", "action_results": []}, {"action": "Neither.", "result": "Attacking him head on would be suicide. Sure, it would be nice to blind him or cut into his underbelly, but he would just fry you with a blast of fire before you even got close. There is only one course of action to take in times like this: dodge.\n\n\nLike a timid bear you perform a false charge, pulling up at the last second as a blast of fire scorches the ground in front of you. Without your bulky armor you are able to twist and twirl, spin and swirl, dip and dive, jump and jive and pirouette away from the dragon fire while inching ever closer to the monster. Since when did you get moves like Jagger?\n\n\n“Die mortal,” the dragon shouts, releasing another blast of fire.\n\n\nYou duck behind a conveniently placed boulder just in time to escape. The dragon stalks closer. His massive limbs quake the ground with every step: his tail smashing the wall without purpose. Another blast of fire. The heat coming off the rock is like lava. You fear it is about to melt.\n\n\nIs this it? Is this the end?\n\n\n“Foolish mortal. The only way to kill a dragon is with a disorganized band of heroes and a bard, or with a magic sword. And you don’t have either. Mwhahaha.”\n\n\nShit. I’m totally fucked. Why didn’t I read that book on dragon clichés Jon bought me last Christmas? Think fast, think fast, think fast. Brain blast! Music! Music soothes the savage beast. Shit, I forgot my fiddle.\n\n\nThe dragon rumbles closer, taking his sweet time. Any more bright ideas, Mr. Hero?", "action_results": [{"action": "Cry and Beg for Mercy", "result": "“Please, Mr. Dragon spare me!” Tears pour down your cheeks, and you drop to your knees. “I’ll do whatever you want. I can be a good servant, or a steward. Everyone can use a good steward.”\n\n\nThe dragon laughs so hard the entire mountain shakes. The roof of the cave above his head collapses, crushing his head. Ever the opportunist, you leap to your feet and plunge your sword down his gullet. The dragon’s jaws snap shut before you can remove your arm. Steam spouts from his nostrils, burning your face. You see the dragon’s body burst into flames as you blackout from the pain.\n\n\nYou awake sometime later in unfamiliar surroundings. A nice plush pillow is beneath your head, and half your head is wrapped in bandages. Your balls itch, but when you go to scratch them you realize your arm is gone.\n\n\n“Where the fuck am I?”\n\n\nA comely wench caresses your hand. “My good knight, you killed the dragon! We heard the battle from down in the valley, and some of the braver folk went to investigate. They found you gravely wounded, so they brought you to me and I nursed you back to health.”\n\n\n“Are you a herb woman?”\n\n\n“No.”\n\n\n“What are you?”\n\n\n“A milkmaid.”\n\n\n“Why did they bring me to you?”\n\n\n“Milk gives you strong bones?” She shrugs. “But don’t worry, I did a good job taking care of you. I watched over you day and night, and I only touched your private bits a few times.”      \n\n\n“Well that’s nice of you, but… WHAT?”\n\n\n“To clean them, Sir.”\n\n\n“Oh, I’m sorry. I just thought… never-mind. Thank you.”\n\n\nThe milkmaid wench smirks coyly. “With my tongue.”\n\n\nGoddamn it.\n\n\nWell, there you go, Mr. Hero. You killed the dragon. Not exactly the most heroic showing, but it got the job done. I imagine you expect to go back to your princess bride now, am I right? Princess Anne must be dying to see you. Boy, do I have bad news for you.\n\n\nPrincesses’ do not marry hideously scarred men, and your face, well go look in a mirror. You look like someone slammed your head into a flaming brazier. Hey, don’t get too upset. You are still a knight, and you have the eternal gratitude of the kingdom of Irelandshire. Plus, you got a ton of booty from that dragon’s lair.\n\n\nTime passes and you heal, more or less. You have the pick of any non-princess in two kingdoms, but you decide to settle down with the milkmaid wench, whose name turns out to be Marie. The two of you have several healthy children together with heroic aspirations of their own. You still keep in touch with your old pals Jon, Samwellington, and The Rabid Fox. You have a few castles built in both kingdoms and become a legendary hero. Of course, when you tell the story, you leave out the crying and begging for mercy part.\n\n\nYour life with Marie is hot and steamy. You are not sure if you will ever get used to all of her kinks – you find yourself in some interesting scenarios when you wake up from time to time – but at the same time they kind of turn you on.", "action_results": [{"action": "Once upon a time...", "result": "The wintry winds howl a horrible wail, whipping white watery snow against the weathered watchtower’s westernmost wall. Yes, it is indeed a dark and stormy night, but darker and stormier and maybe just a tad more purple than your run-of-the-mill dark and stormy night.\n\n\nSomewhere deep in the forest a unicorn frolics in a magical glade, as elves watch and scamper amongst the trees, polishing their bows with the blood of dwarves.\n\n\n“Killed a big fat one today, Elfrond,” says Elfmoor. “Bastard was trying to chop down a cherry tree. Can you believe it, a fucking cherry tree? Sacrilege.”\n\n\n“Have you ever wondered why we hate the dwarves so much?” asks Elfrond.\n\n\n“What do you mean? They’re fucking dwarves! And this one chopped down a tree. A cherry tree. Only thing that rivals my love of trees are cherries. And music. And song. And like five other things.”\n\n\n“Yeah, I’ve just been thinking lately. How did we get these sweet bows, if we didn’t chop down a tree to shape them. And how do we burn fires without firewood? And why exactly do we hate the dwarves?”\n\n\n“It’s canon. Don’t ask questions.”\n\n\n“What’s a cannon?”\n\n\nSuddenly, the elves quit bickering. Something that only happens once in a thousand years occurs. The glade explodes with magical aura as the unicorn releases its legendary rainbow fart. Magical anomalies, such as this, signal only one thing: the birth of a hero.\n\n\nElfmoor takes a big whiff of the magical aroma. “B. E. A. Utiful. Times like this make life worth living.”\n\n\nElfrond shakes his head. “Elfmoor, we’re immortal. I’ve seen this like ten times already. And every time this happens, it means something evil is about to come afoot.\"\n\n\n“But the hero always wins.”\n\n\n“Have you ever heard the term collateral damage?”\n\n\n“Is that a sword?”\n\n\nAnd there you have it. The magical unicorn fart that marks your birth. How exciting! I wonder what type of hero you will grow up to be.", "action_results": [{"action": "I want to be a wizard! Step aside, Potter!", "result": "A fine choice my friend. What is fantasy without wizards and magic?\n\n\nYou are born to parents of mysterious lineage. You cannot recall their faces or remember much of anything about them. When you are three years old, an old grey-bearded man in a tall pointy hat whisks you away to his society of magical folk and teaches you all he knows of the arcane. Naturally, the society is on a magical island whose shores are shrouded in fog, located some indeterminate number of leagues off the coast of the mainland. Growing up is fun, but tedious. Spells and incantations do not learn themselves.\n\n\nEverything is peaches and plum pudding until one day you receive a summons – via giant flying eagle – from your old master. You are high up on the mountain, collecting snow samples for an alchemical experiment. It would take several days to hike all the way back to Manawell.\n\n\n“Mr. Eagle?” you ask. Your voice is hedging, what you are about to ask is groundbreaking.\n\n\n“What is it friend?”\n\n\n“Could you give me a lift back down the mountain? This sounds important.”\n\n\nThe eagle cocks his head. You are not sure if an eagle can look bemused, but if it could, you imagine this is what it would look like. “You know, no one has ever asked me that before. I always wondered why.”\n\n\n“Wizards are notorious for staying in shape,” you say. “How else could white-beards run around with swords and keep pace with adventuring young heroes?”\n\n\n“Ah, I see. You learn something new every day. Well, very well. Hop on my back, but try not to pull out any feathers.”\n\n\nThe eagle flies you down to Manawell in no time at all. There may even be time to run a nice 10k this evening to make up for your lost exercise. You rush through the magical community to your master’s tower, stopping only a brief moment to window shop at Merlim’s Beard Trimming Emporium. Don’t worry, I understand. Proper beard care is essential. No one wants to be the ruddy wizard with a bird’s nest in his beard. That guy sucks. You finish your browsing and proceed to your master’s tower without further incident.\n\n\n“Master Dumbledalf,” you shout as you reach the top room of the tower. “I received your summons. Is everything alright?”\n\n\nDumbledalf sets down his alchemical decanter and stares at you, his face expressionless. “Why are you here?”\n\n\n“I told you. I received your summons.”\n\n\n“Yes, but you aren’t supposed to be here for five more days.”\n\n\n“I hitched a ride with the eagle.”\n\n\n“You what!? Oh you ruined everything.”\n\n\n“Excuse me?”\n\n\n“I’m not supposed to die for five more days. You sapped all the drama from my character. Oh well, just sit tight one second.”\n\n\nDumbledalf crushes a few rattails and snake fangs with his mortar and pestle, boils some rum and troll’s blood, sprinkles some belladonna power, and mixes all the goop together. He downs the concoction in one gulp and collapses to the floor.\n\n\n“There, that’s better,” he says, coughing blood. “You have finally completed your apprenticeship under me. My time has come and gone, but yours is just beginning. As a true wizard, you must now undertake a heroic adventure. Let me see here.” Dumbledalf pulls a scrap of parchment from within his robes. “Ah, here we go. There are two available that fit your qualifications.”\n\n\nDumbledalf dies in your arms. You scream and curse the gods for taking the life of such a fine man. He was only 1984. He should have had at least another century in him. You finish your mandatory blubbering and look at the paper.", "action_results": [{"action": "Travel to Westengland and Kill some Evil Wizard", "result": "Why bother tutoring the next great hero when you can be the next great hero? Killing an evil wizard is certain to garner the fame and acclaim necessary to ascend to the ever sought after hero status. You grab an assortment of essential wizarding supplies from Dumbledalf’s stores, cast a burying spell on his body, and head to the port to set sail for Westengland.\n\n\nThe captain of the Briar Rose is thrilled to have a wizard onboard. Wizards prove quite invaluable at sea, what with all the pirates, storms, and sea monsters lurking beneath the depths.\n\n\n“A wizard at sea is worth his weight in silver,” says Captain Horatio.\n\n\n“I thought the saying was ‘worth his weight in gold.’\n\n\n“No offense your magicness, but if a wizard was worth his weight in gold, I’d have no room for a profit.”\n\n\n“Better to be alive and penniless than dead and rich.”\n\n\n“A wise wizard,” chuckles Captain Horatio. “Who would have guessed?”\n\n\nCaptain Horatio excuses himself and bustles about the ship, blowing his horn. What a pleasant fellow.\n\n\nYou watch as the magic island that has been your home for so many years shrinks in the distance. Leaving feels so weird, but when destiny calls, heroes must rise to the summons. Perhaps someday you will return.\n\n\nDespite all the perils of the sea, your trip to Westengland is nothing but sugarplums and rainbows. Dear Lord are you sick of sugarplums. Captain Horatio could have stocked the ship with a wider and more nutritional array of foodstuffs. At least all of the rainbows are pretty to look at.\n\n\nThrilled to be back on dry land and away from the sugarplums, you hasten to the king’s castle – aptly named King’s Castle – on the outskirts of the capital city. The road reveals no signs of this evil wizard, though the lack of peasants proves quite disturbing. On second thought, perhaps that is a sign.\n\n\nAs you near King’s Castle, the unmistakable and addicting allure of magic thickens in the air. Sweet, succulent, salacious magic. Coaxing your horse to gallop like she never galloped before and thanking God for the widespread success of the Rent-a-Horse industry, you burst onto the scene of a massive siege of King’s Castle.\n\n\nGrotesque trolls, disfigured by horrible magic spells, batter the gates with uprooted trees. Goblins beyond count shriek and swarm the outer walls on ladders crafted from bones. Wyverns – the dragon wannabes of the world – lash at the human defenders from above. Centaurs loose arrows and rape women, even in the midst of battle: the deviant equines. Mages cast spells and necromancers awaken the dead. The defenders fight with vigor and valiance only for the slain to arise and fight on. Most horrible of all, waves of human corpses throw themselves at the castle walls, snaking from the smoking ruins of the capital city down in the valley.\n\n\nThe evil wizard is really throwing the gauntlet at King’s Castle. The castle may be beyond saving already. The old adage a wizard is never late or early isn’t really true. Of course, a wizard can be late or early! They are human after all. Sort of. The wisest thing may be to find the king and save his sorry ass. Then again, heroes aren’t known for always making the wisest decision. So how about it hero, do you pack enough punch to turn the tides of battle on your own?", "action_results": []}]}, null, {"action": "I am Vegeta, prince of all saiyans!", "result": "No teaser here, but you wouldn't actually get to play as Vegeta, just an angsty prince with a dead father.", "action_results": []}, {"action": "Is there any way I can be a girl?", "result": "Certainly, you can be a girl. However, I am afraid it only comes in one flavor: spunky!\n\n\nBorn to ho-hum parents in a ho-hum village in a ho-hum kingdom, life growing up bores the daylights out of you. You are faster and stronger than all the boys are, and sexier and wilder than all the girls, despite their best efforts. You thirst for adventure and always prance around with an almost – but not quite – slutty smile on your face.\n\n\nOne evening you find yourself down at the lake with your friends: Cherry, Melisa, Tommy, and Brad. Of course, you have more friends because you are just so damn spunky, but these are your best friends.\n\n\nYou notice Tommy staring at you for the sixth time today. “Is everything alright, Tommy?” you ask. “You seem to be off in the clouds.”\n\n\n“Yeah, I’m ok. Can I tell you something?”\n\n\n“You can tell me anything, Tommy.”\n\n\n“No offense, but you have awesome breasts.”\n\n\nYou smack Tommy upside the head. “Tommy. Stop. Now. That is not cool. Just because I’m spunky does not mean you get to ogle my body. If that is all you can think about, stare at Melisa. She’s the whore of our group.”\n\n\nMelisa nods. “Guilty as charged.”\n\n\nYou storm off with Brad and Cherry following at your heels like a pair of nipping puppies while Tommy and Melissa disappear into the bushes. After all, this is a tale of a heroine’s escapades, not her sexcapades.\n\n\n“The nerve of that guy,” you say, shaking your head. “I am a prime virgin flower, and I will not be treated like some common whore. I think it’s time we went off on a grand adventure and left that jerk behind.”\n\n\nBrad’s face glows with delight. “I second that!”\n\n\n“What about Melissa?” asks Cherry.\n\n\n“As long as there is a man around with a penis and a pulse, Melissa will be fine,” you say. “I say we go adventuring!”\n\n\nSo you decide to leave your quaint little life in village ho-hum for the experience of a lifetime. Any thoughts as to where you are adventuring?", "action_results": []}, {"action": "Bonus Material", "result": "Thanks for playing. Enjoy the troll blood.", "action_results": [{"action": "Play as an Elf", "result": "Elves are certainly cliché. But I’m a species-ist. That means while I have no problem with humans be they white, orange, green, blue, black, yellow, pink, purple, brown, grey, indigo, crimson, maroon, cream, peach, pie… wait where was I going with this. Oh, right. I have a deep hatred of other species. We humans are superior and everyone else must bow down to our supremacy. Don’t judge me. It’s a disease. Now excuse me while I enslave this squirrel.", "action_results": [null]}, {"action": "Play as a Dwarf", "result": "Game of Thrones changed the world for dwarf kind forever. Are they a species or are they people? The species-ist in me is skeptical. Judgment shall be reserved.", "action_results": [null]}, {"action": "Play as a Warrior-Cat", "result": "You ran out into the road and got trampled by a runaway carriage, and your corpse was devoured by a pack of dogs. The End.", "action_results": [null]}, {"action": "Play as a Dark Elf", "result": "Have you not read Eternal? Go read Eternal. Then come back and tell me how heroic dark elves are.", "action_results": [null]}, {"action": "Play as a Sparkly Vampire", "result": "Really, you want to be a sparkly vampire? What kind of writer do you think I am? I have standards after all. Do you really want to be a sparkly vampire, or are you just trying to piss me off?", "action_results": [{"action": "I'm sorry. I'll pick something more appropriate.", "result": "That’s right young lady. No hero of mine is going to be some sissified vampire. My heroes have pretty blue eyes, long blonde hair and flawless pearly whites. Manliness.", "action_results": [null, null, null, null]}, {"action": "Sparkly Vampire!", "result": "Stephanie, I hate you.\n\n\nFine, you want to be a sparkly vampire, go ahead.\n\n\nOnce a pompous little lordling living in the south of Spainland you not only had the misfortune of being bitten by a vampire while having sex with your sister, but also getting gene spliced with a unicorn by the hands of a genre-bending – and seriously twisted – wizard from the future called a Brony. The magic involved with this transformation goes far beyond my comprehension of the arcane, but I assure you it was incredibly painful. On the positive end, however, you now fart bubblegum and shit figgy pudding.", "action_results": [null]}]}]}]}]}, {"action": "Dodge?", "result": "If Jon taught you one thing, it is how to dodge like it is your job, and it kind of is. Sort of. I don’t know, just kill the damned thing.\n\n\nYou leap over the rock and attempt a triple double-axle barrel roll in midair and land on the dragon’s head. For some reason, this works and you manage to dodge the dragon’s fire breath in the process with your sixth sense.\n\n\nThe dragon thrashes his head against the cave walls, but you manage to cling on while avoiding having your body smashed to a thousand bloody bits. You hack at the dragon’s head with your sword, but it may as well be a butter knife for all the good it does against the tough dragon scales. Maybe you should have dodged over toward one of those fancy looking magic swords.\n\n\nShut up. I have this under control.\n\n\nOk. Whatever you say, Mr. Hero.\n\n\n“Hey, dragon, you suck.”\n\n\n“I will not have a mortal make mockery of me!” the dragon bellows. “Get. Off. My. Head.”\n\n\nThe dragon swings his mighty tail at you, but once again, you manage to use your sixth sense to dodge all of the attacks. The dragon repeatedly pummels himself in the head with his own tail to the point where he shatters both his scales and his skull. You drive your sword into the crevice and perform a super-duper double whammy backflip with a 720 degree spin off the dragon’s head as he bursts into flames.\n\n\n“Wicked. Now how the hell am I going to haul all this shit down the mountain?”\n\n\n…\n\n\nWhat, aren’t you going to finish the story?\n\n\nYeah, just give me a second.\n\n\nWhat the fuck is the problem? I won, I want to marry my princess and lose my damn virginity already.\n\n\nI’m just struggling to comprehend how you turned into a jedi.\n\n\nA what?\n\n\nNever mind.\n\n\n…\n\n\nWord of your victory quickly spreads across the land. The king of Irelandshire showers you in gratitude and offers you his daughter as a bride, which you decline because you proved to be a noble and heroic knight and you already have a bride. You take some of the dragon’s treasure back home with you and build a series of castles and forts at strategic points across the countryside. Your future kin are keeping this kingdom for life. Historians and bards alike flock to scribble down your life story and paint it in song.\n\n\nYour wedding to Princess Anne is a legend in its own right: drunken revelry at its finest. Samwellington entertains the masses by sticking himself with pointy knives and not screaming in pain, good old pork lard. Jon and The Rabid Fox have a friendly sparring match, showcasing some of the finest swordsmanship since your melee. Jon later demonstrates another kind of swordsmanship with his wildfire gingersnap of a wife. On the table. Next to one of the cakes. The king gets drunk and accidentally burns down the stage while a troupe of troubadours are performing. No one important dies.\n\n\nMost importantly, you finally get to bang Princess Anne, that blue-eyed blonde haired big bosomed goddess of your dreams: a night of ecstasy ends in an explosion of pleasure with many more to come.", "action_results": [null]}, {"action": "How about I steal one of those sweet magic swords sticking out of his treasure pile.", "result": "You make a mental note to thank the dragon for providing you with the recipe for his death at his funeral as you yank the first magic sword you find from the mountain of plunder. The sword shines a brilliant blue-gold and has a queer hourglass shape carved into the blade: yep, definitely magic. Though, something feels awful familiar about this. Oh well, you can worry about that later. You have a dragon to kill.\n\n\n“Your day of reckoning has come, dragon!”\n\n\n“No, you fool,” the dragon rasps. “Put that down. Hasn’t anyone ever told you not to meddle with magic you don’t know how to use?”\n\n\n“Nope.”\n\n\nThe dragon breathes fire at you, but you knock it away with a swing of the sword. The resulting fireball explodes in the treasure hoard. Molten gold and silver splatter everywhere. Droplets burn into your arms and chest, but you struggle through the pain and raise the magic sword for the killing blow.\n\n\n“You’ll doom us all,” the dragon pleads.\n\n\nNot that it’s my place, but I think you should listen to the dragon.\n\n\nWhat do you expect me to do, negotiate a treaty?\n\n\nI would endorse that. ", "action_results": [{"action": "Fine.", "result": "“Alright dragon,” you say. “The asshole narrator told me not to kill you. What’s the deal?”\n\n\nThe dragon sighs in relief as steam spouts from his nostrils. “Of all the fucking magic swords, you grabbed the Time-Warper.”\n\n\n“And I care why?”\n\n\n“Once the blade slices into something living, the last five seconds of all life are replayed on an infinite loop.”\n\n\n“How do you stop it?”\n\n\n“You can’t.”\n\n\n“That’s fucking retarded. Who would make such a stupid sword?”\n\n\n“A villain.”\n\n\n“But the villain would be damning himself for all eternity too.”\n\n\n“I said a villain. Not a smart villain.”\n\n\nAgreeing you are at an impasse, you and the dragon negotiate a treaty the two of you find mutually acceptable. The dragon receives 50% of all taxes collected within Irelandshire, 1 out of every 3 sheep, 1 princess of his choice per year, and you receive one dragon ride every Sunday after church. You are not very good at negotiations.", "action_results": []}, {"action": "I'm killing him.", "result": "“You’ll doom us all,” the dragon pleads again.\n\n\n“No, just you.” And you hammer the sword into the dragon.", "action_results": [{"action": "Deja vu", "result": "“You’ll doom us all,” the dragon pleads again.\n\n\n“No, just you.” And you hammer the sword into the dragon.\n\n\n ", "action_results": [null]}]}]}]}]}, {"action": "Time to retire.", "result": "Did you seriously just turn down the opportunity to kill a dragon? You may be a hero, but you aren’t the cliché’ hero you were destined to be. You could have done more. Oh well, what is done is done.\n\n\nYou marry Princess Anne and have a beautiful wedding ceremony. All the dukes, earls, barons, and other lords in the kingdom attend. Jon serves as your best man and leads the wedding toast. Samwellington gets drunk and passes out in one of the massive strawberry cakes while receiving a blowjob from one of the maids, not quite sure how that happened.\n\n\nSir Henry Williams, your old friend The Rabid Fox, regales the guests with tales from the tournament and other ventures you undertook together in the aftermath. “Would you believe,” he says, “we saw a unicorn fart in a glade a few months back? Mark of a hero’s birth is what that is.” Hmm, so much for that once every thousand years bullshit. You lame ass heroes are becoming a dime a dozen.\n\n\nToo bad ma and pa could not be around to see this, but heroes almost never have parents survive long enough to see them achieve success. You know their watching over you from somewhere above though.\n\n\nLater that night, you finally get to relief all that pent up tension that has been building up in your loins for all of these years. You are glad you saved yourself because it was something special. All thirty seconds of it. But you get better with time, and Princess Anne plops out several little you’s, one of which grows up to be king someday.\n\n\nStill. You could have killed a dragon.", "action_results": []}]}, {"action": "Actually, I was going to name one of the other girls Lady Fair of the Tournament.", "result": "You have to be kidding me. Don’t you know anything about the antics of cliché knightly heroes? The gallant knight always marries the blue eyed blonde haired princess and enjoys blissful princess bosom until the end of his days. And you want to throw all of that away for some lowly baron’s daughter or common wench? You disgust me.\n\n\nFighting for an unworthy cause, you race forward to meet Jon in good old-fashioned master-student combat. The clamor of steel on steel fills the field as you and Jon clash and slash. Sweat stings your eyes as Jon attacks with relentless vigor. You dodge, parry, and counterstrike as best you can, but you are fighting against the man who taught you everything you know. How can you possibly hope to win? You don’t even have the righteous thirst for princess bosom riling your untapped potential.\n\n\nFor gritty lowborn buxom wenches!\n\n\nWell, I must admit they do have their own special brand of flavor. It just doesn’t have the same ring to it though.\n\n\nDrunk on visions of buxom wenches you dodge blow after blow after blow. You resist the urge to strike and continue to dodge; your heart will tell you when it is time to attack.\n\n\n“I taught you well,” Jon pants. “You’re dodging like a true champion.”\n\n\n“I learned from the best.”\n\n\n“Time for another lesson.” Jon backs off and takes a defensive position. “You can’t dodge if I don’t attack.”\n\n\n“You son of a bitch.”\n\n\nJon smirks. “Trumped.”\n\n\nA crazy idea crosses your mind. You don’t know if it’ll work – or if it even makes any sense – but it just might be stupid enough to work. With nothing to lose and everything to gain, you begin the attack. Just as expected Jon dodges. Then you dodge his dodge, catching Jon completely by surprise. Taking a page out of Samwellington’s incredibly short book of useful combat skills you follow up with a dodge ram attack, circling Jon and barreling him into the ground. The maneuver hurts like hell, but like a true hero you ignore the pain and leap to your feet.\n\n\nYou hold your blade over Jon’s throat. “Yield.”\n\n\nJon chuckles. “Nice moves. You win.”\n\n\nYou help Jon to his feet as the crowd erupts into a chorus of cheers and shouts.\n\n\n“What skill! What daring! What a fight!” The king bids you and Jon both kneel and knights the pair of you right there in the field. “They’ll be talking about this tourney for ages. I don’t even know what that was you did there Sir, but it was fantastic.”\n\n\nAll that is left is for you to name the Lady Fair of the tournament. I still don’t approve of your anti princess antics, but you showed mettle in the melee and that is something to take pride in.\n\n\nTwo buxom wenches who have caught your eyes on since the tourney started: the ginger haired Baron’s daughter, Ginger, and a lowly servant woman, Abbey, with rather typical and mundane features. What the servant woman lacks in grandeur she makes up for with a charming smile and pleasant cuteness all her own. Of course, naming a servant woman Lady Fair could cause some very serious problems by offending the nobles.\n\n\nNot that it is my place to intrude young knight, but Jon has been ogling the gingersnap all day. Take that as you will. The choice is yours after all; you earned it.", "action_results": [{"action": "Name Ginger Lady Fair", "result": "It takes a very special and talented person to handle a fire-crotched wildfire gingersnap, and quite frankly I don’t think you have what it takes.\n\n\nYou name Ginger Lady Fair and marry her shortly after. Jon turns down your request to be your best man, saying something about a dragon he needs to kill in Irelandshire. You’re bummed, but you understand. A hero’s work is never done until the end of the story. Ginger is a freak in bed, and just as I warned, it takes all of your energy to feed her wicked sexual appetite.\n\n\nLife goes on and you undertake a series of adventures with your new friend The Rabid Fox. Sadly, as the years pass you and Jon grow further and further apart. Years go by without seeing or hearing from him at all.\n\n\n…\n\n\nIt has been ten years since the fateful tournament, and you have a small brood of gingersnap children to go with your gingersnap wife. You doubt any of them have it in them to be heroes. There isn’t even a strawberry blonde one in the bunch.\n\n\nAfter several weeks of adventuring with The Rabid Fox, you wave farewell to him at the fork in the road and head to your respective castles. On the way, you find your lands burnt and salted. The villages are nothing but smoldering ruins and the peasants have completely vanished. Massive piles of dung litter the landscape. Urging your trusty steed, Hot Biscuit Slim, to a full gallop you arrive at your castle to find it lying in ruins. Oh, and there’s a dragon sitting on top of the pile of rubble. Jon is there too.\n\n\nYou are starting to think Jon may be jealous about you marrying Ginger. He does have an unhealthy fixation for fire-crotched gingersnaps.\n\n\n“Where the hell is my family?” You draw your sword, waving it menacingly.\n\n\n“In my belly.” The dragon guffaws, releasing a blast of deadly dragon fire. “Thank you so much Sir Jon for raping the woman first. I love my food when it’s properly terrorized and ravaged.”\n\n\n“Jon! How could you?” You fall to your knees in sorrow. “You were my friend!”\n\n\n“Don’t listen to the dragon! She’s lying. I’ve been tracking her for weeks. She’s the mate of the dragon I killed in Irelandshire years ago. To avenge her lover, she’s trying to turn you against me by creating this incredibly unnecessary scenario to frame me for the rape, murder, and plunder of all you know and love.”\n\n\n“That seems excessive, Jon. Excuse me if I don’t buy that.”\n\n\n“It’s true! She wants to set us against each other so she can kill us both while we’re at one another’s throats.”\n\n\n“For what greater purpose?”\n\n\n“Elaborate revenge and kingdom domination.”\n\n\n“Hmmm, we are pretty badass. I doubt she could kill either of us one on one. And that does sound like something a dragon would do.”\n\n\nThe dragon roars and flaps her massive wings. “I never lie about properly terrorized and ravaged food. Rape and betrayal are the perfect seasonings.”\n\n\nWell now, this is an unfortunate situation. Who is telling the truth?", "action_results": [{"action": "Kill the dragon", "result": "“I trust you, Jon. Let’s make this scaly freak go the way of the dinosaurs. Extinct.”\n\n\n“Leave the witty one-liners to me and you’ve got a deal.”\n\n\nTogether you and Jon dispatch the dragon after a long and grueling battle. You don’t remember any of the details because your heart is too choked with grief. The important thing is the dragon is dead and you’re not. Exhausted and suffering from severe burns you and Jon slump against the ruins of your castle.\n\n\n“Well, so much for a heroes ending,” you say, emptying your canteen. “I guess this is what I get for breaking the cliché.”\n\n\n“I have a confession to make,” says Jon.\n\n\n“Oh, God, don’t tell me the dragon was telling the truth.”\n\n\n“It’s a dragon, man. They always tell half-truths. Everything I said was true. I really was tracking the dragon to kill it.”\n\n\n“But…”\n\n\n“But I got here before the dragon and raped your wife. I’m sorry, man, I have a sickness for fire-crotch. In the meantime, the dragon wasted your livelihood then came and ate Ginger out from under me.”", "action_results": []}, {"action": "Kill Jon and the dragon", "result": "“You bastard! How could you rape my wife!?”\n\n\n“I’m not a bastard!”\n\n\nYou and Jon attack each other, and just as Jon warned, the dragon fries you both with a blast of dragon fire. With the two of you dead the dragon goes on to… get slain by The Rabid Fox a few hours later.", "action_results": []}]}, {"action": "Name Abbey Lady Fair", "result": "You already shunned cliché protocol by refusing to fight for princess bosom, so you may as well go full renegade and elect the servant woman Lady Fair. There is something bewitching about good old down to earth country cuteness. All of the beautiful noble Ladies can primp themselves up all they want, but they can never attain the country wild of a lowborn servant girl.\n\n\nA wave of awe spreads through the crowd as you proclaim Abbey Lady Fair. Fights break out, which quickly turn into full-blown riots. You grab your new ladylove and disappear in the chaos while you still have a chance to escape.\n\n\n“Not so fast,” snarl the high-pitched bitch voices of the weasel brothers. “You committed a great insult today. I think the king will be quite pleased when we bring him your heads.”\n\n\n“I won the melee. By law and tradition the right to name Lady Fair is my choice and mine alone. Now get out of my way or else I’ll have to kick your ass all over again.”\n\n\n“Can you fight the both of us and defend your whore at the same time?”\n\n\n“He doesn’t have to.” The Rabid Fox draws his blade and springs to your side. It appears you have made a friend. “My good, Sir, my sword is yours.”\n\n\n“Thanks, but why are you helping me? I broke the cliché.”\n\n\n“I don’t know what that means, but you fought with honor. And that I can respect.”\n\n\nThe weasel brothers topple over unconscious. Jon and Ginger stand behind them each holding a big ass rock.\n\n\n“My way saves time.” Jon discards his rock and beams. “Now let’s get out of here so I can get it up and get it on. Know what I mean?”\n\n\nWith that taken care of the six of you make your escape. (The Rabid Fox picked up a prostitute on the way out, that dog.) The kingdom devolves into a bloody civil war as a result of the tournament debacle. In the mayhem, the king got trampled to death and poor Princess Anne was brutally raped by no less than sixty-nine men. Princess Anne recovered from the savagery and personally hunted down every single one of the scum and forced them to castrate themselves and consume the mess. Future reference, don’t mess with her.\n\n\nYou, Jon, and the Rabid Fox carve out your own minor kingdoms and remain close friends to this day. You feel horrible about what happened to Princess Anne and offer her a place of honor in your court, but she politely declines, harboring no bad feelings against you. She elects to travel the world as an adventurer. Your life with the newly crowned Queen Abbey is blissful and filled with bosom and country cunt. You never get the ever sought after princess bosom, but queen bosom is a nice too.  \n\n\nI swear she called it that, not me!", "action_results": []}]}]}, {"action": "Turn on Jon.", "result": "Fuck this shit. You’re in it to win it. You whirl around and knock Jon out cold. Poor bastard never saw it coming.\n\n\nBucktooth Barry gestures toward The Rabid Fox and the pair of you charge the mounted knight. You pull up at the last moment and watch The Rabid Fox clobber Bucktooth Barry aside the helmet. Seizing the opportunity, you bolt in, grab the reins and yank. The horse bucks, but The Rabid Fox manages to cling in the saddle.\n\n\nWith no other options, you hack at the horse’s legs. The beat cries out in pain as The Rabid Fox topples from the dying beast. You thrust your sword, sticking the point an inch from The Rabid Fox’s throat.\n\n\n“Yield.”\n\n\nThe Rabid Fox coughs blood. “You have no honor. You’re no… hero.”\n\n\n“Hero’s win. I won. Now yield.”\n\n\nBlood gushes down your leg, and you scream in pain as you collapse to your knees. What happened? What the bloody fucking hell!? The dying horse lying beside you twists its neck, reaches up and bites you in the throat. Warm blood trickles down your body. You cannot breath.\n\n\nYou fall into a pool of blood.\n\n\nThe Rabid Fox staggers to his feet, shaking his head.\n\n\nYou hear Jon’s voice. “A heroic knight fights with honor at all times.” Those are the last words you hear as the world fades to black.\n\n\nWell that was disappointing. Killed by a horse. Apparently, you were not the hero I thought you were. He must be somewhere else. Enjoy death.", "action_results": []}]}]}, {"action": "Compete in the melee.", "result": "It is best to stick with your strong suits. You have combat training and can dodge with the best of them in the melee. From what you understand, dodging is frowned upon in jousting. Besides, you would have to borrow a horse from someone, and you do not have the money to ransom the horse if you lose. Debtors do not make good heroes.\n\n\nJon decides to enter the melee as well.\n\n\nThe morning of the tournament dawns crisp and cool with a slight breeze, just enough to give the ladies’ skirts a nice billowing. You feel a familiar stirring in your loins, and it is driving you insane. As a fledgling hero, you have been saving yourself for your future princess bride, but dear God has it left you on edge, not that you have not had offers. Jon was right; your scar is a chick magnet. You practically have to beat them off.\n\n\nA gaggle of girls giggle as you walk past them. Bitches.\n\n\nWhoa, where did that come from? That is not very heroic. The proper term is ‘wenches.’ Remember that next time, fledgling hero.\n\n\nWith your minor slip into villainy over, you prepare for the melee and take your place in the fighting field. There appear to be fifty or so participants as you try to pick out some of the people the Baron told you about. You see Mad Moose McDoogle in his clumsy antlered helmet, Sir Richard Lionsmane with his shaggy locks, Sir Henry Williams a.k.a. The Rabid Fox, the Weasel brothers in their matching silver gilded armor, and Bucktooth Barry among others.\n\n\n“Save your energy,” says Jon. “Let the others wear themselves down. They’ll make a mistake eventually. Then you can strike when they’re weak and out of position. And stay by me. We might both be able to get knighthoods out of this.”\n\n\n“Don’t worry. I got your back Jon.”\n\n\nA blast from the bugle signals the start of the melee. The clamor of blunted steel on blunted steel rings through the fairgrounds. You and Jon fight back-to-back, just as you did against those trolls several years ago. You two are not the only ones fighting on teams. Out of the corner of your eye, you see the Weasel brothers and Mad Moose McDoogle charge The Rabid Fox.\n\n\nThe Rabid Fox looses ground as the trio attempt to surround him. He isn’t dodging. He’s parrying. He’s done for. The Rabid Fox’s and one of the Weasel brother’s swords shatter on impact. Mad Moose McDoogle peels off the attack and rounds on the Weasel brothers, catching them unaware. He knocks them both down and out just before The Rabid Fox charges him in turn.\n\n\nA sword slashes inches from your cheek, and you regain your focus. Dodge, slash, dodge, dodge, slash, dodge, trip, kick. Another one bites the dust.\n\n\nThe fighting continues until there is just you, Jon, The Rabid Fox, who has not only obtained a new sword but a horse as well, and Bucktooth Barry left.\n\n\nMaybe you should turn on Jon now?", "action_results": [null, null]}]}, {"action": "Surrender.", "result": "Sometimes the odds are just stacked too highly against you. It is not that you are a coward or anything. It is just that you know a lost cause when you see one. If the situation had been different… Oh well, what is the worst that can happen? They will probably just steal your valuables and leave you on your merry way. Thankfully, none of you are women.\n\n\n“I yield,” you say, unbuckling your sword belt.\n\n\n“Some knight you are,” Jon scoffs as he rushes the bandits. Five bolts tear into his body, ripping his flesh to ribbons like a ragdoll.\n\n\nSamwellington squeals incomprehensible gibberish.\n\n\n“He never even had a chance to dodge.” A lone tear trickles down your cheek. “Poor bastard.”\n\n\nJon’s eyes snap open. He glares at you as he struggles to his feet, using his sword as a crutch. “Cunt.” He takes a step toward you. Five more bolts drive into him, and he collapses in a heap.\n\n\nSamwellington squeals more incomprehensible gibberish.\n\n\n“What the-?”                                                                 \n\n\n…\n\n\nYour head is throbbing and you taste dirt and blood. Bindings dig into your wrists and ankles. The bandits are dragging you through the undergrowth: rather unkindly as your head bangs into root and trunk alike.\n\n\nOh dear God, I hope I don’t have a concussion. Mom always told me to wear a helmet.\n\n\nHow long had you been unconscious? Surely, it could not have been more than a minute or two. The road should still be close. If you could only somehow manage to escape, you could gather reinforcements.\n\n\nYou thrash in an attempt to break free, but your efforts are rewarded with nothing but a series of swift kicks to the ribs. You slip into your happy place for the remainder of the journey, day dreaming of sweet, succulent, juicy bacon and princess bosom.\n\n\n…\n\n\nA fist drills into your gut, wrenching you out of your blissful imagination. The bandit leader towers over you, looking buff and pissed. You know he is the leader because he is wearing a cape and is the only black dude in this story.\n\n\n“Alright, punk, you’ve got two choices.”\n\n\n“Naturally.”\n\n\n“I’m always looking for good men to join my crew, and since you surrendered like a good little bitch, you get the first crack at signing up. All you have to do is kill your friends to prove your loyalty.”\n\n\n“Did you have to hit me?”\n\n\n“Yes, it illustrates my tough guy, no bullshit attitude.”\n\n\n“Oh, I see. Kind of like how Dark Lords sacrifice random minions to show how evil they are.”\n\n\n“Exactly. You get the picture. I knew I liked you. Now go kill your friends and maybe one day you can earn the right to wed my ebony bandit princess daughter.”\n\n\n“Is she tight and curvy?”\n\n\n“What part of bandit princess don’t you get?”\n\n\n“Sweet.”", "action_results": [{"action": "Accept the offer", "result": "“I love princess bosom! And bacon.”\n\n\n“Of course you do. Underlings, untie him and give him his sword. He has friends to murder.”\n\n\nThe bandit underlings do as commanded and direct you to the tent where Jon and Samwellington are being kept on the opposite side of the camp. The entire place is a mess of mud and slop: nothing like a rainstorm to turn a perfectly planned camp into a pile of crap. As you make your way to take care of business, you spy what can only be the ebony bandit princess. The bandit leader did not do the lass justice. She is nothing less than a dark chocolate goddess sent from the heavens themselves.\n\n\nShe notices you staring and rubs her nipples. “Like what you see?”\n\n\n“Yes, Mam.”\n\n\n“Me too.” She winks and blows a kiss. “Think your cute?”\n\n\n“You can bet your scantily clad ass and bosom I do. I’m a generic hero after all. Being cute is in the job description.”\n\n\n“Ooooooo, a generic hero turned renegade! That really turns me on. I’m so wet.”\n\n\n“Yeah, all this rain is getting me soaked too.”\n\n\n“Cute and funny! We’re going to have a lot of fun tonight.”\n\n\n“I try to have fun every night. I love games. Do you like games?”\n\n\n“I think I just orgasmed. See that tent? Five minutes. Be there.”\n\n\nThe ebony bandit princess saunters off, leaving you alone to complete your dark deed. Looking forward to countless nights of games and fun, you duck into the tent to kill Jon and Samwellington. They are blindfolded, bound, and gagged. They won’t even know you betrayed them!\n\n\nYou raise your sword to do the deed, but before you can deliver the stroke, all the wonderful memories you had training under Jon stream through your mind. You remember the first time he taught you to dodge, the first time he had a random ragamuffin kid in the hamlet throw piles of shit at you, the time he told you what a clitoris is, and the time he first taught you that survival sometimes means kicking the enemy in the balls.\n\n\nShit I dunno if I can do this.\n\n\nPerfectly understandable, but I assure you the ebony bandit princess is the only ebony chick in this universe. Is your friendship worth giving that up? She is unique, one-of-a-kind, like a special edition Poke’mon.", "action_results": [{"action": "Ebony bandit princess, I choose you!", "result": "How positively villainous, betraying your best friend and teacher. You kill Jon with a discreet thrust to the heart. Samwellington takes a little more work since you have to cut through all the fat, but in the end, the deed is done. I hope you are proud of yourself.\n\n\nWith a minute to spare, you enter the tent the ebony bandit princess demanded. You play games together all night long, every night for years to come. Eventually, you take over and become the new bandit leader, earning a fortune in the bacon smuggling trade. Life couldn’t be better for a bandit king.\n\n\nFor awhile you feared the ghosts of Jon and Samwellington would return to the living world and haunt you for your atrocious crimes, but thankfully you are left in peace.\n\n\nOne night you die of a heart attack while playing your nightly game with your ebony bandit princess turned queen. The absurd amount of bacon consumption probably had something to do with that. Before you were forced to enter your happy place all those years ago, you had been able to suppress your bacon cravings. Since then you could never resist the urge. Alas, life treated you well all the same.\n\n\nThe afterlife does not. You go to the innermost circle of hell and burn in eternal hellfire for murdering your friends in cold blood, asshole.", "action_results": []}, {"action": "Free Jon and Samwellington", "result": "No, you just cannot bring yourself to betray your friends like this. You are a hero goddamn it, and being a hero sometimes means letting the legendary Poke’mon roam free. For whatever reason, the bandits just assumed you would kill your friends and did not even bother maintaining a guard on you until you actually did the dastardly deed, which makes freeing Jon and Samwellington astonishingly droll.\n\n\nSamwellington maintains the status quo by squealing incomprehensible gibberish. The fellow is nothing if not consistent.\n\n\nFreed from his bindings, Jon decks you in the jaw and kicks you in the groin once you hit the ground. “Never. Call. Me. A. Fucking. Bastard.” He kicks you once again for good measure.\n\n\nYou curl into a ball and wheeze. “Understood.”\n\n\nWith that out in the air, Jon reverts to all smiles and rainbows and helps you back to your feet. “Good. Thanks for cutting us loose. Ready to settle the score on these pricks?”\n\n\n“Yeah, just give me a minute. Still in pain here.”\n\n\n“Right, right.”\n\n\nAfter you recover from the assault on your genitals, you, Jon, and the squealing Samwellington launch a surprise assault on the bandit camp. They prove as unprepared and hapless as they have so far demonstrated. Stab, dodge, slash, hack, dodge, dodge, slash, dodge, stab. Soon enough only the bandit leader and the ebony bandit princess remain.\n\n\n“Look at what you’ve done!” he shouts. “Do you think I’ll just stand for this?”\n\n\n“I thought you just stood around and scratched your nuts all day,” you say. “This is a pretty piss poor operation.”\n\n\n“You piss pot! You threw away the opportunity of a lifetime. You could have had an ebony bandit princess. I was going to look at you as a son! Now you’ll never find true love or happiness.”\n\n\n“My uncle always said, ‘Every piss pot has its lid.’ I’ll find mine some day.”\n\n\nThe bandit leader draws his scimitar and discards his cape. Oh snap, he means business now. “You son of a peasant! I’ll kill you!” The bandit leader darts forward with the speed of a black mamba.\n\n\nYou dodge the attack like a pro. The bandit leader moves to strike again, but his own daughter stabs him in the back.\n\n\nThe ebony bandit princess points to the same tent she did earlier. “You. Me. Tent. Now.”\n\n\n“Yay, I love games!” you cheer as you follow her into the tent.\n\n\nWell, well, well nice going hero. You have your cake and you get to eat it out too. Life goes on and you and Jon eventually receive knighthoods for your valiant efforts in your ongoing adventures. Samwellington continues to provide… company if nothing else.\n\n\nEver since you entered your happy place, you have had difficulty resisting the succulent allure of bacon. Thankfully, with Samwellington around the bacon never lasts long, probably saving you from a heart attack.\n\n\nYou marry the former ebony bandit princess and enjoy your specialty games every night. Yay games!", "action_results": []}]}, {"action": "Refuse the offer", "result": "There is no way you can betray your friends like that, even if it means certain death. They would never betray you. That manner of treachery is the stuff villains are made of, and that is a long dark road you want no part of. Villains never get princess bosom! You’re also not too sure about their bacon situation.\n\n\n“I’ll never join you!”\n\n\n“Really? What a pity. I suppose I’ll have to waste you now.” The bandit leader draws his scimitar. “Ebony, get in here!”\n\n\nA slick dark chocolate goddess enters the tent: scantily clad in bosom emphasizing furs. “Yes, father?”\n\n\n“I wanted this chump to see what he was missing out on. Flash him a little more skin… no not that much! Put your top back on!”\n\n\n“Wait a second,” you say. “You named your daughter Ebony? Isn’t that crass?”\n\n\n“I’m not very creative, alright. I don’t even have a fucking name of my own.”\n\n\n“I’m just going to call you Sinbad. Because you sin and you’re bad. Get it?”\n\n\n“Oh mother-fucking merciful God!”\n\n\nThe bandit leader, now known as Sinbad hacks your body to bloody bits with his scimitar while Ebony rubs her nipples in the background. Something tells me she has daddy issues. Anyway, you’re dead, so you won’t get to explore them. ", "action_results": []}]}]}]}]}]}