{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=39055", "context": "", "first_story_block": "Your name is Leo Trapa and your achievements as Commodore of your ship Adventurer have already made you one of the most famous sailors in your world of Magellan. The Adventurer is a tough little ship and veteran of several battles, large enough to hold a Crew of 30 Sailors and 30 days worth of Supplies for them. Although you are only twenty-one years old you have already received the rank of Commodore from your Queen in recognition of your superb ability and seamanship.\n\n\nThe World of Magellan on which you live is mostly ocean occupied by a scattering of islands: twenty-five have already been discovered and there are almost certainly many more waiting out there. The people of your homeland, the Kingdom of the Three Islands, have a rich naval tradition and are technologically advanced: the Adventurer carries four cannons and all of your crew are armed with muskets, though these are slow to load making the sword your secondary weapon. A dozen Colonies have been established beyond the Great Reef which rings your three home islands but these range from thriving settlements to tiny outposts of civilization.\n\n\nYour biggest problem on long voyages is that your ship can only carry enough Supplies for 30 days which will make finding and obtaining fresh sources of Supplies your top priority. If you ever run out of Supplies (your Supply number falls to 0) then you and your Crew will starve to death and die. You will almost certainly lose Crew members during your voyage and you must be careful that your Crew number never falls to 0 either: that will mean that you and all your Crew are dead.\n\n\nFrequently there is a time element involved during your voyages and you will want to complete them in the smallest number of Days possible. Successfully completing a Voyage ahead of your Competitors will result in a Score Point which will show if you leave a Comment after the game that you have completed this story with a very high degree of skill. As in previous adventures you will find it useful to make a map of the waters you sail as you may return this way again and the information may benefit you...\n\n\nSo good luck reader, make wise and strategically sound choices and with a little luck, a good course and a fair wind you might live to see your homeland again!", "action_results": [{"action": "Click here to begin your adventure (remember to pick up the List of Noted Sailors first)", "result": "You stand in the familiar anteroom of the Royal Palace in Golden Sands, the Capital of The Three Islands, your homeland. Either side of you stand your fellow officers Naomi Swift and Eva Freer, both as experienced on the high seas as you are yourself. Pale and slender with long fair hair Naomi's delicate appearance hides a spirit of iron and determination. Eva on the other hand looks every bit as tough as she is with tomboyish short purple-black hair from beneath which her eyes seem to glare in a challenging way at everything she sees. They are your two best friends for different reasons: for Eva you feel something approaching devotion while at the same time awkwardly aware you inspire similar feelings in Naomi.\n\n\nThe Throne Room's doors open and Richard Quarrel, a slimy snake of a man whose marriage to your Queen has done little to improve his popularity with anyone, smiles at you all.\n\n\n\"The Queen will see you now,\" he announces.\n\n\nGoing inside you find more familiar faces waiting for you. Queen Anne-Marie, cold and imperious sits on her Throne while at her side sits the young foreigner Prince Al-Balu who as always looks completely baffled by what is going on around him. On his other side sits Ann Lovett, his fair-haired interpreter who gives you all a quick smile as you enter. On Anne-Marie's other side is a lady you don't recognize, an attractive dark-haired woman with a mocking smile that gives off the disconcerting impression that she knows something the rest of you don't. As you halt Anne-Marie speaks.\n\n\n\"I have summoned you three here because I have need of your services once more,\" she declares. \"I know recently you have been extremely loud in voicing your criticisms of my rule. I also cannot forget that at the moment the Lapau War was approaching it's climactic battle you all rebelled and refused to follow my orders... However in my great and gracious mercy I will forgive you three as I have a task for you to perform. As you are aware neither Commodore Cuthrew or Finch have returned from their voyage of exploration beyond the Western Passage and it has been nearly three months since they left. Obviously the disapearrences of such experienced officers is troubling to say the least... Commodore Trapa. I want you to lead an expedition to find our lost countrymen and see what has befallen them. This is a difficult challenge but it's success will only increase your already great reputation and lead to generous rewards.\"\n\n\nAnne-Marie flickers her eyes over your companions and her expressions darkens as she meets Eva's defiant stare. \"Commodores Freer and Swift will accompany you with their own vessels and will be under your command, you may consider Commodore Swift your deputy. I have arranged for fresh supplies to be cached at the Western Passage and after a suitable interval I will send my friend Captain Dancer through the Eastern Passage with fresh supplies to assist you upon your return.\"\n\n\nYou glance at Captain Dancer's whose smile widens as she meets your eyes. If you didn't know better you could be sure she is trying to tell you something... you cast your gaze across to Quarrel, who is also smiling at you in a way you don't like, and onto Al-Balu and Lovett who are politely listening to Anne-Marie speak and are not looking at you. Anne-Marie is watching you intently and you promise her you will do all you can to find the missing sailors.\n\n\n\"Oh Commodore Trapa,\" Anne-Marie says as you turn to leave and you glance back. \"I expect you to return with Commodores Cuthrew and Finch or not at all. Have a safe voyage.\"\n\n\nThere is something about the way she says those last four words that chills you.\n\n\n\"Do you get the feeling there's something that bitch isn't telling us?\" Eva whispers to you as the three of you leave the Palace and descend down to the quay to prepare your ships for your next voyage.", "action_results": [{"action": "Beginning your journey", "result": "The next morning you and your companions sail your ships out of Golden Sands with the rising sun at your backs. Anne-Marie hasn't notified the people of your voyage so there are no cheering crowds to see you off as on previous voyages which feels oddly unsettling. As always you glance back at your homeland and wonder if you'll ever see her beautiful shores again.Your first objective is the Western Passage which lies about a week's voyage to the west through waters you know well. You can either sail straight there or you can swing Northwest to visit Amethyst, the heavily forested island where your people's ships are built.", "action_results": [{"action": "Swing Northwest to visit Amethyst", "result": "After a short voyage you reach Amethyst to witness another troubling sight.Queen Anne-Marie's enormous flagship Monarch of the Sea is anchored in the harbor and as you watch you can see several new cannons are being loaded aboard to fill the deck with guns. The ship was already heavily armed but now it looks like it contains around twenty cannons, with more being loaded. Deeply unnerved by the sight and puzzled as to why Anne-Marie is so heavily arming her ship you don't land but instead guide your companions away Southwest towards the Western Passage.", "action_results": [{"action": "The Western Passage", "result": "After six days at sea the Western Passage comes into sight, visible from a long way off as looking like a tear in the endless line that is the Great Reef. You have never sailed this way before but both Naomi and Eva have and their ships lead the way, guiding your Adventurer through the narrow Passage. As at all Passages a small camp has been established to keep watch on all ships traveling in and out of the Passage. Both Naomi and Eva strongly below you should stop here for a day and pick up the supplies Anne-Marie has promised she has cached here.", "action_results": [{"action": "Stop to take on fresh supplies", "result": "Knowing it makes sense you order your fellow Captains to drop anchor in the Western Passage and row ashore to meet the men garrisoning the towers. There are two: a young man and an old man and they are happy to help you load some of their spare crates of fish onto your ships. While the old man is showing your sailors where the crates are located you ask the younger man what ships he has seen pass through the Western Passage in recent months.\n\n\n\"Not many since the Second Race to tell you the truth,\" he says scratching his head. \"I suppose the first ship we saw since then was Captain Dancer's Shadow come in from the west with just a dozen sailors on board. She stopped here, picked up supplies and then sailed on to Golden Sands.\"\n\n\nThat is news to you and you frown. \"How long after that did Cuthrew and Finch sail through?\"\n\n\n\"Oh the Sea Ghost and the Royal Escort sailed through about a month after that but it wasn't just them,\" the talkative youth tells you. \"The Shadow and the Indefatigable were with them. They were all gone out west about one month and then the Shadow and the Indefatigable sailed back through from the west without stopping. There was no sign of the Sea Ghost or Royal Escort, I suppose they must have traveled on.\"\n\n\nYou are astounded but before you can ask any more questions the older of the two guards rejoins you.\n\n\n\"Not talking about anything you shouldn't are you?\" he asks looking at his young companion in an unfriendly way. Taking the hint the young man agrees he'd better get on with his duties. That evening after the fresh supplies are loaded aboard your three ships you report the conversation to Naomi and Eva and the three of you agree it looks suspicious.\n\n\n\"Why didn't Anne-Marie tell us that Quarrel and Dancer were with Cuthrew and Finch?\" Naomi asks you. \"And why did they come back without them?\"\n\n\n\"Both of you were in the Second Race,\" you tell Naomi and Eva. \"When you sailed from east to west around Magellan did you see anything suspicious?\"\n\n\n\"I didn't but me and my cousin stuck to the Northwest as much as possible and rarely landed,\" Naomi admits. \"It wasn't just me and Eva who made that voyage either: Finch and Quarrel did as well.\"\n\n\n\"Well I stuck to the Southwest and didn't land much either...\" Eva says frowning. \"Do you reckon someone else found something in these waters?\"\n\n\nYou all glance uncertainly at each other and with a lot on your mind resume your voyage to the west.", "action_results": [{"action": "An Unexpected Encounter", "result": "After sailing through the Western Passage and entering the unknown you order the Adventurer, Explorer and Esme's Joy to hold a steady westerly heading for now. The Great Reef fades from sight behind you but a wholly unexpected object is sighted to the west: a ship! You have soon approached nearer and find the ship is a similar size but a wholly different design to your own, sitting lower in the water and with black sails instead of white. The ship's name, emblazoned across the prow is Morning Glory. As you sail by you are astounded to see men in strange clothes shouting in your own language for you to come aboard!", "action_results": [{"action": "Order your fleet to drop anchor and meet with this strange visitation", "result": "Cautiously you sail towards the strange ship and anchoring the Adventurer alongside you go aboard the Morning Glory with Eva and Naomi who have also anchored their ships nearby. The sailors aboard this strange ship have colorful clothes which are emblazoned with animals and they look at you with as much interest as you look at them. Their commander is a big, strong man with a long grey beard who looks oddly unhappy to see you. He walks forward and greets you in your own language, though with a strong and unusual accent.\n\n\n\"My name is Azai and I am Captain of this ship,\" he tells you. \"What are your names?\"\n\n\n\"I am Commodore Leo Trapa and these are my companions Commodores Eva Freer and Naomi Swift,\" you tell him. Azai looks surprised.\n\n\n\"Indeed?\" he asks thoughtfully. \"It may surprise you to learn that we know of your kingdom already Commodore Trapa though I do not think you know of ours. You are now entering the waters of the Elixi nation. Until recently we were ruled by our Queen Renewal but she... died a few months ago and her son Shingen now rules as King. I and six of my fellow Captains refuse to serve Shingen and his brothers Kenshin and Ieyasu and now we sail under pain of death, outlawed by our own countrymen. If you sail on to the west you will come to the island of Revel, the Capital of our nation. There you will meet with Shingen and his brothers but I would suggest that you be on your guard.\"\n\n\nHaving shared these sentiments Captain Azai refuses to answer any of your further questions and shows absolutely no interest in your homeland. \"We know of your Three Islands already,\" he tells you. \"My people call you the Navar, the Barrier-Folk.I think it is now time we part ways.\" Azai seems keen to be on his way so feeling completely baffled you and your companions return to your ships and weigh anchor. The Morning Glory swiftly sails away to the Southwest and pondering your odd encounter you and your expedition continue west.", "action_results": [{"action": "The Land of the Elixi", "result": "Keeping to your westward course you soon come upon a land unlike any you have seen before: it is a thriving port-island similar in size to Golden Sands but unlike it in every way with vastly different architecture and ships. People in fantastically-dressed clothes soon throng the quays and as you approach the harbor an unexpected sight makes you freeze: the Sea Ghost is riding gently at anchor in the harbor. There is no sign of Finch's ship, the Royal Escort.\n\n\nEntering the harbor cautiously you, Eva and Naomi all anchor your ships alongside the quay and leading your sailors ashore armed and ready you meet with these people. The crowd draws back as you approach but three tall and strong-looking men who are so alike they can only be brothers stride forward to meet you. Their leader is a handsome man with flowing black hair bound in ringlets and a jovial air. \"Hello, hello,\" he cries out taking your hand and pumping it in a massive fist. He speaks your own language with a strange accent.\n\n\n\"My name is Shingen and I am King of the Elixi Nation! This is our Capital Island which we call Revel. These are my brothers, Kenshin and Ieyasu.\" Kenshin is a broad man who smells strongly of alcohol as he shakes your hand with a yellow-toothed grin. Ieyasu looks the youngest and is also the slimmest, dressed simply in black. He doesn't smile at you as you shake hands but instead surveys you with narrow snake-like eyes.\n\n\n\"As you can see we have already been visited by your countrymen,\" Shingen goes on, gesturing at the Sea Ghost. \"Hence how we know your language. Your great Captains Thomas Finch and Tobias Cuthrew landed here some months ago. I am afraid I have sad news for you. Your great sailor Tobias Cuthrew was very ill when he landed and his sickness grew worse. I am sorry to say he has since died and is buried here in our town's cemetery. After his death his companion Captain Finch sailed away. That was two months ago and we have not heard news of him since.\"\n\n\nYou, Eva and Naomi exchange horrified glances. The news that the greatest sailor of your kingdom is dead shakes you all to the core.\n\n\n\"What about Cuthrew's crew?\" Eva demands. \"What became of them?\"\n\n\n\"Many of them went on with Commodore Finch,\" Shingen says cheerfully. \"Many still reside in this town and have become good friends of my people. For some reason none felt an urge to return to the kingdom ruled by your Queen Anne-Marie... now I have an interest in forming an alliance with your Queen so me and my people will give you all the assistance you require. I assume you intend to journey on to find your missing comrade Finch? If you return here tomorrow I will arrange for enough Supplies to re-provision your ships to be assembled on the quay and we will also provide you with a map of our islands to help you safely navigate them.\"\n\n\n\"We must also visit Commodore Cuthrew's grave,\" you tell King Shingen who nods sympathetically.\n\n\n\"Tomorrow, tomorrow,\" he tells you. \"Return tomorrow morning.\"\n\n\nYou, Eva and Naomi return aboard the Adventurer where you hastily confer. Eva is suspicious.\n\n\n\"I saw Cuthrew before he left on his voyage,\" she tells you both. \"He was ill but he wasn't that ill. I don't trust any of those three.\"\n\n\n\"If we sail away they'll be after us in the Sea Ghost and those other little ships in the harbor,\" Naomi points out. \"I think for the time being it's better that we work with these people. Tomorrow we can go ashore and see if Cuthrew really is buried on the island.\"\n\n\n\"I agree,\" you tell her. \"Tomorrow we'll go ashore as planned.\n\n\nThis turns out to be the worst decision of your life.", "action_results": [{"action": "A Fateful Day", "result": "The next morning you, Naomi and Eva lead your sailors ashore onto the quay of Revel. As before there is an expectant crowd waiting for you but the crowd is oddly silent today and looks tense. Glancing round them you notice something strange: there is a ship approaching the island rapidly from the South. Squinting at it you recognize it with a start: it is Thomas Finch's Royal Escort! Eva and Naomi recognize it too and freeze halfway down the quay, your sailors all stop behind you as well. Eva grips your arm, sending a thrill of excitement through you.\n\n\n\"I don't like this,\" she says quietly and for the first time in all the time you have known her she sounds scared.\n\n\nThe crowd parts in Shingen, Kenshin and Ieyasu come striding towards you. Unlike yesterday they are armed: Shingen and Kenshin are carrying drawn swords in their hands while Ieyasu is holding an extremely short-barreled musket which is more like a pistol. As they advance within a few feet of you the crowd behind them edges forward and more weapons appear. With a feeling of horror you realize that you have led your whole expedition into a trap.\n\n\n\"Eva! Naomi! Get back!\" you shout.\n\n\nShingen lunges towards you with his sword but you spring back just in time, drawing your own sword as you do. At the same moment Kenshin gives a mighty sweep of his sword that cuts through both of Naomi Swift's eyes, with a scream she clutches her bleeding face. Ieyasu steps forward, cocks his pistol with a click, raises it and shoots Eva point blank in the chest. She is thrown backwards, landing on her back on the jetty where she lies staring open-eyed at the sky, her face still wearing a last expression of surprise.\n\n\nWith a roar of rage you slash your sword wildly at Shingen, forcing him back. Steel grates as swords clang against each other and muskets bang on both sides. A musket ball whistles past your head and as Shingen retreats you grab the blinded Naomi wand holding her body close to yours with your free arm you drag her back to safety. Your ninety sailors are trapped at the end of the quay facing a crowd several times their own number and death seems inevitable.\n\n\nYour countrymen sell their lives dearly. While you drag Naomi back across the gangplank leading to the Adventurer, musket balls flying so thickly all about you that it seems a miracle you are not hit, your sailors fight the crowd on the quay. They are cut down and butchered mercilessly, a few dozen manage to flee across the gangplank to the Adventurer but most are cut down. You manage to get the Adventurer's anchor raised, the sails raised and manage to steer away from the quay, forced to abandon both the Explorer and Esme's Joy, not to mention the bodies of your countrymen including Eva.\n\n\nEven as the Adventurer moves out into the harbor with the surviving sailors from all three ships on board, about thirty altogether while twice that amount lie dead on Revel's jetties, the Sea Ghost explodes into life, firing a row of six cannons. One of the shot decapitates two of your sailors and another hits a third sailor plumb in the chest, blasting him into several pieces. Gathering speed the Sea Ghost moves forward to cut off your escape.\n\n\nHelp is finally at hand however. The approaching Royal Escort fires two cannons and a volley of musket shots, forcing the Sea Ghost to veer away. This gives you a chance to slip the Adventurer out of the harbor and you sail straight towards the Royal Escort, unaware of who is in command but only knowing that they are on your side. As the Royal Escort turns back towards the South you follow her, putting as much space between you and the murderous tyrants of Revel as possible.", "action_results": [{"action": "Shock", "result": "Eva Freer is dead. It seems impossible but it is true.\n\n\nNaomi Swift has been blinded and will never see again. You carry her into your cabin where your ship's surgeon attends to her injuries night and day. So many have died: altogether you have lost more than sixty sailors and two of your expedition's ships: only the Adventurer and her small Crew remains. For three days you follow the Royal Escort, unaware of where you are going and not particularly caring until you come to a small rocky island. Seven ships, similar in size to the Adventurer but of a different design are anchored offshore. Sailing in among them you meet your new allies.\n\n\nSeven Elixi Captains come aboard the Adventurer. Their leader is Azai, a grey-bearded old man with a permanently worried look who you may have met before. His six companions are Amako, a tall and cold-natured man who stands in sharp contrast to his brother Ryuzoji, a young cheerful man dressed in clothes of bright red. Miura is a big man with a long flowing black beard while his brother Rokkaku is a bit of a dandy, elegantly dressed in fine clothes. Sanada is a tall and handsome man while his companion Sogo has dark skin and unlike the others drinks tea in your cabin while the others accept wine from you. You find all their names a little difficult to remember and in your depressed state can't raise the interest to care much about any of them. Your thoughts are dwelling on Eva and you are only half-listening as Azai talks.\n\n\n\"You are not the first to come to our land, the first visitors were two of your Captains called Finch and Quarrel who came to Revel from the west some six months ago,\" Azau tells you. \"Later a woman called Sapphira Dancer also visited from the west. This was when Renewel was still Queen and kept her evil sons Shingen, Kenshin and Ieyasu in check. A few months after Dancer came four more ships, this time from the east. Dancer, Quarrel, Finch and Tobias Cuthrew were their four Captains.\"\n\n\n\"They stayed at Revel for several weeks. By day your countrymen spoke to Queen Renewel but by night they plotted with Shingen and his brothers in the darkness. One night there was a bloody coup: Shingen cut his mother's throat while she slept and his supporters took control of the Palace. During the coup Cuthrew and Finch tried to intervene on the Queen's side. Cuthrew was shot and killed in the fighting while Finch was stabbed through the chest. He and a few of his sailors managed to get back to their ship and escape.\"\n\n\n\"Me and my six fellow Captains are loyal supporters of Queen Renewel. When Shingen took power and named himself King we fled here with our ships and Commodore Finch. We did our best to help him but Finch's wound was mortal. Knowing he was dying he told us the names of you and your companions as people who could be trusted. After he died we buried him at sea. Since then we have been patrolling the waters between the Western Passage and Revel in hope of meeting you. I saw your ship a week ago and rushed here to alert the other Captains. We sent Finch's remaining Crew aboard the Royal Escort to Revel to meet you. We guessed you would not trust us but you would not doubt the word of your own countrymen... we never expected Shingen would try to murder you all before we could get there. According to Finch, Quarrel and Dancer told him Shingen and Anne-Marie have formed an alliance and together they would kill all who criticized or spoke out against their tyrranical rule...\"\n\n\n\"We are grateful for your help,\" you say wearily and lying in her sickbed in your cabin Naomi nods sightlessly. \"But what can we do now? Eva is dead. Naomi cannot see. We have lost the Explorer and Esme's Joy and most of our Crews. You have seven ships and a few hundred sailors here but there are thousands of armed men in Revel and many more in Golden Sands under Anne-Marie's control... what can we do?\" you stare at the table while the Elixi Captains glance among themselves.\n\n\n\"We have an idea,\" Azai says finally.", "action_results": [{"action": "A slim chance", "result": "\"There appear to be three great nations on this world your people call Magellan,\" Azai tells you. \"There are my people, the Elixi, there are your people who we call the Navar, the Barrier Folk and there are also the Lapau, the spear-armed canoe-warriors who we have learned your people fought a War against. We know that Anne-Marie and Shingen have formed an alliance. Finch told us that Quarrel had claimed to him that the purpose of this alliance was to attack the Lapau on two fronts and crush them as your people failed to do alone. The slaughtered Lapau's lands would be divided between Anne-Marie and Shingen. Me and my companions believe the Lapau are our only possible allies.\"\n\n\n\"King Al-Capu agreed to a peace treaty with Queen Anne-Marie,\" you tell Azai. \"His son is a hostage in Queen Anne-Marie's court. Even if we sail to Matan and even if he believes us, which is unlikely, what can the Lapau do against the combined navies of my people and yours? The Navar as you call us nearly destroyed the Lapau in our War with them, they certainly don't have a chance against both the Navar and Elixi.\" \n\n\n\"We must try,\" Azai insists. \"With your people the Navar and my people the Elixi deceived into this evil alliance by their rulers the Lapau are our only chance for help.\"\n\n\n\"Matan is on the other side of the world,\" you remind Azai. \"To get there we either have to sail through territory ruled by Queen Anne-Marie or territory ruled by your Shingen or through completely uncharted waters. Shingen now has the Sea Ghost, Explorer and Esme's Joy. I am pretty sure that he and his brothers will come after us with everything they've got. You've got a strong little navy here but I don't think it will be a match for the full might of Anne-Marie and Shingen.\n\n\n\"We have thought of that,\" Azai tells you. \"We will all sail to Matan in four different directions. I will go Northeast, skirting the Great Reef and traveling through your kingdom's colonies to reach Matan. Amako and Ryuzoji will sail Southeast, skirting the Great Reef and also pass through your kingdom's colonies to Matan. Miura and Rokkaku will sail Southwest through uncharted waters to Matan and finally Sanada and Sogo will sail Northwest through the islands of the Elixi to Matan. You must choose which of us you think has the best chance of getting through.\"\n\n\nYour mind is still full of memories of Eva's expression of surprise when she was killed. With a deep sigh you cross to where Naomi is lying in her sickbed with a bloodied bandage over her eyes and take her hand in yours. You lower your head and shut your eyes tight and after a few moments of silence you hear the seven Elixi Captains quietly stand up and go outside to prepare their ships for their voyages and await your decision.", "action_results": [{"action": "Reluctant Decisions", "result": "That night while you sit with your agony-ridden companion wondering how your world could possibly  have got turned so upside down so quickly the Elixi Captains begin to put their plans into action. The Royal Escort is abandoned and sunk and it's remaining Crew distributed among the other ships: Azai in the Morning Glory, Amako in the Relentless, Ryuzoji in the Lady Luck, Miura in the Royal Avenger, Rokkaku in the Warrior, Sanada in the Charmer, Sogo in the Fortune and of course you and Naomi in the Adventurer. To help you keep track of your new friends Azai thoughtfully provides you with a List of Loyal Elixi Captains.\n\n\nWhen Naomi finally slips into a troubled sleep you go up onto deck for a breath of fresh air and to think about things. The sun is just rising pink in the east and reveals three ships approaching from the north: the Sea Ghost, Esme's Joy and Explorer. With your telescope you can see all three ship's decks are absolutely packed with cannons and sailors. You hear a quiet cough behind you and turn to see Azai standing nearby.\n\n\n\"It is Shingen, Kenshin and Ieyasu,\" he says pointing at the three distant ships. \"They mean to destroy us once and for all I think. We're not strong enough to defeat all three wwith the two hundred sailors we have here so we must leave at once to seek help from the Lapau. I have had your ship resupplied and re-manned but now you must choose which of the four routes to Matan you take. You have sailed much further around Magellan than I have and must use your own knowledge and maps to choose your route. We must move quickly though: once Shingen and Anne-Marie know what they are doing they and their Captains will try to get to Matan ahead of us to warn King Al-Capu not to listen to us! We must be swift.\"\n\n\nPromising to tell Azai your decision within an hour you go down to your cabin to find Naomi has woken up.\n\n\n\"We are going to sail to Matan then?\" she asks you weakly and you tell her that it looks like you'll have to. Naomi hesitates and then slowly tears trickle down from the bloodied bandage around her eyes. \"I want to thank you for what you did for me back there... I know you loved Eva and now she is gone all you have left is me and what help am I now? Nothing but a burden.\"\n\n\n\"You will never be that,\" you assure Naomi. \"If we are to survive this voyage I will need all your help and advice.\"\n\n\nHolding Naomi in a painful hug you mull over which route to take.\n\n\n(Please Pick up and use the List of Loyal Elixi Captains to help you make this important decision).", "action_results": [null, {"action": "Sail Northeast with Azai", "result": "As the morning sun rises the eight ships of you and your allies part ways, speeding off in four different directions. Heading Northeast, the Adventurer keeping alongside the Morning Glory you are relieved to see see the Sea Ghost, Esme's Joy and Explorer up and pursue your companions and none follows after you. You sail to the Northeast towards the place where you first encountered Azai's ship ten days ago (though it seems much longer ago).\n\n\nThe Great Reef is visible along the eastern horizon so both you and Azai adjust course to the north to sail around it. As you do you spot two ships approaching rapidly from the east, the direction of the Western Passage. With a telescope you recognize them as Quarrel's ship Indefatigable and Dancer's ship Shadow. When you tell Naomi what is happening she strongly advises you to avoid them. Azai is of the same opinion.", "action_results": [{"action": "Approach them anyway to see if their commanders are friendly", "result": "Hoping that your countrymen are still friendly you turn the Adventurer towards the two approaching ships. You are swiftly disillusioned: as you approach Quarrel turns the Indefatigable so it's cannons are aiming at you and all six burst into life. One of the cannonballs hits the side of the Adventurer, shredding three of your Crew with splinters, thought fortunately the rest of the shots fall short. You don't stay for another volley, pausing only to fire your ship's two starboard cannons at your adversary you turn back north and pull out of range, knowing for certain now that your former countrymen and your Queen are now your enemies.", "action_results": [{"action": "Sailing North", "result": "You sail North hoping to put your two enemies behind you. Though Captain Dancer's Shadow does indeed sail on west towards Revel Quarrel's Indefatigable turns north and pursues the Adventurer and the Morning Glory. For three days this pursuit continues, the Great Reef visible to the east until one evening you have Captain Azai come aboard the Adventurer to discuss the situation. Naomi, sitting upright in her sickbed while a clean bandage is applied to her shattered eyes is keen to fight.\n\n\n\"It is strange that two ships should flee from one,\" she points out. \"I think we should stop and do battle with that lackey Quarrel.\"\n\n\n\"I don't think so,\" Azai says unhappily. \"The Indefatigable is heavily armed and manned and would probably do us more damage than we could do to it. Our main aim is to reach Matan and seek help from the Lapau, we'll be putting our mission in jeopardy if we stop and fight. No... if you choose to turn and fight you cannot expect the Morning Glory to help you.\"\n\n\nIt looks like if you do choose to fight the Adventurer will be doing it alone.", "action_results": [{"action": "Turn and fight", "result": "Determined to fight alone you order the Adventurer to turn about while Azai sails on. Unfortunately for you Quarrel's cannons are larger and have longer range than yours and he opens fire with his bow guns far beyond the range at which you can reply. When you sail south to try to close the range Quarrel cunningly sails south as well, keeping beyond the range of your cannons while pounding you with his. After three of your sailors are killed you angrily abandon the one-sided artillery duel and resume your flight northwards after Azai.", "action_results": [{"action": "Open Sea", "result": "Continuing North you reach a point where the Great Reef bends away to the east where it eventually meets the Northern Passage. Quarrel is still following closely but as storm clouds gather overhead Azai comes aboard your ship with a plan of how you might be able to lose him.\n\n\n\"When this storm hits visibility will be reduced to very little,\" he tells you. \"Under cover of the storm we can alter course to the Northeast, passing close by the Great Reef and when the storm clears we should be out of sight of our adversary.\"\n\n\n\"You want to sail alongside the Great Reef during a storm?\" Naomi asks from her sickbed. \"Are you crazy? That storm is coming in from the west, you'll be dashed against the Reef and sunk!\"\n\n\n\"I think we can get north of the Reef before that storm hits and blows us East,\" Azai argues back. \"Besides, it's our best chance of losing Quarrel.\"\n\n\nYou consider the two options: turning Northeast to try and lose Quarrel in the storm or continuing North and adjusting your course once you are completely clear of the Great Reef.", "action_results": [{"action": "Turn Northeast", "result": "Following Azai you turn the Adventurer Northeast to follow the Morning Glory as it passes perilously close to the Great Reef. You are more wary than him of the dangers of the Reef so you keep further to seaward when the storm hits. Unquestionably the storm is the worst you have ever sailed through and for three days it throws the Adventurer around helplessly but the Morning Glory fares worse: at the height of the storm you witness the Mourning Glory strike a hidden reef and tip completely over onto it's side, it's sailors spilling into the whirling sea. There is nothing you can do for them, indeed you are lucky not to share the same fate though three of your Sailors are washed overboard.\n\n\nFinally the storm abates and the Adventurer finds itself alone just North of the Great Reef. You are not completely alone, just visible far behind you is Quarrel's Indefatigable which has also survived the storm. Your brave companion has met a watery grave leaving you to carry on your voyage to Matan alone. When you report Azai's death to Naomi she merely sighs and bows her head, she is not surprised by the news, only saddened. Turning your ship away from that ill-fated reef you steer on to the Northeast.", "action_results": [{"action": "Open Sea", "result": "It is with some relief that you see the Great Reef vanish from sight as you sail into waters you are familiar with, having passed through them in the Great Race. There are Navar Colonies scattered here and there in this area but you don't know yet if they will be friendly or hostile. With a grin you see the storm-battered Indefatigable finally give up it's pursuit of you and turn away to the Southeast in the direction of the Corral Cabin and the Northern Passage. When you tell Naomi what is happening she gives the first smile you have seen her give since her injury.\n\n\n\"Quarrel must be giving up and returning to Golden Sands to report to Queen Anne-Marie what has happened,\" she tells you. \"If ever there is a good chance to attack him it is now when his ship is battered and his Crew demoralized.", "action_results": [{"action": "Attack the battered Indefatigable", "result": "Feeling confident you turn the Adventurer South to attack the man who has been hunting you. Though damaged the Indefatigable is still more than a match for you though: using long-range cannons Quarrel bombards you from beyond the range of your own smaller cannons and continues sailing south to prevent you closing to within range of your own weapons. You lose three Sailors before angrily breaking off the pursuit and continuing Northeast.", "action_results": [{"action": "A Shipwreck", "result": "Continuing Northeast you come upon a somber sight. A jagged series of rocks rise up from the ocean: pinned between these rocks is the wreckage of a ship called the Dove of the Sea. Like every sailor among your people you know her story: Captained by an inexperienced artist called Rosemary Cleaver the ship was one of your competitors in the Great Race. One stormy night she was wrecked on the rocks resulting in the death of Cleaver and most of her Crew. As Colonies have been established in these waters the wreck has been repeatedly discovered and it is marked on your sea charts: according to these charts Matan lies less than a week's voyage to the east. Still as you sail past the wreckage of the ship something inside you wants you to spend a day going closer and investigating the wreck.", "action_results": [{"action": "Land and investigate the Dove of the Sea", "result": "Carefully steering the Adventurer alongside you go aboard the shattered wreckage of the Dove of the Sea. The broken deck is deserted, all it's Crew having been long since claimed by the sea with one exception: lashed to the helm is a skeleton with it's ribcage and legs broken and splintered. It is Captain Cleaver herself, secured forever at the helm of her ship by the last of her crew. You regard the yellowing bones and grinning skull with morbid thoughts about how one day that may well be you and feeling cold inside you leave this ship of the dead and quickly turn the Adventurer away to the east and your destiny.", "action_results": [{"action": "Sailing East", "result": "The Adventurer skims rapidly over the waves, traveling East towards your final destination. Your Supplies are low but not as low as they have been on previous voyages and you know that soon you will safely be in Matan. At this point in the voyage Naomi is feeling strong enough to leave her sickbed and you guide her up to the quarterdeck where the sea breeze and the sound of the waves seem to do her some good. Holding tightly to your arm she rests one hand on the rail and sighs.\n\n\n\"What do we do if King Al-Capu doesn't listen to us?\" she asks you. \"What do we do if Queen Anne-Marie has already got to him first?\"\n\n\nThe same thoughts had occured to you too and you have no answer.", "action_results": [{"action": "Matan", "result": "Matan finally comes into sight and you, Naomi and all your remaining Crew breathe a sigh of relief. Matan is a tropical island covered in huts: the Capital of the Lapau Nation and home of King Al-Capu. As dozens of Lapau Warriors take to their canoes and paddle out to meet the Adventurer you wonder whether or not you are in time. Have you got to Matan ahead of Anne-Marie, Shingen and their various Captains and ships?\n\n\nNow it is time for you to find out.", "action_results": [{"action": "Click here to find out if you have been fast enough", "result": "You have succeeded in your quest and reached Matan ahead of all your enemies. As the Adventurer sails towards the Lapau Capital hundreds of canoes come out to meet you, each containing spear-armed Lapau warriors. King Al-Capu, a giant grizzled-haired man with his tattooed body covered in old scars comes aboard your ship. Recognizing you from a previous meeting at the end of the Lapau War he shakes your hand. Naomi has joined you on deck to meet Al-Capu who looks surprised to see her sightlessly leaning on you, a bandage around her eyes.\n\n\nAs fast as you can you explain to the King everything that has happened: from the discovery of the Elixi to the murders of Cuthrew and Finch to your own ambush by Shingen at Anne-Marie's behest up to your belief that the alliance between Anne-Marie and Shingen is intended to destroy the Lapau. Al-Capu listens in silence with increasing alarm and when you have finished there is silence for a few moments before Al-Capu speaks in your language but with a heavy accent.\n\n\n\"You have come through difficult trials and dangers Leo Trapa and Naomi Swift,\" he intones. \"If what you say is true then more danger lies ahead. We must speak with Queen Anne-Marie and King Shingen about this. Meanwhile you will rest here at Matan: you are our guests and under the protection of the Lapau nation now.\"\n\n\nFinally you feel like you are safe but this illusion does not last long...", "action_results": [{"action": "Familiar Faces", "result": "Within days of your arrival at Matan your many enemies all bear down on the small island. Ieyasu is the first to arrive aboard the Explorer, coming in from the North he does not land but instead steers around Matan to the south side where he drops anchor. The next day a vast Fleet of your enemies arrive: Anne-Marie's Monarch of the Sea, Lovett's Grand Alliance, Al-Balu's Matan Afloat, Dancer's Shadow, Quarrel's Indefatigable, Kenshin's Esme's Joy, Shingen's Sea Ghost and the Warrior, Royal Avenger and Charmer all sail up in one group from the south. Altogether this eleven-ship fleet is even larger than the War Fleet you sailed with during the Lapau War and it clearly means business. Anne-Marie promptly sends Al-Balu into Matan to invite you and King Al-Capu to a meeting aboard the Matan Afloat that evening.\n\n\nHistory will remember it as The Conference of the Captains.\n\n\nFourteen of you attend the Conference. Escorting the blinded Naomi and the frowning King Al-Capu and protected by numerous royal bodyguards you are rowed out to the Matan Afloat. Waiting for you are Anne-Marie, looking as regal and haughty as ever, the young Prince Al-Balu and his advisor Ann Lovett, Anne-Marie's lackeys Richard Quarrel and Saphia Dancer (the latter grinning broadly at the sight of you), Shingen, Ieyasu and Kenshin standing together and with their hands tied behind them by rope are Amako, Ryuzoji and Rokkaku, the last of the loyal Elixi Captains and prisoners of your enemies. You soon learn the other four are dead: Azai was lost in a storm and Miura, Sanada and Sogo were all killed by either Shingen, Kenshin or Ieyasu. King Al-Capu begins the conference.\n\n\n\"I am puzzled by the words of your Captains Queen,\" he tells Anne-Marie. \"They tell me an amazing story about the Navar and the Elixi conspiring together to murder those Captains who oppose your rule. Surely this cannot be true?\"\n\n\n\"It seems that a mistake has occurred,\" Anne-Marie says calmly surveying you and Naomi. \"It seems that there has been a plot by one close to me to murder those Captains who oppose my rule and this Captain has been asking King Shingen and his brothers to help him kill these Captains claiming it was my wish. This plot has now been uncovered and the man behind it will be punished.\"\n\n\nDrawing a pistol from within her pocket, Anne-Marie turns sideways, points the barrel directly at the side of her husband Richard Quarrel's head and calmly pulls the trigger. Brain matter and skull shards spray over Saphia Dancer, who has finally lost her calm composure and looks deeply shaken. Still wearing a look of astonishment Quarrel topples to the deck and lies there in a pool of blood until at Anne-Marie's order two sailors pick up his body and throw it into the sea. All the Captains at the meeting, including you, look absolutely stunned by this sudden cold-blooded murder except Anne-Marie who continues speaking calmly.\n\n\n\"It seems that after the unfortunate and accidental deaths of Tobias Cuthrew and Thomas Finch during the succession of King Shingen my late husband conceived an idea to kill Leo Trapa, Eva Freer and Naomi Swift and sent orders in my name to King Shingen to have them murdered. Fortunately this plot was only partially successful but it has cost me the valued services of two of my best Captains... I have spoken with King Shingen and he and his brothers are all extremely sorry for their role in this tragic affair.\"\n\n\n\"That is true,\" Shingen says cheerfully and looks at you. \"Commodore Trapa, Commodore Swift, I am extremely sorry for the unfortunate injuries that have befallen you and for the death of your companion Eva Freer. As a way of showing how repentant the whole Elixi nation is I have signed an Alliance with Queen Anne-Marie and opened all our ports and harbors to Navar ships and traders. We had something of a premonition of the Queen's husband's unfortunate death and last night I pledged that if anything were to happen to Quarrel I would like to offer my hand to her in marriage as a way of forming a true and lasting alliance between our two great countries. I am happy to say she has accepted.\"\n\n\nEvents are moving incredibly fast and you are finding it difficult to follow everything that is happening.\n\n\n\"What about the murders of the Elixi Captains by Shingen and his brothers?\" you demand indicating the bound prisoners. \"What about me and my men being hunted all across the sea?\"\n\n\n\"That was another unfortunate misunderstanding,\" Shingen says smoothly. \"I wrongly believed Queen Anne-Marie wanted you dead which is why my brothers and I have been hunting you. These Elixi Captains are a different story... these men are pirates who stole ships from my navy and pillaged my towns and ships. There can only be one punishment for piracy.\"\n\n\nAmako, Ryuzoji and Rokkaku are led to the side of the ship by three sailors who raise their muskets and shoot each of them in the back of the head. One by one the bodies are dropped into the sea and you turn away feeling sick by the sight of your allies being ruthlessly killed. The murders have cast something of a pall over the Conference but Anne-Marie claps her hands together and suddenly becomes extremely business-like.\n\n\n\"Well now that is all cleared up and the guilty parties punished,\" Anne-Marie says happily. \"Leo, Naomi, in recognition of your terrible trials I am immediately promoting both of you to the ranks of Vice Admiral in my Navy, I am also similarly conferring promotions on all those present here. We will all return to Golden Sands together as in the future I will have need of your considerable skills. King Al-Capu, I am sorry for the inconvenience you have been put to and I am happy to return your son and advisor to you. If you would be so kind we would like to buy some supplies from you before beginning our journey back to our homelands. King Shingen and I have a wedding to organize in Golden Sands and we would like both you Leo and you Naomi to attend.\"\n\n\n\"No,\" Naomi says flatly. There is a moment's silence.\n\n\n\"No,\" Anne-Marie asks in a dangerous tone, glaring at her blinded subordinate.\n\n\n\"No,\" Naomi repeats. \"Everyone here present knows it was you and not Quarrel who ordered the deaths of Cuthrew, Finch and Freer and tried to have me and Leo killed. You killed Quarrel to silence him. You King Shingen, together with your brothers, killed your mother Renewel and those seven Captains who were loyal to her memory. All of you have blood on your hands. Once you have us in your power you will kill us as well. With your alliance you will destroy the Lapau and divide the world of Magellan between yourselves. When there is no one else left to fight you will fight each other, do you really expect to last longer than the Queen's last three husbands King Shingen? No ones lives are safe as long as this woman remains Queen.\"\n\n\nAnne-Marie looks white and livid with rage. As she stands there before you in her expensive clothes with narrow snakelike eyes glaring out from a pale face you feel nothing but revulsion towards her. Finally King Al-Capu speaks.\n\n\n\"I have heard all the words that I need to,\" he declares. \"Chief Anne-Marie, Chief Shingen, you will take your ships and your people from my lands at once and I do not want you to return. The warriors Leo Trapa and Naomi Swift shall stay here, I do not think they will live one day more under your rule.\"\n\n\nAnne-Marie's features compose themselves into a cold and terrible smile.\n\n\n\"Good then,\" she says. \"If there will be War I would rather it was now than later. Last time I was here I allowed myself to be tricked into peace by my Captains. This time we will decide the fate of the Lapau people with one great battle. In one hour we will be in a War that can only end with the complete subjugation of the Lapau people. Trapa, Swift, the next time we meet you will die.\"\n\n\nAnne-Marie, Saphia Dancer, Shingen, Ieyasu and Kenshin all leave the ship with their sailors in longboats and return to their own vessels to get ready to attack. You, Naomi, Al-Capu, Al-Balu and Ann Lovett are left to prepare your own vessels for the coming fight.", "action_results": [{"action": "The Battle of Matan", "result": "The ensuing Battle rages for six hours and ends in the complete destruction of the Lapau Capital.\n\n\nYou have been in over a dozen fights from small single-ship skirmishes to large Fleet-sized engagements but you have never seen anything like this: the Monarch of the Sea, Shadow, Sea Ghost, Explorer, Esme's Joy, Warrior, Royal Avenger and Charmer all sail towards Matan in a long line while the Adventurer, Matan Afloat, Grand Alliance and nearly one thousand canoes wait to meet them. The slaughter is terrible.\n\n\nYou will never forget the sights of the Battle: of the clouds of cannon smoke rising up from the gigantic Monarch of the Sea, the endless crackle of musket fire as your sailors line the rails of the Adventurer to fire at your enemies and of the sight and sound of hundreds of men shooting, spearing, screaming and dying in the blood-soaked waters. One sight in particular will always stay with you: Naomi standing proud and tall near the mast of the Adventurer shouting orders and encouragement to the gunners while cannonballs and musket balls whistle all about her. You never loved and respected her more than you do this day.\n\n\nThere are some successes. The Warrior, Royal Avenger and Charmer are all overrun by Lapau Warriors and sunk. The high point of the Battle for your side comes when you and the Grand Alliance fire simultaneous volleys into the leaderless Indefatigable which promptly explodes into thousands of shards of wood and metal, raining debris down on the entire battlefield. Unfortunately things only get worse after that.\n\n\nArmed with muskets, numerous cannons and hundreds of sailors the ships of Anne-Marie's Fleet easily outmatch the Lapau fighting in the water. By the end of the day the sea is a rising and falling carpet of corpses as the best part of Lapau's warriors lie dead upon those waves. That night Matan is evacuated and Anne-Marie's sailors occupy it, killing any who remain behind whether they be man, woman or child, young or old. The Capital of the great Lapau Nation is burnt to the ground, every last hut and tree consumed by ravenous fire until all that is left is a great mound of ash.\n\n\nMatan is no more.\n\n\nAs the flames lick higher and consume the island you guide the battered but undaunted Adventurer away followed by the Grand Alliance and Matan Afloat. Only a few hundred Lapau warriors have survived the carnage, you can hear Al-Capu screaming in pain and sadness aboard the Matan Afloat. Leaving your victorious enemies behind you steer into the night, no particular destination in mind and no hope in this darkest of nights.\n\n\nYou go down to your cabin and there you find Naomi is already waiting for you, sitting on the edge of her bed with her head in her hands. You sit next to her, take her hand in yours and for a moment the two of you just sit there in silence, each lost in your own thoughts. Finally Naomi speaks.\n\n\n\"This is the beginning of a new kind of war,\" she tells you. \"There must be people, Elixi and Navar, who will not stand for the blood lust of their tyrants. They must know if the Lapau are destroyed then there will be no end to Anne-Marie and Shingen's dark reigns. We must have the support of the people if we have any chance of overthrowing Anne-Marie and Shingen.\"\n\n\n\"We need to kill Anne-Marie,\" you tell Naomi grimly, memories of Eva's dead face and the day's massacre fresh in your mind. \"We need to kill Anne-Marie and Shingen both. For Eva.\"\n\n\nNaomi turns to face you and rubs at her shattered eyes beneath the bandage.\n\n\n\"I know I can never be Eva Freer but I hope that in time our friendship will strengthen and you will come to care for me the way I care for you Leo. You are my everything now I cannot see. I need you more than ever.\"\n\n\n\"I need you to,\" you tell Naomi sincerely. \"Dark days lie ahead of us and I need a friend like you to help me.\"\n\n\nThe candlelight is dancing and flickering on the walls of your cabin as you slowly lean forward and kiss Naomi's lips, feel the pressure of her breasts against your chest and run your finger through her hair and down her back. Outside in the darkness hundreds of silent corpses continue to rise and fall on the ocean's swell but in your cabin as the candle burns down you and Naomi explore each other's naked bodies and moving together rhythmically you consummate your love in the darkness of the night...\n\n\nTo be continued in Magellan 4: Search for Original Ideas.", "action_results": [{"action": "If you are interested in seeing how I get some of my writing ideas click here", "result": "The idea for the Magellan series came from a game I played on Orbiter called Expedition Africa where you roll dice to travel along a map and have to make strategic choices so as not to run out of such things as Food and Men along the way. I used this idea in my first story The Lost Expedition but I found land-based adventures a bit boring and also an over-saturated genre (like Lord of the Rings...). Sea adventures are much more rare and I've enjoyed writing them more than the Land ones.\n\n\nPart of my research for Sea stories involved reading about some of the epic voyages of naval history and out of all of them Ferdinand Magellan's first Circumnavigation of the World seems the most remarkable (the Mutiny on the Bounty is another fascinating story I hope to turn into a story-game sometime but there is already one of those on this site) hence why my fictional world is called Magellan. I wondered what it would have been like if Magellan was racing against other Captains and that is where the idea for Magellan 1 Race into the Great Unknown comes from.\n\n\nFor Magellan 2 I wanted to move into darker territory and used the American and European conquests and slaughter of native populations as a starting point. The Lapau War is based roughly on the Pacific Theatre of World War 2 (did anybody notice how the big surprise Lapau attack on the War Fleet while it rests at anchor is a lot like Pearl Harbor?) and reveals Anne-Marie's almost Hitler-like mentality of might makes right and how she feels it is almost her duty to take from weaker nations to make her own country stronger.\n\n\nIf the Navar are American/European and the Lapau are Natives then the Elixi can be likened to Chinese or Asians. Shingen, Ieyasu and Kenshin all get their names from famous 16th century Japanese War Lords while Azai, Rokkaku, Miura, Ryuzoji, Sogo, Sanada and Amako are all Japanese Clans. I've specifically avoided mention of skin color altogether and hopefully used the characters' names to make them representative of their cultures.\n\n\nThough they are named after Japanese Clans the adventures and fates of Azai et al are loosely based on famous pirates from the Golden Age of Piracy: Azai is based on Benjamin Hornigold, Amako on Charles Vane, Ryuzoji on Calico Jack Rackham, Miura on Blackbeard, Rokkaku on Stede Bonnet, Sanada on Howell Davis and Sogo on Black Bart Roberts. Like their fictional counterparts these pirates had colorful careers and all met rather unpleasant ends but reading about them one gets the impression they accepted early deaths as something that came with the job of being a pirate. Bart Roberts, the most successful of the bunch, even had the phrase \"a short but merry life\" as his motto.\n\n\nSo what awaits Leo and Naomi in Magellan 4: Search for Original Ideas and the conclusion of the series, Magellan 5? I don't want to give away plot ideas except to mention I have been reading a lot about Sir Francis Drake recently and also thinking about how the idea of Turtle Ships / Ironclads could give the unfortunate allies a much-needed advantage in their battle against Anne-Marie and her blood-thirsty henchmen...\n\n\nAnyway, as always thanks for taking the time to read my story and especially for taking the time to read this. The only thing better than writing is feeling that you have hopefully given someone something that is interesting to read!\n\n\nBy the way did anyone notice that the titles of the stories in the Magellan series are not just titles but also advice for life? :)", "action_results": []}]}]}]}]}]}]}, null]}]}, null]}]}, {"action": "Continue North", "result": "Despite Azai's protests you keep a safe distance between the Adventurer and the Great Reef by continuing North while the Morning Glory turns Northeast. It quickly becomes apparent that you have made the right choice because when the storm hits it is by far the worst you have ever sailed through. For three days the Adventurer is battered and driven far to the east along the northern edge of the Great Reef. At the height of the storm you pass a shattered wreck: the Morning Glory lies on her side on a reef, being smashed to pieces by the sea. There is nothing you can do for her sailors and every single one of them drowns.\n\n\nBy the time the storm blows itself out you the Adventurer finds itself alone just north of the Great Reef. Quarrel's Indefatigable is just visible in the distance: like you your adversary has survived the storm. Naomi is saddened but unsurprised to learn of Azai's death and with a heavy heart you know you must press on alone to Matan to seek the help of King Al-Capu. Turning the Adventurer Northeast you continue your voyage.", "action_results": [null]}]}]}, null]}]}, null]}, {"action": "Sail Southeast with Amako and Ryuzoji", "result": "As the morning sun rises the eight ships split off in four different directions, you steer the Adventurer between the Relentless and Lady Luck heading Southeast. The heavily-armed Explorer turns to pursue you and with a telescope you can make out the figure of Prince Ieyasu standing in the prow. You report this news to the cold-natured Amako and the flamboyant Ryuzoji. Amako scowls at the news.\n\n\n\"Ieyasu is the smartest of his brothers,\" Amako says grimly. \"We can't let him catch up with us.\"\n\n\n\"We'll outfox him yet,\" Ryuzoji says confidently.\n\n\nAfter a few days sailing southeast you spot a small tropical island with a small village by the coast with a few fishing boats bobbing in the waves.\n\n\n\"That is the island-port of Nassa,\" Amako tells you when he and Ryuzoji come aboard the Adventurer. \"It is a minor port and the last Elixi outpost in these waters.\"\n\n\n\"These people are country fools who are loyal to Shingen,\" Ryuzoji tells you. \"I think we should land and seize as much food as we can for the long voyage ahead.\"\n\n\n\"I think it is too dangerous,\" Naomi opinions from her sickbed. \"What if Ieyasu catches up with us? My old ship is fast.\"\n\n\n\"Oh, we will be able to deal with him,\" Amako says with a cold smile. \"These people have betrayed the memory of Queen Renewel so we are raiding the island with  or without your help anyway Leo.\"\n\n\nYou frown out of the window at the distant Explorer as you consider your response.", "action_results": [{"action": "Join Amako and Ryuzoji in raiding Nassa harbor", "result": "The next morning you, Amako and Ryuzoji sail the Adventurer, Relentless and Lady Luck into the harbor of Nassa. The heavily-outnumbered and unarmed citizens give in without a fight and watch sullenly as sailors ransack their scant reserve of food. As the supplies are loaded aboard your three ships you wait on the jetty of Nassa in increasing uneasiness as the Explorer gets closer and closer. Fortunately Amako has a clever plan.\n\n\nAt dusk as the Explorer approaches the harbor Amako has a dozen fishing boats lashed together and set on fire. As the tide carries them towards the Explorer Ieyasu has to perform rapid evasive action to avoid colliding with this flaming barrier, allowing you, Amako and Ryuzoji to sail your ships out of the harbor, each of you delivering a volley of cannon fire as you pass the Explorer. The Explorer turns to return fire and one of her cannonballs kills three of your Crew as you make your escape.\n\n\n\"I don't know which is worse,\" Naomi says heavily when you tell her about the day's events. \"Having my ship under the command of that murderer or the thought that you might all sink my ship...\"\n\n\nThe Explorer falls behind as you all sail on to the Southeast.", "action_results": [{"action": "Open Sea", "result": "Leaving Nassa behind you and your two companions sail rapidly ahead to the Southeast, the Explorer trailing far behind you. You feel more confident than you have since the massacre at Revel as you know you are now sailing out of Elixi waters and approaching Navar waters which you sailed through in the Great Race, which are scattered with your people's colonies and for which you have maps and charts. One evening Amako and Ryuzoji join you and Naomi for dinner in the cabin of the Adventurer.\n\n\n\"I don't know why we are running,\" Ryuzoji says during the meal, dressed as usual in bright red. \"We outnumber Ieyasu three to one. We should turn around and attack him.\"\n\n\n\"Ieyasu has more guns and sailors aboard the Explorer than we have on our three ships put together,\" Amako says dryly. \"I think we should keep on towards Matan.\"\n\n\n\"The Explorer is a formidable ship,\" Naomi says with a note of pride. \"Easily as fast as the Adventurer and able to sail circles around your smaller ships. I don't think you should attack her.\"\n\n\n\"It's your choice,\" Amako tells you. \"If you say yes we'll all attack Ieyasu, if you say no we'll hold our course.\"", "action_results": [{"action": "Instruct the other Captains to turn around and attack Ieyasu", "result": "You give orders to attack the Explorer and the next morning you, Amako and Ryuzoji turn your ships around and sail towards Ieyasu's ship. Unfortunately Ieyasu has an unpleasant surprise for you: his cannons are larger and have longer range than yours and he is able to bombard your three ships while sailing out of range of your own smaller weapons. First Ryuzoji then Amako abandon the attack forcing you to do likewise, all of you having suffered a dozen casualties from the Explorer's accurate cannon fire including three dead aboard the Adventurer.\n\n\n\"I told you she was a hard ship to fight,\" Naomi says proudly when you tell her of the battle.\n\n\n \n\n\"Don't forget you're on our side,\" you remind her with a smile.", "action_results": [{"action": "The danger of Reefs", "result": "The Explorer continues to trail you closely as you and your companions sail into Navar waters. A small storm sweeps down one night from the north and by the time it has cleared at dawn you find it has separated you from your companions. After a tense hour you spot the Lady Luck and sail towards her but by the time you find the Relentless at noon the Explorer has spotted you as well and are closing in. Your heart drops as you see Amako's ship is in serious trouble.\n\n\nThe Relentless has been driven onto a series of reefs that are marked on your charts and is grounded solid with it's cannons pointing impotently up at the sky. Amako and his sailors are desperately trying to free her but there seems to be nothing they can do and as you sail closer Amako glances at the rapidly-approaching Explorer and waves you away. Ryuzoji, pale-faced and stricken over his brother's fate comes aboard the Adventurer.\n\n\n\"We have to leave them,\" he says, looking agonized. \"There is no time to get over there and take Amako and his sailors off before the Explorer catches up with us. Ieyasu is already closer to the Relentless than we are.\"\n\n\n \n\nA quick glance shows you are right but you don't feel right about abandoning your comrade and his Crew without at least trying to save them.\n\n\n \n\n\"It's up to you Leo,\" Naomi says with a shrug.\n\n\n \n\n\"Our mission to Matan is the most important thing,\" Ryuzoji says. \"We can do nothing to help my brother...\"", "action_results": [{"action": "Sail back to try and rescue Amako and his Crew anyway", "result": "Unwilling to abandon your companion you turn the Adventurer back towards the stricken Relentless but it is no good: Ieyasu is closer. As the Explorer sails in closer it fires a volley of cannon shots that kill three of your men and force you to turn the Adventurer away. Forcing to abandon your efforts to rescue Amako you can only watch in horror as Ieyasu's men pour a blast of cannon and musket fire into the stricken vessel before leaping aboard to slaughter the survivors. With a heavy heart you resume your journey towards Matan.", "action_results": [{"action": "The Ghost Ship", "result": "Ieyasu's Crew slaughter Amako's Crew when they catch up with the Relentless and that evening an explosion lights up the dusk as Ieyasu's Crew blow Amako's ship to pieces. The loss of his brother hits Ryuzoji hard and the previously cheerful Captain begins drinking heavily. You have your own concerns as you are now sailing Southeast into Navar waters that are marked on your charts and you are concentrating on not encountering any islands that may contain hostile colonists.\n\n\nOne day an unnerving sight drifts out of the early morning mists: a barnacle-encrusted ship with torn sails and clearly no one steering her. With a telescope you scan the ship and see the deck is covered with yellowed skeletons. A chill goes through you as you recognize the ship as the Revenge. Commanded by a particularly violent Captain called Edward Low (who was also Anne-Marie's first husband) the Revenge was one of your competitors in the Great Race and vanished during that voyage. Apparently you have rediscovered it. You toy with the idea of sailing closer and going aboard but Ryuzoji is terrified by the prospect.\n\n\n\"It is a ghost ship,\" he exclaims, visibly drunk despite the early hour. \"An ill omen!\"\n\n\nNaomi is more rational when you tell her about the side. \"If Ieyasu is as far behind us as you say it might be interesting to go aboard,\" she says mildly. \"I don't see anything to be frightened about in a few old bones.\"", "action_results": [{"action": "Spend a day investigating the Revenge", "result": "Your curiosity gets the better of you and you steer the Adventurer alongside the Revenge and go aboard the ghost ship with a few of your braver sailors. All the skeletons aboard the Revenge seem to have died in battle: the deck is littered with swords and muskets and many of the skeletons are twisted in grotesque positions, their yellowed jaws open forever in one last soundless scream. There is no food or water on board but you find a body that can only be Low's clad in the blood-stained rags of once-fine clothes. The skeleton still clutches it's sword in it's hand in a grip so tight it cannot be pried free. Feeling cold inside you leave this ship to resume it's drifting wayward course, return to the Adventurer and sail on.", "action_results": [{"action": "Open Sea", "result": "As the Adventurer and Lady Luck continue to sail Southeast out of Navar waters and into Lapau waters you have good reason to feel confident: the Explorer is still far behind you (though still in sight) and you are getting ever-closer to your destination. You are surprised to see that Ieyasu has also come upon the Revenge and unlike you he has chosen to take possession of the weathered and sinister ship as it has now been manned and has joined the pursuit of you and Ryuzoji, much to your companion's unease. Your two ships are now pursued by two ships as you continue Southeast into Lapau waters.", "action_results": [{"action": "The chase continues", "result": "You have now reached Lapau waters, which you sailed through some months ago as part of Anne-Marie's War Fleet. Remembering the route well you adjust course to the south, which will lead you straight to Matan. The temperature is getting colder now and still despondent over being forced to abandon his brother Ryuzoji is now drinking near-constantly and his low spirits have infected his Crew. Naomi frowns when you share your concern about your fellow Captain with her.\n\n\n\"I think maybe he is more image than substance,\" she tells you and groans as she clasps her hand to the bandage around her eyes. \"Where are the Explorer and Revenge?\"\n\n\n\"They seem to be getting closer,\" you tell her grimly.\n\n\n \n\n ", "action_results": [{"action": "The Snow Mountain", "result": "As you continue South the temperature continues to plummet and you and Ryuzoji are now both becoming concerned about your increasing lack of supplies. One day a familiar sight rises out of the sea before you: a snow-covered mountain. A village of Lapau huts once stood at it's base but Anne-Marie burned them during the Lapau War and judging by the ashes and ruins the Lapau have not returned to this island to rebuild them. Ryuzoji shows more interest than you in the ruined village when he joins you aboard the Adventurer for dinner.\n\n\n\"I want to land there,\" he tells you, slurring his words slightly as he drinks frequently from his wine glass. \"The Lapau may have left some food or supplies there.\"\n\n\n\"I doubt it,\" you tell him. \"It doesn't look like anyone has been there since Anne-Marie burnt their village.\"\n\n\n\"I'm going to go ashore and look anyway,\" Ryuzoji insists. \"Are you coming or not?\"\n\n\n\"Aren't you worried Ieyasu's two ships might catch up with us?\" Naomi asks.\n\n\n\"We'll see them coming a mile off,\" Ryuzoji says breezily. \"If they get too close we'll just weigh anchor and keep running south. Well Leo, are you coming or not?\"", "action_results": [{"action": "Accompany Ryuzoji in his forage ashore", "result": "Going ashore with Ryuzoji the next morning with most of your two Crews you approach the ruins of teh village and look around the huts. As you suspected it doesn't look as though anyone has been here for a long time: there is certainly no food anywhere and the whole mountain has an air of bleakness. While you are poking around one of your crewmen suddenly gives a cry of alarm and points back to the shore: the Explorer and Revenge were much closer than your thought and are bearing down on the anchored Adventurer and Lady Luck.\n\n\nWith a mixture of panic and adrenalin pumping through your body you rush back to your longboat and row back to the Adventurer so fast that three of your Crewmen are left behind on the Mountain. You get aboard your ship just ahead of the Explorer and Lady Luck and manage to get the anchor raised and the Adventurer sailing south before Ieyasu can catch up with you. Ryuzoji is not so lucky: the Explorer fires a volley of cannonballs into the sight of the Lady Luck at point blank range and she quickly sinks.\n\n\n \n\nTo your amazement something wholly unexpected happens: Ryuzoji and his Crew row alongside the Revenge where moments later fighting breaks out. Ryuzoji and his Crew manage to overpower the small Crew Ieyasu has put aboard the Revenge and win control of the ship. Somehow out-racing the Explorer the Revenge catches up with you and with it's Captain laughing gleefully at his narrow escape your two ships race south.", "action_results": [{"action": "Flight", "result": "Ryuzoji is ecstatic about his narrow escape from Ieyasu and when you go aboard the blood-stained decks of the Revenge you find he and his surviving sailors (only a dozen or so remain) are all drinking heavily as they celebrate. This state of affairs continues as you continue south and Ryuzoji and his Crew are frequently too drunk to handle their ship properly and it begins to fall behind.\n\n\n\"You need to do something about Ryuzoji,\" Naomi tells you when you explain the problem to her. \"We are having to slow down because he can't handle his ship properly and at this rate the Explorer will catch up with us again before we can reach Matan.\"", "action_results": [{"action": "Go aboard the Revenge and try to deal with your fellow Captain", "result": "Going aboard the Revenge with a few men you find Ryuzoji and his sailors predictably drunk and insist to your inebriated companion that this needs to stop. You have been trying to reason with him in his cabin for some time when suddenly shouts and cries fill the night. Rushing out on deck you find that the Explorer has caught up, pulled alongside the Revenge and Ieyasu's sailors are pouring aboard! You take one look and dive into the sea, swimming in board strokes towards the Adventurer. Three of your sailors are left behind and are captured along with Ryuzoji's crew, which are so drunk they give up practically without a fight. You are spotted and a boat is swiftly lowered, rescuing you from the freezing water and the Adventurer continues south. You see that to avoid any risks of Ryuzoji taking control of the Revenge again he and his sailors are transferred aboard the Explorer and the weathered old Revenge is sunk.", "action_results": [{"action": "The Corral Mountain", "result": "As the Adventurer continues to race South, still closely pursued by the Explorer yet another familiar island comes into sight: the scene of the final battle of the Lapau War. A corral mountain rises out of the sea ahead of you, at it's base is a large mound which you know must contain the graves of the Lapau warriors who died trying to protect their home islands from Anne-Marie's War Fleet of which you were a part. Your own dead, including your friend Esme Hale, were buried at sea nearby. This is also the scene of the revolt of Anne-Marie's officers against her where you joined several others in refusing to continue fighting the Lapau. You suspect that more than anything else this has earned you the undying hatred of Anne-Marie and it has cost your friends Tobias Cuthrew, Thomas Finch and Eva Freer their lives.\n\n\n\"We are getting close,\" Naomi says. You are surprised: you are standing on the quarterdeck but Naomi has finally risen from her sickbed and had a sailor help escort her out onto deck. The sea air seems to do her good as she looks stronger than she has in weeks.\n\n\n\"The food situation is getting critical,\" you tell her as you scan the corral mountain. It looks totally deserted and besides you are being too closely pursued by the Explorer to risk stopping now, especially after seeing what happened to Ryuzoji and the Lady Luck.\n\n\n\"It is alright: we are close,\" Naomi tells you. \"A few more days South and we will reach Matan.\"\n\n\n \n\nYou hold her hand in yours for comfort and turn your gaze to the south.", "action_results": [null]}]}, {"action": "Remain aboard the Adventurer and hope for the best", "result": "You remain aboard the Adventurer fretting about your fellow Captain but during the night Anne-Marie solves the problem for you. The Explorer catches up with the Revenge and Ryuzoji and his drunk Crew are overpowered and captured almost without a fight. To avoid any risk of Ryuzoji retaking the Revenge again Ieyasu has Ryuzoji and his surviving Crew transferred aboard the Explorer and the Revenge is sunk. The Adventurer continues her voyage South alone.", "action_results": [null]}]}]}, {"action": "Remain offshore and wait for him", "result": "You remain offshore and watch as Ryuzoji leads most of his Crew ashore to investigate the village. With mounting alarm you see the Explorer and Revenge getting closer and closer and try to warn Ryuzoji in the village of the threat by firing your ship's cannons. When he awakens to the danger it is too late: the Explorer sails alongside the Lady Luck and fires a volley of cannon shots at point-blank range into it's side. Ryuzoji's ship quickly sinks.\n\n\nAs you are pulling away with the Adventurer something remarkable happens. The Revenge sails up to Ryuzoji and his Crew, who are in a small longboat and were rowing back to the Lady Luck before she sank, and help them aboard. Moments later fighting breaks out and Ryuzoji's Crew manage to overwhelm the small Crew Ieyasu has put aboard the Revenge. Taking control of the Revenge Ryuzoji and his men rapidly outrace the Explorer and sail after you while you give them covering fire with the Adventurer's cannons. Ryuzoji is triumphant as he rejoins you and your two ships resume your flight south.", "action_results": [null]}]}]}]}]}, null]}]}, null]}]}, null]}]}, {"action": "Anchor offshore and wait for Amako and Ryuzoji to carry out their raid", "result": "You wait offshore to see what happens. The next morning Amako and Ryuzoji lead their ships into Nassa harbor and pillage the village. When the Explorer approaches at dusk Amako lashes together the village's fishing boat fleet, sets them afire and leaves the tide to carry them towards the Explorer. Ieyasu is forced to retreat to save his ship and the Relentless and Lady Luck sail out of the harbor, firing their cannons defiantly at the Explorer as they go. It is a smart piece of seamanship and when your two companions have rejoined the Adventurer you all resume your journey to the Southeast.", "action_results": [null]}]}, {"action": "Sail Southwest with Miura and Rokkaku", "result": "At dawn the eight ships part way, speeding off in different directions. The three ships of you and your companions, Adventurer, Royal Avenger and Warrior, turn Southwest and for the first time you get a good look at your new friends. Miura is a grim and black-bearded hulking giant of a man while his brother Rokkaku the dandy is a fairly indifferent and vague personality, though well-educated he tends to follow his older brother's lead. The three of you are not alone: the Esme's Joy turns to follow your three ships, it's decks lined with cannons and crew. After three days at sea you manage to make out the hulking figure of Kenshin standing on the ship's prow with your telescope and you relay this information that Kenshin is your pursuer to your fellow Captains.\n\n\n\"Kenshin is ruthless and aggressive,\" Miura declares while Rokkaku nods. \"We should attack him straight away while we have the advantage of ship numbers.\"\n\n\n\"I'm not so sure,\" Naomi says cautiously. \"If he is as strong as you describe he has more cannons and sailors than our ships put together.\"\n\n\n\"We will attack anyway,\" Miura tells you. \"It is up to you if you join us or not.\"", "action_results": [{"action": "Join your companions in attacking Kenshin", "result": "You, Miura and Rokkaku prepare your ships and turn the Adventurer, Royal Avenger and Warrior around to attack Esme's Joy. Cannons explode into life, cannonballs lance across the water and screams begin to fill the air. The Warrior beaks off the battle quite quickly when a cannonball strikes the rail Rokkaku was leaning on, shredding his right leg with splinters. Outgunned you and Miura follow suit, the three of you having suffered a dozen casualties among your Crews, including three aboard the Adventurer. Having learned that attacking Kenshin directly is a bad idea you all resume your voyage to the Southwest.", "action_results": [{"action": "Shin Town", "result": "After a few days sailing a large Elixi port/island is sighted ahead of you. Miura and Rokkaku come aboard the Adventurer to confer with you and Naomi, Rokkaku is on crutches because of his wound.\n\n\n\"That is Shin Town,\" Miura tells you, pointing at the port. \"It is an island that supports Shingen and the town is named after him. I think we should raid it to increase our food supplies for the voyage ahead.\"\n\n\n\"We must be careful that Kenshin does not catch up,\" Naomi points out.\n\n\n\"Kenshin is far behind us and we have time to raid the port for food and make our escape before he catches up,\" Miura says confidently.", "action_results": [{"action": "Join Miura and Rokkaku in raiding the town", "result": "Your three ships sail into the harbor and Miura sends a messenger ashore that if the town doesn't swiftly surrender all it's spare supplies then the sailors of your three ships will pillage the town. The threat works well and within an hour boats of supplies are being conveyed to your three ships. Before the Esme's Joy can reach the scene you and your companions have already loaded the deliveries of food aboard your ships and resumed your voyage to the Southwest leaving the looted town behind you.", "action_results": [{"action": "Ross", "result": "Sailing steadily Southwest you soon come to another small island, lightly wooded with a small village sitting in a little bay. It is another Elixi island and Miura and Rokkaku know it well.\n\n\n\"That is Ross,\" Miura tells you. \"It's another pro-Shingen island. I think we should raid it.\"\n\n\nRokkaku, now off crutches but limping painfully, nods his agreement.\n\n\n\"Kenshin is getting much closer to us,\" you point out, indicating the Esme's Joy which is indeed closing in. \"I'm worried if we take too long he might trap us in the bay.\"\n\n\n\"You saw what happened at Shin Town where we were fine,\" Miura tells you with a shrug. \"Me and Rokkaku will raid the island anyway, even if you don't.\"", "action_results": [{"action": "Join the raid on Ross", "result": "Together your three ships sail into the little bay and approach the village. All of you are keeping an uneasy eye on the Esme's Joy which is gaining speed and approaching the bay rapidly. Fearful lest you become trapped you decide to call off the raid. As you are all sailing back out disaster strikes: Rokkaku accidentally grounds the Warrior on a hidden sandbar near the mouth of the bay. You and Miura turn the Adventurer and Royal Avenger back to help him but the Warrior is stuck fast.\n\n\nBy now Esme's Joy has arrived on the scene and turns to fire a volley of cannon shots, hitting both your and Miura's ships, killing three of your sailors and forcing you to withdraw. As you and Miura extricate yourselves from the harbor you can only watch as a short but violent exchange of cannon and musket fire rages between the Esme's Joy and Warrior hat only ends when Rokkaku raises the white flag and surrenders. You have lost one of your fellow Captains.", "action_results": [{"action": "Flight to Sull", "result": "Miura does not seem too downcast that his brother is now a prisoner in enemy hands and the Adventurer and Royal Avenger continue their flight Southwest pursued by the Esme's Joy and Warrior until you come upon a small, thickly-wooded island. Miura comes aboard the Adventurer to identify it.\n\n\n\"That is Sull,\" Miura tells you. \"It is an Elixi island but nobody lives there because the trees grow too thickly. I remember there was some talk of establishing a colony there at one time but nothing came of it. There are no animals or food sources there so there is no point in landing.\"\n\n\nAs you are talking you hear a sudden shout on deck and hurry out to see what is happening. To your surprise you witness half a dozen sailors diving overboard from the deck of the Warrior and swimming with surprising speed towards Sull. You can see musket balls splashing into the sea all around them and recognize Rokkaku. You point him out to Miura who looks doubtful.\n\n\n\"He won't get far,\" he says doubtfully. \"He'll either get shot or captured on Sull.\"\n\n\nThere doesn't seem to be much love lost between the two brothers but when you report what is happening to Naomi she tells Miura that he at least or to try to rescue his brother but he refuses.", "action_results": [{"action": "Sail back to try to help your comrade", "result": "You give orders to sail the Adventurer back towards Sull but your efforts are in vain. After three of Rokkaku's companions are shot he gives up his escape attempt, a boat is lowered and he and his surviving men are taken back into captivity. Both the Esme's Joy and Warrior fire volleys of long-range cannon shots which kill some of your Crew. Turning away you follow the Royal Avenger on towards the Southwest.", "action_results": [{"action": "Ocracoke", "result": "The fourth island of your voyage is soon sighted, a small tropical island with a sandy bay.\n\n\n\"That is Ocracoke, the last Elixi island in these waters,\" Miura tells you when he comes aboard the Adventurer. \"It is unoccupied at the moment but there are plans to establish a colony here because there are banana trees. We have a long voyage ahead to Matan and I think we should land here and pick up some fruit.\"\n\n\n\"Kenshin sounds like he is getting closer,\" Naomi warns. \"We may be trapped here like Rokkaku was at Ross.\" Miura shrugs and says he is going ashore anyway.", "action_results": [{"action": "Land with Miura to pick up supplies", "result": "You and Miura sail into Ocracoke's bay but as the wind picks up Kenshin bears down with the Warrior and Esme's Joy. Trapped you and Miura are forced to sail the Adventurer and Royal Avenger dangerously close to the ships of your adversaries. Aboard the Adventurer you have a bit of luck: the Warrior runs aground and can do no more than fire a volley of cannon shots that kill three of your sailors as you make your escape. Miura is not so lucky.\n\n\nThe Esme's Joy pulls alongside the Royal Avenger and dozens of attackers pour onto the ship. After fierce hand to hand fighting Miura and most of his sailors are slaughtered and a third ship joins Kenshin's small Fleet. Forced to continue fleeing to the Southwest you now find yourself alone and pursued by a much stronger foe as you sail on into unknown waters.", "action_results": [{"action": "Open Sea", "result": "You and your Crew are now in a very bad situation as the Adventurer continues to sail on alone to the Southwest pursued by Kenshin's three-ship Fleet. Your Supplies are beginning to get low and cap it all off it is beginning to get much colder at night now. Only Naomi remains optimistic during your conversations with her as she lies on her sickbed.\n\n\n\"I think we are leaving Elixi waters and entering Lapau waters,\" she tells you. \"Do you remember that it got cold as well the further south we sailed during the Lapau War? I don't think we're more than two weeks from Matan. We'll get there yet Leo.\"\n\n\nYou wish you shared her optimism.", "action_results": [{"action": "The Snow Island", "result": "As the temperature continues to drop a small snow-covered island appears ahead of you. You are surprised and pleased to see a dozen Lapau canoes bobbing offshore and a few small covered huts on the coast. The Lapau appear to be fishing, jabbing into the water suddenly with their spears and pulling their weapons from the water to reveal shiny, struggling fish speared on the end. Relations between your people and the Lapau have been tense since the end of the Lapau War and you are unsure whether to land and ask for food or not. Naomi is keen on the idea.\n\n\n\"I think they will help us when they learn of the Elixi's treachery,\" she tells you. \"If Kenshin's fleet is far enough away as you say it should be safe.\"", "action_results": [{"action": "Spend a day visiting the Lapau and asking for supplies", "result": "Cautiously you approach the small snowy island to beg for food. The Lapau paddle out to meet you and their leader comes aboard the Adventurer, he is a scarred veteran who still limps from a wound he suffered during the Lapau War. He does not look happy to see you and one of your men who can speak his language translates his words.\n\n\n\"Because we lost so much food during the Lapau War many of my people are hungry this year,\" he tells you. \"King Al-Capu has sent warriors beyond our country's borders in search of food to help our struggling people.\"\n\n\nYou explain to him that you are fleeing from an enemy who is hunting you but the chief shrugs.\n\n\n\"Your people's problems are not our concern,\" he tells you diffidently. \"But Prince Al-Balu is your country's guest so we must show some friendship towards you... my men have done well and caught many fish. You may have some.\"\n\n\nThanking the man for his help you have a few dozen fish stowed aboard and resume your journey, feeling remorseful for the suffering you and your fellow Captains have inflicted upon the Lapau on the order of your tyrannical Queen.", "action_results": [{"action": "Onwards", "result": "As the Adventurer sails on Southwest two welcome things happen: it begins to get warmer and Kenshin breaks off his pursuit, turning to the South with his three ships. You suspect that the reason he has broken off the pursuit is because he is low on supplies: you are also low as well. One morning a low rocky island is spotted ahead, to your surprise caves seem to puncture the rocks in many places and with a telescope you can make our skeletons clutching spears and muskets scattered about the island. This is clearly the scene of one of the battles of the Lapau War.\n\n\n\"I think this is an island that Queen Anne-Marie managed to capture with Quarrel and Finch near the end of the Lapau War,\" Naomi tells you frowning when she hears your description of the island. \"She called it Finch Island... do you want to land? It doesn't sound like anyone has visited it since the fighting or that there is anything valuable here.", "action_results": [{"action": "Spend a day visiting the island", "result": "You drop anchor and lead a small party ashore in the ship's boat. The island is a deserted and unnerving place: skeletons lie both above ground and below in the caves, altogether you count about a dozen you believe to be Navar and more than twice that number of spear-armed Lapau. The whole island has a melancholy, almost sad feel, about the senseless loss of life that took place here and you are happy to get back aboard the Adventurer and continue your voyage.", "action_results": [{"action": "A familiar sight and a familiar enemy", "result": "As you sail onwards, your food supplies ever-dwindling, you finally come across something you definitely recognize. A corral mountain juts up out of the sea towards the sky: it was here that the last battle of the Lapau War was fought. Somewhere just offshore your friend Esme Hale and your fallen countrymen received a dignified burial and a small mound near the shoreline at the base of the cliff shows where the Lapau lie. The place makes your blood run a little cold.\n\n\nSo too does an unexpected and un-welcome sight: sailing down from the Northwest is the Explorer. With your telescope you recognize the figure of Ieyasu on the deck. You remember Amako and Ryuzoji sailed Southeast, if they'd survived their voyage they should be approaching from the same direction as Ieyasu but there is no sign of them...\n\n\n\"Someone said my old ship is in sight,\" a voice says behind you. You turn startled: Naomi has risen from her sickbed for the first time since she was blinded and has joined you on the Quarterdeck, guided by two sailors. You confirm that her ship is indeed in sight and Ieyasu seems to be in command.\n\n\n\"You know Leo, I have a bad feeling we might be the only ones to make it through to Matan alive,\" Naomi tells you heavily. \"We'd better turn south here and make our final run to our destination.\"\n\n\nYou agree, give the order to turn south and prepare for the last leg of your voyage to Matan where all your hopes and fears are centered.", "action_results": [null]}]}, null]}]}, null]}]}]}, {"action": "Anchor offshore and wait for him", "result": "Wary of sharing the same fate as Rokkaku you keep the Adventurer offshore and watch as Miura sails into the bay. Unfortunately the wind picks up bringing Kenshin's ships speeding into the bay and Miura is unable to escape in time. The Warrior runs aground but the Esme's Joy bears straight down on the Royal Avenger and managed to come alongside. Dozens of Elixi sailors pour onto the decks of the Royal Avenger and Miura and most of his Crew are slaughtered. You can do no more but continue your flight as Kenshin adds a third ship to his fleet.", "action_results": [null]}]}]}, {"action": "Decide not to risk your ship and your crew", "result": "As you sail on you watch from deck with your telescope as a volley of musket shots kill some of Rokkaku's companions. Rokkaku and the other survivors abandon their escape attempt and are recaptured when a boat is lowered for them. For some reason you have a worrying feeling that the same fate might befall you and Miura. With a heavy heart you turn your gaze away as the Adventurer continues steadily to the Southwest.", "action_results": [null]}]}]}, {"action": "Anchor a safe distance off and wait", "result": "You keep a safe distance offshore and witness a dramatic fight. As Kenshin's Esme's Joy picks up speed and gets closer Miura and Rokkaku decide to abandon the raid and make for the open sea. Disaster strikes when the Warrior gets grounded on a hidden sandbar and Miura is forced to abandon his stricken brother. A short but violent exchange of musket and cannon fire rages between the Esme's Joy and Warrior that ends in Rokkaku raising a white flag and surrender. You and Miura are forced to resume your flight southwest, having lost one of your fellow Captains.", "action_results": [null]}]}]}, {"action": "Anchor offshore and wait", "result": "Not trusting the plan you anchor offshore while Miura and Rokkaku sail their ships into Shin Town Harbor. You watch as Miura sends a boat of sailors ashore to demand supplies and to your surprise within an hour the town has sent a boat of supplies out to their two ships. The Royal Avenger and Warrior escape the harbor before Kenshin's Esme's Joy arrives on the scene and together the three of you continue your flight to the Southwest.", "action_results": [null]}]}]}, {"action": "Stand off and see what happens", "result": "You drop anchor and watch as the Royal Avenger and Warrior sail back to do battle with the Esme's Joy. After a short exchange of cannon fire first Rokkaku and then Miura break off the fight. You soon learn that Rokkaku has been wounded: his right leg has been shredded by splinters when the rail he was leaning on was hit by a cannon ball. The short fight has achieved nothing except a few casualties among the crews of your allies and given you the knowledge that you are unlikely to be able to defeat Kenshin in a direct fight. You all resume your journey Southwest.", "action_results": [null]}]}, {"action": "Sail Northwest with Sanada and Sogo", "result": "At dawn the eight ships part way, all speeding off in different directions. You and your two companions steer the Adventurer, Charmer and Fortune Northwest and are disconcerted when the Sea Ghost turns to follow you. With a telescope you can make out the burly figure of King Shingen himself in the stern. You report this information to Sanada and Sogo who are both cheerful and intelligent men. Both warn you not to underestimate Shingen whose cannon and crew aboard the Sea Ghost outnumber your three ships put together.\n\n\nAfter a few days a small island-port comes into sight and Sanada and Sogo come aboard the Adventurer to identify it.\n\n\n\"That is Principe,\" Sanada tells you. \"I have an idea. We will sail in pretending to be loyal Captains in the service of Shingen and request supplies from the village. We'll trick them into resupplying us and then sail away before they are any the wiser.\"\n\n\n\"I don't think that will work,\" Sogo says cautiously. \"Shingen will have issued reports throughout the Elixi islands of what we look like. I will not join you in this.\"\n\n\nSanada however is not to be deterred.", "action_results": [{"action": "Go ashore with Sanada to request food from the town", "result": "Together with Sanada you sail the Adventurer and Charmer into Principe Harbor and anchor while Sanada leads his sailors ashore. It is oddly quiet when suddenly a volley of musket shots is fired by armed villagers hiding in the houses. Sanada is shot in the head and killed instantly along with most of his crew. You and your Crew hastily weigh anchor and sail out of the harbor, abandoning the Charmer to be captured by the pursuing Sea Ghost. Three of your men are killed in this unfortunate defeat.", "action_results": [{"action": "The flight continues", "result": "Sailing Northwest you and Sogo are pursued by Shingen who has now taken possession of the Charmer, which together with the Sea Ghost pursues the Adventurer and Fortune across the sparkling waves. Soon enough a small island with a village at the shore comes into sight which Sogo soon identifies for you.\n\n\n\"That is Ferryland, a pro-Shingen island,\" he tells you. \"I think we should both sail directly up to the village and threaten to fire cannonballs into their homes if the colonists do not immediately give us food.\"\n\n\n\"We must be careful not to be trapped like Sanada was,\" Naomi says cautiously from her sickbed.\n\n\n\"We will be fast,\" Sogo says with a shrug. \"I will go in even if you don't Leo.\"", "action_results": [{"action": "Join Sogo in attacking Ferrytown", "result": "Changing course you and Sogo sail your ships directly into Ferrytown Harbor and shout your threats and demands down to the shore. After firing a few cannon shots the terrified colonists promptly raise a white flag and send out a boat filled with supplies. Taking the goods on board you turn away from the island and are back on course before Shingen and his ships even get close. The whole thing seemed ridiculously easy.", "action_results": [{"action": "Onwards", "result": "Keeping on a Northwest track you and Sogo soon sight another small inhabited island which Sogo identifies to you as another pro-Shingen Elixi island called Trepassey. He is very keen to repeat his tactics which were successful at Ferryland when he comes aboard the Adventurer.\n\n\n\"What worked at Ferryland will work here,\" he insists to you. \"The Colonists in these waters are unusued to fighting and they are all cowards.\"\n\n\n\"Sogo seems to know what he is talking about,\" Naomi says to you quietly.\n\n\n ", "action_results": [{"action": "Join Sogo in raiding Trepassey", "result": "Sailing into the harbor of Trepassey you and Sogo repeat Sogo's bold tactics of Ferryland and threaten to bombard the town with cannon fire unless supplies are given. Incredibly the colonists of this town are even quicker, no cannon fire is necessary and you are back on your way before Shingen's ships can even get close.", "action_results": [{"action": "Ouidah", "result": "You continue Northwest for a few more days until yet another island with a small village on it comes into sight. Sogo identifies it as Ouidah, the last Elixi port in these waters. Though he is hardly short of supplies Sogo is keen to pillage the island before continuing your voyage across unknown waters towards Lapau territory and Matan. Naomi has been converted by Sogo's past successes and urges you to join him in raiding the island.", "action_results": [{"action": "Join the raid on Ouidah", "result": "For the third time in a row Sogo's plan pays off: you and Sogo sail your ships directly into the harbor and with a few threats and a few cannonballs succeed in obtaining supplies from the frightened colonists: in fact they are bringing the supplies out to you before you have even made your demands! You can only imagine how the relentless pillaging of his colonies is infuriating Shingen and with a broad grin you and Sogo continue your voyage out of Elixi territory and into unfamiliar waters.", "action_results": [{"action": "Northwest to Lapau Territory", "result": "Sailing Northwest a fifth island comes into sight: a small and unoccupied low mound of sand that juts out of the water a few meters: there is clearly nothing there. The morning the island is sighted Sogo joins you and Naomi for breakfast aboard the Adventurer and makes a bold suggestion.\n\n\n\"We should attack Shingen,\" he tells you. \"Together the Adventurer and Fortune should be strong enough to defeat the Sea Ghost and Charmer. I am tired of running and I think if we attack them we have a good chance of winning.\"\n\n\n\"Why fight if we don't have to?\" Naomi asks. \"Personally I think we should keep going to Matan.\"", "action_results": [{"action": "Join Sogo in attacking Shingen", "result": "You decide in making a stand to fight Shingen and you and Sogo turn out ships about to attack them. The cannon fire opens at long range and disaster strikes almost immediately when one of the first cannonballs fired by the Sea Ghost decapitates Sogo! You see his headless body topple to the deck in a cloud of red and his Crew give a wail of despair. The Fortune breaks off from the fight and inexplicably turns off to the south. Though you have only suffered three casualties among your Crew you are forced to break off the fight too and steer the Adventurer back towards the Northwest. Shingen ignores the fleeing Fortune and the Sea Ghost and Charmer continue pursuing you to the Northwest.", "action_results": [{"action": "Flight", "result": "You are in the worst state you have been in the voyage so far: alone and pursued by a numerically superior foe you are driving the Adventurer into unknown waters. You believe you have reached the point where you need to turn due West to reach Lapau waters and Matan when disaster strikes: the Adventurer strikes a hidden reef and becomes stuck fast! With the Charmer and Sea Ghost coming up fast behind you, each stronger in cannons and crew than your ship, you need to act fast to get unstuck from the reefs.", "action_results": [{"action": "Start throwing supplies overboard to lighten your vessel", "result": "You order your men to begin throwing barrels of water and cannonballs over the side of your vessel. You have barely begun when a wave suddenly lifts the Adventurer clear and you are able to resume your flight to the west. You have only lost a few days of supplies but with several days journey ahead of you to Matan you begin to worry if you will have enough supplies.", "action_results": [{"action": "Sail on to the West", "result": "Running due west you are now entering Lapau waters and can't be more than a week from your destination but Shingen is still pursuing you intently in his two ships. After a few days a small rocky island comes into sight. It seems to be inhabited by countless goats and down by the shore several Lapau warriors are hunting, killing goats with their spears and carrying the carcasses back to their boats. Ever since the Lapau War relations between your people and theirs have been tense but if you do want to spend a day landing to get some supplies Shingen's ships are far enough behind you that you can do it safely.", "action_results": [{"action": "Land and pick up supplies", "result": "As the Adventurer approaches the rocky island the Lapau promptly take to their boats and paddle away to the north. You are surprised they are fleeing but they don't look a particularly healthy bunch: thin and emaciated they have obviously been starving for some time. You lead a party of sailors ashore, kill a few goats and load the fresh meat into the hold of the Adventurer. Having resupplied yourself you resume your journey west.", "action_results": [{"action": "Approaching Matan", "result": "The Adventurer plunges relentlessly over the rolling waves going deeper and deeper into Lapau territory. You are only a few days from Matan now and have such a lead there is now way that Shingen can catch you: recognizing this the Sea Ghost and Charmer break off the pursuit and turn away to the Southwest. Your Crew cheer and you are standing on the quarterdeck of the Adventurer studying the defeated ships with your telescope when you hear a voice behind you call your name.\n\n\nTurning around you are surprised to see Naomi has finally risen from her sickbed and joined you on the quarterdeck. A clean white bandage covers her shattered eyes and a sailor is leading her by the arm to where you stand. The fresh sea air seems to do Naomi good.\n\n\n\"We are getting close to Matan then?\" she asks. \"Do you think King Al-Capu will listen to us?\"\n\n\n\"I guess we're about to find out,\" you say heavily as the Adventurer completes the last leg of your voyage.", "action_results": [null]}]}, null]}]}, {"action": "Order your Crew onto the Reef with spades to help free your vessel", "result": "You order some of your men down onto the reef with spades to begin freeing the Adventurer. As they start digging a large wave suddenly sweeps the Adventurer clear while at the same time sweeping your sailors on the reef under your ship. Most manage to swim clear and are hauled hastily aboard but three are never seen again: unable to swim clear they have met a horrible death. Hastily turning the Adventurer to the west you resume your flight from Shingen's ships.", "action_results": [null]}]}]}, {"action": "Let him fight his battle on his own", "result": "Unwilling to risk the Adventurer you drop anchor and watch the Fortune turn to do battle with the Charmer and Sea Ghost. Disaster strikes almost immediately when one of the Sea Ghost's first shots bloodily decapitates your loyal ally Sogo. A cry of dismay goes up from his crew who promptly break off the fight and turn their ship southwards. You can do nothing but resume your flight to the Northwest pursed by Shingen's victorious vessels while the Fortune vanishes from sight to the south.", "action_results": [null]}]}]}, {"action": "Wait offshore", "result": "You are worried that Sogo is pushing his luck too far but you needed to have no such concerns: the plan once more works and for the third time Sogo pillages an Elixi Colony. With a broad grin you watch as the Fortune sails up to join you and together you push on Northwest.", "action_results": [null]}]}]}, {"action": "Anchor offshore", "result": "Caution gets the better of you and you keep offshore but there was no need for caution: the Fortune sails directly into the enemy harbor, obtains supplies from the colonists and promptly sails back out again. You can only imagine how annoyed Shingen is becoming aboard his pursuing ships!", "action_results": [null]}]}]}, {"action": "Wait offshore", "result": "Cautious of the plan you keep the Adventurer a safe distance away but to your surprise everything goes smoothly: Sogo sails his ship directly into the harbor, fires a few cannon shots and has a boat load of supplies brought out to him. Sailing back out of the harbor he is safely away before Shingen and his two ships even get close and together the two of you continue your flight to the Northwest.", "action_results": [null]}]}]}, {"action": "Remain offshore with Sogo", "result": "You remain offshore and watch as Sanada sails the Charmer into Principe's harbor and lead his Crew ashore. As they enter the village he and his crew are ambushed by armed colonists hiding in the buildings and Sanada and most of his sailors are slaughtered in the musket fire and their ship captured. With the Sea Ghost so close there is nothing you can do to avenge your fallen comrade and together with Sogo on the Fortune you resume your flight to the Northwest.", "action_results": [null]}]}]}]}]}]}]}]}, null]}]}, null]}]}, {"action": "Sail Due West across the open sea towards the Western Passage", "result": "You sail the Adventurer across the rolling waves, the Explorer and Esme's Joy easily keeping speed with you. You are glad to have your two friends either side of you and can think of no one you'd rather sail with. Every evening Naomi and Eva come aboard for dinner and most evening you speculate on what could have happened to Cuthrew and Finch.\n\n\n\"Cuthrew was the best sailor we've got and Finch was no fool,\" Eva opinions one evening. \"Whatever happened to them it must have been something neither of them have ever encountered before or even suspected they would encounter...\"\n\n\n\"We must be careful Leo,\" Naomi tells you. \"Keep a close eye out for any dangers.\"\n\n\nYou nod, uncomfortably aware that the lives of your fellow officers and the ninety sailors under your command rest on your decisions.", "action_results": [null]}]}]}]}