{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=43573", "context": "", "first_story_block": "The night is cold, dark and starless. The only light other than the candle Mama clutches in her hand comes from the moon, whose once bright, white, inviting and warm light is now deep red, like it's been splattered with blood. You're curled up with your two sisters, Ivana and Lilia, with Mama sitting over you, her candle in one hand and a wooden crucifix in the other. Papa is nailing boards to keep the door shut, hastily trying to give you some extra protection.\n\n\nIt's the Night of the Blood Moon. You've never been through one, the last happening less than a year before your birth, but now, after another twelve years, it had arrived. Your eldest brother, Dornan, told stories about it, stories that chilled you to the bone, that kept you from sleep, that gave birth to the horrors of your nightmares. If even a fraction of what Dornan said is true, the screams should begin soon.\n\n\n\"Mama?\" Lilia asks.\n\n\n\"Hush, darling,\" Mama replies, as Papa finishes boarding up the door and grabs his shotgun from it's place on the wall. He takes his spot next to you, his gun pointed at the door, and you wait.\n\n\nThe screams start soon. Howls of pain and terror from other houses of the town. Ivana is old enough to know to stay quiet, but Lilia soon starts to cry. Mama desperately tries to hush her six year old daughter, but to no avail.\n\n\n\"Sssh! Sssh, darling! It's alright, you just must stay quiet!\" Papa says.\n\n\nSuddenly, a tall, dark shadow passes by the window. Papa immediately grabs his shotgun, frantically raising it to his shoulder. The shadow disappears, and Papa breaths a sigh of relief.\n\n\n\"Scared of something?\" a deep, guttural voice says from behind you.\n\n\nPapa turns, firing his shotgun as the monster speeds forward. It grabs Papa's throat with unnatural speed, smiling as it holds him in the air, strangling him.\n\n\nThe monster looks hideous. It's dreadfully pale, it's face twisted with hate, and looks to be hairless. It's eyes are completely black, like the endless darkness of its soul, and it's mouth is filled with mangled teeth with two large fangs, curved and bloodstained, with even more blood pouring down its face. The creature snarls, before smiling as it turns to look at you and your siblings. \n\n\n\"Ah... so young... so fresh...\" the vampire says, licking it's lipless mouth with a forked tongue. \"Peasant, your daughters are mine. Don't struggle.\"\n\n\nThe vampire tosses Papa to the ground, turning towards your siblings.\n\n\n\"No! No! You will not take my daughters!\" Father says, grabbing for his gun.\n\n\nThe monster strikes, smashing it's boot into Papa's head.\n\n\n\"How dare you?!\" the monster screams. \"I gave you your land, I gave you your house, I give you your life!\"\n\n\nThe monster begins walking toward Papa, who desperately crawls back to the wall.\n\n\n\"I keep the beasts away from the village! I let you roam the night all but one night every twelve years! I don't ask for your wife, to allow you to sire more. I don't ask for your son, to leave you a legacy. I only ask for your daughters! How dare you attempt to deny me that?\"\n\n\nAs the vampire walks towards Papa, his fangs bared, you see a chance to get Papa's shotgun. Still, you don't want to anger the vampire further. Perhaps the best option is to hope for the beast's mercy.", "action_results": [{"action": "Grab for the gun", "result": "You scuttle forward for the gun, grabbing it. You aim it at the vampire, grabbing the trigger and pulling it tightly.\n\n\nThe gun explodes, sending you falling back with the recoil and smacking into the wall with a painful thud. The vampire roars as buckshot slams into his back. He grabs your father by the head, twisting with inhuman speed as your hear a painful snap. Then, he turns, staring at you. He snarls, walking forward quickly. You reach for the gun again, but he steps on your hand as you yelp in pain.\n\n\n\"You dare shoot me? I have lived millennia, you think you'll be the one to end my life?\" the hunter snarls, before laughing, a horrible, terrifying noise. \"You have balls, little one.\"\n\n\nYou stare at the monster in front of you, trying to stare him, but you see nothing but hate and unquenching thirst behind his eyes.\n\n\n\"Yes... I see strength in you. Potential. I have an offer for you, as the newfound man of the house. Join me. Let me take you on as my... apprentice. As my servant. As my slave. As whatever I need you to be. In exchange for your servitude, I offer you not only your life, but the life of your mother and sisters.\"\n\n\nYou stare at the monster, whose eyes narrow as he waits for you answer.", "action_results": [{"action": "Agree", "result": "\"OK,\" you say, gulping.\n\n\nThe vampire smiles, perhaps in an attempt to calm you, but the way his smile curves upwards seems unnatural. It's like the smile of a wolf who has found a young, bleating lamb all by itself.\n\n\n\"Perfect,\" the vampire says, dropping you to the ground.\n\n\nThe monster walks out of the hut, barking out a single order.\n\n\n\"Follow,\" he commands.\n\n\nYou walk outside to the glow of the red moon, seeing a dozen bodies, pale from blood draining, lying on the street. A single carriage lies there, with a hunch-backed man sitting there, wearing a low-down bowler hat, a balaclava and a large coat that cover his appearance.\n\n\n\"Haygarth! We're finished here. I've fed,\" the vampire growls.\n\n\nThe hunch-back nods eagerly, grabbing the reigns of the horses.\n\n\n\"Yes, sir, ready to go, sir!\" Haygarth says eagerly. \"And the boy?\"\n\n\n\"He is mine,\" the vampire says, as he steps into the carriage.\n\n\n\"Yes sir, yes sir! Up front, boy! Quickly!\" Haygarth says.\n\n\nYou quickly walk up to the carriage, climbing into the shotgun seat of the carriage. Haygarth seems badly deformed, clearly attempting to cover his appearance with his large coat, low hat and balaclava, but he still looks monstrous. Haygarth quickly stirs the horses into a trot, as you leave the town that's always been your home.\n\n\n\"You're to serve Count Grey?\" the hunchback asks.\n\n\n\"Yes,\" you say, barely coming to terms with the fact.\n\n\n\"Hmm... we'll see how long you last,\" Haygarth says. \"Yes, we'll see...\" ", "action_results": [{"action": "Three Years Later...", "result": "You sit on the ground, scrubbing the cold stone floor of the Grey Castle, named as much for its cold, lifeless demeanor as much as its owner. Haygarth stands over you, watching as he makes sure you do a proper job cleaning the blood stains that cover the ground, a remainder of the last girl foolish enough to be out at night. \n\n\nSo far, your job has been simple. You have little contact with Count Grey, as you work in the day and sleep at night, whilst he sleeps in the day, coming out at night to hunt, feed, plan and much more. Mostly, Haygarth forces you to work at any job he sees fit. He seems to think you're little different from a pack horse, working you as hard as them. If anything, he's feeding the pack horses better. You see your role in the castle as a servant on your more optimistic days, and as a slave on the worse ones.\n\n\n\"Good, good, put your back into it! Yes, that's it!\" Haygarth says, as he hurries around the room, collecting pieces of clothes left over from the poor girl being brutally murdered.\n\n\n\"Yes, Haygarth,\" you reply, putting your pressure on the brush as you splash some more water to get rid of a particularly disgusting stain of a mixture of blood and urine.\n\n\nHaygarth is a hard ruler, forcing you to work day and night. He's not sadistic or cruel, he just doesn't seem to understand that you're not an animal who needs a break. Hell, perhaps his only redeemable feature is the fact that he works himself even harder. As he rushes past, trying to do various chores, you can hear him angrily mutter to himself to go faster.\n\n\nYou finish off the stain, quickly crawling over to the next. You sigh as you realize just how much you need to clean. Your knees hurt from crawling around all day, your hands are covered in blisters, and you've done nothing but work all day. You had two ive minute breaks to cram food into your mouth, and one more to shit, and that was it. Who the fuck has only two people to keep an entire castle from falling into disrepair?\n\n\n\"Hurry up, boy! Use some of those strong muscles! I want to be able to see my reflection in it!\"\n\n\nWill he ever leave you be? The bastard can't just let you fucking work, he has to constantly remind you that you're not doing good enough? ", "action_results": [{"action": "Insult Haygarth", "result": "\"Really? You want to see your reflection in the floor? Maybe I should leave it dirty so you wouldn't have to look at your malformed, pathetic excuse for a face,\" you say, as a year of anger is released in a single jab.\n\n\nHaygarth stops suddenly, looking at you. He frowns, looking at the ground behind you, where ironically you've polished the stones enough for him to vaguely look at himself.\n\n\n\"You... you know, you sound just like my mother, or Count Grey. Mean. Cruel. Perhaps it's good you've found yourself serving a man such as the Count. He could be your soul mate, if he had a soul.\"\n\n\nHaygarth hobbles out of the room, leaving you alone. You continue keeping working, but fuck, the floor is pretty clean. You sit down, leaning against the wall as you sigh as your aching muscles get relief. You take a deep breath, as you watch the the sun fall in the distance. After about half an hour, the moon has finally appeared, and Haygarth appears.\n\n\n\"Come. We need to wake Count Grey,\" he says, not looking at you.", "action_results": [{"action": "Follow Haygarth", "result": "You follow Haygarth along the hallways with haste. You hurry down the stairs, quickly heading to the lowest floor, at the center of the castle, into a dark room, empty except for a single, candle-adored coffin leaning against the stone wall, and a large, black sword hanging above the coffin.\n\n\nThe coffin in intricate, a large, black wooden coffin with an intricate, thorny pattern, and a single silver, demonic face with a roaring mouth with a pair of fangs on the front.\n\n\nThe sword, on the other hand, is somehow even darker, its surface seeming to suck the very light from the room. Even staring at the thin edge makes you feel like you've been stabbed. You can practically taste the hatred and malice that emanates from it. \n\n\n\"Do you feel it?\" Haygarth says. \"That is the master of the home.\"\n\n\nYou feel the hairs stand up on your skin. The air tastes stale and rotten, and there's a general feeling of dread emanating from it. In a place like this, you feel even if you called on the good Lord to save you, he would be unable to find your soul in such an abyss of all warm or love, let alone rescue you from it.\n\n\n\"What now?\" you ask.\n\n\nHaygarth grabs your hand, pulling it forward until your hand touches the metal.\n\n\n\"It... stings,\" you say, as it feels like your hand is both being put against a hot stove and a freezing block of ice.\n\n\n\"You'll get used to it,\" Haygarth says, drawing an iron blade from his side. \n\n\nHaygarth presses the blade against your arm, smiling as he slices open your arm, a long, deep cut appearing with a stream of blood.\n\n\n\"Ah!\" you yelp as your arm is covered red. \"Stop!\"\n\n\n\"It's necessary,\" Haygarth replies. \"We need to draw blood.\"\n\n\n\"Did you need to cut so deep?\" you complain.\n\n\n\"I wanted to,\" Haygarth replies, shoving your arm in the silver mouth of the demon, cut first. Blood begins to pour down the creature's mouth, as the coffin's door clicks open. Haygarth grabs you by the collar, pulling you back. Count Grey steps forward. He looks the same as he has every night since the night he took you, except now his lips look parched and cracked, his eyes immediately darting down to your arm.\n\n\n\"Thirst,\" he moans, staring at your wound.\n\n\nHaygarth hits you in the back with a snarl.\n\n\n\"Come on, boy, feed your master!\"\n\n\nYou hold your arm forward, as Count Grey grabs it, his mouth darting down to your bleeding wound with an insane speed. You close your eyes and wait for the pain of his bite, but instead feel his cold lips on your wound, instantly beginning to suck the blood out of your arm. You take a deep breath as you go pale, Haygarth putting your arm around his shoulder to keep you from fainting. After about a minute, Count Grey stops, raising his head as he smiles.\n\n\n\"Good. I was thirsty. The bitch from the other night was dry, and half her blood ended up on the floors. Good thing I managed to stop myself from draining you completely,\" Count Grey says.\n\n\nHe looks up at the sword that hangs above the coffin, staring at it for a second. \n\n\n\"Do you see that sword? While I like to keep up to date with my weapon technology, such as with rifles. grenades and the new and innovative Maxim Gun, in cases of the super-natural, the old stuff is the best. I've had that sword since I was a child. Forged it myself under command of my master. So many ancient, arcane inscriptions, horrid rituals and infinitely worse had to be done to make it the thing it is today. It's name is the Psychí Líptis. It is a killing machine. You will become the same.\"\n\n\nCount Grey s walking past you, and up the stairs. \n\n\nYou stand there, waiting, looking at Haygarth for what to do.\n\n\n\"Follow!\" Count Grey's voice booms.\n\n\nYou quickly hurry up the stairs after him.", "action_results": [{"action": "An Hour Later...", "result": "You sit in the shotgun seat of the coach, as Haygarth continues spurring the horses forward. You're entering the village of Nitchidorf, with Count Grey resting in the back. The carriage's wheels roll into the village, stopping as you enter the village limits. \n\n\n\"Go open the doors for the Count,\" Haygarth says.\n\n\nYou nod, quickly hopping off the carriage. You run to the back of the carriage, opening it as the tall, gaunt Vampire steps out, tilting his head to stare down at you.\n\n\n\"Follow,\" he commands.\n\n\nHe begins walking along the street, staring at each of the houses.\n\n\n\"We must find you a little... playmate,\" Count Grey says, looking at the houses.\n\n\nHe sniffs the air, staring at the houses. His eyes flicker to you, filling you with dread as he licks his lips, still stained with bits of your crimson ichor, looking hungry.\n\n\n\"Ye-yes, master,\" you say, nervously.\n\n\nThe vampire stares at you for a second, before looking away. He seems impatient.\n\n\n\"Yes... I can smell two prominent ones. Tell me, Samuel, what do you think? There's a young one who smells freshly bathed and lemongrass perfume, or one that smells of fresh dough and... terror sweat. It appears the latter one can see us. Which is it, Samuel?\"", "action_results": [{"action": "The first girl", "result": "\"Uh... the... the fi...\" you stutter, tripping over your words as the vampire growls.\n\n\n\"Have I found myself with another fool, a boy with the mind of a mule?\" the vampire says, his long, gleaning white fangs, the corners of his mouth still red with your blood. \"I've had a year out of you. Perhaps it's best to finish you off now.\"\n\n\nCount Grey slowly walks forward, snarling as his fangs poke out, looking like huge spears. ", "action_results": [{"action": "Attack", "result": "You charge forward, but you're a child, and he's an immortal, ancient vampire. He grabs your neck, holding your head high to expose your neck. His mouth immediately shoots forward, biting into your neck as he begins to drain you of your life force. You gasp as your blood is drained, before he drops your dead body to the ground.", "action_results": []}, {"action": "Stand your ground", "result": "You stand your ground, as the vampire grabs you by the throat, lifting you into the air. His grip is tight, strangling you as he snarls, looking you at you with his cold, dark eyes.\n\n\n“I’m going to feel nothing as you die,” he says.\n\n\nYour brain begins to scream from lack of oxygen, as his eyes stare into yours. Your vision gets blurry, as your head begins to pulse with a desire to simply close your eyes and pass out. Suddenly, he releases you from his grip, as he drops you to the ground.\n\n\n“Perhaps… perhaps you’re ready to truly serve. Your life is mine, Samuel. If I decide to break your neck, you’ll lay your head down on the table and have your neck broken, understood?\"\n\n\n\"Ye... yes, sir. Whatever you desire,\" you manage to spit out.\n\n\n\"Good. The rich one, was it?\" the vampire says, smiling. \"Follow me.\"\n\n\nYou quickly begin following, walking along the stone road. You stop at one of the larger brick houses, with a fancy looking brass knocker. Count Grey briefly knocked on the wooden door, waiting. There was a loud noise inside, as the owner scrambled to get ready. The door opened on a chain, with an elderly bespectacled man peering out.\n\n\n\"May I... oh, my...\" the man said, stepping back. \n\n\nCount Grey grabbed him by the throat, tearing the door open as the chain snapped. Count Grey raised the man into the air, tossing him aside.\n\n\n\"Follow,\" Count Grey shouted, as the old man struggled to stand, grabbing a letter opener.\n\n\n\"Stay back!\" he said. \"You stay away from...\"\n\n\nCount Grey let out a snarl, as he bared his teeth, his eyes filling his hunger. The old man meekly dropped the letter opener, stepping back. Count Grey walked forward into the house, sniffing the air. With a quick kick, he smashed the door open. You stood behind him, watching as a young girl barely into her teens lies, wearing a night gown. From the wet path on both the gown and the sheets she's curdled up in, it appears she's peed herself. \n\n\n\"Ah... so fresh... so young... so delicious,\" Count Grey says.\n\n\nThe girl screams for her grandfather, but Count Grey simply grabs her by the hair, in a quick jerk ripping her from the bed. Count Grey walked along the hallway, dragging her towards the coach. You follow, passing the disgraced looking grandfather.\n\n\n\"Grandpapa! Grandpapa!\" the girl screamed, as her father just looked down, ashamed.\n\n\nCount Grey dragged her into the coach, throwing her into the back, before locking it. He motioned for you to follow.\n\n\n\"It's a beautiful night. The moon's full in the sky. I need to... negotiate with a few of the beasts of the night. I shan't be long. When to the West the honorless dogs create endless machines of war and to the East our enemies have endless' souls to give, we could always use more allies, yes?\"\n\n\nYou nod slowly, as the Vampire slides his coat off his gaunt frame, holding it out. You stare at it, before realizing he wants you to take it and grabbing it.\n\n\n\"Take the girl back to the castle. Detain her. Then, await my return.\"\n\n\n\"Yes, sir,\" you respond, as your master turns away, strolling off into the night. ", "action_results": [{"action": "Head back to the castle", "result": "You walk towards the shotgun seat, climbing up to sit next to Haygarth.\n\n\n\"The girl is alive and in my coach, yet the master is not. What happened?\" he asks.\n\n\n\"Count Grey is hunting. You need to take me and the girl home.\"\n\n\n\"What's to become of the girl? Is she a blood bag, or a new apprentice?\" Haygarth asks, raising an eye. \"Neither would be particularly surprising.\"\n\n\n\"I don't know,\" you admit.\n\n\n\"So be it,\" Haygarth replies.\n\n\nYou put your head against the back of the coach, and close your eyes as you head towards the castle.", "action_results": [{"action": "An Hour Later...", "result": "The coach enters the castle gate, as you climb off the coach. Haygarth lowers the portcullis, as you go to the back to open the coach. The girl sits there, staring at you in terror.\n\n\n\"Get out,\" you command.\n\n\nThe girl nods, crawling ahead as she gets out of the coach. You grab her by the wrist, leading her along to the coach. She doesn't talk, seemingly in shock. She doesn't say a word, instead staring at you in terror. You wonder if you should try to converse, to calm her, or keep unemotional and professional about this issue.", "action_results": [{"action": "Talk to the rich girl", "result": "\"So, do you have a name?\" you say.\n\n\n\"Yelena,\" she says, struggling to even talk.\n\n\n\"My name's Samuel.\"\n\n\nYou walk on for another few seconds of silence, as she looks at you, her face pale.\n\n\n\"Am I going to die?\" she asks.\n\n\n\"You...\" you begin to say, before she stares at you, trying to see if you're lying. \"I don't know. I'm sorry.\"\n\n\nShe nods.\n\n\nYou show her down the stairs, before leading her into a prison cell. You lock the cell door, staring at her from behind the bars. She stares blankly ahead, leaning against the wall and sliding down to lean against it, her nightgown now covered in mud and dirt.\n\n\nYou leave her there, now secured, and end up heading to bed for a few hours sleep before Count Grey arrives back.", "action_results": [{"action": "Sleep...", "result": "You awake to the prick of fangs against your neck. You don't move, taking in a deep breath.\n\n\n\"You looked so... so appetizing. Let's go. We need to finish the last stage of your path towards becoming a true apprentice.\"\n\n\nYou nod, standing. You make your way down to the prison cell, where the girl still waits. She looks up, terrified.\n\n\n\"What... what is to be done with her?\" you gulp.\n\n\n\"She is food. Learn that fact,\" your master says. \n\n\nThe vampire draws a long dagger from his side, handing it to you.\n\n\n\"If you're going to be my Ghoul, you need to prove you're capable of preparing my food. Kill her,\"\n\n\nYou hold the knife, staring at it as the girl begins to cry. You notice from the wet patch growing on her nightgown, she’s pissed herself once more.\n\n\n“Kill her. She’s weak, you’re strong. Slice open her throat, so I can feed,” Count Grey commanded.\n\n\nThe girl breaks into sobs as Count Grey opens the cell door, swinging it ajar and motioning for you to enter. You nod, walking forward with the knife held tightly in your hand.", "action_results": [{"action": "Kill her", "result": "You step forward, into the cell. You close your eyes, moving forward as you grab the girls’ head. You hold the knife to her throat as she struggles desperately, her fingernails scratching at your face. You stab her through the throat, directly through the main vein. She collapses, shuddering as blood spurts out and begins to run down her neck, staining her hair crimson. You feel like bursting into tears, but you know to show weakness would be to end up like her… if you were lucky.\n\n\n“Good,” Count Grey says, tossing a rag forward. “Hold it against her neck to stem the bleeding, and then pick her up and follow me.”\n\n\nYou grab the girl, holding the rag tightly against the wound to stem the bleeding. You lift her over your shoulder, standing up. You follow Count Grey along the hall. Soon, you find yourself in front of a large, wooden door. Haygarth has forbidden you from entering, which only mean that you had one less room to clean. Count Grey pulls a short, silver key from his pocket. He opens the door, revealing a massive storage room. The room is filled with cabinets and shelving units. They’re all filled with crystal bottles, filled with a scarlet red ichor.\n\n\n“This castle was built to withstand a siege. It’s storerooms could keep a force here going for years with wheat, potatoes, salted meats and more, as well as small gardens. Unfortunately, I require a more… delicate solution to avoid starving.”\n\n\nYou look at the endless bottles of blood, wondering how many lives were given to fill them.\n\n\n“It’s quite hard to successfully bottle blood. Let alone hard hard it is to get it from the victim without a needle and a few hours. You’ll need to get quite good at that.”\n\n\n“You want me to kill people and bottle their blood?” you ask.\n\n\n“Yes. Not just anyone. Virgins, particularly. Once they’ve lost that, their blood’s impure, and will spoil quickly enough outside the body. After that, you’ll need to keep it around for a few days, make sure it doesn’t spoil.”\n\n\n“I thought you said virgin blood doesn’t spoil.”\n\n\n“It doesn’t, but in this day and age, it’s so hard to tell. I always struggle to pick out my targets. I want them to be young enough to be a virgin, but still old enough to… well, perhaps from the morality my tribe taught me oh so many years ago, I don’t want to kill babies, or children that young. I’m perfectly willing to, mind you, but I don’t find it necessary when there are so many other potential blood bags. Even then, you can never be sure. You always have some human filth so enamored with mortal concepts like sex that they end up defiling children. You’d be surprised by how young I’ve found my victims to be, yet still spoiled. Oh, they say power corrupts, but it just lets people be who they are naturally. Perhaps some day, we’ll see who you are at heart.”\n\n\n“Does… does it have to be children?” you ask. “What about someone like… the Catholic priests in the village?”\n\n\n“Ha! I’d be able to find more virgins among the girls at the whore house then at the church!” Count Grey says, laughing. His laughter is… unnatrual. Even though you understand the context to the joke, you still somehow feel as if he’s laughing maniacally since he’s got you at his mercy, which you suppose he does.\n\n\nYou weakly smile, before the weight of the dead girl over your shoulders becomes too much and you lower her onto the cold stone floor, keeping the now red, sticky rag pressed against her wound.\n\n\n“Ah, yes. We’re wasting time,” he says.\n\n\nCount Grey grabs a crystal bottle, handing to you.\n\n\n“Move the rag, and replace it with bottle. Fill it,” he says.\n\n\nYou take the bottle and remove the rag, quickly pressing the bottle against the bleeding wound, as blood continues to flow into it. You take effort not to look at the girl’s face, watching as the bottle is slowly filled.\n\n\n\"The heart is a tremendous organ, isn’t it?” Count Grey says, licking his lips. “So… fresh. So… delicious.”\n\n\nThe vampire snarls, taking a deep breath. For a second, his face contorts into a combination of that of a starving man willing to break any moral code to feed his hunger, that of a hate-filled demon knowing nothing other than the negative emotions that plague the depths of man’s soul, as well as that of a beast, knowing only hunger. You step back, almost knocking over a rack of bottles, before Count Grey pauses.\n\n\n“Don’t worry, little one. It’s just that staring at the blood makes me so, so thirsty. I’d imagine you’ll be able to fill up a lot more bottles than I, seeing as you won’t be tempted to down the bottle you’re filling at any given moment.”\n\n\nCount Grey takes the bottle, pouring a small amount into an ornate wooden bowl, before capping the bottle with a crystal stopper.\n\n\n“No, we test. You get this little box,” he said, grabbing an oak box from the cabinet, and opening it to reveal various things.\n\n\nCount Grey draws out a long tooth, seemingly from a vampire. It looks to be a curved, deadly sharp fang.\n\n\n“This belonged to Elise the Skin-Taker. You need to drop the fang in the bowl, and leave it there for three days. If the tooth is no different, put the tooth back in the box and put the bottle with the others. If the tooth has turned black, dump out the blood and wash out the bottle. Then, use a blade to scrape of the rotten outside, and put the rest, the tooth that's not rotten, back in the box. Be careful. A tooth can only last two or three of these, and I only have so many. Getting more takes another trip to the wilder regions and find a maddened, bestial vampire without reason or logic, a bandit who has found himself with the gifts of the blood moon or some aspiring Vampire who wishes to be a count.\"\n\n\nCount Grey puts the bottle on the stone table, next to the bowl.\n\n\n\"You've prepared your first bottle, little one. You'll prepare many more. You've proven yourself tonight. Now, your job changes. Follow me,\" he says.\n\n\nCount Grey walks along the hallways, stopping at a small, wooden door that again has remained locked during your stay here. He opens it with the same key, before handing it to you.\n\n\n\"Here. This is your new room,\" he says, opening the door.\n\n\nIn stark contrast with your last room, a simple tiny bed in a barren room, this one is surprisingly less furnished. A desk and chair stands there, a mirror, a wardrobe and a large bed. A gun rack sits by the single window, with two rifles and a shotgun in it.\n\n\n\"Thank you, thank you master!\" you say.\n\n\n\"Open the wardrobe,\" Count Grey commands.\n\n\nYou walk forward, opening the wardrobe. Inside is a pair of black leather boots, black trousers, a black shirt, a dark red leather long coat and belt and a dark red tri-corner hat.\n\n\n\"Put it on,\" Count Grey commands. \n\n\nYou quickly get undressed, as Count Grey stares, bored, at the wall. You get dressed into the outfit, turning to look back at your master.\n\n\n\"Yes... it fits well. Kneel, dog,\" the vampire says.\n\n\nYou drop to your knee, bowing your head low. You look up at Count Grey, who raises his arm to his mouth. He bites it, releasing a flow of blood that runs down his hands. He holds it out, staring at you expectantly.\n\n\n\"Drink,\" he commands.\n\n\nYou look at the burgundy liquid running down the vampire's arm, in stark contrast with the white, ghastly skin. You put your mouth to the wound, and begin to suck.\n\n\nThe liquid is like a poison. Your skin begins to tingle, as you feel drowsy. You try to pull your head away, but the vampire holds it in place.\n\n\n\"Drink!\" he commands aggressively.\n\n\nYou keep drinking the cold liquid down, as your stomach begins to churn. You feel like you're about to collapse into a coma, as the blood seems to drain your life source. Finally, Count Grey lets you pull your head back.\n\n\n\"Rise, ghoul,\" he commands.\n\n\nYou stand, trying not to puke. You look at Count Grey, who raises an eyebrow.\n\n\n\"Are you going to vomit, child?\" he asks.\n\n\nYou feel the puke rise up in your throat, but hold it down, shaking your head.\n\n\n\"Well done,\" he says. \"Now, you're a ghoul. No longer will you work like a slave with Haygarth. You will hunt for me when I am busy. You will scout and pick out potential prey. You will guard the castle. You will be a true minion.\"\n\n\nYou nod, eagerly. \n\n\n\"I... am yours, master,\" you say.", "action_results": [{"action": "Three Years Later...", "result": "You sit in the shotgun seat of a carriage with Haygarth at the reins. It's been a long journey. You have to venture to meet with King Ferdinand I in order to arrange taxation laws and other things you haven't been educated well enough to understand. You're finally entering the territory under Count Grey's control, staring out at the village you're entering as the sun falls in the distance.\n\n\n\"Stop here,\" you say. \"I want to grab a bite to eat.\"\n\n\n\"We must be home soon!\" Haygarth says. \"Count Grey's in the back, he might wake up soon. Sun's almost gone.\"\n\n\nYou're hungry, thirsty and you've been traveling for the past three days. There's no way in hell you're going back to the castle for Haygarth to cook up his famous soup, which you're certain he's literally shitting in. ", "action_results": [{"action": "Attempt to convince Haygarth to stop", "result": "\"Haygarth, be fair here. Do you really want to go back to the castle to have to cook for us? We could quickly get some grub, some drinks, and then head back to the castle. Right?\"\n\n\n\"Don't like leaving carriage. There's always pointing, laughing, staring,\" Haygarth says, pulling his balaclava up to the bridge of his nose. \"Fine. I'll pull in. You go eat. I'll wait here, eat something when I get home,\" he says.\n\n\nThe carriage pulls in alongside a tavern, as you look to Haygarth, who looks fairly pathetic as he attempts to cover his mishapen form.", "action_results": [{"action": "Enter the tavern", "result": "You walk inside the tavern by yourself, feeling the weight of your Leu-filled wallet in your side pocket. You walk along, and immediately garner the attention of everyone in the bar. Your garb makes it immediately clear to anyone but the most ignorant or simply stupid of the peasants that you're a servant of Count Grey. The tavern quickly clears out, heading to their various homes, leaving only a few idiots too old and stubborn or young and cocky to realize staying near you is death. \n\n\nYou toss a crumpled note on the counter, looking up at the bar tender expectantly. Soon, you find yourself drinking a pint, a plate of chicken, boiled potatoes and cabbage in front of you. You smile, eating it up eagerly, downing the pint in a few gulps. You belch loudly, smiling as you find yourself now filled with food, warm and content.\n\n\n\"Where's the bathroom?\" you ask, feeling the need to piss rising as your full bladder demands you act.\n\n\n\"Bathroom's broken. Go outside,\" the bar-tender replies.\n\n\nYou raise an eyebrow, tapping on your hat.\n\n\n\"Do you know who I am? Who I work for?\" you ask.\n\n\n\"I do. If he shows up here, I'm as happy to show him the broken toilet as I am you.\"\n\n\nYou sigh, standing and walking outside into the alley. You unzip your trousers and pull out your dick, pissing onto the side of the old building.\n\n\nSuddenly, the cold blade of a knife is pressed against your throat.\n\n\n\"Don't move,\" a deep voice whispers. \"Hands in the air.\"\n\n\n\"Do you expect me to let go of my dick and piss on myself?\" you ask, more annoyed than scared.\n\n\n\"Finish up,\" the voice says.\n\n\nYou finish pissing, popping your genitalia back in your trousers, buttoning it up, and slowly turn to face your attack. Two teens, barely fifteen by the looks of it, both with short blond hair, one skinny, on large and muscular, stare at you. The skinny one holds a pistol, while the big one holds the knife pressed against your throat.\n\n\n\"What's this about, gents? Revenge?\" you ask, knowing just how many family's want your blood for taking their daughter's.\n\n\n\"What? We don't know you,\" the big one says. \n\n\n\"The wallet. Now,\" the skinny one says.\n\n\nYou pause, frowning.\n\n\n\"Are you seriously fucking telling me you've decided to mug me?\" you ask, surprised.\n\n\n\"Why the fuck wouldn't we?\" the big one asks, pushing you against the wall as the skinny one draws his own knife with his left hand, strolling forward to press the barrel against your temple.\n\n\n\"Wallet. Now,\" he says.\n\n\n\"Fucking idiots. You don't recognize the outfit, eh? I'm a fucking Ghoul, Count Grey's personal assistant.\"\n\n\nThe big one looks at the skinny one nervously.\n\n\n\"Maybe we should let him go,\" the big one asks.\n\n\n\"He's bluffing,\" the skinny one says, licking his lips. \"Ghouls... ghouls are rotten, aren't they?\"\n\n\n\"The sun's down, boys. Count Grey's due to wake...\"\n\n\n\"Shut it! Wallet, now!\" the skinny one commands.", "action_results": [{"action": "Buy time", "result": "\"Do you know how dangerous the count is? He'll drink you dry, his fangs'll prick...\"\n\n\n\"Shut it!\" the skinny one says.\n\n\n\"Let's just go,\" the big one says.\n\n\n\"First, the wallet!\" the skinny one says.\n\n\n\"I think I can hear Count Grey. He's co...\" you say, before you're interrupted by the skinny one pulling the trigger, covering the wall with your brain matter.", "action_results": []}, {"action": "Attempt to negotiate", "result": "\"Look, you take my wallet, Count Grey's going to feel disrespected. Best case scenario, he sends me out with a rifle to track you down and...\"\n\n\n\"Shut it!\" the skinny one says.\n\n\n\"Let's just go,\" the big one says.\n\n\n\"First, the wallet!\" the skinny one says.\n\n\n\"Worst case, Count Grey comes after you personally. He'll...\" you say, before you're interrupted by the skinny one pulling the trigger, covering the wall with your brain matter.", "action_results": []}, {"action": "Give them the wallet", "result": "You hand over your wallet, giving them the finger as you do.\n\n\n\"Thanks,\" the skinny one smiles, grabbing it from your hand as he smacks you in the head with the gun, knocking you to the floor.\n\n\n\"What are you doing?\" the big one asks. \"We don't need to kill him! We got the wallet!\"\n\n\nYou look up to see the barrel of the gun pointing directly at your head.\n\n\n\"You heard what he said. He's with the count. If we kill him now, the count won't come after us!\" the skinny one knows. \"He's seen our faces.\"\n\n\n\"He doesn't know our names,\" the big one says.\n\n\n\"I'm Lucas. That's Mikhail,\" the skinny one said.\n\n\n\"What the fuck!?\" the big one, Mikhail replies.\n\n\n\"We have to kill him. Now even you'd agree to that,\" Lucas says.\n\n\n\"Always kill your prey. You don't want to let them come back and bite you in the throat,\" a voice says.\n\n\nCount Grey steps from the shadows, his teeth curved in a grin, his fangs prominent. He grabs Lucas' gun arm, twisting it until Lucas drops the gun. Mikhail charges with a knife, but with a quick, well-planted punch to the chest sends him to the floor, badly winded. You stand up, grabbing the gun as well as drawing your own, pointing one at each of the thieves.\n\n\n\"What, are you some fucking cowboy with your guns? Shoot, come on!\" Lucas says, even though his bottom lip is quivering.\n\n\n\"Tell me, Samuel. How did they manage to jump you?\" Count Grey asks, tracing a finger down Lucas' nose.\n\n\n\"I was pissing,\" you admit.\n\n\n\"Hmmm... tell me, where is your family?\" Count Grey asks, turning his attention to the teens.\n\n\n\"Dead,\" Lucas answers.\n\n\n\"Well then, you've shown balls, willingness to kill and the ability to ambush. Perhaps... Samuel, you were the one mugged. What happened? Were you behaving stupidly and ambushed by some lackluster fools, or are these two deserving of becoming ghouls?\"", "action_results": [{"action": "Suggest the teens become ghouls", "result": "\"They have potential,\" you admit.\n\n\n\"Young men, I'll give you a choice. I could kill you now, drain your blood and return to my castle for the night.\"\n\n\n\"What's the other option?\" Mikhail asks.\n\n\n\"Join me. Let me take you on as my... apprentice. As my servant. As my slave. As whatever I need you to be. In exchange for your servitude, I offer your life.\"\n\n\n\"Jesus, do you have that memorized?\" you mutter, under your breath.\n\n\n\"I'm in,\" Lucas says immediately, as Mikhail pauses, before nodding in agreement.\n\n\n\"Perfect,\" the vampire smiles. \"The coach is full. You'll walk behind it. No breaks. No time to pack. Immediately. If you're too pathetic for that, you might as well die of exhaustion.\"\n\n\nWith that, Count Grey walks off, and you eagerly follow.", "action_results": [{"action": "Three Years Later...", "result": "You watch as the Twins hold the two girls in front of you, knives in their hands. Count Grey stands to your side, watching intently.\n\n\n\"Do it,\" Count Grey commands.\n\n\nMikhail takes a deep breath, stabbing the girl in the throat. He closes his eye as the girl twitches, blood spurting out as he slices through her throat.\n\n\n\"Help...\" the girl gurgles, blood filling her throat, before he head drops to the side.\n\n\nLucas looks at his master, before down at the girl. He presses the knife to the girl's wrist, slicing it open. As the girl screams, before he wraps his left arm around her throat and beginning to strangle her to prevent her from screaming.\n\n\n\"What are you doing?\" Count Grey asks, more curious than angry. \n\n\n\"If she's left alive, the heart keeps pumping. More blood will spurt out for you to consume,\" Lucas says, as the girl sobs desperately.\n\n\n\"Interesting,\" Count Grey says. \"Grab your blood bags and follow me. Samuel, no need to see this. You've filled countless bottles.\"\n\n\n\"Yes, sir,\" you reply.\n\n\nYou walk away, walking to the bedroom, lying down in the bed. You rest your head against the pillow, and drift off to sleep.\n\n\nYou awaken about an hour later, with Count Grey staring at you from the doorway.\n\n\n\"Yes?\" you ask nervously.\n\n\n\"There's going to be some changes in this castle, understood? Now that we have three ghouls. You and the others will extend our power. First, it's important you should know. I'm not the only vampire.\"\n\n\n\"I know,\" you reply, confused. \"We've fought rival Vampires, hunted those that went feral with bloodlust, taken out vampiric bandits...\"\n\n\n\"I mean,\" Count Grey says, annoyed by the interruption. \"That I'm not the only vampire on our side. You're family with the three vassal vampires that run the various subsections of the region, yes?\"\n\n\n\"Yes,\" you reply. \"The Draven Family House, the Alexa Family House and the Mihrab Family House.\"\n\n\n\"Not exactly. These are not the names of families. They're the names of individuals. I have three vampires under by control, acting as my lieutenants. Their names are Draven, Mihrab and Alexa.\" \n\n\n\"Are they threats?\"\n\n\n\"No. You just need to know of them. If needs be, you'll kill one someday. Maybe all three. Understood?\"\n\n\n\"Yes, sir,\" you reply.\n\n\n\"Good. Train and drill with the Twins more. You'll need to become a better fighter. Now, sleep.\"\n\n\nWith that, Count Grey closes the door, leaving you in the dark room.\n\n\nJust knowing Count Grey has constant access to you prevents you from sleeping. ", "action_results": [{"action": "Three Years Later...", "result": "The coach drives down the road as the sun begins to fall from its high perch in the sky.You breath in the cold air, as Haygarth drives the horse forward. You take a cigarette from your pocket, lighting it with a match. You breath in the smoke, closing your eyes as you feel it fill your lungs, before exhaling.\n\n\n“Pass it over,” Mikhail says, reaching a gloved hand forward to grab at the cigarette from inside the coach.\n\n\n\"Haygarth? How far?\" you ask.\n\n\n\"We're here,\" Haygarth mutters. \"Yes, yes, we're here.\"\n\n\nThe coach pulls up to the side of an old brick tavern, the Raven's Quill.\n\n\n“Is he late?” you ask. \"What time is he supposed to be here?\"\n\n\n“Five-ish,” Mikhail says, opening his pocket watch. “It’s five now.\"\n\n\n\"He’s late,” you say.\n\n\n“He said five-ish. That could be another hour, knowing Lucas,” Mikhail says.\n\n\nYou nod, and turn to look at your companion.\n\n\nMikhail is an even uglier creature. The man is 6’4, hunched up in the back seat. His muscles bulge, easily filling the extra large jacket. His nose has clearly been broken a dozen times over, his face looking similar. He looks like a shaven ogre, and although quiet, he’s been quite a sweet man despite his line of work.\n\n\n“He’s here,” Haygarth says.\n\n\nMikhail goes through his jacket pocket, as Lucas opens the side door of the coach. He looks angelic, like a grown-up Cherub, with blond hair, rosy cheeks and a flashing smile. A woman is at his side, a little younger than you.\n\n\n“Brother, thank you for the lift!” Lucas says. “This is Dasha. I really think she’s a special one. Hop in, darling.”\n\n\nDasha smiles nervously, getting into the car. She extends a hand to Mikhail, smiling.\n\n\n“Hi, I’m Dasha. pleasure to meet…” Dasha says.\n\n\nMikhail grabs Dasha’s head, quickly covering her mouth with his massive hand. He pours the bottle in his hand out onto a rag, soaking it, before pressing it tightly against her face. She lets out a muffled scream before slowly beginning to stop struggling. Soon, Dasha goes still. Mikhail props her up, and Lucas climbs into the carriage. \n\n\n“She was a real bitch. Always saying she should stay with her friends, or tell them where she’s going, or offering to pay for a hired coach home. If someone like that gets someone like me, they should just keep their fucking mouth shut,” Lucas complains.\n\n\n“Clearly she shouldn’t have,” you point out.\n\n\n“Whatever,” Lucas says, grabbing the cigarette and fumbling through his coat pocket for some matches.\n\n\n“How long will that last?\" you ask in reference to the chloroform.\n\n\n“Six hours, give or take,” Mikhail says.\n\n\n“How long to the castle?” Lucas asks, lighting the cigarette.\n\n\n“Three,” Mikhail says.\n\n\n“Four, yes, yes, definitely four,\" Haygarth says. “The roads are icy.”\n\n\n“Fantastic, let’s get the fuck out of here,” Lucas says.", "action_results": [{"action": "Four Hours Later...", "result": "The coach drives inside the huge gates of the huge castle, as the sky turns gold and twilight fills the world with a beautiful feeling of serenity. The coach pulls into the stables, where Haygarth immediately gets to work with the horses. Mikhail opens the coach door, putting Dasha over his shoulder and walking towards the keep. You follow him, as does Lucas, walking alongside him as Dasha stirs with a groan, but doesn't break her slumber.\n\n\nYou walk into the keep, and quickly down to the dungeons. The large dungeon is covered with an earth floor, and four occupied cells. Four women, all of similar age and appearance to Dasha, all whose names you've forgotten, are there. Their mouths are gagged, though they scream desperately as they see you enter. Mikhail mutters a curse under his breath as he tries not to make eye contact with the women, but Lucas smiles and cheerfully waves at women. Mikhail carries Dasha to an empty cell, opening it and laying her gently on the cot inside. He locks the cell behind him, and looks at you both.\n\n\n\"The sun is down. Should we wake him?\" Mikhail asks.\n\n\n\"Leave him. It's late. We'll wake him in an hour,\" Lucas says.\n\n\nYou nod, turning and walking away from the twins. You head up the stone staircase towards the kitchen. Despite the fact that this building is around a thousand years old, it's surprisingly well furnished. Count Grey has kept the house furnished with modern technology, one of the bonuses of controlling a tiny pocket of land and resources. As long as King Carol I got his taxes, he left Count Grey do as he pleased.\n\n\nYou open a cabinet, taking out a somewhat stale sugar cookie and biting into it. You make yourself a sandwich from cold meat, nuts and dates, and quietly consume it, while watching as the world blackens. Just as you see the first red haze on the horizon of the rising blood moon, you quickly turn and head quickly down to the Count's chambers. You hurry down the stairs, quickly heading to the lowest floor, at the center of the castle. Mikhail is already waiting in the dark room, empty except for a single, candle-adored coffin leaning against the stone wall.\n\n\nThe coffin in intricate, a large, black wooden coffin with an intricate, thorny pattern, and a single silver, demonic face with a roaring mouth with a pair of fangs on the front. You can feel the dark feeling emanating from it. It makes you feel cold just looking at it, and you shudder at the thought of what lies inside. Nonetheless, it is your duty to awaken your master.\n\n\nLucas hurries into the room,, dropping his cigarette and crushing it under his heel. He looks at both of you.\n\n\n\"Oh good, we're all here. Let's do it, shall we?\" Lucas says.\n\n\n\"Which one of us wakes him tonight?\" you say.\n\n\nLucas smiles, holding up his bandaged wrist.\n\n\n\"I did yesterday.\"\n\n\nMikhail shows you the two-day old cut on his upper arm You draw your dagger, pressing it against your forearm and gently slicing it open. You take in a deep breath as you feel the sharp pain. Blood pours down your arm, and your press the open cut into the roaring mouth of the silver ideal, smearing it with blood. You count to three, before leaning in.\n\n\n\"Glorious Master, the night has come and the world is yours,\" you whisper.\n\n\nYou step back as the coffin door is pushed open. Inside stands the Count. Dried blood cakes the corners of his mouth, as he lets out a growl, flashing his long, curved fangs, that look sharper than a needle. His black, soulless eyes peer into yours, as you take a deep breath. You outstretch your arm, and he walks forward, grabbing you by the wrist. He brings your arm to his mouth, and begins to suck. He sucks the blood that pumps from your cut as you wince, before releasing you. Mikhail hands you a roll of bandage, which you quickly begin wrapping them around your wound. Count Grey walks away from you, strolling towards the lounge. He walks up the stone stairs, before heading to the glass window. He stares out at the darkness, and the rising red moon.\n\n\n\"Good... good...\" he says. \"Prepare altar. The Viceroys will be here soon.\"\n\n\nYou nod eagerly, and quickly head down to the dungeons, followed by the others. The gagged woman are in the cells, curled up and terrified. Dasha is still unconscious, which gives you pause.\n\n\n\"The new girl, Dasha, look at her,\" you say.\n\n\n\"What of her?\" Lucas asks.\n\n\n\"She's still not awake. Maybe you used too much chloroform, Mikhail,\" you say.\n\n\n\"No, I used the normal amount. Maybe she had a medical condition,\" Mikhail says.\n\n\n\"Who the fuck cares?\" Lucas asks.\n\n\n\"What if she's dead? We'll be one victim short? Do you want to be the sacrifice?\" you say.\n\n\nLucas pauses, opening the cell and walking towards her. He drops to his knee, putting a hand against her chest.\n\n\n\"She's breathing. Just unconscious. The idiot must've used too much chloroform. She's alive, she'll do, alright?\"\n\n\nMikhail shrugs, slinging the girl over his shoulder. Lucas opens the two other cells, grabbing the women inside and pulling them along by their hair. The girls are shackled, so they're incapable of struggling much, but any resistance leads quickly to a punch to the side of the head.\n\n\n\"Samuel, get the last two!\" Lucas shouts.\n\n\nYou grab the cell keys, walking over. One of the girl stares at you with rage, the other sits in the back corner in terror. You open the scared girl's cell first, grabbing her by her chain. You drag her out of the cell, before opening the second cell and grabbing the more resistant girl.\n\n\n\"Don't fight me on this. You're not going to win this, and I don't want to hurt you,\" you say.\n\n\nYou pull on the second girl's chain, but she plants her feet down and stares at you.", "action_results": [{"action": "Hit the girl", "result": "You swing your fist, smashing into the side of the girl's head, as she crumples to her knees. She lets out a pained moan through her gag, and as blood trickles down the side of her face, her eyes fill with fear. You pull on her chain again and she follows. You quickly lead the two along the hallway, before up the stairs, into the \"church\". You hear Count Grey's dark, cold, emotionless voice from the main hall.\n\n\n\"Welcome, Viceroys. Did you decide to come together, or simply met on the road here?\"\n\n\n\"Coincidence, my lord,\" another far deeper voice booms, one more filled with malice and hatred than Count Grey's.\n\n\n\"Good, good. Haygarth!\" Count Grey shouts.\n\n\n\"Yes, yes master?\" Haygarth's voice comes back from the stables.\n\n\n\"Come, fetch the Viceroy's coats!\"\n\n\n\"Yes, yes sir!\" Haygarth says, quickly hurrying to them.\n\n\nYou turn your attention back to the task at hand. In front of you in a large, open stone room. Groves cover the stone floor, making the shape of a large pentagram. Lucas' two prisoners are kneeling at two of the points of the pentagram chained to a loop in the stone to prevent them from moving, while Dasha lies at the third, her unconscious state meaning she doesn't need to be chained up. \n\n\n\"Come on,\" you say, raising your fist to threaten the second girl. You force her to kneel on the ground and chain her to the loop in the ground. You drag the first girl to the other, doing the same.\n\n\nMikhail and Lucas stand off to the side, watching them. Mikhail looks down, looking vaguely embarrassed at his part in this. Lucas, however, seems ecstatic. He walks forward, grinning as he draws his dagger.\n\n\n\"Oh boy, look at that!\" he says, dropping to his knees in front of a girl. \"Look at that. You see the pentagram? You see those deep, thick groves? I'm going to fill them with your blood. You like that? You ready?\"\n\n\nThe girl frantically begins to struggle, as Lucas smiles. Lucas slices the girl's throat open, as blood pours out, flooding into the grove and running along. The girl gurgles as blood pours through her throat, and Lucas lets the head fall to the ground over the grove, letting the blood pour out into it.\n\n\n\"Mikhail, come on, we need this ready for the Viceroys and Count Grey!\" he says.\n\n\n\"I am not a butcher,\" Mikhail says softly, as Lucas' eyes narrow.\n\n\n\"Don't fucking take the high road. You drugged every whore here, knowing it was all so we'd slit there throats here. You're as much a murderer as I am.\"\n\n\nMikhail looks to the ground, opening his mouth as if to say something, but closing it just as quickly.\n\n\n\"That's what I thought. Samuel, grab your knife, let's get to work.\"", "action_results": [{"action": "Join in", "result": "You sigh, drawing your knife as Lucas smiles.\n\n\n\"If you're going to lead to someone's death, at least have the fucking balls to be the one who uses the knife,\" he says.\n\n\nLucas walks over to the next girl, as you walk up to one. She tries to struggle, but you grab her by the hair, holding her vulnerable throat out and slicing it open with a long cut, before slowly lowering her head to above the grove. Lucas grabs the next girl by the hair, holding her forward and quickly slashing her throat as the blood pours out. You walk to the next one, quickly driving the sword through her neck, slicing open her fleshy throat and letting her bleed into the groove.\n\n\n\"Watch them die, Mikhail. You choose for this to happen. Whether you want to actually hold the knife or watch, you're a fucking monster. We all are. At least, we're willing to fulfill our role.\"\n\n\n\"Lucas! Mikhail! Samuel! Come down here!\" Count Grey asks. \"Quickly!\"\n\n\n\"We need to go,\" Mikhail says, quickly turning and heading towards the door.\n\n\nYou quickly hurry towards the main hall, walking down the spiraling stairs. Count Grey stands there, alongside his three Viceroys, and Haygarth rushing to put away coats.\n\n\nViceroy Draven is a tall,well-muscled man. He has long, curly black hair, and instead of the black attire of the other three, he instead dons  steel plated armor which covers  him from the neck down.  A sword hangs by his side. From what you know, he's almost five hundred years old, once being and most likely still remaining a formidable warrior. He looks at you, his eyes narrowing as he stares at you. He lets out a low, guttural growling at the sight of you. Even after years of work around Count Grey, the man manages to make you feel like little more than a blood bag.\n\n\nThe second, Viceroy Mihrab, is even older, almost as old as Count Grey. His skin seems unusually tight,  a light brown in complex, his face sunken, his eyes lacking any emotion whatsoever. He wears dark attire, his eyes glancing in your direction away for a second, before peering away with disinterest. He doesn't appear to be armed, but with the long, sharp fingernails on his hand that at that length qualify as swords as well as long fangs, he doesn't need them.\n\n\nThe final Viceroy, Alexa, is the only woman of te group. She wears a black hooded cloak, her pale, scarred face underneath, with unnaturally long fangs even for one of her kind to halfway down towards her chin. She leans against the wall, looking at you without a single noise. She stares at you like a starved wolf. Something tells you that of all those present, she's the biggest threat. \n\n\n\"Yes, master?\" Mikhail says, standing up straight.\n\n\n\"Werewolves spotted on Hangman's Trail,\" he says. \"They're amassing. Perhaps for a strike.\"\n\n\nYou pause, and can hear the distant howls of what lies between monsters and men.\n\n\n\"We'll push them back, sir,\" Mikhail nods. \n\n\nMikhail turns away, and quickly begins heading to the armory. You follow, and you all quickly descend the stairs to the armory. You walk inside, grabbing a padded leather duster and slinging it over. You grab a rifle, as well as several magazines of silver bullets, popping them in a satchel that you put over your head. \n\n\nNow suitably armed, you grab a lantern, walking out towards the main hall. The Vampires have left, no doubt to partake in some drinks, discuss future plans, before beginning the ritual and, imbued with a power that grows as the blood moan rises, slaughtering dozens of helpless villagers.\n\n\nYou walk out the hall doors, pushing the door open and entering the dark night. You walk along the earth, passing the gate, which for some reason has been left open, one of the Viceroy's carriages sitting under the raised portcullis.\n\n\n\"Should we move it so we can drop the portcullis?\" you ask.\n\n\n\"And piss off Count Grey and whoever owns this carriage? No fucking chance,\" Lucas says.\n\n\nAs you leave and wander off into the trees. Soon, the only sound is the crunching of leaves under foot and your breathing.\n\n\n\"Control your breathing. Deep breaths. Watch your foot placement as well as the path in front of you. Avoid twigs and try leaves. We're trying to hunt, best be quiet about it,\" Lucas says. \"The man's most definitely untrustworthy and cruel, but he knows how to hunt.\n\n\nYou take his advise, holding the lantern out to illuminate the path ahead. You see a shape move to your right, and stop, immediately twisting to aim.\n\n\n\"Contract, left side!\" you whisper.\n\n\n\"Just a deer, stay focused!\" Lucas whispers. \"This is a fucking hunting trail, of course there's deer around!\"\n\n\nYou keep moving, you gun raised in your one hand, propped in the crook of your shoulder to allow you to aim. \n\n\nThe beam of your light comes across a deer lying on the ground. It's belly has been ripped to shreds, entrails covering the earth around it and soaking it with bodily fluids. It's head, connected to its body by a few strands of sinew and muscle, lies in the grass at the edge of the path, two lifeless eyes staring towards the stars. \n\n\n\"It's fresh, look out!\" Lucas growls, as you immediately turn. You see a form rush through the undergrowth, aiming at it, but it's gone before your finger can even tighten on the trigger. \n\n\nA growling comes from the trees to your left, and you swing your rifle over to aim at the beast. They're faster than usual. They're not supposed to be this fast. It must be that fucking moon!\n\n\nA howl comes from your right, and you drop your lantern to aim, catching a glance of blood-matted fur and a flash of white teeth. The beasts don't seem to bee going for the attack, rather endlessly circling, toying with you. None of you have even had the chance to fire a shot.\n\n\nSuddenly you see one of them, basked in the red glow of the moon, dead in the center of the path. This one stands directly there, hunched over and staring at you, clearly not scared in the slightest. It's abnormally large, not even wearing the tattered remains of clothes, covered in patches of fur. it's head is malformed, it's jaws filled with teeth that barely fit in its mouth, crushed into somewhat of a snout. It's hungry eyes stare at you, as it lets out a low growl.", "action_results": [{"action": "Fire", "result": "You pull the trigger, as the silver bullet flies through the air. Through the grace of God, or whoever else, the bullet slams into the werewolf's head, smashing into his skull and sending bits of bone, chunks of grey matter and clumps of flesh and fur in various directions. The wolf's massive body stumbles forward, before collapsing to the ground with a thud. You hear a howl, which is immediately answered by dozens of other howls. There must be all the beasts here, stalking you through the forest, all of their power amplified by the power of the blood moon tenfold. Lucas and Mikhail also seem to notice it, immediately letting out a shout.\n\n\n\"Run!\" Mikhail shouts.\n\n\nYou fling your lantern off to the side, setting a pile of dry leaves alight. A fire lights, as the fire quickly engulfs the leaves and grass, dry from lack of rainfall. The fire flares up, distracting the wolves for a split second. You sprint forward, desperately running through the undergrowth and bushes. You jump over a tree root, grabbing Mikhail and pulling him forward as he stumbles. You hear the roars of the werewolves close behind you.\n\n\nYou see one sprinting to your side on all fours, it's claws and hind-legs sending it hurtling forward, galloping to your side. It stares at you, howling skyward, as you keep running. You raise the gun, firing off to the side as the werewolf leaps out of the way of the bullet.\n\n\nYou hear wet, heavy panting, less than a foot behind you. The castle is close. barely a few hundred feet away. If you get to it, you might be able to get inside and bar the door, or drop the portcullis and keep the werewolves away. Still, you can see the golden hum of torches at the edge of your peripheral, showing the village closest to the house.", "action_results": [{"action": "Sprint to the castle", "result": "You keep sprinting forward, as Mikhail yells in pain off to your side a few seconds later. You hear him smack into the ground, and his terrified screams fill the air. You keep running, before you feel your back breaking as the werewolf's claw smashed into your hack, the knife-like claws cutting through your leather duster and slashing through your flesh. You roll to the ground with a scream, as the werewolf leaps onto you, it's weight crushing you. It's wet saliva dripping onto your face, it howls at the moon in an act of triumph, before it lunges forward, biting deep into your throat.", "action_results": []}, {"action": "Take the detour through the village", "result": "\"Come on, you shout,\" running towards the village.\n\n\nYour hands push tree branches out of the way as you leave the path, almost tripping as your legs catch in the undergrowth, but manage to keep going. You stumble into the village, grabbing the corner of the house to steady yourself, as the werewolves charge into the village. Thankfully, a few peasants have been caught with their doors barely barricaded. The werewolves smash through hastily nailed planks and into the huts inside to devour a feast of flesh, bone, brains and organs. You hear horrified screams as the beasts get distracted and begin to tear apart the poor souls who have been left inside.\n\n\n\"Ah!\" Mikhail screams, as one of the more focused hunters knocks him to the ground with its claw.\n\n\n\"Shit, Mikhail! Samuel, cover me!\" Lucas says, skidding to a halt to help his brother.", "action_results": [{"action": "Help the twins", "result": "You grab the bolt of your rifle, pulling it back as you twist around and firing. The gun flies back in your hand as the recoil almost knocks you back as the werewolf takes the shot to its center mass, being knocked off Mikhail and letting out a high-pitched whimper as it quickly retreats back to the safety of the shadowy trees. Lucas grabs Mikhail. pulling him up to his feet as he joins you in running. As the werewolves are distracted with their prey, you continue sprinting towards the tower. \n\n\nUnfortunately, you see one of the werewolves stand in the center of the village. It's larger than the others, its fur white and its eyes red. It stares at you for a second, before it lets out a powerful, booming howl. The other werewolves emerge from the buildings, blood matting their fur and dripping from their claws. The Alpha Male drops to all fours and begins sprinting away towards you, followed by the others.\n\n\n\"Shit! Shit! Shit!\" Lucas says, as you see the castle.\n\n\nYou sprint, the only noise being your heavy panting and the thudding of boots and clawed feet on the earth. You reach the castle, sprinting through the gates and past the carriages parked there. You see the portcullis' control wheel to your left, and the heavy wooden door to the keep to your right.", "action_results": [{"action": "Close the portcullis", "result": "You grab the wheel, freeing it of its latch and stepping back as the wheel frantically spins around. the portcullis smashing into the carriage in the middle of the gate. Although the carriage's roof is smashed, it prevents the portcullis from closing completely. The werewolves arrives, bursting under the gate and into the grounds. You frantically head to the door, before a massive bundle of flesh and fur smashes into you, shattering your bones. You painfully smash into the ground, looking up to see a massive, white werewolf sitting atop your broken body. It stares down at you, it's blood red eyes filled with an animalistic hunger, devoid of any sentience beyond that of the wolf it's body has morphed to imitate. \n\n\nYou close your eyes. Thankfully, this beast doesn't like to play with its food, and finishes you quickly.", "action_results": []}, {"action": "Get inside the castle", "result": "You burst towards the wooden door, unlatching it and opening it so Lucas and Mikhail can topple in. You quickly close the door behind them, seeing the eyes of one of the beasts as as it desperately stares at you with the rage of a hungry and stuck lion. You lock the door as it's weight smashes into the hard wood with enough force to splinter it.\n\n\n\"There's not supposed to be that many! There's not that fucking many!\" Lucas says.\n\n\n\"There must be every cursed wretch under the moon's gaze,\" you mutter.\n\n\nMikhail spits blood onto his chest.\n\n\n\"Christ...\" he groans, as Lucas chuckles.\n\n\n\"Oh dear brother, Count Grey would tear your throat out if he heard you mutter that fucker's name here,\" Lucas smiles. \"Samuel, help me. We need to get Mikhail to the medical bay.\"\n\n\n\"Can't you handle him? I need to go warn Count Grey and the viceroys,\" you say.\n\n\n\"Yes, sure,\" Lucas says, grabbing Mikhail and putting his arm over his shoulder.\n\n\nHe walks towards medical bay, as you quickly hurry up the stairs to the sacrificial chambers. You walk upstairs quickly, heading through the lounge. You reach the door to the sacrificial chambers, before pausing. You can hear whispered voices inside, almost drowned out by the roars of the werewolves outside. How has Count Grey not noticed the attack? Why is he still in the sacrificial chambers? You tilt your head forward, and you think you can make out the words if you try hard enough.", "action_results": [{"action": "Eavesdrop", "result": "You press your head against the wooden door, as you hear voices on the other side.\n\n\n\"You're nothing more than rotten curs fixed with mange!\" Count Grey snarls.\n\n\n\"Why aren't we killing yet?\" Draven asks. \"We could run out pitiful master through and be done with it!\"\n\n\n\"There will be thousands of Blood moons, millions of hunting nights, but there will only ever be one Count Grey. I want to... savor his death,\" Mihrab says.\n\n\n\"I'll skin you alive!\" Count Grey howls.\n\n\n\"What about his servants?\" Alexa asks.\n\n\n\"The crippled hunchback is no threat, Draven can hunt him down. The others will have been wiped out by the wulven,\" Mihrab commands.\n\n\n\"What ab...? Understood,\" Alexa says, seemingly confused.\n\n\n\"And the wulven?\" Draven asks. \"They're beasts with neither honor nor reason, nothing but instinct driving them forward. They can't be trusted.\"\n\n\n\"They are the most trustworthy beings in existence,\" Mihrab says. \"I can trust that they're too stupid to think to attack us, their bellies driving them forward to feast on the villagers instead of making a move for power. I can predict they think themselves too important, even as pawns, to know we plan to hunt them down when they're mortals the next moonless night. Hell, normal mortals are infinitely less manipulative. The mixture of fear, loyalty, honor, greed and ambition that drives them makes them hard to predict, let alone manipulate successfully.\"\n\n\n\"You're going to die. You're going to suffer. I'll tear out your throat and fuck your bleeding neck stump, just like I should've when you were a pathetic mortal! I'll...\" Count Grey threatens.\n\n\nCount Grey's voice stops abruptly as you hear the slicing of flesh followed by a desperate wet gurgling. The gurgling lasts about a minute, which the vampires stay silent for. Finally, it stops.\n\n\n\"Goodbye, dear master,\" Mihrab says.\n\n\n\"Good. We're finished here. I'm going to find that miserable humpback and take his head. Perhaps I might gift his body to the peasants under my control. The children should enjoy looking at his misshapen body, poking and prodding at it.\"\n\n\nYou back step as you hear Draven begin moving, but he heads to the second door of the sacrificial chambers. Mihrab's steps follow him.\n\n\n\"I'll follow. I need to make sure the albino knows his place.\"\n\n\n\"The sound of footsteps fades as the pair leave. You breath out a sigh of relief. Suddenly, you find a dagger poking into your throat.\n\n\n\"Look what we have here,\" Viceroy Alexa says, as she appears from the shadows. She doesn't exactly step out of the shadows, instead the shadows manifest, forming into material as the vampire appears in front of you.\n\n\nYou take a deep breath, staring at her. She pushes the dagger against your neck, drawing blood that gently trickles down your neck. Her forked tongue darts forward and licks the blood as it runs down your neck, before she opens her mouth wide, her fangs pricking out. She gently scrapes her teeth along your neck, her breath as cold as a corpse, causing the hairs to stand on your neck.\n\n\n\"Look at you,\" she says in a half-purr, half-growl. \"You outsmarted the wolves, or maybe just got lucky. Unexpected, but not surprising. How did you manage to eavesdrop?\"\n\n\n\"I... I...\" you stammer, reaching slowly for your gun.\n\n\nUnsurprisingly, Draven was too focused on killing to notice you, but Mihrab should've noticed you. You're nothing special. I could hear your footsteps up the stairs, you leaning slightly on the door, your heavy breathing. I don't know how you didn't get noticed, let alone the girl.\"\n\n\nYour hand wraps around the gun, as you slowly raise it to point at the monster's head.\n\n\n\"Maybe Mihrab is too old, too proud, too over-confident to expect much from humans, not thinking to even check for you as you weren't a risk. Perhaps he needs to be taken off his so new throne. I'll admit, I like you. You have... balls. Listening in on three powerful vampires, pledging yourself to old Count Grey, even trying to grab your gun when my fangs are less than an inch away from your throat...\"\n\n\nYou grab your gun, raising it as your hand goes from the trigger. With the flat of her hand, Alexa slams it into your chest, knocking you against the wall as she grabs the gun from her hands.\n\n\n\"You're weak. Slow. Stupid. One of the qualms of being human, I suppose,\" Alexa says, examining your rifle. \"Uh, how I miss being able to eat some warm bread, drink myself stupid on cheap beer and feel the warmth of the sun on my face. Thankfully, I'm still able to enjoy some other... base pleasures. I'm so close to slicing your vein open and feasting on your delicious blood...\"\n\n\n\"Fuck you. Why don't you just kill me?\" you spit.\n\n\n\"Kill you? Why would I do that? You'll either fail and be killed, in which case why would I expend energy to kill you, or you'll succeed, and kill Draven and Mihrab, both of who will underestimate how dangerous you'll be, in which case they needed to die. If you do happen to kill them, please, come find me. I'm sure I'd like to talk to you at that point.\"\n\n\nAlexa steps back, smiling at you. She tosses the gun to the ground, where it clatters across the stone floor. She swirls around, walking away from you. She bursts forward, quickly speeding off. You let out a sigh of relief, grabbing your gun and picking it up.\n\n\nFucking hell. You have three vampires and a pack of werewolves to deal with. Could things get...? Actually, you'll refrain from tempting fate. ", "action_results": [{"action": "Search the Sacrificial Chambers", "result": "You walk into the sacrificial chambers. You walk over to Count Grey, who has a deep wound going through his chest and lies on the ground. You step over the blood-filled grooves of the floor, walking over to him. You drop to a knee, checking his pulse, before mentally hitting yourself for being so stupid. He's undead. You pull back his eyelids, revealing dull, lifeless black eyes. You quickly pat him down, finding only a curved ebony dagger and some Leu on him, which you take. You gently pat his cold head as a matter of respect, or perhaps more likely to comfort yourself. The terrifying menace who has controlled the region for over a thousand years is dead. He was your master, your mentor and your liege.\n\n\n\"Good fucking riddance. He was a cold, sociopathic cunt,\" you say aloud, a part of you still terrified to say it, somehow expecting him to wake up and tear out your throat.\n\n\nYou stand, looking around. There's the doorway to the lower floors, where you,,,\n\n\nA girl charges out from your blind side, holding up a dagger.", "action_results": [{"action": "Shoot your gun", "result": "You quickly raise your gun, firing it. The gun bucks in your hands as the bullet tears through the air forward, blowing out the girl's heart. She collapses onto the ground, her head smacking into the cold stone and falling into the groove.\n\n\nYou stare at her face, recognizing Dasha, the sacrificial victim you kidnapped from earlier. Huh, she had survived. Must've gotten free of the chains. Did you even chain her up, or did you just leave her unconscious? Huh, doesn't matter. She's dead now.", "action_results": [{"action": "Keep searching the room", "result": "You keep looking through the room, finding several vials of blood sitting on a table off to the side. You open one of the table's drawers, before suddenly the door bursts open. Standing there, clad in armor with long, wild flowing black hair and a face contorted by rage and anger.\n\n\n\"Yes! I thought I heard a gunshot! I was hoping for the cripple, but a ghoul will do!\" he snarls, approaching.\n\n\nThe vampire charges forward with remarkable speed. You raise your gun quickly, firing. The bullet thuds into Draven's chest, but it fails to even slightly slow him down. He swings the sword, slicing through your muscle and sinew and separating your head from your body. His lips immediately wrap around your gaping neck hole as he drains you of your blood, your head falling to the ground.", "action_results": []}, {"action": "Head to the lower floors", "result": "You walk towards the door to the lower floors, unclicking the latch. Before you can pull it open, something slams into it, sending you flying across the ground and onto your ass with a painful thud. Standing there, clad in armor with long, wild flowing black hair and a face contorted by rage and anger.\n\n\n\"Yes! I thought I heard a gunshot! I was hoping for the cripple, but a ghoul will do!\" he snarls, approaching.\n\n\nThe vampire charges forward with remarkable speed. You raise your gun quickly, firing. The bullet thuds into Draven's chest, but it fails to even slightly slow him down. He swings the sword as he leaps upon you, slicing through your muscle and sinew and separating your head from your body. His lips immediately wrap around your gaping neck hole as he drains you of your blood, your head rolling to the ground.", "action_results": []}]}, {"action": "Strike her with the butt of your gun", "result": "You swing the butt of your gun, cracking into the side of her face and knocking her to the ground with a grunt. The knife goes clattering, and you dart forward, grabbing the knife and raising your rifle to point at her.\n\n\n\"Who the fuck are you?\"\n\n\nThe girl stares at you with anger, blood running down her face from the newly opened cut on her forehead. You recognize her as Dasha, the sacrificial victim from earlier. Huh, apparently she survived. Interesting.\n\n\n\"Hands in the air!\" you say, pointing the gun at her head.\n\n\nShe slowly raises her hands, spitting blood and a tooth on the ground. Apparently, you swung harder than you thought. \n\n\n\"Fuck you!\" she says.\n\n\n\"You need to listen to me,\" you say.\n\n\nThe girl swings at your head, but you catch her fist. She spits in your face, which you wince at.", "action_results": [{"action": "Headbutt her", "result": "You swing your head forward, your forehead smashing into the bridge of her nose and knocking her head back as she yells in pain.\n\n\n\"Listen!\" you say loudly, losing your patience. \"Did you see those fucking vampires!?\"\n\n\nThe girl stares at you, still defiant, but quiet.\n\n\n\"If we want to get out of this, we need to work together. I don't care how much you hate me for doing what I did to you, but we need to.\"\n\n\n\"You work for the vampires,\" she says.\n\n\n\"I work for that one,\" you say, nodding towards Count Grey. \"The others killed him, and now they want to kill me... and you. We're on the same side here, understood?\"\n\n\nThe girl pauses, before slowly nodding. \n\n\n\"If I let you up, you won't try anything?\" you ask.\n\n\n\"Give me my knife,\" she replies.\n\n\n\"I can't trust you,\" you say.\n\n\n\"I can't trust you either,\" she says.\n\n\nYou sigh, before handing the knife back. She grabs it from your, staring at her reflection in the blade for a brief moment, looking as if contemplating attacks, before looking at you.\n\n\n\"What's the plan?\" she asks.\n\n\n\"I don't know. We need to... Haygarth,\" you say. \"We need to find him. He should be in the stables. He knows this place better than anyone. He'll have keys, know secret tunnels, know everything.\"\n\n\n\"Let's go, then,\" Dasha says.", "action_results": [{"action": "Head to the stables", "result": "You walk along the hallways towards the stable, your gun clenched tightly in your hands. You consider pushing Dasha ahead of you so anything that attacks has to cut through her first, but that's not the right thing to do. It's better to keep her behind you, in case a creature attacks from behind, and you can fight off whoever attacks from the front with your rifle. You walk past the rows of unlit torches that cover the walls, wishing they were lit. You aim your gun ahead, sweeping the barrel to check the corners for any hidden beasts that could be hidden away there.\n\n\n\"We need to hurry up, h..\" Dasha says.\n\n\nSuddenly, one of the windows several meters above you shatters as the upper half of a body smashes through it. It hits the wall with a wet thud, collapsing to the ground. Dasha screams as you desperately back pedal to avoid it.\n\n\n\"Fuck me!\" you say. \"The villagers must be having a bad night.\"\n\n\n\"Oh god,\" Dasha says.\n\n\nYou hear a terrified scream outside. It sounds female, and young. Very young.\n\n\n\"Help! Help! Mama!\" a voice screams from outside.\n\n\n\"We need to help her!\" Dasha says, a look of panic flooding through her.\n\n\n\"Do you want to fight the Wulven?\" you ask. \"I'm not.\"\n\n\nYou try to appear tough as Dasha stares you down, before looking away. You hear a high-pitched scream,  before the crunching of bone and flesh.\n\n\n\"It's done. Let's go,\" you say.\n\n\n\"The village is down the road! Why the fuck would they bring the villagers here to kill them?\" Dasha says.\n\n\n\"Break our morale, or act as bait, maybe. They're intelligent, for abominable beasts. Now, let's move on.\"\n\n\nYou continue walking forward, reaching a wooden door. You press up against it, waiting. \"Here it it.\"\n\n\n\"This is the door to the stables,\" you whisper. \"You ready?\"\n\n\n\"Ready. I'll follow your lead.\"", "action_results": [{"action": "Head in", "result": "You take a deep breath, bashing open the door with your shoulder, raising your rifle. Draven stands there, a sword in his hands and a grin on his face as he stands over a heavily injured Haygarth, who has been stripped naked and is covered in bruising and cuts.\n\n\n\"Don't you know how, freak? I said do it!\" Draven shouts.\n\n\nHe swings his blade and smacks Haygarth in the side of the head with the flat of his blade, knocking Haygarth to the floor.\n\n\n\"Dance!\" Draven laughs, before his eyes flicker to you. \"Look who it is! One of Grey's ghouls and... I've no fucking idea who you are, but you look like a bleeder!\"\n\n\nHaygarth lets out a terrified yell as you aim your rifle, as Draven lets out a roar, sprinting towards you with insane speed, even faster than you've seen Count Grey sprint.", "action_results": [{"action": "Shoot Draven", "result": "You fire your rifle, the bullet slamming into Draven, although even with all the stopping power that causes the gun to buck violently in your hands, but Draven doesn't even slow down. You grab the rifle to pull back and release the shell, before Draven's upon you. He thrusts his sword forward, running it through your chest. Your heart is destroyed as you yell in pain, before his head darts forward and his fangs sink into your neck.", "action_results": []}, {"action": "Roll out of the way", "result": "You dive out of the way, as Draven flies just past you, swinging his sword. His sword slices into the back of your neck, not enough to seriously wound but enough to hurt like a bitch. He slams into the door behind you, grunting as he spins around. He wipes the blood from his broken nose as he stares at the two of you, before letting out a horrible laugh.\n\n\n\"Got too excited there, didn't I? Ha!\" he smiles, twirling the sword around in his hands.\n\n\nYou look around desperately, for something, ANYTHING in the room to help you out. Dasha is just as in the cross-hairs as you are, and seems terrified. Haygarth is hiding behind a counter, unfocused and not thinking. Most of the horses are dead, having had their heads cleaved clean off. Still, there's three or four in the farther stables. There's two large, oil-filled lamps illuminating the hallways that could be used. Fire has a history of being effective with monsters. Finally, there's the old full lead solution. If you just duck, weave and fill the air with as much lead, or in this case silver, as possible to take out the vampire bastard, although silver bullets are more of a werewolf-killer. ", "action_results": [{"action": "Get to the horses", "result": "You sprint towards the horses, your rifle held tightly in your hands as you run towards them. Draven charges ahead with a howl, kicking your leg away as you collapse onto the ground, laughing.\n\n\n\"Look at you try to run! Where are you trying to run to, little one?\" he asks, before his eyes flicker to Dasha who goes for the door.\n\n\nDraven runs ahead with an animalistic howl, slamming her into the door. He presses the sword to her throat, before throwing into the air and catching it once more.\n\n\n\"Ohh... this is everything! Savor the hunt!\" he says. \"Go! Try escape again! Or are you in a fighting mood?\"", "action_results": [{"action": "Try for the horses again", "result": "You sprint towards the horses once more, as Draven pauses, raising an eyebrow as he strolls after you. You reach the horses, as Draven walks towards you. You unclasp the gate as the horses stand there. \n\n\n\"What... what was your plan?\" he asks, looking genuinely confused. \"Were you hoping to have the horses stampede me? Were you planning on riding one to safety?\"\n\n\nDraven twirls his sword, running it through you. You grunt in pain, blood dripping out your mouth as you collapse to your knees.\n\n\n\"I've had my fun. Goodnight, ghoul,\" he says.\n\n\nYou collapse forward onto your stomach, running the sword even further into you.", "action_results": []}, {"action": "Try for the lamp", "result": "You run towards the lamp, as Draven smiles.\n\n\n\"Running for the door now, are we?\" he asks, mistaking your attempt to grab the lamp as an attempt to flee.\n\n\nDraven yells and charges forward. He swings his sword as you run for the lamp, and the next thing you know, you feel the cold bite of steel on your neck. Your head flies through the air, and your body collapses to the straw-covered floor.", "action_results": []}, {"action": "Fire!", "result": "You raise your gun and fire. Draven takes a shot to the shoulder, before side-stepping your next. He doesn't even attempt to charge, just grins. You keep firing, as he dodges the bullets with unnatural ease, even the lucky shots not even throwing him, and they only manage to graze or hit his central mass, which fails to even knock him back. You aim your rifle at Draven's head, as he gently taps his finger against it.\n\n\n\"Come on, boy!\" he says, laughing. \"Take the shot! I'm enjoying this! I won't even move this time!\"\n\n\nYou peer down the sights, taking a deep breath, and you pull the trigger.\n\n\nIt's empty.\n\n\n\"Can't even c...?\" Draven laughs, before grunting. \n\n\nDraven steps forward, before collapsing onto his stomach. A knife is imbedded in the back of his heart, directly where his heart it. He groans, spluttering blood, before lying still. Dasha stands behind him, a fierce look on her face.\n\n\n\"They die easier than they did in my childhood nightmares,\" she says. \"What now?\"", "action_results": [{"action": "Talk to Haygarth", "result": "“Haygarth, what happened?”\n\n\n“He came for my head! Yelled at me and made me dance and work for him, the little cunt!” Haygarth says.\n\n\n“We need to get out of here. There…”\n\n\n“Is… is Count Grey truly dead?”\n\n\n“Yes,” you reply.\n\n\n“I never thought I’d see the day,” Haygarth says. “And the rest of what the vampire knight said was true? Vampires and werewolves have taken the castle?”\n\n\n “The area’s fucked, werewolves had surrounded the castle, the there’s still two other incredibly hostile vampires here.”\n\n\n“Where is Masters Lucas and Mikhail?”\n\n\n“They’re in the medical bay. We don’t need to think about them. We need to think about escape. They’re fine.”\n\n\n“Haygarth, is it? Dasha asks. “\n\n\n“Yes,” Haygarth says, frowning. “You’re one of the sacrifices.”\n\n\n“I have a name. It’s Dasha.”\n\n\n“So be it,” Haygarth says.\n\n\n“Are there any secret passages that could get us out of here?” Dasha asks. \n\n\n“No, we wouldn’t have anything like that. The main gate’s the only way out, unless you’re willing to dive off the wall and pray your legs are all that ends up broken. Count Grey has become too paranoid, always thinking a Vampire Hunter would find there way in.” \n\n\n\"So what can we do?\" you ask.\n\n\n\"The coach,\" Haygarth says. \"We need to get out of here. We board it up heavily, and just make a run for it.\"\n\n\n\"It's suicide!\" you say.\n\n\n\"Is it the only option?\" Dasha asks.\n\n\n\"Yes,\" Haygarth says.\n\n\n\"There's werewolves out there! They'll easily wipe us out,\" you say.\n\n\n\"We need to leave soon, before the werewolves find a way inside or the other two vampires find us. Are you willing to come?\" Haygarth asks.", "action_results": [{"action": "Agree", "result": "\"Fine. I'm in.\"\n\n\n\"You must go find Mikhail and Lucas in the medical bay.\"\n\n\n\"Do you expect him to traverse this castle, no doubt being found out by the vampires, whilst we're forced to wait here?\" Dasha asks. \"We need to go.\"", "action_results": [{"action": "Leave without them", "result": "\"We need to go, now. They're probably already dead,\" you say.\n\n\n\"Yes, sir,\" Haygarth says. \"We must prepare the coach.\"\n\n\nOver the next few minutes, you board up whatever scrap wood you can over the carriage windows. Soon, you have what amounts to a massive, armored wooden box.\n\n\n\"You can fire out the slits, to protect the horses. Hopefully, they'll be fast enough to escape the beasts' claws.\"\n\n\nDasha climbs into the coach as Haygarth positions the reigns through the coach itself, so that he can control the horses without exposing himself.\n\n\n\"Make as much noise as possible, to draw the werewolf's attention to us instead of the horses,\" Haygarth says, as he climbs in the coach. \"Now, open the stable doors.\"\n\n\nYou take a deep breath, unlatching the stable doors. You give them a hefty push open, as Haygarth yells at the horses to go. You run forward, grabbing onto the back of the coach and pulling yourself inside as Haygarth grabs the door and slams it shut behind you. You raise your rifle, pressing it to a firing shot and looking outside. The wolves are outside, as they prowl about the walls and the courtyard like a bad rabble, fighting over the bodies, both dead and living, of peasants, as well as searching for a way in. The big, albino one notices you, and lets out a loud, powerful howl, and the wolves charge.", "action_results": [{"action": "Target the albino", "result": "You aim your rifle, firing at the albino. The bullets slam into the albino as it roars in pain, before the nearing werewolves slam into your coach. Their massive, muscled frames slam through the wooden coach, knocking you against the other coach. A claw comes through the wall, grabbing you and tossing you against the ground, shattering your bones. You let out a pained scream, before the wolves are upon you, eagerly tearing you apart.", "action_results": []}, {"action": "Target the nearing werewolves", "result": "You target the nearing werewolves, firing bullet after bullet. The silver bullets slam into the beasts as they howl, many collapsing and falling away. You keep them away from the coach, but not the horses. As you just make it past the castle gates and smashing past the viceroy's coach, the werewolves tear the horses apart as they neigh and whiny in terror as they're devoured by the eager wolves. You coach quickly slows down, slamming into a tree and stopping suddenly.\n\n\n\"Shit!\" Dasha yells.\n\n\nShit. You need to act.", "action_results": [{"action": "Get out and run towards the nearest village", "result": "\"Run!\" you yell, kicking open the carriage door and leaping outside into the forest. \n\n\nYou sprint forward, as the werewolves reach the carriage. You hear Haygarth, simply too slow to flee, scream in pain. You keep running, before you feel your back breaking as the werewolf's claw smashed into your hack, the knife-like claws cutting through your leather duster and slashing through your flesh. You roll to the ground with a scream, as the werewolf leaps onto you, it's weight crushing you. It's wet saliva dripping onto your face, it howls at the moon in an act of triumph, before it lunges forward, biting deep into your throat.", "action_results": []}, {"action": "Defend the coach", "result": "You aim your rifle, firing repeatedly. You fire at the werewolves from the slit, bullets slamming into the fur-covered beasts. A claw slams into the coach, breaking through the side, its claws slashing at the air as you back step to avoid it. A claw tears a massive panel of wood off the side of the coach and you shove the barrel through the firing slit, firing at the creature's black, beady eyes. A claw smashes through the coach, grabbing you as it tears you from the coach, gripping you tightly. You're held in the air staring into the black eyes of the Alpha Werewolf, as it growls. The gun flies from your hands as you desperately reach for it, before the claw tightens, crushing your limbs. The werewolf's huge, tooth-filled jaws fly forward, its teeth grabbing into your throat and tearing it out, before it flings your bleeding body into a tree, killing you instantly.", "action_results": []}]}]}, {"action": "Go find the Twins", "result": "\"I'll find Lucas. You two stay here and prepare the coach, understood?\" you say.\n\n\n\"Yes, sir,\" Haygarth says, as Dasha nods.\n\n\nYou turn, opening the doorway to the stables and entering the hallway. You take a breath, holding your rifle, and walking slowly along the hallways. You step slowly forward, looking along the dark, shadowy corridor. You feel a breath of cold air on your deck, quickly spinning to aim your rifle, only to find yourself staring at a shadow-filled corner. You turn, walking ahead again. You keep walking forward, as the figures in the paintings along the wall stare down at you, their eyes seemingly following you. You see a figure, writhed in a black cloak and shadows, leaning in an alcove. You quickly raise your gun and fire, but your bullet only slams into the stone alcove. You swear, grabbing the bolt and pulling it back. Suddenly, a gloved hand grabs you by the shoulder as a pair of sharp fangs prick into your neck, gently pressing into your neck. You pause, as their hand moves forward and grabs your rifle, which you allow them to take. The fangs pull away, breathing freezing cold air on the back of your neck.\n\n\n\"Still here, huh?\" Alexa asks. \"I thought you were trying to escape, or at least kill Mihrab. From where you're going, it doesn't seem likely.\"\n\n\n\"I'm getting my friends and getting out of here.\"\n\n\n\"Optimistic,\" she says. \"If you're not going to kill Mihrab for me, I might as well kill you,\" she says.\n\n\nYou flinch and yelp as her lips close around your lips, before she laughs.\n\n\n\"Ha! I like you, ghoul. You're going to die tonight, that's for sure, but I won't be the one killing you. Mihrab's busy, you can speed up a bit.\"\n\n\nShe releases you, dropping the gun on the ground. You grab it quickly, stepping forward and spinning around to aim, only to be faced with shadows once more.\n\n\n\"Fuck,\" you say.\n\n\nYou turn, rushing along the halls. You open the door, pulling it open and walking inside the next room, the lounge. You quickly pass through, heading into the medical bay. He door is locked, so you quickly knock on it. You hear the door click unlocked as the door swings open, and someone grabs your arm, throwing you inside and onto the floor. You roll over as you stare at the barrel of a gun, looking up as Lucas aims his rifle at you.\n\n\n\"Shit, what happened you?\" Lucas asks, grabbing you by the hand and pulling you to your feet.\n\n\n\"Count Grey is dead. The Viceroys betrayed him,\" you say. \n\n\n\"Yeah, I suspected as much,\" Lucas admits. \"We need to get the hell out of here. We have to find Haygarth.\"\n\n\n\"He's in the stables with the girl. We're preparing the coach to escape.\n\n\n\"The girl?\" Lucas asks, frowning in confusion.\n\n\n\"One of the girls we were going to sacrifice,\" you say. \n\n\n\"Why didn't you kill her?\" Lucas asks.\n\n\n\"We need all the help we can get,\" you reply.\n\n\n\"Fine,\" Lucas says. \"Help me shift Mikhail.\"\n\n\nYou look behind him, where Mikhail lies, heavily bandaged, in the medical bay's bed. He's unconscious, but moves his head slightly and groans upon hearing his name. You walk over, slinging your rifle over your back and grabbing Mikhail's left arm. You pull him up, as Lucas grabs his other arm, supporting him as he stands.\n\n\n\"What is going on?\" Mikhail mumbles.\n\n\n\"We're getting out of here.\"\n\n\n\"Let me stand, I can walk,\" Mikhail says, gently pushing at you.", "action_results": [{"action": "Let him walk", "result": "You let go of your grips on Lucas, as he immediately collapses face first on the ground.\n\n\n\"Idiot,\" Lucas sighs, as you both lean over, grabbing him again.\n\n\nYou continue walking, heading into the lounge, as Lucas pauses.\n\n\n\"Put him down for a second,\" he says.\n\n\nHe walks over to the lounge's bar, and begins grabbing several bottles, several boxes of matches, an oil lamp and more. He works for about a minute, before ending with with four bottles of oil and alcohol on the table topped with rags\n\n\n\"What the fuck are those?\" you ask.\n\n\n\"Bombs. Light the rag, toss it, burn the monster,\" Lucas says. \"Take two.\"\n\n\nYou grab two, sliding into your leather duster's pockets, before grabbing a box of matches.\n\n\n\"Alright, let's continue.\"\n\n\nYou keep half-dragging, half-walking Mikhail towards the stables, before you finally arrive. You kick open the doors, as you all stumble inside, closing and locking the door behind you. \n\n\n\"You're here. Good,\" Haygarth says. \"We're ready to go.\"", "action_results": [{"action": "Help Mikhail into the coach", "result": "You help Mikhail clamber up into the coach, before turning to Haygarth.\n\n\n\"You can fire out the slits, to protect the horses. Hopefully, they'll be fast enough to escape the beasts' claws.\"\n\n\nDasha climbs into the coach as Haygarth positions the reigns through the coach itself, so that he can control the horses without exposing himself.\n\n\n\"Make as much noise as possible, to draw the werewolf's attention to us instead of the horses,\" Haygarth says, as he climbs in the coach, followed by Lucas. \"Now, open the stable doors.\"\n\n\nYou take a deep breath, unlatching the stable doors. You give them a hefty push open, as Haygarth yells at the horses to go. You run forward, grabbing onto the back of the coach and pulling yourself inside as Lucas grabs the door and slams it shut behind you. You raise your rifle, pressing it to a firing shot and looking outside. The wolves are outside, as they prowl about the walls and the courtyard like a bad rabble, fighting over the bodies, both dead and living, of peasants, as well as searching for a way in. The big, albino one notices you, and lets out a loud, powerful howl, and the wolves charge.", "action_results": [null, {"action": "Target the nearing werewolves", "result": "You target the nearing werewolves, firing bullet after bullet. The silver bullets slam into the beasts as they howl, many collapsing and falling away. You keep them away from the coach, but not the horses. As you just make it past the castle gates and smashing past the Viceroy's coach, the werewolves tear the horses apart as they neigh and whiny in terror as they're devoured by the eager wolves. You coach quickly slows down, slamming into a tree and stopping suddenly.\n\n\n\"Fuck!\" Dasha yells.\n\n\n\"We need to move! Werewolves fast approaching!\"\n\n\nYou stare out at the beasts sprinting towards you, and swear loudly.\n\n\n\"We need to get out of here!\" you yell.\n\n\n\"Samuel, give me a hand! Mikhail can't even walk!\" Lucas shouts.", "action_results": [{"action": "Defend the coach", "result": "You aim your rifle, firing repeatedly.\n\n\n\"Stay in the coach! They'll hunt us down if we run! Hold out here!\" you yell.\n\n\nYou fire at the werewolves from the slit, bullets slamming into the fur-covered beasts. A claw slams into the coach, breaking through the side, its claws slashing at the air as you back step to avoid it. A claw tears a massive panel of wood off the side of the coach and you shove the barrel through the firing slit, firing at the creature's black, beady eyes. You grab one of the fire bombs out of your duster pocket, pulling out a box of matches. You quickly light one of them, before a claw smashes through the coach, grabbing you as it tears you from the coach, gripping you tightly. You're held in the air staring into the black eyes of the Alpha Werewolf, as it growls. The gun flies from your hands as you desperately reach for it, before the claw tightens, crushing your limbs. The werewolf's huge, tooth-filled jaws fly forward, its teeth grabbing into your throat and tearing it out, before it flings your bleeding body into a tree, killing you instantly.", "action_results": []}, {"action": "Help carry Mikhail", "result": "You both grab Mikhail, lifting him out of the coach as the werewolves near. Haygarth grabs him from behind and attempts to help, as Dasha sprints off into the woods. Mikhail moans as you drag him forward, shuddering. He opens his eyes, shaking his head as his eyes widen in a moment of lucidity.\n\n\n\"You need to get the fuck out of here,\" Mikhail says.\n\n\n\"Mikhail! We need to go!\" Lucas says.\n\n\n\"I won't last a minute! Get out of here!\" Mikhail says, pushing you both off. \"Leave me a rifle.\"\n\n\nLucas swears loudly, quickly lighting a fire bomb and flinging it forward as it smashes into a charging werewolf.\n\n\n\"Give me your bombs and get out of here!\" he yells.\n\n\nYou fumble to hand over your fire bombs as Mikhail takes your rifle.\n\n\n\"You need to go, Lucas,\" Mikhail says.\n\n\n\"I'm not leaving you!\" Lucas replies. \"Haygarth, Samuel, get the fuck out of here!\"\n\n\n\"", "action_results": [{"action": "Leave Lucas", "result": "\"Fine. Die well, Lucas.\"\n\n\n\"I'm here too, fucker,\" Mikhail laughs, raising your rifle and firing it.\n\n\n\"Die well, Mikhail.\"\n\n\n\"Hurry up now, get the fuck out of here,\" Lucas says.\n\n\nYou nod, turning and running away from the wolves. You hear the gunfire for a while as you sprint away, as the twins make their stand. The fire draws in the werewolves and distracts them long enough for you to catch up with Haygarth and Dasha, and arrive in the village. You quickly find the nearest building, knocking desperately on the door.\n\n\n\"Let us in!\" you shout. \n\n\nAfter a minute of desperate, terrified waiting, the door opens and you scramble inside, as it slams shut. You find yourself faced with a midddle-aged man, who looks nervously at your uniform.\n\n\n\"Fuck! How sturdy is this door?\"\n\n\n\"Sturdy,\" the man replies.\n\n\n\"We're probably free,\" you say.  \"Can we wait out here until morning?\" you ask.\n\n\nThe man nods nervously as you smile, slumping down the wall to a sitting position as you breath out a sigh of relief.", "action_results": [{"action": "Continue", "result": " \n\nSurvival of the Fittest\n\n\nYou walk along the road, next to Haygarth. Dasha has long since bailed, meeting up with her family once more. You light a cigarette, putting it between your teeth and taking a long inhale.\n\n\nYou're on the outskirts of the region now, heading out far out of the control of the surviving Viceroys. Now, they won't be able to track you down. You'll easily be able to find a job out here, hunting, or providing security or even as a bandit if needs be. You'll do whatever it takes, as will Haygarth. You have a new life now, away from the monsters of the night, away from the risks of your previous life, as a new man. \n\n\nThe future looks hard, looks long, and looks honestly pretty boring, but it does still look hopeful.", "action_results": []}]}, {"action": "Stay behind", "result": "By the Burning Coach\n\n\nYou grab your rifle back from Mikhail as you hand him your pistol instead. \n\n\n\"I'm staying. Haygarth, get out of here!\"\n\n\nHaygarth looks at you, before nodding, turning off and running towards the nearest village.\n\n\n\"Let's die well, then!\" Lucas says, lighting another fire bomb and flinging it.\n\n\nYou keep firing, as you see the albino werewolf, the Alpha, charging towards you. As Lucas lights his third fire bomb, it slams into him, sending the bomb into the coach and quickly setting it alight. You fire through the Alpha's neck as it grabs you, lifting you into the air as you yell. You see saliva dripping from its snarling jaws, as it drives its claw through your stomach. You scream in pain as its claw runs through your chest, eviscerating your organs. Lucas tosses you his last, lit fire bomb. You grab it, throwing it inside the mouth of the Alpha as it bursts into flames, setting the inside of its throat alive. It releases you, desperately writhing as it burns from the inside out, before collapsing to the ground. You lie on the ground, covered in blood and dying. You raise your rifle, and continuing firing.\n\n\nAlthough your story goes untold for the most part, only a few rumored tales told by a hunchback and a random peasant girl. Still, changes take place for the villages. While life under the vampires continues as normal, with a new pair of cursed, blood-sucking royalty acting the same as Count Grey did, the werewolf attacks all but cease. Their alpha and a lot of their members gone, the pack falls apart to infighting as they all fight for power. Only a handful survive, dispersing into the wilderness. \n\n\nMany rumors and myths arise from the event. Most center around a group of men fighting by a burning coach. Whether they be criminals, best hunters, unfortunate souls or anything else, whether they fight for survival, or to eliminate the werewolf menace, for sport or for glory and all other details are lost and vary from story to story. All that is none is that their deaths were legendary.", "action_results": []}]}, {"action": "Get out of there", "result": "\"I'm sorry,\" you say, looking as Lucas as he struggles to drag his brother away.\n\n\n\"Fuck, help!\" Lucas yells, as you turn and run.\n\n\nYou turn and run, leaving behind the chaos of the crash. You sprint forward, as the werewolves reach the carriage. You hear Haygarth, simply too slow to flee, scream in pain. You keep running, before you feel your back breaking as the werewolf's claw smashed into your hack, the knife-like claws cutting through your leather duster and slashing through your flesh. You roll to the ground with a scream, as the werewolf leaps onto you, it's weight crushing you. It's wet saliva dripping onto your face, it howls at the moon in an act of triumph, before it lunges forward, biting deep into your throat.", "action_results": []}]}]}]}, {"action": "Continue carrying him", "result": "\"No, brother, you can't walk,\" Lucas smiles, continuing walking.\n\n\nYou continue walking, heading into the lounge, as Lucas pauses.\n\n\n\"Put him down for a second,\" he says.\n\n\nHe walks over to the lounge's bar, and begins grabbing several bottles, several boxes of matches, an oil lamp and more. He works for about a minute, before ending with with four bottles of oil and alcohol on the table topped with rags\n\n\n\"What the fuck are those?\" you ask.\n\n\n\"Bombs. Light the rag, toss it, burn the monster,\" Lucas says. \"Take two.\"\n\n\nYou grab two, sliding into your leather duster's pockets, before grabbing a box of matches.\n\n\n\"Alright, let's continue.\"\n\n\nYou keep half-dragging, half-walking Mikhail towards the stables, before you finally arrive. You kick open the doors, as you all stumble inside, closing and locking the door behind you. \n\n\n\"You're here. Good,\" Haygarth says. \"We're ready to go.\"", "action_results": [null]}]}]}, {"action": "Refuse", "result": "\"I'm not going!\" you say.\n\n\n\"So be it,\" Haygarth says. \"If you're not leaving the castle, we need your help.\"\n\n\n\"What?\" you ask. \n\n\n\"You need to ring the castle's alarm bell at the North-East tower. If you can ring that, you can distract the werewolves and draw them towards the North-Eastern area, so we have a chance.\"\n\n\n\"Fuck, fine. I'll get it done,\" you say.\n\n\n\"Thank you, thank you!\" Haygarth says. \"I must find the Twins, if they're still alive. I'll be sure to be back before you can make the journey to the bell.\"\n\n\n\"Fan-fucking-tastic,\" you say. \"Best of luck, Haygarth. I hope we meet on the other side.\"\n\n\n\"Same to you, Samuel.\"\n\n\nYou turn, walking away from the room. You enter the hallways again, and move quickly. You can hear the roars of the beasts outside, and you wince as you hear the scraping of sharp claws on the stones outside. You take a deep breath of air, trying not to let terror cloud your judgment. Suddenly, you pause. You see the massive, wretched body of a werewolf slowly move forward through the hallway, heading perpendicular to you. Tufts of black fur cover its body, as its deformed snout looks like a pale imitation of a true wolf's, this one looking like a poor soul has had her face bashed in to create the appearance of one. It creeps along the hallways, sniffing the air.\n\n\nYou step back slowly, taking a sharp breath. You shouldn't be surprised that they've got in. The doors are thick, reinforced with steel and silver alike, but the werewolves were bound to get in some time. Not if the portcullis had been closed, but once they entered the courtyard, they were bound to get in. \n\n\nThe beast shakes its head violently as if spasming, before sniffing the air once more. It lets out a growl, and you know it's caught your scent. There's a rotten chifferobe to your side that you could foreseeably hide in. There's also the silver-loaded gun in your hands, if you want to take it more bluntly, as well as the silver dagger you have hidden in your boot. for a quiet tactic.", "action_results": [{"action": "Hide", "result": "You grab the chifferobe, opening it and stepping inside. You close the door, quieting your breathing as you wait. You hear the loud, clawed footsteps of the beast towards you, as you wait patiently for it to pass by. This is a beast, lacking all the stealth of the true wolf, or even its stronger Wulven kin. Still, it has the nose of one, which soon becomes apparent as its wet sniffling leans to it pausing outside your room. You wait slowly, holding your breath, for the wolf to pass. It doesn't seem to know you're there... yet. ", "action_results": [{"action": "Strike", "result": "You smash open the door, smacking the wooden door and hitting the werewolf in the head. You grab the werewolf. You stab the werewolf in the throat as you knock its snouth upwards, impaling its jaw. Blood spurts out, running down its jaw as the werewolf lets out a pitiful whimper, before collapsing on the ground.\n\n\nWell, you dispatched it. Quietly, as well. Not bad. Time to continue, though.", "action_results": [{"action": "Continue to the North-East corner", "result": "You continue moving along the hallways, but thankfully wherever the werewolf's entry point is, it's not close enough to you to have an issue. You don't know where Alexa or Mihrab are, but they're not here, so that's enough. Soon, you find yourself climbing the tight, spiraling staircase towards the bell tower. You push open the wooden door once you reach the top, and find yourself faced with a massive, cast iron bell. You look out at the courtyard from the lookout of the bell tower at the dozens of fur-covered beasts scattered around the area. Shit, there's more than you thought.\n\n\nYou take a deep breath, leaning your head against the bell, taking a deep breath. The walk was fairly long, and the werewolf took some of your time. If Haygarth's still alive, he's back at the coach. You grab the bell pull, before pulling it down as hard as you can. The bell clangs loudly as you put your hand over your ears. The werewolves began to panic and howl, instantly growing frantic and charging towards the doors of the castle. You wait a moment, staring out at the courtyard, before you see the coach burst free from the castle and smashing towards the gates. The Coach smashes the Viceroy's coach out of the way, as it flies on past the trees towards the nearby village. Well, they've escaped. Lucky bastards. \n\n\nYou turn, and begin walking down the stairs, before seeing the tanned skin and black cloak of Viceroy Mihrab.\n\n\n\"You're still alive, are you?\" he asks. \"I had thought one of the stupider werewolves had gotten inside and smacked its head into the bell by accident. It's an interesting choice to ring it for whatever reason you have.\"\n\n\nMihrab walks slowly towards you, as you back up, slipping on the staircase. You quickly crawl your way up the stairs and get to the bell once more, looking down as he approaches you slowly with cool indifference.\n\n\n\"You've taken me away from my work. At least you'll provide a refreshing meal.\"\n\n\nYou hold your rifle out, aiming. You look over the edge of the bell tower. You could jump, bouncing off one of the tiled roofs and into the courtyard. The werewolves are inside, so you might be able to escape. Your other, as shitty option, is fighting.", "action_results": [{"action": "Jump", "result": "You sigh, looking out at the tiled roof. A long drop to that and then into the courtyard, then you can leg it out of there. If the first fall doesn't break your bones. Or the werewolves here you and tear you apart. You climb over the bell tower wall, and jump. There's a brief second of the air rushing as your fall, adrenaline rushing into you. Then, you hit the tiled roof. Pain surges through your as you yell in pain.\n\n\nUnfortunately, you don't smack into it and roll off into the courtyard. Instead, you just go straight through the tiled roof. You smash through, into the room beneath you. The world goes dark and hazy, as you lie there atop the broken tiles in desperate pain. You groan, taking a deep breath. You need to get moving. Otherwise, the werewolves will find you, if not Mihrab.\n\n\nYou grab the side of the table, slowly pulling yourself up. You put weight on your legs, and grunt in pain. It hurts like a bitch, but they're not broken. You're able to walk. You stand, taking a deep breath, and stumble forward. You're not going to be able fight Mihrab like this, and you highly doubt your chances of being able to leg it back to the nearest village. You need to think.\n\n\nYou could head to the castle armory. There's a large amount of explosives there, as well as other fun and interesting weapons that could be turned to wiping out the werewolves and killing Mihrab as well.\n\n\nYou could head to Count Grey's personal chambers. Knowing how paranoid and prepared he was, you have no doubt that the place is insanely secured and prepared for a situation like this. It's too late for him to use it, but you still might.\n\n\nThere's also the chance of negotiation. You could talk to Mihrab, and attempt to convince him to spare you. Through offering up Count Grey's secrets and perhaps even offering your services in the future, he can be convinced to spare you, and even have you join him. \n\n\nIf you're feeling courageous, you could attempt to negotiate with the werewolves. Whilst they're beasts, they still do have human souls and consciousnesses. They can probably negotiate. If you find the Alpha, you can most likely negotiate with it.", "action_results": [{"action": "Head to the armory", "result": "You grab your gun from the broken tiles, and stumble forward. You hear a howl resonate down the halls. You sigh as you realize they're getting louder. You luck at a nearby door along the hallway, before looking at the gun in your hands.", "action_results": [{"action": "Fight", "result": "You raise your gun and take a deep breath, before you see the werewolf coming towards you. Unlike the one you killed earlier, this one is tall, stronger and muscular, covered with brown, blood-stained fur. It snarls as it spots you, bounding towards you. You fire your gun as the werewolf roars in pain, your silver bullet slicing through the werewolf's hind leg. It slides along the hall before stumbling forward and smashing into you. Its claws and fangs tear through you, sending spurts of blood and tearing through your flesh. ", "action_results": []}, {"action": "Hide", "result": "You grab at the nearest door and open it, finding yourself in a bathroom. You shut the door and press up against it, waiting. You hear the snarls pass the door, and begin counting. When you reach twenty, you listen again, before opening the door and continuing along. It only takes a few minutes before you arrive at the oak doors of armory. You open the doors, moving quickly inside. There's a row of rifles leaning against the walls, a crate of pistols, a large machine gun atop a crate of ammunitions and an entire box of dynamite. It seems like you're fairly set to do some serious ki...\n\n\nYou hear a howl, and turn to look out the door at the approaching Alpha that charges towards you. It's white fur is dripping with flesh blood, and you can see pieces of flesh stuck in its teeth.", "action_results": [{"action": "Run", "result": "You turn and run, hearing it desperately chase after you. The footsteps get closer and closer, before you feel your back breaking as the werewolf's claw smashed into your hack, the knife-like claws cutting through your leather duster and slashing through your flesh. You roll to the ground with a scream, as the werewolf leaps onto you, it's weight crushing you. It's wet saliva dripping onto your face, it roars at you, before it lunges forward, biting deep into your throat.", "action_results": []}, {"action": "Lock the armory door", "result": "You slam the door shut, locking it quickly. You look around, as the claw smashes into the door, and you know it won't last much longer.\n\n\nThere's a shotgun you can load with silver buckshot, that you've used on hunting some of the more dangerous werewolves before.\n\n\nThere's a box full of dynamite that you could set off, which would almost certainly kill you as well as the Alpha, but fuck it, you wouldn't mind taking someone down with you.\n\n\nFinally, there's the machine gun. Although there's no silver bullets, you could set it up so you could pump so much lead into that beast that you'd definitely kill it.", "action_results": [{"action": "Grab the shotgun", "result": "You grab the shotgun, going for the box of silver shotgun shells. You quickly load one as the door begins to break as the wood splinters, before a claw smashes through the door. The albino werewolf charges inside, and you raise your gun, firing.\n\n\nThe shotgun booms back, peppering the albino with buckshot. It howls as its skin begins to burn with silver, but it doesn't go down. You reach for another shell before the albino slams into you, its claws instantly shredding your torso as its jaws close around your head.", "action_results": []}, {"action": "Set off the dynamite", "result": "Fuck, you don't have a chance. You're going to die here anyway. Might as well take that fucking albino out. You spot a box of matches on the shelf, grabbing it and pulling out a box of matches, which you quickly strike.\n\n\nThe door begins to break as the wood splinters, before a claw smashes through the door. The albino werewolf charges inside, as you pull open the crate of dynamite, lighting it. The werewolf slams into you before the dynamite explodes with a powerful flash, before everything disappears with a loud boom, killing everyone in the room. ", "action_results": []}, {"action": "Set up the machine gun", "result": "You grab the machine gun, instantly loading in a box of ammo. You quickly hurry as you begin loading the ammunition into the gun and putting down the stand. The door begins to break as the wood splinters, before a claw smashes through. The albino werewolf charges inside, as you pull down on the trigger as bullets begin to slam into the werewolf, without even slowing down, let alone stopping it. You yell, before the albino slams into you, its claws instantly shredding your torso as its jaws close around your head.", "action_results": []}]}]}]}, null, {"action": "Negotiate with Viceroy Mihrab", "result": "You grab your gun from the broken tiles, and stumble forward towards the bell tower once more. You head along in a hurry, hoping not to draw the attention of the werewolves. The bell-tower is close, seeing as you just fell from it, and you soon find yourself stumbling along the hallway as Mihrab descends from the bell tower. He pauses, staring at you.\n\n\n\"You... leapt from a bell tower... and came back?\" he asks, raising an eyebrow.\n\n\n\"I... yes,\" you reply.\n\n\n\"Alright, you've truly gained my attention,\" he says, slowly extending his hand and grabbing you by the throat, his long, sharp nails prodding into your neck.\n\n\n\"I want to make a deal. I have an abundance of information, and am happy to serve you as faithfully as I served Count Grey.\"\n\n\n\"Did you? Did you really serve him faithfully? It seems you're happy to betray his secrets right now.\n\n\n\"My loyalty ended upon Count Grey's death,\" you stammer.\n\n\nMihrab smiles, as his fingers slice open your throat. You gasp, blood filling your throat and running down your chest.\n\n\n\"I'll have to decline,\" he says, as you collapse to the ground.", "action_results": []}, {"action": "Negotiate with the Alpha", "result": "You grab your gun from the broken tiles, and stumble forward towards the courtyard. You move along the building, before finding a wooden door to the courtyard, pushing it open. You stumble into the courtyard, walking to the middle before dropping to your knees.\n\n\n\"Wolves! Bring me your Alpha! I wish to talk!\" you cry.\n\n\nAbout a dozen werewolves quickly appear, beginning to circle you. They don't strike, perhaps confused by what you're doing. Soon, the Alpha appears. It walks forward, staring at you as it growls, saliva hitting you in the face.\n\n\n\"I want to join you,\" you say. \"Mihrab is going to betray you. I overheard him say as much. The vampires will always seek to have dominion over... over the noble wolf.\"\n\n\nThe Alpha bears its teeth, but doesn't strike. It looks you dead in the eyes, as you stare back.\n\n\n\"Let me join you. I promise you won't regret it.\"\n\n\nThe wolf snarls, before pouncing forward.", "action_results": [{"action": "Fire your rifle", "result": "You raise your rifle and fire, the bullet slamming into the Alpha, but failing to slow it. Its jaws close around your throat, tearing it open as you scream in terror and pain.", "action_results": []}, {"action": "Use your knife", "result": "You raise your knife, slashing open the hide of the Alpha, but failing to slow it. Its jaws close around your throat, tearing it open as you scream in terror and pain.", "action_results": []}, {"action": "Scream", "result": "You scream as the Alpha's jaws fly forward, biting deep into your arm. You yell in pain as the werewolf bites into your arm, as a flood of emotions enters you. Hate. Anger. Passion. Adrenaline Hunger. You yell, no, you roar as you feel your body morph.Your body begins to twist and break. Your bones snap as your limbs stretch wider and your head and body grows. Your face is torn apart as his teeth grow and sharpen past their usual point. Hair sprouts from your body, soon, you find yourself lying on the ground, feeling the animal inside you finally unleashed. You look at the moon ecstatically, letting out a howl, which is soon joined by your new family. The Alpha looks at you and growls, and you bow your head in submission, an act that just feels natural. The Alpha blinks slowly at you, and you understand that its time to hunt, and finish Mihrab off.\n\n\nYou turn, sniffing the air. It's like you just know where to go. You sprint forward, running along the walls and smashing through oak doors. You find Mihrab, covered in blood from what you presume was a fight with a werewolf, hurrying towards the sacrificial chambers. He stops in terror as he stares at you, his eyes widening.\n\n\n\"So, you joined with the dogs, did you? Pathetic,\" he snarls.\n\n\nYou burst forward as he does the same. His claws painfully scrape along your snout and release a wave of blood and adrenaline as you smash your claw into him, knocking him against the wall. You bite down on his throat with a roar, tearing it clean out as you smash your claws into him. You turn, seeing a werewolf staring, half ready to charge and half ready to run. You burst forward, tearing its head off and tossing it down the hall, before bursting forward again. You... \"feel\" a presence in the shadows, twisting around and pouncing, pinning Alexa against a wall.\n\n\n\"You're either much, much more intelligent than I thought, or much less so,\" she says. \n\n\nYou feel pain run through your chest as she jabs a silver dagger into your chest. You howl, tearing it out as pain runs through you.\n\n\n\"Sorry, wolfy,\" she says, falling back against the walls, letting the shadows absorb her.\n\n\nYou snarl, before turning to be faced with the Alpha. You stare at it, as it sniffs the air and slowly approaches you. It's eyes are filled with a deep desire, a desperate hunger. You sniff the air, suddenly becoming aware of many new sensations. The Alpha seems to be... in full bloom. A sniff quickly fills your nostrils with the scent of a beast in heat. It seems the creature is more of an Alpha female.\n\n\nThe creature steps towards you, her intentions clear. The human part of you looks at disgust at the beast, wanting to spit and turn away. For better or worse, that's not the part in charge of you. The animal inside you only smells the odor of a horny bitch in heat. You step forward, your animalistic side taking over as you leap on her.\n\n\nNeedless to say, you get little sleep under the gaze of the crimson moon.", "action_results": [{"action": "Continue", "result": "You awake lying on the cold stone, completely naked and with a severe headache. For a second, you feel cold, confused and scared, like a child hiding as Papa stands by the door with his rifle, waiting for Count Grey to arrive. You reach an arm out, finding a warm body and pulling yourself tightly against it, as memories begin to flood into your mind.\n\n\nAs you realize where you are your eyes dart open. You look around frantically, seeing the white-haired girl lying next to you, blood and... other fluids covering her, and you as well. She yawns, looking up at you. She slowly gets to her feet, groaning.\n\n\n\"Well?\" she asks, raising an eyebrow. \"What?\"\n\n\n\"Nothing,\" you reply, as she smiles.\n\n\n\"You did well last night,\" she says.\n\n\n\"Two dead vampires? Yeah, not bad,\" you say.\n\n\n\"I was talking about the fucking,\" the Alpha replies.\n\n\nYou look around, spotting other naked men and women lying on the ground, all in the process of waking up.\n\n\n\"There's clothes stashed away nearby. You need a place to stay?\" the Alpha asks.\n\n\n\"Yeah,\" you say.\n\n\n\"Done. Daustin owns a mechanics shop, and had hired Godfrey as an assistant. Seeing as Godrey was cut apart by the vampires, you can take his place.\"\n\n\n\"Perfect,\" you reply. \n\n\n\"Don't worry. You're part of the pack now. We look out for each other.\"\n\n\nThe Alpha leans in, pushing you against the wall and kissing you. You push her away, as she raises an eyebrow.\n\n\n\"What? Was it only the beast within that wanted to fuck me?\" she asks.\n\n\nYou grab her, kissing her back, before she pulls away.\n\n\n\"We should go. We need to be home before we're found. If the villagers spot a bunch of naked people returning from where they just saw werewolves kill a bunch of their friends, they'll put two and two together.\"\n\n\nShe turns, barking out an order for her pack to follow her as she leads them outside of the castle. You follow, walking after them. \n\n\nNow, you're part of a pack. Now, the beast within in you has been released, and you're only barely to keep it contained with the moon gone.\n\n\nYou can't wait for the moon to call it out again.", "action_results": []}]}]}]}, {"action": "Fight", "result": "You raise your rifle, firing. The bullet thuds into Mihrab as he bears his teeth in a  grin.\n\n\n\"Pathetic,\" he says.\n\n\nMihrab bursts towards you, grabbing you by the throat, his claws cutting into your skin.\n\n\n\"Your life is meaningless. Has your service to Count Grey blurred your mind and given you a strong head? You have nothing to offer.\"", "action_results": [{"action": "Headbutt him", "result": "You smack your head into Mihrab's face, knocking him backwards into the wall. The gun's not working. You need to find something else. You quickly hurry down the stairs as Mihrab swears in some long dead language. You run quickly, finding yourself in the lower floors of the castle. There's a straight shot up another stairs to the courtyard, where you could lure Mihrab outside. Hopefully, the werewolves would frenzy and take him out, while you could slip back inside the castle. You could also head deeper into the castle, towards Count Grey's coffin and the inner areas.", "action_results": [{"action": "Head out to the courtyard", "result": "You turn and sprint forward towards the courtyard as you hear Mihrab quickly following as he snarls. You push open the oak doors to the courtyard, running out. You hear a half dozen howls as the werewolves outside spot you, but you know Mihrab is most likely still pursuing. You can't tell,  you only hear the pounding of his own heart. You keep running, before you feel your back breaking as the werewolf's claw smashed into your hack, the knife-like claws cutting through your leather duster and slashing through your flesh. You roll to the ground with a scream, as the werewolf leaps onto you, it's weight crushing you. It's wet saliva dripping onto your face, it howls at the moon in an act of triumph, before it lunges forward, biting deep into your throat.", "action_results": []}, {"action": "Head inwards", "result": "You turn, running further into the castle. You hear Mihrab snarl behind you as he charges after you. Suddenly, he slams into your with unnatural speed, sending you toppling forward as his claw cuts open your back. You groan, quickly stumbling forward as you push open the door and slam it shut behind you, locking the door. Mihrab immediately punches through, his clawed hand reaching for the key. You look around desperately, and find yourself in the room with Count Grey's coffin. You look around, spotting an oak door at the side that you remember leads towards the armory. There, you could get enough firepower to do something. \n\n\nYou could also go for the sword hanging proudly above Count Grey's coffin. It's supposed to be a great and powerful. You could try get it, and maybe best him in melee. If you're very, very luck.", "action_results": [{"action": "Head for the armory", "result": "You turn, barreling towards the armory. You hear the door unlocked behind you, hearing Mihrab approaching. You run desperately forward, but Mihrab is faster, stronger and angry as hell. As you run desperately, you feel Mihrab grab you. He flings you against the wall as you yell in pain, before darting forward and stabbing you through the neck with his claws. You let out a yelp of pain as blood fills your throat and runs down your chest, before Mihrab grabs your head and quickly twists it, breaking your neck.", "action_results": []}, {"action": "Go for the sword", "result": "You grab the top of the coffin, feeling ill as dark energy still emanates. You pull yourself atop it, grabbing the sword hanging there. You pull yourself onto the coffin, reaching up and grabbing the sword grip. The grip despite being made of leather, is icy cold to touch. You hop down from coffin as Mihrab breaks through the door, staring at you with malice.\n\n\n\"Are you going to stab me? With your little sword that you never learned to use? You've been an annoyance. Now, this is over.\" \n\n\nMihrab charges towards you with a snarl, charging towards you with the swipe of his claw, his eyes filled with unfocused rage.", "action_results": [{"action": "Dodge", "result": "You roll to avoid the strike, and Mihrab rushes past, filled with rage. He stops, swiveling around and taking a deep breath as he stares at you. He takes another breath, before walking forward, slow and methodical.", "action_results": [{"action": "Dodge", "result": "He strikes like a viper as you sidestep, but he slips to the side. He slashes his hand, cutting open the side of your face before grabbing you. He jabs his claws into your eye as you scream in pain, before he catches your head, twisting it quickly and snapping your neck.", "action_results": []}, {"action": "Strike", "result": "He strikes like a viper as you slash your blade, but he slips to the side. He slashes his hand, cutting open the side of your face before grabbing you. He jabs his claws into your eye as you scream in pain, before he catches your head, twisting it quickly and snapping your neck.", "action_results": []}]}, {"action": "Strike", "result": "You swing your blade frantically, as Mihrab charges directly for you. You run the sword through his chest as he roars. His dark, soulless eyes go dull, as you pull the sword out of his chest, where it's just ran through his heart.\n\n\n\"That...\" Mihrab whispers, looking at the blade with horror and disgust, before he collapses to the ground. You step forward, running the sword through Mihrab's chest. He grunts as his body begins to turn to dust as the very essence of his life is absorbed into your blade. You release the blade, hearing it clang to the ground, before you step back. You watch as the ancient, powerful vampire's corpse disappears from view. \n\n\nYou've killed Draven. You've killed Mihrab. Now, all you need to do is deal with Alexa, and the Viceroy problem will be solved.", "action_results": [{"action": "Find Alexa", "result": "You turn, walking towards the door. Last you remember, Alexa was inhabiting...\n\n\n\"Hmm...\" Alexa says, as you spin around to see her form from the shadows.\n\n\nAlexa walks forward, kneeling down to stare at the pile of ash. She gently picks some up with her finger, before blowing the dust away.\n\n\n\"Good riddance,\" she smiles, showing her long fangs.\n\n\nAlexa stands, walking towards. You dive for the sword, grabbing it with your hand and holding it up, snarling.\n\n\n\"Stay back,\" you snarl.\n\n\nAlexa moves forward, stopping in front of you just out of the reach of your sword.\n\n\n\"You've proven yourself to me. You've shown that you truly deserve this gift I offer.\"\n\n\n\"Gift?\" you ask.\n\n\n\"I offer you a chance to join me. We are immortal, we are powerful and we are predators. If you are willing, you can join me as a vampire, and we can take the places that Mihrab and Grey once occupied.\" \n\n\n\"You want me to join you as a vampire? Why?\" you ask.\n\n\n\"Together, we can rule. I... miss the joys of mortal life. I miss having friends, having allies, having lovers. With you at my side, as equals, we can live forever, survive anything, and be the perfect allies.\"\n\n\nAlexa steps forward, smiling  at you.\n\n\n\"So?\" she smiles.", "action_results": [{"action": "Agree", "result": "\"Fine,\" you say. \"I agree.\"\n\n\n\"Good,\" Alexa says, striding forward. \"The moon's falling, and the son will rise soon, scaring away the werewolves. Get undressed.\"\n\n\nYou raise an eyebrow, but pull off your jacket, before pulling off your shirt. You pull off your boots and trousers, before looking up at Alexa. She pulls off her cloak, pulling off her shirt and pants as well, leaving her standing there naked, as she smiles at you. Her body, completely pale and white as snow, and as cold at it, has a definite beauty to it. She walks forward, wrapping her hands around you and kissing you, her forked tongue flickering in your mouth. You kiss back, as her freezing hands begin to roam around your body. She slowly pushes you into the coffin, which surprisingly is large enough to fit both of you. Soon, in the enclosed area, you find your thrusting as you push Alexa up against the steel coffin wall. Suddenly, Alexa bites into your neck as you groan in pain, and begins sucking on your blood, draining it from you. You struggle, but she grabs your head, pressing it against her neck.\n\n\n\"Bite,\" she commands.\n\n\nYou bite down on the vampire's neck, releasing a wave of dark crimson liquid that fills your mouth.\n\n\n\"Drink,\" she whispers, as you hear her slurp your blood. \n\n\nYou follow her orders, and begin drinking down on her black liquid. You feel, as the two of you become one and the spirit of the predator enters you with each once of blood you gulp down.\n\n\nThe pair of you continue in the coffin, as you begin to transform. Mortality becomes a distant concept, life an old memory and a terrible thirst takes over you.\n\n\nThe burden of the vampire is now yours, but so are all the benefits.", "action_results": [{"action": "Pass out", "result": " \n\nYou stand on the wall of the castle, staring up at the gorgeous moon, Alexa's arm wrapped around you. She smiles at you, as you grin back, gently kissing her on the forehead. You sniff the air, smelling the blood of a nearby wounded dear, Alexa's perfume, the flowers along the river banks, so many senses. Alexa kisses you on the neck, before scraping her fangs across your neck.\n\n\n\"I hunger, Sam,\" she smiles. \"The thirst is back. Shall we go?\"\n\n\n\"Perfect,\" you smile. \n\n\nYou hurry down the staircase and past the gate and out into the woods. You both sprint through the trees, laughing as you head out for the hunt.\n\n\nYes. The hunt under the moonlight. The excitement. The joy. The passion. This is true life. ", "action_results": []}]}, {"action": "Decline", "result": "\"No,\" you say.\n\n\n\"No?\" Alexa asks, frowning. \"Shame. i thought you had potential.\"\n\n\nAlexa puts her hand in her cloak to draw something, and you raise your sword with a snarl. She smiles, slowly opening her cloak to reveal a small flask, which she uncaps and puts to her lips, drinking.\n\n\n\"I was really hoping to taste your blood... and for you to taste mine. Sadly, I shan't.\"\n\n\nAlexa leans against the shadowy corner of the wall, staring at you as the shadows begin to absorb her essence.\n\n\n\"Good luck, ghoul. Hopefully, we'll both stay out of each others way in the future, shall we?\"\n\n\nWith that, Alexa disappears from the room and from your life. You fall to your knees, tossing the sword aside as you breath out a sigh of relief. You take a deep breath, before grabbing your rifle from the ground and standing. You hear a howl from outside, leaning up against the wall and creeping along before you stare out the window. You see in the distance the sun beginning to rise. The werewolves begin howl, fleeing off towards the woods, not wanting to be caught around him when the transformation ends. You wait, watching as even the Alpha flees desperately away. You wait until the sun's light actually begins to shine on the courtyard, before walking out into the courtyard. You look up at the sun, feeling its warmth on your face, before you realize how absolutely exhausted you are. You collapse on the ground, staring up at the sky and feeling the warmth of the sun on your face.", "action_results": [{"action": "Continue", "result": " \n\nRoyalty\n\n\nYou stand on the castle wall, staring out at the trees. A half a dozen guards patrol the walls, watching out for any potential werewolves. The purges you've organized of the forests have been effective, but you're still alive. Due to the loss of any significant supernatural power, you've need to replenish your power by recruitment. You've recruited Lucas, Mikhail and Haygarth, all of whom managed to survive the night through their coach escape, although Dasha thoroughly and aggressively refused to come anywhere near the castle. You recruited a few more men from the villages, and quickly regained the control that was lost with the death of Count Grey. Through hard-work and a treaty with King Ferdinand, you've managed to become the new Count of the region. The peasants continue to pay tax to you, although you've negated the need for any of them to die to feed you. You've created a nice little situation for yourself here.\n\n\nCount Samuel. You never thought you'd see the day. Yes, it's a new dawn. The world is changing. The myths and legends of the past are being dispelled. Now, you're the future.", "action_results": []}]}, {"action": "Kill Alexa", "result": "You step forward, as she smiles, assuming you've taken up her offer. Then, you swing your blade, beheading her in one quick move. Her head topples to the ground, and you smile. Three vampires in one night. Terrific.\n\n\nYou fall to your knees, tossing the sword aside as you breath out a sigh of relief. You take a deep breath, before grabbing your rifle from the ground and standing. You hear a howl from outside, leaning up against the wall and creeping along before you stare out the window. You see in the distance the sun beginning to rise. The werewolves begin howl, fleeing off towards the woods, not wanting to be caught around him when the transformation ends. You wait, watching as even the Alpha flees desperately away. You wait until the sun's light actually begins to shine on the courtyard, before walking out into the courtyard. You look up at the sun, feeling its warmth on your face, before you realize how absolutely exhausted you are. You collapse on the ground, staring up at the sky and feeling the warmth of the sun on your face.", "action_results": [null]}]}]}]}]}]}, {"action": "Go for your knife", "result": "You lean down slightly, keeping eye contact with a snarling Mihrab, before grabbing your dagger. You stab it into Mihrab's stomach as he yelps in pain. You shove him back and immediately begin barreling down the staircase. The gun's not working. You need to find something else. You quickly hurry down the stairs as Mihrab swears in some long dead language. You run quickly, finding yourself in the lower floors of the castle. There's a straight shot up another stairs to the courtyard, where you could lure Mihrab outside. Hopefully, the werewolves would frenzy and take him out, while you could slip back inside the castle. You could also head deeper into the castle, towards Count Grey's coffin and the inner areas.", "action_results": [null, null]}, {"action": "Go for your rifle", "result": "You grab for your rifle and go down, grabbing it by the barrel and tossing it into the air. You grab for the trigger, before Mihrab slices his claws across your throat and pressing his mouth against it. You gasp as blood spurts into the monster's mouth, dropping the gun and letting out a pained grunt as you're drained of your life source.", "action_results": []}]}]}]}, {"action": "Wait for it to pass", "result": "You wait patiently as the werewolf snarls outside. Suddenly, it's massive claws bash through the chifferobe, smacking into your and shattering your bones as the claw runs through your chest. You groan, spluttering blood out onto your chest, before entering oblivion.", "action_results": []}]}, {"action": "Shoot", "result": "You pull the trigger, as the gun bucks in your hands. The bullet flies through the air, hitting the werewolf in the neck and knocking it to the ground with a burst of crimson blood, which sprays over its fur and sends it collapsing to the ground. An easy kill, but a loud one. You need to move, and you need to move fast.", "action_results": [null]}, {"action": "Use your knife", "result": "You creep forward, dropping low as you draw your knife. Your boots leather creeks, making the slightest noise, and the wolf turns and bursts towards you. It charges towards you, barreling down the hall. It pounces before and you jab your knife, stabbing into flesh and fur. It's weight smashes you into the wall, snapping your body like a twig. You scream in pain as it swings its claw, beheading you in one foul swing.", "action_results": []}]}]}]}]}, {"action": "Get to the lamp", "result": "You sprint towards the lamp, your rifle held tightly in your hands as you run towards it. Draven charges ahead with a howl, kicking your leg away as you collapse onto the ground, laughing.\n\n\n\"Look at you try to run! Where are you trying to run to, little one?\" he asks, before his eyes flicker to Dasha who goes for the door.\n\n\nDraven runs ahead with an animalistic howl, slamming her into the door. He presses the sword to her throat, before throwing into the air and catching it once more.\n\n\n\"Ohh... this is everything! Savor the hunt!\" he says. \"Go! Try escape again! Or are you in a fighting mood?\"", "action_results": [{"action": "Try for the horses", "result": "You sprint towards the horses, your rifle held tightly in your hands as you run towards them. Draven charges ahead with a howl, kicking your leg away as you collapse onto the ground, laughing.\n\n\n\"Pathetic!\"\n\n\nDasha attempts to stand, before Draven smiles, flinging his sword. The sword embeds itself in Dasha's hand, pinning it to the door, as he laughs.\n\n\n\"I forgot to mention, I'm not a bad through,\" he says, before looking down at you. \"It's a shame she tried to move and I had to throw my sword, little Ghoul. Now, I have to deal with you with fangs... and trust me, it'll be more painful.\"\n\n\nThe lamp flies through the air, smashing into Draven's head. Oil sprays across him as it's quickly set alight, as is his dry, cold corpse. Draven screams in object terror as he's engulfed in fire. He screams, desperately flailing in an attempt to put out the flames. Draven collapses to his knees as his scream finally stops, before collapsing onto his face. He slowly burns as his body turns to ash, as you crawl away from the body, standing. Haygarth stands behind Draven, staring at the fire.\n\n\n\"Didn't know what, what to do,\" Haygarth says, panting. \"Saw you go for the lamp. Decided to finish the job.\"\n\n\n\"Well done,\" you say.\n\n\nYou walk over to Dasha, who whimpers as she paws at the sword embedded in her arm. You grab it, gripping it tightly as you pull it from the wall. You tear a piece of cloth from your robes, tying it tightly around the wound.\n\n\n\"I'm fine,\" she says.", "action_results": [null]}, {"action": "Try for the lamp again", "result": "You run towards the lamp, as Draven realizes what you're doing, and charges forward. He grabs the lamp, opening it with the flick of his wrist and blowing out the candle. \n\n\n\"Nice attempt,\" he says. \"Now run.\"\n\n\nYou turn and run, as Draven follows. He swings his sword as you run , and the next thing you know, you feel the cold bite of steel on your neck. Your head flies through the air, and your body collapses to the straw-covered floor.", "action_results": []}, null]}, {"action": "Fire!", "result": "You raise your gun and fire. Draven takes a shot to the shoulder, before side-stepping your next. He doesn't even attempt to charge, just grins. You keep firing, as he dodges the bullets with unnatural ease, even the lucky shots not even throwing him, and they only manage to graze or hit his central mass, which fails to even knock him back. You aim your rifle at Draven's head, as he gently taps his finger against it.\n\n\n\"Come on, boy!\" he says, laughing. \"Take the shot! I'm enjoying this! I won't even move this time!\"\n\n\nYou peer down the sights, taking a deep breath, and you pull the trigger.\n\n\nIt's empty.\n\n\n\"Can't even count, huh?\" Draven laughs, before bursting forward.\n\n\nYou attempt to dodge, but he's faster and more prepared for your roll to the side. He swings his sword, cutting through flesh and bone as your upper body is separated from its organic stand. You barely have time for one scream before it's all over.", "action_results": []}]}]}, {"action": "Force Dasha to go in first", "result": "\"You go in first. He'll be able to smell my blood sooner than yours. I'm a ghoul.\"\n\n\n\"Bullshit!\" Dasha hisses. \"Give me the gun, then I'll go.\"", "action_results": [{"action": "Give Dasha the gun", "result": "You take a deep breath, bashing open the door with your shoulder, raising your rifle. Draven stands there, a sword in his hands and a grin on his face as he stands over a heavily injured Haygarth, who has been stripped naked and is covered in bruising and cuts.\n\n\n\"Don't you know how, freak? I said do it!\" Draven shouts.\n\n\nHe swings his blade and smacks Haygarth in the side of the head with the flat of his blade, knocking Haygarth to the floor.\n\n\n\"Dance!\" Draven laughs, before his eyes flicker to you. \"Look who it is! One of Grey's ghouls and... I've no fucking idea who you are, but you look like a bleeder!\"\n\n\nHaygarth yells as Dasha raises her rifle. Draven roars as he charges forward, and Dasha both attempts to backpedal and aim. She trips on the stairs, firing off the gun. Unfortunately, she misses Draven. Even worse, the bullet ends up flying straight through your head.", "action_results": []}, {"action": "Convince Dasha to go in with just the knife", "result": "\"No!\" you say, shaking your head.\n\n\n\"Then go through!\" Dasha commands.\n\n\n\"You go in with the knife, I go behind you with the rang...\"\n\n\nSomething slams into the door, sending you flying across the ground and onto your ass with a painful thud. Standing there, clad in armor with long, wild flowing black hair and a face contorted by rage and anger.\n\n\n\"Yes! I was distracted by the freak, but even I can hear you two bickering! Gotta get my ears checked, haha!\" he snarls before laughing menacingly as he steps forward.\n\n\nThe vampire charges forward with remarkable speed. You raise your gun quickly, firing. The bullet thuds into Draven's chest, but it fails to even slightly slow him down. He swings the sword as he leaps upon you, slicing through your muscle and sinew and separating your head from your body. His lips immediately wrap around your gaping neck hole as he drains you of your blood, your head rolling to the ground.", "action_results": []}, null]}]}]}, {"action": "Try talk to her", "result": "\"Look, please, listen to me,\" you say.\n\n\n\"Fuck off!\" she shouts.\n\n\n\"I don't need you to trust me, just listen! For...\"\n\n\n\"I said, fuck off!\" she shouts again.\n\n\n\"Listen!\" you say loudly, losing your patience. \"Did you see those fucking vampires?!\"\n\n\nThe girl stares at you, still defiant, but quiet.\n\n\n\"If we want to get out of this, we need to work together. I don't care how much you hate me for doing what I did to you, but we need to.\"\n\n\n\"You work for the vampires,\" she says.\n\n\n\"I work for that one,\" you say, nodding towards Count Grey. \"The others killed him, and now they want to kill me... and you. We're on the same side here, understood?\"\n\n\nThe girl pauses, before slowly nodding. \n\n\n\"If I let you up, you won't try anything?\" you ask.\n\n\n\"Give me my knife,\" she replies.\n\n\n\"I can't trust you,\" you say.\n\n\n\"I can't trust you either,\" she says.\n\n\nYou sigh, before handing the knife back. She grabs it from your, staring at her reflection in the blade for a brief moment, looking as if contemplating attacks, before looking at you.\n\n\n\"What's the plan?\" she asks.\n\n\n\"I don't know. We need to... Haygarth,\" you say. \"We need to find him. He should be in the stables. He knows this place better than anyone. He'll have keys, know secret tunnels, know everything.\"\n\n\n\"Let's go, then,\" Dasha says.", "action_results": [null]}]}, {"action": "Attempt to negotiate", "result": "\"Wait! Look,\" you say, holding up your hands in defense.\n\n\nThe girl slashes her knife, cutting open the palms of your hands as blood spurts out and you yelp in pain. The girl slams into you, jabbing her knife directly into your throat. Blood spurts out in even more gallons, as you choke on your own blood as the girl repeatedly stabs you in a mixture of anger and terror.", "action_results": []}]}]}, {"action": "Enter the room", "result": "You walk into the room, and are immediately faced with a shocking scene. Count Grey kneels on the ground in the center of the pentagram, his face covered with blood. Viceroy Draven stands over him, his sword pointed at the older vampire's chest he smiles, looking at his prey. Viceroy Alexa stands to the side, leaning against the wall as she drinks from a crystal bottle filled with the scarlet blood of one of Count Grey's many victims. Viceroy Mihrab stands over his former master, his sharp fingernails pressed against Count Grey's neck, an ornately carved wooden stake in his hands.\n\n\nIn an instant, all four vampire's look at you, surprised.\n\n\n\"He escaped the wolves. Impressive,\" Viceroy Alexa says.\n\n\nViceroy Mihrab's eyes narrow, as he plunges the stake into Count Grey's hearts.\n\n\n\"Get him,\" he commands.", "action_results": [{"action": "Run", "result": "You turn, sprinting away as the vampires give chase. You have a clear shot through the main hall and out into the courtyard, where you can lock the heavy wooden doors and keep him locked inside. You could head through the lounge and into the armory to find something capable of killing these beasts. Finally, you could head down the small, spiraling staircase and lose them in the lower floors.", "action_results": [{"action": "Head into the courtyard", "result": "You sprint forward, past the coat rack and into the entry hall. You grab the wooden door, quickly lifting the metal bar up with a heart-filled with adrenaline, and swinging the door open, shutting it behind you.\n\n\nA massive bundle of flesh and fur smashes into you, shattering your bones. You painfully smash into the ground, looking up to see a massive, white werewolf sitting atop your broken body. It stares down at you, it's blood red eyes filled with an animalistic hunger, devoid of any sentience beyond that of the wolf it's body has morphed to imitate. \n\n\nYou close your eyes. Thankfully, this beast doesn't like to play with its food, and finishes you quickly.", "action_results": []}, {"action": "Head into the armory", "result": "You sprint forward, turning towards the armory. You run desperately, but the vampires are faster. You feel your legs knocked away, hurtling to the ground. You smack painfully into the stone floor, yelping as Alexa plunges a dagger into your chest. You yell as it pierces your lungs, coughing blood onto your face. Alexa smiles, licking the blood off your lips, before biting down on your neck and draining the very life source from you.", "action_results": []}, {"action": "Head downstairs", "result": "You turn, heading down to the staircase. Unfortunately, hurtling down a tight, steep staircase at breakneck speeds leads to you quickly slipping, tumbling face first down. You bounce off the steps, feeling your bones break, before your head lands awkwardly and your neck snaps like a twig.", "action_results": []}]}, {"action": "Attack", "result": "You raise your rifle, firing at Viceroy Mihrab. He easily sidesteps with inhuman speed, as Viceroy Alexa and Viceroy Draven charge you. Draven is faster, swinging his sword. You manage to duck under it, feeling it hack at your scalp, before he kicks your legs away. Your smack into the hard, cold stone floor, as Alexa grabs your neck, quickly snapping it.", "action_results": []}, {"action": "Surrender", "result": "You raise your hands, dropping to your knees as you put your hands behind your head.\n\n\n\"Please, have mercy,\" you beg.\n\n\nViceroy Alexa sprints up to you with a blur, stopping behind you as she pulls out a curved dagger.\n\n\n\"How... boring. How did you even survive here?\" she asks.\n\n\nWith that, she slashes your throat open. You clutch at your bleeding throat, collapsing forward.", "action_results": []}]}]}]}, {"action": "Leave them", "result": "You keep running, as Lucas swears loudly, cursing your name. You keep running, twisting your head back as you see the werewolf biting into Mikhail's throat. Lucas aims his gun, but clearly seeing the blood streaming from his throat, turns and follows you. As the werewolves are distracted with their prey, you continue sprinting towards the tower. \n\n\nUnfortunately, you see one of the werewolves stand in the center of the village. It's larger than the others, its fur white and its eyes red. It stares at you for a second, before it lets out a powerful, booming howl. The other werewolves emerge from the buildings, blood matting their fur and dripping from their claws. The Alpha Male drops to all fours and begins sprinting away towards you, followed by the others.\n\n\n\"Shit! Shit! Shit!\" Lucas says as he nears you, as you see the castle.\n\n\nYou sprint, the only noise being your heavy panting and the thudding of boots and clawed feet on the earth. You reach the castle, sprinting through the gates and past the carriages parked there. You see the portcullis' control wheel to your left, and the heavy wooden door to the keep to your right.", "action_results": [null, {"action": "Get inside the castle", "result": "You burst towards the wooden door, unlatching it and opening it as you scramble inside, Lucas following closely behind. You quickly close the door behind them, seeing the eyes of one of the beasts as as it desperately stares at you with the rage of a hungry and stuck lion. You lock the door as it's weight smashes into the hard wood with enough force to splinter it.\n\n\nYou turn your head to talk to Lucas, before a fist smashes into your face, sending you tumbling to the ground.\n\n\n\"Mikhail is dead! He's dead because of you, you bastard!\"\n\n\n\"We couldn't have saved him!\" you say.\n\n\n\"Fuck you!\" Lucas says, raising his rifle and pointing it at your chest.\n\n\n\"Are you going to shoot me? Really?\" you say, trying to avoid showing your fear.\n\n\nLucas yells, smashing the butt of his rifle into your face, sending nose spurting down your face. He slings the rifle over his shoulder, turning and walking away.\n\n\n\"We need to tell Count Grey what's happening!\" you shout.\n\n\n\"Fuck you! I'm finding a way out of here! You do it!\" Lucas shouts over his shoulder, wandering off one of the many corridors of the castle.\n\n\n \n\nYou stand and turn, quickly hurrying up the stairs to the sacrificial chambers. You walk upstairs quickly, heading through the lounge. You reach the door to the sacrificial chambers, before pausing. You can hear whispered voices inside, almost drowned out by the roars of the werewolves outside. How has Count Grey not noticed the attack? Why is he still in the sacrificial chambers? You tilt your head forward, and you think you can make out the words if you try hard enough.", "action_results": [null, null]}]}]}]}, {"action": "Wait", "result": "You wait, keeping the monster in your sights, but knowing there's as many off to the side, waiting to strike and wipe you out to the last man. The creature growls, clearly impatient. Suddenly, it arches it's head back, looking up at the crimson moon, and letting our a powerful, ear-splitting howl.\n\n\nSuddenly, the monsters are upon you. A wall of fur, muscles, teeth and claws strikes, a wave of death. You twist, firing your gun, grabbing the bolt and pulling it back, but before you have the chance, a clawed hand grabs you, willing you throw the air and into a tree. You yell as your back breaks against the tree. Before you can even scream, your throat is tore open by a mouthful of sharp canines.", "action_results": []}]}, {"action": "Let Lucas kill them all", "result": "You stare at Lucas wordlessly, who frowns. Lucas works to the next girl angrily, kicking her in the back of head to force her above the grove. He grabs her by the hair, holding her forward and quickly slashing her throat as the blood pours out. He walks to the next one, who at this point is frantically trying to escape. Lucas stabs her through the throat multiple times, as blood spurts to the ground. \n\n\n\"Watch them die, cowards. You choose for this to happen. Whether you want to actually hold the knife or watch, you're fucking monsters. We all are. At least, I'm proud of myself.\"\n\n\nLucas walks over the second last girl, putting the knife to her throat. The girl struggles desperately, but the chains stop her from resisting\n\n\n\"Lucas! Mikhail! Samuel! Come down here!\" Count Grey asks. \"Quickly!\"\n\n\n\"We need to go,\" Mikhail says, quickly turning and heading towards the door.\n\n\nLucas shrugs, slicing open the girl's throat and letting her head fall and knock against the cold stone. He quickly hurries towards Count Grey, and you follow. You quickly hurry towards the main hall, walking down the spiraling stairs. Count Grey stands there, alongside his three Viceroys, and Haygarth rushing to put away coats.\n\n\nViceroy Draven is a tall, large man covered with heavy muscles. He has long, curly black hair, and instead of the black attire of the other three, wears steel plated armor covering him from the neck down, with a sword hanging by his side. From what you know, he's almost five hundred years, once being and most likely still remaining a formidable warrior. He looks at you, his eyes narrowing as he stares at you. He lets out a low, guttural growling at the sight of you, and even after years of work around Count Grey, the man manages to make you feel like little more than a blood bag.\n\n\nThe second, Viceroy Mihrab, is even older, almost as old as Count Grey. His skin seems unusually tight,  a light brown in complex, his face sunken, his eyes lacking any emotion whatsoever. He wears dark attire, his eyes glancing in your direction away for a second, before peering away with disinterest. He doesn't appear to be armed, but with the long, sharp fingernails on his hand that at that length qualify as swords as well as long fangs, he doesn't need them.\n\n\nThe final Viceroy, Alexa, is the only woman of the group. She wears a black hooded cloak, her pale, scarred face underneath, with unnaturally long fangs even for one of her kind to halfway down towards her chin. She leans against the wall, looking at you without a single noise. She stares at you like a starved wolf. Something tells you that of all those there, she's the biggest threat. \n\n\n\"Yes, master?\" Mikhail says, standing up straight.\n\n\n\"Werewolves spotted on Hangman's Trail,\" he says. \"They're amassing. Perhaps for a strike.\"\n\n\nYou pause, and can hear the distant howls of what lies between monsters and men.\n\n\n\"We'll push them back, sir,\" Mikhail nods. \n\n\nMikhail turns away, and quickly begins heading to the armory. You follow, and you all quickly descend the stairs to the armory. You walk inside, grabbing a padded leather duster and slinging it over. You grab a rifle, as well as several magazines of silver bullets, popping them in a satchel that you put over your head. \n\n\nNow suitably armed, you grab a lantern, walking out towards the main hall. The Vampires have left, no doubt to partake in some drinks, discuss future plans, before beginning the ritual and, imbued with a power that grows as the blood moan rises, slaughtering dozens of helpless villagers.\n\n\nYou walk out the hall doors, pushing the door open and entering the dark night. You walk along the earth, passing the gate, which for some reason has been left open, one of the Viceroy's carriages sitting under the raised portcullis.\n\n\n\"Should we move it so we can drop the portcullis?\" you ask.\n\n\n\"And piss off Count Grey and whoever owns this carriage? No fucking chance,\" Lucas says.\n\n\nAs you leave and wander off into the trees. Soon, the only sound is the crunching of leaves under foot and your breathing.\n\n\n\"Control your breathing. Deep breaths. Watch your foot placement as well as the path in front of you. Avoid twigs and try leaves. We're trying to hunt, best be quiet about it,\" Lucas says. \"The man's most definitely untrustworthy and cruel, but he knows how to hunt.\n\n\nYou take his advise, holding the lantern out to illuminate the path ahead. You see a shape move to your right, and stop, immediately twisting to aim.\n\n\n\"Contract, left side!\" you whisper.\n\n\n\"Just a deer, stay focused!\" Lucas whispers. \"This is a fucking hunting trail, of course there's deer around!\"\n\n\nYou keep moving, you gun raised in your one hand, propped in the crook of your shoulder to allow you to aim. \n\n\nThe beam of your light comes across a deer lying on the ground. It's belly has been ripped to shreds, entrails covering the earth around it and soaking it with bodily fluids. It's head, connected to its body by a few strands of sinew and muscle, lies in the grass at the edge of the path, two lifeless eyes staring towards the stars. \n\n\n\"It's fresh, look out!\" Lucas growls, as you immediately turn. You see a form rush through the undergrowth, aiming at it, but it's gone before your finger can even tighten on the trigger. \n\n\nA growling comes from the trees to your left, and you swing your rifle over to aim at the beast. They're faster than usual. They're not supposed to be this fast. It must be that fucking moon!\n\n\nA howl comes from your right, and you drop your lantern to aim, catching a glance of blood-matted fur and a flash of white teeth. The beasts don't seem to bee going for the attack, rather endlessly circling, toying with you. None of you have even had the chance to fire a shot.\n\n\nSuddenly you see one of them, basked in the red glow of the moon, dead in the center of the path. This one stands directly there, hunched over and staring at you, clearly not scared in the slightest. It's abnormally large, not even wearing the tattered remains of clothes, covered in patches of fur. it's head is malformed, it's jaws filled with teeth that barely fit in its mouth, crushed into somewhat of a snout. It's hungry eyes stare at you, as it lets out a low growl. It's trying to bait you into striking. Still, maybe this is the best chance you're getting.", "action_results": [null, null]}]}, {"action": "Drag her to the chambers", "result": "You grit your teeth, pulling tightly on the chain and dragging her forward. She tries to resist, but you're simply stronger, and she's forced to follow. You slowly lead the two along the hallway, up the stairs, and  into the \"church\". You hear Count Grey's dark, cold, emotionless voice from the main hall.\n\n\n\"Welcome, Viceroys. Did you decide to come together, or simply met on the road here?\"\n\n\n\"Coincidence, my lord,\" another far deeper voice booms, one more filled with malice and hatred than Count Grey's.\n\n\n\"Good, good. Haygarth!\" Count Grey shouts.\n\n\n\"Yes, yes master?\" Haygarth's voice comes back from the stables.\n\n\n\"Come, fetch the Viceroy's coats!\"\n\n\n\"Yes, yes sir!\" Haygarth says, quickly hurrying to them.\n\n\nYou turn your attention back to the task at hand. In front of you in a large, open stone room. Groves cover the stone floor, making the shape of a large pentagram. Lucas' two prisoners are kneeling at two of the points of the pentagram chained to a loop in the stone to prevent them from moving, while Dasha lies at the third, her unconscious state meaning she doesn't need to be chained up. \n\n\n\"Come on,\" you say, dragging the second girl to one of the pentagram's points. You force her to kneel on the ground and chain her to the loop in the ground. You drag the first girl to the other, doing the same.\n\n\nMikhail and Lucas stand off to the side, watching them. Mikhail looks down, looking vaguely embarrassed at his part in this. Lucas, however, seems ecstatic. He walks forward, grinning as he draws his dagger.\n\n\n\"Oh boy, look at that!\" he says, dropping to his knees in front of a girl. \"Look at that. You see the pentagram? You see those deep, thick groves? I'm going to fill them with your blood. You like that? You ready?\"\n\n\nThe girl frantically begins to struggle, as Lucas smiles. Lucas slices the girl's throat open, as blood pours out, flooding into the grove and running along. The girl gurgles as blood pours through her throat, and Lucas lets the head fall to the ground over the grove, letting the blood pour out into it.\n\n\n\"Mikhail, come on, we need this ready for the Viceroys and Count Grey!\" he says.\n\n\n\"I am not a butcher,\" Mikhail says softly, as Lucas' eyes narrow.\n\n\n\"Don't fucking take the high road. You drugged every whore here, knowing it was all so we'd slit there throats here. You're as much a murderer as I am.\"\n\n\nMikhail looks to the ground, opening his mouth as if to say something, but closing it just as quickly.\n\n\n\"That's what I thought. Samuel, grab your knife, let's get to work.\"", "action_results": [null, null]}]}]}]}]}, {"action": "Suggest you were unprepared and the teens are undeserving of becoming ghouls", "result": "\"No. I was just unprepared,\" you say. \"These thieves are nothing special.\"\n\n\n\"So be...\" Count Grey says, before Mikhail grabs your leg, flipping you onto your back.\n\n\nCount Grey steps back as he watches you struggle on the ground with Mikhail. Your guns bounce across the stones and land a few feet away, barely in arms reach. Lucas immediately goes for the guns, as Mikhail puts his hands around your throats and begins to strangle.", "action_results": [{"action": "Go for the gun", "result": "You reach for the gun, as both you and Lucas immediately grab it. You try to rip the gun from his hands, but Mikhail's massive, strong hands choke the life out of you. His hands crush your throat with it's powerful squeezing, and the life is wringed out of you as you desperately try to get one last breath. The world goes dark, as you let out a final croak.", "action_results": []}, {"action": "Focus on Mikhail", "result": "Your fingers immediately grab Mikhail's face, your thumbs going into his eyes as you begin to push your thumbs down to blind him. Mikhail releases his grip to grab your wrists and pull him away, before Lucas fires the gun. The bullet blows out the back of your head, staining the ground red.", "action_results": []}]}]}, {"action": "Attack", "result": "You grab the pistol, forcing it skyward as the skinny one pulls the trigger, the bullet ricocheting off the wall. The big one thrusts his knife forward, stabbing into your throat repeatedly, slicing open your throat and sending a wave of blood to run down your chest. You let out a pained gurgle, before collapsing to the ground.", "action_results": []}]}, {"action": "Attempt to convince Haygarth to come in", "result": "\"Haygarth, it's cold, it's been a long day, you must be starving and desperate for a drink. Come on, Haygarth, let's go inside.\"\n\n\n\"Fine,\" Haygarth says, nodding as he climbs off his spot. \"Five minutes.\"", "action_results": [{"action": "Enter the tavern", "result": "You walk inside the tavern by yourself, feeling the weight of your Leu-filled wallet in your side pocket,. You walk alongside a nervous Haygarth, and immediately garner the attention of everyone in the bar. Your garb makes it immediately clear to anyone but the most ignorant or simply stupid of the peasants that you're a servant of Count Grey. The tavern quickly clears out, heading to their various homes, leaving only a few idiots too old and stubborn or young and cocky to realize staying near you is death. \n\n\nYou toss a crumpled note on the counter, looking up at the bar tender expectantly.\n\n\n\"Everyone's staring,\" Haygarth says, nervously.\n\n\n\"Everyone either left, is drunk as fuck or is trying to appear tough while stopping from pissing themselves,\" you reply.\n\n\nSoon, you find yourself drinking a pint, a plate of chicken, boiled potatoes and cabbage in front of you, as Haygarth does likewise. You smile, eating it up eagerly, downing the pint in a few gulps. You belch loudly, as Haygarth mutters a complaint. You grin, finding yourself now filled with food, warm and content.\n\n\n\"Where's the bathroom?\" you ask, feeling the need to piss rising as your full bladder demands you act.\n\n\n\"Bathroom's broken. Go outside,\" the bar-tender replies.\n\n\nYou raise an eyebrow, tapping on your hat.\n\n\n\"Do you know who I am? Who I work for?\" you ask.\n\n\n\"I do. If he shows up here, I'm as happy to show him the broken toilet as I am you.\"\n\n\n\"Fuck you,\" you say, before turning to Haygarth. \"Back in a sec, I need to piss.\"\n\n\n\"Have haste! The master awaits!\" Haygarth replies.\n\n\nYou stand, turning and walking outside into the alley. You unzip your trousers and pull out your dick, pissing onto the side of the old building.\n\n\nSuddenly, the cold blade of a knife is pressed against your throat.\n\n\n\"Don't move,\" a deep voice whispers. \"Hands in the air.\"\n\n\n\"Do you expect me to let go of my dick and piss on myself?\" you ask, more annoyed than scared.\n\n\n\"Finish up,\" the voice says.\n\n\nYou finish pissing, popping your genitalia back in your trousers, buttoning it up, and slowly turn to face your attack. Two teens, barely fifteen by the looks of it, both with short blond hair, one skinny, on large and muscular, stare at you. The skinny one holds a pistol, while the big one holds the knife pressed against your throat.\n\n\n\"What's this about, gents? Revenge?\" you ask, knowing just how many family's want your blood for taking their daughter's.\n\n\n\"What? We don't know you,\" the big one says. \n\n\n\"The wallet. Now,\" the skinny one says.\n\n\nYou pause, frowning.\n\n\n\"Are you seriously fucking telling me you've decided to mug me?\" you ask, surprised.\n\n\n\"Why the fuck wouldn't we?\" the big one asks, pushing you against the wall as the skinny one draws his own knife with his left hand, strolling forward to press the barrel against your temple.\n\n\n\"Wallet. Now,\" he says.\n\n\n\"Fucking idiots. You don't recognize the outfit, eh? I'm a fucking Ghoul, Count Grey's personal assistant.\"\n\n\nThe big one looks at the skinny one nervously.\n\n\n\"Maybe we should let him go,\" the big one asks.\n\n\n\"He's bluffing,\" the skinny one says, licking his lips. \"Ghouls... ghouls are rotten, aren't they?\"\n\n\n\"The sun's down, boys. Count Grey's due to wake...\"\n\n\n\"Shut it! Wallet, now!\" the skinny one commands", "action_results": [null, null, {"action": "Give them the wallet", "result": "You hand over your wallet, giving them the finger as you do.\n\n\n\"Thanks,\" the skinny one smiles.\n\n\nSuddenly, Haygarth bursts outside, charging forward. He rams into the skinny one, who immediately smacks his pistol across Haygarth's face, knocking him to the ground. He turns to you, snarling. He grabs the wallet from your hands as he smacks you in the head with the gun, knocking you to the floor.\n\n\n\"What are you doing?\" the big one asks. \"We don't need to kill him! We got the wallet!\"\n\n\n\"Uh...\" Haygarth groans, collapsing. \n\n\nYou look up to see the barrel of the gun pointing directly at your head.\n\n\n\"You heard what he said. He's with the count. If we kill him now, the count won't come after us!\" the skinny one knows. \"He's seen our faces.\"\n\n\n\"He doesn't know our names,\" the big one says.\n\n\n\"I'm Lucas. That's Mikhail,\" the skinny one said.\n\n\n\"What the fuck!?\" the big one, Mikhail replies.\n\n\n\"We have to kill him. Now even you'd agree to that,\" Lucas says.\n\n\n\"Always kill your prey. You don't want to let them come back and bite you in the throat,\" a voice says.\n\n\nCount Grey steps from the shadows, his teeth curved in a grin, his fangs prominent. He grabs Lucas' gun arm, twisting it until Lucas drops the gun. Mikhail charges with a knife, but with a quick, well-planted punch to the chest sends him to the floor, badly winded. You stand up, grabbing the gun as well as drawing your own, pointing one at each of the thieves.\n\n\n\"Master! Master, thank you!\" Haygarth says as he clambers to his feet, standing behind Count Grey.\n\n\n\"What, are you some fucking cowboy with your guns? Shoot, come on!\" Lucas says, even though his bottom lip is quivering.\n\n\n\"Tell me, Samuel. How did they manage to jump you?\" Count Grey asks, tracing a finger down Lucas' nose.\n\n\n\"I was pissing,\" you admit.\n\n\n\"And you, Haygarth?\"\n\n\n\"I heard the commotion and came out to help... he was stronger than me,\" Haygarth says, ashamed.\n\n\n\"Hmmm... tell me, where is your family?\" Count Grey asks, turning his attention to the teens.\n\n\n\"Dead,\" Lucas answers.\n\n\n\"Well then, you've shown balls, willingness to kill and the ability to ambush. Perhaps... Samuel, you were the one mugged. What happened? Were you behaving stupidly and ambushed by some lackluster fools, or are these two deserving of becoming ghouls?\"", "action_results": [{"action": "Suggest the teens become ghouls", "result": "\"They have potential,\" you admit.\n\n\n\"Yes, yes, they can fight!\" Haygarth says. \n\n\n\"Young men, I'll give you a choice. I could kill you now, drain your blood and return to my castle for the night.\"\n\n\n\"What's the other option?\" Mikhail asks.\n\n\n\"Join me. Let me take you on as my... apprentice. As my servant. As my slave. As whatever I need you to be. In exchange for your servitude, I offer your life.\"\n\n\n\"Jesus, do you have that memorized?\" you mutter, under your breath.\n\n\n\"I'm in,\" Lucas says immediately, as Mikhail pauses, before nodding in agreement.\n\n\n\"Perfect,\" the vampire smiles. \"The coach is full. You'll walk behind it. No breaks. No time to pack. Immediately. If you're too pathetic for that, you might as well die of exhaustion.\"\n\n\nWith that, Count Grey walks off with Haygarth, and you eagerly follow.", "action_results": [null]}, {"action": "Suggest you were unprepared and the teens are undeserving of becoming ghouls", "result": "\"No. I was just unprepared,\" you say. \"These thieves are nothing special.\"\n\n\n\"So be...\" Count Grey says, before Mikhail grabs your leg, flipping you onto your back.\n\n\nCount Grey steps back as he watches you struggle on the ground with Mikhail. Haygarth moves forward to assist you, but Count Grey holds him back.\n\n\n\"Let Samuel prove his worth. If he can't fend off two thieves, he doesn't deserve to work for me.\"\n\n\n Your guns bounce across the stones and land a few feet away, barely in arms reach. Lucas immediately goes for the guns, as Mikhail puts his hands around your throats and begins to strangle.", "action_results": [null, null]}]}, null]}]}]}, {"action": "Force Haygath to stop", "result": "\"Haygarth,\" you snarl, drawing a pistol from your side. \"If you really want me to pistol-whip you into submission, I'm willing to do so.\"\n\n\nHaygarth sighs, before nodding.\n\n\n\"Fine, fine, but be quick about it!\"\n\n\nThe carriage pulls in alongside a tavern, as you look to Haygarth, who looks fairly pathetic as he attempts to cover his mishapen form.", "action_results": [null, {"action": "Attempt to convince Haygarth to come in", "result": "\"Haygarth, it's cold, you haven't eaten or drank anything in many hours. Come inside.\"\n\n\n\"No, no! Too many eyes staring, too many fingers pointing, too many voices whispering! You made me pull in here so you can eat, so go, eat!\"", "action_results": [null]}]}]}]}, {"action": "Refuse", "result": "“I can’t do it,” you say, dropping the knife and let it collapse on the ground.\n\n\n“Do you really want to make that choice?” Count Grey asks, baring his fangs. They remind you of long, curved thin ivory daggers, ready to strike at any given moment\n\n\n“Yes,” you say.\n\n\n“So be it,” he says. “You’ve shown courage by refusing an order. Perhaps you’re braver than expected. Fine, follow me. Lock the cell door behind you.”\n\n\nYou breath out a sigh of relief, closing the door and locking it with a twist of the key. You follow Count Grey along the hall. Soon, you find yourself in front of a large, wooden door. Haygarth has forbidden you from entering, which only mean that you had one less room to clean. Count Grey pulls a short, silver key from his pocket. He opens the door, revealing a massive storage room. The room is filled with cabinets and shelving units. They’re all filled with crystal bottles, filled with a scarlet red ichor.\n\n\n“This castle was built to withstand a siege. It’s storerooms could keep a force here going for years with wheat, potatoes, salted meats and more, as well as small gardens. Unfortunately, I require a more… delicate solution to avoid starving.”\n\n\nYou look at the endless bottles of blood, wondering how many lives were given to fill them.\n\n\n“It’s quite hard to successfully bottle blood. Let alone hard hard it is to get it from the victim without a needle and a few hours.”\n\n\n“You want me to kill people and bottle their blood?” you gulp. “Are you willing to do that?”", "action_results": [{"action": "Yes", "result": "“You think so? You’re a virgin, aren’t you?”\n\n\n“Yes,” you say, raising an eyebrow.\n\n\n“Then I think you’re right. You will fill a few bottles,” Count Grey says.\n\n\nCount Grey bursts forward, grabbing you by the neck and twisting it. His fangs fly forward, stabbing through your neck. You gasp as your blood fills his mouth. The last sensation you feel is your bleeding neck wound being pressed against the rim of an empty glass bottle.", "action_results": []}, {"action": "No", "result": "“I thought not. You’re a virgin, aren’t you?”\n\n\n“Yes,” you say, raising an eyebrow.\n\n\n“Then I think you will fill a few bottles,” Count Grey says.\n\n\nCount Grey bursts forward, grabbing you by the neck and twisting it. His fangs fly forward, stabbing through your neck. You gasp as your blood fills his mouth. The last sensation you feel is your bleeding neck wound being pressed against the rim of an empty glass bottle.", "action_results": []}]}]}]}, {"action": "Do your job without talking", "result": "You keep walking, as the girl stays compliant. She does actually smell quite strongly of perfume. You lead her quickly to the castle's dungeons. You drag her down the stairs, before leading her into a prison cell. You lock the cell door, staring at her from behind the bars. She stares blankly ahead, leaning against the wall and sliding down to lean against it, her nightgown now covered in mud and dirt.\n\n\nYou leave her there, now secured, and end up heading to bed for a few hours sleep before Count Grey arrives back.", "action_results": [null]}]}]}]}, {"action": "Run", "result": "You turn quickly, sprinting away as the vampire bursts forward, knocking your leg away and sending you tumbling forward. You smash into the ground as the vampire strikes, landing atop your fragile body.. He grabs your neck, holding your head high to expose your neck. His mouth immediately shoots forward, biting into your neck as he begins to drain you of your life force. You gasp as your blood is drained, before he stands, leaving your dead body on the ground.", "action_results": []}]}, {"action": "The second girl", "result": "\"Uh... the... the se...\" you stutter, tripping over your words as the vampire growls.\n\n\n\"Have I found myself with another fool, a boy with the mind of a mule?\" the vampire says, his long, gleaning white fangs, the corners of his mouth still red with your blood. \"I've had a year out of you. Perhaps it's best to finish you off now.\"\n\n\nCount Grey slowly walks forward, snarling as his fangs poke out, looking like huge spears. ", "action_results": [null, {"action": "Stand your ground", "result": "You stand your ground, as the vampire grabs you by the throat, lifting you into the air. His grip is tight, strangling you as he snarls, looking you at you with his cold, dark eyes.\n\n\n“I’m going to feel nothing as you die,” he says.\n\n\nYour brain begins to scream from lack of oxygen, as his eyes stare into yours. Your vision gets blurry, as your head begins to pulse with a desire to simply close your eyes and pass out. Suddenly, he releases you from his grip, as he drops you to the ground.\n\n\n“Perhaps… perhaps you’re ready to truly serve. Your life is mine, Samuel. If I decide to break your neck, you’ll lay your head down on the table and have your neck broken, understood?\"\n\n\n\"Ye... yes, sir. Whatever you desire,\" you manage to spit out.\n\n\n\"Good. The baker's child, was it?\" the vampire says, smiling. \"Follow me.\"\n\n\nYou quickly begin following, walking along the stone road. You stop at one of the smaller houses, conjoined with what you assume is the bakery. Count Grey walks forward, opening the unlocked door, before stepping inside. \n\n\n\"Follow,\" Count Grey shouted, as a fat man with a butcher's knife appears.\n\n\n\"Stay back, robber!\" he says, before pausing as he finds himself face-to-face with an ancient, cursed terror of the night.\n\n\nCount Grey let out a snarl, as he bared his teeth, his eyes filling his hunger.\n\n\n\"Are you here for my wife... or my daughter?\" he asks, staring nervously at him as his grip tightens.\n\n\n\"The latter,\" the vampire says, stepping forward.\n\n\nThe baker takes a deep breath, charging forward as he raises the knife high. Count Grey grabs his wrist, twisting it sharply and breaking it, before grabbing him by the forehead and raising his head into the air. His fangs dart forward, biting into the man's neck, as he begins to drain him of his blood. The old man convulses as the blood is drained from him, before the vampire casts his cold, bloodless, pale form aside.\n\n\n\"Ah... refreshing,\" he says, wiping blood from his mouth.\n\n\n\"Count Grey walked forward into the house, sniffing the air. With a quick kick, he smashed the door open. You stood behind him, watching as he enters the room. He drops to his knee, grabbing a foot from under the bed and quickly dragging out a terrified girl wearing old underclothes.\n\n\n\"Did you think you could hide?\" he asks, amused. \"Ah... so fresh... so young... so delicious.\"\n\n\nThe girl screams for her father, but Count Grey simply grabs her by the hair, in a quick jerk ripping her from the bed. Count Grey walked along the hallway, dragging her towards the coach. You follow, passing the dead corpse of her father, prompting the girl to burst into tears.\n\n\nCount Grey dragged her into the coach, throwing her into the back, before locking it. He motioned for you to follow.\n\n\n\"It's a beautiful night. The moon's full in the sky. I need to... negotiate with a few of the beasts of the night. I shan't be long. When to the West the honorless dogs create endless machines of war and to the East our enemies have endless' souls to give, we could always use more allies, yes?\"\n\n\nYou nod slowly, as the Vampire slides his coat off his gaunt frame, holding it out. You stare at it, before realizing he wants you to take it and grabbing it.\n\n\n\"Take the girl back to the castle. Detain her. Then, await my return.\"\n\n\n\"Yes, sir,\" you respond, as your master turns away, strolling off into the night. ", "action_results": [null]}, null]}]}]}]}, {"action": "Keep working", "result": "\"Yes, sir,\" you mutter.\n\n\nYou continue working, as does Haygarth. It takes about half an hour before the entire place is clean. You look out the window, seeing the large moon rising in the distance.\n\n\n\"Yes, yes! Tonight, tonight is the night, little one!\" Haygarth says. \"The year of the mule is ready. Now, let's go! We must wake Count Grey!\"", "action_results": [{"action": "Follow Haygarth", "result": "You follow Haygarth along the hallways with haste. You hurry down the stairs, quickly heading to the lowest floor, at the center of the castle, into a dark room, empty except for a single, candle-adored coffin leaning against the stone wall, and a large, black sword hanging above the coffin.\n\n\nThe coffin in intricate, a large, black wooden coffin with an intricate, thorny pattern, and a single silver, demonic face with a roaring mouth with a pair of fangs on the front.\n\n\nThe sword, on the other hand, is somehow even darker, its surface seeming to suck the very light from the room. Even staring at the thin edge makes you feel like you've been stabbed. You can practically taste the hatred and malice that emanates from it. \n\n\n\"Do you feel it?\" Haygarth says. \"That is the master of the home. Don't be scared. It grows on you.\"\n\n\nYou feel the hairs stand up on your skin. The air tastes stale and rotten, and there's a general feeling of dread emanating from it. In a place like this, you feel even if you called on the good Lord to save you, he would be unable to find your soul in such an abyss of all warm or love, let alone rescue you from it.\n\n\n\"What now?\" you ask.\n\n\n\"The Count needs blood to awaken. Be still. I'll make it as easy as possible. Just don't resist.\"\n\n\nHaygarth gently grabs your hand, pulling it forward until your hand touches the metal.\n\n\n\"It... stings,\" you say, as it feels like your hand is both being put against a hot stove and a freezing block of ice.\n\n\n\"It's OK. You'll get used to it,\" Haygarth says, drawing an iron blade from his side. \n\n\nHaygarth presses the blade against your arm, quickly slicing a small cut in your arm.\n\n\n\"Ah!\" you yelp.\n\n\nHaygarth slowly presses your wound into the mouth as the silver demon. Blood begins to pour down the creature's mouth, as the coffin's door clicks open. Haygarth grabs you by the shoulder, pulling you back. Count Grey steps forward. He looks the same as he has every night since the night he took you, except now his lips look parched and cracked, his eyes immediately darting down to your arm.\n\n\n\"Thirst,\" he moans, staring at your wound.\n\n\nHaygarth gently nudges you forward.\n\n\n\"The master needs to feed, Samuel. Offer up your arm.\"\n\n\nYou hold your arm forward, as Count Grey grabs it, his mouth darting down to your bleeding wound with an insane speed. You close your eyes and wait for the pain of his bite, but instead feel his cold lips on your wound, instantly beginning to suck the blood out of your arm. You take a deep breath as you go pale, Haygarth putting your arm around his shoulder to keep you from fainting. After about a minute, Count Grey stops, raising his head as he smiles.\n\n\n\"Good. I was thirsty. The bitch from the other night was dry, and half her blood ended up on the floors. Good thing I managed to stop myself from draining you completely,\" Count Grey says.\n\n\nHe looks up at the sword that hangs above the coffin, staring at it for a second. \n\n\n\"Do you see that sword? While I like to keep up to date with my weapon technology, such as with rifles. grenades and the new and innovative Maxim Gun, in cases of the super-natural, the old stuff is the best. I've had that sword since I was a child. Forged it myself under command of my master. So many ancient, arcane inscriptions, horrid rituals and infinitely worse had to be done to make it the thing it is today. It's name is the Psychí Líptis. It is a killing machine. You will become the same.\"\n\n\nCount Grey s walking past you, and up the stairs. \n\n\nYou stand there, waiting, looking at Haygarth for what to do.\n\n\n\"Follow!\" Count Grey's voice booms.\n\n\nYou quickly hurry up the stairs after him.", "action_results": [null]}]}]}]}, {"action": "Refuse", "result": "\"No,\" you say.\n\n\n\"No?\" the vampire asks. \"You have more balls than I thought. You're courageous. Too courageous. Can't have you getting brave and trying to get revenge for your peasant father some day.\"\n\n\nWith that, the vampire grabs your head, quickly twisting it with unnatural speed, nearly tearing your head off before you can even blink in reaction.", "action_results": []}]}, {"action": "Beg", "result": "\"Please, please don't hurt my papa! We don't want any trouble! Please, show us mercy, and we'll remain forever loyal! We never miss food shipments...!\"\n\n\nThe Vampire snarls.\n\n\n\"You are a sheep,\" he snarls. \"Look at you. Look at all of you. Weak. Mindless. Sheep. You only exist to feed me. Your lifespan is measured in decades. I've lived over a millenia! I am the hunter, you are prey!\"\n\n\nThe vampire grabs Papa's head, twisting it with amazing speed. You hear his neck crack, as the vampire drops his limp body. Tears stream down your face, as he walks towards you. He grabs you by the scruff of your neck.\n\n\n\"You are a sheep,\" he snarls.\n\n\nHe flings you to the ground where you bounce off the wooden floor, skidding into the wall with a painful thud. Mama tries to strike him, but he catches her hand, yanking her into his grasp and biting down on her neck. She gasps as he tears open her throat, pressing his bloody mouth on the bleeding wound. He feeds for about a minute, as you lie there, too terrified to move. Then, he strides forward, catching your sisters by the hand and lifting them into the air. He flings them over his shoulder like a young lamb, and looks at you.\n\n\n\"Bleet,\" he snarls, before walking out of the door, leaving you alone.", "action_results": [{"action": "The Next Morning...", "result": "You only peer out of your blood-spattered house when the sun rises, driving the vampires back like a shepherd driving off a wolf pack. \n\n\nThe village is destroyed, and the vampire's promise is broken. Corpses lie strewn in the streets, in various states of dismemberment. One cadaver in particular stands out to you; the baker's son, who you used to play Knights and Goblins with, has been messily hanged with his own entrails. His face is bloated and blue, and you disgustedly realize that his eyes have been messily removed. \n\n\nYou open the door to your house. As it swings out, it pushes the bisected corpse of a village toddler out of the way. You promptly vomit all over the corpse. \n\n\nThe sound of a carriage rolling into town attracts your attention. Two riders sit astride, dressed as wealthy mourners attending a funeral might. The man nods curtly. \n\n\n\"You're probably quite angry, then.\" ", "action_results": [{"action": "Life continues.", "result": "A sob racks the woman's body as the grim-faced bishop slips the noose over her neck. \n\n\n\"Please,\" The peasant woman begs as he pulls it taught and prepares to kick her off the platform. \"I haven't done a thing, m'lord!\"\n\n\n\"For the crimes of murder, incest, communing with Satan and cannibalism, I sentence you to death.\"  The holy man's voice wavers at death. Sympathy? Guilt? His face is unreadable, as always.  A swift kick sends her off the platform.\n\n\nThe young woman slumps like a marionette with its strings cut as the rope goes taught. A sign around her neck reads WITCH!\n\n\nYou push through the crowd of peasant onlookers. Some jeer, some gasp in horror, but most shake their head and disperse, driven indoors by the chill and rain that comes with the mountain climate. Your hand touches the sword at your belt, feeling its reassuring weight. \n\n\n\"Father Harrison.\" you murmur, nodding your head to the older man.\n\n\n\"The sellsword returns,\" He looks at you disapprovingly. \"What brings you back? No more corpses left to butcher for coin?\"\n\n\nYou bite back a swell of irritation. \"Corpses that dine on human flesh. An important distinction.\" \n\n\nHe laughs. It's a cold, humorless sound. \"Of course. Best to charge for their disposal, no?\"\n\n\n\"Dangerous or not, I've still got to -\" \n\n\nHe silences you with a dismissive wave of his hand. \"I'll hear no more of it. Tell me what brings you back to Eden.\" \n\n\n\"I was looking to get my sword consecrated,\" You say evenly. \"I was told that the Holy Roman Church provided such services.\" \n\n\n\"We are obligated to, yes.\" He scowls. \"See Friar Jameson. Stay no longer than is necessary.\" ", "action_results": [{"action": "The Blood of the Christ", "result": "The basilica is empty, save for Friar Jameson, who frets over a golden bowl of what appears to be human blood. Along the carefully-crafted stone walls lie stained glass windows, displaying the adventures of various saints and angels from Catholic mythology. On the far wall is an oversized statue of Christ crushing the life out of a vampire with his two oversized fists. \n\n\nFriar Jameson looks up as the massive oak door swings shut behind you. He strides forward intently, grimly furrowing his eyebrows at you. He stops five feet away, glaring at you; you can feel his eyes pierce your very soul.\n\n\n\"Hello, Jameson.\"\n\n\nHe bursts into a grin and embraces you. You can feel your back crack under the big man's bear-like embrace. \"Good to see you, you mercenary bastard!\" \n\n\nYou awkwardly pat his back. \"Y-you as well, Jameson.\" \n\n\n\"What brings you back to Eden?\" He asks cheerfully, pulling back. You notice a fresh new scar running the length of his chin. \n\n\n\"Lodgings for the night, and a Consecration. Been tracking a pack across the damn continent. Pretty sure they passed by here not too long ago.\" You explain, rubbing your shoulder. You hope he doesn't hug you again. \n\n\nHis cheerful demeanor slips away, somewhat. \"A Consecration, huh? Might be trickier than you expect. Blood's been angry recently.\" \n\n\n\"How does blood get angry?\" You wonder aloud. \n\n\n\"Your guess is as good as mine, mate,\"  He frowns deeply. \"But shit's been  going very, very wrong with the Ministrations.\" \n\n\nYou're filled with a sudden impatience. You can feel your quarry slipping away. You hand him the leather scabbard, blade inside. \"Do your best, anyhow.\" \n\n\nYou leave the church, then, leaving Jameson clutching the blade with an ever-increasing look of alarm on his face. ", "action_results": [{"action": "You find yourself some lodgings for the night.", "result": "You find yourself some lodgings at The Serpent, a run-down, overpriced inn on the edge of town. The beer has more in common with water than booze, and prostitutes and alcoholics glower at you from the edge of the common area. \n\n\nYou rent yourself a room from the heavyset, nigh-incomprehensible Scottish bartender. He waves you to the back, where you find your meager lodgings. \n\n\nYou lay your head against the stuffed straw pillow and doze off instantaneously. ", "action_results": [{"action": "Morning in Eden.", "result": "The sun rises over the township of Eden,  beating back whatever bloodthirsty creatures of the night lurk in its darkened streets. A cry is taken up in the town square, and it's carried to your ears on the backs of frightened townspeople. \n\n\nAn old woman has been found dead in the night. Her one remaining arm is splayed out to the side, and the other lies ten feet away, on the other side of the street; it's been sucked dry of blood. \n\n\nFrom your vantage point in a nearby alley, you can see the church move in on the corpse almost immediately. Two glowering, armored figures dragging the corpse, along with the arm, back towards the basilica. \n\n\nOne of the Paladins glares at you as you as the corpse is transported to the religious fortress on the hill. He appears to give you a silent challenge to come follow him. \n\n\nYou suspect vampirism is at play, but there's no way to be certain until you can manually inspect the corpse for bite-wounds; otherwise, it could be werewolves, or even a plain serial killer. Of course, your sword is still  in the basilica being consecrated. \n\n\n ", "action_results": [{"action": "Follow the Paladins.", "result": "You follow the two agents of the  Church as they drag the desecrated corpse back to their armored fortress. You maintain fifteen feet of distance, and use the crowds and narrow, winding streets to avoid their suspicious gaze.\n\n\nYou become acutely aware of the two massive spears that they each carry; a four-foot hickory rod with a steel blade mounted on one end. You have no doubt that it could crack your head, or remove it wholesale, if swung by one of the two muscled brutes. \n\n\nThey ascend the winding path to the basilica, leaving a steady trail of visceral fluid as the corpse scrapes along the ancient cobblestones. ", "action_results": [{"action": "Surprise!", "result": "The unencumbered brute suddenly turns around, at a moment where you're exposed. You try to scramble backwards, but trip over your own feet. The last thing you see is the armored figure standing over you, prepared to club you over the head. ", "action_results": [{"action": "Sweet Sleep", "result": "Finding the armored grasp of the Paladin quite comfortable, you slip once more into the land of unconsciousness. You go limp once more, leaving yourself a heavy burden for the alleged holy man to drag along. \n\n\nYou awaken chained to a moist stone wall. A pounding headache graces your senses. \n\n\n\"Oh, shit.\" you say to no one in particular. \n\n\n\"Ephesians, four twenty-nine,\" A monotone voice chides you from the darkness. \"Let no corrupting talk come out of your mouths, but only such as is good for building up, as fits the occasion, that it may give grace to those who hear.\"\n\n\nEven in a dungeon, with a head injury, chained to a wall, you can't escape the proselytization of  Father Harrison. \n\n\n ", "action_results": [{"action": "Retrieving your sword.", "result": "The restraints effortlessly fall off. You rub your wrists, slotting your thumbs into the grooves dug in by the  chains. Harrison's words about retrieving your sword linger with you; you find it curious that the elderly priest directed you to arm yourself. \"Turn the other cheek\" appears to have been replaced by \"don't die\". \n\n\nYou leave the dungeon (why does the basilica have a dungeon?) and wince as sunlight assaults your senses once more. Your head injury flares up immediately, sending you sprawling to the carpeted floor. Curiously, your pain is ignored by the sparse population of friars and monks stewing about. \n\n\nYou stand at the back end of the room you entered two days before. Before you lies the rom where mass would typically be held. On the leftmost side of the wall closest to you is a doorway leading to the upper floors of the building. \n\n\nA longing strikes you, the sort and intensity of which you hadn't felt in years; a desire for something spiritual, something greater than yourself. You feel a newfound awareness for your place in the universe. Either that, or you got hit really fucking hard. ", "action_results": [{"action": "Take a moment for prayer.", "result": "You sit on the closest pew, and stare at the massive statue of Jesus Christ that dominates the preacher's stage. You bow your head a moment in contemplative prayer. It feels awkward, clumsy and out-of-place, and your throbbing head prevents you from any real introspection. \n\n\nAfter a few minutes, you get up to retrieve your sword. Intuition tells you it's upstairs. ", "action_results": [{"action": "Upstairs", "result": "The upstairs isn't as large as you expected, but to call it \"small\" would be a disservice. After walking up the fifty stone-tile steps, you find yourself in a carpeted hallway, stretching out for a couple of hundred feet in front of you. \n\n\nEither side is lined with small wooden doors, where the monks and permanent inhabitants of the church sleep. Behind you is the entrance to a library; given as this is a church, there's likely not much in the way of interesting reading, unless you like Latin bibles and apologetics. \n\n\nLogically, you know there must be an armory somewhere, but it's not up here. You head back downstairs. ", "action_results": [{"action": "Head downstairs.", "result": "You head back down through the central room and back downstairs. The stairs are little more than a darkened stone tunnel, lit intermittently with  flickering torches.  Through process of elimination, you realize that the armory must be somewhere on the subterranean level. \n\n\nYou walk down the stairs, with the trepidation of one who has lived their entire life in a world filled with vampires. Thankfully, nothing lurks in the shadows, and you reach the armory fairly easily. \n\n\nIt's roughly a ten-foot by ten-foot stone chamber, with walls lined with rifles and the like. You find your sword fairly easily, as it's been placed separate from the weapon's owned by the church, on an opposite table. You slam it into your scabbard and buckle it around your hip. \n\n\nYou go back upstairs. ", "action_results": [{"action": "Pounding at the Door", "result": "    You hear a pounding at the thick, oaken door. The three friars  milling about the central room look up in alarm. You quickly approach the door, and you’re ushered back by one of the stone-faced monks. \n\n\n    “It’s in all of our best interest if that door stays sealed.” he explains in mute tones, not meeting your eye, “A… large flock moved in on the town shortly after we sealed the church. Father Harrison saw fit to leave you untroubled with these matters.” \n\n\n    “Fuck.” you mutter, as you slowly begin to realize why you dislike the church. \n\n\n    “If you want to speak to him, he should be in the War Room.” the grim man explains quickly. \n\n\n    “Why the fuck would there be a War Room in a basilica?” you ask, growing more irritated by the moment. \n\n\n    “Perhaps,” he runs a hand over his bald scalp, sweating profusely, “It would be best if you allowed Father Harrison to explain this matter to you personally.” \n\n\n    “Perhaps,” you muse bitterly, “Where is the War Room?”\n\n\n    “Come.” he instructs curtly, as he walks back across the large room. You’re beginning to suspect that it may be a very long time indeed before another mass is held in it. ", "action_results": [{"action": "The War Room", "result": "    You recognize a half-dozen high-ranking priests and  town officials inside the strangely-titled War Room. They’re cloistered in a semicircle alongside a parchment map with arcane sigils scratched into it. You see what appear to be troop markers, which is strange in and of itself; why does the Roman Catholic church have an army at its disposal? What army is denoted by an upside-down cross? These questions burn into your mind as Father Harrison nods to you.\n\n\n    “I suppose you’ve started to understand that our purposes here aren’t exactly… ecclesiastical.” Harrison says acridly. He looks strange, armored in medieval chain with a double-barreled shotgun strapped to his back. Gone are the clipped, judgmental tones of an aging priest, having been replaced with the pragmatic, competent voice of a general ordering his troops. \n\n\n    “No,” you murmur, amazed, “Not much of a Christian operation you’re running here.” \n\n\n    He scowls. Warrior or not, the expression still fits him perfectly. “Deus Vult, my friend. Whether you like it or not, there are occasions when God demands his flock pick up the shepherd’s rod in his stead. Whether it’s warlike Mohammedans and blaspheming Jews, or bloodthirsty vampires… he cares little.”\n\n\n    You recognize the quotation from  one of the old historical texts Sir Gregory crammed down your throat. Pope Urban the Second, shortly before the first “Crusade. You’re planning a crusade.” \n\n\n    “Yes,” he says with a grim smile, “We’re planning a crusade.” ", "action_results": [{"action": "Specialist Knowledge", "result": "    “But… why?” you ask, equal parts fascinated and horrified. \n\n\n    “Why not?” he responds simply, “We’ve been fodder for too long. You yourself were almost a digestif, when you were a lad.”\n\n\n    Now it’s your turn to scowl. You’re beginning to suspect that Harrison might be a fucking nob. “Not how I’d describe a massacre of innocents, but that’s one way to describe it.” \n\n\n    “Semantics,” he mutters, waving your concerns aside  with a sharp gesture of the wrist, “Now, your… unique skills as a corpse-hunting sellsword put you in a uniquely valuable position.” \n\n\n    “But what would you have done if I hadn’t come here?” you ask. \n\n\n    “It was assured that you would come here. A job posting near Eden didn’t spring up organically.” he smiles, a touch of sinisterness brushing his lips. \n\n\n    “But why would I —“ \n\n\n    “You will be rewarded most handsomely, let me make that clear. \n\n\n    The situation becomes clear. He’s offering you a job. ", "action_results": [{"action": "Join the Crusade", "result": "    You’re not sure if you believe in God or not, but you believe in gold and revenge, and the Church has given you ample opportunity to sample both. Within a couple of months, your knowledge of the scourge placed you in control of a small garrison  in Eastern Europe. To your relief, you were far from the heavy fighting. \n\n\n    You expected a Crusade, but WWIII may be a better descriptor. Within a few days of the Pope’s declaration, mass hysteria gripped the general populace. Although good, faithful Catholics were more than willing to take up arms, Europe’s resident protestant and Jews were unwilling to fight, at first; this quickly changed when entire hamlets and villages began to disappear into the night. \n\n\n    Governments proved to be ineffectual for more than the usual reasons; most parliaments and senates had long since been infiltrated. A few dead heads of state and parliamentary massacres later, most of the governing  bodies were left headless. \n\n\n    As you saw, the  Church fought with little regard for the common man. Those who were unable to fight found themselves out in the cold, and those who found themselves out in the cold oftentimes found something colder still waiting in their homes. \n\n\n    Some might say you’ve found a grander purpose. Others might say you’re still a mercenary,  whoring out your dignity for gold. Perhaps, both are true. However, with the war raging, you have no time for such esoteric matters. ", "action_results": [{"action": "Mixed Squad Tactics", "result": "    Seven feet tall, if it’s a foot. Blood drips off its curled tusks, which protrude from its mouth like massive, arching fingers pointed upwards. How does a vampire become a monstrosity like this? Gabriel tells you that it’s a result of pacts with Satan. Raziel, the village apothecary, informs you that the vampires have “read the writing inside”, and have unlocked the secrets to transform at will. You’re not sure about either explanation. \n\n\n    Either way,  the beast is an immediate threat to the supply chain crossroads you’ve been tasked with defending. Gabriel trains his rifle on it; his hand shake violently as he takes aim. You can see him struggle to hold on to his gun, white-knuckled and terrified. The two other men at your position are all in similar states of apprehension.\n\n\n    The ground vibrates slightly as the colossal horror shambles onwards, marching down the forested road for reasons unknown. In the feeble light of the streetlamps, you can see the blasphemous tokens hanging about its neck, made out of bits of human bone and sinew. \n\n\n    Your hand touches your own weapon, a plain-looking revolver hanging in a simple leather pouch at your waste. \n\n\n    You could annihilate the beast right now, and bring an end to its life; or, you could follow it back to its lair, and see if you can’t drive out the swarm.", "action_results": [{"action": "Bring it down!", "result": "    “Fire!” You whisper fiercely to Gabriel. He complies immediately, violently jerking on the trigger. His shot goes wild, and strikes the foliage behind the creature. A flock of crows takes flight into the trees, blotting out the moon in their frantic numbers. \n\n\n    The other two men dive for their weapons, and launch a hasty volley as the creature bellows out a challenge. One bullet strikes its shoulder, rewarding the firer with a burst of thick, tar-like ichor. The other strikes a tree branch, scoring its deep  bark with an ugly new wound. \n\n\n    By the time you reach for your weapon, the jig is up. The creature barrels into your team of saboteurs, sending you barreling into the underbrush,  and sending your pistol flying into the bushes some four feet away. You sympathetically wince as the vampire plants a foot on one Gabriel’s chest, and crushes his ribcage in one motion. \n\n\n    You shimmy through the scratching thorns, frantically searching for your only hope of salvation. Struck by the back of a monstrous fist, a man begins an ill-fated flight into the night sky. \n\n\n    Your grasp closes around the revolver as the third man is run through with a clenched fist through the stomach. Hot blood coats your face as he twitches and feebly claws at the oversized creature’s massive bicep.  You scream in agony as a foot crushes your right hand, shattering the bones within. \n\n\n    You look up, and see the beast   standing above you. The ghost of a smirk touches it’s oversized features as it grabs your other arm and plants its foot on your chest. An enormous force is applied to your shoulder. As the agony grows, you become aware of your muscles and tendons snapping like rope, until your arm is pulled free of your body. Darkness takes you then. ", "action_results": []}, {"action": "Follow it.", "result": "    You decide then to trail the beast, hopefully finding its lair in the process. Silently, you motion for the two other saboteurs to stay back, taking just Gabriel with you. Out of all the village conscripts, you find him to be the least incompetent. That, and he quickly learned the valuable skill of shutting up. Terror crosses the boyish face under a blonde mop of hair, but he nods.\n\n\n    You creep down the secluded lane, carefully avoiding twigs and treacherous birds. Crows, in particular, appear to be friends of the vampires; you’ve seen many a man fall to startled birds. Well, that and horrific injuries to the jugular. \n\n\n    You stalk the beast for a good quarter mile, before it stops, seemingly at random, somewhere along the forested road leading into town. It steps into the bushes across the road from you, and looks down. And then, it vanishes completely. \n\n\n    You move to follow it, and then you abruptly faint. The strings of consciousness are severed, leaving you as a marionette plummeting towards the stage. ", "action_results": [{"action": "A gateway.", "result": "    You awaken in a cold sweat, bundled in rags, and restrained to a bed. You find yourself in a small shack, scarcely illuminated by a few candles. It appears to be held up by naught but twigs and thatch, bound with bundles of rope. Piles of books line the corner. If you focus, you can see an unfamiliar language that makes your eyes water. \n\n\n    An old man with a face like a mannequin flits about the shack. What he’s doing is unknown to you, as are his intentions. You gasp in horror as the candlelight surges; for a moment, you can see a pair of skeletal wings, extended into the shadowed corners of the makeshift building.\n\n\n    He turns,  and you wince as you feel his bright eyes bore through your defenses, laying bare your very soul. “The prodigal son awakens!” he tuts. \n\n\n    “Prodigal son?” you ask as you regain your faculties. \n\n\n    “I certainly hope so.” he responds with a warm chuckle. \n\n\n    “Why?” \n\n\n    “Disorder is bad for research.” he responds matter-of-factly, as if he were stating that the sky is blue. \n\n\n    “Research… what do you research?”\n\n\n    His body goes rigid. “Nothing.” \n\n\n    “Nothing?” \n\n\n    “Everything.” he smiles guiltily. \n\n\n    You decide to change tack. “Why did you bring me here?”\n\n\n    “I didn’t bring you anywhere,” he says defensively, “Gabriel brought you here.” \n\n\n    “Why did he do that?” you ask. His double-talk is quickly growing tiresome. \n\n\n    “You fainted,” Raziel assumes his matter-of-fact tone once more. “And I nursed you back to health?” \n\n\n    “How did you nurse me back to health?”\n\n\n    “I tied you down to prevent you from biting your fingers off.” \n\n\n    “Why would I bite my fingers off?”\n\n\n    “You had a fit of madness.”\n\n\n    You let out an even sigh through your teeth. “Why did I have a fit of madness?”\n\n\n    “It would appear that you looked into Hell.” despite the sudden and abrupt lurch  to the unusual, his clipped, explanatory demeanor remains unchanged. \n\n\n    “I looked into Hell?” you ask, incredulously, “How did I do that?”\n\n\n    “You stalked a vampire, no?” Raziel takes the tone of a disappointed teacher, or perhaps a parent. \n\n\n    “Yes.” you sound suspiciously like a misbehaving child. \n\n\n    “Well,” he explains, “It’s only rational that you looked  into Hell.” \n\n\n    “Why in the hell would it be normal for me to look into Hell?” your temper flares, before you restrain it once more. He doesn’t seem to notice. \n\n\n    “Vampires are dead, no?” \n\n\n    “Yes, vampires are dead.” \n\n\n    “Dead people go to Hell, no?” \n\n\n    “I’m not so sure.” you’re unsure of how he’ll take to your agnosticism. \n\n\n    “They do, trust me,” the ghost of a smile touches his lips, “As an undead species, vampires can traverse Hell if they’re so inclined.” \n\n\n    “Oh, of course.” he doesn’t seem to pick up on the sarcasm. \n\n\n    “Do you know how undeath works, Samuel?” gooseflesh ripples up your arm as he glares at you. You realize for the first time that he’s blind.\n\n\n    “No.” you nervously respond. The temperature in the room must have dropped thirty degrees. \n\n\n    “God is a novelist,” he whispers. \n\n\n    “A-a novelist?” you stammer back. Who is this man?”\n\n\n    “His works are written in blood.” A single tear leaks out of the old man’s broken eye. He ages forty years in front of you, and suddenly seems very small and fragile indeed. \n\n\n    You begin to shiver uncontrollably. “W-what do you mean?” \n\n\n    “The Church can only repeat his works. I read too many of them, that’s why he took my eyes.” \n\n\n    “Who took your eyes?” A surge of dread seeps through you, from your chest down to your gut, and into your toes. You feel heavy under the weight of your terror. \n\n\n    “They’re are writing their own works.”  he wheezes in pain, as if he’s under duress. \n\n\n    “What does that -“ \n\n\n    “We have little time,” the strength seems to fade from him, “you must become a copyist to find their strength.”\n\n\n    “How do -“ Your question is interrupted by his lifeless corpse hitting the ground. \n\n\n    You wake up on the forest floor, gasping for air. ", "action_results": [{"action": "Awakening.", "result": "    The morning rays of dawn cannot penetrate the deep, unsettling, soul-penetrating cold that set in on you over night. You crane your neck, listening to the individual pops as your spine aligns itself. You look over, and see the corpse of Gabriel in the bush next to you. He’s frozen in place, an awful terror burned into his face for all of eternity. You pick up his rifle, and begin to walk back to town. \n\n\n    Raziel’s words linger in your mind as you approach the hastily-erected fence around town.  \n\n\n    “Mornin’,” the watchmen mumbles though his late-in-shift exhaustion. \n\n\n    You rub your eyes. “Where’s Raziel?”\n\n\n    The watchmen looks at you, puzzled. “Who in the Hell is Raziel?” \n\n\n    “Nobody,” you respond, sharing in the man’s exhaustion, “did any of the men make it back?” \n\n\n    He shakes his head. “Nossir, thought they was with you!” \n\n\n    “Fuck,” you mutter, “That’s a damn shame.” \n\n\n    “Sounds like you had quite the night, sir,” he remarks, “Sure Father ‘oud love to here about it.” \n\n\n    “I need sleep.” You mutter absentmindedly, already brushing past the man on the way to your quarters. \n\n\n    “Don’t we all, sir?” He laughs, bitterly. ", "action_results": [{"action": "Head back to the church.", "result": "    You meander through the makeshift wall, and slowly begin your walk back to the church-turned-stronghold that quickly became the seat of power for the local religious militia. You marvel at how dirty the town had gotten; what was once a small European township with cobblestone streets and small, mom-and-pop businesses on every corner was now filthy, and comparable to a refugee camp. Old fire-barrels and trash litter the ground.  The people you pass glare at you; perhaps one too many brush with looters is all it takes to gain a permanent mistrust of your fellow man. \n\n\n    Your stroll ends at the church. A sign once read “FIRST PARISH CHURCH”, but it’s long since been replaced with  a small sign that says  “BASE OF OPERATIONS ” in small black lettering. \n\n\n    The door to the small, unassuming little building has been ripped off, you you move the rubbery tarp aside as you enter. As with most churches converted to military strongholds, the pews have long since been scrapped for their requisite parts and nailed to the windows. \n\n\n    The church smells of woodsmoke and unwashed bodies, consequences of the smoldering flame and lack of running water in the town.  Fifty or so men are packed into it, milling about in various states of undress. \n\n\n    In the far right corner, there’s an entrance to back room; this is where you need to be. ", "action_results": [{"action": "Reporting in.", "result": "    You enter the small office in the corner of the church, after shouldering your way through the dense crowd of sweaty, compacted men pressing in on each other. \n\n\n    It’s original purpose was probably for the pastor to have a place to prepare his notes and sermon, but it’s been co-opted by the local militia,  and is now used as a place for the local  alderman to gather his thoughts and meet with advisors. \n\n\n    The alderman is a small, grey-haired old  veteran, worn out by  the horrors of a lifetime of campaigns. You once heard that he cut a man’s head off with a trenching  shovel. \n\n\n    “Was your mission successful?” he croaks. \n\n\n    “We were able to counter a vampire raid from the usual spot,” you begin, “but we made another, more alarming discovery.” \n\n\n    “Don’t keep me in suspense, boy.” he croaks bitterly. The old man laughs, then; it’s a cold sound, lacking in mirth and warmth. \n\n\n    “I collapsed, shortly after I witnessed a large vampire disappear into the underbrush.” you explain, as you begin to doubt your own experience. \n\n\n    “You collapsed? What’s the matter, boy? The cold finally get to you? Would you like a cup of tea?” his sarcasm is grating, as always. You’d punch him, but hanging from a pole isn’t in your wheelhouse. \n\n\n    “And after I collapsed, I had some sort of vision, or dream, or something.” your head begins to ache. \n\n\n    “Well, boy. Do tell of this vision-dream-something you speak of.”\n\n\n    You explain your vision in excruciating detail. His mask of snark and sarcasm drops quickly, and he leans forward in keen interest. His hands rest on his knees, and you can’t help but notice that they’re faintly shaking. \n\n\n    “Well, boy, it sounds like your vision-dream-something knows a thing or to, eh?” He grins unexpectedly. \n\n\n    “Sounds like it.” you say warily. You were expecting a religious tantrum, not a… whatever this is.\n\n\n    “So he was instructing you to become a copyist,” the man lets out a heavy sigh, “One can assume that he wasn’t intending for you to live the life of a medieval friar.” \n\n\n    “One can assume.” you echo. \n\n\n    “So if a vampire can read “God’s Language”, then it sounds to me as if he’s telling you to become a copyist of it; that is, he wants you to become a vampire.” \n\n\n    “Shit.” you mutter.\n\n\n    “Shit indeed, ” he responds quietly, rubbing his beard, “Well, I suppose the decision has to be yours, then. Far be it beyond me to judge matters of the soul.”  \n\n\n    “But you’re the alderman, aren’t you going to tell the men?” you ask worriedly. You know the local  superstitions; the second you’re suspected of communing with the devil, you’re one of “them”. \n\n\n    “Tell them what?” he says meaningfully. ", "action_results": [{"action": "Mulling it over.", "result": "    You spend a fevered night at the church, tossing and turning. You’re chased through your dreams by a winged specter, gurgling at you in a language unknown to you. You run through a shadowed forest like a deer, artfully bounding over roots and tree-branches in the night. However, it isn’t enough, and the cruel ghost is never more than a few feet behind you. \n\n\n    You awake with a start, shortly before dawn. Not  a soul has stirred. You go outside, taking in the once-beautiful landscape of the small Eastern European town that has become your home.\n\n\n    And then, quite abruptly, a vampire leaps onto your back, sinking its fangs into your shoulder. You react immediately, grabbing two fistfuls of its dry hair and throwing it into the ground. You plant a boot on its neck before it can react, and quickly snatch your revolver from its resting place. One bullet to the brain and its struggles cease. \n\n\n    Onlookers rush towards you.  You’re infected. You know that it’s only a matter of time before you’re strung up and left as an example. Even if their intentions are sympathetic, your path is clear; running. \n\n\n    You fire another bullet into the air, startling the would-be first responders rushing towards you. With a cry of “back the fuck off!”, you run off into the woods, towards where you spotted the gigantic vampire. ", "action_results": [{"action": "Gateway", "result": "    You run full-pelt into the woods, exhausting your supply of stamina and then some. Your lungs beg for air, and your face goes flush as you prop yourself up against a nearby tree. You appear to have escaped your would-be pursuers, but the concept of a militiaman running about as an undead beast will likely bring them back in force. \n\n\n    You can see the gateway that you saw a vampire walk through earlier. Perhaps, “see” is the wrong word; you can sense it. Like something in the corner of your vision, you know that it must exist, and where, even if you aren’t laying eyes  on it directly. \n\n\n    Out of options and desperate, you approach the hole in the ground. It’s cold and has no precise dimensions, appearing to you as a  circle of indeterminate radius, shifting and slithering along the ground. It feels strangely inviting; like a blanketed bed in the morning. \n\n\n    You could slip through, but there’s no guarantee of what you’ll see on the other side. Or, you could stay right here. ", "action_results": [{"action": "Enter the gateway.", "result": "    You step through. It feels as if you’ve just leaped into a pool; one moment you are on Earth, in the realm of the living, and the next, you are in the next life. Immediately, you feel uncomfortably warm. Sticky, uncomfortable sweat clings to your clothing as you materialize in a small dirt tunnel. \n\n\n    Your arms and legs are uncomfortably close. There’s no room to stretch out, or even crawl backwards; you’re forced to slowly move forward. Vampirism begins to set hold on you;  you feel weakened and feverish, as you begin to die. \n\n\n    You can see an exit. It’s even narrower, and roughly fifteen feet away. Beyond it is complete and utter darkness. You force your failing muscles to propel you towards it. With a final, titanic effort, you force yourself out through the hole. \n\n\n    You feel yourself falling down a gigantic hole, down to the interminable depths. Suddenly, you enter through another gateway, and rematerialize on a corn field. If you had to guess, you’d say you’re in Kansas at eight o’clock in the evening. \n\n\n    You see the Devil standing before you. He’s tall and cultured looking, clad in a tuxedo and clutching a timepiece to his breast. He smiles at you. \n\n\n    “My friend,” he begins in a vaguely English accent, “We’ve so much to talk about!” ", "action_results": []}, {"action": "Don't", "result": "    You decide to reject the vampirism thrust upon you. If it means dying as a man, so be it. You turn your back to the gateway, and walk back towards the town. Already you can feel yourself growing feverish and weak, as the disease takes hold. Soon, the son will burn you to a crisp; and that’s just fine with you.\n\n\n    You put your head to the ground and close your eyes. You’ve earned yourself some rest. ", "action_results": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"action": "Do nothing", "result": "The vampire grabs Papa's head, twisting it with amazing speed. You hear his neck crack, as the vampire drops his limp body. Tears stream down your face, as he walks towards you. He grabs you by the scruff of your neck.\n\n\n\"You are a sheep,\" he snarls. \"Look at you. Look at all of you. Weak. Mindless. Sheep. You only exist to feed me. Your lifespan is measured in decades. I've lived over a millenia! I am the hunter, you are prey!\"\n\n\nHe turns, walking towards Mama. Mama tries to strike him, but he catches her hand, yanking her into his grasp and biting down on her neck. She gasps as he tears open her throat, pressing his bloody mouth on the bleeding wound. He feeds for about a minute, as you lie there, too terrified to move. Then, he strides forward, catching your sisters by the hand and lifting them into the air. He flings them over his shoulder like a young lamb, and looks at you.\n\n\n\"Bleet,\" he snarls, before walking out of the door, leaving you alone.", "action_results": [null]}]}