{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=10872", "context": "", "first_story_block": "The thug is right in front of me, picking on people weaker than himself. The very definition of a coward. Attacks unarmed people, specifically chooses those that cannot defend themselves. It's people like this that make project: Eden sound like a good idea. He hasn't spotted me yet. He probably wouldn't if I glowed in the dark, dimwitted asshole. He has a knife, but it's not like that's much of a challenge, not for a Homo Perfectus.\n\n\n \n\nREMAINING HEALTH: 100%", "action_results": [{"action": "Attack the thug from behind.", "result": "I come at the thug from the shadows and punch him across his face. I seem to have forgotten to increase my strength, so the hit doesn't take him out. Panicing, he swiftly swipes the knife at me, and barely manages to slash my arm. I then deliver a second hit, and this one takes him out. The fact that a punk like him managed to get a hit at me is more painful than the actual wound.\n\n\nREMAINING HEALTH: 85%", "action_results": [{"action": "Talk to the victim.", "result": "I approach the civilian, who is still cowering on the ground.\n\n\n\n\"Are you alright?\"\n\n\n\nHe looks up and sees who I am.\n\n\n\n\"I...yeah. Did you...\"\n\n\n\n\"You should be safe now. I hope this reminds you that Gorgon city is not safe during the night.\"\n\n\n\n\"Right, yeah. Thank's again.\"\n\n\nREMAINING HEALTH: 85%", "action_results": [{"action": "Leave.", "result": "I've done what I can here. Best I go back home. It takes time, since most of it is just walking as I don't have the necessary speed to run across the rooftops, but I get there eventually.\n\n \n \n\nREMAINING HEALTH: 85%", "action_results": [{"action": "Enter the apartment.", "result": "I press the key into the slot and open the lock. I then push the door open, wobble towards the couch and hurl myself into it. I intentionally placed the couch there, I am always so tired after a ten-hour Shade marathon, which I take almost every day. The city is just as dark as before. Adam gave the scum of the Earth a second chance, and this is how they use it. Stealing and killing anyone or anything they can think of! After a few minutes of resting I decide to close the door. I don't want anyone in the building to see Shade sitting on the couch placed directly in front of the front door, do I? That would be inconvenient for me as Eve. Now, I should probably take care of this wound. Damn bastard getting a lucky shot.\n\n \n \n\nREMAINING HEALTH: 85%", "action_results": [{"action": "Stop the bleeding.", "result": "I immediately enter the bathroom and remove my jacket. Some blood has stained it, and it was slightly cut as well, but it has seen worse. I cover the wound with bandages and apply pressure onto it. Soon the bleeding has stopped. The wound is still there, but this fixes a majority of the problem.\n\n \n\nREMAINING HEALTH: 85%", "action_results": []}]}]}]}, null]}, {"action": "Wait and see what transpires.", "result": "I decide to wait for a better opportunity  to strike. After all, if he was closer and did not see me, I could take him down quickly, silently and painlessly. However, he starts circling around his victim, and doing that, he spots the pair of red glowing eyes staring at him from the depts of the alley.\n\n\"Shade!?!\"\n\nJust as I though, this guy is a coward. As soon as he sees someone who could fend him off and bite back, he turns around and runs away.\n\n\nREMAINING HEALTH: 100%", "action_results": [{"action": "Sprint after him.", "result": "Trying to catch him without any speed enhancement proves challenging, but in the end, without any Homo Perfectus enhancements, I prove to be the faster individual and catch up with him. I grab him and throw him at a wall, which he bounces off and lands on the ground, knocked out. He was even more of a whimp than I thought. Typical of a thug like him.\n\n \n\nREMAINING HEALTH: 100%", "action_results": [{"action": "Talk to the victim.", "result": "I approach the civilian, who is still cowering on the ground.\n\n\n\n\"Are you alright?\"\n\n\n\nHe looks up and sees who I am.\n\n\n\n\"I...yeah. Did you...\"\n\n\n\n\"You should be safe now. I hope this reminds you that Gorgon city is not safe during the night.\"\n\n\n\n\"Right, yeah. Thank's again.\"\n\n\nREMAINING HEALTH: 100%", "action_results": [{"action": "Leave.", "result": "I've done what I can here. Best I go back home. It takes time, since most of it is just walking as I don't have the necessary speed to run across the rooftops, but I get there eventually.\n\n \n \n\nREMAINING HEALTH: 100%", "action_results": [{"action": "Enter the apartment.", "result": "I press the key into the slot and open the lock. I then push the door open, wobble towards the couch and hurl myself into it. I intentionally placed the couch there, I am always so tired after a ten-hour Shade marathon, which I take almost every day. The city is just as dark as before. Adam gave the scum of the Earth a second chance, and this is how they use it. Stealing and killing anyone or anything they can think of! After a few minutes of resting I decide to close the door. I don't want anyone in the building to see Shade sitting on the couch placed directly in front of the front door, do I? That would be inconvenient for me as Eve.\n\n \n \n\nREMAINING HEALTH: 100%", "action_results": []}]}]}, null]}, {"action": "Throw something at him.", "result": "I grab a nearby chunk of rock and throw it at the thug. However, he is not only moving, but getting further and further away, so the throw misses. Perhaps if I had a more pinpointed vision, I would have gotten him. Regardless, he escaped.\n\n\nREMAINING HEALTH: 100%", "action_results": [null, null]}, {"action": "Let him go and attend to the victim.", "result": "I decide not to pursue him any further and let him run off. He'll have learned not to give me a reason to kick his ass anyway.  Instead, I turn my attention towards the civilian.I approach the civilian, who is still cowering on the ground.\n\n0VOCALS%=%0%\"Are you alright?\"%%\n\n\n\nVOCALS%=%0%He looks up and sees who I am.%%\n\n\n\n\"I...yeah. Did you...\"\n\n\n\n\"You should be safe now. I hope this reminds you that Gorgon city is not safe during the night.\"\n\n\n\n\"Right, yeah. Thank's again.\"\n\n\nREMAINING HEALTH: 100%", "action_results": [null]}]}]}