{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=11545", "context": "", "first_story_block": "The sound of your alarm clock wakes you and you groggily switch it off. You go through your normal morning routine and grudgingly head off to your job. As always, you arrive at work on time and walk straight into the back room to put on your uniform. Once there you notice your best friend, Ian, is already dressed and preparing to begin.\n\n“Hey Jake.”\n\n“Hey Ian, ready for another exciting day?” You ask sarcastically.\n\n“Oh yea, working here has been highlight of my entire life.” He replies with equal sarcasm, “I hope I never quit.”\n\n“Ah yes, stocking food has always been a dream of yours hasn’t it?”\n\n“A lifelong-dream. Now if you’ll excuse me, it’s time to live that dream.”\n\nHe grabs a small nearby crate and rolls it into the main area of the store. You never thought he would end up as a stock boy in a grocery store. Then again, you thought both of you had bright futures. Although you were never really motivated to do anything, Ian was and certainly should have succeeded. You sigh and change into your uniform; this is your life and there’s no point in brooding over what could have been.\n\nThe day goes by relatively quickly, which is about the only benefit to the job. However it’s a rather hollow benefit, as the day passing by faster just means you have to work that much sooner the next day. You and Ian wave goodbye to each other at five o’clock and you walk to your small one-bedroom apartment, reaching it by 5:30pm.", "action_results": [{"action": "A strange dream", "result": "You blink your eyes and look at your new surroundings. You’re alone in the middle of a classroom, a very familiar classroom. Glancing down you notice you’re sitting in a desk and that there’s a small ‘J’ carved into the bottom right of its surface. This is your desk. At least it was, some point in time many years ago. Bringing your attention back up you notice the class is now filled with other students, each sitting in their own desks frantically writing notes. You don’t recognize any of them, or rather you can’t since none of their faces are clear to you. A teacher stands at the front of the class by the blackboard, presumably lecturing, though you all you can hear are muffled words.\n\nYou idly glance around the room and notice something out of place. A girl stands in the doorway, with long blonde and pink hair, flowing down to just above her waist. You stare at her for a while, trying to remember who she might be. No one else in the class pays any attention to her, and like the rest of them, you can’t seem to make out her face. Suddenly, she turns around and runs down the hallway.\n\nYou stand up and walk out of the classroom, ignored completely by the rest of the class. As you enter the hallway, you look down the way you saw her ran, but see no one. Curious, you continue down the seemingly endless hallway trying to find her. Finally, you seem to reach the end, as a black metal door now blocks the path. Grasping the handle, you push it open. A bright light emits from the inside, blinding you and preventing you from seeing what’s beyond the door. Curiosity gaining the better of you, you close your eyes and step through the doorway.", "action_results": [{"action": "The other side", "result": "“Jacob, wake up it’s time for school!”\n\nYou hear a familiar voice yell to you, and you groggily wake up in response.\n\nWhat a strange dream...\n\nYou try and remember the girl from your dream, but can’t figure out who she was. The classroom was probably from your high school, but as far as you can remember that girl was never in any of your classes. You shrug and proceed to get up. After all, high school was years ago, it wouldn’t be unusual for you to forget a few people in that time.\n\nOnce fully awake, the reality that you live alone dawns on you; there should be no one yelling for you to wake up. Then another thought occurs, you don’t go to school anymore either. Confused, you stand up and walk over to your dresser, which seems different from usual. Opening your drawers you notice your clothes seem different as well. Now even more confused, you get dressed and exit your room to find some answers. Outside your door you find your younger sister standing in front of you, in the uniform that she wore during high school. That is to say, while she has the same face, green eyes, and short brown hair as your sister, she looks considerably younger than she should.\n\n“Mom says wake up.” She states quietly, then turns to walk away.\n\n“Um, Tina?” you say, trying to confirm it’s her.\n\n“Hm?”, she replies softly, turning towards you.\n\n“Ah, um, never mind. I’m up.”\n\nShe nods and walks away. You return to your room and look for your backpack, the one you remember using in high school. Sure enough you find it, right beside your dresser. You open it and grab one of your notebooks, hoping to confirm what you think has happened. You turn to the last note in the book and look at the date:\n\nApril 24th, 2008\n\nYou walk to your bed and sit down, trying accept what has happened. Yesterday was April 23th, but the year was 2018. Ten years ago you were 18 and in your last year of high school. The fact that your sister was in her private high school uniform confirms this, since she was in her first year of high school when you were in your last. Your thought process is interrupted by the familiar yell of your mother.\n\n“Jacob, hurry up! You’re going to be late!”\n\nThere’s no point in thinking over this any longer. You quickly grab your bag and head down the stairs to the front door.\n\n\"Remember, you need wake up early on Saturday to bring your sister to school, since I'll be working.\"\n\nYour mother tells you, as she stands beside you watching you put on your shoes. You nod quickly in response, and although you’re tempted to hug her or say you’ve missed her, you put it off. The you in the past wouldn’t have done it, so you’re not going to do it either. After all, if this really is the past then doing something different could screw up the future in a major way.\n\nYou open the door and find Ian standing in front of you. Well, a younger version of him.\n\n“It’s about time Jake, you goin' to school today or what?”", "action_results": [{"action": "Yes", "result": "“Yeah.”\n\nYou turn and wave goodbye to your mom, who waves in response, then quickly walk down your front porch to Ian. The two of you reach the sidewalk before you take a brief look back at the house.\n\nExactly as I remember it...\n\nThe walk to school is uneventful. Ian tells you some story involving his older brother but you don’t really pay attention. The thought that you’re ten years in the past is all you can think about.\n\n“Hey.”\n\nIan pushes your shoulder once you reach the entrance of the school and the two of you stop. He has a concerned look on his face.\n\n“You alright? You sick or something?”\n\nHe asks.\n\n“Huh? No, I’m fine. Don’t worry about it.”\n\nYou walk ahead into the entrance of the school and Ian follows shortly after.", "action_results": [{"action": "Class", "result": "Although you roughly knew how to get to the school on your own, you have no idea what class you have. You follow Ian in hopes that you have the same first class together. Once at the classroom door Ian turns to you with a puzzled look.\n\n“Aren’t you going to class?”\n\n“Uh, yea...right...”\n\n“You’re acting pretty weird today man.”\n\n“Yea well...today’s a pretty weird day for me.”\n\nIan seems even more confused now, but decides to drop it and heads to his seat once he hears the warning bell. You walk down the hallway a little further before opening up your bag in hopes of finding some sort of clue telling you where you’re supposed to be. Inside you find various notebooks and textbooks, but nothing concerning your schedule. You sigh and notice the hallway is now completely empty.\n\nThe final bell which marks the start of class should be ringing any minute and you have no idea where you’re supposed to be. Unsure of what to do, you decide to sprint down the hallway and look for whatever seems familiar. Fortunately (or perhaps unfortunately) you find two room numbers across from each other which seem somewhat familiar: Room 134 and Room 135. You’ll have to guess which is the right room.", "action_results": [{"action": "Room 134", "result": "You quickly open the door to room 134, the final bell ringing almost as you enter. You managed to make it on time. At least you would have, had this actually been your 12th grade class. Inside you recognize the teacher as the one you had in your 11th grade history class. However, apart from her no one else looks familiar, so this isn’t your class. This is further confirmed when the teacher begins speaking to you.\n\n“Why hello, Jacob. Did you miss me and my class so much you felt compelled to return?”\n\nYou grin, unable to withhold a sarcastic reply.\n\n“Yes, yes I did. May I have a seat?”\n\nThe teacher smiles, amused you played along.\n\n“Sadly no, you will have to return to your classroom.”\n\nShe then points you to the door. You shrug in response and walk across the hall to room 135, the correct room.", "action_results": [{"action": "Late for class", "result": "You enter room 135 a few moments after the bell rings, your attention quickly brought to the middle-aged man at the front of the room. He strokes his short beard while glaring at you.\n\n\"So, Jacob, I see you've arrived late.\"\n\nHe says in a angry tone. Luckily, and unfortunately, it seems like this is in fact your current class, which makes you late. The rest of the class joins him in staring at you as you awkwardly nod in response. You've never been particularly nervous in front of crowds, but you still dislike being the center of attention for a negative reason.\n\n\"I'm sure you understand this means you will have detention after school today.\"\n\nHe continues in a demeaning tone. Again you nod in response and quickly take a seat, trying to ignore the majority of the stares in the class.\n\n\"Now then class, reviewing what we learned yesterday...\"\n\nThe teacher says, beginning his lecture as he turns to face the blackboard. You pay attention for the first few minutes, as a sort of apology for being late, but you quickly lose interest in the topic itself. If you really have gone back in time, then you already know all this anyway; at least that's the excuse you give yourself. You idly look around the room for anything that looks familiar as he drones on.\n\nYou sigh softly, thoroughly confused at your current situation and bored with this class. Eventually, you spot a girl in the corner of the room that you seem to recognize. Or, rather than recognize, you should say you feel like you know her, for some reason or another. No name comes to mind, nor any memories involving her, but for some reason you still think she's someone you know.\n\nLong, black hair, with brown eyes, and a slim figure. What's most noticeable about her though, is her gothic outfit of all black, complete with a spiked dog collar, and black painted finger nails. Looking at her closer, you determine that her black hair is probably dyed, your guess being her originally hair colour is a light brown. You brood over how you may know her, and your predicament as a whole, until the class finally ends. As the goth girl leaves she seems to ignore you completely. Maybe you don't know her?", "action_results": [{"action": "Continue with your classes", "result": "The rest of the day goes rather smoothly, sort of. Eventually, your body seems to fill in the blanks as to where you're supposed to be going, and you manage to find the rest of your classes for the day without issue. Unfortunately, Ian wasn't in any of your classes, and you got lost during the lunch break, so you've spent the school day feeling incredibly awkward and alone.\n\nSadly, that's the least of your worries. You've also spent the majority, or rather the entirety, of the day pondering over your current predicament. If you really have gone back in time, there's a lot you can do to improve your future, probably. While that's the conclusion you've reached, you really have no idea where to start in order to \"fix\" your future. Sure being a stock-boy isn't a grand job, but what else can you actually do? What exactly is there to \"fix\"? Maybe you're just meant to live unhappily in the future. Maybe you should just enjoy your youth while you can, and accept your future.\n\nMaybe you can't even change anything. If fate is real, then any attempt you make to actually change the future should result in, well, nothing happening and the future merely correcting itself. At least, that's what you think. Truthfully, you have no idea what may or may not happen if you attempt to change anything. In fact, you being in the past means you're bound to do something different at some point anyway.\n\nPutting all that aside, even more questions come to mind, that you actually try to ignore. \"Why\" and \"how\" being the two most disturbing. Even if you can accept you've gone back in time and need to relive the last ten years, you have no idea why this happened, or how it could possibly be possible. Sinister answers are the ones that come to the front of your mind, the most prominent one being that you've somehow pissed off some supernatural being that has decided to make you loop through time forever, until you're driven insane.\n\nYou always were a pessimist. Although you try to shake it off as impossible, the idea of going back in time was also something you thought impossible up until recently, so you can't get rid of the idea completely. As the day ends, you walk to the front entrance of the school, mentally exhausted.", "action_results": [{"action": "Remember you have detention", "result": "Suddenly, as you reach the front entrance of the school, you remember you have detention. You sigh, not thrilled at the prospect of having to spend the next hour sitting in a class to make up for something you didn't even do intentionally. Ian approaches you from behind and then reaches your side, looking at your face as he does.\n\n\"We going?\"\n\n\"Sorry, I was late for my first class. I got detention...\"\n\nHe frowns, though he doesn't seem that shocked.\n\n\"Alright man, I told you to hurry there though.\"\n\n\"Yeah I know...Where is detention by the way?\"\n\n\"Er, Room 225...\"\n\nIan replies, confused that you don't seem to know something that obvious. He looks like he's about to address the issue, but you quickly thank him and head towards room 225, leaving him behind.\n\nSure enough, it's the correct room for detention. An older woman you don't recognize at all sits at the front of the room. She looks up from her book in time to give you a quick glance, then returns to reading. You put your bag at the side of the room and take a seat away from most of the other delinquents already in the room, not wanting to associate yourself with them. You're only here because you've gone back in time after all, you're not like them.\n\nAs the minutes pass, you find yourself looking around the room for anything of interest, and quickly spot something, or rather someone. The gothic girl from your first class is also in the room, staring out the window and paying no attention at all to the others in the class. She's only two chairs over from you, and with no one between you and everyone else in the class already occupied, you figure you can use this time to talk to her. If you actually want to that is. It is detention after all, so if you're caught you'd likely be punished.", "action_results": [{"action": "Try to talk to her", "result": "You decide to take the chance and go for it. The gnawing feelings inside of you that say you know her are too much to ignore, especially in this situation. You wait for a moment when the older woman at the front of the room seems engrossed in her book, and gracefully move over to the chair beside the gothic girl. With all the grace of a stampeding elephant that is. Not only do you turn over the desk your were previously sitting in, you manage to miss sitting in the other desk, and fall to the ground.\n\nThe class uproars in laughter before they are hastily shushed by the older woman at the front. You sheepishly smile and turn back your original chair to its original position, then sit in the one beside the goth girl. The woman at the front glares at you for what feels like eternity, before finally returning to her book. Meanwhile, the girl beside you is now turned towards you and glaring at you.\n\nMustering your courage, you finally speak, or rather whisper, to her.\n\n\"Hey, I'm Jacob.\"\n\nYou say, darting a quick glance at the front to make sure you did it without being caught. The girl continues silently starting at you for a moment before replying.\n\n\"Olivia.\"\n\n\"Hey, Olivia. So, this is a bit forward, but I could swear I know you from somewhere.\"\n\nYou say.\n\n\"Have we, like, met before or something?\"\n\nOlivia looks to the front of the room, then back to you and shrugs.\n\n\"If we had, I'd probably be offended you forgot about me.\"\n\nShe states with an apathetic tone. Though, if someone you knew had asked if they knew you, you'd certainly be offended they had forgotten as well.\n\n\"Well, nice to meet you then.\"\n\nYou say, extending your hand. She slowly extends her own hand and shakes yours.\n\n\"Yeah, I'm sure we'll get along like the bestest of friends.\"\n\nOlivia says sarcastically. She then turns her attention back to the window, effectively ignoring you. Detention ends without too much else happening. You make your way back home afterwards, and along the way you try to retrace your steps from this morning. Although you go down a wrong alley or two, you eventually make it home. Of course, your mother is noticeably upset you are hours late from school.\n\n\"So Jacob. Mind explaining why you have come home at such at late hour?\"\n\nYour mother asks impatiently as you enter the house, two hours after you should have been home.\n\n\"I...err...sort of had detention.\"\n\nYou reply.\n\n\"What for?\"\n\n\"I was late for my first class...\"\n\nYour mother seems annoyed, but doesn't push the matter too much further.\n\n\"Honestly Jacob, you won't ever succeed in life if you don't take things seriously. Even if you dislike school, being tardy is no excuse.\"\n\nShe says in a rather condescending manner. You nod your head in agreement and your mother shakes her head, then walks away. The rest of the day passes by with nothing of interest really happening. At the end of the day you go to sleep and wonder if you'll wake up back in the future.", "action_results": [{"action": "Waking Up", "result": "You wake up to a brand new day, and to a familiar sight. Sure enough, you're still in the past, in your old bedroom. You get up, get dressed, and make your way downstairs to eat some breakfast. There you find your sister, already ready for her school, eating a waffle. She looks up at you and you can tell she's a bit surprised to see you up already, but you ignore it and grab a poptart for yourself. As you munch on it, you can feel Tina's eyes staring at you.\n\n\"What?\"\n\nYou ask, slightly annoyed. She visibly flinches at your question and quickly returns her gaze to her waffle. The two of you never really got along, before and after she entered high school, so this kind of interaction is normal. You finish your food and head out there door, just in time to see Ian walk up.\n\n\"Yo.\"\n\nHe says, giving you a short wave. You walk to the end of the walkway and join him in walking to school. Like last time, Ian goes on about another story involving his older brother. This time, once you reach school, you split up and find your class without issue.", "action_results": [{"action": "Class", "result": "You first class begins, but instead of teaching like normal, your teacher just stands at the front of the class beside the door.\n\n\"Today, a new student will be joining us\".\n\nHe says. As he does the new student enters the room. You see a pretty girl with familiar long blonde and pink hair flowing down to just above her waist. A realization hits you as the teacher introduces her.\n\n\"This is Allison- Jacob, what are you doing?\"\n\nHe asks annoyed, as you stand up and point to Allison with you mouth open. This is the girl you saw in your dream the other day. Her features are far more defined than they were in then, but this is unmistakably the same girl. She smiles at you, amused at your action, while the rest of the quietly giggles.\n\n\"I, um, her, ah never mind...\"\n\nYou say, returning to your seat flustered. You find it rather doubtful that the teacher will care you saw her in your dream. Rather he, Allison and the rest of the class would no doubt find it creepy.\n\n\"Alright, Allison, please find a seat.\"\n\nThe teacher says, and Allison walks over to an empty seat at the back of the room, flashing you another smile as she passes you. A familiar feeling you've been getting all too often reoccurs. Do you know Allison?", "action_results": [{"action": "Lunch", "result": "Lunch time comes, and after finally escaping from your class, you find Allison on your way to the lunch room. She smiles again once she notices you, but rather than approach you, chooses to go outside. Instinctively you follow her out to the bench she is now sitting on.\n\n\"So...\"\n\nYou begin, cautiously taking a seat beside her on the bench.\n\n\"I don't I know you, do I? I mean, it feels like we've met before.\"\n\nYou ask, recalling that you asked Olivia the same thing yesterday. Why does it seem like you know but can't remember so many people in this school?\n\n\"Hmmm. You could ask far more interesting questions than that.\"\n\nShe replies.\n\n\"Why I'm here, how I'm here, who I'm here for; all are far more interesting questions.\"\n\nShe says. You silently sit together, unable to come up with a proper response for her rather odd answer. Sensing that won't change soon, Allison sighs then speaks again.\n\n\"We just met now, correct? So it's safe to say it's our first meeting.\"\n\nShe says.\n\n\"If you believe in a linear concept of time that is.\"\n\nAllison adds in a playful tone. You frown, having no idea what she's going on about. Her answer puts you a bit at ease though. You haven't met before, according to her, so maybe you're just imagining things. Maybe your dream of her wasn't really about her then. As you think she stands up and walks a few feet away from you.\n\n\"For the love long since lost, the old friend forgotten, the new one neglected, the sister he could never see, and the brother he could never be.\"\n\nAllison says suddenly, bending forward and leaning in your direction.\n\n\"That's why I'm here.\"\n\nShe says smiling, she then quickly runs away before you have a chance to question her about her cryptic message.\n\nJust who is that girl...\n\nYou wonder, shaking your head.", "action_results": [{"action": "Try to talk to Allison more", "result": "You chase Allison into the lunch room and grab her hand as you catch up, stopping her from running. She turns to you and gives an exaggerated sad expression.\n\n\"Well, ya caught me, now what?\"\n\nShe asks. You look into her eyes for a minute, and decide to try something.\n\n\"You're lying.\"\n\nYou replying accusingly.\n\n\"I'm what now?\"\n\n\"Lying. You know who I am. No one acts that friendly to someone they just met, and what you just said before sounds like it has some deeper meaning to it.\"\n\nYou say. Allison looks down to her hand, which you immediately let go of, then she glances around the room. Finally she sighs.\n\n\"You caught me. I know you. But the more important thing here, isn't what I know, but what you know. So, what do you know of me, Jacob?\"\n\nAllison replies, revealing that your guess was right. Unfortunately, you don't actually know anything about her. The closest you have to a memory of her is your dream, and even if she does actually know you, that'd be a rather odd thing to bring up. Then again, she seems like a rather odd person anyway.\n\n\"How do you know me?\"\n\nYou ask, trying to ignore her question. She pouts and takes a step back.\n\n\"Beep beep, wrong answer. Should I take this to mean you don't know anything about me?\"\n\nShe asks.", "action_results": [{"action": "Tell her about the dream", "result": "\"That's not entirely true...\"\n\nYou reply to her. Curious, she takes a step towards you.\n\n\"So, what do you know about me then?\"\n\nAllison asks.\n\n\"I, um, well, it was just a dream.\"\n\nYou begin.\n\n\"I saw you, at least I think it was you, in a hallway of the school. You ran and I chased you, and then...\"\n\n\"And then?\"\n\nShe asks.\n\n\"And nothing. The dream just ended after I chased you.\"\n\n\"Hmmmm...\"\n\nShe replies, clearly thinking about what you just said.\n\n\"So, when was this dream?\"\n\n\"Just the other day...\"\n\nYou reply, leaving out the part that you actually dreamt it 8 years in the future. Allison appears to be thinking deeply again. Then she suddenly giggles.\n\n\"That's kind of creepy to be honest.\"\n\nYou almost grasp your chest in response to that critical hit of an insult. Sure enough, she finds it weird and creepy that you would have dreamt about her.\n\n\"Well, I suppose it's not that bad. Even creeps and geeks have their own appeal after all.\"\n\nShe continues, teasing you.\n\n\"Catch ya later.\"\n\nAllison says, waving and walking away. You give her a short wave back and sigh, unhappy with the results of your conversation. Even so, you decide to hang out in the lunch room longer and have something to eat.", "action_results": [{"action": "Look for Ian", "result": "After a short search through the cafeteria, you find Ian sitting with a girl, with long black hair, brown eyes, and dressed in a goth outfit. Oddly enough, you recognize her as Olivia, the girl you were talking to in detention yesterday. Noticing you, Ian waves you over to their table.\n\n\"Hey man, this here is Olivia.\"\n\nHe says, motioning to Olivia.\n\n\"We're both in the chess club together it seems, so I figured I should hang out with her a bit to get to know her better.\"\n\nOlivia looks at you with a mild expression of surprise while Ian speaks, before scoffing at his remark.\n\n\"I have a boyfriend you know.\"\n\nShe states, apparently thinking Ian had an ulterior motive.\n\n\"Ah, well of course you do. A cute girl like you is quite the catch.\"\n\nIan replies, although you can sense he didn't really expect her to have one. Olivia blushes slightly, but it's unnoticed by Ian.\n\n\"That's right, I had forgotten you were in the chess club Ian.\"\n\nYou say, finally sitting down.\n\n\"Yep, I'm the best damn chess-inator there is!\"\n\nHe replies while puffing out his chest with an odd sense of pride. However you don't really doubt he's the best there, as he's always been incredibly smart. You gaze wanders to Olivia, who notices and speaks.\n\n\"Just cause I look this way doesn't mean I'm stupid. Girls can be smart too, you know.\"\n\nShe says harshly to you, apparently thinking you were judging her inability to play chess based on her goth outfit. You quickly shake your head in response.\n\n\"I, wait, I never said you couldn't.\"\n\nYou said defensively. She turns her head away from you, almost in disgust. Ian looks at the two of you confused.\n\n\"Am I missing something here? Do you two got some history or something?\"\n\n\"No, of course not. We just met yesterday after all. Didn't we, Jacob?\"\n\nOlivia replies angrily, even more upset now.\n\n\"I need to go.\"\n\nShe announces, quickly standing from the table and walking away. The two of you watch as she leaves and Ian shrugs as you turn to him.\n\n\"Girls man. Confusing as hell, right?\"\n\nHe says before taking a drink of his milk in front of him. You nod, but can't help but think there was something more to what Olivia said.", "action_results": [{"action": "The next morning", "result": "The rest of the day goes by without much else happening. Neither Allison nor Olivia are in any of your other classes, and you don't seem to run into either of them. You walk home with Ian, and spend the rest of the day lounging around your home. You're beginning to feel like you've fallen into your old routine from back in the day.\n\nThe next morning, Ian arrives at your door, as per usual, except this time he doesn't seem to have his backpack.\n\n\"Yo, Jacob.\"\n\nHe says while standing at the end of your walkway.\n\n\"Hey Ian, where's your backpack?\"\n\nYou ask while walking towards him, a bit confused.\n\n\"Ah, well about that, I was thinking we'd do something a little more interesting than school today.\"\n\nHe replies.\n\n\"Such as?\"\n\n\"Well...you'll see when we get there.\"\n\nHe says with a bit of a laugh.\n\n\"It'll be fun man, just hide your bag somewhere first, we won't need it for where we're going.\"\n\nHe adds. If you remember right, skipping school so haphazardly wasn't something Ian often suggested. In fact, if you recall correctly, you were usually the one suggesting it and he was the one rejecting the idea. This makes you really wonder what he has in mind for the day. You stand there and consider if you really want to go or not. After all, if you go you'd be missing school, and you guess that would also mean you miss a chance to see Olivia or Allison.\n\n\"You won't give any hints about what we're gonna do?\"\n\nYou ask, hopeful.\n\n\"Not a single one.\"\n\nIan replies smiling.", "action_results": [{"action": "Go with Ian", "result": "\"Alright fine, I'll come with you.\"\n\nYou reply somewhat grudgingly, trying to mask your interest. Fortunately, your mother had already left for work, taking your sister with her, so you easily return your bag to your closet without being caught. During the walk to the unknown destination, you and Ian converse.\n\n\"So, now that I've agreed, care to let me in on where we're headed?\"\n\nYou ask.\n\n\"You'll see when we get there.\"\n\nHe replies with a smile. You glare at him, annoyed that he refuses to tell you, but continue to walk along with him. After a short walk he stops in front of what looks to be an abandoned warehouse. You glance at him then to the building.\n\n\"Seriously? This is it?\"\n\nYou ask, clearly disappointed. A worn down and dangerous building isn't exactly your idea of fun, and it doesn't really fit Ian's either.\n\n\"You'll change your mind about it once we're inside.\"\n\nHe says, leading the way. You follow him into it, although you're rather doubtful your opinion will change. Sure enough, once you follow him through the main door, all you see is a large run-down warehouse, exactly like you expected.\n\n\"Come on, what are we even doing here Ian?\"\n\nYou ask, suddenly feeling a bit uneasy about the situation.\n\n\"Don't worry man, just a little further.\"\n\nHe says, leading you through the large room and into a side-room. In the side room, which appears to have previously been an office of some sort, you see signs that it was recently used. In fact the furniture inside seems rather new, and there's even a mini-fridge at the side, plugged into a battery pack. Ian hops onto a large, comfortable looking couch, and then smiles.\n\n\"Welcome to the wolves.\"", "action_results": [{"action": "The wolves", "result": "\"The what?\"\n\nYou ask, thoroughly confused. You don't remember anything like this happening in the past. Maybe your decisions have been different from before, leading you to a different outcome. The possibilities run through your mind before Ian snaps you out of it.\n\n\"The Wolves man. Our gang. Well, you're not really in them yet, but I'm sure my brother won't have a problem with it.\"\n\nIan says, standing up and opening the mini-fridge, pulling out a beer.\n\n\"Want one?\"\n\nHe asks casually. You don't really care that he's drinking while under aged, but this isn't how you remember Ian acting.\n\n\"No...\"\n\nYou reply slowly.\n\n\"Actually, what the hell is going on? Since when have you been in a gang?\"\n\nYou ask demanding an answer. Ian doesn't seem too put off by your response. It's almost as though he expected it.\n\n\"Ah well, I've been telling you about this club for the last few days. I mean I never said it was a gang or anything, but it shouldn't come as that much of a surprise.\"\n\nHe replies.  That's when it hits you. The stories he was saying involving his brother that you largely ignored were about the gang he was in. Most likely he was trying to talk it up a bit before bringing you here. Still, Ian has a great future ahead of him, so he really has no need to be in a gang.\n\n\"So, you in man?\"\n\nHe asks, with a bit of hesitance.", "action_results": [{"action": "Protest him being in the gang", "result": "\"No.\"\n\nYou reply bluntly.\n\n\"And you shouldn't be in it either man. The hell is wrong with you?\"\n\nYou say, your voice getting louder. Ian at this points backs away a step, and seems a bit afraid.\n\n\"You're fucking smart man. Why the hell would you throw that away by being in a gang? You won't -\"\n\nYou yell, then you suddenly stop. 'You won't go anywhere in life', is what you were about to say, but then it dawns on you that that is exactly what happens. He joins you, doing nothing with his life, as a stock boy. Your anger subsides, and your breathing normalizes, but Ian still keeps his distance.\n\n\"I...I'm sorry.\"\n\nYou say in a dejected tone, apologizing. You contemplate saying more, but decide against it. Slowly, you open the office door and exit the room.\n\n\"I'll see you later.\"\n\nYou say. Ian doesn't say anything in return, nor does he try to stop you. You leave the abandoned warehouse and wander around town for the rest of the day, wondering what you can do to help Ian.\n\nAlong the way you run into a group of girls, wearing a uniform you recognize as the one from the school your sister goes to. They laugh obnoxiously and talk about some other girl in their class. You sigh loudly, annoyed by their interruption of your thought process, but continue walking rather than confront them.\n\nBy the end of the day, you return home, hungry and without any real solution to how to help Ian. You've concluded that there's nothing you can really do to talk him out of being in the gang. Although you think you probably should have asked him why he's in it before leaving. You eat dinner and go to bed, your mom and sister blissfully ignorant of your day out. You glance at your alarm clock before dozing off, happy that tomorrow is Saturday.", "action_results": [{"action": "Sleep in", "result": "You happily decide to sleep in, it's Saturday after all. You do the same as all teenagers in high school do, sleep as much as possible.\n\nOr rather, you would have spent it sleeping, had you not been rudely awoken at about two by someone knocking on your front door. You groan as you exit your bed and move downstairs to answer the door.\n\n\"What?\"\n\nYou ask angrily as you open it, only to find Allison happily standing in front of you. She smiles as you open the door.\n\n\"Why hello there, Jacob, or should I say good morning?\"\n\nShe says cheekily. You open your mouth to retort, but she interrupts you.\n\n\"Anyway, I've been out here for a while, so can I come it?\"\n\nShe continues, you go to reply, but she again interrupts you.\n\n\"What do you mean no? Would you really leave a cute girl outside in the cold?\"\n\nYou stand silently and glare at her as she attempts to make a cute pose.\n\n\"...Done?\"\n\n\"Yep!\"", "action_results": [{"action": "\"Good, I'm closing the door\"", "result": "\"Good, I'm closing the door.\"\n\nYou reply, shutting it immediately in her face. You hear a cry of protest from the other side, and some more banging on the door. Happy with your revenge, you open it again to find her standing there pouting. You smile in response.\n\n\"Done?\"\n\nYou ask. She nods in response.\n\n\"Good.\"\n\nYou reply, shutting the door yet again in her face and laughing.\n\n\"Just let me in already, Jacob!\"\n\nYou hear her yell from the other side. You comply and smirk once you see her pouting face again.\n\n\"Well, what you waiting for? Come in!\"\n\nYou say, feigning ignorance and opening the door wider, letting her in. Though it suddenly dawns on you that yourself and a high schooler are about to be alone in your house. You quickly shake off some of the thoughts that come to mind and shut the door once she enters, escorting her into the living room.\n\n\"So, what'd you want?\"\n\nYou ask. She places her hand to her mouth and does an 'eh-hem', before replying.\n\n\"I came to invite you somewhere.\"\n\nAllison replies. You wait for a moment for her to explain further, but get no such response. You're getting quite a few of these invitations to mysterious places lately.\n\n\"And where would that be?\"\n\n\"Does it matter? You'll be there with me!\"\n\nShe answers, smiling. For someone you just met the other day, she sure is acting awfully close to you.\n\n\"Alright, when did you want to go then?\"\n\nAllison looks at the nearby clock, seems to nod approvingly, then looks back to you.\n\n\"Right now.\"", "action_results": [{"action": "Agree to go with her", "result": "\"Alright, I'll go with you.\"\n\nYou reply. Allison does a triumphant fist pump to the air and smiles.\n\n\"Great, well then let's go!\"\n\nShe says, standing up and leaving your house. You follower her obediently for about 10 minutes through the streets of your town before you reach your final destination - a park. She sits on a nearby bench and motions for you to follow.\n\n\"So, what was the point of coming here?\"\n\nYou ask as you sit beside her. Allison gives a soft shrug in response.\n\n\"No real reason.\"\n\nShe answers as she kicks her legs back and forth. You sigh and turn your attention to the park, which while not full of people, still has a few pairs of children and parents playing. Allison makes small talk with you for a bit, about how she used to live in this area, and was fond of this park. You in turn tell her a few random facts about yourself, nothing really interesting. The mood slowly goes from being a light-hearted conversation into awkward silence. Then Allison sighs.\n\n\"I can't take this anymore...\"\n\nShe says, and then she promptly grabs your shoulders and pushes herself into your chest. You freeze, her sudden show of affection catching you completely off guard.\n\n\"I, um, Allison?\"\n\nYou manage say, incredibly conscious of the fact that her blonde and pink hair is brushing up against your face, and that you can feel her breathing on you.\n\n\"Shut up...you're so stupid...\"\n\nShe mumbles into you as she clenches your shoulders.\n\n\"Why can't you figure it out already...\"\n\nYou don't respond. You can figure by what she's doing now that she probably has a crush on you. You still have no clue how she knows you, however you can guess that the past you just didn't notice her. Thinking back, the you of the past was pretty oblivious to the things going on around him. You quietly curse your past self for not noticing this cute girl earlier. Then reality kicks in, and you remember that you're in a park with other people, being held by a girl a decade younger than you. Your moral center kicks in shortly after, and you force yourself to gentle push her away from you. Even if you're technically the same age now, something just doesn't feel right. Surprisingly, Allison doesn't protest at all.\n\n\"I'm sorry...\"\n\nYou say, unable to say anything else.\n\n\"Don't worry, I understand how you're feeling.\"\n\nShe says softly with a forced smile.\n\n\"That was pretty rude and selfish of me, sorry...\"\n\nShe continues, standing up.\n\n\"I should have thought about how you felt too.\"\n\nAllison finishes. Before you have a chance to properly respond, she dashes out of the park. You sit there for a few minutes in silence. You hadn't thought that going back into the past would have revealed something like a past crush that you hadn't noticed. It depresses you, but eventually you pick yourself up and head home.", "action_results": [{"action": "Sunday", "result": "You wake up the next morning to the sound of your mother calling for you, saying something about a phone. You slowly manage to wake yourself up and get dressed, only to have your mom scold you when you finally get downstairs.\n\n\"Honestly Jacob, it's noon now, it shouldn't take you this long to wake up on a Sunday.\"\n\nShe says.\n\n\"You won't be successful in life if you spend all your time sleeping.\"\n\nYou nod your head, still somewhat asleep in response. You can't really disagree with her, given she's right about not being successful in life, though you rather doubt it's because you tend to sleep in. After she finishes scolding you she explains that Ian called and that you need to call him back, so you take the phone and return his call.\n\n\"Hm? Why did I call?\"\n\nIan asks after you call him.\n\n\"I'm bored, so I wanted to hang out. You busy?\"\n\nHe continues. You tell him you're not so he says he'll be over in a minute and hangs up. About twenty minutes later he comes over, and the two of you spend the afternoon together at your house. You reminisce about the times when you and Ian used to do these kinds of things. For you, high school was probably the high-light of your life, as after that you accomplished nothing but working in a dead end job. Sure it could have been worse, but you still wonder about what could have been. Eventually Ian asks you a question you didn't expect.\n\n\"So, who you goin' to the fair with?\"\n\nHe asks. You frown and tilt your head slightly, indicating you really have no idea what he's talking about.\n\n\"The annual fair? You know, the thing that comes here ever year? It's opening up next weekend.\"\n\nYou think back and try to remember what Ian is talking about. You're pretty sure you remember a fair happening, or rather it'd be stranger if a fair hadn't happened.\n\n\"Ah yeah, that fair.\"\n\nYou reply, vaguely remembering it.\n\n\"Yep, that fair. So who you goin' with?\"\n\nYou haven't asked anyone yet, but you should at least tell Ian your intentions.", "action_results": [{"action": "I'm not going", "result": "Thinking it over, you decide you don't really want to go to this fair.\n\n\"I'm not going.\"\n\nYou reply. Ian gets visibly upset.\n\n\"What the hell, man? You say that every year.\"\n\nHe says. You shrug in response.\n\n\"Just doesn't seem like it would be fun, no big deal. Who are you going with?\"\n\nYou ask, trying to move the conversation away from you.\n\n\"I haven't made plans yet...I think I'll ask Olivia to go with me though.\"\n\nIan says, with hint of nervousness.\n\n\"Doesn't she have a boyfriend?\"\n\n\"Who cares? I'm not asking her to date, I'm just seeing if she wants to go to the fair with me.\"\n\nHe retorts. Ian's intentions here are obvious, but he's really trying to deny them. You weren't aware he was into Olivia though. Thinking back it kind of makes sense, they're both on the chess team, and he even introduced her to you.\n\n\"Anyway, she might say no, but you never know.\"\n\nHe finishes. You give a short nod, and the conversation ends. The two of you carry on talking and hanging out until the night comes, and Ian leaves.", "action_results": [{"action": "The next morning", "result": "The next morning comes and you head out to school with Ian like normal. The day passes and nothing of interest happens at all. You're not surprised or disappointed by this. Thinking back, this was the way you had always lived, simply going through life day after day, doing as little as possible. With no real ambition, you're likely to end up right back at the grocery store after you graduate. Maybe fate really is preventing you from changing your ways, or maybe you're just afraid of what might happen if you pursue something you actually want. If you're just going to fail and get disappointed anyway, then what's the point of trying to change, right?\n\nAt least, that's what you think.\n\nYou become content with falling back into your high school routine. Weeks pass, and the thought that you're a decade in the past is all but a distant memory. That's fine though. This is what was supposed to happen; the way it's meant to be. It's because of fate, so it's not your fault that you were unsuccessful in changing anything.\n\nAt least, that's what you tell yourself.", "action_results": [{"action": "Retry", "result": "The sound of your alarm clock wakes you and you groggily switch it off. You go through your normal morning routine and grudgingly head off to your job. As always, you arrive at work on time and walk straight into the back room to put on your uniform. Once there you notice your best friend, Ian, is already dressed and preparing to begin.\n\n“Hey Jake.”\n\n“Hey Ian, ready for another exciting day?” You ask sarcastically.\n\n“Oh yea, working here has been highlight of my entire life.” He replies with equal sarcasm, “I hope I never quit.”\n\n“Ah yes, stocking food has always been a dream of yours hasn’t it?”\n\n“A lifelong-dream. Now if you’ll excuse me, it’s time to live that dream.”\n\nHe grabs a small nearby crate and rolls it into the main area of the store. You never thought he would end up as a stock boy in a grocery store. Then again, you thought both of you had bright futures. Although you were never really motivated to do anything, Ian was and certainly should have succeeded. You sigh and change into your uniform; this is your life and there’s no point in brooding over what could have been.\n\nThe day goes by relatively quickly, which is about the only benefit to the job. However it’s a rather hollow benefit, as the day passing by faster just means you have to work that much sooner the next day. You and Ian wave goodbye to each other at five o’clock and you walk to your small one-bedroom apartment, reaching it by 5:30pm.", "action_results": [null]}]}]}, {"action": "I'm going with Allison", "result": "\"I think I'm gonna go with Allison.\"\n\nYou respond. The mysterious girl has been on your mind quite a bit lately, and you still don't know a lot about her. The fair would be a great time to get to know her, especially given she basically just confessed she loved you the other day at the park. There's no way she should feel that strongly about you after such a short time.\n\n\"Allison? Oh, the new girl in our class? I didn't know you guys were talking.\"\n\nHe says, mildly shocked.\n\n\"Yeah, I've been talking with her this past week.\"\n\n\"Hmm...well good luck man.\"\n\nIan says.\n\n\"So, who are you goin' with?\"\n\nYou ask, turning the subject onto him.\n\n\"Me? Hm...I was gonna ask Olivia.\"\n\n\"Olivia? Really?\"\n\nYou say surprised. Though, thinking back it shouldn't be too surprising. He did introduce you to her, and she is in the chess club with him.\n\n\"Really.\"\n\nHe replies.\n\n\"Even though she has a boyfriend?\"\n\n\"Ah well, I'll deal with that when it's brought up.\"\n\nIan says, laughing. You laugh with him and the conversation turns back to mundane things. The day passes and eventually Ian returns to his home.", "action_results": [{"action": "Monday Morning", "result": "As per usual, you and Ian walk to school together in the morning. He talks about his older brother, but by now you've learned to just zone out while he's doing so. You have far more important things to think about anyway, such as how you're actually going to get Allison to go to the fair with you.\n\nNo, that's probably the wrong way of looking at it. The real hard part will be dealing with her being in love with you. Or having a crush on you. Or just really being into you. Truthfully you're not really sure which it is, but you'll need to settle that matter regardless. You do find Allison attractive, a thought that causes great conflicts within you, but you'd feel like you're taking advantage of her if you pursued her that way.\n\nThinking about it further, you realize you still have no idea what her relation to you is either. After all, she clearly knew you before you met in class. The way she spoke to you and her avoidance of key questions made that clear, not to mention there's no way she'd feel strongly about you if you just met.\n\nYou sigh as you enter the school, your thoughts becoming muddled. No matter which you decide to confront her on, the first step is to actually find and talk to her. A step greatly hindered by the fact that she isn't in your class when you enter. Confused, you approach the teacher.\n\n\"Ah...\"\n\nYou say, remembering you still have no idea what his name is.\n\n\"Um, is Allison sick or something?\"\n\nYou ask, pressing forward anyway. The teacher thinks for a moment then shakes his head.\n\n\"She hasn't called the school. It's odd, she transferred in near the end of the year, and she has skipped most of the lessons...\"\n\nHe replies pondering. The answer isn't exactly what you were expecting or what you wanted to hear, but you thank him anyway and head to your seat. The first period ends quickly, and you're left wondering how you should proceed with this situation.", "action_results": [{"action": "Continue with classes like normal", "result": "Realizing you have no idea where she could be anyway, you decide to just continue with your classes like normal. Allison has to return to school sometime, so you can just speak with her then.\n\nSure enough, in time for the start of your next class, Allison shows up. You don't really have a chance to speak with her during the class, but you can tell she seems pretty down. Not wanting to risk her leaving again before you get the chance to ask, you decide to slip her a note asking her to go to the fair with you. You can't think of a way to solve the other issues, so you'll just deal with them later.\n\nYou raise your hand to leave for the bathroom, and on your way out you pass by Allison's desk, dropping the note as you do. Out of the corner of your eye as you leave, you notice her open it. When the class ends, you approach her.\n\n\"So uh....do you have an answer?\"\n\nYou ask nervously. This whole scenario seems rather odd, but you can't help but feel like a high school boy asking out a girl. Allison gives you a short look and a nod. It seems like she's still upset over something though.\n\n\"You okay Allison?\"\n\nYou ask concerned. She nods again.\n\n\"I'm just thinking about some things, I'll be fine in a bit.\"\n\nShe replies in a low voice, walking away. You frown, but can't think of anything else to say, so you leave it at that.", "action_results": [{"action": "After School", "result": "School ends and you met Ian as per usual at the front of school, however today you have something different in mind.\n\n\"Hey, Ian, I'll catch you later, I'm going to go with Allison.\"\n\nYou tell him, spotting her down the hallway. Ian nods and leaves without you, and you head towards Allison. She smiles as she sees you, apparently back to her normal self.\n\n\"Why hello there Jacob! Why haven't you left for your house yet?\"\n\nShe asks.\n\n\"Well, I was waiting for you of course. Care to walk with me?\"\n\nYou reply, gesturing for her to follow. Allison takes the hint and walks besides you.\n\n\"Hmm, and where might you be taking me?\"\n\nShe asks with a coy smile.\n\n\"It's a secret.\"\n\nYou reply smiling, mimicking how she acted to you on Saturday. Rather than demand any further answers, she just continues smiling.\n\n\"I see. Well, lead on.\"\n\nAnd with that, the two of you exit the school grounds. Just like on Saturday, the two of you end up at the park Allison brought you to. While you succeeded in asking her to the fair, you've been pondering the rest of the day as to how you should solve the other issues with her. You're curious as to how she knows you, but you also want to know how she really feels. It's possible you just misunderstood her the other day, so you need to clarify. As the two of you enter the oddly deserted park, you go to speak, but are stopped by her placing her index finger against your mouth. The intimacy of the sudden act immediately pacifies you, and you're left awkwardly staring into Allison's eyes.\n\n\"One question. I'll answer one question, regardless of what it is, as honestly as I can.\"\n\nShe says in a serious tone, removing her finger from your lips.\n\n\"But after that I make no promises, hehe.\"\n\nShe finishes. Allison seems to have read your mind and intentions here, so rather than tempt fate, you give in and ask her one question.", "action_results": [{"action": "How do you feel about me?", "result": "\"Then....how do you feel about me?\"\n\nYou ask nervously.\n\n\"That's easy. I love you, Jacob.\"\n\nAllison shamelessly confesses with a smirk. Your heart practically skips a beat as you hear the words leave her lips. It's just as you thought, Allison really does love you. But how? She barely knows you, right?\"\n\n\"W....why? How can you lo...love me when we barely know each other.\"\n\nYou say stuttering. You shouldn't be this nervous in front of her, after all it's not like you'll actually act on her feelings towards you. You're a decade older than her after all, it just wouldn't feel right. Even so, you've never had a girl in love with you. You can't even put into words how you feel right now. Allison makes a cute pose and crosses her arms.\n\n\"Beep beep. Nope, you only get one question!\"\n\nShe says triumphantly.\n\n\"Besides Jacob, a cute girl just confessed her love for you. Shouldn't you be saying something in return?\"\n\nAllison says accusingly. You take a step back in confusion. She's obviously talking about saying you love her back, but can you really say such a thing? You'll admit she's cute, and you do find her personality to be fun, but are you really sure if you love her or not? It's not something you ever considered before.\n\nYou shake you're head. There's no way you can say such a thing so soon, even if it was true you've only know Allison for a week.\n\n\"Thank you.\"\n\nYou say. Allison pouts in response, but doesn't seem surprised.\n\n\"You would say something like that. Just admit you like me!\"\n\n\"Well, I do like you. I can't say anything beyond that though...\"\n\nYou reply earnestly.\n\n\"I really should be used to you doing this to me by now.\"\n\nShe says with a sigh.\n\n\"Oh well. That's your one question. I need to go now, see you later Jacob.\"\n\nShe says, leaving you alone in the park with a wave. You wave back and let her leave, realizing you won't be able to stop her.\n\n\"I love you, Jacob.\"\n\nAllison's words echo in your head as you watch her go. If someone had asked you what you would expect if you had gone back in time while you were in the future, a girl you never met confessing her love to you would have never come to your mind.", "action_results": [{"action": "Tuesday", "result": "The next day Allison appears to be missing again. You're still not sure why she's keeps disappearing like this, but after yesterday you're satisfied enough to not look for her. You got her to agree to go to the fair with you, and to answer one of the questions you were dying to ask, so you'll just be patient and wait for her to return. Although you think that, you're still hopefully she'll show up during the day.\n\nHowever she never shows. Classes pass and the school day ends, and Allison is still nowhere to be seen.\n\n\"Hey Jacob, something wrong?\"\n\nIan asks as the two of you prepare to leave the school. Ian's pretty good at reading you, so he probably knows something has been on your mind all day.\n\n\"Yeah, I'm really curious as to where Allison is.\"\n\nYou reply absentmindedly.\n\n\"Ah yeah, the new girl who keeps skipping school. You asked her to the fair already right?\"\n\n\"Yeah, she said yes.\"\n\n\"Great man, so you ready for the fair?\"\n\n\"What do you mean ready?\"\n\nThe two of you reach the other perimeter of the school and Ian stops.\n\n\"Ready, as in you planned what you're going to do with her...\"\n\nHe says, as though it's a really obvious fact you should already be aware of. You had been so focused on getting her there and your other issues, that you had forgotten what you'd actually do.\"\n\n\"Shit....\"\n\nYou say. You then look to Ian.\n\n\"What are you going to do then? You asked Olivia to go right? Did she say yes?\"\n\nYou ask. Ian frowns and sighs.\n\n\"Sort of. I asked her but she's pretty keen on saying she has a boyfriend. Apparently she's not even going to go with him anyway.\"\n\nHe complains. You nod sympathetically, and your mind wanders to thinking about what you should do with Allison when the fair comes while Ian speaks.", "action_results": [{"action": "Wednesday", "result": "The next day comes and you haven't been able to come up with much of a plan for what to do with Allison. From what you can remember about the fair, it was a rather small one, and was mainly comprised of the typical carnival games that no one can ever win. You think there was a Ferris wheel, at least there should be one, and a few other rides. Apart from the Ferris wheel though, there isn't anything romantic there.\n\nYou shake your head at the thought and bring your attention back to class. The teacher is going on about something to do with your futures, which you quickly lose interest in, causing your attention to drift back to Allison and the fair. You're still feeling guilty about it all for some odd reason, but you asked her to the fair, which you can assume to implicitly mean she does like you. Well, actually you already know she likes you, you're just not sure how far you should take that. Your plan had been to take her to all the romantic rides, since you figured that's what you're supposed to do, but you're quickly realizing your situation isn't so typical.\n\nHalfway through the day, Allison finally arrives at the school. You're relieved to see that she's fine, but feeling somewhat anxious seeing her again.\n\n\"Hey Jacob! Did I miss anything important?\"\n\nAllison asks as she joins you and Ian in the cafeteria.\n\n\"Nope, nothing at all.\"\n\nYou reply. She smiles and sits beside you, with Ian smirking in a chair across from the two of you.\n\n\"Ah, look at the time. Sorry Jacob, I'll leave you with the new girl, I gotta go find Olivia.\"\n\nIan announces, standing up. Obviously he intends to have you and Allison spend some time alone, which you internally thank him for.\n\n\"Seeya, new girl.\"\n\nIan says waving to Allison, to which she politely waves back. She then turns and looks at you.\n\n\"So....\"\n\nYou begin awkwardly.\n\n\"Where were you yesterday?\"\n\nYou ask. Allison averts her gaze.\n\n\"No where special. Just didn't feel like coming to school.\"\n\nShe replies.\n\n\"More importantly, how are things with you?\"\n\nShe asks. You shrug.\n\n\"Fine. You're ready for the fair this weekend right?\"\n\nYou ask. Allison frowns, apparently unhappy with that reply.\n\n\"Really? Nothing new or unexpected happened to you?\"\n\n\"Not in particular, no.\"\n\nYou reply with a straight face. Apart from the fair and Allison, nothing new or important has been happening to you since you went back in time. Well, apart from you actually going back in time, but you don't intend on telling her that. You hear Allison mutter something under her breath in an annoyed tone, before she speaks again.\n\n\"I see. That's a shame, new and exciting things happening is what makes life good.\"\n\nShe says.\n\n\"I suppose. We can count the fair as one of those things though, right?\"\n\nYou reply hopeful. Allison sighs, then smiles.\n\n\"Yes, I suppose we can. I do love those carnival games after all.\"\n\nThe two of you finishing eating and return to class. You continue attempting to plan your day at the fair with Allison throughout the afternoon, and by the end of school you think you have a pretty good idea of what to do.", "action_results": [{"action": "Saturday", "result": "The rest of the school week passes, and Saturday finally arrives. By now you've made lots of small talk with Allison, finding out what foods she likes, and what rides she prefers. The only thing left to do is to actually go with her. You've arranged to meet at the fair grounds at about 3pm. Before leaving for the fair, you swing by Ian's place to see what he's up to. Unfortunately, upon arriving you find that no one is home, which you find rather confusing. Even if Ian had already left, his brother, or anyone else, should have been home. After a quick scout around his house, you confirm that no one is home, and make your way to the fair alone.\n\nYou had wanted to hang around Ian and his date to make things less awkward with Allison, but it looks like you'll have no such luck. You arrive at the spot in the fair you agreed to meet Allison at a good ten minutes earlier, enough time to give you a second to take in the experience.\n\nYou haven't been to the fair before, so the first thing you notice is the overbearing lights and sounds. You'd be surprised if any sort of meaningful conversation could be had between the two of you in this environment. The carnival games create a path through the fairgrounds, and surrounding that straight path lie all of the various rides, along with some food booths. You hear the loud clanging of metal all around you, when suddenly you feel a tug on your shirt.\n\nAllison stands behind you, wearing a cute outfit you didn't expect her to wear. You really don't like thinking about her that way, but the way she's acting is forcing your mind in that direction. Then again, the fact that you took her to the fair on a date means you had accepted that you liked her, so you might as well make the best of it. Now that she's here, she looks at you expectantly, and you tell her where you plan to take her first.", "action_results": [{"action": "Eat some food", "result": "\"Let's go eat some food.\"\n\nYou tell Allison.\n\nAllison gives you a strange look. \"It's a bit earlier for food don't you think?\" She says skeptically. You shrug and lead her to the food area anyway.\n\nThe food from the fair is exactly as you would have expected it to be. It's expensive, high in fat and sugars, and wildly mediocre in taste at best. However the two of you manage to enjoy some nachos together, and afterwards some cotton candy. During the week Allison had told you that she loved cotton candy, so you made sure to get some for the two of you. You had separate ones of course, but it made you happy to see her happy.\n\nCome to think of it, when was the last time you felt this way? After high school you had simply followed Ian into the supermarket, a decision that didn't have much thought or effort behind it. Then again, you never had the ambition to do anything anyway, so you were content. At least, you thought you were.\n\n\"This is sooo good!\"\n\nAllison practically squeals in delight while eating her cotton candy.\n\n\"Here!\"\n\nShe says, stuffing some of her partly eaten cotton candy into your mouth. Embarrassed, you eat it, to which she smirks.\n\n\"Is this really the kind of thing you should get embarrassed about, Jacob?\"\n\nAllison asks playfully, but your mind is elsewhere. This whole experience for you is so confusing. How can you be so infatuated with someone you just met? Somehow it feels like you've known Allison for so much longer. The two of you finishing eating and go on to the next activity.", "action_results": [{"action": "Go on the rides", "result": "\"Let's go on the rides.\"\n\nYou tell Allison\n\nAllison looks you up and down before shrugging. \"I would have preferred to go on them later, but alright.\"\n\nShe replies.\n\nThe two of you start off with the bumper cars, where Allison proceeds to repeatedly ram you against the wall with her car, much to your dismay and her pleasure. Next you play around in the hall of mirrors, then you go to the haunted house. It's at this point Allison questions whether or not you'd consider these rides or attractions, but you insist they count. After that, you decide to take her to a 'real' ride, the roller coaster that they have.\n\nThe roller coaster turns out to be a success, and after it you take her to some spinning cups, spinning cages, and finally, the Ferris wheel. From the start the Ferris wheel had been the only ride you really wanted to take her on, admittedly with an ulterior motive.\n\nThe two of you reach the top of the Ferris wheel and it stops. You gaze at the view. While it doesn't go that high, and there's nothing particular unique about the scenery in your town, there's something peaceful about seeing it from up here. You turn to Allison, who sighs as she too gazes into the distance.\n\n\"Hey, Jacob?\"\n\nShe begins.\n\n\"What do you think about me?\"\n\nShe asks. With her eyes looking elsewhere, she doesn't see you immediately dart your eyes away from her. You had come up here hoping for some sort of romantic scenario to unfold, but her tone and eyes seem distant and sad. Like she's trying to reaffirm something rather, than ask you for real.\n\n\"I like you, of course.\"\n\nYou manage to reply. You don't quite have the courage to say you love her as it stands, but you can at least say this much. She turns to you and smiles.\n\n\"Yeah....I know....\"\n\nAllison replies in almost a whisper.\n\n\"Thanks, I just needed to hear that. Sorry to make you uncomfortable.\"\n\nShe says in a more normal tone. You can't stand to see her looking so depressed, so you quickly reply.\n\n\"Don't be. I'm having fun.\"\n\nYou say with a smile. She smiles back, and the ride continues. After exiting the Ferris wheel, you decide on where you want to head to next.", "action_results": [{"action": "Play some of the carnival games", "result": "\"Let's go win some prizes at the games.\"\n\nYou tell Allison. She smiles and nods her head.\n\n\"Yes! I love these games! You'll win me something right?\"\n\nShe asks, leaning into you.\n\n\"Well, I'm not very good at them, so I can't promise anything.\"\n\nYou reply, weary of her closeness.\n\n\"That's no good Jacob. When a girl tells you to get something for her, you should just do it!\"\n\nAllison proclaims in a bossy tone.\n\n\"I don't think that's the way relationships work....\"\n\nYou reply skeptically.\n\n\"Probably not, but it's how ours does, hehe.\"\n\nShe says with a cheeky grin.\n\n\"Well like I said, I'm not good at them, but I'll try.\"\n\n\"Great, trying is all I ask of you.\"\n\n\"So you won't be disappointed when I lose?\"\n\n\"But you won't lose.\"\n\n\"I'm telling you I'm n-\"\n\nYou begin to retort, but Allison holds up her hand.\n\n\"Try before deciding if you'll fail or not.\"\n\nShe says calmly. You're slightly put off by her change in tone, but nod and agree to try.\n\nMuch to your surprise, you actually turn out to be pretty good at carnival games, winning a few prizes for yourself and Allison. Allison has a big \"I told you so\" smile the whole time, but you don't mind. After winning enough prizes to satisfy Allison, you decide on where you want to go to next.", "action_results": [{"action": "End of the fair", "result": "After the fair, you and Allison make your way to a bench just outside of the fairgrounds. According to Allison, this bench is the best viewpoint for the fireworks they're having. You weren't aware they were even having fireworks, so you just agreed with her to view them from here. The cold air getting at the her, Allison moves closer to you and rests her head on your shoulders.\n\nAt this point, you think it's all but official the two of you are dating now. All you'd need to do now is lean down and kiss her, but you put it off for now. Whether it's fear, or nervousness, or something else, something inside of you is saying not to right now. Your feelings seem to be somewhat conflicted on the manner still.\n\nAllison shifts her weight and nudges in closer to you, causing you to unconsciously put your arm around her. She looks up at you and smiles, and you turn your head and blush. She really is cute, is all you can think about at this moment. Her long blonde and pink stripped hair flows down into her lap, and her bright blue eyes seem to shine even on this poorly lit bench. If she was just cute you could probably deal with ignoring her, but she seems to understand you perfectly, something you never thought could happen.\n\nSuddenly, the fireworks start, interrupting your internal conflict. You hadn't even noticed, but by now others have all gathered around the two of you to watch the fireworks. Luckily, you and Allison still have space between you and them, but you're suddenly really self-conscious that you're holding her in your arms. The bright lights and loud sounds of the fireworks seem to memorize the crowd for the few brief minutes they burst in the sky. Then, as quickly as they started, the fireworks end, and the crowd begins to disperse around you.\n\nAs they do, Allison grips a hold of your hand that's currently around her, and looks into your eyes.\n\n\"Hey, Jacob?\"\n\n\"H...Hm?\"\n\n\"This is okay, right?\"\n\n\"What is?\"\n\n\"The two of us, together. It's okay....right?\"\n\nAllison asks, as if she's pleading for you to answer for her. You're not sure if she's also conflicted, or if she just notices you are, but you need to answer her, to make a decision.", "action_results": [{"action": "\"No, it's not right\"", "result": "No, this just doesn't feel right. For some reason, you come to the conclusion that you just shouldn't be with Allison. You practically grimace in pain as you slowly move your arm away from her, and gently slide down the bench.\n\n\"No....it's not right. I'm sorry Allison.\"\n\nYou reply as you look to the side, unable to face her properly. There's a brief moment of silence between you, before Allison speaks.\n\n\"You're probably right. I need to stop this....\"\n\nShe says softly.\n\n\"I keep getting side-tracked into my own delusions, and I keep doing all these selfish things...\"\n\nShe continues. You look at her and notice she's now sitting with her legs on the bench and her arms wrapped around them.\n\n\"I'm sorry I keep dragging you into this, Jacob. I'm sure I'll get it right one of these times.\"\n\nYou tilt your head slightly in confusion and frown. This isn't exactly what you expected when you rejected her. She's saying all these things you don't understand.\n\n\"What are you talking about?\"\n\nYou manage to ask, curiosity gaining the better of you. Allison turns to you and sighs.\n\n\"It's nothing, don't worry about it. See you another time, Jacob.\"\n\nShe says as she stands up and walks away from the bench, without looking back. You watch silently as she leaves, before making your way home. You're not sure what the future holds, but you know it won't be one with Allison.", "action_results": [{"action": "Allison - Bad End", "result": "Unfortunately, you got the bad ending for Allison's route. This means that you made a few wrong choices in her path, and as a result didn't get a high enough score to get the better ending option (or you simply choose this one over it) . As a hint, I'll tell you that the order of the events you do at the fair matters, and that being concerned for her earlier on could make a difference.\n\n\nHope you try again!", "action_results": [null]}]}]}]}]}, null]}, null, null]}]}]}]}, {"action": "How do you know me?", "result": "\"Alright, how do you know me? You act really friendly with me, like we've known each other for a long time, but I've only known you for less than a week.\"\n\nYou tell her.\n\n\"Hmm...The easiest way to answer that, is to say we used to date.\"\n\nShe responds.\n\n\"We did?\"\n\nYou ask confused. You don't remember dating her in the past.\n\n\"We certainly did. How do you think I know you so well?\"\n\nShe asks in turn. While she hasn't mentioned any facts about your past or anything to prove she really knows you, she is pretty good at guessing what you'll say and do. To this, you shrug, unable to come up with an answer.\n\n\"Thought so. We dated, that's the answer to your question. The only answer I'll be giving, I might add.\"\n\nAllison says, attempting to stomp out any additional questions. You don't want to say she's wrong, and that you haven't dated before, but you honestly can't remember your past well enough to dispute it.\n\n\"Alright, when did we date then?\"\n\nYou ask.\n\n\"Nope, that's a second question!\"\n\nAllison answers with a smile.\n\n\"No it's not, it's part of the first question!\"\n\nYou reply.\n\n\"Nope! It's a brand new question. That's it for today Jacob! See you later.\"\n\nAllison says, turning and leaving with a short wave before you get a chance to tell her otherwise. You sigh, but with your question answered, just give in and wave back. You didn't expect that you had dated her before, but it's not entirely impossible. It probably would have been at least seven years ago, when you were eleven, since in between then and now you were in a completely different city. Allison must have a pretty good memory to remember you from back then. Done with the park, you return home.", "action_results": [null]}]}]}, {"action": "Leave and look for Allison", "result": "You decide it's better to go look for Allison than to wait around at school. It's not like you're learning anything important anyway. You brazenly walk out the front doors of the school and head towards the park Allison took you to on Saturday; the only place you think she could be.\n\nThat is to say you start to head there, when you see Allison walking towards the school. Confused, but with your objective already achieved, you approach her. She notices you, and brings her gaze to the ground.\n\n\"Hey, Allison.\"\n\nYou say. Moments after the words leave your lips, you realize she seems off.\n\n\"You okay?\"\n\nYou ask in a concerned manner. Allison brings her eyes to yours briefly, before looking away and doing a small shuffle backwards.\n\n\"...I'm fine...\"\n\nShe replies after a short silence.\n\n\"You don't seem fine...\"\n\nYou reply, fairly certain she's feeling nervous. Though, given your last meeting that's to be expected. Not being the best with words, you decide you can't apologize for this properly, so you move straight into your question.\n\n\"So, uh, I was wondering if you wanted to go to the fair with me...\"\n\nYou say, unconfidently with a small blush. Allison looks up at you, and for the first time you notice her eyes are bright blue. She stares at you expressionless for a second, before smiling.\n\n\"Yeah, that's just like you.\"\n\nShe says happily with a giggle, her mood changing completely.\n\n\"Yep, this is fine. I shall allow you to take me to the fair, Jacob.\"\n\nShe continues in a fake haughty tone.\n\n\"Great. So...we're good then?\"\n\n\"Of course. I was never mad at you to begin with.\"\n\nShe replies in a matter-of-fact tone.\n\n\"I'm just dealing with some things is all.\"\n\nShe says, walking by you towards the school.\n\n\"Come on, you really shouldn't skip school.\"\n\nAllison says with a sheepish smile, continuing towards the school.\n\nLike you're one to talk...\n\nYou think to yourself with a smile as you follow her.", "action_results": [null]}]}]}]}]}, {"action": "Refuse to go with her", "result": "\"I'd really prefer not to...\"\n\nYou reply, attempting to dissuade her. In response, she moves towards you until she's right by your face.\n\n\"Are you really refusing to go out with a cute girl?\"\n\nShe asks accusingly. For a moment she seems to be thinking about something, then she suddenly grabs your hand.\n\n\"Nope, you're coming!\"\n\nAllison happily declares. You pull your hand away from her, standing your ground.\n\n\"I don't want to go with you. Who the hell are you anyway?\"\n\nYou ask the girl. For someone who you just met a few days ago, she's incredibly clingy and demanding of you. Shocked, she backs away from you and sits back in her chair, eyes facing the ground.\n\n\"I...I'm sorry Jacob.\"\n\nShe weakly states.\n\n\"I got a bit ahead of myself it seems. Heh, something must really be wrong with me.\"\n\nShe continues in a dejected tone. You sigh. It seems you got too angry with her and made her upset. Truthfully you find her persistence a little, well more than a little, annoying. You never had that much motivation to do anything growing up, so seeing someone so opposite to you just gets at you a bit.\n\n\"Naw, it's me that has something wrong with him. Refusing to leave with such a cute girl.\"\n\nYou reply, you face flushing red as you compliment her.\n\n\"But really, I barely know you. Why are you so interested in me?\"\n\nYou ask. You also remember that you never actually told her where you live, but you get the feeling you really don't want to hear how she knows. Allison takes a deep breath, smacks her cheeks, and looks up to face you.\n\n\"No real reason. You just seemed interesting is all.\"\n\nShe says with an obviously fake smile.\n\n\"Well, if you don't want to go with me I should probably go.\"\n\nShe says standing up.\n\n\"I'll see you later Jacob...\"\n\nShe says as she waves to you and exits your house. You want to question her more, but she seems like she's moments away from emotionally breaking down, so you instead just nod in response as she leaves. You lay down on your couch after she's gone and stare up at your ceiling.\n\nWho is she...\n\nYou think, before drifting off to sleep for a nap.", "action_results": [null]}]}, {"action": "\"Fine, come in\"", "result": "\"Fine, come in\", you reply, opening the door further and allowing her to enter. Given her personality, you're rather doubtful she would have accepted no as an actual answer. You lead her into your living room and sit across from her once there.\n\n\"So, what'd you want?\"\n\nYou ask skeptically. Allison's eyes seem to wander around your living room during this time, but are brought back to you once you ask.\n\n\"I'd like to invite you somewhere...can you come?\"\n\nShe asks. You sit and wait for her to elaborate, but when she remains silent you decide you'll have to ask yourself.\n\n\"Invite me to where?\"\n\n\"It's a secret!\"\n\n\"That doesn't answer my question.\"\n\n\"It wasn't suppose to!\"\n\n\"You're not going to answer me properly are you?\"\n\nYou ask. She grins and nods her head.\n\n\"Can you at least tell me when?\"\n\n\"Now.\"\n\n\"Why now?\"\n\n\"Why not now?\"\n\nYou figure that's all you'll get out of her, so you decide to just make up your mind about the matter.", "action_results": [null, null]}]}, {"action": "Wake up early", "result": "Remembering your mother's words, you quickly spring to life early in the morning, and prepare to take your sister to school. Though, all that really involves is you walking a few blocks with her. Although you should have your license at this age (and after a quick check you confirm you do), your mother has the only vehicle, so driving your sister is out of the question. After getting ready you exit your door to find Tina standing there, her fist seemingly prepared to knock. An awkward moment of silence follows as you look at her, contemplating why you two never talk in the future.\n\n\"We...have to go soon.\"\n\nShe manages to say, looking down at the ground to avoid eye contact. Why the hell does it seem like she's afraid? It annoys you, but you try to ignore it. Your own sister, afraid of you.\n\n\"Yeah, let's go.\"\n\nYou say, walking past her and towards the door. Come to think of it, you moved around a few times while you were a child, and a good portion of it was due to her. Even though Ian is your best friend, now and in the future, you had only become friends with him a year ago at this point in time. You had lived here before, years ago when you were a child, but you had to moved because of your father's work. You moved back eventually, but it was only due to Tina getting accepted into the private school she's currently attending.\n\nFinally ready, the two of you exit the house and begin the walk towards her school. It's done mainly in silence, and as you get closer to the school, she seems to unconsciously move closer to you, distancing herself again whenever you notice. It always annoyed you how quiet and shy she seemed to be. Once at the school's large and elegant gates, you stop.\n\n\"There, have fun at school.\"\n\nYou say, as you begin to walk away.\n\n\"U-um...\"\n\nYou hear a small voice say behind you as you go to walk.\n\n\"Can you pick me up after...after school...?\"\n\nYou hear your sister request. Turning to her you sigh.\n\n\"Why?\"\n\nYou ask in an obviously annoyed tone. Tina nervously moves back as she clutches her bag.\n\n\"Just because...\"", "action_results": [{"action": "Agree to pick her up", "result": "You look at Tina then at your surroundings. You don't really have much else to do later today, so you might as well pick her up, you decide.\n\n\"Fine, I'll see you after you're done then.\"\n\nTina, oddly enough, smiles in response. Something you shouldn't find odd at all, but she never seemed to smile from what you remember.\n\n\"Thanks, see you after I'm done then!\"\n\nShe replies, hurrying into the school. You watch her run away and frown. Why does she want you to pick her up anyway? Sighing again, you turn and leave the school, returning back to your home. It's only about a 10 minute walk to the school, which calls into question if walking her to and from it really matters, but the distance means you basically have the entire day to yourself. Which you of course, decide to spend sleeping.\n\nOr rather, you would have spent it sleeping, had you not rudely been awoken at about two by the smashing of fists against your front door. You groan as you exit your bed and move downstairs to answer the door.\n\n\"What?\"\n\nYou ask angrily as you open it, only to find Allison happily standing in front of you. She smiles as you open the door.\n\n\"Why hello there, Jacob, or should I say good morning?\"\n\nShe says cheekily. You open your mouth to retort, but she interrupts you.\n\n\"Anyway, I've been out here for a while, so can I come in?\"\n\nShe continues, you go to reply, but she again interrupts you.\n\n\"What do you mean no? Would you really leave a cute girl outside in the cold?\"\n\nYou stand silently and glare at her as she attempts to make a cute pose.\n\n\"...Done?\"\n\n\"Yep!\"", "action_results": [null, null]}, {"action": "Say no", "result": "Why should you have to pick her up? It's bad enough you had to walk her here, but Tina is old enough to be walking to and from her own high school.\n\n\"No, you can walk home yourself. Grow up already.\"\n\nYou reply coldly, turning and walking away. Tina doesn't reply back, and merely walks to the school. She should have expected that answer, given you have no reason to pick her up. Returning to your house, you do what any high schooler does, you spend the day sleeping.\n\nOr rather, you would have spent it sleeping, had you not rudely been awoken at about two by the smashing of fists against your front door. You groan as you exit your bed and move downstairs to answer the door.\n\n\"What?\"\n\nYou ask angrily as you open it, only to find Allison happily standing in front of you. She smiles as you open the door.\n\n\"Why hello there, Jacob, or should I say good morning?\"\n\nShe says cheekily. You open your mouth to retort, but she interrupts you.\n\n\"Anyway, I've been out here for a while, so can I come it?\"\n\nShe continues, you go to reply, but she again interrupts you.\n\n\"What do you mean no? Would you really leave a cute girl outside in the cold?\"\n\nYou stand silently and glare at her as she attempts to make a cute pose.\n\n\"...Done?\"\n\n\"Yep!\"", "action_results": [null, null]}]}]}, {"action": "Join the wolves", "result": "You ponder joining the Wolves with Ian for a minute. This certainly isn't typical behavior for him after all. After a brief inner argument, you determine that there has to be something more to this gang. Ian wouldn't throw his life away for no reason, and who knows, maybe him saying it's a 'gang' is just some self-imposed label. Maybe they act nothing like a gang.\n\n\"Yeah, sure man I'll join.\"\n\nYou reply. Ian smiles, clearly relieved.\n\n\"Thanks, for a second there I wasn't sure what you'd do.\"\n\nHe says with a bit of a nervous laugh. For a second there you weren't really sure what you'd do either. You take a few steps into the room and sit on a comfy looking recliner.\n\n\"So...what now? What exactly does this gang of yours do?\"\n\nYou ask, as Ian places the beer he was previously holding back into the fridge. It seems he didn't plan on drinking it unless you did as well.\n\n\"Well, calling it a gang may have been a stretch. My brother made it up with his friends a while back, and I joined it pretty recently. So far we basically just all hang out together here every once in a while. A home away from home...kind of.\"\n\nHe says, trailing off a bit at the end.\n\n\"Hmmm. Cool.\"\n\nYou reply. You don't really want to pry any deeper into his reasons for being here, as you can kind of sense it's a sensitive topic, and you don't remember enough about the past, or rather the present, to be confident in your ability to not say something stupid.\n\nThe two of you hang out in the gang's headquarters for the rest of the day, until about the time when class would normally end. You don't do a whole lot, just sit around and talk, but it's kind of nice to just chill with Ian. On your way out, Ian says one more thing.\n\n\"Oh by the way, I can't make you an official member myself. You're gonna have to come back when my brother is here to do that.\"\n\n\"Sure, maybe he'll be here next time.\"\n\nYou reply as you return home. Once there, you find that neither your sister nor mother are aware that you skipped school today. The night passes and you lay in your bed, staring at your alarm clock, quite pleased that tomorrow is a Saturday.", "action_results": [null, null]}]}]}, {"action": "Go to school instead", "result": "Thinking it over, you decide it's better if you don't miss school today. You'd miss your chance to talk to Olivia or Allison if you did after all.\n\n\"Sorry, I think I'll just go to school, Ian. See ya.\"\n\nYou say, walking onwards without him.\n\n\"Alright then, your loss man. Later.\"\n\nIan replies with shrug and a wave. He then turns and goes his own way. The walk to school is uneventful, and surprisingly when you arrive you find that Allison isn't there in your first class. Olivia is there as per normal, and she seems to ignore your presence, although you occasionally catch her glancing at you. The class itself is boring, and you start to regret not skipping it with Ian. However, once it ends and you finally have spare time, you jump up and approach the teacher.\n\n\"Hey, um, Mr...\"\n\nYou begin, however the realization hits you that you don't actually know his name, so you quickly just ask your question.\n\n\"Why isn't Allison at school today?\"\n\nYour teacher looks at you confused.\n\n\"Allison?\"\n\nHe asks. A brief moment of panic comes over you where you think you may have imagined her entirely. Then the teacher begins to speak again.\n\n\"Ah, the new girl that joined us yesterday...\"\n\nHe says. Internally you breathe a sigh of relief, happy to know you haven't gone insane.\n\n\"Yes, it appears she is absent today. Strange, she only just started yesterday...\"\n\nHe continues. You thank him and quickly exit the room. In the hall, you can see Olivia making her way towards the cafeteria.", "action_results": [{"action": "Look for Allison", "result": "More concerned about where Allison could be than school, you decide to look for her. With that in mind, you really have no idea as to where she could be. Your initial search is just around your high school, in the usual spots you might expect to find someone. The library, cafeteria, gym, courtyard, and the outside field all turn up nothing. If nothing else, it's clear that she's not at school. Undeterred, you decide this is a good time to skip school to continue your search.\n\nYou find yourself aimlessly walking around town in search of a girl you hardly even know. Sometime during your search, you find yourself wondering why you care so much about finding her. Do you intuitively know something is wrong and must find her? No, that can't be right, you don't think anything in particular is wrong with the situation. You were about to skip school yourself today, so it's not that big a deal that Allison would skip.\n\nThen, maybe you're just drawn to her? She is an odd one after all, so it's only natural you'd be curious about her. There's also the matter of her probably knowing more than she lets on. Maybe she even knows about your current predicament...\n\n\"For the love long since lost, the old friend forgotten, the new one neglected, the sister he could never see, and the brother he could never be.\"\n\nWere the words she said to you when you first approached her. You hadn't really considered any real deep meaning to them, but considering your circumstances, it probably has to do with you. Then, which are you, and for that matter, who is she? Does she actually know that you went back in time, or is this simply a large coincidence? You shake your head a bit. It's probably better if you just ask her again what she meant by all of that when you find her.\n\nAs your mind was wandering, your feet were still moving. You now find yourself outside of your sister's private high school, oddly enough. You guess it's about time school was over, as students seem to be exiting the school in an orderly fashion. That would mean that you spent three hours looking for Allison with no results. You sigh to yourself, although not finding her really should have been expected.\n\nYou're about to leave the grounds when you notice your sister walk out. Tina exits the front doors of school looking rather nervous, a normal sight with her it would seem. Thinking you should probably head home now, you turn to leave, when you notice a group of students approach her.", "action_results": [{"action": "Watch what happens", "result": "You stand on the other side of the gated fence and watch as the group approaches your sister. From this distance you can't hear what they're saying, but you should be able to tell the general mood. Tina isn't really a social type, and when she's put into social situation she tends to just try and hide, which is why a group of students talking to her sparks your interests. The group consists of three girls and four guys, all dressed the uniform of the private school. They speak to her for a few minutes, during which time your sister attempts to cower back into the school. Eventually, one of the girls walk right up to your sister and push her to the ground.\n\nA chill goes down your spine as you wonder who the hell these people are. You don't remember your sister being bullied in her high school, so why is this happening? Immediately after pushing her to the ground, the group leaves the school. You watch as they pass you by the front gate, but decide it's best not to confront them for the time being. Shortly after, you see Tina timidly walk by. She turns and notices you standing by the front gate, a mixture of fear and confusion in her eyes.\n\n\"Why...are you here?\"\n\nShe asks. You pause to think for a moment, and just as you're about to say something, your mother pulls up beside the two of you.\n\n\"Tina, who is...wait, Jacob? What are you doing here?\"\n\nShe asks, repeating Tina's question. Not wanting to admit you skipped the later half of classes to search for a girl you barely know, you lie.\n\n\"I just decided to pick up Tina is all.\"\n\nYou say. Your mother looks at you skeptically, but tells you and your sister to get in anyway. On the drive back, she reminds you that you need to wake up early to bring Tina to school tomorrow, since she works all day Saturday. You groan in response, but otherwise say nothing, and the rest of the night passes by without anything happening.", "action_results": [{"action": "Wake up early", "result": "Remembering your mother's words, you quickly spring to life early in the morning, and prepare to take your sister to school. Though, all that really involves is you walking a few blocks with her. Although you should have your license at this age (and after a quick check you confirm you do), your mother has the only vehicle, so driving your sister is out of the question. After getting ready you exit your door to find Tina standing there, her fist seemingly prepared to knock. An awkward moment of silence follows as you look at her, contemplating why you two never talk in the future.\n\n\"We...have to go soon.\"\n\nShe manages to say, looking down at the ground to avoid eye contact. Why the hell does it seem like she's afraid? It annoys you, but you try to ignore it. Your own sister, afraid of you.\n\n\"Yeah, let's go.\"\n\nYou say, walking past her and towards the door. Come to think of it, you moved around a few times while you were a child, and a good portion of it was due to her. Even though Ian is your best friend, now and in the future, you had only become friends with him a year ago at this point in time. You had lived here before, years ago when you were a child, but you had to moved because of your father's work. You moved back eventually, but it was only due to Tina getting accepted into the private school she's currently attending.\n\nFinally ready, the two of you exit the house and begin the walk towards her school. It's done mainly in silence, and as you get closer to the school, she seems to unconsciously move closer to you, distancing herself again whenever you notice. It always annoyed you how quiet and shy she seemed to be. Once at the school's large and elegant gates, you stop.\n\n\"There, have fun at school.\"\n\nYou say, as you begin to walk away.\n\n\"U-um...\"\n\nYou hear a small voice say behind you as you go to walk.\n\n\"Can you pick me up after...after school...?\"\n\nYou hear your sister request. Turning to her you sigh.\n\n\"Why?\"\n\nYou ask in an obviously annoyed tone. Tina nervously moves back as she clutches her bag.\n\n\"Just because...\"\n\nYou remember how yesterday you saw her get bullied by that group of students. Maybe that has something to do with why she wants to be picked up...", "action_results": [null, null]}, null]}]}, {"action": "Catch up to Olivia", "result": "You briskly walk down the hall and catch up with Olivia. As you do, you recall that the last time the two of you talked, she was rather hostile with you.\n\n\"Hey Olivia, listen, I'm sorry if I offended you or something.\"\n\nYou say, attempting to mend whatever you broke earlier.\n\n\"Can't we just start fresh? Forget whatever I did to make you angry?\n\nYou ask hopeful, extending your hand to her. She glances at it, then at you, and sighs.\n\n\"Sure, why not. Forgetting things seems to be a pattern for us anyway.\"\n\nOlivia replies, shaking your hand gently. You smile in response, though her off-hand sarcastic remark confuses you slightly.\n\n\"So, where are you headed off to?\"\n\nYou ask.\n\n\"To the lunchroom, it's lunch time after all.\"\n\nOlivia responds, rather impassively.\n\n\"Fair enough, so, mind if I sit with you?\"\n\nYou ask, hoping you can maybe find out more about her. You're starting to think that your feeling that you knew her was off, but you still want to make sure. She glares at you as the two of you enter the lunchroom.\n\n\"You remember I said I had a boyfriend, right?\"\n\nShe asks.\n\n\"Of course.\"\n\nYou say, not dissuaded in the slightest.\n\n\"Then fine, we can sit together.\"\n\nYou smile, relieved that she agrees to sitting together. As you approach your seats, you think over what you should talk to her about.", "action_results": [{"action": "Ask about her past", "result": "At this point you decide you shouldn't pry into her love life, so you ask her about her past. You pose the question, and she looks at you with a hostile expression that leads you to believe you may be entering a risky topic.\n\n\"My past? Why do you care?\"\n\nShe asks.\n\n\"Just curious is all. I can tell you about my past first if that helps...\"\n\nYou reply defensively. Olivia stares at you angrily, which you take to mean you better start talking.\n\n\"A-alright then. Well, I grew up in this city until I was about...let's see now, twelve I think. Then my sister got accepted into some fancy private school, and we had to move about an hour away. I still remember that we had to pick up and pack in like a day with no real notice. While in this other city my father...passed away.\"\n\nYou say, remembering him. Your father was by no stretch the greatest father ever, but he was able to pay you attention from time to time and had no large faults, so you have fond memories of him. Olivia's expression gets a bit softer, probably because she feels bad that she had you bring up a sad topic. You continue on as normal.\n\n\"Then my sister got accepted into another private school, that private high school in this town. So, we moved back here after being gone for six years. Once I came back I met Ian, though I haven't seen any of my old friends...\"\n\nYou finish, remembering that you did have some friends that you left behind originally, but you never did find them. Come to think of it, with how fast you left you're not even sure if you had to say goodbye to them to begin with. Olivia looks at you, seeming like she wants to say something.\n\n\"I see...\"\n\nIs all she manages to say thought. You're not sure why, but it seems like the topic has gotten her a tad depressed. She packs up her lunch and stands.\n\n\"I have to go now...talk to you later.\"\n\nShe says. You give her a wave goodbye, but feel a bit disappointed she didn't talk about herself at all. You sigh and exit the cafeteria, deciding to try asking her about her past some other time. The rest of the day goes by without much happening, and when you arrive home nothing exciting happens either. The night passes and you lay in your bed, staring at your alarm clock, quite pleased that tomorrow is a Saturday.", "action_results": [null, null]}, {"action": "Ask about her boyfriend", "result": "Olivia seems pretty intent on letting everyone know that she has a boyfriend, so maybe that'd be a good place to start. The two of you sit down and take your lunches out.\n\n\"So, tell me about this boyfriend of yours. You must really like him if you keep mentioning him.\"\n\nYou say as you pull out some food. Olivia seems rather surprised that you would ask her such a question, but doesn't seem reluctant to answer.\n\n\"Why are you interested in Brent?\"\n\nShe asks. You shrug in response. It's not that you're interested in him, you just need some sort of starting ground with her.\n\n\"So, I take it Brent is his name then?\"\n\nYou ask, sidestepping her question.\n\n\"Well, it is, but you didn't answer me.\"\n\nShe replies. It seems she's pretty aware of these kinds of things, in contrast with her aloof manner.\n\n\"I was just wondering what kind of guy you liked is all.\"\n\nYou reply. Though, you instantly realize that could be taken in a different way than you had intended. Olivia looks at you with the same passive face she usually makes, before eating some more of her food. If she noticed that what you said could be interpreted as you liking her, she isn't showing it.\n\n\"I'll give you the typical girl response. He's handsome, tall, strong, and he actually asked me out.\"\n\nShe says. You question if him asking her out is a quality a girl would typically give, but roll with it.\n\n\"So he's not smart then?\"\n\nYou ask with a laugh.\n\n\"No, though that seems to be a common issue with guys.\"\n\nShe responds with a glare. If you didn't know better, you'd think she's implying you're an idiot. Thinking you need to divert attention away from yourself, you decide to change the topic.\n\n\"Yeah haha, Ian's a pretty smart guy though isn't he?\"\n\nYou say. Olivia looks away from you.\n\n\"He is, unlike some guys I know.\"\n\nShe responds, standing up.\n\n\"I need to go now.\"\n\nShe continues, hurriedly picking up her things and walking away.\n\n\"Alright, seeya later Olivia.\"\n\nYou say as she walks away. She briefly pauses her walk to give you a small wave, before leaving the cafeteria. You don't really know if you can really consider this a success in learning more about her, but at least she's a bit more familiar with you now....you think.\n\nThe rest of the day goes by without much happening, and when you arrive home nothing exciting happens either. The night passes and you lay in your bed, staring at your alarm clock, quite pleased that tomorrow is a Saturday.", "action_results": [null, null]}]}]}]}]}]}, {"action": "Admit you know nothing about her", "result": "You sigh and nod.\n\n\"Yeah, sorry. I don't really know you.\"\n\nYou reply. Unexpectedly, she smiles and nods in response.\n\n\"Well, that's to be expected. We only just met after all. Maybe we'll get to know each other better in the future.\"\n\nAllison says, waving and walking away. You give her a short wave back and then decide to have something for lunch, and to maybe find Ian. After a short search through the cafeteria, you find Ian sitting with a girl, with long black hair, brown eyes, and dressed in a goth outfit. Oddly enough, you recognize her as Olivia, the girl you were talking with in detention yesterday. Noticing you, Ian waves you over to their table.\n\n\"Hey man, this here is Olivia.\"\n\nHe says, motioning to Olivia.\n\n\"We're both in the chess club together it seems, so I figured I should hang out with her a bit to get to know her better.\"\n\nOlivia looks at you with a mild expression of surprise while Ian speaks, before scoffing at his remark.\n\n\"I have a boyfriend you know.\"\n\nShe states, apparently thinking Ian has an ulterior motive.\n\n\"Ah, well of course you do. A cute girl like you is quite the catch.\"\n\nIan replies, although you can sense he didn't really expect her to have one. Olivia blushes slightly, but it's unnoticed by Ian.\n\n\"That's right, I had forgotten you were in the chess club Ian.\"\n\nYou say, finally sitting down.\n\n\"Yep, I'm the best damn chess-inator there is!\"\n\nHe replies while puffing out his chest with an odd sense of pride. However you don't really doubt he's the best there, as he's always been incredibly smart. You gaze wanders to Olivia, who notices and speaks.\n\n\"Just cause I look this way doesn't mean I'm stupid. Girls can be smart too you know.\"\n\nShe says harshly to you, apparently thinking you were judging her ability to play chess based on her goth outfit. You quickly shake your head in response.\n\n\"I, wait, I never said you couldn't.\"\n\nYou reply defensively. She turns her head away from you, almost in disgust. Ian looks at the two of you confused.\n\n\"Am I missing something here? Do you two got some history or something?\"\n\n\"No, of course not. We just met yesterday after all. Didn't we Jacob?\"\n\nOlivia replies angrily, even more upset now. You go to answer but she quickly speaks again.\n\n\"I need to go.\"\n\nShe announces, quickly standing from the table and walking away. The two of you watch as she leaves.Ian shrugs as you turn to him.\n\n\"Girls man. Confusing as hell, right?\"\n\nHe says before taking a drink of his milk in front of him. You nod, but can't help but think there was something more to what Olivia said.", "action_results": [null]}]}, null]}]}]}]}, {"action": "Do nothing", "result": "You decide against trying to talk to the gothic girl. You could get in even more trouble after all, and you probably don't even know her. Detention passes by slowly, but eventually you're dismissed. Ian is already long gone by the time you return to the front lobby, so you go back home alone.\n\nAlong the way you try to retrace your steps from this morning, and although you go down a wrong alley or two, you eventually make it home. Of course, your mother is noticeably upset you are hours late from school.\n\n\"So Jacob. Mind explaining why you have come home at such at late hour?\"\n\nYour mother asks impatiently as you enter the house, two hours after you should have been home.\n\n\"I...err...sort of had detention.\"\n\nYou reply.\n\n\"What for?\"\n\n\"I was late for my first class....\"\n\nYour mother seems annoyed, but doesn't push the matter too much further.\n\n\"Honestly Jacob, you won't ever succeed in life if you don't take things seriously. Even if you dislike school, being tardy is no excuse.\"\n\nShe says in a rather condescending manner. You nod your head in agreement and rush up the stairs seeing as she is finished scolding you. The rest of the day passes by with nothing of interest really happening. At the end of the day, you go to sleep and wonder if you'll wake up back in the future.", "action_results": [null]}]}]}]}]}, {"action": "Room 135", "result": "You enter room 135 and quickly survey its contents. The room is filled with other students which you would assume are in the same grade as you. Some of those in the class give you a quick glance, before returning their attention to the teacher. The teacher himself, a middle-aged man with a short beard, whom seems fairly familiar, looks up from his desk as you slowly enter through the doorway. He says nothing, but his reaction to you gives you the impression he knows you and that it's normal for you to be here.\n\nTaking that as your cue, you look for any sort of empty seat, and sit in one right as the bell rings. The teacher then stands up and approaches the chalk board behind him.\n\n\"Alright class, it's time to review what we learned yesterday....\"\n\nHe begins, but you quickly lose interest in what he's teaching and look around the room in search for some familiarity. Not that you can really be blamed for not paying attention, as you've listened to all this before anyway. That is, assuming you really have gone back in time, and this isn't all some weird dream.\n\nYou sigh softly, thoroughly confused at your current situation. Eventually, you spot a girl in the corner of the room that you seem to recognize. Or, rather than recognize, you should say you feel like you know her, for some reason or another. No name comes to mind, nor any memories involving her, but for some reason you still think she's someone you know.\n\nLong, black hair, with brown eyes, and a slim figure. What's most noticeable about her though, is her gothic outfit of all black, complete with a spiked dog collar, and black painted finger nails. Looking at her closer, you determine that her black hair is probably dyed, your guess being her originally hair colour is a light brown. You brood over how you may know her, and your predicament as a whole, until the class finally ends. As the goth girl leaves she seems to ignore you completely. Maybe you don't know her?", "action_results": [null]}]}]}, {"action": "No", "result": "“Uh no, I think I’m gonna stay home today.”\n\nImmediately you realize your mistake.\n\n“Stay home? Now Jacob, I wonder what you could mean by that.” Your mother, still standing behind you, remarks with a soft yet threatening tone while folding her arms in front of her.\n\n“I uh...it was joke. Yea...bye mom....”\n\nYou quickly rush out the door and meet Ian, who innocently shrugs in response to what happened.\n\n“What? It’s not like I knew she was there.”\n\nThe walk to school is uneventful. Ian tells you some story involving his older brother but you don’t really pay attention. The thought that you’re ten years in the past is all you can think about.\n\n“Hey.”\n\nIan pushes your shoulder gently once you reach the entrance of the school and the two of you stop. He has a concerned look on his face.\n\n“You alright? You sick or something?”\n\nHe asks.\n\n“Huh? No, I’m fine. Don’t worry about it.”\n\nYou walk ahead into the entrance of the school and Ian follows close behind.", "action_results": [null]}]}]}]}