{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=47011", "context": "", "first_story_block": "Born in 1900 you were a prosperous lawyer in Ohio. You had a wife, a good job and a good salary.\n\nIn 1929 the banks went bust, money became worthless and the Great Depression destroyed America. Your life savings were lost and your world destroyed. Many banks closed, dollars weren't worth the ink to print them, lenders demanded their money back and your life changed forever. First you were sacked, your office closed and unable to find work you were forced to watch as your personal belongings were sold one by one. Your wife, pregnant with your first child, caught pneumonia which worsened and on Christmas Day she died.\n\nYour last dollars were spent on her funeral and tombstone.\n\nDays later your house was repossessed; destitute and desperate you joined the millions travelling from town to town seeking work but there was nothing: one in three Americans were unemployed and there were no jobs available. Crime became the answer for many, including you.\n\nOne desperate night you broke into a shop and stole food, drink and the money in the till: thirteen Dollars. The robbery was noticed by a passing policeman and though you tried to flee on foot you were cornered in an alley and arrested by several armed policemen. Taken to prison you were swiftly put on trial, convicted and sentenced to three years imprisonment. Locked in a cell you were forgotten.\n\nIt is in prison that you met John Dillinger and his friends.\n\nJohn Dillinger, a handsome joker with an addiction for chewing gum, came to befriend you. He was in prison for a small-time robbery as well but because he used a gun he received a ten year sentence. He has been forgotten too: betrayed by his friends, rejected by his family and divorced by his wife. Over the years you became close friends with him and several other criminals, all convicted bank robbers. Over time you befriend Pete Pierpont, Red Hamilton, Charlie Makley, Russell Clark and Homer Van Meter, except for Homer all are surving lengthy sentences.\n\nFinally your day comes: in the spring of 1933 you and John are paroled on the same day, a short while later Homer is released from prison as well and moves away, drifting in and out of contact. On the day of your release Pete, Charlie, Red and Russell give you and John two lists: one of banks that they know would be easy to rob and one of fellow criminals you could team up with if you do plan a robbery. You throw away your lists, return to your hometown in Ohio and determined to go straight you try to get a legitimate job.\n\nPrison did not give you any money when you were released, make any arrangements to help you or even keep track of you. After three years the Depression still holds America in its terrible grip as strongly as ever - you only survive at all thanks to Soup Kitchens and Homeless Shelters and all your desperate attempts to get a job end in failure. Day after miserable day you sit on the streets or stand in the bread lines thinking about your friends in prison.\n\nFinally one summer day you have had enough: you travel to John's home in Mooresville, Indiana where you find your friend glad to see you. He has been planning a bank robbery of his own with two kids called William Shaw and Paul Parker that he met in a pool hall and he is glad to have you join them. One summer's day you drive out to begin your fateful outlaw career...", "action_results": [{"action": "Click here to begin your Outlaw Career", "result": "One morning you drive up outside the New Carlisle National Bank and leaving Paul in the car you, John and William walk into the bank. You approach the lone cashier and draw your guns.\n\n\"Alright buddy, open the safe,\" John tells him with a smile.\n\nThe cashier takes some keys, crosses to the safe and tries to open it but he is nervous and fumbles with the lock.\n\n\"He's stalling,\" William snaps to you and John. \"Let me drill him.\"\n\nYou shake your head. \"Take your time,\" you tell the cashier encouragingly.\n\nFinally he gets the safe door open, as he does a female bank teller walks in. John turns and trains his gun on her.\n\n\"I don't want to hurt you,\" he tells her and indicates with his gun that she should get over by the wall. \"You hadn't ought to come in the bank so early,\" he tells her with a smile.\n\nYou make the tellers fill a sack with money and then lock them in the vault, walk out of the bank and hurry inside the car with Paul. As you drive away towards the state border to Indiana you count the money and find you have stolen $11,000, making each person's share $2,700. Your first crime taking you down the outlaw road has been a lucrative one.", "action_results": [{"action": "No going back now", "result": "After the New Carlisle bank robbery you, John and the teenagers drive down to Kansas where you hide out in the town of Muncie at the apartment of a hard-drinking friend of William's called Harry Copeland. You lie low at the apartment while Harry and John commit a few local robberies and then begin planning to rob a bank in the little town of Daleville, Indiana.\n\nThe night before the robbery Harry, William and Paul all drink heavily and on the morning of the planned robbery Harry is alright but William and Paul are too hung-over to go on the robbery. John decides to go ahead and rob the bank with just you and Harry but you are worried if three people are enough to pull the job off.", "action_results": [{"action": "Join John and Harry in robbing the Daleville Bank", "result": "You, John and Harry stroll out of the apartment, round to the back of it and get into Harry's car. As you start to pull down an alleyway towards the front you are startled to see several policemen armed with pistols running into the apartment - they don't even see you. Calmly John steers the car right onto the road and drives away from the raid.\n\nFleeing to a hotel in a nearby town you lie low until the next morning when you read in newspapers how William and Paul were arrested in their beds during the raid on the apartment. The three of you have some discussion and decide to go ahead with your plans to rob the Daleville Bank the next morning.\n\nJust two days after the raid you and John stroll into the bank, draw your pistols and train them on the sole bank teller behind the counter.\n\n\"This is a stickup,\" John tells her. \"Get me the money honey.\"\n\nJohn leaps over the counter, strides into the open safe and quickly scoops up the money inside before you both lock the teller inside, stroll outside and jump in the back of Harry's car. As you drive out of town you count the money and find you have gotten away with $3,500, making your share of the money $1,100, not bad for a dishonest day's work.", "action_results": [{"action": "Another Bank Job", "result": "Two weeks after the Daleville Robbery the three of you drive into the little town of Montpelier, while Harry stays in the car you and John stroll into the bank, draw your pistols on the customers and tellers inside and announce this is a stick-up. Almost immediately a female teller reaches towards a button on the wall and John trains his gun on her.\n\n\"What are you trying to do, set off that alarm?\" he asks, chewing his gum.\n\n\"I would if I could,\" the woman snaps back.\n\nJohn herds the prisoners up against a wall while you stride into the vault and shove all the money you can find inside into a bag before locking the customers inside the vault. As you walk out of the bank you encounter an old man standing outside who has obviously been watching what has happened through the windows.\n\n\"Looks like the bank's being held up again,\" he comments to the pair of you.\n\n\"It's so easy, I'm not surprised,\" you tell him with a smile. Climbing in the car you drive off with Harry and count the money in the back. You have stolen $10,000, making your share $3,300. Soon after the robbery you get word that your old prison friend Homer Van Meter wants to meet so the three of you drive up to Chicago, Illinois to see him.\n\nHomer, a skinny, cold character who in prison was something as a loner greets the three of you looking happier than you remember seeing him looking before.\n\n\"Hello pals,\" he says shaking hands with you all. \"I've been reading about your bank jobs in Indiana and Ohio, they're great stuff. I've teamed up with an outfit myself led by Baby Face Nelson. You know him right, used to lead a gang three years ago and escaped from prison last year? He's a real tough character.\"\n\n\"I heard he was gun-crazy and a killer,\" Harry says frowning.\n\n\"Well maybe a little but he's a guy you want on your side in a gun-battle,\" Homer says cheerfully. \"He's put together a nice little crew, there's me, a former boxer called Tommy Carroll, Eddie Green of the Barker-Karpis Gang, that old veteran masterthief Eddie Bentz and two Chicago gangsters called Earl Doyle and Chuck Fisher. We're looking at a bank job in Grand Haven, Michigan later this month if you are interested.\"\n\n\"Thanks Homer but Harry and I have some scores of our own lined up,\" John tells him. \"I've got a mind to try and get some guns smuggled into Michigan State Pen to help Pete, Charles, Red and Russell bust out. If I can get them out we can start up our own gang.\"\n\n\"Well the offer is always there if you want it,\" Homer tells John before turning to you. \"What do you reckon? You want to join the Nelson Gang?\"", "action_results": [{"action": "Join Homer in the Nelson Gang", "result": "You agree to go with Homer who assures you on the journey to the town of Grand Haven, Michigan that your experience robbing three banks more than qualifies you to join Nelson's group - most of the gang except Nelson and Bentz have less experience. In Grand Haven Homer goes off for a few days to arrange an introduction between you, Nelson and the rest of the gang.\n\nNelson lives up to his nickname (which he despises, preferring people call him Jimmy), he is a baby-faced youthful little man but with a distinct air of menace. Eddie Green is a red-haired veteran stick-up man, Tommy Carroll is a handsome ex-boxer while the two recruits Earl Doyle and Chuck Fisher are typical grim-faced gangsters. Eddie Bentz is blond-haired and capable, he has a long history of pulling off some of the most successful bank robberies of the last ten years.\n\nOne summer's day you, Eddie Bentz and Jimmy walk into the bank while Homer and Earl guard the doors, Eddie Green and Tommy wait on the streets and Chuck sits in the escape car. The three of you walk up to the counter and draw your pistols while Jimmy whips a machine gun out from under his coat.\n\n\"Hands up,\" he barks.\n\nEddie Green and Tommy hurry inside as planned and help you take the customers and bank staff hostage while Eddie and Jimmy begin emptying the contents of the vault into sacks.\n\nOutside you hear Homer shout \"Hurry, the alarm's been raised!\"\n\n\"Don't shoot unless they start shooting first,\" Eddie B cautions Jimmy.\n\nWith the sack of money in hand you all run out on the street as a man with a shotgun fires at you from the other side of the road, blasting a hole in a bank window - Jimmy returns fire wit his machine gun making the man dive for cover as the bullets blast through car windows and glass store fronts. The others run out onto the street as well.\n\nAt that point you notice something.\n\n\"Our car, where is it?\" you demand.\n\n\"Chuck panicked and drove off,\" Homer yells back to you.\n\nFor a moment you are all stunned and then Eddie B runs into the road and waving his pistol he forces an approaching car to stop. As the woman inside scrambles out Eddie stands by the open door and yells for you all to get in. Most of your fellow gang members start running towards him.\n\n\"We all won't fit in that little car,\" Earl shouts back. \"We should run for it.\"", "action_results": [{"action": "Run towards the car", "result": "You join the others in running towards the car, there isn't enough room for everybody inside the compact car so while Eddie B drives and Jimmy, Tommy and Eddie G pile in you and Homer have to stand on the running boards as you drive out of town - looking back you see Earl Doyle tackled to the ground and captured by townsfolk. Once you are out of town you are able to hijack a second car out of town and drive on across the state.\n\nCounting the money you find you have stolen just $3,500, making your share $500. Eddie B is furious at the poorly executed robbery and derides all of you as a gang of amateurs. He plans to go to New York and essentially retire from crime. Jimmy is not much perturbed and is quickly putting together plans to rob another bank, this time in Minnesota.", "action_results": [{"action": "Go into retirement with Eddie B in New York", "result": "You decide to go into hiding with Eddie Bentz, relying on the wily veteran to keep you both out of trouble. This he largely manages: while your fellow gang members are all robbing banks, getting arrested or shot you two live quietly in hotels in New York, rarely venturing outside. You read in papers of Harry Copeland's arrest, of the arrest of Chuck Fisher and the shooting deaths of Eddie Green and Tommy Carroll. Soon of your friends only John Dillinger, Baby Face Nelson and Homer Van Meter remain at large and the whole country is looking for them.\n\nFinally one day, more to relieve the boredom than anything else, you and Eddie drive up to Vermont where you sit in the car while Eddie goes into the bank. He emerges five minutes later with a sack of money and the two of you drive back down south. You have both stolen $8,500, making your share of the money $4,200.\n\nYou return to New York and continue to live quietly for the rest of the year: by the end of the year John, Homer and Baby Face have all been tracked down and killed by local lawmen or the FBI. You and Eddie are the only members of the Dillinger or Nelson Gangs still at large and now the FBI are focusing all their resources on finding you two... you begin to question whether it is safe to remain in New York.", "action_results": [{"action": "Leave America and go to Cuba", "result": "You elect to go to Cuba at the start of 1935, a year later Eddie is tracked down and arrested by FBI Agents. In Cuba you are able to purchase a small house at Varadero Beach and live the life of a retired criminal. Perhaps your career was not as exciting as John Dillinger's or Baby Face Nelson's or some of your other contemporaries but at least you survived to enjoy your stolen money.", "action_results": [{"action": "Retirement", "result": "For many decades you live in peaceful retirement in Cuba while policemen and FBI Agents across America continue to search for you for decades. Eventually interest in your winds down and completely fades away when World War 2 breaks out. The troubles of that War, and the Cuban Revolution, do not affect you in your little paradise, carefully investing your stolen money in businesses you make enough money to live in comfort for the rest of your life.\n\nAlone of the members of the Dillinger Gang you have triumphed and enjoy a life of ease and luxury after so many dangers. The FBI never discover your identity and you live out your days in peace, always keeping fresh the memory of your companions and the terrible gunfights and robberies you survived that they didn't.\n\nYou have triumphed.", "action_results": [{"action": "The End", "result": "This is a Hidden Bonus page that rewards anyone who survived the story with extra Score points - if you want others to see your Score please leave a comment after you have finished reading this story.\n\nIf you survived the story but served a lengthy prison sentence you receive a bonus of 50,000.\n\nIf you survived the story and served no lengthy prison sentence you receive a bonus of 100,000.\n\nFinally thank you for taking the time to read my story.", "action_results": [{"action": "Your Outlaw Career is over", "result": "This lists the Names, Gunfights, Injured, Killed, Robberies, Score and Fates of your fellow Outlaws so you can see how well you compare to them.\n\n1: John Dillinger, Gunfights: 12, Injured: 0, Killed: 1, Robberies: 11, Score: $62,000 - KILLED\n\n2: Red Hamilton - Gunfights: 9, Injured: 1, Killed: 1, Robberies: 6, Score: $37,600 - KILLED\n\n3: Homer Van Meter - Gunfights: 9, Injured: 2, Killed: 3, Robberies: 6, Score: $29,500 - KILLED\n\n4: Baby Face Nelson, Gunfights: 7, Injured: 5, Killed: 5, Robberies: 5, Score: $25,300 - KILLED\n\n\n5: Tommy Carroll - Gunfights: 6, Injured: 1, Killed: 1, Robberies: 5, Score: $23,900 - KILLED\n\n6: Eddie Green - Gunfights: 3, Injured: 0, Killed: 0, Robberies: 4, Score: $19,700 - KILLED\n\n7: Pete Pierpont - Gunfights: 4, Injured: 0, Killed: 1, Robberies: 3, Score: $17,100 - KILLED\n\n8: Charles Makley - Gunfights: 4, Injured: 2, Killed: 0, Robberies: 3, Score: $17,100 - KILLED\n\n9: Russell Clark - Gunfights: 3, Injured: 0, Killed: 0, Robberies: 3, Score: $17,100 - ARRESTED\n\n10: Harry Copeland - Gunfights: 0, Injured: 0, Killed: 0, Robberies: 3, Score: $12,400 - ARRESTED\n\n11: Chuck Fisher - Gunfights: 0, Injured: 0, Killed: 0, Robberies: 2, Score: $5,800 - ARRESTED\n\n12: John Chase - Gunfights: 5, Injured: 0, Killed: 0, Robberies: 1, Score: $5,600 - ARRESTED\n\n13: Eddie Bentz - Gunfights: 0, Injured: 0, Killed: 0, Robberies: 2, Score: $4,700 - ARRESTED\n\n14: William Shaw - Gunfights: 0, Injured: 0, Killed: 0, Robberies: 1, Score: $2,700 - ARRESTED\n\n15: Paul Parker - Gunfights: 0, Injured: 0, Killed: 0, Robberies: 1, Score: $2,700 - ARRESTED\n\n16: Earl Doyle - Gunfights: 0, Injured: 0, Killed: 0, Robberies: 1, Score: $500 - ARRESTED", "action_results": [{"action": "Click here to see some information about how I wrote this", "result": "John Dillinger was described by his friend Harry Pierpont as \"the kind of guy you would want for a brother\". He was an easy-going, friendly and charismatic person who chewed gum through his robberies, said things like \"Attaboy sport\" and avoided unnecessary killings and shootings (except one time) throughout his career.\n\nIn contrast to this his fellow outlaw Baby Face Nelson could fairly be described as a murderous psychopath who laughed on multiple occasions as he sprayed machine gun bullets towards innocent civilians including women and children. Dillinger's fellow outlaws were usually murderous too, to a lesser or greater extent, and most paid the price for their lives of crime.\n\nI am hugely indebted to Bryan Burrough's fantastic book Public Enemies (which was turned into a film starring a strangely charmless Johnny Depp as Dillinger), the FBI Reading Room Files about their manhunt of Dillinger and Baby Face Nelson Journal which is a great little website full of little bits of information about the Gang.\n\nThis story is part of the larger American Outlaws series, a set of books that are based mainly around the robberies, gunfights and shootings that various Outlaw gangs in American History were involved in. After heavy research these stories become incredibly easy to write as they are 90% based on true history, hence a 100 page story in a month becomes no major challenge once the research is done.\n\nThese non-fiction story-games are not choose your own adventures in the traditional sense of the term but it is a new approach to the genre that I hope will prove popular. In the future I want to experiment with new formats for the whole choose your own adventure concept and I want to sincerely thank any readers who have been patient or curious enough to read this far - their feedback good or bad really encourages and assists my writing so thank you.\n\nJohn once said \"all my life I wanted to be a bank robber, carry a gun and wear a mask. Now that it's happened I guess I'm just about the best bank robber they ever had and I sure am happy.\"\n\nThose last four words are pretty much how I feel about writing. :D", "action_results": []}]}]}]}]}, {"action": "Stay in New York with Eddie", "result": "You remain in hiding with Eddie in New York for most of another two years until, inevitably, the FBI tracks you down. The first thing you know about what is happening is when, in the middle of the night, your hotel door is smashed open and within seconds FBI Agents are hauling you from your bed and clasping handcuffs on you. Eddie is taken into custody as well and the two of you receive long prison sentences.", "action_results": [{"action": "Alcatraz", "result": "You are sentenced to life imprisonment on charges of bank robbery and in 1936 you are sent to Alcatraz Penitentiary where Baby Face Nelson's companion John Paul Chase is already serving time. You remain there until it closes in 1963, seven years later you are paroled. By this time you are an old man and no longer deemed a threat to society.\n\nOne by one your old friends pass on, many indeed are already gone. Harry Pierpont and Charles Makley are sentenced to be executed for murder, when they try to escape from prison in 1934 Charles is shot dead and Harry is badly wounded, he is executed a month later. Russell Clark dies of cancer in 1968, John Chase dies of the same thing in 1973. The last of your fellow outlaws, William Shaw, dies in a hotel fire in 1977.\n\nYou continue, retiring to Washington to live out your remaining days. Your life is quiet and peaceful now. The rat-tat-tat of the machine guns, booms of the shotguns and pops of the pistol are quiet now, the screams of the dying and injured have been replaced by birdsong in the trees. The only money now you have are a few dimes in your pocket.\n\nWhen you reflect back on your crimes and punishment you do wonder if it was really all worth it?", "action_results": [null]}]}]}, {"action": "Join the Nelson Gang in robbing the Minnesota bank", "result": "You stick with the Nelson Gang and two months after the Grand Haven fiasco you drive into Brainerd, Minnesota. This time Jimmy leaves you in the car while he leads Homer, Tommy, Eddie and Chuck into the bank. You sit tight for ten minutes drumming your fingers impatiently on the dashboard until finally your companions emerge. There is no sign that the alarm has been raised.\n\nSuddenly Jimmy does an inexplicable thing. He raises his machine gun and fires a burst of bullets into a shop front across the street, making the people inside dive for cover. Striding towards the car he continues to fire at shop fronts and cars grinning before jumping in the car after the others and all of you drive out of town. You are not convinced Jimmy is completely mentally stable.\n\nThe Gang has escaped with $32,000, making your share $5,300. Jimmy decides that you should all split up: Chuck and Tommy will drive down to San Antonio, Texas and hide out while Jimmy, Eddie and Homer will go to St Paul, Minnesota. In the papers you read how John and Harry succeeded in busting your friends out of prison where they have formed a gang and started robbing banks but as you have no idea where they are or how to find them you'll have to hide out with one of the halves of the Nelson Gang for now.", "action_results": [{"action": "Hide out with Chuck and Tommy in San Antonio", "result": "You drive south with Chuck and Tommy to San Antonio where you hide out for a few months and enjoy yourself relaxing in the city's bars and nightclubs. Occasionally you get the feeling that people are watching you but you can't be sure. One afternoon Tommy announces he intends to go visit a local bar and invites Chuck to join him but Chuck prefers to stay at the apartment so Tommy invites you.", "action_results": [{"action": "Stay in the apartment with Chuck", "result": "You relax at the apartment, reading a book in your bedroom while Chuck listens to the radio in the living room. When there is a knock on the door you hear Chuck go to answer it. A second later you hear \"FBI! You're under arrest!\" and the sound of several mean stampeding into the house. Springing to your feet you have only moments to make a decision. Your only possible escape route is to scramble out the window but it is a very long way to the ground...", "action_results": [{"action": "Climb out the window", "result": "Crossing to the window you throw it open and quickly climb out. Taking a deep breath you jump and land on the roof of a building below. Hearing a shout from the open window of your room you have no time to rest but race across that roof to a door leading back into your apartment building but two floors below your apartment. Bursting through it you jump down several flights of stairs as you hear voices shouting above you and running feet on the stairs.\n\nYou race out of your apartment building and quickly flag down a passing taxi. Jumping inside you order it to take you to the train station where you quickly book the next train out of town. Making your way back to St Paul you reunite with Jimmy, Homer, Eddie and Tommy, who also escaped San Antonio after shooting two policemen in a gunfight. Chuck was arrested but told the FBI nothing.\n\nThe five of you pass a quiet winter and begin to make plans for more bank jobs next spring. However that spring you hear how John Dillinger, recently escaped from prison and his friend Red Hamilton want to join forces with the Nelson Gang. A meeting is soon arranged between you all.", "action_results": [{"action": "The Terror Gang", "result": "Seven men meet in Minneapolis: you, John Dillinger, Red Hamilton, Baby Face Nelson, Homer Van Meter, Tommy Carroll and Eddie Green. You are all experienced bank robbers, most of you are killers and together you form one of the deadliest gangs of Outlaws in American History. You, John, Red and Homer are old friends and it is through this connection with Homer that John and Red are accepted into the Nelson Gang after their respective prison escapes and recovery from gunshot wounds.\n\nBaby Face Nelson is a youthful, dangerous little man with great ambitions that contrast sharply with John's more easy-going demeanour and Red's more absent-minded loyalty. Homer remains a skinny loner while Tommy, a handsome and deadly ex-boxer and Eddie, a red-haired veteran criminal, make up the rest of the gang.\n\nYou already have your targets picked: two banks at Sioux Falls, South Dakota and Mason City, Iowa. You plan to hit the first bank the next day, meanwhile Nelson (everyone calls him Jimmy), who considers himself the leader of the gang, wants to drive down and check out the bank with his friend petty criminal John Chase while the rest of you go over your plans and make ready for the robbery.", "action_results": [{"action": "Join Jimmy and John in checking out the bank", "result": "While the rest of the gang stay at the hideout and make ready you, Jimmy and John start driving towards South Dakota but almost immediately a car cuts in front of you. Irritated Jimmy, who is at the wheel, cuts ahead of him and the car cuts in front of him again. Jimmy loses his temper and rams his car against the other, trying to force it onto the kerb. The other car breaks and the man inside jumps out.\n\nJimmy jumps out with his pistol in his hand and you can tell he means to shoot the angry driver.", "action_results": [{"action": "Join him in shooting the other driver", "result": "You join Jimmy in jumping out and together you both shoot the man in the chest, he falls to the ground. A woman screams, jumps out of the car and runs to his side.\n\n\"You've killed him,\" she wails.\n\n\"Keep your damned mouth shut or I'll let you have it too,\" Jimmy snarls at her. You both jump back inside your car and speed off back to the hideout. The next day you prepare to set off with the gang to rob the Sioux Falls Bank.", "action_results": [{"action": "The Sioux Falls Raid", "result": "Snow lies thickly on the ground as you and your companions drive into the little town of Sioux Falls, South Dakota. Eddie stays in the car, Tommy and Red take positions at the door while Jimmy leads the rest of you into the busy bank. Jimmy pulls a machine gun out from under his coat and the rest of you draw your pistols.\n\n\"This is a hold up!\" Jimmy shouts. \"Everyone on the floor!\"\n\nAlmost immediately an alarm starts ringing, John and Homer ignore it as they head into the vault while you and Jimmy guard the terrified hostages.\n\n\"I'd like to know who set the alarm off,\" Jimmy yells, striding up and down the bank angrily and pointing his machine gun at people. \"Who did it? Who? If you want to get killed just make some move! Go on, just make some move!\"\n\nLooking out the window you see a policeman on a motorbike stop just outside the bank.\n\n\"Shoot him,\" Jimmy yells at you.", "action_results": [{"action": "Shoot the cop", "result": "Raising your pistol you fire several shots through the window: the cop is hit four times and falls to the ground. Jimmy laughs. Moments later John and Homer are finished in the vault and hurrying outside surrounded by hostages you all scramble into the car. A few stray shots are fired at you, Jimmy fires bursts from his machine gun in reply. On the drive out of town you count the money and find you have stolen $46,000, making your share $6,500.\n\nA week later you all drive into Mason City, Iowa for your next bank job. Tommy stays in the car and Jimmy and John guard the doors while you lead Homer, Eddie and Tommy into the large First National Bank. Upon entering Eddie fires a burst of bullets from his machine gun into the ceiling.\n\n\"Hands up! Hands up!\" you shout. \"Everybody on the floor!\"\n\nHomer strides towards the counter, one of the teller runs from the counter into an office and tries to slams the door. Homer fires a burst of bullets through the thin wooden door and you hear a shout of pain. Suddenly there is a strange whumping noise and something hits Eddie in the back. It is a tear gas canister and it quickly begins leaking out clouds of gas.\n\nLooking up you see a blue-uniformed guard sitting in a cage lined with bulletproof glass, he has just fired the tear gas through a narrow gun slit and is hastily trying to reload the tear gas gun.\n\n\"Get that son of a bitch with the tear gas!\" Eddie yells at you, rubbing his back angrily.", "action_results": [{"action": "Fire at the guard", "result": "You fire several shots at the guard cage, mostly hitting the bulletproof glass but one shot goes through the narrow gun port and grazes the side of the guard's head. At that moment you hear a burst of machine gun fire outside. Leaving Eddie and Homer to control the lobby while Red deals with the vault you hurry outside. John is immediately outside the doors surrounded by hostages but Jimmy is further down the street, firing his machine gun wildly and laughing. You watch as he shoots an unarmed old man in the leg, knocking him to the ground. You jog over.\n\n\"I thought you were a cop you son of a bitch,\" Jimmy yells at him.\n\n\"I'm not a cop,\" the man moans.\n\n\"Did you have to do that?\" you ask Jimmy wearily.\n\n\"I thought he was a cop,\" Jimmy snaps at you.\n\nYou turn around as a gunshot rings out: a man firing from a window has clipped John in the shoulder. You and John fire your pistols at the window and the man inside jumps back. John shouts to those in the bank that you're all leaving a moment later Red, Eddie and Homer come jogging out. As they do the man in the window fires again, this time grazing Red's shoulder.\n\nSurrounded by hostages you all pile into the car and drive out of town surrounded by hostages. You are all in a bad mood, John and Red's wounds are painful but not serious and you had to leave before you could get all the money. Even so you discover that you have stolen $52,000, making your share $7,400.\n\nYour latest bank robbery has made you all the most wanted criminals in America and it is agreed that you should all split up. Jimmy and his friend John Chase are going out to Reno, Nevada, about Jimmy has been recruited by the Mob to kill an informer. John and Homer are going to St Paul, Minnesota to rent apartments, Eddie is going to Indianapolis, Indiana to lie low and Red and Tommy plan to hide out in Chicago, Illinois. You will have to hide out with until the heat wears off.", "action_results": [{"action": "Go with Jimmy to Reno to kill a guy", "result": "You drive to Reno with Jimmy and John Chase and once you arrive Jimmy meets with a man who gives him the address of the Mob Informer Roy Fritsch. You drive out to his house and ring the doorbell - as soon as Fritch opens the door you and Jimmy train your guns on him and order him into the car. The terrified man obeys and you all drive out of town and park next to an abandoned mine shaft. Jimmy orders John to take Fritsch out of the car over to the mine shaft - once the two are out of the car he glances at you.\n\n\"Do you want to drop him or shall I?\" he asks.", "action_results": [{"action": "Kill the man", "result": "You and Jimmy get out of the car and walk up to the man. He looks terrified and stares at you with pleading eyes but you hardly glance at him. Raising your pistol you shoot him once in the head and he falls to the ground. Jimmy pumps several more bullets into his motionless back before dragging him over to the abandoned mine shaft and dropping him in.\n\nFor most of the next month you remain around Reno, Nevada and read about the search for you and your friends. At the start of April John and Homer escape St Paul after a shootout with FBI Agents, days later Eddie is killed in the same area. Eddie's death is the trigger that prompts you and the rest of the gang to reunite in the second half of April.", "action_results": [{"action": "Back Together", "result": "In Chicago the Gang comes back together in a sombre mood: Eddie's death has hit you all hard and while Jimmy is keen to continue robbing banks the rest of the Gang are in low spirits (even John) and you decide what you need is a holiday so you all make plans to have a rest in a little inn called Little Bohemia Lodge in the middle of a wood in Wisconsin.\n\nThis planned holiday doesn't do much to relax you all, you soon get the feeling that the staff and guests of the Lodge recognize you all as the notorious outlaws that you are and begin making plans to leave the Lodge. One night you are all in your rooms in the Lodge packing when suddenly you hear gunshots outside.\n\nIt is not a little gunfire either but a storm: the boom of a shotgun, the rattle of a machine gun and the pops of pistols all fill the night air, glancing out the window you see several men hiding in the trees are shooting the hell out of a car. Instinctively most of the gang begin making for a back window except Jimmy who characteristically grabs a pistol and runs for the front door.", "action_results": [{"action": "Follow Jimmy out the front door", "result": "You and Jimmy throw open the front door, fire several shots with your pistols at the men in the trees and run off to the right. Racing through the trees you finally make it to a brightly-lit house and run inside, startling an old man.\n\n\"Now don't get excited,\" Jimmy tells him. \"I won't harm you but this is a matter of life and death. We need your car.\"\n\nAs he is speaking a car pulls up outside.\n\n\"Who does that car belong to?\" you ask the old man.\n\n\"I don't know,\" he replies.\n\nPistols held ready you cautiously approach the car to find it is full of men, you recognize three of them as staff from the Lodge. You order most of them out, leaving three inside as hostages. Jimmy gets in the front while you get in the back and order the driver to drive. Before he can start yet another car, this one with three men in it, pulls up next to you.\n\n\"We're FBI, who's in that car?\" the man asks.\n\nImmediately Jimmy jumps out of the car, pistol in his hand, and approaches the car of FBI Agents.", "action_results": [{"action": "Follow him", "result": "\"I know you bastards are wearing bulletproof vests,\" Jimmy declares. \"So I'll give it to you high and low.\"\n\nYou both raise your pistols and open fire.\n\nYour first shot grazes the driver in the head, panicking he throws open the car's passenger door and tumbles out onto the ground, the men in the back seat doing likewise. They both spring to their feet to run and you open up on them, hitting one of the men in the neck and the other man in the back. The men in the car behind you start running and Jimmy turns and fires at them too.\n\nYou and Jimmy jump into the FBI car and drive away. Behind you one of the FBI Agents fires his pistol at you but misses. As you drive away you notice another car full of FBI Agents driving towards you - finding a flashlight under the dashboard you click it on and shine the light full in the face of the approaching car, temporarily blinding the people inside until you safely pass.\n\nYou and Jimmy escape from Wisconsin after a series of difficult adventures and it takes you two months to reunite with the rest of the gang: in that time Red and Tommy are both killed by lawmen in separate gun battles and only your friends John and Homer are left. It is a very depleted gang that arranges a rendezvous in Indiana at the end of June.", "action_results": [{"action": "The Gang back together again", "result": "It is a weary and hunted group of men who gather in Indiana at the end of June. By this point you and John have survived being part of two outlaw gangs who have all been arrested or killed and now the members of your third gang are being hunted down and killed one by one. The writing is on the wall and while you and Homer are downcast and depressed John and Jimmy, who is never afraid of anything, remain upbeat and optimistic.\n\nJimmy brings his friend John Chase with him and the five of you discuss robbing a bank in the town of South Bend. You are worried about lack of members but Jimmy persuades the rest of you to let his friend John, a handsome and loyal but not over-intelligent individual, to join your Gang. You accept and that sunny day drive into South Bend to pull off your latest robbery.\n\nYou park the car and all climb out, Jimmy stays next to the car while you and Homer take up positions outside the bank while the two John's go inside. You hear gunshots inside. There is a policeman further down the street and at the sound of the shots he starts walking towards the bank. At your side Homer raises his rifle.", "action_results": [{"action": "Shoot the cop", "result": "You raise your rifle and fire a single shot into the policeman's chest, fatally wounding him. At the sounds of the gunshots Jimmy opens fire with his machine gun after a civilian shot him in his bullet proof vest - you see a teenager sprint across the street and jump on Jimmy's back, Jimmy manages to throw him off through a shop window.\n\nYour companions emerge from the bank surrounded by several hostages, together you move towards the car. Policemen are running to the scene and despite the hostages they open fire on you all anyway. Two hostages are hit in the legs and suddenly Homer falls, a bullet in his head. The wound looks serious but to your amazement Homer manages to struggle into the getaway car. You all drive out of town.\n\nSitting in the back you count the money and find you have stolen $28,000, making your share $5,400. Homer's wound is bleeding a lot but turns out to be little more than a flesh wound. After some quick discussion you agree it is best if you all split up, John is going to hide out with friends in Chicago, Jimmy and John Chase are going to rent an apartment just outside Chicago while Homer is driving down to St Paul to lie low. You need to choose who to accompany.", "action_results": [{"action": "Hide out in Chicago with John", "result": "You go with John to Chicago where you lie low at the apartment of some lady friends of his for a few weeks. In the newspapers you read about how Jimmy and John Chase shoot two policemen and evade capture outside town. John talks about a major train robbery he is thinking of pulling off before fleeing to South America, you like the idea.\n\nAfter three weeks in hiding you both go to check out at a movie at the Biograph Theatre called Manhattan Melodrama with John's two lady friends. The movie is a good one, featuring Clark Gable as a petty criminal turned killer called Blakie. At the end of the movie he is executed for a murder and says \"Die the way you live, all of a sudden. Don't drag it out, living like that doesn't mean a thing.\"\n\nAfter the movie ends John turns to you and says quietly \"It is time to go.\"\n\nThe two of you, together with your lady companions, all stand up and walk out of the cinema. As you walk down the street you notice men in suits walking rapidly towards you from the right, glancing back you see three more men in suits walking quickly up behind you. They can only be FBI Agents. John has seen them too: he slips his hand in his pocket for his pistol and at the same time steps forward to run towards an alley that opens up just ahead of you to the left.", "action_results": [{"action": "Go for your gun", "result": "You reach into your pocket for your pistol, as you do the three FBI Agents behind you open fire with your own guns. You and John are both hit several times, staggering forward you make it to the mouth of the alley before collapsing dead in the street, your gun in your hand. John dies at your side: two legendary outlaws finally cut down in one last blaze of gunfire...", "action_results": [null]}, {"action": "Run for the alley", "result": "You concentrate on running and break ahead of John as pistol shots ring out behind you. The Agents are focusing on shooting John, giving you the precious few seconds you need to make it to the alley and race down it. Luck is on your side: there is an open side door to the Biograph Cinema immediately on your left. You dart through it and slam it shut, as you do your last sight is John collapsing dead to the ground at the mouth of the alley.\n\nYou race through the cinema, fists pounding on the locked door behind you: the Biograph has an opening onto two different streets and you race through to the one that opens into the street on the other side of the building from the first exit you used. Hailing a passing taxi you order the driver to take you downtown as fast as possible.\n\nJohn Dillinger is dead and you are now the most hunted man in America: you have no choice but to hide out with Jimmy.", "action_results": [{"action": "Your last gunfight", "result": "You hide out with Jimmy, known throughout America now as Baby Face Nelson, and his loyal friend John Paul Chase for the autumn months, moving from one campsite to another. Finally at the end of November you all decide to seek shelter with a friend of Jimmy's in Wisconsin. You drive up to his home and are startled when a man in a suit comes out to meet you.\n\n\"Is Eddie here?\" Jimmy asks him.\n\n\"No,\" the man replies. \"He went downtown to do some shopping.\"\n\n\"Thank you,\" Jimmy replies, reverses the car and drives away. As you drive down the road Jimmy glances at you.\n\n\"Sure as hell that was a G man and we caught him with his pants down,\" Jimmy says with a grim smile. You continue to drive south, crossing the state border into Illinois. As you do you notice a car with two men in it pass you, make a U turn and follow you. Nelson frowns.\n\n\"What the hell is this?\" he demands. \"Let's see who those birds are.\"\n\nJimmy pulls two U turns of his own to put you all behind the car with the two men in it, accelerating he pulls alongside.\n\n\"Pull over,\" Jimmy yells.\n\nIn response the other car accelerates ahead.\n\n\"Let them have it,\" Jimmy shouts to you and John.\n\nSuddenly one of the men in the other car begins firing pistol shots back at your car. Startled you and John return fire with automatic rifles, the other car accelerates even more and quickly surges ahead out of sight. Your car is slowing down: one of the shots fired at your car has hit the motor. Suddenly a second car passing you in the other lane, again with two men in it pulls a U-Turn and begins following you. Cursing Jimmy pulls his car to the right and brakes, the other car brakes sharply ahead of you on the other side of the road.\n\nYou, Jimmy and John all jump out of your car and open fire with automatic rifles and machine guns on the two men in the other car. You can see one of the men is armed towards a machine gun, moving towards the back of the car, and the other man is armed with a shotgun as he moves towards the front of the car. You and John fire at them both.\n\nAt that moment Jimmy does something incredible: leaving the shelter of your own car which you have all been using as cover he begins to stride directly across the road, advancing in plain sight on the two rival gunmen who are almost certainly FBI Agents.", "action_results": [{"action": "Follow Jimmy", "result": "You follow Jimmy out from cover and advance on the other lawmen. The man with the machine gun runs out from behind the car, shooting several bullets into your chest. Wincing but still standing you shoot him twice in the chest, fatally wounding him. The other man races from around the front of the car and fires a shotgun blast into your legs. Somehow you remain standing and as the lawman throws aside his shotgun and draws a pistol you raise your machine gun and shoot him once in the head. He falls dead to the ground.\n\nBoth of your opponents are down but you have been fatally wounded: Jimmy is lying motionless on the road, dead as well. You sink to the ground as John Chase stops firing and runs over but it is too late. As you stare up at the sky you succumb to your wounds, slain in this last great gunfight that has brought a dramatic end to your remarkable career.", "action_results": [null]}, {"action": "Cover him from behind your own car", "result": "You watch in amazement as Jimmy strides towards the two FBI Agents. One of them runs from the back of the car and fires several shots into Jimmy chest with his machine gun, Jimmy shoots him twice in return, fatally wounding him. The second Agent runs ahead of the car and fires a shotgun blast into Jimmy's legs. Jimmy sways but doesn't fall and as the FBI man throws aside his shotgun and draws a pistol Jimmy shoots him in the head with his machine gun killing him.\n\nJimmy staggers on to the FBI car and climbs in. You and John run forward and jump into the car as well, driving away from the two dead lawmen you have left at the scene. You can tell from looking at him that Jimmy is fatally wounded, you manage to get him to the safe house of some friend of his and lie him on the bed but it is too late.\n\n\"It's getting dark,\" Jimmy rasps to you. \"I can't see you anymore.\"\n\nMinutes later Jimmy dies. You and John make arrangements for the body to be dumped someplace where it can be found and discuss what to do. John has had enough of all this shooting: he has seen the other six members of the Dillinger Gang die now and though the newest recruit he has no wish to share their fate.\n\n\"I'm going back to California to surrender,\" he tells you.\n\nYou consider your options: Cuba doesn't seem like a bad idea...", "action_results": [{"action": "Go back to California with John to surrender", "result": "You and John drive back to California to surrender, John gets in touch with local law officers to arrange an arrest. In the last days of 1934, after a year and a half of running, you and John arrange to meet law officers in a peaceful park. Unarmed you are both peacefully taken into custody, the last of the Dillinger Gang. You can expect a very long prison sentence...", "action_results": [null]}, {"action": "Flee to Cuba", "result": "Surrender is not for you and you part ways with John: him heading west and you heading east. While he is surrendering in California you are taking a boat out of America: you make it to Cuba where you purchase a small house at Varadero Beach. There you can live peacefully after your years of robberies and danger, the last of the Dillinger Gang.\n\nYou have done it. You have fought the law and won.", "action_results": [null]}]}]}]}]}, {"action": "Hide out near Chicago with Jimmy and John", "result": "You go with Jimmy and John Chase to hide out in a small cabin in a wooded area outside Chicago. You manage to stay hidden for a few weeks until one night the three of you are standing around talking when suddenly a police car pulls down the drive, stops and a police officer gets out. You all tense.\n\n\"What's the trouble here?\" the policeman asks.\n\n\"No trouble at all,\" you call back to him.\n\nJimmy raises his machine gun.", "action_results": [{"action": "Open fire on the cops", "result": "You fire a blast of bullets at the policemen, hitting both of them. With the two lawmen down you, Jimmy and John hastily run to John's car, jump in and drive away. You quickly flee the Chicago area and it is a good thing that you do: a week later you are stunned to read in newspapers that your friend John Dillinger was shot dead by FBI Agents while leaving a cinema with two friends in Chicago. A month later Homer Van Meter is tracked down and killed to.\n\nYou are now the most wanted man in America.", "action_results": [null]}, {"action": "Leave it to Jimmy", "result": "Jimmy fires a blast of bullets at the policemen, hitting both of them. With the two lawmen down you, Jimmy and John hastily run to John's car, jump in and drive away. You quickly flee the Chicago area and it is a good thing that you do: a week later you are stunned to read in newspapers that your friend John Dillinger was shot dead by FBI Agents while leaving a cinema with two friends in Chicago. A month later Homer Van Meter is tracked down and killed to.\n\nYou are now the most wanted man in America.", "action_results": [null]}]}, {"action": "Hide out in St Paul with Homer", "result": "You and Homer go to hide out in an apartment in St Paul, leaving only to buy food and newspapers. One morning you step outside, buy a newspaper and read to your horror that your friend John Dillinger was shot dead by FBI Agents the night before while leaving a cinema with two female companions. You take the news to Homer in shock.\n\nYou are now the most wanted man in America.\n\nAfter John's death you and Homer continue to hide in St Paul, not even trying to make contact with Jimmy. One afternoon you and Homer go to meet a friend of Homer's in a car dealership in St Paul. Going inside the car dealership you find the building completely deserted. Sensing trouble you both leave the building to find yourself confronted by four policemen.\n\n\"Stick them up!\" one of the officers yells.\n\nYou and Homer immediately draw your pistols and fire at the policemen, prompting them to scatter for cover. The two of you sprint down the street, the lawmen initially firing you but then giving chase, fearful of accidentally shooting other people on the street. There is an alley to your left and Homer darts down it.", "action_results": [{"action": "Follow Homer down the alleyway", "result": "You follow Homer down the alleyway but you are both out of luck: it is a dead end. As you turn you find the four lawmen blocking the entrance of the alley, before you can react they all open fire on you. Homer is blasted off his feet by a shotgun blast, you are shot several times through the chest and riddled with bullets as you raise your pistol. You both collapse to the ground and die, cut down in one final gunfight.\n\nJimmy is killed three months later, bringing an end to the Dillinger Gang.", "action_results": [null]}, {"action": "Keep running", "result": "You ignore Homer and keep running, reaching the corner of the street and racing around it. Homer has run into a dead-end alley and the fact that he is trapped distracts all four of your pursuers: they fire more than fifty bullets into his body. You make it down the street, hijack a passing car and make your escape from St Paul.\n\nYou are now the most wanted man in America and have no choice but to hide out with Jimmy.", "action_results": [null]}]}]}, {"action": "Leave him to Homer", "result": "Homer raises his rifle and fire a single shot into the policeman's chest, fatally wounding him. At the sounds of the gunshots Jimmy opens fire with his machine gun after a civilian shot him in his bullet proof vest - you see a teenager sprint across the street and jump on Jimmy's back, Jimmy manages to throw him off through a shop window.\n\nYour companions emerge from the bank surrounded by several hostages, together you move towards the car. Policemen are running to the scene and despite the hostages they open fire on you all anyway. Two hostages are hit in the legs and suddenly Homer falls, a bullet in his head. The wound looks serious but to your amazement Homer manages to struggle into the getaway car. You all drive out of town.\n\nSitting in the back you count the money and find you have stolen $28,000, making your share $5,400. Homer's wound is bleeding a lot but turns out to be little more than a flesh wound. After some quick discussion you agree it is best if you all split up, John is going to hide out with friends in Chicago, Jimmy and John Chase are going to rent an apartment just outside Chicago while Homer is driving down to St Paul to lie low. You need to choose who to accompany.", "action_results": [null, null, null]}]}]}, {"action": "Stay in the car", "result": "\"I know you bastards are wearing bulletproof vests,\" Jimmy declares. \"So I'll give it to you high and low.\"\n\nYou watch as he raises his pistol and opens fire.\n\nHis first shot grazes the driver in the head, panicking he throws open the car's passenger door and tumbles out onto the ground, the men in the back seat doing likewise. They both spring to their feet to run and Jimmy opens up on them too, hitting one of the men in the neck and the other man in the back. The men in the car behind you start running and Jimmy turns and fires at them too.\n\nYou and Jimmy jump into the FBI car and drive away. Behind you one of the FBI Agents fires his pistol at you but misses. As you drive away you notice another car full of FBI Agents driving towards you - finding a flashlight under the dashboard you click it on and shine the light full in the face of the approaching car, temporarily blinding the people inside until you safely pass.\n\nYou and Jimmy escape from Wisconsin after a series of difficult adventures and it takes you two months to reunite with the rest of the gang: in that time Red and Tommy are both killed by lawmen in separate gun battles and only your friends John and Homer are left. It is a very depleted gang that arranges a rendezvous in Indiana at the end of June.", "action_results": [null]}]}, {"action": "Follow John, Homer, Red and Tommy out the back window", "result": "You join the others in running towards the back window - as you do you hear a voice yell \"Police! Stop!\" John fires a burst of machine gun bullets out of the window and jumps back as a lawman outside fires three blasts from a shotgun in return. Glancing cautiously outside John sees the coast is clear and one by one you all quickly jump out of the window. Landing on a pile of snow you race through the trees, down a flight of steps that lead down to a beach on the edge of a Lake.\n\nThere the party splits: John, Red and Homer run right while Tommy runs left. You need to decide who to follow.", "action_results": [{"action": "Run right after John, Red and Homer", "result": "You follow John, Red and Homer and race down the beach and through trees before reaching a house where you force the owner to surrender the keys of his car. Driving through the night you head south towards St Paul - the next morning you are just approaching St Paul when suddenly men in a car behind you open fire on your car with machine guns, missing. They are police who recognized your car from stolen car reports.\n\nHomer is at the wheel and immediately guns down the accelerator while John leans out of a side window and fires back at the car of the lawmen with a machine gun. You are sitting in the other passenger seat while Red is in the middle seat, John yells for you to lean out of the window and fire at the lawmen as well.", "action_results": [{"action": "Lean out of the other window and fire at them too.", "result": "You smash out your window, lean out and fire with your pistol at the pursuing police car. Suddenly Red yells, a bullet has passed through the car and hit him in the back. Homer manages to lose the cops after a curve by pulling right down a road, braking and waiting for the lawmen to shoot past and then reversing back out onto the road and driving back the way you came.\n\nYou seek assistance from fellow criminals in St Paul but there is nothing you can do for Red: his wound is mortal. For three days he lingers in great agony before dying from his wound: you, John and Homer bury your friend in an unmarked grave. Sadness and anger in your hearts you reunite with Tommy in St Paul (there is no sign of Jimmy although he definitely escaped Little Bohemia Lodge, killing an FBI Agent in the process) and plan another bank robbery.", "action_results": [{"action": "Another Bank Job", "result": "One spring afternoon the four of you drive into the little town of Fostoria, Ohio where Tommy stays in the car while you, John and Homer stride into the bank. You all pull machine guns out from under your coats.\n\n\"Stick them up,\" Homer yells. The staff raise their arms, one of the female tellers starts to cry.\n\n\"Don't kill me,\" she pleads to Homer.\n\n\"You be quiet and I won't,\" he tells her.\n\nWhile John empties the vault you and Homer remain in the lobby, watching the customers. As you do a policeman suddenly bursts through the bank's front doors, a pistol in his hand.\n\n\"Shoot him,\" Homer yells, raising his own gun.", "action_results": [{"action": "Shoot the policeman", "result": "You raise your machine gun and fire a single shot, hitting the policeman in the chest. He staggers back out of the bank's doors. John is soon finished and the pair of you sprint out of the bank and into the car, which Tommy has parked just outside. Roaring out of town you find you have stolen $17,000, of which your share is $4,200.\n\nYou all talk and decide it would be a good idea to split up again, you still have no idea where Jimmy is and you are all the most wanted men in the country. John and Homer have the bright idea of buying a truck in Chicago and living in the back of that while Tommy plans to go to lie low in little towns in Iowa. You need to choose who to accompany.", "action_results": [{"action": "Go with John and Homer to hide out in Chicago", "result": "You, John and Homer head to Chicago where you buy a red truck, put mattresses in the back and essentially live in it for a month. In the evenings you sit in the large cabin at the front and talk: it's not much of a way to live but at least it is keeping you alive. One evening you are sitting in the front of the truck talking when a police car pulls up alongside you with two men in it. One of them orders you all out of the truck.\n\nHomer picks up a machine gun.", "action_results": [{"action": "Join Homer in opening fire at the cops", "result": "Before Homer can react you raise your machine gun and fire twenty bullets into the police car, hitting both policemen several times and killing them. You promptly drive away from the scene of the crime and flee Chicago. You continue to drive around on the run, hearing on the radio that Tommy was recognized by lawmen in Iowa and killed in a gunfight. With the gang dwindling you reluctantly re-establish contact with Jimmy and arrange a rendezvous in Indiana.", "action_results": [null]}, {"action": "Sit tight", "result": "As you watch Homer raises his machine gun and fires twenty bullets into the police car, hitting both policemen several times and killing them. You promptly drive away from the scene of the crime and flee Chicago. You continue to drive around on the run, hearing on the radio that Tommy was recognized by lawmen in Iowa and killed in a gunfight. With the gang dwindling you reluctantly re-establish contact with Jimmy and arrange a rendezvous in Indiana.", "action_results": [null]}]}, {"action": "Go with Tommy to hide out in Iowa", "result": "You and Tommy drive up to the little town of Waterloo in Iowa and lie low for a month, reading in newspapers that John and Homer killed two policemen in Chicago and escaped after yet another gunfight. One afternoon you and Tommy are walking towards your car to go for a drive when two men suddenly approach you.\n\n\"Hey, just a minute,\" one of them calls. \"Who are you?\"\n\n\"Who are you?\" Tommy replies.\n\n\"Police officers,\" one of the men says.", "action_results": [{"action": "Go for your gun", "result": "You reach for your pistol in your pocket but the second policeman already has his drawn - raising it he shoots you in the chest. You fall backwards to the ground, a moment later Tommy is shot as well. You die on the sidewalk, Tommy an hour later. In time the rest of the Dillinger Gang will be killed as well but your crimes have already been enough to make your name infamous long after you are gone.", "action_results": [null]}, {"action": "Run", "result": "Without hesitation you turn and dart left down an alleyway - because Tommy actually has his pistol in his hand he is the bigger threat now: one of the detectives shoots him and fatally wounds him. You hear the gunshot and the yell of one of the lawmen for you to halt but you make it to the end of the alley and race around the corner a second before the lawman fires after you. Emerging onto a busy road you quickly flag down a passing car, jump inside and taking the driver hostage you order him to get you out of Iowa.\n\nYou make your escape, heart pounding, and drive down to Indiana to meet up with the rest of the gang.", "action_results": [null]}]}]}, {"action": "Let Homer deal with him", "result": "Homer raises his machine gun and fires a single shot, hitting the policeman in the chest. He staggers back out of the bank's doors. John is soon finished and the pair of you sprint out of the bank and into the car, which Tommy has parked just outside. Roaring out of town you find you have stolen $17,000, of which your share is $4,200.\n\nYou all talk and decide it would be a good idea to split up again, you still have no idea where Jimmy is and you are all the most wanted men in the country. John and Homer have the bright idea of buying a truck in Chicago and living in the back of that while Tommy plans to go to lie low in little towns in Iowa. You need to choose who to accompany.", "action_results": [null, null]}]}]}, {"action": "Stay in your seat", "result": "You remain in your seat but it is a fateful decision: bullets fired by the pursuing lawmen punch through the rear of the car. One hits Red in the back, a moment later one hits you in the back of the head, killing you instantly. Perhaps you are the more fortunate one: Red lingers for days in agony before dying of his wound. In time all the members of the Dillinger Gang will be killed by lawmen, though your crimes will at least ensure your name remains infamous after you are gone.", "action_results": [null]}]}, {"action": "Run left after Tommy", "result": "You and Tommy run left, stumbling through the woods for an hour before reaching a house where you steal a car and drive to St Paul. You reach safety ahead of the rest of the Gang and learn that John, Red and Homer were in another high-speed gunfight while driving into St Paul during which Red was hit and killed. Jimmy also managed to escape Little Bohemia Lodge, killing an FBI Agent in the process. You manage to reunite with John and Homer in St Paul, both are in a grim mood after seeing your friend Red die and having to bury him. The four of you quickly plan another bank robbery.", "action_results": [null]}]}]}]}, {"action": "Let Jimmy do it", "result": "You remain in the car staring at the dashboard while Jimmy gets out of the car and walks away. There is silence for a second then a gunshot, a pause and several more gunshots. After that you hear the sound of a body being dragged along the ground as Jimmy drops Fritsch's corpse down the mine shaft then he and John Chase get back in the car and you all drive away.\n\nFor most of the next month you remain around Reno, Nevada and read about the search for you and your friends. At the start of April John and Homer escape St Paul after a shootout with FBI Agents, days later Eddie is killed in the same area. Eddie's death is the trigger that prompts you and the rest of the gang to reunite in the second half of April.", "action_results": [null]}]}, {"action": "Hide out with John and Homer in St Paul", "result": "You, Homer and John go to St Paul where you rent an apartment with John. The weeks after the Mason City Robbery initially pass quietly but one morning you are disturbed by a knock on the door.\n\n\"This is Henry Cummings, St Pauls Police,\" a voice calls out. \"Is Carl Hellman there?\"\n\nCarl Hellman is the name you used to book the apartments.\n\n\"He's just left and won't be back till this afternoon,\" you tell the man as John springs to his feet. \"Come back then.\"\n\n\"We'll talk to you then,\" the policeman on the other side of the door says.\n\n\"I'm not dressed,\" you reply.\n\n\"We'll wait until you dress.\"\n\n\"It's the cops,\" you tell John quietly. John nods, he has already fetched his machine gun from the wardrobe. Suddenly you hear the pop-pop-pop of pistol shots outside. Without hesitation John raises his machine gun and fires a burst of bullets through the door, throws it open and fires down the corridor. A policeman sheltering in a doorway fires back, one of his shots hits John's leg making him wince. The two of you flee down the corridor and stairs, out the back door and jump in your car. John's wound is painful but not dangerous.\n\nYou later learn the gunshots you heard outside was Homer who encountered FBI Agents as he entered the building to visit you, recognized them as lawman and opened fire. Apart from John no one else was hit in the gunfight but a few days later Eddie is ambushed and killed by FBI Agents. His death saddens you and prompts the remainder of the gang to reunite in the second half of April.", "action_results": [null]}, {"action": "Hide out with Eddie in Indianapolis", "result": "You and Eddie hide out in Indianapolis for a few weeks until you get word that John and Homer were approached by FBI Agents at John's apartment and fled town after a gunfight. Much of Homer's stuff is still at his apartment but he doesn't dare go back for it in case the FBI is watching it, Eddie decides to pay a woman he knows to go to the apartment, collect up all the stuff and then drop by her apartment to pick it up. You are nervous about the idea but Eddie asks you to accompany him.", "action_results": [{"action": "Go with Eddie to pick up Homer's stuff in St Paul", "result": "You go with Eddie to his friend's apartment, park the car and walk up the drive to the door. As you approach the door opens, the woman inside shoves a suitcase out to Eddie and closes the door without a word. Exchanging glances the two of you turn and start walking back to your car.\n\nAt that point the kitchen window next to the door behind you explodes in a hail of machine gun fire. There is a burst of light as you are hit in the back of the head by a bullet and killed instantly. Eddie is not so lucky, hit in the head too he will linger for three days in great agony. You die on the sidewalk, slain by the FBI Agents waiting in ambush.", "action_results": [null]}, {"action": "Stay in Indianapolis", "result": "It is a good thing you do not go with Eddie to St Paul, when he doesn't return you get nervous and clear out of Indianapolis. The next day you read how Eddie was ambushed and killed by waiting FBI Agents, you were lucky not to share the same fate. Unnerved by your narrow escape you arrange a reunion with the rest of the Gang in the second half of the month.", "action_results": [null]}]}, {"action": "Hide out with Red and Tommy in Chicago", "result": "You hide out with Red and Tommy in Chicago and have a peaceful month, unlike your friends. You read in newspapers how John and Homer shoot their way out of an FBI ambush in St Paul, a short time later Eddie is killed in a second FBI ambush. With Jimmy back from Nevada and John and Homer in Chicago you decide it is time for another reunion.", "action_results": [null]}]}, {"action": "Leave it to someone else", "result": "You ignore Eddie and watch as Red fires a burst of bullets at the gun case, most hitting the bulletproof glass but one goes through the narrow gun port and grazes the side of the guard's head. At that moment you hear a burst of machine gun fire outside. Leaving Eddie and Homer to control the lobby while Red deals with the vault you hurry outside. John is immediately outside the doors surrounded by hostages but Jimmy is further down the street, firing his machine gun wildly and laughing. You watch as he shoots an unarmed old man in the leg, knocking him to the ground. You jog over.\n\n\"I thought you were a cop you son of a bitch,\" Jimmy yells at him.\n\n\"I'm not a cop,\" the man moans.\n\n\"Did you have to do that?\" you ask Jimmy wearily.\n\n\"I thought he was a cop,\" Jimmy snaps at you.\n\nYou turn around as a gunshot rings out: a man firing from a window has clipped John in the shoulder. You and John fire your pistols at the window and the man inside jumps back. John shouts to those in the bank that you're all leaving a moment later Red, Eddie and Homer come jogging out. As they do the man in the window fires again, this time grazing Red's shoulder.\n\nSurrounded by hostages you all pile into the car and drive out of town surrounded by hostages. You are all in a bad mood, John and Red's wounds are painful but not serious and you had to leave before you could get all the money. Even so you discover that you have stolen $52,000, making your share $7,400.\n\nYour latest bank robbery has made you all the most wanted criminals in America and it is agreed that you should all split up. Jimmy and his friend John Chase are going out to Reno, Nevada, about Jimmy has been recruited by the Mob to kill an informer. John and Homer are going to St Paul, Minnesota to rent apartments, Eddie is going to Indianapolis, Indiana to lie low and Red and Tommy plan to hide out in Chicago, Illinois. You will have to hide out with until the heat wears off.", "action_results": [null, null, null, null]}]}, {"action": "Ignore Jimmy", "result": "You ignore Jimmy and a moment later he fires a burst of bullets through the bank window, hitting the cop several times. As the policeman falls to the floor Nelson laughs.\n\n\"I got one,\" he yells. \"I got one!\"\n\nMoments later John and Homer are finished in the vault and hurrying outside surrounded by hostages you all scramble into the car. A few stray shots are fired at you, Jimmy fires bursts from his machine gun in reply. On the drive out of town you count the money and find you have stolen $46,000, making your share $6,500.\n\nA week later you all drive into Mason City, Iowa for your next bank job. Tommy stays in the car and Jimmy and John guard the doors while you lead Homer, Eddie and Tommy into the large First National Bank. Upon entering Eddie fires a burst of bullets from his machine gun into the ceiling.\n\n\"Hands up! Hands up!\" you shout. \"Everybody on the floor!\"\n\nHomer strides towards the counter, one of the teller runs from the counter into an office and tries to slams the door. Homer fires a burst of bullets through the thin wooden door and you hear a shout of pain. Suddenly there is a strange whumping noise and something hits Eddie in the back. It is a tear gas canister and it quickly begins leaking out clouds of gas.\n\nLooking up you see a blue-uniformed guard sitting in a cage lined with bulletproof glass, he has just fired the tear gas through a narrow gun slit and is hastily trying to reload the tear gas gun.\n\n\"Get that son of a bitch with the tear gas!\" Eddie yells at you, rubbing his back angrily.", "action_results": [null, null]}]}]}, {"action": "Hang back", "result": "You watch as Jimmy shoots the man twice in the chest and he falls to the ground. A woman screams, jumps out of the car and runs to his side.\n\n\"You've killed him,\" she wails.\n\n\"Keep your damned mouth shut or I'll let you have it too,\" Jimmy snarls at her. You both jump back inside your car and speed off back to the hideout. The next day you prepare to set off with the gang to rob the Sioux Falls Bank.", "action_results": [null]}]}, null]}]}, {"action": "Surrender", "result": "Unwilling to take the risk you raise your hands and surrender to the FBI Agents. You and Chuck are taken into custody and tell the FBI exactly nothing but it does you no good: identified as participants in the Grand Haven and Brainerd Bank Robberies you both receive lengthy prison sentences. When John is arrested the following month you are transferred to Crown Point Prison in Indiana to be interviewed - in prison you are reunited with John.\n\nJohn does not intend to stay in prison however...", "action_results": [{"action": "John's greatest trick", "result": "One morning a civilian cleaner comes in to clean the cells when John, brandishing a wooden gun, jumps forwards and takes him prisoner. Using the cleaner to summon four guards from the guardroom outside the cell block one by one you and John take them all prisoner and lock them in the cells. Once that is accomplished you take one of the guards hostage and order him in front of you.\n\n\"I'll be goddamned if I'll help you get out of here,\" he snaps at you. \"Shoot and be goddamned.\"\n\n\"I have everything to gain and nothing to lose,\" John warns him icily. \"You can either be a dead hero or a live coward. You have a wife and baby that you love dearly and would like to see again haven't you?\"\n\nThe guard gives in. Using the guard as a prisoner you go down to the guardroom where you and John arm yourselves with two machine guns. Moving into the jail's kitchen you capture three more guards. One of the guards, a giant of a man, takes one look at your machine gun and declares \"I'll take that thing and shove it up your ass!\"\n\n\"My god Bill,\" your hostage guard exclaims. \"Don't! They mean business.\"\n\nYou quickly disarm your new prisoners and herd them down to the prison's garage where two mechanics are at work. Taking them prisoner you choose a car, pile in with two hostages and drive out of town. John is so happy he stars singing on the way. After dropping your two prisoners off you speed on, elated to be free once again.\n\nThrough Red you arrange a meeting with Homer Van Meter and his gang.", "action_results": [null]}]}]}, {"action": "Head out with Tommy", "result": "You and Tommy go outside, flag down a taxi and order it to take you to a bar. You can't help noticing that as you pull away from the apartment a black car behind you does likewise and everywhere you go the black car, with two men inside, remains steadfastly behind you.\n\n\"Tommy, I think that car is following us,\" you mutter to your companion.\n\n\"Stop the car,\" Tommy orders the taxi driver.\n\nAs the taxi screeches to a halt you both jump out and race around the corner of the street to find yourselves in a dead-end alley. Tommy turns, draws his pistol and trains it on the corner you have just run around. You draw your pistol and follow suit, wondering if you should open fire on the next people to come around the corner.", "action_results": [{"action": "Fire at any pursuers", "result": "As soon as the two lawmen come around the corner, one holding a shotgun and one holding a pistol you open fire, hitting the detective with the shotgun in the head. As he falls to the ground Tommy shoots the other man twice in the arm, making him drop his pistol. The wounded detective cradles his wounded arm and looks at the pair of you. You train your gun on him and watch him while Tommy runs out into the street and stops a pickup truck at gunpoint. Scooping up the wounded and dead lawmens' weapons you run to the truck, join him and drive out of town.\n\nYou flee across the country to St Paul, reading in newspapers along the way that Chuck Fisher was arrested at the apartment in San Antonio but told the police nothing. Finally you re-join Jimmy, Homer and Eddie in St Paul where they are shocked to learn about what has happened. The five of you lie low for the rest of the winter before making plans for new robberies next spring.\n\nHowever that spring you hear how John Dillinger, recently escaped from prison and his friend Red Hamilton want to join forces with the Nelson Gang. A meeting is soon arranged between you all.", "action_results": [null]}, {"action": "Leave the shooting to Tommy", "result": "You wait and do nothing as two lawmen, one holding a shotgun and one holding a pistol, run around the corner. Tommy opens fire at them, shooting the first lawmen in the head and the second in the arm. The wounded lawman drops his pistol and cradles his arm while the dead lawman lies on the ground motionless - while Tommy covers the remaining man with his gun you run out into the street, hijack a pickup truck at gunpoint and the two of you make your escape on it.\n\nYou flee across the country to St Paul, reading in newspapers along the way that Chuck Fisher was arrested at the apartment in San Antonio but told the police nothing. Finally you re-join Jimmy, Homer and Eddie in St Paul where they are shocked to learn about what has happened. The five of you lie low for the rest of the winter before making plans for new robberies next spring.\n\nHowever that spring you hear how John Dillinger, recently escaped from prison and his friend Red Hamilton want to join forces with the Nelson Gang. A meeting is soon arranged between you all.", "action_results": [null]}]}]}, {"action": "Go with Jimmy, Eddie and Homer to St Paul", "result": "You decide to hide out with Jimmy, Homer and Eddie and the four of you check into apartments in St Paul. In December you are joined by Tommy Carroll who fled San Antonio after being tracked down and shooting two lawmen in a gunfight - Chuck Fisher was not so lucky and was arrested at his apartment. You and the other four remaining members of the Nelson Gang agree that you should lie low and wait to pull off more bank robberies next spring.\n\nThe following spring you read how John Dillinger and all his gang have been arrested, happily he soon escapes from prison and together with his friend Red Hamilton want to join forces with the Nelson Gang. A meeting is soon arranged between you all.", "action_results": [null]}]}]}, {"action": "Try fleeing on foot", "result": "You and Earl start running down the street but you don't get far: two policemen sheltering in a doorway who you didn't even know were there burst from cover and crash-tackle you and Earl to the ground. Your gun goes flying and you try to struggle but a pistol is shoved in your face quickly convincing you to stop. You are both taken into custody and within days found guilty of bank robbery.\n\nYou have only been out of prison for five months when you are sent back to Michigan State Penitentiary to serve your time - there you are reunited with your friends Pete Pierpont, Charles Makley, Red Hamilton and Russell Clark.\n\nFortunately John does not intend for you to stay in prison for long...", "action_results": [{"action": "Escape!", "result": "That afternoon you are all working in the prison workshop when you and your friends are handed a box of thread by a guard. Hidden inside the box is several pistols; unseen by the guards you and your companions pull them out and hand them out amongst yourselves until seven you are armed. At a nod to each other you move through the workshop and without morning you quickly take several guards hostage - altogether eleven prisoners are in the plan to escape including you.\n\nThe ambush is going well and forming the guards into a circle around you and have them much you at gunpoint through the prison before using your hostages to force the guards to open the gates to the administration centre. There you capture a further eight clerks and order them all into the vault. Some of the clerks appear to be deliberately going slow and someone yells for someone to shoot them.", "action_results": [{"action": "Shoot one of the civilians in the leg as a warning to the others", "result": "Irritated you raise your pistol and shoot one of the men in the leg. He falls to the floor but it does well in getting the others moving faster, grabbing their wounded colleague under the arms they help drag him into the vault, leaving a trail of blood. With the alarm raised you all run outside and split into two groups, six of the prisoners go one way while you, Harry, Charles, Russell and Red steal a car and start driving to Indianapolis.\n\nReaching Indianapolis you are able to reunite with Harry Copeland, John's friend, and from him you learn that John has been arrested and is being held in Lima Prison. Harry is keen for you to rescue John right away but the others would rather rob a bank in nearby St Mary's, Ohio first to raise some funds. Harry, who doesn't know your companions very well, decides to go and hide out in Chicago for a few months.", "action_results": [{"action": "Join Harry, Charles, Red and Russell in the bank job", "result": "On the chosen day the five of you drive into the little town of St Mary's in Ohio. While you and Russell wait in the car the others walk into the town's bank and quickly rob it. They emerge minutes later having locked the staff in the vault after a straight-forward robbery and you all drive out of town. The take from the bank is $11,000, making your share $2,200.\n\nNine days after the St Mary's Bank Job you are ready to make your raid on Lima Prison to rescue John Dillinger. The plan is for you all to drive to the prison and while Russell waits in the car Harry, Red and Charles will pretend to be lawmen and ask to see John. They will draw their guns, take the lawmen in the little jail hostage and free him. You need to choose which part of the plan you join.", "action_results": [{"action": "Enter the prison with Harry, Red and Charles", "result": "You and your companions drive up to Lima Prison that night and knock on the door. It is opened by a portly and friendly-looking Sheriff.\n\n\"What do you need?\" he asks cheerfully.\n\n\"We're from Michigan City,\" you tell him. \"We want to see John Dillinger.\"\n\n\"Let me see your credentials,\" the Sheriff says.\n\n\"Here's out credentials,\" you say and you and your companions draw your pistols. The Sheriff takes one look and grabs for your gun. Shocked you instinctively squeeze the trigger and shoot him in the chest. The Sheriff falls to the ground, as he does his wife across the room screams.\n\n\"Give us the keys to the cells,\" Harry shouts at her and frightened she fetches the keys for him. You see John standing in a jail cell smiling as Harry gets the keys and hurries up to free him. Next to you the Sheriff lies on the floor gasping.\n\n\"Oh men, why did you have to do this to me?\" he moans. \"My love, I believe I am going to have to leave you,\" he tells his wife. You say nothing and avoid looking at the Sheriff as John grabs his hat and coat and joins the rest of you in hurrying out of the bank. John is elated by the rescue and together you are all swiftly making plans for your next bank job.", "action_results": [{"action": "Your Biggest Bank Job", "result": "One autumn afternoon you all drive into Greencastle, Indiana. While Russell sits in the car you and Charles take up positions at the door while John, Harry and Red go straight into the bank. The robbery unfolds seamlessly, they emerge minutes later clutching sacks bulging with cash. In the drive out of town you count it: $75,000! It is the biggest amount you have ever stolen and each person's share is $12,500.\n\nYou initially flee to Chicago but there is soon some bad news: you and John's friend Harry Copeland is arrested after foolishly getting into a drunken fight. You all decide to clear out of town and with your crimes now making national headlines you decide to rob a bank in Racine, Wisconsin, expecting it to be an easy job.", "action_results": [{"action": "Another Bank Job", "result": "One winter's day you all drive into Racine, leaving Russell in the car and Red at the doors you, John, Harry and Charles stride into the bank. You stride right up to the teller's windows where the man inside is talking on the phone.\n\n\"Stick them up,\" Charles orders.\n\n\"Next window please,\" the man replies tersely without looking up.\n\nCharles raises his pistol and shoots the man in the arm, knocking him off his chair. Moments later a loud alarm siren starts blaring out, you and your companions glance at each other. Leaving you and Charles in the lobby John and Harry run into the vault to begin stealing the contents. As you are standing by the doors a policeman comes wandering through and you grab him. Moments later a second policeman steps through the doors holding a machine gun.\n\n\"Get that cop with the machine gun,\" Harry shouts from over by the vault.", "action_results": [{"action": "Shoot the policeman", "result": "Raising your pistol you shoot the policeman in the hand, while he is stunned you step forward, wrench the machine gun from his grasp and order him to join his companions. Moments later a third policeman wanders in through the doors.\n\n\"Well come right in and join us,\" John calls to him and points his gun at him.\n\nHolding several hostages around you all leave the bank in a close group and move down towards the car. There are some lawmen on the street and Charles opens fire on them with his machine gun twice, prompting them to dive for cover. Reaching the car you all pile inside with two hostages on the running boards.\n\nYou drive out of town, release the hostages and count the money to find you have stolen $25,000, making your share $4,100. The Gang decides after this robbery it is time for you all to lie low and decide to head to Daytona Beach, Florida for the Christmas Vacation, except Red who wants to go to Chicago to look over some banks first. You need to choose who to accompany.", "action_results": [{"action": "Go with Red to Chicago to look at banks", "result": "You and Red drive into Chicago where you spend a few weeks checking out banks in East Chicago for a good target. One morning you are walking down to the garage to get your car where you are startled to see three policemen standing around the car examining it and making notes. As you approach the lawmen turn to face you.\n\n\"Excuse me gentlemen, is this your car?\" one asks.\n\nRed draws his pistol.", "action_results": [{"action": "Open fire on the lawmen", "result": "Drawing your pistol you raise it and shoot one of the lawmen through the chest. As he falls to the ground mortally wounded you and Red open fire on the other two lawmen, who dive for cover. Sprinting out of the garage you hijack a passing car and speed out of town, you don't stop driving until you join the rest of the gang at Daytona Beach.\n\nThat Christmas and New Year you celebrate with barbecues and presents with your friends, clever Harry, reliable Charles, gregarious Russell, absent-minded Red and of course the charismatic John who is the life and soul of the party. You have had a tumultuous but generally successful year, in papers you read that the Baby Face Nelson Gang, who Homer Van Meter has joined, is likewise prospering.\n\nAfter the New Year most of the gang intend to continue their vacation in Tucson, Arizona while John and Red want to rob one of the banks in East Chicago Red has been checking out. It is agreed that the gang will split up and reunite in a few days, you need to choose which half of the gang you will accompany.", "action_results": [{"action": "Rob a bank with John and Red", "result": "Parting from the rest of the gang you and your two companions drive up to the First National Bank and leaving the car unoccupied you all enter the bank.\n\n\"This is a stick-up,\" John calls out, chewing his gum. \"Raise your hands everybody.\"\n\nThe customers and staff raise their hands, one man glancing at a small amount of his money he has left lying on a counter.\n\n\"Go ahead and take your money,\" John tells him. \"We don't want your money, just the bank's.\"\n\nYou guard the door while John watches the hostages and Red empties the safe, one policeman comes through the door and you quickly capture him. Through the window you can see more policemen running to take cover behind cars further down the street.\n\n\"Cops outside,\" you warn John.\n\n\"Don't let those coppers worry you,\" John calls back cheerfully. \"Take your time Red and be sure you get all the dough. We'll take care of them birds on the outside when we get there.\" John grabs the captured policeman by the arm and pushes him in front of him. \"You go first,\" he tells him. \"They might as well shoot you as me. We love you guys anyway.\"\n\nSheltering behind hostages you, John and Red all emerge from the bank and move in a tight scrum towards your escape car, several policemen watching you with their guns trained on you all but not daring to fire. Suddenly one of the policemen sees an opening and fires his pistol several times, hitting John in his bullet-proof vest. For the first time you've known him John loses his temper.\n\n\"I'll get that son of a bitch,\" he snarls and raises his machine gun.", "action_results": [{"action": "Fire at the policeman", "result": "Raising your own machine gun you fire a burst of bullets into the policeman who shot at John, he crumples to the ground dead. There's a moment's pause and then the other six policemen open fire as you, John and Red break from your hostages and sprint towards your getaway car. Red is shot through the stomach and the shoulder and stumbles but keeps running, somehow you all make it to the car and throw yourselves inside. With John at the wheel and windows exploding all around you lurch away from the kerb and speed down the street, turn the corner and escape.\n\nYou have made it away with $25,000, making your share $6,600 but Red is seriously wounded, breathing with a hollow, rasping sound. There is no way he can make a long-distance journey now so it is decided he will stay with friends in Chicago while John drives down and joins the rest of the gang in Tucson. You need to choose who to go with.", "action_results": [{"action": "Help take care of Red in Chicago", "result": "You decide to go with Red to Chicago and help nurse him into health: it is a good thing that you do because just ten days after you split off from him John, Harry, Charles and Russell are all arrested by Tucson Police after they were recognized from wanted posters. With all four of your friends in prison you and Red remain the only two members of the Dillinger Gang still at large.\n\nYou are unsure what to do and as two months pass you focus on helping Red get better until one morning in the newspapers you read incredible news: John has managed to escape prison at Crown Point, Indiana by using a wooden gun to take some twenty people hostage. You and Red are both elated and now your friend has recovered enough to be able to move around you both set off to meet up with John and some new friends.", "action_results": [null]}, {"action": "Drive down to Tucson with John", "result": "You and John join the others in Arizona where you tell them about the bank robbery and what has happened to Red, the others are downcast but not overly-concerned. You all agree you will relax in the city for a month or two and when Red is better you'll all hit some more banks together in the Midwest.\n\nEverything seems to be going well until one evening you and John are heading over to Russell's apartment to see if he wants to join you all for a drink. As you approach the cottage door you notice blood on the step. Turning around you are startled to find yourself facing two lawmen, guns in their hands.\n\n\"Put up those hands or we'll shoot you,\" one of the men threatens.\n\nThis time you get no chance to run. You and John slowly raise your hands. The Tucson Police take you into custody, it later transpires there was a fire at the hotel some of the gang was staying at, a fireman recognized them from wanted pictures and warned the police. In one day you, John, Harry, Charles and Russell are all arrested after brief struggles.\n\nYou and John and transferred to Crown Point, Indiana for trial where you are both suspected of taking part in the East Chicago Bank Robbery ten days before your arrest where a policeman was shot and killed. If convicted you could face the electric chair. You are downcast but John remains upbeat, he has no intention of staying in jail for long...", "action_results": [null]}]}, {"action": "Concentrate on making it to the car", "result": "John fires a burst of bullets into the policeman who shot at him, the lawman crumples to the ground dead. There's a moment's pause and then the other six policemen open fire as you, John and Red break from your hostages and sprint towards your getaway car. Red is shot through the stomach and the shoulder and stumbles but keeps running, somehow you all make it to the car and throw yourselves inside. With John at the wheel and windows exploding all around you lurch away from the kerb and speed down the street, turn the corner and escape.\n\nYou have made it away with $25,000, making your share $6,600 but Red is seriously wounded, breathing with a hollow, rasping sound. There is no way he can make a long-distance journey now so it is decided he will stay with friends in Chicago while John drives down and joins the rest of the gang in Tucson. You need to choose who to go with.", "action_results": [null, null]}]}, {"action": "Continue hiding out with Harry, Charles and Russell", "result": "You and the others all drive down to Tucson and settle yourselves comfortably in that desert town, you are soon joined by a rather shaken John. He pulled off the bank robbery in East Chicago but Red was shot and seriously wounded, John has left him in Chicago to recover. The five of you do your best to enjoy yourselves in the city without him.\n\nEverything seems to be going well until one evening you and John are heading over to Russell's apartment to see if he wants to join you all for a drink. As you approach the cottage door you notice blood on the step. Turning around you are startled to find yourself facing two lawmen, guns in their hands.\n\n\"Put up those hands or we'll shoot you,\" one of the men threatens.\n\nThis time you get no chance to run. You and John slowly raise your hands. The Tucson Police take you into custody, it later transpires there was a fire at the hotel some of the gang was staying at, a fireman recognized them from wanted pictures and warned the police. In one day you, John, Harry, Charles and Russell are all arrested after brief struggles.\n\nYou and John and transferred to Crown Point, Indiana for trial where you are both suspected of taking part in the East Chicago Bank Robbery ten days before your arrest where a policeman was shot and killed. If convicted you could face the electric chair. You are downcast but John remains upbeat, he has no intention of staying in jail for long...", "action_results": [null]}]}, {"action": "Run", "result": "You start running while Red shoots one of the lawmen. The other two dive for cover and both of you sprint out of the garage. Flagging down a passing car you and Red pile in and speed out of town, you don't stop driving until you join the rest of the gang at Daytona Beach.\n\nThat Christmas and New Year you celebrate with barbecues and presents with your friends, clever Harry, reliable Charles, gregarious Russell, absent-minded Red and of course the charismatic John who is the life and soul of the party. You have had a tumultuous but generally successful year, in papers you read that the Baby Face Nelson Gang, who Homer Van Meter has joined, is likewise prospering.\n\nAfter the New Year most of the gang intend to continue their vacation in Tucson, Arizona while John and Red want to rob one of the banks in East Chicago Red has been checking out. It is agreed that the gang will split up and reunite in a few days, you need to choose which half of the gang you will accompany.", "action_results": [null, null]}]}, {"action": "Go with John, Harry, Charles and Russell to Florida for your holidays", "result": "You and the rest of the gang drive down to Daytona Beach where you book several apartments and make yourselves comfortable. Red joins you in the second half of December after killing a policeman in a gunfight in Chicago. You all agree to lie low over the holiday season.\n\nThat Christmas and New Year you celebrate with barbecues and presents with your friends, clever Harry, reliable Charles, gregarious Russell, absent-minded Red and of course the charismatic John who is the life and soul of the party. You have had a tumultuous but generally successful year, in papers you read that the Baby Face Nelson Gang, who Homer Van Meter has joined, is likewise prospering.\n\nAfter the New Year most of the gang intend to continue their vacation in Tucson, Arizona while John and Red want to rob one of the banks in East Chicago Red has been checking out. It is agreed that the gang will split up and reunite in a few days, you need to choose which half of the gang you will accompany.", "action_results": [null, null]}]}, {"action": "Let Charles deal with him", "result": "Charles raises his pistol and shoots shoot the policeman in the hand, while he is stunned you step forward, wrench the machine gun from his grasp and order him to join his companions. Moments later a third policeman wanders in through the doors.\n\n\"Well come right in and join us,\" John calls to him and points his gun at him.\n\nHolding several hostages around you all leave the bank in a close group and move down towards the car. There are some lawmen on the street and Charles opens fire on them with his machine gun twice, prompting them to dive for cover. Reaching the car you all pile inside with two hostages on the running boards.\n\nYou drive out of town, release the hostages and count the money to find you have stolen $25,000, making your share $4,100. The Gang decides after this robbery it is time for you all to lie low and decide to head to Daytona Beach, Florida for the Christmas Vacation, except Red who wants to go to Chicago to look over some banks first. You need to choose who to accompany.", "action_results": [null, null]}]}]}]}, {"action": "Wait in the car with Russell", "result": "You and Russell wait nervously in the car while your companions enter the prison. Moments later there is a shot followed by silence, you and Russell glance at each other nervously. A few minutes late your friends come jogging out of the prison, John is with them! They all pile into the car and you drive off.\n\n\"What happened back there?\" Russell asks.\n\n\"Harry shot the sheriff,\" Charles says shortly.\n\nJohn is elated and his rescue and together you all determine to rob a large bank as soon as possible.", "action_results": [null]}]}, {"action": "Hide out with Harry in Chicago", "result": "You and Harry move to Chicago where you lie low, reading in papers how your friends first busted John out of prison and then pulled off a major bank raid together. You are keen to re-join them but Harry is not so eager, he does not know any of the others and is now drinking more than ever. One night you are drinking in a bar together when Harry gets into a heated argument with a woman. Drunk and irritable he pulls a pistol out of his pocket and threatens her with it.", "action_results": [{"action": "Try to get him to calm down", "result": "You try to intervene but before you can several off-duty policeman, who were also having a drink in the bar, quickly draw their guns and move in to arrest you both. Surrounded there is nothing you can do but curse Harry's stupidity as the two of you are hauled off to jail. Once in custody you are swiftly identified as wanted bank robbers.\n\nYou both refuse to say nothing about your companions, are convicted and both receive long prison terms. Two months later John and the rest of the gang except Red Hamilton are arrested and you are transferred to Crown Point, Indiana where John is being held so you can both be tried on robberies you committed together.\n\nFortunately you and John have no intention of staying in jail...", "action_results": [null]}, {"action": "Leave the bar immediately", "result": "You leave the bar quickly and head home, the next morning you are shocked to read in newspapers that Harry was arrested at the bar by off-duty police officers and identified as a wanted bank robber. You quickly make contact with John, Harry, Charles, Red and Russell and flee Chicago, heading to Racine, Wisconsin to rob another bank.", "action_results": [null]}]}]}, {"action": "Hurry them along without any gunfire", "result": "You ignore the voice but one of the other prisoners raises his pistol and shoots one of the men in the leg. He falls to the floor but it does well in getting the others moving faster, grabbing their wounded colleague under the arms they help drag him into the vault, leaving a trail of blood. With the alarm raised you all run outside and split into two groups, six of the prisoners go one way while you, Harry, Charles, Russell and Red steal a car and start driving to Indianapolis.\n\nReaching Indianapolis you are able to reunite with Harry Copeland, John's friend, and from him you learn that John has been arrested and is being held in Lima Prison. Harry is keen for you to rescue John right away but the others would rather rob a bank in nearby St Mary's, Ohio first to raise some funds. Harry, who doesn't know your companions very well, decides to go and hide out in Chicago for a few months.", "action_results": [null, null]}]}]}]}, {"action": "Stick with John and Harry", "result": "You turn down Homer and go back to Indiana with John and Harry. In the first week of September the three of you drive up to the State Bank in Indianapolis and leave Harry in the car while the pair of you walk into the bank. John casually climbs up on a table and announces that the bank is being robbed. The teller behind the counter is talking on the phone and doesn't even look up.\n\n\"Get away from that damn telephone,\" you snap at him.\n\nFinally the teller looks up to find you pointing a gun at him and quickly puts the phone down. While you hold the two tellers hostage John empties the vault, you both lock the tellers inside the vault and stroll out to the car. As you drive out of town you count the money and find you have stolen $24,000, making our share a cool $8,000.\n\nJohn is delighted and quickly explains his plans - he means to bribe guards at Michigan State Penitentiary to smuggle pistols into boxes of thread for the prison workshops and get word to your friends Pete, Charles, Red and Russell that the breakout is on, after that he's going to head over to Dayton, Ohio to see a girl he's dating. Harry plans to lounge around in a hotel in Indianapolis until John sends word that he needs him.", "action_results": [{"action": "Go with John to smuggle the guns into prison", "result": "You accompany John to Jackson, Michigan where the State Penitentiary that you spend so many unhappy years in is located. John makes contact with some guards who agree to smuggle several loaded pistols he purchased into the prison. Once that is accomplished you both head down to Dayton, Ohio so John can visit a girlfriend of his called Mary Longnaker.\n\nVisiting Mary's apartment you decide to go out on the balcony for a smoke while John shows Mary some photos he took recently. While you are on the balcony you hear a knock on the door. A moment later you hear it opened and two men walk into the room. A second later your blood runs cold as you hear them speak.\n\n\"Stick them up John, we're police officers,\" a voice orders. \"Don't resist John. I'll kill you.\"\n\nA dozen thoughts rush through your head, though you are on the fifteenth floor you wonder if you can climb down onto the balcony below...", "action_results": [{"action": "Try climbing down", "result": "Quickly you throw aside your cigar and swinging your legs over the balcony you carefully lower yourself down, keeping a firm grip on the balcony. Stretching to your full height you can just touch the balcony below with your feet, taking a deep breath you let go of the balcony of Mary's apartment with your hands.\n\nYou feel a rush of fear as your feet slip on the balcony rail below but they slip inwards, you hit the balcony rail with your butt first and bump down into a sitting position on the balcony floor. Though you've painfully bruised your tailbone you don't hesitate but spring up and hurry off the balcony and through the apartment, past a confused looking housewife holding a baby, out the door and hurry down the stairs.\n\nYou flee rapidly out of the apartment and catch a bus out of town, working your way down to Indianapolis where you reunite with Harry four days later. He has already heard of John's arrest and neither of you are sure what to do until that night when ten prisoners used the guns John smuggled into them to escape Michigan State Penitentiary.\n\nYour friends Harry Pierpont, Charles Makley, Red Hamilton and Russell Clark use stolen cars to reach Indianapolis where you and Harry meet with them a few days later. You are thrilled to see your pals again: Harry, cold and clever, Charles, experienced and dependable, Red, absent-minded but loyal and Russell, gregarious and confident, are all thrilled to see you too. They are soon planning a bank robbery in the nearby town of St Mary's Ohio before busting John out of prison. Harry, who doesn't know any of them, turns down taking part in the robbery and instead opts to hide out in Chicago for a month or two.", "action_results": [null, null]}, {"action": "Go inside and surrender", "result": "Cautiously you raise your hands into the air and step off the balcony. The two lawmen, armed with a machine gun and a shotgun, inside are surprised by your sudden appearance but you and John are swiftly taken into custody and transported to the local prison of Lima, Ohio where you are incarcerated and facing charges of bank robbery.\n\nDays later you are pleased to read how ten prisoners used the guns you and John smuggled in to escape Michigan State Pen, amongst them your friends Harry, Charles, Red and Russell. Both you and John are confident that they will be coming to bust you both out of prison and that you won't be in jail for long.", "action_results": [{"action": "Your friends return the favour", "result": "You and John remain in prison for three weeks until one evening there is a knock on the door and three men enter. With a thrill of excitement you recognise your friends Harry, Charles and Red. The Sheriff, a kindly character called Jesse Sarber approaches them.\n\n\"What do you need?\" he asks cheerfully.\n\n\"We're from Michigan City,\" Harry tells him. \"We want to see John Dillinger.\"\n\n\"Let me see your credentials,\" the Sheriff says.\n\n\"Here's out credentials,\" Harry replies, raises a pistol and shoots the Sheriff in the chest. Sarber falls to the ground, as he does his wife across the room screams.\n\n\"Give us the keys to the cells,\" Harry shouts at her and frightened she fetches the keys for him. You and John grin as Harry hurries over, unlocks the cell doors and lets you both out. As you hurry towards the door the Sheriff lies on the floor gasping.\n\n\"Oh men, why did you have to do this to me?\" he moans. \"My love, I believe I am going to have to leave you,\" he tells his wife. You and John exchange glances but say nothing, hurrying out of the door you reach a car where Russell is waiting to drive you all to safety. You and John are elated by the rescue and together you are all swiftly making plans for your next bank job.", "action_results": [null]}]}]}, {"action": "Hide out in Indianapolis with Harry", "result": "You join Harry in Indianapolis where you both live quietly in hotel rooms: one morning you are shocked to read in the papers that John has been arrested by lawmen while visiting his girlfriend in Dayton. Initially you and Harry are unsure what to do but days later ten prisoners use the guns John smuggled into them to escape Michigan State Penitentiary.\n\nYour friends Harry Pierpont, Charles Makley, Red Hamilton and Russell Clark use stolen cars to reach Indianapolis where you and Harry meet with them a few days later. You are thrilled to see your pals again: Harry, cold and clever, Charles, experienced and dependable, Red, absent-minded but loyal and Russell, gregarious and confident, are all thrilled to see you too. They are soon planning a bank robbery in the nearby town of St Mary's Ohio before busting John out of prison. Harry, who doesn't know any of them, turns down taking part in the robbery and instead opts to hide out in Chicago for a month or two.", "action_results": [null, null]}]}]}]}, {"action": "Stay in the apartment with Paul and William", "result": "You decide to stay in the apartment with the youths when John and Harry leave and begin frying some bacon in the kitchen. Barely five minutes after your friends leave there is a knock on the door. You go to answer it and find yourself confronted by four policemen with guns in their hands.\n\n\"Hands up,\" they bark at you.", "action_results": [{"action": "Run", "result": "You take one look and slam the door in the face of the lawmen. While fists drum against the door you race across the kitchen, into the bathroom where you slam and lock the door and you quickly slide the window up. Standing on the toilet you clamber through, legs first, climb down until you are hanging from the window by your finger tips and with a deep breath you let go.\n\nYou fall straight down about fifteen feet, landing in a crouching position in the apartment's parking area and quickly straighten up. You hear the sound of a car engine and glancing back you see John and Harry pulling their car out of their parking spot, racing over you throw open the door and jump in the back.\n\n\"Go, go, go,\" you pant. \"The law are raiding the apartment.\"\n\nJohn steers the car out of the car park and you drive away. You drive to Indiana, hole up in a hotel and the next day you read in the newspapers that both William and Paul were arrested in the apartment and charged with bank robbery. After some discussion the three of you decide to go ahead with your plan to rob the Daleville Bank.\n\nJust two days after the raid you and John stroll into the bank, draw your pistols and train them on the sole bank teller behind the counter.\n\n\"This is a stickup,\" John tells her. \"Get me the money honey.\"\n\nJohn leaps over the counter, strides into the open safe and quickly scoops up the money inside before you both lock the teller inside, stroll outside and jump in the back of Harry's car. As you drive out of town you count the money and find you have gotten away with $3,500, making your share of the money $1,100, not bad for a dishonest day's work.", "action_results": [null]}, {"action": "Surrender", "result": "Slowly you raise your hands into the air. The lawmen pour into the apartment and quickly capture William and Paul, who are still in their beds. The three of you are quickly taken downtown to the local Muncie Jail where you are swiftly identified as three of the men who robbed the New Carlisle Bank, you and your companions resolutely refuse to name John or Harry.\n\nJust two months after leaving prison you are sent back to Michigan State Penitentiary where you are reunited with your friends Pete Pierpont, Charles Makley, Red Hamilton and Russell Clark.\n\nFortunately John does not intend for you all to remain imprisoned for long.", "action_results": [null]}]}]}]}]}